{"task": "rw_115.jsonl", "id": 74075, "text": "Purple Dragon Game Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74076, "text": "Updated & Effective Time: 2021 [1] month [1] day", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74077, "text": "[Foreword] Zilong Game Group and its various related companies (including but not limited to Tianjin Zilong Interactive Entertainment Co., Ltd., Shanghai Zishun Information Technology Co., Ltd., Tianjin Qunyi Technology Co., Ltd., Beijing Ziyu Technology Co., Ltd., etc., the following collective refers to\"Purple Dragon\" or \"We\") has always promised to protect the personal information and privacy security of users (hereinafter collectively referred to as \"user\" or \"you\") of the user's products and services (hereinafter collectively referred to as \"Zilong Service\").", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74078, "text": "When you use Zilong service, we may collect and use your personal information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74079, "text": "We hope to explain to you through the \"Purple Dragon Game Group Privacy Policy\" (hereinafter referred to as \"this policy\") to explain related matters such as the processing rules corresponding to the processing and using your relevant personal information in order to better protect your rights and interests.", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74080, "text": "[Special Tips] This policy is suitable for all the purple dragon services we provided.", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74081, "text": "When you use any single service, you agree to accept the protection of this policy and the protection of specific privacy information policy (hereinafter referred to as \"specific terms\") we set in this single service. In this caseAt the same time, it will be effective for you.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74082, "text": "Users under the age of 14, at the same time, apply this policy and \"Personal Information Protection Rules and Guardian Instructions\" (see Annex I).", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74083, "text": "If the specific terms of specific terms and the terms of the policy have inconsistent agreement, the specific terms shall be subject to specific terms within the scope of the constraints.", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74084, "text": "If a single service we provide is not applicable to this policy, the service will explicitly explicitly eliminate the applicable policy in an appropriate manner.", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74085, "text": "Before using various purple dragon services, please read and understand this policy carefully, especially the terms of the line identification under the thick body/bodies. You should focus on reading and start using it after confirming and agreeing to fully understand and agree.", "label": ["Policy Change", "Important"], "rewrite": "Please read it carefully and understand this policy carefully. After confirming the full understanding and consent, start using it"}
{"task": "rw_115.jsonl", "id": 74086, "text": "If you do not agree with the content of this policy, it may cause Zilong service to be unable to run normally, or to achieve the service effect we are going to achieve, you should immediately stop visiting/use the purple dragon service.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74087, "text": "After reading this policy, if you have any problems with this policy or related matters related to this policy, you can contact us through the feedback channels listed in the chapter of the \"How to contact us\" chapters in this policy, and we will answer you as soon as possible.", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74088, "text": "This policy will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74089, "text": "1. How do we collect and use personal information", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74090, "text": "2. How do we use cookies or similar technologies", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74091, "text": "Third, we may share, transfer and disclose personal information", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74092, "text": "4. How do we store and protect personal information", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74093, "text": "5. How to manage your personal information", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74094, "text": "Six, third -party service", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74095, "text": "7. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74096, "text": "Eight, revise and notice", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74097, "text": "Nine, how to contact us", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74098, "text": "1. How do we collect and use personal information", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74099, "text": "We collect your personal information mainly for you and other users to use Zilong services easier and more satisfied.", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74100, "text": "Zilong's goal is to provide all Internet users with a safe, fun and informative online experience, and this information helps us achieve this goal.", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74101, "text": "(1) We will collect and obtain your personal information through the following channels:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74102, "text": "1. The information you provide.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74103, "text": "(1) When you register the Zilong service account or use the purple dragon service, you provide the information to us;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the information you provided when you register the Zilong service or use the Zilong service"}
{"task": "rw_115.jsonl", "id": 74104, "text": "When you agree to establish a member of the Zilong Game Online Game, you will ask you to provide some personal information. These personal information includes:", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the personal information provided by you when you agree to establish a game member: ① Personal identification information; ② Personal background; ③ Verification information"}
{"task": "rw_115.jsonl", "id": 74105, "text": "①Personal identification information: name, gender, age, date of birth, ID card number (or passport number), telephone number, mailing address, residential address, email address", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74106, "text": "② Personal background: occupation, education level, income status, marriage, family condition.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74107, "text": "③ Verification information: password prompt issues, personal data verification information, etc. to protect user information that is not used and stolen.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74108, "text": "(2) The shared information provided by the third party through the purple dragon service, and the information stored when you use the purple dragon service.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74109, "text": "Please note that if you publish or published the information uploaded or published in the open area where other users can see in the Zilong service, you can disclose your information in response to other people uploaded or published. These information may be collected by othersAnd use it.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "In the information you uploaded or published in the public area, your information is made in the response to others. These information may be collected and used by others"}
{"task": "rw_115.jsonl", "id": 74110, "text": "When you find that others collect or use your information, you can contact us through the feedback channels listed in the chapter of the \"How to contact us\" in this policy.", "label": ["Important", "Edit/Control"], "rewrite": "You can contact us when you find that others are unreasonable or using your information"}
{"task": "rw_115.jsonl", "id": 74111, "text": "2. Your information shared by a third party.", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74112, "text": "That is, third -party provides shared information on your shared information when using Zilong service.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74113, "text": "3. The information we get.", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74114, "text": "When you use Zilong service, we collect, summarize, record log information, location information, and equipment information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74115, "text": "(2) We will collect and use your personal information for the following goals:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74116, "text": "We need to remind you in particular: Since our products and services are more and the content provided for you is different, the relevant business functions (including the types of your personal information) will also be due to the product/service you chooseDifferent content is different. For details, please refer to the actual product/service.", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74117, "text": "In addition, you understand and agree, we want to provide you with a perfect product and service, so we will continue to improve our products and services, which meansWe may often launch new services or business functions or re -divide business functions, and may need to collect new personal information or change personal information use purpose or methods.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74118, "text": "If we want to use your personal information in other uses that have not been stated in this policy or other unprepared personal information, we will obtain youagree.", "label": ["Important", "First Party Collection Information"], "rewrite": "If we want to use your personal information in other uses that have not been stated in this policy or other unprepared personal information, we will obtain youagree"}
{"task": "rw_115.jsonl", "id": 74119, "text": "In the process, you can contact us through the feedback channels listed in the chapter of the \"How to contact us\" in this policy, and we will answer it as soon as possible.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74120, "text": "1. Help you complete the registration and login", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74121, "text": "In order to facilitate us to provide you with continuous and stable services and ensure your security of the purple dragon service, we need you to provide basic registration or login information, including mobile phone numbers, email address addresses, and creating your account, username and password.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We need you to provide basic registration or login information to provide continuous and stable services and ensure the security of services"}
{"task": "rw_115.jsonl", "id": 74122, "text": "In some single services, if you only need to use basic functions such as browsing, search, you do not need to register as a purple dragon user and provide the above information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Use only basic functions such as browsing, search, no need to register as a purple dragon user and provide basic registration or login information"}
{"task": "rw_115.jsonl", "id": 74123, "text": "You can also fill in or supplement your other additional information (your nicknames, avatars, gender, status, vocational qualifications, birth date, hobbies) during the registration, login or subsequent use process.You provide personalized and better service experience, but if you do not provide this information, it will not affect your basic functions of using Zilong service.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect other additional information you fill in or supplement for optimization services"}
{"task": "rw_115.jsonl", "id": 74124, "text": "2. Implement identity authentication", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74125, "text": "In accordance with relevant laws and regulations and regulatory requirements, or in order to meet the needs of user identity, guarantee systems and service security, and other specific service functions, we may need you to provide real identity information (name, ID card, passport, driver's license, hukou, hukou, hukou, hukou, hukou, hukou, hukou, household registration), Biometric information (static or dynamic facial features, fingerprints) and other identity information to complete identity authentication.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may need you to provide real identity information, biometric information and other identity information to complete your identity authentication"}
{"task": "rw_115.jsonl", "id": 74126, "text": "If you do not provide the above information, we will not be able to provide you with related functions and services.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74127, "text": "In order to achieve the purpose of identity certification, you agree and authorize us to provide, inquire, and check your aforementioned identity information with your own or entrusting the third direction of the third direction (personal credit reporting agency, government department, etc.).", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "You agree and authorize that we may provide, query, and check your identity information in the third direction of the relevant identity authentication agencies on their own or entrust the third direction"}
{"task": "rw_115.jsonl", "id": 74128, "text": "Please note that your identity information and biometric information are personal sensitive information. Please provide it with caution. If you refuse to provide you, you may not be able to obtain related services, but do not affect the normal use of other functions and services.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide identity information and biometric information, you may not be able to obtain related services, but do not affect the normal use of other functions and services"}
{"task": "rw_115.jsonl", "id": 74129, "text": "3. Normal operation of maintaining basic functions", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74130, "text": "In the process of using our service, to provide you with basic functions such as browsing and searching, and identify the abnormal status of the account, understand the product adaptability, and ensure the network and operation of the purple dragon service to maintain the normal operation of the aforementioned basic functions.We may collect and indirectly collect and store information about your service and use methods and associate this information. This information includes:", "label": ["Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "We may collect and store information about your service and use the information and associate this information to provide basic functions and ensure network and operation security"}
{"task": "rw_115.jsonl", "id": 74131, "text": "(1) Log Information: When you use our services, we may automatically collect your detailed usage of our services as related online logs.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may automatically collect your detailed use of our service"}
{"task": "rw_115.jsonl", "id": 74132, "text": "Including: your login account, IP address, browser type, telecom operator, network environment, language used, date and time of visit, and web browsing records you visit, Push opening records, length of stay, refresh records, release records , Follow, Subscribe, Favorite and Share.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74133, "text": "(2) Equipment information: We may receive and record the equipment related information you use.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may receive and record the device related information you use"}
{"task": "rw_115.jsonl", "id": 74134, "text": "Including: device models, operating systems and versions, client versions, device resolution, package name, and equipment identifier (Android ID/SN/IDFV/MAC address/IMEI/IMSI), software installation list, software and hardware featuresInformation, device location related information, IP address.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74135, "text": "In order to collect the above-mentioned basic personal device information, we will apply for permission to access your device information. We collect this information to provide you with our basic services and basic functions. If you refuse to provide the above-mentioned permissions, you may not be able to use Zi Dragon Game Services.", "label": ["Permission Acquisition", "Important"], "rewrite": "We will apply for the authority of your device information to collect basic personal equipment information"}
{"task": "rw_115.jsonl", "id": 74136, "text": "Please note that separate equipment information and log information are information that cannot recognize specific natural person status.", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74137, "text": "If we use this type of non -personal information with other information to identify a specific natural person or use it with personal information, during the combination of use, such non -personal information will be regarded as personal information, except for obtaining your authorization.Or in addition to other provisions of laws and regulations, we will anonymous and de -identification processing of this type of personal information.", "label": ["Usage"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74138, "text": "This information will be handled and protected as your personal information during the combination of use.", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74139, "text": "4. Provide you with interaction and release service", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74140, "text": "When you use Zilong service, upload and/or publish information, and provide related interactive behaviors (publishing follow -up, replying to follow -up, top stickers, likes articles, publishing, sharing, collection, rewards), we will collectYou upload, publish or form information, and use your nicknames, avatars and publishing content for display.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "We will collect information you upload, publish or form, and use your nicknames, avatars and publishing content to display"}
{"task": "rw_115.jsonl", "id": 74141, "text": "Please note that the information you posted publicly may include your personal information or personal sensitive information, please consider it carefully before the release.", "label": ["Important", "Edit/Control"], "rewrite": "Care carefully!Whether to publicly share relevant information."}
{"task": "rw_115.jsonl", "id": 74142, "text": "If the information you posted involves the personal information of others, you should obtain the consent of others before the release.", "label": ["Important"], "rewrite": "If the information you posted involves the personal information of others, you should obtain the consent of others before the release."}
{"task": "rw_115.jsonl", "id": 74143, "text": "5. Help you complete the order, pay and deliver the goods or services to you", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74144, "text": "(1) When you order specific products and/or services in Zilong services, we will generate orders for you to purchase the product and/or service for you through the system.", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74145, "text": "In the process of ordering, you need to provide at least the consignee's personal identity information, name, and receiving address (if you need to send physical objects), postal code, consignee, contact phone number, and payment status information.", "label": ["Important", "First Party Collection Information"], "rewrite": "You need to provide the consignee's personal identity information, name, the receiving address (if you need to send physical objects), postal code, consignee, contact phone number, payment status information"}
{"task": "rw_115.jsonl", "id": 74146, "text": "If you refuse to provide such information, we will not be able to complete the relevant delivery service.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74147, "text": "If you order goods or services for others through Zilong service, you need to provide the aforementioned information of the actual orderer.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you order goods or services for others, you need to provide information about the actual ordering person"}
{"task": "rw_115.jsonl", "id": 74148, "text": "Before you provide us with the aforementioned information of the actual ordering person, you need to ensure that you have obtained its authorization consent;", "label": ["Important"], "rewrite": "Before you provide us with information about the actual ordering person, you need to ensure that you have obtained its authorization consent"}
{"task": "rw_115.jsonl", "id": 74149, "text": "(2) To show you the transaction information of the account and ensure the security of the transaction, we will collect the information you generate in the process of using the purple dragon service (including the goods or service information you purchasedUsed to show you and facilitate your management of orders;", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect the information that you generate during the use of Zilong service to show you and facilitate your management"}
{"task": "rw_115.jsonl", "id": 74150, "text": "(3) In order to complete the order payment, delivery of goods or services, confirm the transaction status, and provide you with after -sales and dispute solution services, we will collect the transaction objects, payment institutions, logistics companies, etc. based on the exchanges.Your account, order, transaction, payment, logistics information, or share your transaction information with the above -mentioned service providers.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "We will collect your account number, order, transaction, payment, logistics information related to transaction progress or share your transaction information with relevant service providers"}
{"task": "rw_115.jsonl", "id": 74151, "text": "6. Provide you with customer service or other user response functions", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74152, "text": "When you contact our customer service or use other users to respond to functions (including selling after -sale after -sale application, personal information protection complaints or suggestions, other customer complaints and needs), we may need you to provide the necessary personal informationUser identity to ensure your account and system security.", "label": ["Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "When we provide customer service, we need to collect your necessary personal information to match and verify your user identity, so as to protect your account and system security"}
{"task": "rw_115.jsonl", "id": 74153, "text": "We may also save your contact information (you use us when you contact us or other contact information you provide to us), you have the communication/call records and content with our communication, and other necessary information associated with your needs.In order to contact you or help you solve the problem, or record the processing schemes and results of related issues.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may also save your contact information, communication/call records and content, and other necessary information associated with your needs in order to contact you and solve problems"}
{"task": "rw_115.jsonl", "id": 74154, "text": "7. Your personal information we collected indirectly:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74155, "text": "Based on the purple dragon service you choose to use, we may obtain the relevant information of your authorization sharing from related parties and third -party partners.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may obtain the relevant information you authorize shared from related parties and third -party partners"}
{"task": "rw_115.jsonl", "id": 74156, "text": "When you log in to the Zilong service with the account of the third -party platform, we will obtain the relevant information under the third party account (including: user name, nickname, avatar, specifically your authorization content) based on your authorization), and also shall prevail), and the content of your authorization shall prevail), and it shall prevail.After you agree with this policy, you will bind your third -party account with your Zilong service account so that you can log in directly and use the purple dragon service through a third -party account.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When registering and logging in with a third -party account, access and collect your personal information after your authorization, and bind it."}
{"task": "rw_115.jsonl", "id": 74157, "text": "We will collect and use your information on the premise of complying with relevant laws and regulations and based on the agreement with related parties or third -party partners, and confident the source of information provided.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74158, "text": "8. Provide you with security guarantee", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74159, "text": "In order to improve the security of your service to provide services with our and partners, protect the safety of your or other users or the public from being infringed, and better prevent fishing websites, fraud, network vulnerabilities, computer viruses, network attacks, network invasion, etc.Security risk, more accurately identify the rules of violations of laws and regulations or the relevant agreement rules of Zilong service, we may collect, use or integrate your account information, transaction information, equipment information, log information, and our related companies and partners to obtain you to obtain youAuthorization or information shared by the law to comprehensively judge your account and transaction risk, conduct authentication, test and prevent security incidents, and take necessary records, audit, analysis, and disposal measures in accordance with the law.", "label": ["Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "We may collect, use, or integrate your account information, transaction information, equipment information, log information, and our related companies and partners to obtain information that you authorize or shared according to law to ensure service security, and adopt necessary records in accordance with the law.Audit, analysis, disposal measures"}
{"task": "rw_115.jsonl", "id": 74160, "text": "9. You understand and agree that some single services may require you to turn on specific access permissions in your device to achieve the collection and use of information involved in these permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "Some single services require you to open a specific access right in your device"}
{"task": "rw_115.jsonl", "id": 74161, "text": "include:", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74162, "text": "(1) After you turn on the storage authority, you allow us to access your storage space in order to enable you to download and save the content, or to achieve the corresponding services such as", "label": ["Permission Acquisition", "Important"], "rewrite": "Get the storage permission so that you can download and save the content, or to achieve the corresponding service and other functions through the cache"}
{"task": "rw_115.jsonl", "id": 74163, "text": "(2) After you start the equipment information permissions, you allow us to obtain your device information as the unique identifier of your device to understand the network and operation of the product adaptability, identifying abnormal state, and ensuring the network and operation of Zilong services;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We collect equipment information as the unique identifier of the equipment, understand product adaptability, identify abnormal status, guarantee network and operation security"}
{"task": "rw_115.jsonl", "id": 74164, "text": "(3) After you turn on the album and/or camera (camera) permissions, you can upload, take photos/pictures/videos, and implement functions such as publishing information and reviews, live video, or communicating with customer service to provide proof;", "label": ["Permission Acquisition", "Important"], "rewrite": "Get the authority of the album and/or camera (camera) to realize the functions such as publishing information and comments, live video, or communicating with customer service to provide proof"}
{"task": "rw_115.jsonl", "id": 74165, "text": "(4) After you turn on the power record of the communication, we can get your communication information information in order to provide you with a friend status query, invite your friends to use the purple dragon service, and share the content/product of the people you know;", "label": ["Permission Acquisition", "Important"], "rewrite": "Get the authority of the communication recording to query the status of friends, invite friends to use Zilong service, and share content/products to those who know"}
{"task": "rw_115.jsonl", "id": 74166, "text": "(5) After you turn on the microphone and related voice rights, you can use voice functions to interact with our products, others, or contact customer service;", "label": ["Permission Acquisition", "Important"], "rewrite": "Get the microphone and related voice rights for information interaction, or contact customer service"}
{"task": "rw_115.jsonl", "id": 74167, "text": "(6) After you open the position permissions, we can get your location information so that you can interact with your friends nearby;", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "Get the location permissions so that you can interact with your friends nearby friends"}
{"task": "rw_115.jsonl", "id": 74168, "text": "(7) After you open the permissions that we can read/write to your calendar, we can get your schedule to provide you with functions such as records and reminders.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "Get the permissions of readable/write calendars to provide records, reminders and other functions"}
{"task": "rw_115.jsonl", "id": 74169, "text": "When you need to close these functional authority, most mobile devices will support your needs. For specific methods, please refer to or contact your mobile device service providers or manufacturers.", "label": ["Edit/Control", "Important"], "rewrite": "Most mobile devices support your needs to close these functional permissions"}
{"task": "rw_115.jsonl", "id": 74170, "text": "Please note that when you start the right of power, it means that you authorize us to collect and use relevant information to provide you with corresponding services. Once you turn off the right of authority, it means that you cancel the authorization.Using relevant information, it is impossible to provide you with the service corresponding to the permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "Opening one authority, which means authorized collection and use of relevant information to provide corresponding services, closing any authority representative cancels the authorization, and no longer continues to collect and use relevant information based on the corresponding permissions"}
{"task": "rw_115.jsonl", "id": 74171, "text": "However, your decision to close permissions will not affect the collection and use of information based on your authorization.", "label": ["Permission Acquisition", "Important"], "rewrite": "Closing authority will not affect the collection and use of information based on authorization before"}
{"task": "rw_115.jsonl", "id": 74172, "text": "10. Exception of obtaining authorization consent", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74173, "text": "According to relevant laws and regulations, collecting your information in the following situations does not need to obtain your authorization consent:", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "According to relevant laws and regulations, collecting your information in the following situations does not need to obtain your authorization consent:"}
{"task": "rw_115.jsonl", "id": 74174, "text": "(1) Directly related to national security and national defense security;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Directly related to national security and national defense security"}
{"task": "rw_115.jsonl", "id": 74175, "text": "(2) Directly related to public safety, public health, and major public interests;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Directly related to public safety, public health, and major public interests"}
{"task": "rw_115.jsonl", "id": 74176, "text": "(3) Directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Related to crime investigation, prosecution, trial, and judgment execution"}
{"task": "rw_115.jsonl", "id": 74177, "text": "(4) Out of maintaining major legitimate rights and interests of your or other individuals, but it is difficult to get my consent;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "It is difficult to obtain the major legitimate rights and interests such as maintaining your life, property, etc."}
{"task": "rw_115.jsonl", "id": 74178, "text": "(5) The personal information collected is made by your own public;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The collected personal information is made by your own public to the public"}
{"task": "rw_115.jsonl", "id": 74179, "text": "(6) Signing and fulfilling the contract according to your requirements;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Signing and fulfilling the contract according to your requirements"}
{"task": "rw_115.jsonl", "id": 74180, "text": "(7) Collect personal information from the information disclosed by legal publicly, such as legal news reports, government information disclosure and other channels; and other channels;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect personal information from legal public information, such as legal news reports, government information disclosure and other channels"}
{"task": "rw_115.jsonl", "id": 74181, "text": "(8) Maintaining the safe and stable operation of Zilong services, including the failure of discovery and disposal of products or services;", "label": ["Important", "First Party Collection Information", "Usage", "Risk"], "rewrite": "It is necessary to maintain the safe and stable operation of Zilong service, including discovering and handling product or service failures"}
{"task": "rw_115.jsonl", "id": 74182, "text": "(9) It is necessary to carry out legal news reports;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "It is necessary to carry out legal news reports"}
{"task": "rw_115.jsonl", "id": 74183, "text": "(10) When the statistical or academic research institute is needed for public interests, and provides academic research or description results, the information contained in the result is identified by", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Due to the need to carry out statistics or academic research in public interests and provide academic research or description results, the information contained in the results is identified"}
{"task": "rw_115.jsonl", "id": 74184, "text": "(11) Other circumstances stipulated in laws and regulations.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Other circumstances stipulated in laws and regulations"}
{"task": "rw_115.jsonl", "id": 74185, "text": "11. Tips on personal sensitive information", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74186, "text": "Personal sensitive information refers to personal information once it is leaked, illegally provided or abused that may endanger the safety of people's body and property, which can easily lead to personal information such as personal reputation, physical and mental health damage or discrimination.", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74187, "text": "The above provided by you or we collect your information may include your personal sensitive information, including ID number, personal biometric information (including facial recognition characteristics, sound patterns, etc.), bank account number, communication records and content, property information, property information information, property information, Credit information, trajectory trajectory, accommodation information, health and physiological information, transaction information.", "label": ["Important", "First Party Collection Information"], "rewrite": "You may include your personal sensitive information from you or we collect your information"}
{"task": "rw_115.jsonl", "id": 74188, "text": "Please be careful and pay attention to personal sensitive information. You agree that we can process your personal sensitive information according to the purpose and method described in this policy.", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74189, "text": "2. How do we use cookies or similar technologies", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74190, "text": "On the official website of Zilong Games, in order to log in to the account more conveniently and quickly, we will obtain and use your purple dragon account ID and binding mobile phone number information through cookies or similar technologies.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will obtain and use your purple dragon account ID and binding mobile phone number information through cookies or similar technologies"}
{"task": "rw_115.jsonl", "id": 74191, "text": "You can refuse or manage cookies or similar technologies through a browser or user selection mechanism.", "label": ["Important", "Edit/Control"], "rewrite": "You can refuse or manage Cookies or similar technologies through the browser or user selection mechanism"}
{"task": "rw_115.jsonl", "id": 74192, "text": "Purple Dragon Games do not use cookies or similar technologies to collect your information in the game client.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74193, "text": "Third, we may share, transfer or disclose personal information", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74194, "text": "(1) Sharing", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74195, "text": "We attach great importance to protecting your personal information.", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74196, "text": "Except for the following situations, without your consent, we will not share your personal information with any third party other than Zilong:", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74197, "text": "1., the sharing that we must do to achieve our service/functions.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "To realize the sharing of our service/functions, no need to solicit authorization"}
{"task": "rw_115.jsonl", "id": 74198, "text": "In some cases, we need to share your information from a third party to realize the functions of our products and/or services, so that you use the services you need normally, including: (1) a third -party payment institution providing payment servicesShare the corresponding transaction order information and payment amount information;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We need to share the corresponding transaction order information and payment amount information to the third -party payment institution providing payment services"}
{"task": "rw_115.jsonl", "id": 74199, "text": "(2) Share the information required for real -name authentication service providers;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We need to share the information required for real -name authentication service providers"}
{"task": "rw_115.jsonl", "id": 74200, "text": "(3) Other suppliers, service providers and business partners that are related to our service/functions must be shared.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We need to be necessary to sharing for other suppliers, service providers and business partners related to our service/functions"}
{"task": "rw_115.jsonl", "id": 74201, "text": "；", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74202, "text": "2. Need to share with some of our partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Necessary sharing with some of our partners without asking for authorization"}
{"task": "rw_115.jsonl", "id": 74203, "text": "In order to smoothly carry out the necessary/reasonable business, meet your requirements, fulfill our obligations in relevant user agreements or in this policy, exercise our rights or comply with legal regulations, we may need to share your information from some partners, Including: (1) partners who provide data services (including online advertising monitoring, data statistics, data analysis, etc.) shared log information and equipment information;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We need to share logo information and equipment information to partners who provide data services (including online advertising monitoring, data statistics, data analysis, etc.)"}
{"task": "rw_115.jsonl", "id": 74204, "text": "(2) Partners who provide product analysis services (including application crash analysis, network performance analysis, domain name analysis optimization) sharing statistical data (such as collapse and flashback);", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We need to share the statistical data of your product use (such as collapse and flashing) from partners who provide product analysis services (including application crash analysis, network performance analysis, domain name analysis and optimization)."}
{"task": "rw_115.jsonl", "id": 74205, "text": "(3) Share your relevant information (including: equipment information) to partners who provide marketing services (including advertising and marketing);", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We need to share your information (including: equipment information) to partners who provide marketing services (including advertising and marketing)"}
{"task": "rw_115.jsonl", "id": 74206, "text": "(4) Several people who entrust us to promote us to promote the promotion information or the products they purchased after seeing the information, or provide them with statistical information that cannot recognize their personal identity, helping them understand their audiences to understand their audienceOr customer;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We need to share their promotion to partners who entrust us to promote, or provide statistical information to help them understand their audience or customers"}
{"task": "rw_115.jsonl", "id": 74207, "text": "(5) Need to share other partners with some of our partners.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74208, "text": "；", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74209, "text": "3. Need to share with related parties.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Need to share with related parties, no need to solicit authorization"}
{"task": "rw_115.jsonl", "id": 74210, "text": "In order to facilitate our unified account system to provide you with consistent services and facilitate your unified management, guarantee system and account security, your personal information may make necessary sharing between us and our affiliated parties.", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74211, "text": "Your information collected when you use a purple dragon service may be used to provide you with specific content or show you information related to you in another Zilong service.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The information collected when you use a certain purple dragon service may be used to provide you with a specific content or show you in another purple dragon service"}
{"task": "rw_115.jsonl", "id": 74212, "text": "；", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74213, "text": "4. Realize the other purposes described in the part of this policy \"how we collect and use personal information\";", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The sharing of other purposes described in the part of this policy's first \"how we collect and use personal information\" does not need to solicit authorization"}
{"task": "rw_115.jsonl", "id": 74214, "text": "5. Perform our obligations and rights in this policy or we reached with you;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Perform our obligations in this policy or other agreements with you and the sharing of our rights, and do not need to solicit authorization"}
{"task": "rw_115.jsonl", "id": 74215, "text": "6. Within the scope permitted by laws and regulations, in order to abide by the law, maintain the laws of our affiliated parties or partners, you or other purple dragons users or the public interest, property or security are exempted from damage, such as to prevent fraud and other illegal activitiesAnd reducing credit risk, we may exchange information with other companies and organizations.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may exchange information with other companies and organizations to protect us and our affiliates or partners, you or other purple dragon users or the public interest, property, or security from being damaged"}
{"task": "rw_115.jsonl", "id": 74216, "text": "However, this does not include information that violates the commitments made in this policy and is sold, rented, shared or disclosed in other ways;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74217, "text": "7. In order to be legally needed or with your authorization consent;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74218, "text": "8. Provide your information at the legal requirements of your guardian;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Provide your information at the legal request of your guardian without authorization"}
{"task": "rw_115.jsonl", "id": 74219, "text": "9. According to the single service protocol signed with you (including the electronic protocol signed online and the corresponding platform rules) or other legal documents, it provided;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "According to the single service protocol signed with you (including the electronic agreement signed online and the corresponding platform rules) or other legal documents provided, no authorization is required"}
{"task": "rw_115.jsonl", "id": 74220, "text": "10. Provided based on academic research;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The sharing provided based on academic research does not need to solicit authorization"}
{"task": "rw_115.jsonl", "id": 74221, "text": "11. Provided based on public interests based on laws and regulations.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Provided based on social and public interests in compliance with laws and regulations, without seeking authorization"}
{"task": "rw_115.jsonl", "id": 74222, "text": "We will only share your personal information for legal, correct, necessary, specific, and clear purposes.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only share your personal information for legal, correct, necessary, specific, and clear purposes"}
{"task": "rw_115.jsonl", "id": 74223, "text": "Companies, organizations and individuals who share personal information with us, we will sign a strict confidentiality agreement with them, asking them to process information in accordance with our instructions, this policy, and any other related confidentiality and security measures.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will sign a strict confidentiality agreement with other shared parties, asking them to abide by our instructions and policies"}
{"task": "rw_115.jsonl", "id": 74224, "text": "(2) Transfer", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74225, "text": "1. With the sustainable development of our business, we may have a merger, acquisition, asset transfer or similar transactions, and your information may be transferred as part of such transactions.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If business merger, acquisition, asset transfer and other transactions, continue to protect your personal information in accordance with the standards required by this guideline."}
{"task": "rw_115.jsonl", "id": 74226, "text": "We will ask new companies and organizations holding your personal information to continue to be subject to this policy. Otherwise, we will ask the company and the organization to reconcile your authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will ask new companies and organizations holding your personal information to continue to be subject to this policy, otherwise it will re -solicit authorization consent."}
{"task": "rw_115.jsonl", "id": 74227, "text": "2. After getting your clear consent, we will transfer your personal information to a third party.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After getting your clear consent, we will transfer your personal information to a third party"}
{"task": "rw_115.jsonl", "id": 74228, "text": "(3) Disclosure", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74229, "text": "We will disclose your personal information only under the following circumstances and adopt the premise that the industry standards meet the industry standards:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will disclose your personal information only under the following circumstances and adopt the premise that the industry standards meet the industry standards:"}
{"task": "rw_115.jsonl", "id": 74230, "text": "1. According to your needs, disclose the information you specified under your clear consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "1. According to your needs, disclose the information you specified under your clear consent method"}
{"task": "rw_115.jsonl", "id": 74231, "text": "2. When the requirements of laws and regulations, mandatory administrative law enforcement or judicial requirements must provide your information, we may disclose your information based on the type and disclosure method required.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "2. When the requirements of laws, regulations, mandatory administrative law enforcement or judicial requirements must provide your information, we may disclose your information according to the type and disclosure method required"}
{"task": "rw_115.jsonl", "id": 74232, "text": "Under the premise of compliance with laws and regulations, when we receive a request for the above disclosure information, we ask the receiver to issue corresponding legal documents such as tickets or investigation letters.", "label": ["Important", "Data Security"], "rewrite": "In accordance with the requirements of laws and regulations, mandatory administrative law enforcement or judicial requirements to provide your information, we will ask the receiver to issue a corresponding legal document"}
{"task": "rw_115.jsonl", "id": 74233, "text": "We firmly believe that for the information requested by us, it should be as transparent as much as possible within the scope of law.", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74234, "text": "We have carefully reviewed all the requests to ensure that it has a legal basis and is limited to data obtained by law enforcement agencies because of specific investigations and legitimate rights.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We have carefully reviewed all the requests to ensure that it has a legal basis and is limited to data obtained by law enforcement agencies because of specific investigations and legitimate rights."}
{"task": "rw_115.jsonl", "id": 74235, "text": "(4) Sharing, transfer, and disclosure of information.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74236, "text": "In the following circumstances, sharing, transfer, and disclose your information does not need to obtain your authorization consent in advance:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the following circumstances, sharing, transfer, and disclose your information does not need to obtain your authorization consent in advance:"}
{"task": "rw_115.jsonl", "id": 74237, "text": "1. Directly related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The sharing or disclosure directly related to national security and national defense security does not require authorization."}
{"task": "rw_115.jsonl", "id": 74238, "text": "2. Directly related to public safety, public health, and major public interests;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Sharing or disclosure directly related to public safety, public health and major public interests does not need to be authorized."}
{"task": "rw_115.jsonl", "id": 74239, "text": "3. It is directly related to judicial or administrative law enforcement such as criminal investigation, prosecution, trial and judgment.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Sharing or disclosure related to criminal investigation, prosecution, trial, and judgment execution does not need to be authorized."}
{"task": "rw_115.jsonl", "id": 74240, "text": "4. For major legitimate rights and interests such as maintaining your or other individuals, but it is difficult to get my consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Out of maintaining major legitimate rights and interests such as life and property of you or other individuals, it is difficult to get my consent, and no longer obtain authorization"}
{"task": "rw_115.jsonl", "id": 74241, "text": "5. The information you disclose to the public by yourself;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The collected personal information is the sharing or disclosure of the subject of the personal information to the public by themselves without authorization."}
{"task": "rw_115.jsonl", "id": 74242, "text": "6. Collect information from the legal publicly disclosed information, such as legal news reports, government information disclosure and other channels;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If the information is collected from the legal public disclosure information, no authorization is required"}
{"task": "rw_115.jsonl", "id": 74243, "text": "7. It is related to the obligations stipulated in the performance of our laws and regulations.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If it is related to the obligations stipulated in our law and regulations, no authorization is required"}
{"task": "rw_115.jsonl", "id": 74244, "text": "According to the law, sharing, transfer, and disclose personal information that has been identified by de -identified processing, and ensure that the data receiver cannot restore and re -identify the main information of the information, which is not an external sharing, transfer and public disclosure of personal information.The preservation and treatment will not be notified to you separately and obtain your consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Sharing and transferring de-identified personal information does not need to notify you and obtain your consent."}
{"task": "rw_115.jsonl", "id": 74245, "text": "4. How do we store and protect personal information", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74246, "text": "(1) Storage of personal information", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74247, "text": "In addition to laws and regulations or regulatory authorities, we only store your personal information in the purpose of this policy's purpose and shortest time limit.", "label": ["Data Retention", "Important"], "rewrite": "We only store your personal information in the purpose of this policy's purpose and shortest time limit"}
{"task": "rw_115.jsonl", "id": 74248, "text": "If we terminate our services or operations, we will stop collecting your personal information in time. At the same time, we will comply with relevant laws and regulations to inform you in advance, and delete or processes your personal information after termination of the service or operation.However, except for laws and regulations or regulatory departments.", "label": ["Data Retention", "Important", "Cessation of Operations"], "rewrite": "When stopping operation, an announcement will be announced in accordance with relevant laws and regulations, and your personal information will be deleted or anonymous after termination of the service or operation."}
{"task": "rw_115.jsonl", "id": 74249, "text": "The personal information we collected and generated in the operation of the People's Republic of China is stored in China. Except for the following situations: except:", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in the domestic operations will be stored in China, except for the following situations: 1. The laws and regulations have clearly stipulated;Dragon needs to provide your personal information overseas."}
{"task": "rw_115.jsonl", "id": 74250, "text": "1. The laws and regulations have clear stipulation;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74251, "text": "2. Get your authorization consent;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74252, "text": "3. The purple dragon service you use involves cross -border, and Zilong needs to provide your personal information overseas.", "label": ["Data Retention", "Important", "Risk"], "rewrite": "The purple dragon service you use involves cross -border, and Zilong needs to provide your personal information to overseas"}
{"task": "rw_115.jsonl", "id": 74253, "text": "In response to the above situations, we will ensure that it is implemented in accordance with national laws and regulations and relevant regulatory authorities, and provides sufficient protection for your personal information.", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74254, "text": "(2) Protection of personal information", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74255, "text": "We attach great importance to information security, set up a special security team, and take all reasonable and feasible measures to protect your personal information:", "label": ["Data Security"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74256, "text": "1. Data security technical measures", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74257, "text": "We will adopt security measures that meet industry standards, including establishing reasonable institutional norms and security technology to prevent your personal information from being accessed, using, modifying, and avoiding data damage or loss.", "label": ["Important", "Data Security"], "rewrite": "Establish reasonable institutional norms and security technologies to protect your personal information security"}
{"task": "rw_115.jsonl", "id": 74258, "text": "Our service adopts a variety of encryption technologies. In some purple dragon services, we will use encryption technology (such as SSL) to encrypt your personal information and isolate through isolation technology to protect your personal information.", "label": ["Important", "Data Security"], "rewrite": "Use SSL, information encryption storage, isolation technology, etc. to protect your information."}
{"task": "rw_115.jsonl", "id": 74259, "text": "In the use of personal information, including information display and information association calculations, we will use multiple data desensitization technology to enhance the security of information in use.", "label": ["Important", "Data Security"], "rewrite": "Use multiple data desensitization technology to enhance the security of information in use in use"}
{"task": "rw_115.jsonl", "id": 74260, "text": "We will also use strict data access permissions control and multiple identity authentication technology to protect personal information to avoid data from illegal use.", "label": ["Important", "Data Security"], "rewrite": "Use strict data access permissions control and multiple identity authentication technology to protect personal information"}
{"task": "rw_115.jsonl", "id": 74261, "text": "2. Other security measures we have taken to protect personal information", "label": ["Data Security"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74262, "text": "We have the industry's advanced data as the core and the data security management system carried out around the data life cycle. From the aspects of organizational construction, system design, personnel management, and product technology, we improve the security of the entire system.", "label": ["Important", "Data Security"], "rewrite": "Improve the security of the entire system through the data security management system."}
{"task": "rw_115.jsonl", "id": 74263, "text": "We manages the storage and use of personal information by establishing a data classification classification system, data security management specifications, and data security development specifications.", "label": ["Important", "Data Security"], "rewrite": "Establish a data classification and grading system, data security management specifications, and data security development specifications to manage and standardize the storage and use of personal information"}
{"task": "rw_115.jsonl", "id": 74264, "text": "We control the data through the confidentiality agreement, monitoring and audit mechanism through information contactors.", "label": ["Important", "Data Security"], "rewrite": "Through information contacts confidentiality agreements, monitoring and auditing mechanisms to make comprehensive security control of data"}
{"task": "rw_115.jsonl", "id": 74265, "text": "We will also organize safety and privacy protection training courses to strengthen employees' awareness of security and understanding of personal information protection policies and related regulations.", "label": ["Important", "Data Security"], "rewrite": "Organize safety and privacy protection training courses to strengthen employee understanding."}
{"task": "rw_115.jsonl", "id": 74266, "text": "3. We only allow Purple Dragon employees and partners to visit your personal information, and to set up strict access control and monitoring mechanisms for this reason.", "label": ["Important", "Data Security"], "rewrite": "Deploy the access control mechanism, and try their best to ensure that only authorized personnel can access personal information."}
{"task": "rw_115.jsonl", "id": 74267, "text": "We also require all personnel who may be exposed to your personal information to fulfill the corresponding confidentiality obligations.", "label": ["Important", "Data Security"], "rewrite": "All personnel who requires contact with your personal information to fulfill their obligations of confidentiality"}
{"task": "rw_115.jsonl", "id": 74268, "text": "If these obligations fail to fulfill these obligations, they may be held legal or suspended with the cooperative relationship with Zilong.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74269, "text": "4. The Internet is not an absolutely safe environment, and it is impossible to determine whether the communication methods with other users such as email, instant messaging, social software or other service software are fully encrypted. We recommend that you use complex passwords when using such tools, and pay attention to Keep your information safe.", "label": ["Important", "Data Security"], "rewrite": "Please use complex passwords to help us guarantee your account security."}
{"task": "rw_115.jsonl", "id": 74270, "text": "When communicating with a third party or purchasing goods and services through Zilong services, you will inevitably disclose your information, such as contact information or postal address, to the counterparty or potential counterparty.", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74271, "text": "Please protect your information properly and provide others with only necessary situations.", "label": ["Important", "Data Security"], "rewrite": "Protecting your personal information properly, it is provided to others only under the necessary situation."}
{"task": "rw_115.jsonl", "id": 74272, "text": "5. The Internet environment is not 100 % security. We will try our best to ensure or guarantee the security of your personal information you send to our personal information.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74273, "text": "If our physics, technology, or management protection facilities are damaged, personal information is caused by non -authorized access, public disclosure, tampering, or destruction, resulting in damage to your legitimate rights and interests, we will bear the corresponding legal responsibility.", "label": ["Important", "Data Security"], "rewrite": "If our physical, technical or management protection facilities are damaged, resulting in unauthorized access, public disclosure, tampering or destruction of information, resulting in damage to your legitimate rights and interests, we will bear corresponding legal responsibilities."}
{"task": "rw_115.jsonl", "id": 74274, "text": "6. Safety event disposal", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74275, "text": "In order to deal with possible risks such as personal information leakage, damage and loss, we have formulated a number of systems to clarify the classification and grading standards of security incidents and security vulnerabilities and the corresponding processing procedures.", "label": ["Important", "Data Security"], "rewrite": "We have formulated a number of systems to clarify the classification and classification standards of safety events, safety loopholes, and corresponding treatment processes"}
{"task": "rw_115.jsonl", "id": 74276, "text": "The emergency response team that we also established for security events, in accordance with the requirements of the safety incident, launch a safety plan for different security incidents, conduct stop loss, analysis, positioning, formulation of remedial measures, and combined with relevant departments to trace the source and crack down.", "label": ["Important", "Data Security"], "rewrite": "The emergency response team established for security incidents, launched a safety plan for different security incidents, conducted stop loss, analysis, positioning, formulating remedial measures, and joint departments to trace the source and crack down"}
{"task": "rw_115.jsonl", "id": 74277, "text": "We also regularly organize internal training and emergency drills to enable our relevant staff to master the corresponding emergency disposal strategies and regulations.", "label": ["Important", "Data Security"], "rewrite": "Regularly organize internal training and emergency drills, so that staff can master emergency response strategies and regulations"}
{"task": "rw_115.jsonl", "id": 74278, "text": "After unfortunately, the information security incident occurs, we will inform you in a timely manner in accordance with the requirements of the laws and regulations: the basic situation and possible impact of the security incident, the disposal measures we have taken or we are going to take, the suggestions that you can prevent and reduce risks independently and reduce risks, Remedy for your remedy.", "label": ["Important", "Data Security"], "rewrite": "Inform you the basic situation and possible impact of the safety incident in time, the disposal measures that have been taken or will take, suggestions that can prevent and reduce risks, and remedy measures"}
{"task": "rw_115.jsonl", "id": 74279, "text": "At the same time, we will inform you that the incident -related situation is in the form of mail, letter, telephone, push notification, etc. When it is difficult to inform the information subject one by one, we will publish an announcement in a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "It is difficult to inform personal information by mail, letter, telephone, and push notification one by one, and will publish an announcement in a reasonable and effective way"}
{"task": "rw_115.jsonl", "id": 74280, "text": "At the same time, we will also actively report the disposal of information security incidents in accordance with the requirements of the regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "The disposal of personal information security incidents will be reported in accordance with the requirements of the regulatory authorities."}
{"task": "rw_115.jsonl", "id": 74281, "text": "Please understand that due to the technical restrictions and the limitations of risk prevention, even if we have tried to strengthen security measures, we cannot always ensure that the information is 100 % security.", "label": ["Important", "Data Security"], "rewrite": "Although there are security measures, it is impossible to fully guarantee that there is no security problem."}
{"task": "rw_115.jsonl", "id": 74282, "text": "You need to understand that the system and communication network you use to access our services may have problems due to factors beyond our control.", "label": ["Important", "Data Security"], "rewrite": "Systems and communication networks may have problems due to the situation outside of our controlled range"}
{"task": "rw_115.jsonl", "id": 74283, "text": "Please keep your account, password and other identity elements properly.", "label": ["Important", "Data Security"], "rewrite": "Please keep your account, password and other identity elements properly."}
{"task": "rw_115.jsonl", "id": 74284, "text": "When you use the Zilong service, we will identify your identity through your account, password and other identity elements.", "label": ["Important", "Data Security"], "rewrite": "We will identify your identity through your account, password and other identity elements"}
{"task": "rw_115.jsonl", "id": 74285, "text": "Once you leak the aforementioned information, you may suffer losses and may be unfavorable to you.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74286, "text": "If you find an account, password and/or other identity elements that may be leaked, please contact us immediately so that we can take corresponding measures in time to avoid or reduce related losses.", "label": ["Important", "Data Security"], "rewrite": "If the personal information discovered, please contact our customer service immediately."}
{"task": "rw_115.jsonl", "id": 74287, "text": "5. How to manage your personal information", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74288, "text": "(1) Access, update and delete", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74289, "text": "We encourage you to update and modify your personal information to make it more accurate and effective.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74290, "text": "We will adopt appropriate technical means or provide contact channels for submitting applications to ensure that you can access, update, and correct your personal information or use other information provided by purple dragon services.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74291, "text": "For your information collected through cookies or similar technologies, we also explain the selection mechanism provided to you in the second part of this policy \"how do we use the cookies or similar technologies\".", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74292, "text": "If you want to inquire, modify or delete some of your information, please log in to the relevant functional pages of the Purple Dragon Personal Center and the single services of each single service. We provide you with relevant operation guidelines and operation settings.If you have doubts or difficulties during the operation, you can choose to contact us through the feedback channel listed in the chapter of the \"How to contact us\" in this policy. We will answer it as soon as possible.", "label": ["Important", "Edit/Control"], "rewrite": "Please log in to the personal center of Zilong Personal Center and the related functional pages of each single service to query, modify or delete some of your information, or contact us to solve"}
{"task": "rw_115.jsonl", "id": 74293, "text": "Except for other provisions of laws and regulations, when you correct or delete your personal information or apply for a cancellation account, we may not immediately correct or delete the corresponding information from the backup system, but this information will be correct or deleted when the backup is updated.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Delete the information you required to delete in the backup system when the backup update"}
{"task": "rw_115.jsonl", "id": 74294, "text": "(2) Public and sharing", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74295, "text": "Many of our services allow you to share your relevant information publicly with your social network, but also all users who use the service. The information you uploaded or published in the Zilong service, you upload or publish it to othersThe response made by the information is uploaded or published in an open area that can be seen in an open area that is visible to the unspecified user in Zilong service, and location data and log information including this information related to this information.", "label": ["Third Party Sharing/ Disclosure", "Edit/Control", "Important"], "rewrite": "You respond to the information you uploaded or published, the information you uploaded or published by others, and upload or publish your information through an email or in the open area, and the location data and log information related to this information are deletedThere may always be a public field in the public"}
{"task": "rw_115.jsonl", "id": 74296, "text": "As long as you do not delete the information you disclosed or shared, the information may always stay in the public field;", "label": ["Third Party Sharing/ Disclosure", "Edit/Control"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74297, "text": "Even if you delete the shared information, the relevant information may be cached, copied or stored independently by other users or the third parties that are not controlled by us, or are preserved by other users or such third parties in the public.", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "After deleting the information you shared, it may still be stored independently by other users or the third parties that are not controlled by us"}
{"task": "rw_115.jsonl", "id": 74298, "text": "If you disclose or share information through the above channels, we will not bear responsibility for your information leakage.", "label": ["Important"], "rewrite": "If you disclose or share the information through the above channels, which will cause your information to leak, we will not bear responsibility"}
{"task": "rw_115.jsonl", "id": 74299, "text": "Therefore, we remind and ask you to consider whether to disclose or share your information through the above channels.", "label": ["Important", "Edit/Control"], "rewrite": "Care carefully!Whether to share or even share relevant information."}
{"task": "rw_115.jsonl", "id": 74300, "text": "(3) Account cancellation", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74301, "text": "We provide you with a way to cancel your account.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74302, "text": "In the case that meets our terms of service terms and stipulated in relevant national laws and regulations, you can use your mobile phone to log in to Zilong Personal Center to submit an account cancellation application in accordance with the corresponding requirements.The specific guidance of the prompt is operated.", "label": ["Important", "Edit/Control"], "rewrite": "You can log in to Zilong Personal Center with your mobile phone to submit an account to cancel the application in accordance with the corresponding requirements"}
{"task": "rw_115.jsonl", "id": 74303, "text": "You can also choose to contact us through the feedback channels listed in the chapter of \"How to contact us\" through this policy, and we will answer it as soon as possible.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74304, "text": "After the cancellation of your account, we will stop providing you with all or part of the purple dragon services, and delete your personal information or do anonymous processing according to your requirements, except for other provisions of laws and regulations.", "label": ["Important", "Edit/Control"], "rewrite": "After the account is canceled, the personal information under the account will be deleted or anonymous, except for the laws and regulations."}
{"task": "rw_115.jsonl", "id": 74305, "text": "(4) Change the scope of your authorization consent", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74306, "text": "You can always choose whether to disclose personal information to us.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74307, "text": "Some personal information is necessary to use Zilong service, but most of the other information is determined by you.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74308, "text": "You can change your authorization of the scope of information or withdraw your authorization by deleting information, closing the device function, and cancellation account.", "label": ["Edit/Control", "Important"], "rewrite": "You can change your authorization scope or recover the authorization by deleting information, closing the device function, canceling accounts, etc."}
{"task": "rw_115.jsonl", "id": 74309, "text": "After the withdrawal authorization, we cannot continue to provide you with the service corresponding to the withdrawal authorization, and we will no longer process your corresponding information.", "label": ["Edit/Control", "Important"], "rewrite": "We cannot continue to provide you with the service corresponding to the withdrawal authorization"}
{"task": "rw_115.jsonl", "id": 74310, "text": "But your decision to withdraw authorization will not affect the information processing based on your authorization.", "label": ["Important", "Edit/Control"], "rewrite": "Withdrawal authorization will not affect personal information processing based on authorization before"}
{"task": "rw_115.jsonl", "id": 74311, "text": "(5) Automatic decision -making of constraint information systems", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74312, "text": "In certain business functions, we may make decisions only based on the non -artificial automatic decision -making mechanism, including information systems, algorithms, etc.", "label": ["Important", "Usage"], "rewrite": "In certain business functions, we may only make decisions based on non -artificial automatic decision -making mechanisms"}
{"task": "rw_115.jsonl", "id": 74313, "text": "If these decisions significantly affect your legitimate rights and interests, you have the right to ask us to explain, and we will also provide appropriate relief methods.", "label": ["Important", "Edit/Control"], "rewrite": "If this significantly affects your legitimate rights and interests, you have the right to ask us to explain or provide relief on non -manual automatic decisions"}
{"task": "rw_115.jsonl", "id": 74314, "text": "(6) In response to your above request", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74315, "text": "To ensure safety, you may need to provide a written request or prove your identity in other ways.", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "To ensure safety, you may need to provide a written request, or to prove your identity in other ways"}
{"task": "rw_115.jsonl", "id": 74316, "text": "We may ask you to verify your identity before processing your request.", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "We will ask you to verify your identity first, and then process the request"}
{"task": "rw_115.jsonl", "id": 74317, "text": "For your reasonable request, we do not charge fees in principle, but we will charge a certain cost fee depending on the request that repeats and beyond the reasonable limit.", "label": ["Important", "Edit/Control"], "rewrite": "Reasonable requests In principle, not charging and exceeding the reasonable limit of reasonable requests"}
{"task": "rw_115.jsonl", "id": 74318, "text": "For those who have no repetition and need too much technical means (for example, need to develop new systems or fundamentally change the current practice), bring risks to others' legitimate rights and interests or very unrealistic (for example, information involved in backup tapes)We may refuse.", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "We may refuse to repeat for no repetition, need too much technical means, bring risks to others' legitimate rights and interests, or very unrealistic requests"}
{"task": "rw_115.jsonl", "id": 74319, "text": "In the following circumstances, we will not be able to respond to your request:", "label": ["Important", "Edit/Control"], "rewrite": "In the following circumstances, we will not be able to respond to your request:"}
{"task": "rw_115.jsonl", "id": 74320, "text": "1. Related to the obligations stipulated in the performance of our laws and regulations;", "label": ["Important", "Edit/Control"], "rewrite": "1. Related to the obligations stipulated in the performance of our laws and regulations;"}
{"task": "rw_115.jsonl", "id": 74321, "text": "2. Directly related to national security and national defense security;", "label": ["Important", "Edit/Control"], "rewrite": "2. Directly related to national security and national defense security;"}
{"task": "rw_115.jsonl", "id": 74322, "text": "3. Directly related to public security, public health, and major public interests;", "label": ["Edit/Control", "Important"], "rewrite": "3. Directly related to public security, public health, and major public interests;"}
{"task": "rw_115.jsonl", "id": 74323, "text": "4. Directly related to criminal investigation, prosecution, trial and execution judgment;", "label": ["Edit/Control", "Important"], "rewrite": "4. Directly related to criminal investigation, prosecution, trial and execution judgment;"}
{"task": "rw_115.jsonl", "id": 74324, "text": "5. We have sufficient evidence to indicate that you have subjective malice or abuse of rights;", "label": ["Edit/Control", "Important"], "rewrite": "5. We have sufficient evidence to indicate that you have subjective malice or abuse of rights;"}
{"task": "rw_115.jsonl", "id": 74325, "text": "6. For major legitimate rights and interests such as maintaining your or other individuals, but it is difficult to get my consent;", "label": ["Important", "Edit/Control"], "rewrite": "6. For major legitimate rights and interests such as maintaining your or other individuals, but it is difficult to get my consent;"}
{"task": "rw_115.jsonl", "id": 74326, "text": "7. Response your request will cause the legitimate rights and interests of you or other individuals and organizations to be seriously damaged;", "label": ["Edit/Control", "Important"], "rewrite": "7. Response your request will cause the legitimate rights and interests of you or other individuals and organizations to be seriously damaged;"}
{"task": "rw_115.jsonl", "id": 74327, "text": "8. Involved in business secrets.", "label": ["Important", "Edit/Control"], "rewrite": "8. Involved in business secrets."}
{"task": "rw_115.jsonl", "id": 74328, "text": "Six, third -party service", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74329, "text": "Zilong services may access or link to social media or other services provided by third parties (including websites or other services).", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74330, "text": "include:", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74331, "text": "1. You can use the \"Share\" key to share certain purple dragon services to third -party services, or you share third -party service content to Zilong service.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You can use the \"Share\" button to share some content with third parties, or share third-party service content with Zilong"}
{"task": "rw_115.jsonl", "id": 74332, "text": "These functions may collect your information (including your log information), and may install COOKIES in your device, so as to operate the above functions normally;", "label": ["Important", "First Party Collection Information"], "rewrite": "The \"Share\" function may collect your information, and you may install cookies in your device"}
{"task": "rw_115.jsonl", "id": 74333, "text": "2. We provide you through advertising or other ways of service, so that you can link to the service or website of a third party;", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74334, "text": "3. Other conditions to access third -party services.", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74335, "text": "In order to achieve the purpose of this policy, we may access the SDK or other similar applications provided by third -party service providers (such as embedded code, plug -in, etc.) to provide you with better customer service and user experience and user experienceEssence", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may access SDK or other similar applications provided by third -party service providers to provide better customer service and user experience"}
{"task": "rw_115.jsonl", "id": 74336, "text": "At present, the third -party service providers we connect mainly include the following types:", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74337, "text": "(1) For advertising -related services, including advertising display, advertising data monitoring/statistics, etc.;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74338, "text": "(2) Used for message push function, including mobile phone manufacturer Push push, specific event reminder, etc.;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74339, "text": "(3) Used to pay related services, including order payment, transaction behavior verification, income settlement, payment information remittance president, etc.;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74340, "text": "(4) Use the location permissions of the device with your consent, collect equipment information and log information, etc.;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74341, "text": "(5) Used for third -party authorization services, including third -party account login, sharing relevant content to third -party products, etc.;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74342, "text": "(6) Used to support product function modules, including online live broadcast, video playback, voice recognition, AR, smart customer service, barrage playback, content storage, etc.;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74343, "text": "(7) Used to optimize product performance, including improving hardware distribution capacity, reducing server costs, function heat repair, etc.;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74344, "text": "(8) Used for account security and product reinforcement related services, including network monitoring, domain name analysis, anti -hijacking, anti -junk anti -cheating, plus decryption services, etc.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74345, "text": "(9) For game updates.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74346, "text": "In order to ensure that users can be updated smoothly, assist users to update some files and content, there may be back -end services to start updating resources.", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74347, "text": "Some third -party SDKs or applications we access may collect your personal information. If you use such services provided by third parties in our services, you agree that it will directly collect and process your information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Some third-party SDKs may collect your personal information. If you use such third-party services in our services, you agree that they will directly collect and process your information"}
{"task": "rw_115.jsonl", "id": 74348, "text": "We will evaluate the legality, legitimacy, and necessity of such third -party services to collect personal information, and require these third parties to take protection measures for your personal information, and strictly abide by relevant laws and regulations and regulatory requirements.", "label": ["Important", "Data Security"], "rewrite": "We will evaluate the legality, legitimacy, and necessity of such third -party services to collect personal information, and require these third parties to take protection measures, and strictly abide by relevant laws and regulations and regulatory requirements"}
{"task": "rw_115.jsonl", "id": 74349, "text": "You can understand the basic situation of the third -party SDK that we mainly access. The situation of each single service connected to the third -party SDK may be different. If you need to understand the details of the specific single service accessing the third -party SDK, please go to the corresponding service pageAnd check the specific terms and related pages of our single services.", "label": ["Important", "Edit/Control"], "rewrite": "You need to understand the detailed situation of the specific single service to access the third -party SDK, please go to the corresponding service page and check the specific terms and related pages of each single service and related pages"}
{"task": "rw_115.jsonl", "id": 74350, "text": "You can also choose to contact us through the feedback channels listed in the chapter of \"How to contact us\" through this policy, and we will answer it as soon as possible.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74351, "text": "In order to ensure the realization of relevant functions of Zilong service and the safe and stable operation of applications, we may access software development kits (SDK) or similar applications provided by third parties to achieve relevant purposes.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may access the software development package (SDK) or similar applications provided by a third party to implement related functions"}
{"task": "rw_115.jsonl", "id": 74352, "text": "We will conduct strict security assessments on the software tool development kit (SDK) or similar applications that our partners obtain information to protect the security of your personal information.", "label": ["Important", "Data Security"], "rewrite": "We will conduct a strict security assessment of the software tool development kit (SDK) or similar applications that our partners obtain information from"}
{"task": "rw_115.jsonl", "id": 74353, "text": "The following is the information of our main third -party service provider:", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74354, "text": "Alibaba Cloud One -click login SDK, belongs to the company: Alibaba (China) Network Technology Co., Ltd., use purpose: mobile phone number one -click login, data type: device logo information, phone number, official website link:, https://help.aliyunun.com/Product/75010.html? SPM = A2C4G.1186623.6.540.57e4629FMD1ZPT", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Alibaba Cloud one-click login SDK Purpose of use: One-click login with mobile phone number Data type: device identification information, phone number"}
{"task": "rw_115.jsonl", "id": 74355, "text": "QQ, SDK, affiliated company: Shenzhen Tencent Computer System Co., Ltd., purpose of use: for QQ account NetEase service, helping users share content to QQ client, data type: device identification information, official website link:, https://open .tencent.com/", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "QQ SDK purpose of use: for QQ account Netease service, to help users share content to QQ client data type: device identification information"}
{"task": "rw_115.jsonl", "id": 74356, "text": "WeChat SDK, affiliated company: Shenzhen Tencent Computer System Co., Ltd., uses the purpose: Log in to the WeChat account to log in to Zilong Game Application, help users share content to WeChat client, data type: device logo information, official website link:, https://open.weixin.qq.com/", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "WeChat SDK purpose of use: for WeChat account login Zilong game application, to help users share content to WeChat client data type: device identification information"}
{"task": "rw_115.jsonl", "id": 74357, "text": "Weibo SDK, affiliated company: Beijing Weimeng Chuangke Network Technology Co., Ltd., purpose of use: to log in Zilong service with Weibo account, help users share content to Weibo client, data type: device identification information, official website link: , https://open.weibo.com/development/mobile", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Weibo SDK uses purpose: Log in to Zilong service on Weibo account, help users share content to the Weibo client data type: Device logo information"}
{"task": "rw_115.jsonl", "id": 74358, "text": "UnionPay SDK, affiliated company: China UnionPay, purpose of use: to help users use QuickPass payment in the app, data type: device identification information, official website link: https://open.unionpay.com/tjweb/index", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "The purpose of using the UnionPay SDK: to help users use UnionPay payment in the app Data type: device identification information"}
{"task": "rw_115.jsonl", "id": 74359, "text": "Alipay, affiliated company: Ant Technology Group Co., Ltd., purpose of use: to help users use Alipay payment in the app, data type: device identification information, official website link:, https://docs.open.alipay.com/", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Alipay uses the purpose: help users use Alipay payment data types in the application: device logo information"}
{"task": "rw_115.jsonl", "id": 74360, "text": "WeChat payment, affiliated company: Shenzhen Tencent Computer System Co., Ltd., purpose of use: to help users use WeChat payment in the app, data type: device identification information, official website link: https://pay.weixin.qq.com/", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "WeChat Pay Purpose of use: To help users use WeChat Pay within the app Data type: Device identification information"}
{"task": "rw_115.jsonl", "id": 74361, "text": "Tencent Cloud Voice, affiliated company: Shenzhen Tencent Computer System Co., Ltd., purpose of use: need to send voice messages within the application, data type: device identification information, official website link: https://gcloud.tencent.com/", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Tencent Cloud Voice Purpose of use: Need to send voice messages within the app Data type: Device identification information"}
{"task": "rw_115.jsonl", "id": 74362, "text": "Talkingdatasdk, affiliated: Beijing Tengyun Tianxia Technology Co., Ltd., purpose: advertising, data type: device logo information, official website link:, http://www.talkingdata.com/", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "talkingdataSDK usage purpose: advertising data type: device identification information"}
{"task": "rw_115.jsonl", "id": 74363, "text": "Ali Push, its company: Alibaba (China) Network Technology Co., Ltd., uses the purpose: for message push function, data type: device logo information, official website link:, https://www.aliyun.com/product/cps?SPM = 5176.10695662.56944980.1.E5D612A63pvmmo", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Ali push Purpose of use: for message push function Data type: device identification information"}
{"task": "rw_115.jsonl", "id": 74364, "text": "Xiaomi push SDK, company: Xiaomi Technology Co., Ltd., purpose of use: for message push function, data type: device identification information, official website link:, https://dev.mi.com/console/appservice/push.html", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Xiaomi push SDK purpose: for message push function data type: equipment identification information"}
{"task": "rw_115.jsonl", "id": 74365, "text": "Huawei Push SDK, affiliated company: Huawei Software Technology Co., Ltd., purpose of use: for message push function, data type: device identification information, official website link: https://developer.huawei.com/consumer/cn/service/hms /pushservice.html", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Purpose of use of Huawei push SDK: for message push function Data type: device identification information"}
{"task": "rw_115.jsonl", "id": 74366, "text": "VIVO push SDK, affiliated company: Vivo Communication Technology Co., Ltd., purpose of use: for message push function, data type: device identification information, official website link: https://dev.vivo.com.cn/documentcenter/doc/ 233", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Vivo push SDK use purpose: for message push function data type: Device identification information"}
{"task": "rw_115.jsonl", "id": 74367, "text": "OPPO push SDK, affiliated company: Guangdong Huantai Technology Co., Ltd., purpose of use: for message push function, data type: device identification information, official website link:, https://open.oppomobile.com/wiki/doctid=10196", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "OPPO push SDK use purpose: for message push function data type: device identification information"}
{"task": "rw_115.jsonl", "id": 74368, "text": "BuglySDK, affiliated company: Shenzhen Tencent Computer System Co., Ltd., purpose of use: to collect application crash information, data type: device identification information, official website link: https://bugly.qq.com/v2/", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Buglysdk Objectives: Used to collect application collapse information data types: device logo information"}
{"task": "rw_115.jsonl", "id": 74369, "text": "Ledu SDK, affiliated company: Shanghai Zhuonmeng Information Technology Co., Ltd., Objectives: Application Version Hot Update, Resource File Download, Data Type: Device Identity Information, official website link:, http://www.loveota.com/", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Music SDK uses purpose: Application version hot update, resource file download data type: device logo information"}
{"task": "rw_115.jsonl", "id": 74370, "text": "Tencent IM, affiliated company: Shenzhen Tencent Computer System Co., Ltd., uses the purpose: for customer service, data type: device logo information, official website link:, https://cloud.tencent.com/product/im/im", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Tencent IM uses the purpose: for customer service data type: equipment identification information"}
{"task": "rw_115.jsonl", "id": 74371, "text": "Huawei channel SDK, affiliated company: Huawei Software Technology Co., Ltd., purpose: identify channel users, data type: device identification information, official website link:, https://developer.huwei.com/consumer/cn/", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Purpose of use of Huawei Channel SDK: Identify channel users Data type: Device identification information"}
{"task": "rw_115.jsonl", "id": 74372, "text": "Jiuyou channel SDK, affiliated company: Guangzhou Aijiuyou Information Technology Co., Ltd., purpose of use: to identify channel users, data type: device identification information, official website link: https://game.open.uc.cn/", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Jiuyou channel SDK uses purpose: identify channel user data type: equipment identification information"}
{"task": "rw_115.jsonl", "id": 74373, "text": "Xiaomi channel SDK, affiliated company: Xiaomi Technology Co., Ltd., use purpose: identify channel users, data type: device identification information, official website link:, https://dev.mi.com/console/", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Xiaomi channel SDK uses purpose: identify channel user data type: equipment identification information"}
{"task": "rw_115.jsonl", "id": 74374, "text": "OPPO channel SDK, affiliated company: Guangdong Huantai Technology Co., Ltd., purpose of use: to identify channel users, data type: device identification information, official website link:, https://open.oppomobile.com/", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "OPPO channel SDK Purpose of use: Identify channel users Data type: Device identification information"}
{"task": "rw_115.jsonl", "id": 74375, "text": "VIVO channel SDK, affiliated company: Vivo Communication Technology Co., Ltd., purpose of use: to identify channel users, data type: device identification information, official website link:, https://dev.vivo.com.cn/home", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "VIVO channel SDK Purpose of use: Identify channel users Data type: Device identification information"}
{"task": "rw_115.jsonl", "id": 74376, "text": "App Store channel SDK, affiliated company: Shenzhen Tencent Computer System Co., Ltd., purpose of use: to identify channel users, data type: device identification information, official website link:, https://open.tencent.com/", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Application treasure channel SDK Purpose of use: Identify channel users Data type: Device identification information"}
{"task": "rw_115.jsonl", "id": 74377, "text": "Qihoo 360 channel SDK, affiliated company: Beijing Qihoo Technology Co., Ltd., purpose of use: identify channel users, data type: device identification information, official website link:, http://dev.360.cn/, Meizu channel SDK, affiliated Company: Zhuhai Meizu Communication Equipment Co., Ltd., purpose of use: to identify channel users, data type: device identification information, official website link:, http://open.flyme.cn/", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Qihoo 360 channel SDK usage purpose: identify channel users data type: device identification information; Meizu channel SDK usage purpose: identify channel users data type: device identification information"}
{"task": "rw_115.jsonl", "id": 74378, "text": "Nubia channel SDK, affiliated company: Shenzhen Nubia Information Technology Co., Ltd., purpose of use: to identify channel users, data type: device identification information, official website link: https://developer.nubia.com/developer/view /index.html", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Nubia channel SDK uses purpose: identify channel user data type: equipment identification information"}
{"task": "rw_115.jsonl", "id": 74379, "text": "BIliBili channel SDK, affiliated company: Shanghai Kuanyu Digital Technology Co., Ltd., purpose of use: to identify channel users, data type: device identification information, official website link:, http://open.biligame.com/#/", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "BIliBili channel SDK Purpose of use: Identify channel users Data type: Device identification information"}
{"task": "rw_115.jsonl", "id": 74380, "text": "The above third-party social media or other services are operated by the relevant third parties.", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74381, "text": "Your use of such third-party social media services or other services (including any information you provide to such third parties) shall be governed by the third party's own terms of service and information protection statement (not this Policy), and you need to carefully Read its terms.", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74382, "text": "This policy only applies to the personal information we collect, and does not apply to any services provided by third parties or information usage rules of third parties.", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74383, "text": "If you find that these third-party social media or other services are risky, it is recommended that you terminate the relevant operations to protect your legal rights and contact us in time.", "label": ["Important", "Data Security"], "rewrite": "If you find that these third-party social media or other services are risky, it is recommended that you terminate the operation and contact us"}
{"task": "rw_115.jsonl", "id": 74384, "text": "7. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74385, "text": "We recommend that any minors participating in online activities should obtain the consent of their parents or other guardians (hereinafter referred to as \"guardians\") in advance.", "label": ["Specific Audiences", "Important"], "rewrite": "Any minors who participate in online activities should obtain the prior consent of their parents or other guardians"}
{"task": "rw_115.jsonl", "id": 74386, "text": "We will protect relevant information about minors in accordance with the provisions of relevant national laws and regulations.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74387, "text": "We encourage guardians to guide minors to use Zilong services.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74388, "text": "If you are a minor under the age of 14, please notify your guardian to read and accept our \"Purple Dragon Children's Personal Information Protection Rules and Guardians\" and before you use Zilong service and submit personal information,Seeking its consent and guidance.", "label": ["Policy Change", "Specific Audiences", "Important"], "rewrite": "If you are a child under the age of 14, please and the guardian to read the \"Personal Information Protection Rules and Instructions of Purple Children in Purple Children\" and agree to use services or provide information under the guidance of the guardian or provide information"}
{"task": "rw_115.jsonl", "id": 74389, "text": "Eight, revise and notice", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74390, "text": "In order to provide you with better services, we may modify the terms of this policy in a timely manner in accordance with the update of Zilong services and the relevant requirements of laws and regulations, which constitute a part of the policy policy.", "label": ["Policy Change", "Important"], "rewrite": "We will revise the terms of this policy from time to time, and such revisions form part of this policy"}
{"task": "rw_115.jsonl", "id": 74391, "text": "We will announce any changes to this policy on this page.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74392, "text": "For major changes, we will also provide more significant notifications (including website announcements, push notifications, pop -ups prompts or other methods). The major changes referred to in this policy include, but not limited to:", "label": ["Policy Change", "Important"], "rewrite": "For major changes, we will provide more prominent notice"}
{"task": "rw_115.jsonl", "id": 74393, "text": "1. Make a major change in our service model.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74394, "text": "Such as the purpose of processing personal information, the type of personal information processed, the way of using personal information, etc.;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74395, "text": "2. We have made significant changes in our ownership structure.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74396, "text": "Such as changes in owners caused by business adjustments, bankruptcy mergers, etc.;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74397, "text": "3. The main object of personal information sharing, transfer or public disclosure has changed significantly;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74398, "text": "4. There are major changes in your right to participate in the processing of personal information and how to exercise it;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74399, "text": "5. We are responsible for dealing with the responsible departments, contact methods and complaint channels for handling personal information security;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74400, "text": "6. Other important or may seriously affect your personal rights and interests.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74401, "text": "If you do not agree to such changes, you can choose to stop using Zilong services;", "label": ["Policy Change", "Important"], "rewrite": "If you do not agree with policy changes, you can choose to stop using it"}
{"task": "rw_115.jsonl", "id": 74402, "text": "If you continue to use Zilong service, it means that you have fully read, understand, and agree to the constraints of the policy revised.", "label": ["Policy Change", "Important", "Risk"], "rewrite": "Continue to use services is deemed to agree to accept the content of the privacy policy after the revision."}
{"task": "rw_115.jsonl", "id": 74403, "text": "Any of our modification will put your satisfaction first.", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74404, "text": "We encourage you to review our Privacy Policy each time you use Zilong Services.", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74405, "text": "We may send you service-related notices when necessary (including when we suspend, change, or terminate a single service due to system maintenance).", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74406, "text": "If you do not want to continue the message we push, you can ask us to stop pushing, including: according to the SMS withdrawal guidelines, we need to stop sending promotion SMS, or settings in the mobile device, and no more information about our push;", "label": ["Important", "Edit/Control"], "rewrite": "You can ask us to stop pushing messages, except that we send messages in accordance with the law or the service agreement of a single service"}
{"task": "rw_115.jsonl", "id": 74407, "text": "However, we do not send messages in accordance with the law or the service agreement of a single service.", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74408, "text": "Nine, how to contact us", "label": [], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74409, "text": "We have set up a full -time department for personal information protection and will protect your personal information in accordance with this policy.", "label": ["Important", "Data Security"], "rewrite": "We have set up a personal information protection dedicated department to protect your personal information"}
{"task": "rw_115.jsonl", "id": 74410, "text": "If you have complaints and reports on network information security, or you have any questions, opinions, or suggestions on this policy, the privacy measures of Zilong, and your information, please contact the Purple Dragon's personal information protection staff.Send mail to", "label": ["Important", "Contact Information"], "rewrite": "E-mail: GM@zilong.com; Address: Personal Information Protection Officer, Floor T2-11, Damei Center, No. 7 Qingnian Road, Chaoyang District, Beijing"}
{"task": "rw_115.jsonl", "id": 74411, "text": "GM@zilong.com or write to the following address: Personal Information Protection Officer (admission), Floor T2-11, Damei Center, No. 7 Qingnian Road, Chaoyang District, Beijing.", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_115.jsonl", "id": 74412, "text": "Under normal circumstances, we will reply to your problems, opinions or suggestions, and verify your user identity.", "label": ["Important", "Contact Information"], "rewrite": "We will reply within 15 working days after receiving your questions, comments or suggestions and verifying your user identity"}
{"task": "rw_115.jsonl", "id": 74413, "text": "If you are not satisfied with our reply, you can also complain to the consumer rights protection department or filed a lawsuit with the courts with jurisdictions.", "label": ["Important"], "rewrite": "If you are not satisfied with our reply, you can also complain to the consumer rights protection department or filed a lawsuit with the courts with jurisdiction"}
{"task": "rw_115.jsonl", "id": 74414, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
