{"task": "rw_15.jsonl", "id": 42436, "text": "Public comment privacy policy", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42437, "text": "download", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42438, "text": "Effective date: [June 09, 2022]", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42439, "text": "Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42440, "text": "Update date: June 02, 2022", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42441, "text": "Effective date: June 09, 2022", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42442, "text": "Public comment (hereinafter or \"we\") pays great attention to protecting the personal information and privacy of users (\"you\"). We know the importance of personal information to you, and will take the laws and regulations and the industry's mature security standards.Corresponding security measures to protect your personal information.", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42443, "text": "We hope to clearly introduce you how to deal with your personal information and protect you when using our products/services through this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42444, "text": "This policy will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42445, "text": "1. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42446, "text": "2. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42447, "text": "3. How can we share, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42448, "text": "4. How do we save and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42449, "text": "5. How do you manage your personal information", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42450, "text": "6. Protection of personal information of minors", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42451, "text": "7. Notification and revision", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42452, "text": "8. How to contact us", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42453, "text": "9. Appendix", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42454, "text": "[Special Tips] Please read and fully understand this \"Privacy Policy\" (the key content has bolded the fonts, please pay special attention to the use of the products/services we provided by us.", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42455, "text": "Once you use or continue to use our products/services, it means that you agree that we will process your relevant information in accordance with this privacy policy.", "label": ["Policy Change", "Important", "Risk"], "rewrite": "Once you use or continue to use our products/services, it means that you agree to be subject to this policy."}
{"task": "rw_15.jsonl", "id": 42456, "text": "If you have any questions about this privacy policy, you can contact us through the way how to contact us in this privacy policy).", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42457, "text": "The product/service of the public comment is the product/service provided by the Shanghai Hantao Information Consulting Co., Ltd. (Registration Address: Room 149, Hangzhou Road, No. 741, Hangzhou Road, Yangpu District, Shanghai) and its related parties provided to you through the following channels:Including but not limited to client clients such as the public review website (www.dianping.com), the public review app, and the related WeChat open platform account account or applet.", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42458, "text": "For certain specific products/services, we will also formulate a separate privacy policy to explain the special policies of these products/services.", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42459, "text": "If the relevant privacy policy is inconsistent with the privacy policy, the specific privacy policy is applicable.", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42460, "text": "The popular reviews and related parties referred to in this policy refer to the single name or collective name of Shanghai Hantao Information Consulting Co., Ltd., Hanhai Information Technology (Shanghai) Co., Ltd. and the existing and/or future related related related companies.", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42461, "text": "Please note that this policy is not applicable to other third -party products/services connected by your products/services (\"Other third parties\", including your trading counterparty, any third -party website, and third -party service providerWait), please refer to the privacy policy or similar statement of the third party.", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42462, "text": "1. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42463, "text": "When you use our products/services, you need/you can choose to authorize us to collect and use personal information.", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42464, "text": "1. In order to provide you with the basic functions of our product/service, you need to authorize us to collect and use the necessary information. If you refuse to provide the aforementioned necessary information, you will not be able to use our product/service normally;", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to provide you with the basic functions of our products/services, you need to authorize us to collect and use the necessary information."}
{"task": "rw_15.jsonl", "id": 42465, "text": "2. In order to provide you with the expansion function of our product/service, you can choose to authorize us to collect and use information. If you refuse to provide the aforementioned information, you will not be able to use related additional functions normally or to achieve the functional effects we intend to achieve, But it does not affect your basic functions of using our products/services normally.", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to provide you with the expansion function of our product/service, you can choose to authorize us to collect and use information."}
{"task": "rw_15.jsonl", "id": 42466, "text": "(1) You need to authorize us to collect and use personal information.", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42467, "text": "We will follow the principles of legitimate, legal, and necessary, and use your personal information for the following purposes described in this policy.", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42468, "text": "1. Help you become our user", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42469, "text": "In order to comply with the requirements of laws and regulations, and to provide you with more personalized and more convenient services, when you are registered as a public comment user, you need to provide at least mobile phone numbers to create an account and improve the relevant network identity information (such as the avatar, Nickname and login password, etc.);", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you register as a popular comment user, you need to provide at least your mobile phone number to create an account and improve the relevant network identity information."}
{"task": "rw_15.jsonl", "id": 42470, "text": "If you only need to use browsing, search and other functions, you don't need to register as our users and provide the above information.", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42471, "text": "Volkswagen is judged as a brand of Meituan and applied to the Meituan account system;", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42472, "text": "If you already have Meituan account, you can directly log in to the public comment through the registered mobile phone number of Meituan account.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you already have Meituan account, you can directly log in to the public comment through the registered mobile phone number of Meituan account."}
{"task": "rw_15.jsonl", "id": 42473, "text": "In the process of providing account information, if you are willing to add additional personal information, it will help us provide you with more personalized services: including your gender, birthday, residence, hometown, preferences, family information, etc.Essence", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If you are willing to add extra personal information, it will help us provide you with more personalized services."}
{"task": "rw_15.jsonl", "id": 42474, "text": "If you do not provide such information, it will not affect your basic functions that enjoy public review services.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42475, "text": "If you choose to log in to use a third -party account, we will obtain the account information (such as avatar, nickname, region, gender and other information, etc.) from third parties to your account for quick login. We will be based on your account.The third party agreed to use your personal information on the premise of compliance with relevant regulations.", "label": ["Important", "First Party Collection Information"], "rewrite": "When registering and logging in with a third -party account, access and collect your personal information after your authorization, and bind it."}
{"task": "rw_15.jsonl", "id": 42476, "text": "2. Provide you with geographic location -based information display", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42477, "text": "In order to provide you with the display and search service of the surrounding food, drinking, and travel information, and improve our service performance, efficiency and functions, we authorize us to collect relevant information you generate in the process of using our service, including:", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect the relevant information you generate during use to improve services."}
{"task": "rw_15.jsonl", "id": 42478, "text": "(1) Location information.", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42479, "text": "When you authorize the positioning function of the mobile device with the system and use the service -based services, we will collect and use your location information to recommend the surrounding life services (for example, you do not need to enter the geographical location where you can enterRelated services, estimated the actual distance between the merchant and you facilitates you to make consumer decisions, recommend the service category and preferential information of nearby for you).", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you turn on the positioning function and use the service -based services, we will collect and use your location information to recommend your surrounding life services."}
{"task": "rw_15.jsonl", "id": 42480, "text": "We will use relevant technology to obtain your location information (accuracy will be different). These technologies include, IP, addresses, GPS, and WLAN (such as Wi-Fi) that can provide relevant information, access points, Bluetooth and base stations, Sensor information, etc.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will use related technology to obtain your location information."}
{"task": "rw_15.jsonl", "id": 42481, "text": "You may contain corresponding geographical information in the information provided in the service, such as the area information you set in the account information or the geographical labeling information in the picture, the picture in the video.", "label": ["Important", "First Party Collection Information"], "rewrite": "You may include corresponding geographical location information in the information provided in the service."}
{"task": "rw_15.jsonl", "id": 42482, "text": "You can turn off the positioning service in the mobile device system to stop our collection of information on your location, but it may not be able to use the services we provide for you based on geographical location, or to achieve the expected effect of related services.", "label": ["Edit/Control", "Important"], "rewrite": "You can close the positioning service to stop our collection of information on your location."}
{"task": "rw_15.jsonl", "id": 42483, "text": "(2) Log information.", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42484, "text": "When you use the products/services we provide, we will collect information from browsing, searching, clicking, collecting, collecting, trading, after -sales, attention, sharing, release and other information as related online logs, including you, including youThe IP address, the type of browser, the language used, the version of the operating system, the date and time of access, the telecommunications operator, and the network request.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the product/service, we will collect information such as browsing, searching, clicks and other information and save them as related network logs."}
{"task": "rw_15.jsonl", "id": 42485, "text": "(3) Sensor information.", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42486, "text": "When you use our product/service process, we may collect your sensor information to adapt your device status or identify your actions when you choose to participate in the event.It will be used in specific scenarios.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the product/service process, we may collect your sensor information to adapt to your device status or identify your actions."}
{"task": "rw_15.jsonl", "id": 42487, "text": "For example, in the \"sweeping\" scene, judge the dark environment through the light sensor to show you whether to choose to turn on the flash or adjust the brightness;", "label": ["Important", "Usage"], "rewrite": "In the \"sweeping\" scene, the dark environment is judged by light sensor so that you can show you whether you choose to turn on the flash or adjust the brightness."}
{"task": "rw_15.jsonl", "id": 42488, "text": "For another example, when you play videos or participate in interactive activities, adapt to the horizontal and vertical screen status of the device through sensors such as gravity, acceleration, gyroscope, etc. or show you the next interactive scenario.", "label": ["Important", "Usage"], "rewrite": "When you play videos or participate in interactive activities, you can adapt to the horizontal vertical screen status of the device through the sensors such as gravity, acceleration, gyroscope, and other interactive scenarios."}
{"task": "rw_15.jsonl", "id": 42489, "text": "3. Provide you with reservation, ordering, order management functions", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42490, "text": "When you book/place orders, leisure and entertainment, life services, attractions, movie tickets, beautiful people, sports fitness, marriage, parent -child, pet, medical and other services, you need to provide contacts according to the service types of the serviceInformation (name, gender, phone number, etc.), address information (such as house administration services), service preferences (such as the number of dining people, etc.), etc.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you book services such as booking/ordering/ordering, leisure and entertainment, life services, etc. on Volkswagen, you need to provide contact information, address information, and service preferences based on the service type."}
{"task": "rw_15.jsonl", "id": 42491, "text": "You can book/place orders, train tickets, car tickets, hotels, hotels, attractions, homestays, medical care, student exclusive exclusive services such as mobile phone cards or visas, or apply for mobile phone cards or visas, or you may need to be based on services such asRelevant laws and regulations and relevant parties (tickets, hotels, travel agencies, and its agents, etc.) provide your real -name identity information (including but not limited to your ID card, officer card, passport, driver's license, student ID, etc.Certificate photos, photocopies, numbers, etc.), contact information (name, gender, phone number, etc.), email address (for confirmation order information, etc.), personal photos (for first diagnosis, etc.)Contact person information and so on.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can book your reservation/order air ticket, train ticket, car ticket, hotel and other services on Volkswagen. You may need to provide your real -name identity information, contact information, email address, etc."}
{"task": "rw_15.jsonl", "id": 42492, "text": "To show you the order information of your account and facilitate the management of your order information, we will collect the order information you generate during the use of our service.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We will collect the order information you generate during the service process, thinking that you show the order information and facilitate your order management."}
{"task": "rw_15.jsonl", "id": 42493, "text": "In the orders you generated on the public comments, you will include your identity information, contact information, itinerary information, accommodation information, payment information, etc. These are all sensitive information. Please display it to others carefully or provide them outside. We will also be provided to the outside world. We will also be provided to the outside world. We will also be provided to the outside world. We will also provide them.When displaying order information, try to identify the processing on the basis of ensuring information availability.", "label": ["Important", "Usage"], "rewrite": "Please display or provide order information to others carefully, and we will also try to identify the processing when displaying the order information."}
{"task": "rw_15.jsonl", "id": 42494, "text": "4. Provide you with collection, attention, sharing, and recommendation functions", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42495, "text": "In order to facilitate your management of your own preferences, find users or communities with common hobbies, get a easier access experience, and share with friends and third parties.You can also share information with third parties through functional components. We will collect the log information you generated in the use of the above functions to display, realize online management, initiate sharing, and recommend to you with common hobbies on your personal homepage.User and other.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "You can collect/follow/join the merchant/user/tribe you are interested in. We will collect your log information to show you, realize online management, initiate sharing, and recommend users with common hobbies on your personal homepage.wait."}
{"task": "rw_15.jsonl", "id": 42496, "text": "5. Provide you with the function of distribution, post -post, and leg running", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42497, "text": "When you use the corresponding functions on the public reviews involving delivery (such as takeaway delivery)/replayed (such as invoicing mail)/running legs (such as help buying and sending) services, you need to provide the name and gender of the consignee (with gender (use for gender (use it.When the delivery staff contacts you, such as Ms. Liu, such as Ms. Liu), mobile phone number, receiving address, house number, etc., it can be facilitated that your order can be delivered and completed safely and accurately.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the corresponding features to involve distribution/post -mail/leg running service, you need to provide the name, gender, mobile phone number, receiving address, house number, etc."}
{"task": "rw_15.jsonl", "id": 42498, "text": "You can also choose to add labels (such as home, company, etc.) for common addresses, so that they can be found in the future.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can choose to add labels to common addresses to facilitate the search and use in the future."}
{"task": "rw_15.jsonl", "id": 42499, "text": "6. Provide you with information release functions such as writing reviews, strategies, punch cards", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42500, "text": "When you actively evaluate the merchant's products/services or publish other content (such as information, status, sign -in, strategy and other information), we will collect your information (including text, pictures, videos, geographical location, geographical locationInformation, etc.).", "label": ["Important", "First Party Collection Information"], "rewrite": "When you actively evaluate the merchant's products/services or publish other content, we will collect the information you published."}
{"task": "rw_15.jsonl", "id": 42501, "text": "Your nickname, avatar and publishing content will be publicly displayed;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Your nicknames, avatars and publishing content will be publicly displayed."}
{"task": "rw_15.jsonl", "id": 42502, "text": "If you choose to publish the evaluation information in anonymous way, we will not show your nickname and avatar.", "label": ["Important", "Edit/Control"], "rewrite": "If you choose to publish the evaluation information in anonymous way, we will not show your nickname and avatar."}
{"task": "rw_15.jsonl", "id": 42503, "text": "Please note that the information you upload, publish or share may cause your personal information and even sensitive personal information of your or others.", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42504, "text": "You can choose to clear the content that may lead to personal information disclosure before uploading, publishing and sharing related information.", "label": ["Edit/Control", "Important"], "rewrite": "You can choose to clear the content that may lead to personal information disclosure before uploading, publishing and sharing related information."}
{"task": "rw_15.jsonl", "id": 42505, "text": "If you publish the information that contains personal information of others, you must ensure that it is allowed to use or obtained legal authorization as allowed by laws and regulations before uploading and publishing.", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42506, "text": "Correspondingly, other users upload, publish, or share information may also contain some of your information (such as the information related to you).", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42507, "text": "7. Provide you for travel services", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42508, "text": "When you use a taxi service such as a taxi on the public comments, we may also collect your itinerary information. For specific information collection and use rules, please refer to the \"Meituan Taxi Privacy Policy\" in the attachment.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use a taxi and wait for travel services, we may also collect your itinerary information."}
{"task": "rw_15.jsonl", "id": 42509, "text": "8. Help you complete the payment. When you pay for orders in the public comment, you can choose a public comment and its related parties (such as Meituan Pay) or a third -party cooperation agency (such as WeChat Pay, QQ Wallet, Apple, Apple, ApplePayment provided by partners such as Pay and Alipay.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you pay for order, you can choose the services provided by the public comments and its related parties or the third -party cooperation agency for payment."}
{"task": "rw_15.jsonl", "id": 42510, "text": "We need to collect your popular comment order information, reconciliation information and other legal requirements for the necessary information and share it with these cooperation agencies to confirm your payment instructions and help you complete the payment.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "We need to collect your popular comment order information, reconciliation information and other legal requirements for the necessary information sharing to help you complete the payment."}
{"task": "rw_15.jsonl", "id": 42511, "text": "If the software version and hardware device you use support fingerprint or face ID payment, you can also choose to open or close the corresponding fingerprint or face ID payment function in the payment settings. We will provide the corresponding options during your payment process. At the same time, you will alsoYou can choose to pay for other methods such as passwords, SMS verification codes.", "label": ["Important", "Edit/Control"], "rewrite": "You can also select the corresponding fingerprint or face ID payment function in the payment settings."}
{"task": "rw_15.jsonl", "id": 42512, "text": "During the payment process, we only collect the verification results without collecting your fingerprint or face ID information directly.", "label": ["Important", "First Party Collection Information"], "rewrite": "During the payment process, we only collect the verification results without collecting your fingerprint or face ID information directly."}
{"task": "rw_15.jsonl", "id": 42513, "text": "9. Provide you/display payment, loan, financial management, insurance and other financial products/services", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42514, "text": "When you use the financial products/services provided/displayed in the public comment, we may also collect your ID information (including shadow -print), bank card information, etc. For specific information collection and use rulesSpecific service protocol/file/rules and the \"Meituan Financial Privacy Policy\" in the attachment.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use financial products/services, we may also collect your ID information, bank card information, etc."}
{"task": "rw_15.jsonl", "id": 42515, "text": "10. Provide you with live service", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42516, "text": "When you open the live broadcast service, according to the requirements of laws and regulations, you may need to conduct real -name authentication through \"face recognition\" to verify your identity.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you open a live broadcast service, you may need to perform real -name authentication through the \"face recognition\" method to verify your identity."}
{"task": "rw_15.jsonl", "id": 42517, "text": "In the process of real -name authentication, we and third -party certification agencies that provide certification services need you to provide real names, ID numbers and facial feature value information.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "In the process of real -name authentication, we and third -party certification agencies that provide certification services need you to provide real names, ID numbers and facial feature value information."}
{"task": "rw_15.jsonl", "id": 42518, "text": "This information is for the purpose stipulated in the real -name certification and laws and regulations. It will not be used as other purposes without authorization.", "label": ["Important", "Usage"], "rewrite": "The information that is only for real -name certification and the purpose stipulated in laws and regulations will not be used as other purposes without the authorization of you."}
{"task": "rw_15.jsonl", "id": 42519, "text": "At the same time, you specifically remind you that this information is personal sensitive information. You can refuse to provide it, refuse to provide the normal use of other functions that may affect the opening of the live broadcast function, but it will not affect the normal use of other functions of the public.", "label": ["Important", "Edit/Control"], "rewrite": "Refusing to provide personal sensitive information may affect the live broadcast function, but it does not affect the normal use of other functions."}
{"task": "rw_15.jsonl", "id": 42520, "text": "When you use live broadcast services, we will collect your live audio and video information and show your nickname, avatar and live information.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "When you use live broadcast services, we will collect your live audio and video information and show your nickname, avatar and live information."}
{"task": "rw_15.jsonl", "id": 42521, "text": "In order to complete the normal service of the live broadcast function, we will ask you to authorize the camera and microphone rights.", "label": ["Permission Acquisition", "Important"], "rewrite": "In order to complete the normal service of the live broadcast function, we will ask you to authorize the camera and microphone rights."}
{"task": "rw_15.jsonl", "id": 42522, "text": "If you refuse to provide authorization, you will not be able to use this function, but it will not affect your normal use of other functions.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42523, "text": "11. Provide you with customer service and after -sales service", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42524, "text": "When you get in touch with our customer service, our system may record the communication records between you and the customer service, and use your account information to verify the identity;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you get in touch with customer service, we may record the communication records between you and customer service, and use your account information to verify your identity."}
{"task": "rw_15.jsonl", "id": 42525, "text": "When you need us to provide a customer service related to your order, we may check your relevant order information in order to give you appropriate help and processing;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you need to provide a customer service related to your order, we may check your relevant order information."}
{"task": "rw_15.jsonl", "id": 42526, "text": "When you need customer service to help you modify the relevant information (such as delivery address, contact information, etc.), you may also need to provide other information outside the above information to complete the modification.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you need customer service to assist you to modify the relevant information, you may also need to provide other information outside the above information to complete the modification."}
{"task": "rw_15.jsonl", "id": 42527, "text": "In order to ensure the service experience and processing service disputes, when you call or answer the number of the number protection (privacy) during the performance of the order, the call information of you and the rider may be recorded.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you call or answer your number protection during the performance of the order, the call information between you and the bus and riding may be recorded."}
{"task": "rw_15.jsonl", "id": 42528, "text": "The collection and use rules of the above information are as follows, or see the prompt content in the order page.", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42529, "text": "(1) After authorization, when you have a service dispute with the merchant and the rider, the platform can retrieve and use recording information as the basis for the reference of the dispute.", "label": ["Important", "Usage"], "rewrite": "After authorization, when you have a service dispute with the merchant and the rider, the platform can retrieve and use recording information as a reference for resolving disputes."}
{"task": "rw_15.jsonl", "id": 42530, "text": "(2) The platform will effectively ensure the privacy and security of the two parties. The recording will be uploaded to the public review server to save, and all parties cannot download, retrieve or play recording by themselves;", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "The recording will be uploaded to the server to save, and all parties cannot download, retrieve or play recording by themselves."}
{"task": "rw_15.jsonl", "id": 42531, "text": "Except for the following circumstances, the platform will not provide the recording to anyone (including the master of the call, the name of the call): a.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Except for the following circumstances, the platform will not provide the recording to anyone: a. The authority has the right to retrieve it according to legal procedures;"}
{"task": "rw_15.jsonl", "id": 42532, "text": "b. The recording of the legal documents issued by the judicial organs was retrieved according to law.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42533, "text": "(3) After 7 days of preservation, the recording will automatically delete permanently. In case of bad reviews, complaints, disputes that have not been completed, the platform will appropriately extend the periodic of the recording preservation.", "label": ["Data Retention", "Important"], "rewrite": "After 7 days of preservation, the recording will automatically delete permanently. If there is bad reviews, complaints, disputes that have not yet been handled, will be extended."}
{"task": "rw_15.jsonl", "id": 42534, "text": "12. Provide you with security guarantee", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42535, "text": "In order to ensure your account security, transaction security, and system operation security, to meet the requirements of laws and regulations and our agreement rules, in the process of accessing and using our products/service, you will obtain your device information, network information, network information, network information, network information, networkStatus information, including the device model, hardware serial number, device MAC address, unique device recognition code (such as IMEI/Android/IDFA/Openudid/Guid/OAID, SIM card IMSI, ICCID information and other device identifiers),Software characteristics such as mobile application list, WIFI status, telecommunications operator and other software.", "label": ["Important", "First Party Collection Information", "Data Security"], "rewrite": "In the process of visiting and using the product/service, we authorize us to obtain your device information and network status information."}
{"task": "rw_15.jsonl", "id": 42536, "text": "Without your authorization, we will not obtain the above information in advance.", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42537, "text": "In order to improve the security of the services you provide, and to prevent fraud and Trojan virus more accurately, we may use or integrate your personal information, as well as our related parties and partners to obtain information you authorize or shared according to law.Based on your habits and common software information, you can comprehensively judge your account number and transaction risk, including verifying your identity, preventing, discovering, and investigating possible security risks such as fraud, network virus, and cyber attacks that violate us or related party agreements,Policies or rules to protect the legitimate rights and interests of you, other users, or we or related parties, and record some links (\"url\") that we think are risky.", "label": ["Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "We may use or integrate your personal information and share information, and comprehensively judge your account number and transaction risk based on your habits and common software information."}
{"task": "rw_15.jsonl", "id": 42538, "text": "13. We may collect personal information indirectly", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42539, "text": "In order to complete the identity verification, ensure account security, confirm the status of transaction and provide you with after -sales and dispute resolution, we may obtain your personal information from a third party after you authorize (such as the transaction objects and transactions you choose directly involved directly involved directly involvedThe third -party information system, payment institutions, etc. The transactions, payment, ticketing, hotel booking, takeaway booking and other information related to the progress of transaction progress in order to facilitate us to handle your order and ensure the smooth completion of the service, or better better wayPreventing malicious behaviors such as fraud and ordering).", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to complete the identity verification and ensure account security, we may obtain your personal information from a third party after authorization."}
{"task": "rw_15.jsonl", "id": 42540, "text": "In accordance with the requirements of the laws and regulations and the agreement with the third party, we will obtain your relevant information from the affiliated parties and partners of the public after authorization and confirm the legitimacy of the source of the information after confirming your information.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "We will obtain your relevant information from related parties and partners after you are authorized, and confirm your information after confirming the legitimacy of the source of information."}
{"task": "rw_15.jsonl", "id": 42541, "text": "(2) You can choose to authorize us to collect and use personal information.", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42542, "text": "In order to provide you with personalized and convenient services, you can choose to use the expansion function we provide. We will collect and use the following information in accordance with the laws and regulations and the following information.", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42543, "text": "This kind of information will be collected in the specific functions and business scenarios you choose. If you do not provide this information, it will not affect your basic functions of using popular reviews.", "label": ["Important", "First Party Collection Information"], "rewrite": "This kind of information will be collected in the specific functions and business scenarios you choose."}
{"task": "rw_15.jsonl", "id": 42544, "text": "1. Expansion function based on camera authorization", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42545, "text": "You can choose to turn on the camera permissions of the system, authorize the public comments to access your camera by using the functions of taking pictures, recording videos, scanning code, so that you can publish content \"sweeping\", or by taking photos or recording videos, etc.If you need to record and publish sound videos, you need to turn on the microphone right.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "You can access your camera by authorizing functions such as taking pictures, recording videos, scanning code scanning, etc., so that you can use \"sweeping\" and publishing content. If you need to record and publish sound videos, you also need to turn on the microphone right."}
{"task": "rw_15.jsonl", "id": 42546, "text": "You can also click the authorized flash when scanning the code (simple flash information does not belong to personal information) so that you can better scan the code when the light is dim.", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42547, "text": "You can close the camera function in the system permissions. Once you close it, you may not be able to achieve the code scanning function, or you cannot review or interact with the pictures, videos, etc., but it will not affect the basic functions of your popular review service.", "label": ["Important", "Edit/Control"], "rewrite": "You can close the camera function in the system permissions."}
{"task": "rw_15.jsonl", "id": 42548, "text": "2. Expansion function based on album authorization", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42549, "text": "You can choose to open the system of the system (storage permissions in some models), and authorize us to access your album through actively uploading pictures, videos, etc., so that you can publish content by uploading photos or uploading videos.", "label": ["Permission Acquisition", "Important"], "rewrite": "You can authorize us to access your photo album by actively uploading pictures, videos, etc., so that you can upload photos or upload videos."}
{"task": "rw_15.jsonl", "id": 42550, "text": "We will collect the above information you choose to upload. You can close it in the system permissions. Once you close it, you may not be able to replace the avatars, publish a picture review, etc., but it will not affect youEnjoy the basic functions of public review services.", "label": ["Important", "First Party Collection Information", "Edit/Control"], "rewrite": "We will collect the information you choose to upload, and you can turn it off in the system permissions."}
{"task": "rw_15.jsonl", "id": 42551, "text": "3. Development function based on microphone authorization", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42552, "text": "You can choose to turn on the system of microphone and use voice technology to achieve voice interaction functions such as voice search and smart order.", "label": ["Permission Acquisition", "Important"], "rewrite": "You can choose to turn on the system of microphone and use voice interactive functions."}
{"task": "rw_15.jsonl", "id": 42553, "text": "We will collect the voice information you entered in the process of using the intelligent voice technology for machine recognition, online interaction and meet your needs for searching or ordering (for example, you are using the \"smart order\" function or public comment of the use of Meituan takeawayWhen \"holding and talking\" function, we will search, display and place orders according to your needs).", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We will collect the voice information you entered in the process of using intelligent voice technology for machine recognition, online interaction and meet your needs for searching or placing orders."}
{"task": "rw_15.jsonl", "id": 42554, "text": "You can close this function in the system permissions. Once you close it, you may not be able to achieve online voice interactive functions, but it will not affect your basic function of enjoying the public review service.", "label": ["Important", "Edit/Control"], "rewrite": "You can turn off the online voice interaction function in system permissions."}
{"task": "rw_15.jsonl", "id": 42555, "text": "4. Expansion function based on address book authorization", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42556, "text": "You can authorize the address book to use our service to create communication and sharing functions, and allow public reviews to obtain the address book information and public information (avatar, nickname, etc.) in your mobile phone or other third -party social platforms, so that you and you and you can communicateThe contact person who also authorizes the opening of this function in the recording can share the relevant content (avatar, nickname, evaluation information, etc.) in public comments to achieve interactive functions.", "label": ["Permission Acquisition", "Important"], "rewrite": "You can authorize the address book to create communication and sharing functions, and allow public reviews to obtain address book information and public information in your mobile phone or other third -party social platforms."}
{"task": "rw_15.jsonl", "id": 42557, "text": "You can also authorize us to read your address book information to book services for others without having to manually enter it, such as making mobile phone bills for others to recharge.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can authorize us to read your address book information to book services for others."}
{"task": "rw_15.jsonl", "id": 42558, "text": "You can close this function in the system permissions. Once you close it, you may not be able to implement the interactive function of the address book, but it will not affect the basic functions of you enjoy the public comments services.", "label": ["Important", "Edit/Control"], "rewrite": "You can turn off the communication records in system permissions."}
{"task": "rw_15.jsonl", "id": 42559, "text": "5. Development function based on friends recommended", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42560, "text": "We may also recommend you friends or recommend you to your friends or recommend you to other users based on your authorized address book information, equipment information, friends relationships, and log information to help you expand your social circle.", "label": ["Important", "Usage"], "rewrite": "We may recommend your friends or recommend you to other users based on the address book information, equipment information, friends relationships, and log information."}
{"task": "rw_15.jsonl", "id": 42561, "text": "You can turn off or lift the relationship between friends in privacy settings, or you can manage the scope of the viewing of others (such as people who follow, fans, nicknames displayed when sharing).", "label": ["Important", "Edit/Control"], "rewrite": "You can turn off or lift your friend relationship in privacy settings, or you can manage the scope of viewing others."}
{"task": "rw_15.jsonl", "id": 42562, "text": "Once you close it, you may not be able to share and communicate with your friends on the public comments, but it will not affect your basic function of enjoying the service of the public.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42563, "text": "6. Expansion function based on calendar authorization", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42564, "text": "When you use live subscriptions, itinerary reminders, spike activities, sign -in reminder and other functions, we will apply for your device's calendar authority.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use live subscriptions, itinerary reminders, spike activities, sign -in reminder and other functions, we will apply for your device's calendar authority."}
{"task": "rw_15.jsonl", "id": 42565, "text": "After you start the relevant permissions, we will access your calendar to help you make an appointment or adjust the time of the reservations, the itinerary reminder, the spike activity reminder, and the sign -in reminder, and remind you through the calendar function at the time you make an appointment.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "After you start the calendar authority, we will access your calendar to help you make an appointment or adjust the time you have reserved."}
{"task": "rw_15.jsonl", "id": 42566, "text": "Rejection of authorization will not be able to use the appointment service, but it will not affect the normal use of other functions of public comments.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42567, "text": "7. Expansion function based on shear -based authorization", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42568, "text": "In the case of sharing or receiving information, participating in activities, we need to visit your scissor permissions locally to read the passwords, sharing codes, and links contained in it to achieve jumping, sharing, activity linkage, etc.Function or service.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "In the case of sharing or receiving information, participating in activities, we need to access your scissors permissions to read the passwords, sharing code, and links contained in it."}
{"task": "rw_15.jsonl", "id": 42569, "text": "We only upload our server only when the contents of the shear plates belong to the public reviews (such as jumping, sharing, activity linkage and other instructions).", "label": ["Data Retention", "Important"], "rewrite": "We will upload our server only when the content of the shear plate is a public comment."}
{"task": "rw_15.jsonl", "id": 42570, "text": "In addition, we will not upload other information about your cut plate to our server.", "label": ["Data Retention", "Important"], "rewrite": "We will not upload other information of your cut plate to our server."}
{"task": "rw_15.jsonl", "id": 42571, "text": "The system of some mobile phone devices prompts the application (APP) to read the shear plate, but the system prompts that it cannot be distinguished or uploaded by local processing or uploading, and due to the differences in statistical methods, the possibility of misunderstanding is not ruled out.", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42572, "text": "Therefore, if you find similar prompts and have questions, please contact us so that we can locate the problem.", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42573, "text": "(3) Others", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42574, "text": "You can make all kinds of products/services as other people through the public criticism and provide information about the actual service receiver. Earlier, please make sure that you have obtained the authorization of the relevant person.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "You can also provide relevant information about the actual service receiver. Please make sure that you have obtained the authorization of the relevant person."}
{"task": "rw_15.jsonl", "id": 42575, "text": "If we use other purposes that the information is not stated in this policy, or the information collected based on specific purposes for other purposes, it will solicit your authorization consent alone.", "label": ["Important", "Usage"], "rewrite": "If we use other purposes that the information is not stated in this policy, or the information collected based on specific purposes for other purposes, it will solicit your authorization consent alone."}
{"task": "rw_15.jsonl", "id": 42576, "text": "(4) Exception of consent", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42577, "text": "Please know that in the following situations, we do not need to obtain your authorization consent if we collect or use personal information:", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Please know that in the following situations, we do not need to obtain your authorization consent if we collect or use personal information:"}
{"task": "rw_15.jsonl", "id": 42578, "text": "1. In order to establish and fulfill the contract as a party as a party, or to implement human resources management in accordance with the labor rules and regulations and collective contracts signed in accordance with the law in accordance with the law;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to establish and fulfill the contract as a party as a party, or to implement the collection and use information necessary for human resource management in accordance with the laws and regulations formulated in accordance with the law and the collective contract signed in accordance with the law, there is no need to solicit authorization."}
{"task": "rw_15.jsonl", "id": 42579, "text": "2. In order to fulfill the statutory responsibility or the requirements of the legal volunteer;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to fulfill the statutory duties or the collection and usage information necessary for the statutory volunteer, there is no need to solicit authorization consent."}
{"task": "rw_15.jsonl", "id": 42580, "text": "3. In order to cope with emergencies, or in urgent situations, it is necessary to protect the health and property safety of natural people in emergency;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to cope with emergencies, or in urgent cases to protect the life and health of natural persons and the necessary collection and use information, no need to solicit authorization."}
{"task": "rw_15.jsonl", "id": 42581, "text": "4. Implement news reports and public opinion supervision for public interests, and handle personal information within a reasonable range;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to implement news reports and public opinion supervision, deal with personal information within a reasonable scope without soliciting authorization consent."}
{"task": "rw_15.jsonl", "id": 42582, "text": "5. Treatment of personal information that individuals are disclosed or other legally disclosed in accordance with the provisions of this Law;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In accordance with the provisions of this Law, handle individuals' self -disclosure or other personal information that have been legal and disclosed within a reasonable range, without requiring authorization consent."}
{"task": "rw_15.jsonl", "id": 42583, "text": "6. Other circumstances stipulated in laws and regulations.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Other collection and use information stipulated in laws and regulations does not need to solicit authorization."}
{"task": "rw_15.jsonl", "id": 42584, "text": "Please note that it is not personal information that cannot be recognized or unable to identify your identity or directly establish contact with you alone.", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42585, "text": "If we will be unable to connect with any specific individuals to combine with other information to identify the personal identity of natural people, or use it with personal information, such information will be regarded as personal information during the combination of use.", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42586, "text": "(5) Use rules of personal information", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42587, "text": "In order to meet your personalized needs and maintain and improve our product or service quality, we will use the following information in accordance with the laws and regulations and according to your specific authorization:", "label": ["Important", "Usage"], "rewrite": "We will use the following information if we meet the law and authorize according to your specific authorization:"}
{"task": "rw_15.jsonl", "id": 42588, "text": "1. We may collect your order information, browsing and searching information, behavioral preferences (such as the dietary habits, dining environment requirements, travel plans, common passengers/hotel/car rental information, flight compartment, luggage and ticket optionsFor information), location information, etc., and combining the information provided by you in the public comments with the information from other services, comprehensive statistics and analysis to form user portraits to recommend or display you to youProduct/service information you may be interested in, or show you personalized third -party promotion information through the system.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may collect your order information, browsing and searching information, behavioral preferences, location information, etc., and the information you provided combined with the information from other services to make comprehensive statistics and analyze itRecommended."}
{"task": "rw_15.jsonl", "id": 42589, "text": "Including push message notifications to you on the APP page, provide you with intelligent recommendations. Through SMS, APP,, email, etc., send you push messages, promote information, or display commercial advertisements, conduct returns through telephones, provide you with information consulting and other servicesOr invite you to participate in customers related to services, products or functions.", "label": ["Important", "Usage"], "rewrite": "We will use your information to push you message notification to provide you with intelligent recommendations."}
{"task": "rw_15.jsonl", "id": 42590, "text": "For example, the information collected when you use our service to show you personalized content or advertisements to you in another service.", "label": ["Important", "Usage"], "rewrite": "Use the information collected when using a certain service to show you personalized content or advertisements to you in another service."}
{"task": "rw_15.jsonl", "id": 42591, "text": "2. We may collect the information you provided to us when participating in the product/service survey, as well as the relevant information provided by your related parties and our partners, so that you can track the order situation and initiate user complaints to launch user complaintsAnd we optimize the quality and process of customer service.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may collect the information you actively provided to us, as well as the relevant information provided by your affiliated parties and our partners, so that you can track the order situation and initiate user complaints."}
{"task": "rw_15.jsonl", "id": 42592, "text": "3. We may use the personal information collected in the business to statistical analysis and improvement operations, and use information that has been identified and cannot recognize your identity and cannot be restored to establish a database and commercialize.", "label": ["Important", "Usage"], "rewrite": "We may use personal information collected in the business to statistical analysis and improvement operations, and commercialize information that has been identified and cannot be recognized and cannot be restored."}
{"task": "rw_15.jsonl", "id": 42593, "text": "For example, statistical analysis is performed through your location, preferences, etc., so as to improve our product, service or marketing plan;", "label": ["Important", "Usage"], "rewrite": "Statistically analyze through your location, preferences, etc., so as to improve product, service or marketing plan."}
{"task": "rw_15.jsonl", "id": 42594, "text": "Another example is the technical transformation, network maintenance, failure elimination, internal policy and process formulation, and generating internal reports carried out for improvement of our system.", "label": ["Usage"], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42595, "text": "(6) Equipment rights adjustment", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42596, "text": "In order to ensure the normal implementation of the relevant business functions, we need to call the corresponding permissions according to the specific use scenarios, and inquire with you before calling. Please refer to the table below for specific authority calling instructions:", "label": ["Permission Acquisition", "Important"], "rewrite": "In order to ensure the normal implementation of the relevant business functions, we need to call the corresponding permissions according to the specific use scenarios, and make a pop -up window before calling."}
{"task": "rw_15.jsonl", "id": 42597, "text": "List of Public Reviews", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42598, "text": "You can select the closing part or all permissions in the setting of the device, which may cause the corresponding business functions to be unable to achieve or achieve the expected effect.", "label": ["Edit/Control", "Important"], "rewrite": "You can select the closing part or all permissions in the settings of the device."}
{"task": "rw_15.jsonl", "id": 42599, "text": "2. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42600, "text": "(1) Use of cookies", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42601, "text": "In order to ensure the normal and efficient operation of the website, get a easier access experience for you, and recommend the content you may be interested in, we will store the small data file of the cookie on your device terminal/system.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will store small data files named Cookie on your device terminal/system."}
{"task": "rw_15.jsonl", "id": 42602, "text": "Cookie will help you call your information when visiting our website in follow -up, simplify your process of filling in your personal information (such as one -click login, etc.);", "label": ["Important", "Usage"], "rewrite": "Cookie helps you call your information when visiting our website in follow -up, simplify your personal information."}
{"task": "rw_15.jsonl", "id": 42603, "text": "Provide you with a preference for safe shopping;", "label": ["Important", "Usage"], "rewrite": "Cookie is used to provide you with a preference for safe shopping."}
{"task": "rw_15.jsonl", "id": 42604, "text": "Help you optimize the choice and interaction of advertising;", "label": ["Important", "Usage"], "rewrite": "Cookie is used to help you optimize the choice and interaction of advertising."}
{"task": "rw_15.jsonl", "id": 42605, "text": "Protect your data security and so on.", "label": ["Important", "Usage"], "rewrite": "Cookie is used to protect your data security."}
{"task": "rw_15.jsonl", "id": 42606, "text": "We will not use Cookie for any purpose except the purpose of this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42607, "text": "You can manage or delete according to your preferences, cookies.", "label": ["Important", "Edit/Control"], "rewrite": "You can manage or delete Cookie according to your preferences."}
{"task": "rw_15.jsonl", "id": 42608, "text": "You can clear all, cookie kept on your computer or mobile device, and you have the right to accept or refuse cookies.", "label": ["Important", "Edit/Control"], "rewrite": "You can remove all the cookies saved on your computer or mobile device, and you have the right to accept or refuse cookies."}
{"task": "rw_15.jsonl", "id": 42609, "text": "Most browsers will automatically accept cookies, but you can usually modify the browser settings according to your needs to reject cookies;", "label": ["Important", "Edit/Control"], "rewrite": "You can usually modify the browser settings according to your needs to reject cookies."}
{"task": "rw_15.jsonl", "id": 42610, "text": "In addition, you can also remove all Cookie stored in the software.", "label": ["Edit/Control", "Important"], "rewrite": "You can also remove all the cookies stored in the software."}
{"task": "rw_15.jsonl", "id": 42611, "text": "But you may not fully experience some convenience and security service functions.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42612, "text": "(2) The use of network beacon and similar technologies", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42613, "text": "In addition to Cookie, we often include other similar technologies such as electronic images (called \"single pixels\" GIF files or \"network Beacon\") on the webpage. They can help the website calculate the users of webpages or access certain cookies.", "label": ["Important", "First Party Collection Information"], "rewrite": "Electronic image technology can help websites to calculate users who browse webs or visit certain cookies."}
{"task": "rw_15.jsonl", "id": 42614, "text": "We use the network beacon method::", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42615, "text": "1. We use the network beacon on our website, calculate the number of user access, and access the Cookie identification registered users by accessing Cookie.", "label": ["Important", "First Party Collection Information"], "rewrite": "Use the network Beacon to calculate the number of user access and access the Cookie identification registered users by accessing Cookie."}
{"task": "rw_15.jsonl", "id": 42616, "text": "2. We can provide personalized services on our website through the cookie information we get.", "label": ["Important", "Usage"], "rewrite": "We can provide personalized services on our website by obtaining cookie information."}
{"task": "rw_15.jsonl", "id": 42617, "text": "3. How can we share, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42618, "text": "(1) Sharing", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42619, "text": "When we provide products/services to you, we will take strict security measures. We will not share your personal information with any companies, organizations and individuals other than public comments in the products/services we have completed.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will not share your personal information with any companies, organizations and individuals other than public comments."}
{"task": "rw_15.jsonl", "id": 42620, "text": "But please know that most of the products/services we provide cannot be completed alone, so we may share or entrust them to handle some of your personal information with our related companies and other partners to ensure and optimize usThe product/service provided for you, this situation includes:", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "We may share or entrust them to handle some of your personal information with our related companies and other partners."}
{"task": "rw_15.jsonl", "id": 42621, "text": "1. Provide platform services.", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42622, "text": "We may provide you with products/services as an e -commerce platform. If you use the products/services provided by merchants or other partners on our platform, we may share your necessary personal information with the corresponding product/service provider, So that you can use the corresponding browsing, ordering, trading, payment and other functions normally.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You can use the products/services provided by merchants or other partners on our platform, and we may share your necessary personal information with the provider of the corresponding product/service."}
{"task": "rw_15.jsonl", "id": 42623, "text": "2. Provide unified management services.", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42624, "text": "If you log in and use our account to log in and use the products/services provided by our affiliated companies and other third parties, we may share your personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you log in to our account and use the product/services provided by the third party, we may share your personal information."}
{"task": "rw_15.jsonl", "id": 42625, "text": "We will only share the necessary personal information in order to provide you with consistent services and unified management, such as checking orders and managing in our products/services.The purpose will once again solicit your authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only share the necessary personal information in order to provide you with consistent services and unified management."}
{"task": "rw_15.jsonl", "id": 42626, "text": "3. Provide necessary cooperation services.", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42627, "text": "In order to achieve the purpose of this policy, some of our services will be provided by business partners.", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42628, "text": "To ensure the successful completion of the services provided for you, we may share your personal information with our partners, including suppliers, service partners, and third -party merchants in distribution business, technical services, payment services, financial business services, etc.It may include your contact information, order information, payment information, address information, etc.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share your personal information with our partners, including suppliers, service partners, and third -party merchants, including distribution business, technical services, payment services, financial business services, etc."}
{"task": "rw_15.jsonl", "id": 42629, "text": "For example, when you use our takeaway service, we must share your orders and distribution information with distribution service partners to ensure the safe and accurate delivery of the order;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When you use our takeaway service, we must share your orders and delivery information with the delivery service partner."}
{"task": "rw_15.jsonl", "id": 42630, "text": "Another example is we need to share your order number and order amount with a third -party payment institution to achieve confirmation of your payment instructions and complete the payment;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We need to share your order number and order amount with third -party payment institutions to achieve confirmation of your payment instructions and complete payment."}
{"task": "rw_15.jsonl", "id": 42631, "text": "Share your order information and necessary transaction information with third -party merchants so that they can provide you with goods, services and after -sales.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We share your order information and necessary transaction information with third -party merchants so that they can provide you with goods, services and after -sales."}
{"task": "rw_15.jsonl", "id": 42632, "text": "Among them, your contact information and address information are personal sensitive information. We will strive to protect your personal information by taking appropriate measures such as \"number protection\" and \"hiding\" on documents.", "label": ["Important", "Data Security"], "rewrite": "We will strive to protect your personal information by taking appropriate measures such as \"number protection\" and \"address hiding\" on documents."}
{"task": "rw_15.jsonl", "id": 42633, "text": "4. Safe security and optimization services.", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42634, "text": "In order to ensure your safety when using our products/services and optimize our services, we may share your necessary information with our relevant partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share your necessary information with our relevant partners to ensure security and optimization services."}
{"task": "rw_15.jsonl", "id": 42635, "text": "Safety guarantee service.", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42636, "text": "In order to ensure your account security and avoid risks such as fraud, network virus, and cyber attacks, we may use partners to share with our security guarantee partnersSoftware information and other to comprehensively judge your account number and transaction risk to prevent the occurrence of security incidents.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We may share the necessary device information and log information related to your related partners."}
{"task": "rw_15.jsonl", "id": 42637, "text": "Statistics and optimization services.", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42638, "text": "After authorization, we may share information with partners who provide advertising promotion and statistical analysis. It is used to analyze the above information and provide advertising exposure monitoring or service decisions to provide you with better serviceEssence", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share information with advertising partners. Relevant partners may gather analysis of the above information and provide advertising exposure monitoring or service decisions."}
{"task": "rw_15.jsonl", "id": 42639, "text": "But we will only provide information such as the coverage, effectiveness, and statistical categories of advertising promotion to these partners without sharing personal information that can identify your identity, otherwise we will identify this information to avoid your identity to your identity.Identification.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will only provide statistical categories such as advertising partners without sharing personal information that can identify your identity."}
{"task": "rw_15.jsonl", "id": 42640, "text": "5. Secondary check service.", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42641, "text": "The secondary inspection service of the mobile phone number in this business is provided by a third -party China Telecom operator, China Unicom operator, and Chinese mobile operators. In order to ensure your account security, we may put your mobile phone number and mobile phone number on the public comment on the public reviewThe binding time (accurate to the sky) is provided to such service providers.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "The secondary check service of the mobile phone number in this business is provided by a third party. We may provide your mobile phone number and mobile phone number at the binding time of the public comment to such service providers."}
{"task": "rw_15.jsonl", "id": 42642, "text": "6. Provided based on statutory situations.", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42643, "text": "In accordance with the provisions of laws and regulations, the need for litigation disputes, the relevant agreements you signed with us (including the electronic agreement and platform rules signed online) or legal documents, or when the administrative, judicial authorities have the right to make requirements in accordance with the law, we may shareYour personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In accordance with the provisions of laws and regulations, the need for litigation disputes, the relevant agreements or legal documents you signed with us, or the administrative, judicial authorities such as administrative, judicial authorities, etc., we may share your personal information."}
{"task": "rw_15.jsonl", "id": 42644, "text": "7. In addition to the above situations, if we share your personal information for any other companies, organizations, and individuals, we will solicit your clear consent or authorization again.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In addition to the above situations, if we share your personal information about any other companies, organizations, and individuals, we will solicit your clear consent or authorization again."}
{"task": "rw_15.jsonl", "id": 42645, "text": "We will use the application interface (API), software tool development package (SDK) to share the necessary data sharing with third parties. Different versions of third -party SDKs will be different, generally including third -party account login, sharing, third -partyPayment category, map navigation category, manufacturer push, statistical categories, etc., we will conduct strict security testing and agreed data protection measures for third parties.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will use API and SDK to share the necessary data sharing with third parties, and we will conduct strict security testing of third parties and agreed data protection measures."}
{"task": "rw_15.jsonl", "id": 42646, "text": "Public comment and third -party sharing personal information list", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42647, "text": "Please know that we will only share your personal information for legal, correct, necessary, specific, and clear purposes. For companies, organizations, and individuals that shared personal information for us to realize the purpose of this policy, we, weIt will sign strict information protection and confidentiality agreement with them, asking them to abide by the agreement and take relevant security measures to protect your personal information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will only share your personal information for legal, correct, necessary, specific, and clear purposes, and sign strict information protection and confidentiality agreement with them, asking them to protect your personal information."}
{"task": "rw_15.jsonl", "id": 42648, "text": "(2) Transfer", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42649, "text": "With the development of our business, we and our affiliated parties may conduct merger, acquisition, reorganization, asset transfer or similar transactions. If the transfer of personal information, we will ask companies and organizations that give your personal information to continue to acceptThe constraints of this privacy policy, otherwise, we will ask the company and the organization to solicit your authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When involving mergers, acquisitions, or bankruptcy liquidation, if personal information transfer is involved, it will be required to continue to be bound by the policy, otherwise it will request that it will re -solicit authorization consent."}
{"task": "rw_15.jsonl", "id": 42650, "text": "Except for the above situations, we will not transfer your personal information without your clear consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Except for the above situations, we will not transfer your personal information without your clear consent."}
{"task": "rw_15.jsonl", "id": 42651, "text": "(3) Public disclosure", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42652, "text": "We will only disclose your personal information only under the following circumstances and adopt the premise that we meet the industry standards:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only disclose your personal information only under the following circumstances and adopt the premise that we meet the industry standards:"}
{"task": "rw_15.jsonl", "id": 42653, "text": "1. According to your needs, disclose the personal information you specified under your clear consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "According to your needs, disclose your personal information you specified under the disclosure of your clear consent."}
{"task": "rw_15.jsonl", "id": 42654, "text": "2. When the requirements of laws and regulations, mandatory administrative law enforcement or judicial requirements must provide your personal information, we may disclose your personal information according to the types of personal information and disclosure required.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In accordance with the requirements of laws and regulations, mandatory administrative law enforcement or judicial requirements, we may disclose your personal information."}
{"task": "rw_15.jsonl", "id": 42655, "text": "Under the premise of compliance with laws and regulations, when we receive a request for the above disclosure information, we ask we must issue corresponding legal documents such as tickets or investigation letters.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "When we receive a request for the above disclosure information, we ask we must issue corresponding legal documents."}
{"task": "rw_15.jsonl", "id": 42656, "text": "Please note that when you use our service, you voluntarily publish or even publicly shared information may involve your personal information and even personal sensitive information, such as your transaction information, and you choose to upload texts containing personal information when evaluatingVarious forms of information such as pictures or videos.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Please note that when you use your service, you voluntarily publish or even publicly shared information may involve your personal information and even personal sensitive information."}
{"task": "rw_15.jsonl", "id": 42657, "text": "When using our services, please consider whether to publish or even share relevant information.", "label": ["Important", "Edit/Control"], "rewrite": "Please consider it carefully to publish or even share relevant information."}
{"task": "rw_15.jsonl", "id": 42658, "text": "(4) Sharing, transfer, and public disclosure of disclosure of personal information.", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42659, "text": "In the following circumstances, sharing, transfer, and publicly disclose your personal information without obtaining your authorization consent in advance:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the following circumstances, sharing, transfer, and publicly disclose your personal information without obtaining your authorization consent in advance:"}
{"task": "rw_15.jsonl", "id": 42660, "text": "1. It is related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The sharing or disclosure directly related to national security and national defense security does not require authorization."}
{"task": "rw_15.jsonl", "id": 42661, "text": "2. Related to public safety, public health, and major public interests;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Sharing or disclosure directly related to public safety, public health and major public interests does not need to be authorized."}
{"task": "rw_15.jsonl", "id": 42662, "text": "3. It is related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Sharing or disclosure related to criminal investigation, prosecution, trial, and judgment execution does not need to be authorized."}
{"task": "rw_15.jsonl", "id": 42663, "text": "4. For major legitimate rights and interests such as maintaining your or other individuals, but it is difficult to get my consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Out of the major legitimate rights and interests of the life and property of the subject of personal information or other individuals, it is difficult to get shared or disclosed by my consent, and there is no need to solicit."}
{"task": "rw_15.jsonl", "id": 42664, "text": "5. Other situations that safeguard public interests, such as your credit evaluation information needs to be public/shared;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Other sharing, transfer or disclosure of personal information to protect public interests does not need to be authorized."}
{"task": "rw_15.jsonl", "id": 42665, "text": "6. Personal information that you disclose to the public by yourself;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The collected personal information is the sharing or disclosure of your public public to the public, without having to solicit authorization."}
{"task": "rw_15.jsonl", "id": 42666, "text": "7. Collect personal information from legal public information, such as legal news reports and government information disclosure.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you collect personal information from the legal and public information, you do not need to solicit authorization, but you clearly refuse or processed the information to infringe your major interests."}
{"task": "rw_15.jsonl", "id": 42667, "text": "But you clearly refuse or handle this information to infringe your major interests.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42668, "text": "8. Other situations where other regulations can be obtained without authorization.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The sharing or disclosure of other laws and regulations and other regulations does not need to be authorized."}
{"task": "rw_15.jsonl", "id": 42669, "text": "According to the law, sharing, transfer, and publicly disclose personal information that is identified by de -identification processing, and ensure that the data receiver cannot restore and re -identify the subject of personal information. We will not notify you separately and obtain it to youYour consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We do not need to notify you and obtain your consent without the processing of de -identified data."}
{"task": "rw_15.jsonl", "id": 42670, "text": "4. How do we save and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42671, "text": "(1) Preservation of personal information", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42672, "text": "1. Storage period: We will only retain your personal information within the time limit required for the purpose of the cost of reaching the cost of the cost, unless laws and regulations have compulsory retention requirements, such as the \"E -Commerce Law of the People's Republic of China\" requires commodity and service information, and service information, and service information,The preservation time of transaction information is not less than three years from the date of the transaction.", "label": ["Data Retention", "Important"], "rewrite": "Generally, your personal information is retained within the time limit required to achieve service purposes, unless the law has other requirements."}
{"task": "rw_15.jsonl", "id": 42673, "text": "We judge the storage period of personal information mainly refer to the following standards and based on the elders: to complete the transaction purpose related to your transaction, maintain the corresponding transactions and business records to cope with your possible inquiries or complaints;", "label": ["Data Retention", "Important"], "rewrite": "The storage period of personal information is mainly referred to the following standards and the elders are based on the elders: to complete the transaction purpose related to your transaction, maintain the corresponding transaction and business records to cope with your possible inquiries or complaints;And quality; Do you agree to a longer retention period; whether there are other special agreement or laws and regulations on the retention period."}
{"task": "rw_15.jsonl", "id": 42674, "text": "Make sure we provide you with service safety and quality;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42675, "text": "Do you agree to a longer retention period;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42676, "text": "Whether there are other special agreement or laws and regulations on the retention period.", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42677, "text": "After exceeding the reservation period, we will delete your personal information according to the requirements of the applicable law, or make it anonymous processing.", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42678, "text": "When you actively cancel your account, we will process data processing according to the requirements of laws and regulations.", "label": ["Data Retention", "Important"], "rewrite": "When you actively cancel your account, we will process data processing according to the requirements of laws and regulations."}
{"task": "rw_15.jsonl", "id": 42679, "text": "2. Save the area: The personal information we collected and generated in the territory of the People's Republic of China will be stored in China, except for the following situations:", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in domestic operations will be stored in China."}
{"task": "rw_15.jsonl", "id": 42680, "text": "(1) The laws and regulations are clearly stipulated;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42681, "text": "(2) Get your authorization consent alone;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42682, "text": "(3) Personal behaviors such as cross -border reservation, ordering, and transactions you initiated (such as purchasing international air tickets, booking international hotels, etc.).", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42683, "text": "In the above situation, we will perform the corresponding processes and obligations in accordance with the requirements of laws and regulations, and require the data receiver to handle personal information in accordance with the privacy policies and other related security and confidentiality measures.", "label": ["Data Retention", "Important"], "rewrite": "If the data is transmitted cross -border, we will perform the corresponding processes and obligations in accordance with the requirements of laws and regulations, and require the data receiver to handle personal information in accordance with the privacy policy and other related security and confidentiality measures."}
{"task": "rw_15.jsonl", "id": 42684, "text": "3. Termination operation: If the termination operation and other circumstances, we will notify you at least 30 days in advance, and will deal with your personal information according to the requirements of laws and regulations after terminating operations.", "label": ["Important", "Cessation of Operations"], "rewrite": "When stopping operations, we will notify it in advance and delete or processes your personal information."}
{"task": "rw_15.jsonl", "id": 42685, "text": "(2) Protection measures for personal information", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42686, "text": "1. Data security measures", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42687, "text": "In order to ensure your information security, we strive to take various physical, electronics and management security measures that meet industry standards to protect your personal information, and establish data classification hierarchical systems, data security management specifications, and data security development specifications to manage specifications to manage specificationsStorage and use of personal information.", "label": ["Important", "Data Security"], "rewrite": "We strive to adopt various physical, electronics and management security measures that meet industry standards to protect your personal information, and establish data classification hierarchical system, data security management specifications, and data security development specifications to manage the storage and use of personal information."}
{"task": "rw_15.jsonl", "id": 42688, "text": "Popular comments use information contacts confidentiality agreements, monitoring and auditing mechanisms to fully control the data to prevent your personal information from being unauthorized, publicly disclosed, used, modified, damaged, or lost.", "label": ["Important", "Data Security"], "rewrite": "Through information -contact confidentiality agreements, monitoring and auditing mechanisms to control the data comprehensively and securely to prevent your personal information leakage."}
{"task": "rw_15.jsonl", "id": 42689, "text": "For example, when you exchange data (such as credit card information) between your browser and \"service\" (such as credit card information);", "label": ["Important", "Data Security"], "rewrite": "SSL encryption protection technology is used when you exchange data between your browser and \"service\"."}
{"task": "rw_15.jsonl", "id": 42690, "text": "At the same time, the website itself provides HTTPS security browsing methods;", "label": ["Important", "Data Security"], "rewrite": "Provide the website itself to provide HTTPS security browsing methods."}
{"task": "rw_15.jsonl", "id": 42691, "text": "Use encryption technology to ensure the confidentiality of data;", "label": ["Important", "Data Security"], "rewrite": "Use encryption technology to ensure the confidentiality of data."}
{"task": "rw_15.jsonl", "id": 42692, "text": "Using a trusted protection mechanism to prevent data from being maliciously attacked;", "label": ["Important", "Data Security"], "rewrite": "Using a trusted protection mechanism to prevent data from being maliciously attacked."}
{"task": "rw_15.jsonl", "id": 42693, "text": "Deploy the access control mechanism to ensure that only authorized personnel can access personal information;", "label": ["Important", "Data Security"], "rewrite": "Deploy the access control mechanism to ensure that only authorized personnel can access personal information."}
{"task": "rw_15.jsonl", "id": 42694, "text": "As well as holding safety and privacy protection training courses to strengthen employees' awareness of protecting the importance of personal information.", "label": ["Important", "Data Security"], "rewrite": "Organize safety and privacy protection training courses to strengthen employees' awareness of protecting the importance of personal information."}
{"task": "rw_15.jsonl", "id": 42695, "text": "2. Safety certification", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42696, "text": "We have passed the certification qualifications such as the international certification of data security certification of the Ministry of Public Security's information security level protection, ISO27001 information security certification, the third -party payment industry (PCI, DSS) data security standard international certification and other certification qualifications.Establish a good coordination and communication mechanism, timely resist and dispose of various information security threats, and provide a comprehensive guarantee for your information security.", "label": ["Important", "Data Security"], "rewrite": "We have passed the certification qualifications such as the third -party information security standard for the protection of information security level protection, ISO27001 information security certification, and international certification in the third -party payment industry."}
{"task": "rw_15.jsonl", "id": 42697, "text": "3. Please know and understand that the Internet is not an absolute security environment. We strongly recommend that you help us ensure your account security through security methods and complex passwords.", "label": ["Important", "Data Security"], "rewrite": "It is recommended that you use complex passwords to help us guarantee your account security."}
{"task": "rw_15.jsonl", "id": 42698, "text": "If you find your personal information disclosure, especially your account or password, please contact us according to the contact information provided in this privacy policy in order to take corresponding measures.", "label": ["Important", "Data Security"], "rewrite": "If your personal information is leaked, please contact our customer service immediately."}
{"task": "rw_15.jsonl", "id": 42699, "text": "4. Safety events", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42700, "text": "After unfortunately a personal information security incident, we will immediately set up a special emergency team to start emergency plans to prevent the expansion of security events, and inform you in a timely manner in accordance with the requirements of laws and regulations: the basic situation and possible impact of the security incident, we have adopted the adoptionIt may take disposal measures, suggestions that you can prevent and reduce risks, and remedy measures for your remedy.", "label": ["Important", "Data Security"], "rewrite": "If a personal information security incident occurs, we will inform your basic situation, possible impact, disposal measures, independent prevention suggestions, etc."}
{"task": "rw_15.jsonl", "id": 42701, "text": "We will promptly inform you that the incident -related situation is informing the email, letter, telephone, push notification, etc. When it is difficult to inform the subject of personal information one by one, we will publish an announcement in a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "The relevant situation of security incidents will be informed by mail, letter, telephone, push notification, etc. When it is difficult to inform one by one, it will issue an announcement."}
{"task": "rw_15.jsonl", "id": 42702, "text": "At the same time, we will also actively report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "Report the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities."}
{"task": "rw_15.jsonl", "id": 42703, "text": "5. How do you manage your personal information", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42704, "text": "You have the following rights to your personal information:", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42705, "text": "(1) You have the right to access, correct, and delete your personal information, except for the exception stipulated in laws and regulations.", "label": ["Important", "Edit/Control"], "rewrite": "You have the right to access, correct, and delete your personal information, except for the exception stipulated in laws and regulations."}
{"task": "rw_15.jsonl", "id": 42706, "text": "You can manage your information through the following ways:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42707, "text": "Personal information inspection and management: You can check and manage personal information by visiting the popular comment app \"My\"-\"Settings\"-\"Personal Information Collection List\".", "label": ["Important", "Edit/Control"], "rewrite": "You can check and manage personal information by visiting the public review app \"My\"-\"Settings\"-\"Personal Information Collection List\"."}
{"task": "rw_15.jsonl", "id": 42708, "text": "Account Information -You can access it through the \"My\" page, correct the personal information and account information in your account (except identity authentication information), payment information, account binding information, etc. You can also change your password, add security information, add security informationOr the unbinding of third -party accounts and bank cards, you can perform such operations in settings by accessing webpages and APPs.", "label": ["Edit/Control", "Important"], "rewrite": "You can access your personal information and account information, payment information, account binding information, etc. through the \"My\" page, you can also change your password, add security information, or solve the solution of a third -party account and bank card.Tied."}
{"task": "rw_15.jsonl", "id": 42709, "text": "Address Information-You can add, change, and delete your \"My\"-\"Settings\"-\"Personal Information\" or \"My Address\" or delete your \"My\"-\"Settings\"-\"Personal Information\" on the Page of Public Review.Receive address information (including the name of the consignee, gender, delivery address, phone number, etc.).", "label": ["Edit/Control", "Important"], "rewrite": "You can add, change, and delete your delivery address information at any time by visiting the \"My\"-\"Settings\"-\"Personal Information\" or \"My Address\" or \"My Address\" on the Public Review Webpage/APP pageEssence"}
{"task": "rw_15.jsonl", "id": 42710, "text": "Search for browsing information-you can access or clear your search history, viewing and modifying interests, and managing other data in the public review webpage/app to access or clear your search history.", "label": ["Important", "Edit/Control"], "rewrite": "You can access or clear your search history, \"My\"-\"Mine\"-\"Recent Browse\" and other data through search columns in the public comment bar."}
{"task": "rw_15.jsonl", "id": 42711, "text": "Order information-You can pass, \"My\"-\"Order\" page view all orders that have been completed, payable, after-sales, and evaluation.", "label": ["Important", "Edit/Control"], "rewrite": "You can check all the orders that you have completed, pay, after-sales, and evaluation through the \"My\"-\"Order\" page."}
{"task": "rw_15.jsonl", "id": 42712, "text": "You can choose to delete the completed order information, but this may cause us to accurately provide corresponding after -sales services according to your purchase information.", "label": ["Important", "Edit/Control"], "rewrite": "You can choose to delete the completed order information."}
{"task": "rw_15.jsonl", "id": 42713, "text": "Evaluation information-you can access, edit, and delete your evaluation content through \"My\"-\"Personal Homepage\";", "label": ["Important", "Edit/Control"], "rewrite": "You can access, edit, and delete your evaluation content through \"My\"-\"Personal Homepage\"."}
{"task": "rw_15.jsonl", "id": 42714, "text": "You can add the evaluation content through \"My\"-\"To Evaluation\" or \"My\"-\"Order\"-\"All Order\"-\"Evaluation\" or accessing the specific merchant page, click the \"Write Evaluation\" button below;", "label": ["Edit/Control", "Important"], "rewrite": "You can add the evaluation content through \"My\"-\"To Evaluation\" or \"My\"-\"Order\"-\"All Order\"-\"Evaluation\" or accessing the specific merchant page, click the \"Write Evaluation\" button below."}
{"task": "rw_15.jsonl", "id": 42715, "text": "You can also add the evaluation content or write notes by directly accessing the homepage and sliding out of the right to the right.", "label": ["Important", "Edit/Control"], "rewrite": "You can add the evaluation content or write notes by directly accessing the homepage and sliding out of the right to the right."}
{"task": "rw_15.jsonl", "id": 42716, "text": "Please know that according to the requirements of the laws and regulations and the technical conditions of different information, we may not be able to completely delete the corresponding information you want to delete immediately from the system. Prior to this, we will only store and storage the corresponding information according to the requirements of the regulations and regulations.Take the necessary safety protection measures.", "label": ["Important", "Edit/Control"], "rewrite": "Before the system deletes the corresponding information you want to delete, we will only store the corresponding information and take necessary security measures."}
{"task": "rw_15.jsonl", "id": 42717, "text": "Please note that the operation settings of different operating systems and different software versions may be slightly different;", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42718, "text": "If you cannot manage these personal information through the above links, you can contact us at any time through the feedback method provided in this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42719, "text": "We will reply to your access request within 15 days.", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42720, "text": "In addition, in accordance with the requirements of laws and regulations, in specific situations, in addition to your other arrangements, your close relatives can exercise the above rights for your relevant personal information for your own legal and legitimate interests.", "label": ["Edit/Control", "Important"], "rewrite": "For your own legal and legitimate interests, your close relatives can exercise the above rights on your relevant personal information."}
{"task": "rw_15.jsonl", "id": 42721, "text": "(2) Change the scope of your authorization consent or withdraw authorization", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42722, "text": "You can change the consent range or withdraw your authorization by deleting information in the Public Review APP, changing privacy settings, or closing equipment permissions in the system or withdrawing your authorization.", "label": ["Edit/Control", "Important"], "rewrite": "You can change the consent range or withdraw your authorization by deleting information in the Public Review APP, changing privacy settings, or closing equipment permissions in the system or withdrawing your authorization."}
{"task": "rw_15.jsonl", "id": 42723, "text": "You can operate management and withdraw your system authorization in the APP through \"My\"-\"Settings\"-\"Privacy Management\"-\"System Power Management\".", "label": ["Important", "Edit/Control"], "rewrite": "You can operate management and withdraw your system authorization in the APP through \"My\"-\"Settings\"-\"Privacy Management\"-\"System Power Management\"."}
{"task": "rw_15.jsonl", "id": 42724, "text": "Please understand that when you perform the above operations, we will not be able to continue to provide you with the service corresponding to the withdrawal consent or authorization, but it will not affect the personal information processing that has been developed based on your authorization.", "label": ["Edit/Control", "Important"], "rewrite": "Withdrawal authorization will not affect personal information processing based on previous authorization."}
{"task": "rw_15.jsonl", "id": 42725, "text": "(3) Logging out the account", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42726, "text": "You have the right to cancel your account, and you can conduct online operations in the \"Settings\" - \"Account and Security\" - \"Logging out\" on our APP page for online operation.", "label": ["Important", "Edit/Control"], "rewrite": "You can cancel the online operation online through the \"Settings\" - \"Account and Security\" - \"Logging out of the public comment account\" on the APP page."}
{"task": "rw_15.jsonl", "id": 42727, "text": "After you successfully cancel, in addition to laws and regulations and corresponding national standards, we will delete your personal information or make anonymous processing.", "label": ["Important", "Edit/Control"], "rewrite": "After cancellation, personal information will be deleted or anonymous."}
{"task": "rw_15.jsonl", "id": 42728, "text": "If you cannot access, correct or delete your personal information and cancel your account in the above method, or if you think that the public comments are collecting and using your personal information, you can use our customer service or through this privacy policyOther ways are provided to get in touch with us.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42729, "text": "In order to ensure safety, we may need to provide the corresponding way to prove the legitimacy of your identity and request. We will answer your request within 15 days after receiving your feedback and verifying your identity.", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "We may need you to provide the corresponding way to prove the legitimacy of your identity and request, and answer your request within 15 days."}
{"task": "rw_15.jsonl", "id": 42730, "text": "For your reasonable request, we do not charge fees in principle, but we will charge a certain cost fee depending on the request that repeats and beyond the reasonable limit.", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42731, "text": "For those who have no repetition and need too much technical means (for example, need to develop new systems or fundamentally change the current practice), bring risks to others' legitimate rights and interests or very unrealistic (for example, information involved in backup tapes)We may refuse.", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "We may refuse to repeat for unseen, need too much technical means, bring risks or very unrealistic requests to others' legitimate rights and interests."}
{"task": "rw_15.jsonl", "id": 42732, "text": "(4) Autonomous management control marketing information and directional push", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42733, "text": "Message push -if you don't want to receive message notifications on the APP page, you can refuse to receive message notifications when installing the APP for the first time, or turn off the corresponding notification function in the \"Notice\" center in the mobile operating system.", "label": ["Edit/Control", "Important"], "rewrite": "You can refuse to receive message notifications when installing the APP for the first time, or turn off the corresponding notification function in the \"Notice\" center in the mobile operating system."}
{"task": "rw_15.jsonl", "id": 42734, "text": "Personalized recommendation -If you do not want to use our intelligent recommendation service, you can choose to sort according to the way of distance, praise, price, etc. without your personal characteristics.Do not want to watch \"\" functions such as \"such as\" functions for precise feedback and real -time shutdown;", "label": ["Important", "Edit/Control"], "rewrite": "You can choose to sort according to the personal characteristics such as distance, praise, price, etc., or you can accurately feedback and close personalized recommendations through functions such as \"not interested\" and \"don't want to see\" in the recommendation information page."}
{"task": "rw_15.jsonl", "id": 42735, "text": "You can also control independent management control in \"My\"-\"Settings\"-\"Privacy Management\"-\"Personalized Settings\".", "label": ["Important", "Edit/Control"], "rewrite": "You can control autonomous management control in \"My\"-\"Settings\"-\"Privacy Management\"-\"Personalized Settings\"."}
{"task": "rw_15.jsonl", "id": 42736, "text": "Personalized advertisements-If you do not want to receive personalized advertisements, you can control the switch yourself in \"My\"-\"Settings\"-\"Privacy Management\"-\"Personalized Settings\". When you closeAdvertising correlations will be reduced, but advertisements will not disappear.", "label": ["Important", "Edit/Control"], "rewrite": "If you don't want to receive personalized advertisements, you can control your own control switch in \"My\"-\"Settings\"-\"Privacy Management\"-\"Personalized Settings\"."}
{"task": "rw_15.jsonl", "id": 42737, "text": "Promotion/return visits -If you do not want to receive our promotion text messages or telephone return visits, you can withdraw through the corresponding withdrawal function in the information, or explicitly reject it during the telephone return visit.", "label": ["Important", "Edit/Control"], "rewrite": "You can be withdrawn through the corresponding withdrawal function in the information, or explicitly expressed the refusal/return visit during the telephone return visit."}
{"task": "rw_15.jsonl", "id": 42738, "text": "6. Protection of personal information of minors", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42739, "text": "Public comment attaches great importance to the protection of personal information of minors.", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42740, "text": "Our websites and services are mainly adults.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42741, "text": "If you are a minor, it is recommended that you ask your parents or guardians to read this privacy policy carefully and the \"Privacy Policy of the Minor Privacy\" that we specially formulate, and use us on the premise of obtaining your parents or guardians' consent.Service or information to us.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a minor, it is recommended that you use our services or provide information to us under the consent of your parents or guardians."}
{"task": "rw_15.jsonl", "id": 42742, "text": "For the case where parents or guardians agree to use our products or services to collect personal information of minors, we will only use, share, transfer, transfer, transfer, transfer, transfer, transfer, and transfer they are clearly agreed or protected by laws or guardians.Or disclose this information.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Important"], "rewrite": "We will only use, share, transfer or disclose minors when laws and regulations are allowed, parents or guardians to clearly agree or protect minors."}
{"task": "rw_15.jsonl", "id": 42743, "text": "If we find that we collect the personal information of minors without the consent of the parents or the legal guardian who can be confirmed in advance, we will try to take appropriate processing of relevant data as soon as possible.", "label": ["Specific Audiences", "Important"], "rewrite": "If the personal information of minors was collected without the consent of the legal guardian, he would try to delete relevant information as soon as possible."}
{"task": "rw_15.jsonl", "id": 42744, "text": "7. Notification and revision", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42745, "text": "In order to provide you with better services, our business will change from time to time, and this privacy policy will be adjusted.If our contact information is changed, we will update it in time.", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42746, "text": "Without your clear consent, we will not reduce the rights you should enjoy in accordance with the privacy policy.", "label": ["Policy Change", "Important"], "rewrite": "Without your clear consent, we will not reduce the rights you should enjoy in accordance with the privacy policy."}
{"task": "rw_15.jsonl", "id": 42747, "text": "We will send a update version on our website and mobile terminals or remind you to update the relevant content in other ways. Please also visit us to understand the latest privacy policy in time.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42748, "text": "In the foregoing, if you continue to use our services, you will agree to accept the revised policy and be bound.", "label": ["Policy Change", "Important", "Risk"], "rewrite": "If you continue to use our services, you agree to accept the revised policy and be bound."}
{"task": "rw_15.jsonl", "id": 42749, "text": "8. How to contact us", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42750, "text": "You can contact us in the following ways, we will answer your request within 15 days;", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42751, "text": "1. You can contact us through the popular review website (www.dianping.com)/Public Comment APP to contact us;", "label": ["Important", "Contact Information"], "rewrite": "You can contact us through the popular review website (www.dianping.com)/Public Comment app to contact us."}
{"task": "rw_15.jsonl", "id": 42752, "text": "2. You can contact the customer service phone of the public review (Public Comment Network: 10100011).", "label": ["Important", "Contact Information"], "rewrite": "Customer service phone for review: 10100011."}
{"task": "rw_15.jsonl", "id": 42753, "text": "3. We have also set up a special personal information protection team. You can contact our personal information protection person in charge of mailbox, privacy@meituan.com, or you can also send a letter to the following address:, Wangjing East Road, Wangjing District, Chaoyang District, BeijingNo. 4 Hengji Weiye Building No. 2 Privacy Protection Center (closed), postcode:, 100102.", "label": ["Important", "Contact Information"], "rewrite": "Personal Information Protection Personal Email PRIVACY@meituan.com, Address: Privacy Protection Center (closed), No. 4 Hengji Weiye Building, No. 4, Wangjing East Road, Chaoyang District, Beijing, postcode: 100102."}
{"task": "rw_15.jsonl", "id": 42754, "text": "appendix:", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42755, "text": "1. Personal information: Various information related to recognized or recognized natural persons recorded in electronics or other methods, excluding information after anonymous processing.", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42756, "text": "Personal information that may involve in this privacy policy includes, but not limited to: personal information (including name, phone number, gender, address, birthday, birthday, etc.);", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42757, "text": "Personal identity information (including ID cards, officers, passports, driving licenses, etc.);", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42758, "text": "Network identity identification information (including system accounts, IP addresses, mailbox addresses, and the answer to the aforementioned password, password, password protection);", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42759, "text": "Personal property information (including bank accounts, transactions and consumption records, credit records, and virtual property information, etc.);", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42760, "text": "Personal health and physiological information (including diseases, medical records, history, etc.);", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42761, "text": "Contact information (including address book information, friends list, etc.);", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42762, "text": "Personal Internet records (including website browsing records, click records, etc.);", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42763, "text": "Personal device information (including information that describes the basic situation of individual equipment such as the unique device identification code);", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42764, "text": "Personal location information (including the trajectory, precise positioning information, accommodation information, etc.).", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42765, "text": "2. Sensitive personal information: It refers to personal information that can easily cause the personality and dignity of natural people to be violated or harmed by personal and property security once leaked or illegally used.", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42766, "text": "Personal sensitive information that may be involved in this privacy policy includes: personal identity certification information (including ID cards, officers, passports, driving licenses, student IDs, etc.);", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42767, "text": "Personal property information (bank account, transaction and consumption records, credit records, virtual property information, etc.);", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42768, "text": "Other information (whereabouts, address book information, accommodation information, accurate positioning information, medical health information, biometric information, etc.);", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42769, "text": "Under 14 years old, minor information.", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42770, "text": "3. Meituan: The \"Meituan\" referred to in this policy refers to all companies under Meituan and its affiliated companies (including Meituan.com, Public Comment, Mobike and other platforms that have established companies and the future.Established).", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42771, "text": "Popular comment: Refers to the life service information platform under the Meituan of Shanghai Hantao Information Consulting Co., Ltd., including but not limited to the popular Internet platforms such as Public Comment Network, Public Comment Client, and Public Comment Mini Program.", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42772, "text": "4. Related company: refers to Meituan related companies disclosed by Meituan's latest listed company annual report.", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42773, "text": "appendix:", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42774, "text": "\"Meituan Taxi Privacy Policy\"", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42775, "text": "\"Meituan Financial Privacy Policy\"", "label": [], "rewrite": []}
{"task": "rw_15.jsonl", "id": 42776, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
