{"task": "rw_19.jsonl", "id": 43778, "text": "[Tomato Free Novel] Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43779, "text": "Update date: January 13, 2021", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43780, "text": "Effective date: January 20, 2021", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43781, "text": "Beijing Zhending Technology Co., Ltd. (Registration Address: 807, 8th Floor, Building 4, Zijin Digital Garden, Haidian District, Haidian District, Beijing) and its related parties (referred to as \"we\") as operators for tomato free novels, knowing that personal information is important to youSex, we will protect your personal information and privacy security in accordance with the provisions of laws and regulations.", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43782, "text": "We formulate this \"privacy policy\" and special reminders: I hope you read and understand this privacy policy carefully before using Tomato free novels and related services to make appropriate choices.", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43783, "text": "This privacy policy will help you understand:", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43784, "text": "• We will follow your information to collect and use your information, but we will not collect personal information in a package of compulsory binding because you agree with your consent of the privacy policy.", "label": ["Policy Change", "Important", "First Party Collection Information"], "rewrite": "We will not collect personal information in a bundled manner just because you agree to this Privacy Policy."}
{"task": "rw_19.jsonl", "id": 43785, "text": "• When you use or start related functions or use services, we will collect and use relevant information for the implementation of functions and services.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use or open related functions or use services, we will collect and use relevant information for the implementation of functions and services."}
{"task": "rw_19.jsonl", "id": 43786, "text": "Unless it is necessary information necessary to realize basic business functions or in accordance with laws and regulations, you may refuse to provide it without affecting other functions or services.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43787, "text": "We will explain in the privacy policy which is the necessary information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43788, "text": "• If you do not log in to the account, we will use the corresponding identifier information of the device to ensure the basic functions of information push.", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43789, "text": "If you log in to your account, we will push information based on your account information.", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43790, "text": "• None of the telephone, camera, album (storage), and geographical location permissions will not be opened by default. Only after your explicit authorization will be used when you implement specific functions or services, you can also withdraw authorization.", "label": ["Permission Acquisition", "Important", "Edit/Control"], "rewrite": "Telephone, camera, album (storage), and geographical location permissions will not be opened by default. Only after your explicit authorization will be used, you can also withdraw authorization."}
{"task": "rw_19.jsonl", "id": 43791, "text": "In particular, it is necessary to point out that even after your authorization, we have obtained these sensitive permissions, and we will not collect your information when related functions or services are not needed.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Data Security"], "rewrite": "Even after your authorization, we have obtained these sensitive permissions, and we will not collect your information sometimes in related functions or services."}
{"task": "rw_19.jsonl", "id": 43792, "text": "For specific permissions application and usage, please see: Tomato novel application authority application and usage description", "label": ["Permission Acquisition", "Important"], "rewrite": "For specific permissions application and usage, please see: Tomato novel application authority application and usage description"}
{"task": "rw_19.jsonl", "id": 43793, "text": "• This privacy policy is suitable for your access to the tomato -free novel website, Tomato free novel website, tomato free novel software development toolkit (SDK) and application programming interface (API) method used for third -party websites and applicationsAnd use our products and services.", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43794, "text": "• The following will help you understand how we collect, use, store, transmit, share, transfer (applicable) and protect personal information;", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43795, "text": "Help you understand the way query, access, delete, correction, and withdrawn authorized personal information.", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43796, "text": "Among them, the important part of the terms of your personal information rights and interests We have reminded in bold forms, please pay special attention.", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43797, "text": "1. How do we collect and use personal information", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43798, "text": "2. How do we use cookie equivalent technologies", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43799, "text": "3. How do we share, transfer, and publicly disclose personal information", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43800, "text": "4. How do we store personal information", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43801, "text": "5. How can we protect the security of personal information", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43802, "text": "6. Manage your personal information", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43803, "text": "7. Terms of minors", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43804, "text": "8. Amendment and Notice of Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43805, "text": "9. Contact us", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43806, "text": "1. How do we collect and use personal information", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43807, "text": "We will collect the information you actively provided when using the service as follows, and collect the information you generate during the use of the function or accept the service through automation:", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43808, "text": "1.1 Registration, login", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43809, "text": "a. When you register and log in to Tomato free novels and related services, you can create an account through your mobile phone number, and you can improve the relevant network identity information (avatar, nickname), collecting this information to help you complete the registration.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you register and log in to Tomato free novels and related services, you can create an account with your mobile phone number and improve the relevant network identity information."}
{"task": "rw_19.jsonl", "id": 43810, "text": "You can also choose to fill in gender, birthday and signature according to your own needs. The purpose of collecting this information is to better customize exclusive recommendations for you.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can choose to fill in gender, birthday and signature according to your own needs."}
{"task": "rw_19.jsonl", "id": 43811, "text": "b. Based on our cooperation with communication operators, when you use the \"one -click login\" function using Tomato free novels, after your explicit consent, the operator will send us your mobile phone numberServe.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use Tomato free novel \"One -click login\" function, after your explicit consent, the operator will send us your mobile phone number to us."}
{"task": "rw_19.jsonl", "id": 43812, "text": "The mobile phone number belongs to personal sensitive information. If you refuse to provide a \"one -click login\" method, you will register login to log in to a free novel, but it does not affect your registration and login in other ways, nor does it affect the normal use of other functions.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43813, "text": "c., you can also use a third -party account to log in to enter the tomato free novel. At this time, you will authorize us to obtain the public information (avatar, nickname, and other information you authorized) registered on the third -party platform.Account binding allows you to log in directly and use this product and related services through a third -party account.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "When registering and logging in with a third -party account, access and collect your personal information after your authorization, and bind it."}
{"task": "rw_19.jsonl", "id": 43814, "text": "d. When you set and change your avatars, we ask you to authorize the camera and album permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you set and change your avatars, we ask you to authorize the camera and album permissions."}
{"task": "rw_19.jsonl", "id": 43815, "text": "If you refuse to authorize, you will not be able to use this function, but it will not affect other functions of your normally use Tomato novels normally.", "label": ["Edit/Control", "Permission Acquisition"], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43816, "text": "1.2 content browsing", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43817, "text": "a. In order to ensure the quality of the recommended content and recommend the content and related information that you may be interested in, the tomato free novel may collect relevant necessary log information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Tomato free novels may collect relevant necessary log information to make personalized recommendations to you."}
{"task": "rw_19.jsonl", "id": 43818, "text": "b. The log information used for content browsing includes:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43819, "text": "The behavior information you operate and use: search, browse, click, join the bookshelf, download", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43820, "text": "Geographical location information: GPS information, WLAN access point, Bluetooth, base station and other sensor information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43821, "text": "C.GPS geographical location is sensitive personal information. If you refuse to provide, we will not recommend information to you according to GPS information, and will not affect the normal use of other functions.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide GPS geographical location, we will not recommend information to you according to GPS information."}
{"task": "rw_19.jsonl", "id": 43822, "text": "D We will show you and recommend local relevant information in your area based on the cities corresponding to the IP address.", "label": ["Important", "Usage"], "rewrite": "We will show you and recommend local related information to your area based on cities corresponding to the IP address."}
{"task": "rw_19.jsonl", "id": 43823, "text": "e. When you publish content, comments, questions, or answers, we will collect the information you posted and show your nickname, avatar, publishing content.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you publish content, comments, questions, or answers, we will collect the information you posted and show your nickname, avatar, publishing content."}
{"task": "rw_19.jsonl", "id": 43824, "text": "1.3 Search", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43825, "text": "When you use the search service of Tomato free novels, we will collect your search keyword information and log records.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the search service of Tomato free novels, we will collect your search keyword information and log records."}
{"task": "rw_19.jsonl", "id": 43826, "text": "In order to provide efficient search services, some of the aforementioned information will be temporarily stored in your local storage device, and you can show you the search results and search history records.", "label": ["Data Retention", "Important", "First Party Collection Information"], "rewrite": "Search for keyword information and log records will be temporarily stored in your local storage device, and you can show you the search results and search historical records."}
{"task": "rw_19.jsonl", "id": 43827, "text": "1.4 Form filling and others", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43828, "text": "a. When you fill in the corresponding form (such as related advertising pages) in the Tomato Free Novel APP, if you involve geographical location information, in order to facilitate that you do not need to fill in manual filling, we will apply for geographical location permissions and help you fill in the corresponding corresponding corresponding to the corresponding correspondence.City/district and county.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you fill in the corresponding form, if you involve geographical location information, we will apply for geographical location permissions and help you fill in automatically."}
{"task": "rw_19.jsonl", "id": 43829, "text": "b. If the relevant advertising page has the function of dialing calls, when you use this function, we will apply for phone permissions. The purpose of applying for this permissions is only to help you adjust your mobile phone dial -up keyboard and display the other party's phoneYou can make a call, please rest assured that we will not get your phone number and call content through this permissions, nor will we call without your knowledge.", "label": ["Permission Acquisition", "Important", "Data Security"], "rewrite": "If the relevant advertising page has the function of dialing calls, when you use this function, we will apply for phone permissions to realize that you can make a phone call in the APP."}
{"task": "rw_19.jsonl", "id": 43830, "text": "If you refuse to authorize, you will not be able to use this function, but it will not affect other functions of your normally use Tomato novels normally.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43831, "text": "c. Under the situation of sharing or receiving information, participation in activities, we need to access your shear board and read the passwords, sharing codes, links contained in itOr service.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "In the case of sharing or receiving information, participation in activities, we need to access your shear board to read the passwords, sharing code, and links contained in it."}
{"task": "rw_19.jsonl", "id": 43832, "text": "In order to analyze statistical indicators such as new, activation, retention, and performance, we may call the shear plates to analyze the relevant statistical information. Please rest assured that we will not collect your privacy information.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Data Security"], "rewrite": "We may call the cutting plate to analyze relevant statistical information, but will not collect your privacy information."}
{"task": "rw_19.jsonl", "id": 43833, "text": "d. When you use the benefit function, we will record red envelopes/coins collection, cash cash on cash, and sign -in to realize your normal use of receiving benefits.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the welfare function, we will record red envelopes/coins collection, cash cash on cash, and sign -in."}
{"task": "rw_19.jsonl", "id": 43834, "text": "1.5 message notification", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43835, "text": "You know and agree that for your contact information (for example: contact telephone number) provided in the process of using the product and/or service, we may send one or more of them in the operationUser news notification, authentication, security verification, user experience research research and other purposes;", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43836, "text": "In addition, we may also provide you with the use of commercial information such as services, functions or marketing activities that you may be interested in through SMS and telephone.If you don't want to accept this information, you can unsubscribe the booking method provided in the mobile phone text message, or you can contact us directly to the withdrawal.", "label": ["Important", "First Party Collection Information", "Edit/Control"], "rewrite": "We may also provide you with commercial information through SMS and telephones to collect mobile phone numbers."}
{"task": "rw_19.jsonl", "id": 43837, "text": "1.6 Operation and Security", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43838, "text": "1.6.1 operation and safety", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43839, "text": "We are committed to providing you with a safe, credible product and use environment, and providing high -quality, efficient, and reliable services and information is our core goal.", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43840, "text": "1.6.2 Equipment information and log information", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43841, "text": "a. In order to ensure the security, the quality and efficiency of the operation of software services, we will collect your hardware model, operating system version number, international mobile device identification code, unique device identifier, network equipment hardware address, IP address, WLAN access, access to WLAN accessPoints, Bluetooth, base station, software version number, network access method, type, status, network quality data, operation, use, service log.", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to ensure the safety, operation quality and efficiency of software services, we will collect your system information, network information, and log information."}
{"task": "rw_19.jsonl", "id": 43842, "text": "We will apply for allowing programs to obtain the current or recently operated application rights restrictions for security risk control and Push, SDK to ensure the safe operation of software and services and the reach of messages.", "label": ["Permission Acquisition", "Important"], "rewrite": "We will apply for allowing programs to obtain the current or recently operated application right limits for security risk control and Push SDK."}
{"task": "rw_19.jsonl", "id": 43843, "text": "Application source.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43844, "text": "c. We may use your account information, equipment information, service log information, and our related parties and partners to obtain information that you can share or shared according to law to determine the status of the account, authentication, testing and preventing security incidents.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may use your account information, equipment information, service log information, and other information authorized to judge the status of account status, authentication, testing and preventing security incidents."}
{"task": "rw_19.jsonl", "id": 43845, "text": "1.7 Collect and use personal information purpose changes", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43846, "text": "Please understand that with the development of our business, it may be adjusted and changed to the functions of tomato free novels and the services provided.", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43847, "text": "In principle, when the new features or services are related to the functions or services we are currently provided, the personal information collected and used will be directly or reasonable to the original processing purpose.", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43848, "text": "In the scenario that is not directly or reasonable to be related to the purpose of the original treatment, we collect and use your personal information will be inform again and obtain your consent.", "label": ["Important", "First Party Collection Information"], "rewrite": "In the scenario that is not directly or reasonable to be related to the purpose of the original treatment, we collect and use your personal information will be inform again and obtain your consent."}
{"task": "rw_19.jsonl", "id": 43849, "text": "1.8 Personal information that obtains consent and use according to law", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43850, "text": "Please understand that in the following situations, according to laws and regulations and related national standards, we collect and use your personal information without obtain your authorization consent:", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "In the following situations, according to laws and regulations and related national standards, we collect and use your personal information without obtain your authorization consent:"}
{"task": "rw_19.jsonl", "id": 43851, "text": "a. Directly related to national security and national defense security;", "label": ["Important", "First Party Collection Information"], "rewrite": "The collection and use information directly related to national security and national defense security does not need to solicit authorization consent."}
{"task": "rw_19.jsonl", "id": 43852, "text": "b. It is directly related to public safety, public health, and major public interests;", "label": ["Important", "First Party Collection Information"], "rewrite": "The collection and use information directly related to public safety, public health, and major public interests does not need to solicit authorization consent."}
{"task": "rw_19.jsonl", "id": 43853, "text": "c. Directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Important", "First Party Collection Information"], "rewrite": "Direct related collection and use information such as criminal investigation, prosecution, trial and judgment execution does not need to solicit authorization consent."}
{"task": "rw_19.jsonl", "id": 43854, "text": "d. Out of maintaining major legitimate rights and interests such as the life and property of the subject of personal information or other individuals, it is difficult to get my consent;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting the use of information for major legitimate legitimate rights and interests such as the life and property of the subject of personal information or other individuals, but it is difficult to get my consent, and there is no need to solicit authorization consent."}
{"task": "rw_19.jsonl", "id": 43855, "text": "e. The collected personal information is made by your own public to the public;", "label": ["Important", "First Party Collection Information"], "rewrite": "The collected personal information is made public to the public by itself, and there is no need to solicit authorization consent."}
{"task": "rw_19.jsonl", "id": 43856, "text": "f. Your personal information collected from the legal publicly disclosed information, such as legal news reports and government information disclosure;", "label": ["Important", "First Party Collection Information"], "rewrite": "Your personal information collected from the legal disclosure information does not need to solicit authorization consent."}
{"task": "rw_19.jsonl", "id": 43857, "text": "g. Sign or perform the contract according to your requirements;", "label": ["Important", "First Party Collection Information"], "rewrite": "The collection and use information necessary for signing or performing the contract according to your request does not need to solicit authorization consent."}
{"task": "rw_19.jsonl", "id": 43858, "text": "h. It is necessary to maintain the safe and stable operation of software and related services, such as discovering and disposing of software and related services;", "label": ["Important", "First Party Collection Information"], "rewrite": "The collection and use information necessary to maintain the safe and stable operation of software and related services does not require authorization consent."}
{"task": "rw_19.jsonl", "id": 43859, "text": "i. It is necessary for legal news reports;", "label": ["Important", "First Party Collection Information"], "rewrite": "The necessary collection and use information for legal news reports does not need to solicit authorization consent."}
{"task": "rw_19.jsonl", "id": 43860, "text": "j. Academic research institutions are necessary to carry out statistics or academic research in accordance with public interests, and when providing academic research or description results, the personal information contained in the results is identified by", "label": ["Important", "First Party Collection Information"], "rewrite": "When academic research institutions are necessary to carry out statistics or academic research based on public interests, and provide academic research or description results, they can identify the personal information contained in the results without requiring the consent of authorization."}
{"task": "rw_19.jsonl", "id": 43861, "text": "Other circumstances stipulated by law and regulations.", "label": ["Important", "First Party Collection Information"], "rewrite": "Other collection and use information stipulated in laws and regulations does not need to solicit authorization."}
{"task": "rw_19.jsonl", "id": 43862, "text": "Special prompt you note that if the information cannot be identified alone or in combination with other information, it is not your personal information in the legal sense;", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43863, "text": "When your information can identify your personal identity alone or in combination with other information, or we will not be able to connect with any specific personal information with other personal information combined with other personal information, this information will be used as you during combination.Personal information is handled and protected in accordance with this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43864, "text": "According to the law, the personal information of sharing and transferred the identification processing, and ensure that the data receiver cannot restore and re -identify the subject of personal information, which does not belong to the external sharing, transfer and public disclosure of personal information.There will be no need to notify you and obtain your consent.", "label": ["Important", "First Party Collection Information"], "rewrite": "If the personal information of sharing and transferring the identification processing, and ensuring that the data receiver cannot restore and re -identify the subject of the personal information, you do not need to notify you separately and obtain your consent."}
{"task": "rw_19.jsonl", "id": 43865, "text": "2. How do we use cookie equivalent technologies", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43866, "text": "Similar technologies such as Cookie and Equipment Information Makes are commonly used in the Internet.", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43867, "text": "When you use Tomato free novels and related services, we may use related technologies to send one or more, cookie, or anonymous identifiers to collect and identify the information when you access and use this product.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect information through cookies or anonymous identifiers, identify the information when you access and use the product."}
{"task": "rw_19.jsonl", "id": 43868, "text": "We promise that cookies will not be used for any other purposes other than the purpose of this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43869, "text": "We use cookies and similar technologies to achieve the following functions or services:", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43870, "text": "2.1 Guarantee of the safety and efficient operation of products and services", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43871, "text": "We may set up certification and guarantee security, cookies, or anonymous identifications to make us confirm whether you log in to the service safely, or whether you encounter stolen, fraud and other illegal acts.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "Setting authentication and security cookie or anonymous identifier to make us confirm whether you are safely logging in to the service, or whether you encounter stolen, fraud and other illegal behaviors."}
{"task": "rw_19.jsonl", "id": 43872, "text": "These technologies also help us improve service efficiency, improve login and response speed.", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43873, "text": "2.2 Help you get a easier access experience", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43874, "text": "Using this kind of technology can help you save the steps and processes of your personal information and enter search content (example: record search, form filling).", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43875, "text": "2.3 Recommend, display, and push you what you may be interested in", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43876, "text": "a. We may use such technologies to understand your preferences and use habits, and analyze data to improve information or functions that users are interested in, and optimize your choice of advertising.", "label": ["Important", "Usage"], "rewrite": "Use Cookie to understand your preferences and use habits, and analyze data."}
{"task": "rw_19.jsonl", "id": 43877, "text": "b. In the sharing page of Tomato Free Novels, we may use Cookie to record the browsing activities to recommend information and investigate the collapse, delay related abnormal conditions, and explore better service methods.", "label": ["Important", "First Party Collection Information"], "rewrite": "In the sharing page of Tomato Free Novels, use Cookie to record the browsing activities to recommend information and check the relevant abnormal situations of collapse and delay."}
{"task": "rw_19.jsonl", "id": 43878, "text": "c. You have the right to choose to close/open personalized recommendation content. For details, please refer to Article 6.3 of this privacy policy.", "label": ["Edit/Control", "Usage", "Important"], "rewrite": "You have the right to choose to close/open personalized recommendation content."}
{"task": "rw_19.jsonl", "id": 43879, "text": "2.4 COOKIE Clear", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43880, "text": "Most browsers provide users with the function of removing browser cache data. You can perform the corresponding data clearance operation in the browser settings function.", "label": ["Edit/Control", "Important"], "rewrite": "You can perform the corresponding data clearance operation in the browser settings function."}
{"task": "rw_19.jsonl", "id": 43881, "text": "If you remove it, you may not be able to use the services or corresponding functions that we depend on Cookie.", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43882, "text": "3. How do we share, transfer, and publicly disclose personal information", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43883, "text": "3.1 Sharing", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43884, "text": "3.1.1 Sharing Principles", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43885, "text": "a. The principle of authorization consent:, without your consent, we will not share your personal information. Unless the share of personal information is to identify the information after the processing, and sharing a third party who cannot re -recognize such information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Without your consent, we will not share your personal information. Unless the share of personal information is to identify the information after processing, and sharing a third party who cannot re -recognize such information."}
{"task": "rw_19.jsonl", "id": 43886, "text": "If the purpose of third -party information uses information beyond the scope of the original authorization consent, they need to re -obtain your consent.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "If the purpose of third -party information uses information beyond the scope of the original authorization consent, they need to re -obtain your consent."}
{"task": "rw_19.jsonl", "id": 43887, "text": "b. Legal legitimate and minimum necessary principles: The shared data must have a legal and legitimate purpose, and the shared data is limited to the purpose of achievement.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "The shared data must have a legitimate and proper purpose, and the shared data is limited to the purpose."}
{"task": "rw_19.jsonl", "id": 43888, "text": "c. Principles of safety and prudential:, we will carefully evaluate the purpose of third -party use of shared information, comprehensively evaluate the security guarantee capabilities of these partners, and require them to follow the legal agreement of cooperation.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will carefully evaluate the purpose of third -party use of shared information, comprehensively evaluate the security and guarantee capabilities of these partners, and ask them to follow the legal agreement of cooperation."}
{"task": "rw_19.jsonl", "id": 43889, "text": "We will strictly monitor the software tool development package (SDK) and application interface (API) that the partners obtain information to protect data security.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will strictly monitor the SDK and APIs obtained by the partners."}
{"task": "rw_19.jsonl", "id": 43890, "text": "Access to a third -party SDK directory", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43891, "text": "3.1.2 Sharing information of function or service", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43892, "text": "A. When you use the functions provided by our affiliated parties, third parties, or when software service providers, smart device providers, system service providers and us are provided by our affiliates, we will realize itThe information necessary for the business shared with these related parties and third parties to recommend, display or push you information that you may be interested in, or recommend or displayed more suitable for your specific functions, services or advertising.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "When you use the functions provided by our affiliates, third parties, or third parties to provide services with us, we will share the necessary information with it."}
{"task": "rw_19.jsonl", "id": 43893, "text": "b. Payment and gold coin withdrawal function: Payment and gold coin withdrawal function will provide you with a third -party payment institution that cooperates with us.", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43894, "text": "Third -party payment institutions may need to collect your name, bank card type and card number, validity period and mobile phone number.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Third -party payment institutions may need to collect your name, bank card type and card number, validity period and mobile phone number."}
{"task": "rw_19.jsonl", "id": 43895, "text": "The bank card number, validity period, and mobile phone number are personal sensitive information. This information is the information necessary for the withdrawal function. It refuses to provide the normal use that will cause you to unable to use this function, but does not affect other functions.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43896, "text": "c. In order to adapt the message push function with the terminal model you use, we may share mobile phone models, versions and related equipment information through SDK and other technologies and terminal equipment manufacturers (Huawei, Xiaomi, Meizu, etc.).", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share mobile phone models, versions and related device information through SDK and other technologies and terminal equipment manufacturers, thinking that you can adapt to message push functions."}
{"task": "rw_19.jsonl", "id": 43897, "text": "3.1.3 Implementing advertising -related shared information", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43898, "text": "a. Advertising push: We may share information with partners who entrust us to promote and advertise.Identify the indirect portrait label of your personal identity and device, network, and channel information after delaid or anonymousization to help them increase the effective touch rate of advertising without identifying personal identity.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We may share information with partners who entrust us to promote and advertise, but we will not share information that uses your personal identity."}
{"task": "rw_19.jsonl", "id": 43899, "text": "You can refuse the programmatic advertisement we push to you, and when you refuse, it does not affect your other functions or services, click to understand and manage the advertising push.", "label": ["Important", "Edit/Control"], "rewrite": "You can refuse the programmatic advertisement we push to you."}
{"task": "rw_19.jsonl", "id": 43900, "text": "b. Advertising statistics: We may share the analysis of device information or statistical information with business service providers, suppliers and other partners. This information is difficult or unable to associate with your true identity.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share the analysis of de -identified equipment information or statistical information with business service providers, suppliers and other partners."}
{"task": "rw_19.jsonl", "id": 43901, "text": "This information will help us analyze and measure the effectiveness of advertising and related services.", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43902, "text": "3.1.4 Sharing information of safety and analysis statistics", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43903, "text": "a. Guarantee use of security: We attach great importance to accounts, services and content security. In order to ensure the security of your and other users' accounts and property security, so that you and our legitimate rights and interests are exempted from illegal infringement.Share the necessary devices, accounts and log information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share the necessary equipment, accounts and log information to ensure the safety of use."}
{"task": "rw_19.jsonl", "id": 43904, "text": "b. Analysis of product usage: In order to analyze the usage of our services and enhance the experience of user use, it may be based on the de -identified data of the source and use of the affiliated parties or third -party sharing products (collapse, flashback, duration, etc.)It is difficult to combine with other information to identify your personal identity.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "It may be identified as the source and usage of the source and use of the product with related parties or third -party sharing products (collapse, flashback, use time, etc.) to enhance the user experience."}
{"task": "rw_19.jsonl", "id": 43905, "text": "c. Academic research and scientific research: In order to improve the scientific research capabilities in related fields and promote the level of scientific and technological development, we may share with scientific research institutes, universities and other institutions such as scientific research institutes, universities and other institutions on the premisedata.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share with scientific research institutes, universities and other institutions that identify or anonymous data."}
{"task": "rw_19.jsonl", "id": 43906, "text": "3.1.5 Help you participate in marketing promotion activities", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43907, "text": "When you choose to participate in the relevant marketing activities organized by us and our affiliates or third parties, you may need to provide you with name, communication address, contact information, and bank account information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you choose to participate in marketing activities, you may need to provide name, communication address, contact information, and bank account information."}
{"task": "rw_19.jsonl", "id": 43908, "text": "This information is personal sensitive information. It refuses to provide may affect your participation in related activities, but it will not affect other functions.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43909, "text": "Only after your consent can we share this information with related parties or third parties to ensure that you have consistent services in the joint event, or entrust a third party to reward you in time.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Only after your consent can we share your name, communication address, contact information, bank account information with related parties or third parties."}
{"task": "rw_19.jsonl", "id": 43910, "text": "3.2 Transfer", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43911, "text": "a. We will not transfer your personal information to any other third party, unless you obtain your clear consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not transfer your personal information to any other third party, unless you obtain your clear consent."}
{"task": "rw_19.jsonl", "id": 43912, "text": "b. With the sustainable development of our business, we will be likely to be merged, acquired, and transfers assets, and your personal information may be transferred as a result.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Your personal information may be transferred due to merging, acquisition, and asset transfer."}
{"task": "rw_19.jsonl", "id": 43913, "text": "When the previous described changes occur, we will request that the recipient protects your personal information in accordance with the laws and regulations and the security standards that are not lower than the privacy policy, otherwise we will request that the recipient will re -obtain your authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "If it involves the transfer of personal information, it will be required to continue to be subject to this policy, otherwise it will request that it will re -solicit authorization consent."}
{"task": "rw_19.jsonl", "id": 43914, "text": "3.3 show", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43915, "text": "a. We will not disclose your information publicly unless it follows the provisions of national laws and regulations or obtains your consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not disclose your information publicly unless it follows the provisions of national laws and regulations or obtains your consent."}
{"task": "rw_19.jsonl", "id": 43916, "text": "We publicly disclose your personal information to adopt security measures that meet the standards of the industry.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We publicly disclose your personal information to adopt security measures that meet the standards of the industry."}
{"task": "rw_19.jsonl", "id": 43917, "text": "b. When a penalty announcement of illegal accounts and fraud, we will disclose information about the relevant account.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When a penalty announcement of illegal accounts and fraud, we will disclose information about the relevant account."}
{"task": "rw_19.jsonl", "id": 43918, "text": "3.4 Personal information that obtains consent to sharing, transfer, and publicly disclosed in accordance with the law", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43919, "text": "Please understand that in the following situations, according to laws and regulations and national standards, we shared, transferred, and publicly disclosed your personal information without obtaining your authorization consent:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the following situations, according to laws and regulations and national standards, we shared, transferred, and publicly disclosed your personal information without obtaining your authorization consent:"}
{"task": "rw_19.jsonl", "id": 43920, "text": "a. Directly related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The sharing or disclosure directly related to national security and national defense security does not require authorization."}
{"task": "rw_19.jsonl", "id": 43921, "text": "b. It is directly related to public safety, public health, and major public interests;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Sharing or disclosure directly related to public safety, public health and major public interests does not need to be authorized."}
{"task": "rw_19.jsonl", "id": 43922, "text": "c. Directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Sharing or disclosure related to criminal investigation, prosecution, trial, and judgment execution does not need to be authorized."}
{"task": "rw_19.jsonl", "id": 43923, "text": "d. Out of maintaining major legitimate rights and interests such as life, property such as you or other individuals, it is difficult to get my consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Out of the major legitimate rights and interests of the life and property of the subject of personal information or other individuals, it is difficult to get shared or disclosed by my consent, and there is no need to solicit."}
{"task": "rw_19.jsonl", "id": 43924, "text": "e. Personal information that you disclose to the public by yourself;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The collected personal information is your own sharing or disclosure of your own public to the public, without having to solicit authorization."}
{"task": "rw_19.jsonl", "id": 43925, "text": "f. Collect personal information from legal public information, such as legal news reports and government information disclosure.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you collect personal information from the legal disclosure information, no authorization is required."}
{"task": "rw_19.jsonl", "id": 43926, "text": "4. How do we store personal information", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43927, "text": "4.1 Storage location", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43928, "text": "In accordance with the provisions of laws and regulations, we will store your personal information collected and generated during the domestic operation process in the territory of the People's Republic of China.", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in domestic operations will be stored in China."}
{"task": "rw_19.jsonl", "id": 43929, "text": "At present, we will not transmit the above information overseas. If we transmit to overseas, we will follow relevant state regulations or solicit your consent.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "If we transmit to overseas, we will follow relevant state regulations or seek your consent."}
{"task": "rw_19.jsonl", "id": 43930, "text": "4.2 Storage period", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43931, "text": "We only retain your personal information during the period of time for providing Tomato free novels and services. We will retain relevant information when you have not withdrawn, delete or log out accounts.", "label": ["Data Retention", "Important"], "rewrite": "Reserve your personal information during the period of service, and we will retain relevant information when you have not withdrawn, delete or log out your account."}
{"task": "rw_19.jsonl", "id": 43932, "text": "After exceeding the necessary period, we will delete or processes your personal information, except for other regulations.", "label": ["Data Retention", "Important"], "rewrite": "After exceeding the storage period, your personal information will be deleted or anonymous, except for other provisions of laws and regulations."}
{"task": "rw_19.jsonl", "id": 43933, "text": "5. How can we protect the security of personal information", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43934, "text": "a. We attach great importance to your personal information. We will strive to take reasonable security measures (including technical and management) to protect your personal information and prevent your personal information from being used in improperly or without authorization.It was interviewed, publicly disclosed, used, modified, damaged, lost or leaked.", "label": ["Important", "Data Security"], "rewrite": "We will strive to take reasonable security measures to protect your personal information and prevent your personal information from being used in improperly or being interviewed, publicly disclosed, used, modified, damaged, lost or leaked."}
{"task": "rw_19.jsonl", "id": 43935, "text": "b. We will use crypto technology, anonymous processing, and related reasonable and feasible methods that are not lower than industry standards to protect your personal information, and use a security protection mechanism to prevent your personal information from being maliciously attacked.", "label": ["Important", "Data Security"], "rewrite": "We will use encrypted technology, anonymous processing, and related reasonable and feasible means to protect your personal information, and use a security protection mechanism to prevent your personal information from being maliciously attacked."}
{"task": "rw_19.jsonl", "id": 43936, "text": "c. We will establish a special security department, security management system, and data security process to ensure your personal information security.", "label": ["Important", "Data Security"], "rewrite": "We will establish a special security department, security management system, and data security process to ensure your personal information security."}
{"task": "rw_19.jsonl", "id": 43937, "text": "We adopt strict data use and access systems to ensure that only authorized personnel can access your personal information and conduct security audits of data and technology in a timely manner.", "label": ["Important", "Data Security"], "rewrite": "We adopt strict data usage and access systems and conduct security audits on data and technology in a timely manner."}
{"task": "rw_19.jsonl", "id": 43938, "text": "d. Although the above -mentioned reasonable and effective measures have been taken and the standards required by relevant legal regulations have been adopted, please understand that due to the technical restrictions and various malicious means that may exist, in the Internet industry, even if you can do your best to strengthen your security, you can strengthen your security.Measures cannot always ensure that the information is 100 % security. We will try our best to ensure the security of our personal information you provide.", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43939, "text": "e. You know and understand that the systems and communication networks you use to access our services may be due to factors outside of our controllable range.", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43940, "text": "Therefore, we strongly recommend that you take positive measures to protect the security of personal information, including but not limited to the use of complex passwords, regularly modify the password, do not disclose your account password and related personal information to others.", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43941, "text": "f. We will develop an emergency treatment plan and immediately start the emergency plan when the user information security incident occurs, and strive to prevent the impact and consequences of these security events expand.", "label": ["Important", "Data Security"], "rewrite": "Immediately start the emergency plan when the user information security incident occurs."}
{"task": "rw_19.jsonl", "id": 43942, "text": "Once the user information security incident (leaked and lost) occurs, we will inform you in a timely manner in accordance with the requirements of laws and regulations: the basic situation and possible impact of security events, the disposal measures we have adopted or we will take, you can self -prevent itself to prevent self -prevention preventionAnd reducing risk suggestions, remedy measures.", "label": ["Important", "Data Security"], "rewrite": "If a personal information security incident occurs, we will inform your basic situation, possible impact, disposal measures, independent prevention suggestions, etc."}
{"task": "rw_19.jsonl", "id": 43943, "text": "We will promptly inform you of the incident -related situation with push notifications, emails, letters, text messages, and related forms. When it is difficult to inform one by one, we will publish an announcement in a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "The relevant situation of security incidents will be informed by mail, letter, telephone, push notification, etc. When it is difficult to inform one by one, it will issue an announcement."}
{"task": "rw_19.jsonl", "id": 43944, "text": "At the same time, we will also report to the disposal of user information security incidents in accordance with the requirements of the relevant regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "Report the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities."}
{"task": "rw_19.jsonl", "id": 43945, "text": "g. Once you leave the tomato free novel and related services, browse or use other websites, services and content resources, we will not be able to protect your software and any personal information submitted by the website for free novels and related services in Tomato.Regardless of whether you log in, browse or use the above software, website is based on the link or guidance of Tomato free novels.", "label": ["Important", "Risk"], "rewrite": "We will not be able to protect your personal information submitted by software or website for free and direct services, whether or not it is based on the link or guidance of tomato free novels."}
{"task": "rw_19.jsonl", "id": 43946, "text": "6. Manage your personal information", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43947, "text": "We attach great importance to your management of personal information and do our best to protect your personal information inquiry, access, modification, delete, withdrawn, withdrawing, canceling account numbers, and complaints to report, so that you have the ability to protect your privacyAnd information security.", "label": ["Important", "Edit/Control"], "rewrite": "Protect your rights to your personal information inquiry, access, modification, delete, withdrawn, withdrawing, and the relevant rights that consent to authorization, cancel your account, and complain."}
{"task": "rw_19.jsonl", "id": 43948, "text": "6.1 Change or withdraw the scope of authorization", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43949, "text": "6.1.1 Change or withdraws sensitive permissions settings", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43950, "text": "You can turn off your camera, album, and geographical location permissions in the device operating system or withdraw your authorization.", "label": ["Important", "Edit/Control"], "rewrite": "You can turn off your camera, album, and geographical location permissions in the device operating system or withdraw your authorization."}
{"task": "rw_19.jsonl", "id": 43951, "text": "After withdrawal authorization, we will no longer collect information related to these permissions.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "After withdrawal authorization, we will no longer collect information related to these permissions."}
{"task": "rw_19.jsonl", "id": 43952, "text": "6.1.2 Change or withdrawal information processing", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43953, "text": "Specific business functions and services will need your information to be completed. When you withdraw consent or authorization, we cannot continue to provide you with the corresponding functions and services corresponding to the withdrawal consent or authorization, and no longer process your corresponding personal information.", "label": ["Important", "Edit/Control"], "rewrite": "When you withdraw or authorize, we cannot continue to provide you with the function and services corresponding to the withdrawal consent or authorization, and no longer process your corresponding personal information."}
{"task": "rw_19.jsonl", "id": 43954, "text": "But your decision to withdraw consent or authorization will not affect the personal information processing we carried out based on your authorization.", "label": ["Permission Acquisition", "Edit/Control", "Risk", "Important"], "rewrite": "The decision to withdraw consent or authorization will not affect personal information processing based on your authorization."}
{"task": "rw_19.jsonl", "id": 43955, "text": "6.2 Visit, delete, correct your personal information", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43956, "text": "6.2.1 Visit personal account information", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43957, "text": "You can query and access your avatar, nickname, gender, birthday, signature, you can query, access, and correct in [I]-[Edit Personal Information].", "label": ["Edit/Control", "Important"], "rewrite": "You can query and access your avatar, nickname, gender, birthday, signature, you can query, access, and correct in [I]-[Edit Personal Information]."}
{"task": "rw_19.jsonl", "id": 43958, "text": "6.2.2 Query access, delete", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43959, "text": "a. Enter the contents of the book shelf in the [Book Shelf]. After clicking \"Edit\", you can delete the content of the bookshelf.", "label": ["Important", "Edit/Control"], "rewrite": "Enter the contents of the [Bookshelf] access to the bookshelf. Click \"Edit\" to delete the content of the bookshelf."}
{"task": "rw_19.jsonl", "id": 43960, "text": "b. Enter [Mine]-[Gold Coin balance]/[Cash balance] can be accessed and querying gold coins and cash income.", "label": ["Important", "Edit/Control"], "rewrite": "Enter [Mine]-[Gold Coin balance]/[Cash balance], you can access and query gold coins and cash income."}
{"task": "rw_19.jsonl", "id": 43961, "text": "6.3 Autonomous choice to control personalized recommendation information", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43962, "text": "a. Our related information recommendation function may be made according to the automated decision -making mechanism, including the information system and algorithm.", "label": ["Important", "Usage"], "rewrite": "Related information recommendation functions may be made according to the automated decision -making mechanism inside the information system and algorithm."}
{"task": "rw_19.jsonl", "id": 43963, "text": "When you are not interested in the information we push or want to reduce some information recommendation, you can choose \"×\" in the lower right corner of \"Book City\"-\"Recommend\" \"Guess\" Guess You Like \".\",\" Poor quality, \"\" the subject does not like \"and other reasons for accurate shielding.", "label": ["Important", "Edit/Control"], "rewrite": "You can \"×\" in the lower right corner of \"Book City\"-\"Recommend\" Recommend \"Guess You Like\", select \"Not interested\", \"I have seen\", \"Poor quality,\" \"The subjects don’t like\" and other reasons.shield."}
{"task": "rw_19.jsonl", "id": 43964, "text": "This will help you control the control and independent decision -making.", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43965, "text": "b. We will provide you with personalized recommendations based on your browsing records and browsing preferences.", "label": ["Important", "Usage"], "rewrite": "We will provide you with personalized recommendation content based on your browsing records and browsing preferences."}
{"task": "rw_19.jsonl", "id": 43966, "text": "You can close the personalized recommendation function. After the closure, you will not be able to receive personalized recommendation content.", "label": ["Important", "Edit/Control"], "rewrite": "You can close personalized recommendation functions."}
{"task": "rw_19.jsonl", "id": 43967, "text": "You can also open personalized recommendations with one click to get richer content.", "label": ["Important", "Edit/Control"], "rewrite": "You can open personalized recommendations with one click to get richer content."}
{"task": "rw_19.jsonl", "id": 43968, "text": "6.4 Logging out account", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43969, "text": "You can apply for a cancellation of accounts by manually.", "label": ["Important", "Edit/Control"], "rewrite": "You can apply for a cancellation of accounts by manually."}
{"task": "rw_19.jsonl", "id": 43970, "text": "You can operate in [Mine]-[Feedback and Help]-[Account Questions], and operate according to the cancellation process provided by customer service. Before you cancel your account, we will verify your personal identity, security status, equipment information, etc.Essence", "label": ["Important", "Edit/Control"], "rewrite": "You can operate in [Mine]-[Feedback and Help]-[Account Questions], and operate according to the cancellation process provided by the customer service."}
{"task": "rw_19.jsonl", "id": 43971, "text": "You know and understand that the behavior of canceling the account is irreversible behavior. When you cancel your account, we will delete relevant information about your relevant information or perform anonymous processing, except for the laws and regulations.", "label": ["Important", "Edit/Control"], "rewrite": "After the account cancellation, your relevant information will be deleted or anonymous, except for other provisions of laws and regulations."}
{"task": "rw_19.jsonl", "id": 43972, "text": "6.5 Visiting Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43973, "text": "You can register the page, or log in to your personal account [Mine]-[Settings]-[About Tomato]-[Privacy Policy] View all the content of this privacy policy.", "label": ["Important", "Edit/Control"], "rewrite": "You can register the page, or log in to your personal account [Mine]-[Settings]-[About Tomato]-[Privacy Policy] View all the content of this privacy policy."}
{"task": "rw_19.jsonl", "id": 43974, "text": "6.6 Complaint report", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43975, "text": "You can complain or report in accordance with our publicity system.", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43976, "text": "If you think your personal information rights may be infringed or you find a clue to infringe the right to personal information, you can contact us through [dataprivacy@bytedance.com,].", "label": ["Important", "Contact Information"], "rewrite": "Email: dataprivacy@bytedance.com"}
{"task": "rw_19.jsonl", "id": 43977, "text": "After we verify, we will report your complaints and reports within [15].", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43978, "text": "6.7 Stopping operations to tell you", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43979, "text": "If we stop operations, we will stop collecting your personal information in time, notify you in the form of notification of operation in the form of one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one service, and delete or processes your personal information.", "label": ["Important", "Data Security", "Cessation of Operations"], "rewrite": "When stopping operation, we will make an announcement notice and delete or processes your personal information."}
{"task": "rw_19.jsonl", "id": 43980, "text": "7. Terms of minors", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43981, "text": "a. If you are a minor under the age of 18, you should read and agree to the privacy policy under the supervision and guidance of your parents or other guardians under the supervision of your parents or other guardians.", "label": ["Specific Audiences", "Important"], "rewrite": "Minors under the age of 18 should obtain the consent of the policy of the policy before using the free novels and related services of Tomato."}
{"task": "rw_19.jsonl", "id": 43982, "text": "b. We protect personal information of minors in accordance with the provisions of relevant national laws and regulations, and will only collect, use, share or disclose minors when the law allows, parents or other guardians to clearly agree or protect minors.Personal information;", "label": ["Specific Audiences", "Important"], "rewrite": "It will only collect, use, share, or disclose personal information of minors without legal permission, parents or other guardians who clearly agree or protect minors."}
{"task": "rw_19.jsonl", "id": 43983, "text": "If we find that the personal information of minors is collected without the consent of parents or other guardians who can be proven in advance, we will try to delete relevant information as soon as possible.", "label": ["Specific Audiences", "Data Security", "Important"], "rewrite": "If the personal information of minors was collected without the consent of the legal guardian, he would try to delete relevant information as soon as possible."}
{"task": "rw_19.jsonl", "id": 43984, "text": "c. If you are the guardian of minors, when you have any questions about the personal information of the minors you monitor, please contact us through the contact information of this privacy policy.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43985, "text": "8. Amendment and Notice of Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43986, "text": "a. In order to provide you with better services, Tomato free novels and related services will be updated and changed from time to time. We will revise the privacy policy in a timely manner. These amendments to constituted a privacy policy are equivalent to the privacy policy.Without your clear consent, we will not reduce the rights you should enjoy based on the current privacy policy that take effect.", "label": ["Policy Change", "Important"], "rewrite": "Part of the policy revision composition of privacy policy has the effect of equivalent privacy policies. Without your clear consent, we will not reduce the rights that you should enjoy based on the current imposing privacy policy."}
{"task": "rw_19.jsonl", "id": 43987, "text": "b. After this privacy policy is updated, we will issue a updated version on the free tomato novel, and before the updated terms take effect, through the official website (http://changdunovel.com/wap/home-wap.html), or other appropriate appropriate appropriate appropriateThe way you remind you to update, so that you can understand the latest version of this privacy policy in time.", "label": ["Policy Change", "Important"], "rewrite": "We will issue a updated version in the free Tomato novel and remind you of the updated content before the updated terms take effect."}
{"task": "rw_19.jsonl", "id": 43988, "text": "We will also update the \"update date\" and \"effective date\" at the top of the privacy policy in a timely manner.", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43989, "text": "You continue to access or use this software after the privacy policy is updated, which is deemed to be your privacy policy after the update.", "label": ["Policy Change", "Important"], "rewrite": "You continue to access or use this software after the privacy policy is updated, which is deemed to be your privacy policy after the update."}
{"task": "rw_19.jsonl", "id": 43990, "text": "If you do not agree with the updated privacy policy, you must stop accessing or using this software.", "label": ["Policy Change", "Important"], "rewrite": "If you do not agree with the updated privacy policy, you must stop accessing or using this software."}
{"task": "rw_19.jsonl", "id": 43991, "text": "9. Contact us", "label": [], "rewrite": []}
{"task": "rw_19.jsonl", "id": 43992, "text": "a. If you have complaints, suggestions, and questions about the protection of personal information, you can send the problem to [dataprivacy@bytyteance.com,], we will review the issues involved as soon as possible and reply as soon as possible after verifying your user identity.", "label": ["Important", "Contact Information"], "rewrite": "Email: dataprivacy@bytedance.com."}
{"task": "rw_19.jsonl", "id": 43993, "text": "b. If you have any questions, opinions or suggestions on the content of the privacy policy, you can contact us through the [My]-[Feedback and help]-[Opinion Feedback] page in the Tomato Free Novel Client.", "label": ["Important", "Contact Information"], "rewrite": "You can contact us through the [Mine]-[Feedback and help]-[Opinion Feedback] page in the Tomato Free Novel Client."}
{"task": "rw_19.jsonl", "id": 43994, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
