{"task": "rw_12.jsonl", "id": 41345, "text": "Welcome to use the WiFi universal key!", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41346, "text": "WiFi universal key privacy policy (abstract version)", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41347, "text": "Please click and read \"WiFi Universal Key Privacy Policy (Children's Edition)\"", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41348, "text": "1. In order to help you find the wifi that can be connected nearby, you need to agree with us to use the location information authority of your mobile phone.", "label": ["Permission Acquisition", "Important"], "rewrite": "In order to help you find WiFi that can be connected nearby, you need to grant location information authority."}
{"task": "rw_12.jsonl", "id": 41349, "text": "2. In order to provide you with more accurate personalized content services, you need to agree with us to use your mobile phone equipment to identify information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to provide you with more accurate personalized content services, you need to obtain the equipment logo information of your mobile phone."}
{"task": "rw_12.jsonl", "id": 41350, "text": "For details, please see \"Privacy Policy\":", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41351, "text": "\"WiFi Universal Key Privacy Policy\"", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41352, "text": "Recent update date: August 12, 2022", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41353, "text": "Release date: August 12, 2022", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41354, "text": "Thank you for using the WiFi universal key. This WiFi universal key has been updated in accordance with relevant laws and regulations and technical specifications, mainly including: further clarify the type and basic business function of our app (special prompt part);", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41355, "text": "For different business functions, the scope of personal information use and the third -party SDK information involved (part of the second part (1), (2), (3), (4), (5), (6)) further clarify youThe authorized personal information is treated (see the fifth part for details, information storage).", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41356, "text": "For personal information you have already authorized, further clarify that you have the right to change or withdraw authorization (see part 6 for details, change or withdraw authorization.", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41357, "text": "）。", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41358, "text": "overview", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41359, "text": "We will introduce you how we handle personal information in different scenarios through this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41360, "text": "When you turn on or use the WiFi universal key, we will handle relevant information in order to realize the functions, services you choose to use, or to comply with laws and regulations.", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41361, "text": "Except for the basic functions of WiFi universal key, the information required for services, and the information required by laws and regulations, you can refuse us to handle other information, but this may cause us to not provide corresponding functions and services.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41362, "text": "We will explain the relevant situation in the privacy policy. The important terms of your personal information rights and interests have been prompted in a bold form. Please pay special attention.", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41363, "text": "Nanjing Shangwang Network Technology Co., Ltd. (hereinafter referred to as \"our company\") and its affiliate companies Shanghai Director Technology Co., Ltd., Shanghai Lian Shang Network Technology Co., Ltd. (hereinafter referred to as \"we\") as the personal information processor under this policy, Very attach great importance to the protection of personal information and privacy, so we have formulated access to how to collect, store, use, share, and protect user information, as well as visits provided by us as users (hereinafter referred to as \"user\" or \"you\"), Update, delete and protect privacy policies.", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41364, "text": "We hope to clearly introduce our personal information and other information to your personal information and other information through the \"WiFi Universal Key Privacy Policy\" (hereinafter referred to as the \"Privacy Policy\").", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41365, "text": "This privacy policy is closely related to the products and services of your WiFi universal key. Before using all products and services of WiFi universal keys to read and thoroughly understand the privacy policy (especially the content of the thickened line), determine youWe have understood the processing rules of your personal information (see below) and other information, and make a corresponding choice that you think is appropriate.", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41366, "text": "When you use the WiFi universal key to serve as one product and service, it means that you agree and fully understand all the contents of the privacy policy.", "label": ["Policy Change", "Important", "Risk"], "rewrite": "When you use the WiFi universal key to serve as one product and service, it means that you agree and fully understand all the contents of the privacy policy."}
{"task": "rw_12.jsonl", "id": 41367, "text": "introduction", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41368, "text": "This policy includes the following:", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41369, "text": "1. Definition", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41370, "text": "2. How do we collect and use your personal information and other information", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41371, "text": "3. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41372, "text": "Fourth, share, commission processing, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41373, "text": "Fifth, how can we protect and preserve the information you provide safely", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41374, "text": "6. How do you access and control the information you provide", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41375, "text": "7. Protection of personal information of dead users", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41376, "text": "8. Notice and revision", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41377, "text": "Nine, applicable law and dispute resolution", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41378, "text": "Ten, how to contact us", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41379, "text": "Special Note", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41380, "text": "1. Thank you for the use and trust of WiFi universal keys. We will continue to work to provide you with more secure and reliable services.", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41381, "text": "2. For example, the products and services of WiFi universal key and its related companies use WiFi universal key products or services, but those who have not set up independent privacy policies, this privacy policy is also applicable to this part of the product or service.", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41382, "text": "If we and the affiliated company set up a privacy service policy for the products or services it provides you, the corresponding products or services are applicable to the corresponding privacy policy.", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41383, "text": "3. The privacy policy of the aforementioned specific products and services constitutes a part of the privacy policy. If it is inconsistent with the privacy policy, the privacy policies of specific products and services shall prevail.", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41384, "text": "4. This privacy policy is mainly applicable when you use the WiFi universal key. WiFi universal key products and services may involve products and services provided by third parties. We will monitor the products and services provided by the connected third -party to ensure thatYour rights, if you jump to a third party through the WiFi universal key to provide any losses to provide products and services, please contact us in time. We will provide you with the necessary help for your rights and interests.", "label": ["Important"], "rewrite": "If you jump to a third party through the WiFi universal key and suffer any losses to provide products and services, please contact us in time, and we will provide you with the necessary help."}
{"task": "rw_12.jsonl", "id": 41385, "text": "5. This privacy policy is only applicable to users over 14 years of age. If you are under 14 years of age (hereinafter referred to as \"children\"), or you are the guardian who registered the WiFi universal key account for children, please read it for childrenThe \"WiFi Universal Key Privacy Policy (Children's Edition)\" and other agreements are operated according to relevant requirements, including but not limited to the identity information, contact information of the guardian of at least one child in accordance with the requirements in orderIn accordance with the relevant requirements of the \"Children's Personal Information Network Protection Regulations\", the company notified and obtained their consent to the child's guardian, and the guardian registered in the name of related products and services in its own name.Obtty policy (Children's Edition) and other agreements, the company will collect, store, use, transfer, and disclose children's personal information in accordance with the \"WiFi universal key privacy policy (children's version)\".", "label": ["Specific Audiences", "Important"], "rewrite": "This privacy policy is only applicable to users over 14 years of age. Children and guardians under the age of 14, please read the \"WiFi Masterpiece Privacy Policy (Children's Edition)\". The company will process the child's personal information under the consent of the guardian."}
{"task": "rw_12.jsonl", "id": 41386, "text": "6. WiFi universal key attaches great importance to the protection of personal information of minors.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41387, "text": "If you are 14 years old but under the age of 18, before using our products and services, please ask your guardian to read this privacy policy carefully, and please use our product on the premise of obtaining your guardian's consent.And service or information to us.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are 14 years old but under the age of 18, please use products and services or provide information on the premise of obtaining your guardian's consent."}
{"task": "rw_12.jsonl", "id": 41388, "text": "If your guardian does not agree that you can use our services or provide information to us in accordance with this policy, please immediately terminate our service, and please or your guardian to inform us in writing in a timely manner.", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41389, "text": "When you receive your written notice and know or know yourself, when the WiFi universal key collects the personal information of the minor without obtaining the consent of the guardian in advance, the WiFi universal key will immediately stop the collection and use of relevant information.", "label": ["Specific Audiences", "Important"], "rewrite": "If the personal information of minors was collected without the consent of the legal guardian, he would try to delete relevant information as soon as possible."}
{"task": "rw_12.jsonl", "id": 41390, "text": "The WiFi universal key will protect the confidentiality and security of personal information of minors in accordance with the provisions of relevant national laws and regulations.", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41391, "text": "7. WiFi universal key also attaches great importance to the protection of information for the elderly.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41392, "text": "If you are 60 years old, you must read this privacy policy carefully before using our products and services, and clearly know that when the WiFi universal key provides services for you, it will protect your rights and interests in accordance with the law.Provide intelligent service, and carry out monitoring, identification and disposal of telecommunications network fraud information to facilitate your safe use of this product and service.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are 60 years old, when the WiFi universal key provides you with services, it will protect your rights and interests you enjoy in accordance with the law, provide you with intelligent service, and carry out monitoring, identification and disposal of telecommunications network fraud information."}
{"task": "rw_12.jsonl", "id": 41393, "text": "According to the \"Regulations on the Scope of Personal Information for Common Type Mobile Internet Applications\", this APP is a practical tool class. The basic functional services are \"hot search and connection, hotspot connection login, content browsing and search, content release, personalized recommendation, etc.\"After providing location information and equipment hotspot information (SSID, BSSID), you can use basic functional services.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41394, "text": "1. Definition", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41395, "text": "1. Personal information: (from the GB/T 35273-2020 \"Information Security Technology Personal Information Security Specification\"): It refersVarious information of the situation.", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41396, "text": "2. Personal sensitive information: (from GB/T 35273-2020 \"Information Security Technology Personal Information Security Specification\"): It means that once it is leaked, illegally provided or abused may endanger people's body and property, it is easy to lead to personal reputation, physical and mental health, physical and mental healthPersonal information that is damaged or discriminatory.", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41397, "text": "3. Anonymous: It refers to the process that the subject of personal information cannot be recognized or associated by the technical processing of personal information, and the processing information cannot be restored.", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41398, "text": "4. Devision: It refers to the process of processing or associated with the subject of personal information without using the technical processing of personal information to make it unable to identify or associate with the subject of personal information.", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41399, "text": "2. How do we collect and use your personal information and other information", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41400, "text": "We will explain the types of personal information and its corresponding uses we collected one by one, so that you can understand the category, use and collection of specific personal information collected for a specific function.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41401, "text": "\"WiFi Universal Key Collection Personal Information List\"", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41402, "text": "WiFi universal key uses position permissions, cameras, microphones, and album authority related sensitive permissions. The above permissions will not be opened by default. Only after obtaining your authorization will be used when you are authorized.Manage the corresponding authority in the application.", "label": ["Permission Acquisition", "Important", "Edit/Control"], "rewrite": "Position permissions, cameras, microphone, and album authority -related sensitive permissions can only be used when you have obtained your authorization to achieve specific functions, and you can withdraw authorization."}
{"task": "rw_12.jsonl", "id": 41403, "text": "\"Explanation of WiFi Universal Key Permissions Application and Usage\"", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41404, "text": "We will only collect and use your personal information and other information for the following legal purposes:", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We will only collect and use your personal information and other information for the following legal purposes:"}
{"task": "rw_12.jsonl", "id": 41405, "text": "(1) Account service", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41406, "text": "1. Account registration and login", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41407, "text": "A. Scope of personal information", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41408, "text": "(1) [Account Registration].", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41409, "text": "When you register, log in to the WiFi universal key and use related services, you can complete a series of registration procedures according to our guidelines. In the process, you need to provide us with the following information:, account nickname, mobile phone number.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you register, log in to the WiFi universal key and use related services, you need to provide us with account nickname and mobile phone number."}
{"task": "rw_12.jsonl", "id": 41410, "text": "We collect this information to help you complete the registration.", "label": ["Usage"], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41411, "text": "Collecting the mobile phone number is a necessary information for fulfilling the requirements of national laws and regulations. Only by providing real and accurate above information can you successfully register the WiFi universal key account.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Only by providing a real and accurate mobile phone number can you successfully register the WiFi universal key account."}
{"task": "rw_12.jsonl", "id": 41412, "text": "If you refuse to provide your mobile phone number for registration, it will not affect the product function provided by your WiFi universal key.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41413, "text": "(2) [Account Login].", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41414, "text": "Based on our cooperation with communication operators (China Telecom/China Mobile/China Unicom), when you use, \"One -click login\" function, after your consent, we will use the functions provided by the operator to bring your device in your device.The mobile phone number is as your registration, login account and exempt from password or dynamic verification code verification to provide you with fast registration and login service.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the \"One -click Login\" function, after your consent, we will use your mobile phone number as your registration, login account and avoid password or dynamic verification code to verify."}
{"task": "rw_12.jsonl", "id": 41415, "text": "If you don't want to use the \"one -click login\" function, you can register and log in to the WiFi universal key in other ways.", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41416, "text": "If you decide not to provide this information or permissions, it will not affect your connection service that uses WiFi universal keys.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41417, "text": "(3) [Registration of third -party accounts and login].", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41418, "text": "You can also use a third -party account to register and log in to the WiFi universal key, but you need to authorize us to obtain the information on your third -party platform (avatar, nickname, mobile phone number disclosure information, and other information you authorized,) to generate and this and thisThe WiFi universal key account bound to a third -party account allows you to register, log in and use WIFI universal key and corresponding services.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When registering and logging in with a third -party account, access and collect your personal information after your authorization to generate the WiFi universal key account and bind it."}
{"task": "rw_12.jsonl", "id": 41419, "text": "Among them, the login method, we need to verify and bind your mobile phone number to confirm the authenticity and correlation of the third -party account.", "label": ["Important", "Usage"], "rewrite": "Log in through a third -party account, we need to re -verify and bind your mobile phone number."}
{"task": "rw_12.jsonl", "id": 41420, "text": "At the same time, in order to help your application add a associated account, we need to obtain the authority of the application account list from the account service to obtain the authority of the application account list from the account service to help your application add a related account.", "label": ["Permission Acquisition", "Important"], "rewrite": "We need to obtain the permissions of the application account list to help you apply an associated account."}
{"task": "rw_12.jsonl", "id": 41421, "text": "The third -party service provider involved in this process may collect your personal information. For details, please refer to the \"WiFi Universal Key Third -Party Service Provider Instructions\".", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "For details, please refer to the \"WiFi Universal Key Third -Party Service Provider\"."}
{"task": "rw_12.jsonl", "id": 41422, "text": "(4) [Equipment Information].", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41423, "text": "In order to ensure your normal use of this product and service, we will collect device attribute information (including your, hardware models, operating system versions, network device hardware address MAC address, Android, IMEI, IMSI, ICCID, devicesHardware serial number, OAID), software list information (including the current software list, the software list and process of the current or recently run), the device connection information (telecommunications operator, the language used), the equipment network information, Equipment environmental information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect equipment attribute information, software list information, device connection information, device network information, equipment environmental information when you first use."}
{"task": "rw_12.jsonl", "id": 41424, "text": "Based on the security of your account, after you have authorized consent, we will collect device information (IMEI, IMSI, MEID, SN) by reading your phone status.", "label": ["Important", "First Party Collection Information"], "rewrite": "After you have authorized consent, we will collect device information by reading your phone status."}
{"task": "rw_12.jsonl", "id": 41425, "text": "In the process of using this application later, we will ensure the normal operation of the software through the verification of equipment information.", "label": ["Important", "Usage"], "rewrite": "We will ensure the normal operation of the software through the verification of equipment information."}
{"task": "rw_12.jsonl", "id": 41426, "text": "B. Use a third -party SDK", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41427, "text": "1. Equipment identification: China Information and Communication Research Institute SDK (including Zhuoxin ID, SDK and OAID, SDK), for identifying user devices.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "China Information and Communication Research Institute SDK is used to identify user devices."}
{"task": "rw_12.jsonl", "id": 41428, "text": "This SDK directly collects you, device information, equipment network information, equipment environmental information, and equipment application information. Such information is an information necessary to implement the SDK function.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "China Information and Communication Research Institute SDK directly collects your equipment information, equipment network information, equipment environmental information, and equipment application information."}
{"task": "rw_12.jsonl", "id": 41429, "text": "2., third -party registration and login: If you choose to use third -party registration and login accounts, you may use mobile login SDK, telecommunications login SDK, Unicom login SDK, Douyin login SDK, flash check SDK, the collection of this information is used for the collection of this information for the collection of this information for the collection for the collection for for the collection of this information for the collection for the collection for the collection for the collection for the collection for the collection for the collection for the collection.Help you realize one -click login.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you choose to use third -party registration and login account, you may use mobile login SDK, telecommunications login SDK, Unicom login SDK, Douyin login SDK, flash check SDK."}
{"task": "rw_12.jsonl", "id": 41430, "text": "This type of SDK will directly collect your: device logo information (MAC address, Androididid, IMEI, IMSI, ICCID), network information, mobile phone number, this information is an information necessary for implementing the above SDK function.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Mobile login SDK, telecommunications login SDK, Unicom login SDK, Douyin login SDK, flash check SDK will directly collect your device logo information, network information, and mobile phone numbers."}
{"task": "rw_12.jsonl", "id": 41431, "text": "Please note that the third -party service provider involved in this process may collect your personal information. For details, please refer to \"WiFi Universal Key Third -Party Service Provider\"", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41432, "text": "(2) Hot search and connection service", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41433, "text": "A. Scope of personal information", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41434, "text": "1. If you use it, [connecting hotspot] service, to provide you with accurate and secure peripheral hot information, you need to open your positioning authority. In the processInstrument sensor, gravity sensor, acceleration sensor, magnetic field sensor information.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "If you use the [Connection Hot] service, you need to open your positioning permissions to get your location information, base station ID data information, gyroscope sensor, gravity sensor, acceleration sensor, magnetic field sensor information."}
{"task": "rw_12.jsonl", "id": 41435, "text": "At the same time, we will search for hot hotspots of surrounding security, read their SSID information, and use your switch to WLAN permissions to realize your connection hotspot needs. At the same time, in orderGet your location information and SSID information. If you turn off your positioning permissions, you will not be able to provide you with connecting network services.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "We will search for hot hotspot information around the surrounding security, read their SSID information, and use your switch to the WLAN permissions to achieve your connection hotspot needs."}
{"task": "rw_12.jsonl", "id": 41436, "text": "In addition, some hotspots are implemented by our cooperation with third parties. Connecting these hotspots requires you to log in to the WiFi universal key for certification before accessing the Internet. At that time, we will pass your mobile phone number to third -party partners to meet the requirements of the Ministry of Public Security.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The hotspots of our cooperation with our third -party need to log in to the WiFi universal key to authenticate before accessing the Internet."}
{"task": "rw_12.jsonl", "id": 41437, "text": "2. If you use [Hot Sign in], [Notice/Push], [Discovery], you will use your positioning information and notify the push of information to provide you with nearby available security hotspots, and precise precision.The news service, if you choose to turn on the floating window rights, the WiFi universal key can push you to you through the form of a screen suspension window, and you can also close some functions through the local system settings or the software corresponding settings.", "label": ["Important", "Usage", "Edit/Control"], "rewrite": "If you use [Hot Sign -in], [Notice/Push], [Discovery], you will use your positioning information and notification barracks or suspension windows permissions to push information. You can close some functions."}
{"task": "rw_12.jsonl", "id": 41438, "text": "3. If you use the [Share Hot] service, you need to submit hot information and WIFI passwords, and let other users connect to the Internet for free through your sharing.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If you use the [Share Hot] service, you need to submit hot information and WIFI passwords."}
{"task": "rw_12.jsonl", "id": 41439, "text": "You can also choose [Cancel the Share Hot Spot] service, provide your mobile phone number or email address information, hotspot information, and WiFi password information. The WiFi universal key customer service specialist will confirm whether the hotspot sharing is canceled with you through the information you submit.", "label": ["Edit/Control", "First Party Collection Information", "Usage", "Important"], "rewrite": "You can choose [Cancel the Share Hot Spot] service to provide your mobile phone number or email address information, hotspot information and WIFI password information."}
{"task": "rw_12.jsonl", "id": 41440, "text": "4. If you use the [WIFI Security Insurance] service, you need to submit your name, mobile phone number, email address, common address, ID card information, we will provide this information to the insurance companyReview.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If you use the [WIFI Security Insurance] service, you need to submit your name, mobile phone number, email address, common address, and ID information."}
{"task": "rw_12.jsonl", "id": 41441, "text": "If you decide not to provide the information, you will not be able to submit the insurance claims related to your insurance company, so you may not be able to use this service;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41442, "text": "When a merchant uses the [WIFI Security Insurance] service, it may still need to open the location permissions to obtain nearby hotspots.", "label": ["Permission Acquisition", "Important"], "rewrite": "When a merchant uses the [WIFI Security Insurance] service, it may still need to open the location permissions to obtain nearby hotspots."}
{"task": "rw_12.jsonl", "id": 41443, "text": "5. Ensure the functions necessary for connecting services and security", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41444, "text": "• In order to more accurately prevent fishing hotspot fraud and protect your account or transaction security, it provides security services including but not limited to hot security inspection and WIFI security insurance;", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41445, "text": "We will also collect your software list information (including the current software list, the current or recently run software lists and running processes), and conduct network traffic monitoring and investigating possible risks (including but not limited to whether there is no existence or not.Safe or malware, automatic consumption).", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect your software list information to monitor and investigate the possible risks that may exist to ensure connection services and security."}
{"task": "rw_12.jsonl", "id": 41446, "text": "Please note that the above data information does not include any personal sensitive information.", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41447, "text": "• In order to improve the speed of software operation and reduce the access to personal information and the consumption of network traffic, we will make some information (including pictures, versions records) in the service process.In the process of using related functions, we will read and write about your SDCARD and data information. Please note that the above information does not include any personal sensitive information.", "label": ["Data Retention", "Important"], "rewrite": "We will read and write your SDCARD data information to reduce the access of personal information, the consumption of traffic, and the speed of the software."}
{"task": "rw_12.jsonl", "id": 41448, "text": "B. Use a third -party SDK", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41449, "text": "1. Positioning hotspot position: If you use the above services, the SDKs that may be involved include Tencent Map SDK, Gaode Map SDK, and Baidu Map SDK, which is used to confirm the location of the user to find nearby hotspots. Such SDKs will collect them.Your device logo information (MAC address, Androidid, IMEI, IMSI, ICCID), location information, network information, base station ID data information, gyroscope sensor, gravity sensor, acceleration sensor, magnetic field sensor information, the acquisition of such SDK information is the acquisition of such SDK information isImplement the information necessary for the above SDK function.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "You may involve Tencent Map SDK, Gaode Map SDK, and Baidu Map SDK when using services to collect your equipment identification information, location information, network information, etc. to confirm the location of the user to find nearby hotspots."}
{"task": "rw_12.jsonl", "id": 41450, "text": "2. In order to ensure that the push of hot information nearby nearby arrives in time, the SDKs that you may involve when using our service include Huawei push SDK, vivo push SDK, OPPO push SDK, Xiaomi push SDK, push push SDK, Aurora push SDK, SDK, SDK push, SDK, SDK, SDK, SDK, SDK, SDK, SDK, SDK,The collection of the SDK information is mainly to ensure that nearby hot information can be pushed to your device in time.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Huawei pushes SDK, vivo push SDK, OPPO push SDK, Xiaomi push SDK, push push SDK, Aurora push SDK collection information to ensure that the nearby hot information is available in time."}
{"task": "rw_12.jsonl", "id": 41451, "text": "Such SDKs will collect your device identification information (MAC address, IMEI, Serial), and network information. The acquisition of such information is the information necessary for the above SDK function.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "This type of SDK will collect your equipment identification information and network information."}
{"task": "rw_12.jsonl", "id": 41452, "text": "Please note that the third -party service provider involved in this process may collect your personal information. For details, please refer to \"WiFi Universal Key Third -Party Service Provider\"", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For details, please refer to the \"WiFi Universal Key Third -Party Service Provider\"."}
{"task": "rw_12.jsonl", "id": 41453, "text": "(3) Browse and search", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41454, "text": "A. Scope of personal information", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41455, "text": "1. [Content browsing].", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41456, "text": "In the process of visiting the WiFi universal key content, we will record your usage.", "label": ["Important", "First Party Collection Information"], "rewrite": "In the process of visiting the WiFi universal key content, we will record your usage."}
{"task": "rw_12.jsonl", "id": 41457, "text": "If you do not log in to the account, we will record your [click, browse, sharing information] by the corresponding identifier information of the device.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you do not log in to the account, we will record your behavior information through the identifier information corresponding to the device."}
{"task": "rw_12.jsonl", "id": 41458, "text": "If you have logged in to your account, we will record your [click, browse, sharing, focusing, collecting, feedback, release, praise (like), comments, etc.].", "label": ["Important", "First Party Collection Information"], "rewrite": "If you have logged in to your account, we will record your behavior information through your WiFi universal key account."}
{"task": "rw_12.jsonl", "id": 41459, "text": "For example, when you browse or use the content or service where the device is located, after your authorization, we will use geographical location information related to this service (such as accurate positioning information, WLAN access point base stations, gyroscopes sensors, gravity sensors, gravity sensors, Acceleration sensor, magnetic field sensor information), to ensure the quality of content or service, and recommend suitable hot spots or services to you.", "label": ["Important", "Usage"], "rewrite": "For example, when you browse or use the content or service of the location where the device is located, we have authorized the use of geographical location related to this service."}
{"task": "rw_12.jsonl", "id": 41460, "text": "The precise positioning information is personal sensitive information. If you refuse to authorize the position permissions, it will affect the accuracy of the positioning, but it will not affect the normal use of other functions and services.The county shows you possible content or services.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41461, "text": "2. If you use the [Browser] service, in order to provide you with better services, we will collect your network history record information to identify web pages with hidden security hazards, find network problems or client defects.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you use the [Browser] service, we will collect your network history record information to identify web pages, find network problems or client defects with hidden safety hazards."}
{"task": "rw_12.jsonl", "id": 41462, "text": "When you use search, we will collect your search keyword information, access time, and log records.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use search, we will collect your search keyword information, access time, and log records."}
{"task": "rw_12.jsonl", "id": 41463, "text": "Search keyword information will be temporarily stored in your device, so when you use the search function on the same device, we will show you your search history.", "label": ["Data Retention", "Important"], "rewrite": "Search for keyword information will be temporarily stored in your device, and you use it to show you again."}
{"task": "rw_12.jsonl", "id": 41464, "text": "If you decide not to provide the information, please do not use this service.", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41465, "text": "3. [Log Information].", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41466, "text": "In order to facilitate your use of this product and service, our server may automatically record some information, including your use of our products and services, IP addresses and language, downloading, installation or using this software information, and access servicesDate, time, and service log information (including service failure information).", "label": ["Important", "First Party Collection Information"], "rewrite": "Our server may automatically record some of your use information to facilitate your use of this product and service."}
{"task": "rw_12.jsonl", "id": 41467, "text": "Please note that the above information does not include the content you may send or share through the application, service or website.", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41468, "text": "At the same time, we will also take encryption processing information to ensure the security of information.", "label": ["Important", "Data Security"], "rewrite": "We will be encrypted on information to ensure information security."}
{"task": "rw_12.jsonl", "id": 41469, "text": "4. In order to improve the speed of software operation and reduce the access to personal information and the consumption of network traffic, we will make some information (including pictures, versions records) during the service process.In the process of using related functions, we will read and write about your SDCARD and data information. Please note that the above information does not include any personal sensitive information.", "label": ["Data Retention", "Important"], "rewrite": "In the process of service, we will temporarily read and write some information encrypted and encrypted to reduce the use of traffic."}
{"task": "rw_12.jsonl", "id": 41470, "text": "B. Use a third -party SDK", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41471, "text": "1. Positioning location: If you use location service, the third -party SDK that may be involved includes: Tencent Map SDK, Gaode Map SDK, Baidu Map SDK.This type of SDK will collect your device logo information (MAC address, AndroidId, IMEI, IMSI, ICCID), location information, network information, base station ID data information, gyroscope sensor, gravity sensor, acceleration sensor, magnetic field sensor information, hereThe collection of class information is the information necessary for the above SDK function.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "If you use location services, the third -party SDK that may involve your equipment identification information, location information, network information, network information, base station ID data information, etc."}
{"task": "rw_12.jsonl", "id": 41472, "text": "2. Information push function: If you use the above information push service, the third -party SDK involved includes: Huawei push SDK, vivo push SDK, OPPO push SDK, Xiaomi push SDK, push push SDK, Aurora push SDK, this shouldThe collection of SDK information is mainly used to ensure that nearby hot information can be pushed to your device in time.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "If you use information push services, Huawei push SDK, vivo push SDK, OPPO push SDK and other collection information to ensure hot information push in time."}
{"task": "rw_12.jsonl", "id": 41473, "text": "Such SDKs will collect your device identification information (MAC address, IMEI, Serial), and network information. The acquisition of such information is the information necessary for the above SDK function.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "SDK collects your equipment identification information and network information to achieve the function of message push."}
{"task": "rw_12.jsonl", "id": 41474, "text": "Please note that the third -party service provider involved in this process may collect your personal information. For details, please refer to \"WiFi Universal Key Third -Party Service Provider\"", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For details, please refer to the \"WiFi Universal Key Third -Party Service Provider\"."}
{"task": "rw_12.jsonl", "id": 41475, "text": "(4) Information release", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41476, "text": "A. The scope of personal information use", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41477, "text": "1. [Information release].", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41478, "text": "If you use [Follow], [Favorites], [Like], [Comment], [Share] and other services, the dynamic information of your personal behavior will be stored in our server, because storage is to realize this function.necessary.", "label": ["Data Retention", "Important"], "rewrite": "If you use services such as [Following], [Favorite], [Like], [Comment], [Share] and other services, your behavior dynamic information will be stored in the server."}
{"task": "rw_12.jsonl", "id": 41479, "text": "When you implement the above behavior, in order to ensure the ecological health of the content of the network information, you must not produce, copy, publish, or other methods to display third -party links in the platform review content we provide.", "label": ["Edit/Control", "Important"], "rewrite": "You must not produce, copy, publish or other methods we provide to the content of the platform comments."}
{"task": "rw_12.jsonl", "id": 41480, "text": "You must not make, copy, and publish the information containing the following:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41481, "text": "• Oppose the basic principles determined by the Constitution;", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41482, "text": "• Harmly network security;", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41483, "text": "• Harmly national security, leak state secrets, incite the division of the country, subvert the state power, and destroy the honor and interests of the country's unity;", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41484, "text": "• Instant dissection of national honor and interests to subvert the state power and overthrow the socialist system;", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41485, "text": "• Die, ugliness, blasphemy, deny the deeds and spirit of heroes martyrs, and infringe on the name, portrait, reputation, honor of the heroes and martyrs in insulting, slander or other ways to infringe on the name, portrait, reputation, and honor to destroy the unity of the country;", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41486, "text": "• Leaks state secrets;", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41487, "text": "• Promote terrorism, extremism, or incite the implementation of terrorist activities and extremism activities;", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41488, "text": "Destroy national religious policies and promote cults and feudal superstitions;", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41489, "text": "• Promote national hatred, national discrimination, and destroy national unity;", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41490, "text": "• Passion, spreading obscene, pornography, gambling, violence, homicide, horror or instigating crime to spread violence and obscene pornographic information;", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41491, "text": "• Trend minors illegal crimes and rendering violence, pornography, gambling, terrorist activities;", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41492, "text": "• Production, publishing, and spreading information about the security of children's personal information;", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41493, "text": "• Building, spreading false information or spreading rumors, disrupting economic order and social order;", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41494, "text": "• Insultation or slandering others, infringe on the reputation, privacy, intellectual property rights and other legitimate rights and interests of others;", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41495, "text": "• Tracking or harassing others in other ways, illegally invading the network of others, interfere with the normal functions of the network of others, and steal network data such as dangerous network security;", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41496, "text": "• Provide others with procedures and tools that are specially used to engage in network security activities such as intrusion networks, interfere with the normal functions of the network and protective measures, and stealing network data, or know that others are engaged in activities that endanger network security, providing technical support and advertisingActions to promote, payment settlement and other help;", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41497, "text": "• Use the services provided by the company to implement fraud, teach criminal methods, produce or sell websites and communications groups such as illegal activities such as illegal activities such as prohibited items and controlling items, or use the company's network to release fraud, production, or sales involving the implementation of fraud, production or sales of fraud, production or salesInformation about prohibited items, controlling items and other illegal crimes;", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41498, "text": "• Software viruses or other computer code, files and programs that are related to interference, destruction, or restricting any computer software, hardware or communication equipment functions, are uploaded, post, send emails or transmit them in other ways;", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41499, "text": "• Do not comply with the requirements of \"seven bottom lines\" such as compliance with laws and regulations, socialist systems, national interests, legal interests of citizens, public order, social morality and information authenticity;", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41500, "text": "• Information containing other contents of law and administrative regulations;", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41501, "text": "• Other information that violates laws and regulations, policies and public order, public morality, or interfere with the normal operation of the software and infringe on the legitimate rights and interests of other users or third parties.", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41502, "text": "If you decide not to use the storage function of our server, please do not use this service.", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41503, "text": "2. [Graphic, Video Release].", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41504, "text": "In community and social services, when you [shooting], [click] or [Published] audio videos, pictures, we will ask you to authorize the camera, album, and microphone rights according to the function types you use.", "label": ["Permission Acquisition", "Important"], "rewrite": "In community and social services, when you [shooting], [click] or [Published] audio and videos, we will ask you to authorize the rights of the camera, album, and microphone."}
{"task": "rw_12.jsonl", "id": 41505, "text": "At the same time, we may be based on the relationship between you and other users authorized, or you and other users choose the information displayed on the personal homepage, the interaction behavior of you and other users to recommend it to you, or after you authorize the geographical location information, weRecommend people nearby.", "label": ["Important", "Usage"], "rewrite": "We may recommend to you based on the information and interactive information you show, or you recommend the people nearby after you authorize the geographical location information."}
{"task": "rw_12.jsonl", "id": 41506, "text": "If you refuse to authorize, you will not be able to use the features recommended by the shooting, publishing, and obtaining attached, but it will not affect other functions of your use of WiFi universal key.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41507, "text": "3. In order to improve the speed of software operation and reduce the access to personal information and the consumption of network traffic, we will make some information (including pictures, versions records) during the service process.In the process of using related functions, we will read and write your SDCARD data information. Please note that the above information does not include any personal sensitive information of your personal.", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41508, "text": "B. Use a third -party SDK", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41509, "text": "1. Positioning location: If you need to use the location service when you publish the content, the third -party SDK that may be involved includes: Tencent Map SDK, Gaode Map SDK, Baidu Map SDK, the collection of this SDK information is mainly used to locate your location so that it is so that it can so as to do so in orderDisplay your positioning information when publishing. Such SDKs will collect your device logo information (MAC address, Androidid, IMEI, IMSI, ICCID), location information, network information, base station ID data information, gyro sensor, gravitational sensor, gravity sensor, Acceleration sensor and magnetic field sensor information. The collection of such information is the information necessary for the above SDK function.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Tencent Map SDK, Gaode Map SDK, Baidu Map SDK collects your device logo information, location information, network information, network information, base station ID data information, etc. for location services."}
{"task": "rw_12.jsonl", "id": 41510, "text": "2. Sharing function: If you need to share the content, the third -party SDK that may be involved includes: WeChat SDK, this type of SDK will collect your device logo information (MAC address, Androidid, IMEI, IMSI, ICCID), location information, location information, location information, Network information, base station ID data information, gyroscope sensor, gravity sensor, acceleration sensor, magnetic field sensor, application list information (including the current software list, current or recent software lists and running processes) information, thisThe collection of class information is the information necessary for the above SDK function.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "WeChat SDK collects your device logo information, location information, network information, network information, base station ID data information, etc. to achieve sharing functions."}
{"task": "rw_12.jsonl", "id": 41511, "text": "Please note that the third -party service provider involved in this process may collect your personal information. For details, please refer to \"WiFi Universal Key Third -Party Service Provider\"", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41512, "text": "(5) Personalized recommendation", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41513, "text": "A. The scope of personal information use", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41514, "text": "In order to show you more information with and recommend more related services, it provides services that meet your requirements, so that you can use the WiFi universal key to be more convenient or experienced, and the WiFi universal key will collect, use your personal information, and use your computer algorithm through your computer algorithm.Model automation computing and predicting your preferences to match information or services you may be interested in.", "label": ["Important", "Usage"], "rewrite": "WiFi universal key collects, use your personal information and automatically calculates and predict your preferences through computer algorithm models to match the information or service you may be interested in."}
{"task": "rw_12.jsonl", "id": 41515, "text": "In order to predict your preferences, we may collect and use your device information, location information, and behavior information when using WiFi universal keys, and when you have interaction with our affiliated companies, suppliers and other partners, we getFor information, the following we will explain in detail to personalized recommendations that may collect and use your personal information and other information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may collect and use your device information, location information, behavior information, and other information you have authorized to predict your preference."}
{"task": "rw_12.jsonl", "id": 41516, "text": "If you do not use personalized recommendation functions, you can turn off in \"My-Settings-Intelligent Recommendation Settings\". After closing, you can still use the WiFi universal key, but you may not be able to use thesePersonalized recommendation service.", "label": ["Important", "Edit/Control"], "rewrite": "You can turn off in \"My-Settings-Smart Recommendation Settings\"."}
{"task": "rw_12.jsonl", "id": 41517, "text": "Service content recommendation function (including personalized recommendation/directional push): We have [information content recommendation] [personalized advertisement] function to show the product or service information you are interested in.", "label": ["Important", "Usage"], "rewrite": "We have [Information content recommendation] [personalized advertising] features to show the product or service information you are interested in."}
{"task": "rw_12.jsonl", "id": 41518, "text": "In the process, we may collect your equipment information, browsing information, and software list information (including the current software list, the software list and process of the current or recently run), and we may also use the creation of creationCombining cookie, pixel labels, and similar technologies, combine your information with a certain service with other services information, analyze your interests, etc. to form a user portrait and use it for this function.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may collect your device information, browsing information, software list information, and use cookies, pixel labels and similar technologies to generate user portraits."}
{"task": "rw_12.jsonl", "id": 41519, "text": "Please know that the personalized recommendation algorithm in the WiFi universal key does not identify the true identity of a specific natural person, just to provide higher and richer information based on user behavior and characteristics.", "label": ["Important", "Usage"], "rewrite": "Personalized recommendation algorithms do not identify the true identity of specific natural persons."}
{"task": "rw_12.jsonl", "id": 41520, "text": "If you want to stop using the service content recommendation function for the time being, you can turn off through \"My-Settings-Intelligent Recommendation Settings\".", "label": ["Edit/Control", "Important"], "rewrite": "You can close the service content recommendation function through \"My-Settings-Smart Recommendation Settings\"."}
{"task": "rw_12.jsonl", "id": 41521, "text": "If you decide to close this function, the number of recommendations you receive will not change, but the correlation between recommendation will decrease.", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41522, "text": "The decision to close permissions will not affect the processing of personal information and other information based on your authorization.", "label": ["Important", "Edit/Control"], "rewrite": "The decision to close permissions will not affect the information processing based on authorization."}
{"task": "rw_12.jsonl", "id": 41523, "text": "B. Use third -party SDK and API", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41524, "text": "1. Third -party content and recommendation: If the above -mentioned functions you use are provided by the third party of cooperation, the third -party SDK that may be involved includes: Douyin Live SDK, Douyin Volcano Video SDK, Kuaishou SDK, Weibo Information API, API, and Weibo,Kuaishou video API, Kuaishou Information API, Today's Headline API, Baidu Information API, the collection of this type of SDK and API information is mainly used to confirm your information to recommend what you are interestedAddress, Android, IMEI, IMSI, ICCID, OAID, Serial,), location information, network information, base station ID data information, gyroscope sensor, gravity sensor, acceleration sensor, magnetic field sensor, application list (including the current installed application software listThe current or recent software list and process of operation) information, the collection of such information is the information necessary for the above SDK function.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "If you use third -party provided services, you may involve Douyin Live SDK, Douyin Volcanic Video SDK, Kuaishou SDK, Weibo Information API, Kuaishou Video API, Kuaishou Information API, Today's Headline API, Baidu Information API, such SDKCollect your information with API to recommend what you are interested in."}
{"task": "rw_12.jsonl", "id": 41525, "text": "If you want to stop using the service content recommendation function for the time being, you can turn off through \"My-Settings-Intelligent Recommendation Settings\".", "label": ["Edit/Control", "Important"], "rewrite": "You can turn off the service content recommendation function through \"My-Settings-Smart Recommendation Settings\"."}
{"task": "rw_12.jsonl", "id": 41526, "text": "If you decide to close this function, the number of recommendations you receive will not change, but the correlation between recommendation will decrease.", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41527, "text": "The decision to close permissions will not affect the processing of personal information and other information based on your authorization.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41528, "text": "2. Third -party advertising cooperation: If the advertising service you use is provided by a third party, the third -party SDK that may be involved includes: pangolin SDK, Guangxian Tong SDK, Baidu Network League SDK, Kuaishou Advertising SDK, Tradplus, SDK, such categoryInformation collected by SDK includes: basic information: equipment brand, equipment model, software system version, storage information, operator information, equipment time zone, equipment language, network information and other basic information;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Pangolon SDK, Guangxian Tong SDK, Baidu Net Union SDK, Kuaishou Advertising SDK, TradPlus SDK Collect your information to provide you with advertising services."}
{"task": "rw_12.jsonl", "id": 41529, "text": "Device logo (IMEI, OAID, Androidid, IMSI, ICCID), location information (IP address, MAC address, GPS location information, base station information, WIFI information), application list (including currently installed application software lists, currently or recently runSoftware lists and running processes), other information: sensor information (gyroscope sensor, gravity sensor, acceleration sensor), SIM card activation information. The collection of such information is the information necessary for the above SDK function. Such SDKAfter initialization, when you show you advertisements and click on advertising, SDK will obtain relevant information through your own logical call system API.", "label": ["Usage", "Third Party Sharing/ Disclosure", "First Party Collection Information"], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41530, "text": "If you want to stop using the advertising service content recommendation function for the time being, you can turn off through \"My-Settings-Smart Recommendation Settings\".", "label": ["Edit/Control", "Important"], "rewrite": "You can close the advertising service content recommendation function through \"My-Settings-Smart Recommendation Settings\"."}
{"task": "rw_12.jsonl", "id": 41531, "text": "If you decide to close this function, the number of recommendations you receive will not change, but the correlation between recommendation will decrease.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41532, "text": "The decision to close permissions will not affect the processing of personal information and other information based on your authorization.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41533, "text": "Please note that the third -party service provider involved in this process may collect your personal information. For details, please refer to \"WiFi Universal Key Third -Party Service Provider\"", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41534, "text": "(6) Other functions and scenes", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41535, "text": "1. The operational service of [Egg Chicken \"and\" Points Sign -in \"], of which the golden eggs in the eggs can be used as virtual currencies, you can buy products or services, points sign -in can be exchanged for products in the WiFi universal key platformEssence", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41536, "text": "If you choose to use the above service, you need to provide your recipient's name, mobile phone number, and personal information of common address. If you refuse to provide this information, it will not affect your continued use of other functions of WiFi universal key. At the same time, you can continue to participate in use and useEgg chickens and points sign -in activities, but you will not be able to use the service or service exchange activities provided by this service.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you use the exchange service of [Egg Chicken \"and\" Points Sign -in \"], you need to provide the recipient's name, mobile phone number and common address personal information."}
{"task": "rw_12.jsonl", "id": 41537, "text": "2. [Lian Shang Wallet] The function will be provided by Shanghai Shengfan Electronic Payment Service Co., Ltd. (hereinafter referred to as \"Shengfitong\") to you.", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41538, "text": "When you click on the Lian Shang wallet, to help you use your WiFi universal key account to log in to Lianchang Wallet and meet the requirements of the online payment real -name system, Shengfang needs to obtain you when you log in to the WiFi universal key account, mobile phone number and hardware equipmentModels, software version information, device recognition information (such as IMEI, IDFA, OAID, etc.), IP address, area, mobile network information.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "When you click on the Lian Shang wallet, Sheng Fu Tong needs to get the mobile phone number, hardware equipment model, software version information, equipment recognition information, IP address, region, mobile network information you use when you log in to your accountRequire."}
{"task": "rw_12.jsonl", "id": 41539, "text": "In order to provide you with convenient and secure payment services, Sheng Payon may require you to provide real name, ID information, bank card information, bank reserved mobile phone number, GPS positioning information, standard network log data and network usage habits, and useThe operation logs and application lists of Shengfu Tong service (including the current software list, the software list and the process of the current or recent operation), in order to provide you with payment assistance functions, such as face authentication, uploading ID cards, uploading ID cards, uploading ID cards.Sheng Fu Tong needs to obtain the permissions of accessing your camera and album.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "Shengfitong may require you to provide real names, ID information, bank card information, bank reserved mobile phone number, GPS positioning information, standard network log data and network usage habits, and use the operation logs, application lists, and application lists of Shengfitong services, andGet the camera and album authority to provide you with payment services."}
{"task": "rw_12.jsonl", "id": 41540, "text": "Sheng Fu Tong will collect, use and store relevant regulations in accordance with the relevant provisions of relevant departments such as laws and regulations and the People's Bank of China.", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41541, "text": "In response to the above -mentioned sensitive information, we will collect and process your clear consent through pop -up form. If you decide not to provide the information or permissions, you will not be able to provide your identity and payment information to the bank.Provide you all the above/part of the service.", "label": ["Important", "First Party Collection Information"], "rewrite": "For sensitive information, we will collect and process your clear consent through pop -up form."}
{"task": "rw_12.jsonl", "id": 41542, "text": "Please note that the third -party service provider involved in this process may collect your personal information. For details, please refer to \"WiFi Universal Key Third -Party Service Provider\"", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For details, please refer to the \"WiFi Universal Key Third -Party Service Provider\"."}
{"task": "rw_12.jsonl", "id": 41543, "text": "3. If you use the [Flow Statistics] service, you need to access the permissions of your viewing software to obtain your software list information (including the current software list, the software list of the current or recently run) And show you the statistics of each application.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "If you use the [Flow Statistics] service, you need to access the authority of your viewing software to obtain your software list information and display the traffic statistics of each application.Essence"}
{"task": "rw_12.jsonl", "id": 41544, "text": "If you decide not to provide this permissions, you will not be able to provide you with a software -based traffic statistics service.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41545, "text": "4. If you use the [Download] service, we need to use the authority of access, modify/delete the content of the content in the SD card in order to write the storage information in the SD card.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you use the [Download] service, you need to use the permission to access, modify/delete the content in the SD card so that you can write the storage information in the SD card."}
{"task": "rw_12.jsonl", "id": 41546, "text": "If you decide not to provide the permission, please do not use this service.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41547, "text": "5. If you use the [Watermark Camera] service, you need to access your camera permissions, location permissions, and storage permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you use the [Watermark Camera] service, you need to access your camera permissions, location permissions, and storage permissions."}
{"task": "rw_12.jsonl", "id": 41548, "text": "If you decide not to provide the permission, please do not use this service.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41549, "text": "6. If you use [garbage cleaning] service, you need to turn on the storage right.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you use the [garbage cleanup] service, you need to turn on the storage permissions."}
{"task": "rw_12.jsonl", "id": 41550, "text": "If you decide not to provide the permission, please do not use this service.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41551, "text": "(7) Scenes involved in third -party cooperation parties", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41552, "text": "Please note that the third -party service provider involved in the use of the following and third -party cooperation may collect your personal information. For details, please refer to the \"WiFi Universal Key Third -Party Service Provider Instructions\".", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41553, "text": "In this scenario, the third direction involves providing the quality and personalization of products or improvement of products and services in this scene, or reasonable needs for consideration of product and service safety.Companies, alliance members, partners and other trusted third -party suppliers, service providers and agents to receive your personal information and other information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Involving the quality and personalization of third -party providing products/services or improvement of product services, you need to accept your personal information and other information from third parties."}
{"task": "rw_12.jsonl", "id": 41554, "text": "We will confirm the legitimacy of the source of third -party personal information and use your personal information within the scope of your authorized consent to the third party.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will confirm the legitimacy of the source of third -party personal information and use your personal information within the scope of your authorization consent."}
{"task": "rw_12.jsonl", "id": 41555, "text": "If the products and functions we provide beyond your scope of use, we or we will ask the above third parties to obtain your consent again.", "label": ["Important", "First Party Collection Information"], "rewrite": "The products and functions we provide beyond your authorization scope and will recruit your consent again."}
{"task": "rw_12.jsonl", "id": 41556, "text": "At the level of agreement, we will request a third party to commit a commitment to the legality and compliance of the source of personal information. If the third party violates the behavior, we will clearly ask the third party to bear the corresponding legal responsibility.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "At the level of agreement, we will require third parties to commit to the legality and compliance of personal information sources."}
{"task": "rw_12.jsonl", "id": 41557, "text": "1. 【E -commerce service】", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41558, "text": "A. Scope of personal information:", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41559, "text": "(1) Order and order management: When you use e -commerce services through the WiFi universal key, if you \"buy\" business, because of different cooperation with third parties, you may need to provide the recipient's name, mobile phone number, and mobile phone number, andFor common address information and equipment information, we will provide a third -party of the service to collect your order information.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "When you use e -commerce services through WiFi universal keys, you may need to provide you with a recipient's name, mobile phone number, common address information and equipment information to a third party providing services."}
{"task": "rw_12.jsonl", "id": 41560, "text": "At the same time, if you authorize to open the order synchronization function, we will summarize the above third -party collection of your order information to facilitate you to check all orders in [Order Center].", "label": ["Important", "Edit/Control"], "rewrite": "If you authorize to open the order synchronization function, we will summarize to display third -party collection of your order information to facilitate you to check in [Order Center]."}
{"task": "rw_12.jsonl", "id": 41561, "text": "The operating system, and share it with third -party payment, SDK;", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "When you use the online payment function to purchase various products or services of the platform, we will upload your payment information, equipment types, equipment models, operating systems, and share it with third -party payment SDK."}
{"task": "rw_12.jsonl", "id": 41562, "text": "Such information is a necessary information about this function. If you do not agree to collect and share such information, you may not be able to use the online payment function normally.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41563, "text": "B. Use a third -party SDK", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41564, "text": "(1) When you use e -commerce services, you may involve the Cair Popler SDK. The SDK is mainly used for jumping on the JD product purchase page.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When you use e -commerce services, you may involve the Cairfler SDK."}
{"task": "rw_12.jsonl", "id": 41565, "text": "This SDK will directly collect your network information (WIFI status, WIFI information), and the unique identification information of the device (MAC address, android_id). Such information is the necessary information necessary to implement the above SDK function.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Prete SDK will directly collect your network information and device unique identification information."}
{"task": "rw_12.jsonl", "id": 41566, "text": "(2) When you use e -commerce services, you may also involve Baichuan SDK. The SDK is mainly used for the jump of Taobao goods purchase page.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When you use e -commerce services, you may involve Baichuan SDK."}
{"task": "rw_12.jsonl", "id": 41567, "text": "This SDK will directly collect your network information (WIFI, Status, WiFi Information, WiFi List), Motivation (MAC, address, IMSI, IMEI, SN code, Android_id), location information, address book data, camera authority, microphonePermanent, such information is an information necessary for implementing the above SDK function.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Baichuan SDK will directly collect your network information, device unique logo, location information, address book data, camera permissions, microphone rights."}
{"task": "rw_12.jsonl", "id": 41568, "text": "(3) When you use e -commerce services, you may also involve Pinduoduo SDK. The SDK is mainly used for the jumping function of Pinduoduo product purchase page.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When you use e -commerce services, you may involve Pinduoduo SDK."}
{"task": "rw_12.jsonl", "id": 41569, "text": "This SDK will directly collect your device logo information (Androidid,, SN), application list, location information, network information (WiFi list). Such information is the information necessary to implement the above SDK function.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Pinduoduo SDK will directly collect your device logo information, application list, location information, and network information."}
{"task": "rw_12.jsonl", "id": 41570, "text": "(4) Payment function: When you use the online payment function to purchase various products or services, the third -party SDK that may be involved includes: Alipay SDK, WeChat SDK, and the information collected by such SDK includes:, payment acceptance terminal information, The only device recognition code (such as the MAC, Bssid, SSID, SIM card serial number, hardware serial number built.serial, device screen density, IMEI, IMSI), hardware device models, terminal system types, software installation information, use of use, useSoftware version information, software language settings information, Internet protocol address (IP address), mobile network information (such as Wi-Fi information), region, network logs and network usage habits, and your operating behavior records of Tenpay services, and your use of Tenpage services,Application list (including the current installation of the application software list, the current or recently run software list, and the running process). When you use the corresponding SDK, you will get the SDK after initialization of the SDK, and the SDK calls the system API through your own logic.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "When you use the online payment function to purchase various products or services, Alipay SDK and WeChat SDK will collect payment to accept terminal information, unique device recognition code, hardware equipment models, terminal system types."}
{"task": "rw_12.jsonl", "id": 41571, "text": "Such information is the required information when using the above functions.", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41572, "text": "2. [Mini Games, Mini Program].", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41573, "text": "When you use the apps provided by a third party and the application provided by a third party in the WiFi universal key platform, the external cooperation SDK involved includes: DreamWorks SDK and YOOGAMES Game Center SDK, this type of SDK needs to use your personal informationIncluding device identification information (IMEI/OAID), WiFi universal key account information (user ID/nickname/avatar), personal identity information (name/ID signal: for real -name authentication/mobile phone number), personal financial information (Alipay account number number: Make calls only when you use the game payment function), network information (WIFI information/status), application list (including the current software list, the current or recently running software list and operation process), the sensor in the operation), the sensor), sensor), sensor)Information (gravity, acceleration, compass, gyroscope), camera access, such information will be provided by you after applying for your authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "When you use the apps provided by a third party and the application in the mini -game, the DreamWorks SDK and Yoogames Game Center SDK need to use your personal information."}
{"task": "rw_12.jsonl", "id": 41574, "text": "Without your consent, we will not provide your personal information to these developers (or operators).", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41575, "text": "3. [Borrowing money strictly].", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41576, "text": "GPS positioning information and equipment information.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "When you use the borrowing service, a third party may require you to provide real names, ID information, bank card information, bank card reserved mobile phone number, GPS positioning information and equipment information."}
{"task": "rw_12.jsonl", "id": 41577, "text": "In order to facilitate the successful completion of the loan audit procedure, third parties may require you to perform face recognition and upload identity documents as auxiliary operations. At that time, the third -party interface that jumps may obtain your camera and album permissions.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "Third parties that provide money services can obtain access to your camera and album permissions, asking you to perform face recognition and upload identity documents as auxiliary operations."}
{"task": "rw_12.jsonl", "id": 41578, "text": "For your personal sensitive information, if you have explicitly agreed that the third party will get your information, the third party will obtain your above personal information through the WiFi universal key interface.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you have explicitly agreed that the third party will get your information, the third party will obtain your personal information through the WiFi universal key interface."}
{"task": "rw_12.jsonl", "id": 41579, "text": "This information is a sensitive information. The refusal to provide this information will only make you unable to use the above third -party services, but it does not affect your function of using WiFi universal key normally.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41580, "text": "4. [Reading Lian Shang].", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41581, "text": "When you use Lian Shang reading services through WiFi universal key, including \"watching novels\" and \"free novels\" business, you may need to provide device logo information (MAC address, Androidid, IMEI, OAID), WiFi universal key account information (user userID, nickname, avatar, mobile phone number with mask), network information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use Lian Shang reading services, you may need to provide equipment logo information, WiFi universal key account information, and network information."}
{"task": "rw_12.jsonl", "id": 41582, "text": "When you use the corresponding business functions, we will pop up another pop -up window to get your consent again;", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the corresponding business functions, we will open another pop -up window to get your consent again."}
{"task": "rw_12.jsonl", "id": 41583, "text": "After the authority is turned on, you can also set off the permissions at any time through the device;", "label": ["Important", "Edit/Control"], "rewrite": "After the authority is turned on, you can also set off the permissions at any time."}
{"task": "rw_12.jsonl", "id": 41584, "text": "If you do not agree to open the permissions, you will not be able to use related business functions.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you do not agree to open the permissions, you will not be able to use related business functions."}
{"task": "rw_12.jsonl", "id": 41585, "text": "(8) No need to obtain your authorization consent and collect and use personal information scenarios:", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "No need to obtain your authorization consent and collect and use personal information scenarios:"}
{"task": "rw_12.jsonl", "id": 41586, "text": "1. Related to the obligations stipulated in the performance of our laws and regulations;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The collection and use information related to the obligations stipulated in our laws and regulations does not need to solicit authorization consent."}
{"task": "rw_12.jsonl", "id": 41587, "text": "2. It is directly related to national security and national defense security;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The collection and use information directly related to national security and national defense security does not need to solicit authorization consent."}
{"task": "rw_12.jsonl", "id": 41588, "text": "3. It is directly related to public safety, public health, and major public interests;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The collection and use information directly related to public safety, public health, and major public interests does not need to solicit authorization consent."}
{"task": "rw_12.jsonl", "id": 41589, "text": "4. Directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Directly related to the collection and usage information such as criminal investigation, prosecution, trial, and judgment execution does not need to solicit authorization consent."}
{"task": "rw_12.jsonl", "id": 41590, "text": "5. For major legitimate rights and interests such as maintaining your or other individuals, but it is difficult to get my consent;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collecting and using information out of major legitimate rights and interests such as maintaining your life and property of your or other individuals, but it is difficult to obtain your consent, and no authorization consent is required."}
{"task": "rw_12.jsonl", "id": 41591, "text": "6. The personal information and other information involved are publicly disclosed to the public by yourself;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The personal information and other information involved are disclosed to the public by yourself without asking for the consent of authorization."}
{"task": "rw_12.jsonl", "id": 41592, "text": "7. Signing the contract for the contract according to your requirements;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The collection and usage information necessary for signing the contract according to your request does not need to solicit authorization consent."}
{"task": "rw_12.jsonl", "id": 41593, "text": "8. Your personal information and other information collected from the legal publicly disclosed information, such as legal news reports, government information disclosure and other channels;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If your personal information and other information collected from the legal disclosure information, you do not need to solicit authorization consent."}
{"task": "rw_12.jsonl", "id": 41594, "text": "9. It is necessary to maintain the safe and stable operation of the products and services provided by maintenance, such as the failure of discovering and disposing of products and services;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The collection and use information necessary for the safe and stable operation of the products and services provided by the products provided is not required to solicit authorization consent."}
{"task": "rw_12.jsonl", "id": 41595, "text": "10. Other circumstances stipulated in laws and regulations.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Other collection and use information stipulated in laws and regulations does not need to solicit authorization."}
{"task": "rw_12.jsonl", "id": 41596, "text": "(9) The rules of your personal information and other information use", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41597, "text": "1. We will legal use the personal information and other information collected for our products and service functions in accordance with the law and the agreement of this privacy policy.", "label": ["Usage"], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41598, "text": "2. After collecting your personal information and other information, we may identify or anonymous processing of the information through technical means in accordance with the provisions of the law.Combine with other information to identify the user's subject;", "label": ["Important", "Data Security"], "rewrite": "After collecting your personal information and other information, we may identify or anonymous processing of the information depending on the situation."}
{"task": "rw_12.jsonl", "id": 41599, "text": "The information after anonymized processing will not be able to identify the user's subject, and the processing information cannot be restored.", "label": ["Important", "Data Security"], "rewrite": "The information after anonymized processing will not be able to identify the user's subject, and the processing information cannot be restored."}
{"task": "rw_12.jsonl", "id": 41600, "text": "3. [Use authorization] Please note that all the personal information and other information you provided when using our products and services, unless you delete or reject us to collect through the system settings, you will use our products and our products andWe continue to authorize us to use during the service period.", "label": ["Edit/Control", "Usage", "Important"], "rewrite": "You continue to authorize us during our products and services, unless you delete or reject us collecting through system settings."}
{"task": "rw_12.jsonl", "id": 41601, "text": "4. We will statistics on our products and service usage, and may be with the public or third parties (including but not limited to the communication service provider that represents the email or push notification, and the map service provided us with location data.Suppliers, as well as financial service providers, etc.) Share these statistical information to show the overall use trend of our products and services, or maintain and improve our services, but these statistical information does not include any identity information of your identity.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will count our products and service usage and may share these statistics with the public or third -party, but these statistical information does not include any identity information information."}
{"task": "rw_12.jsonl", "id": 41602, "text": "5. We will only share your personal information and other information based on legitimate purposes. At the same time, we will use content replacement and anonymous processing methods to desewn your information to protect your personal information and other information security.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will only share your personal information and other information based on legitimate purposes, and at the same time, it will desensitize your information to protect your personal information and other information security."}
{"task": "rw_12.jsonl", "id": 41603, "text": "3. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41604, "text": "(1) Use of cookies", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41605, "text": "1. Cookie is a common use of the Internet field.", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41606, "text": "When you access the webpage through this software or use the search function, in order to realize the personalized needs of your online experience and make you a easier access experience, the website usually sends one or more cookies to your device to store access to the webpage pageInformation about time.", "label": ["Important", "First Party Collection Information"], "rewrite": "Send one or more cookies to store information when visiting the webpage."}
{"task": "rw_12.jsonl", "id": 41607, "text": "When visiting the webpage of the webpage or the same domain name, these cookies will send back to the web server as the network request.", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41608, "text": "2. We will not use Cookies for any purpose outside the purpose of this privacy policy. You can remove all cookies stored in the software by deleting the software data.", "label": ["Important", "Edit/Control"], "rewrite": "You can remove all cookies stored in the software by deleting the software data."}
{"task": "rw_12.jsonl", "id": 41609, "text": "(2) The use of network beacon and similar technologies", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41610, "text": "In addition to Cookies, we will also use network Beacon and other similar technologies on the website.", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41611, "text": "Our webpage often contains some electronic images (called \"single pixel\" GIF file or \"network beacon\").", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41612, "text": "We use the network beacon on our website, calculate the number of user access, and identify registered WiFi universal key users by visiting Cookies.", "label": ["Important", "First Party Collection Information"], "rewrite": "Calculate the number of user access by using the network Beacon and access the registered WiFi universal key user through access to cookies."}
{"task": "rw_12.jsonl", "id": 41613, "text": "Fourth, share, commission processing, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41614, "text": "(1) Sharing", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41615, "text": "1. We will not share your personal information with any companies, organizations and individuals other than the company and its related companies, except the following situations: except:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not share your personal information with any companies, organizations and individuals other than the WiFi universal key and its associated companies, except for the following situations: except:"}
{"task": "rw_12.jsonl", "id": 41616, "text": "(1) Through this privacy policy or other reasonable methods, such as mail, telephone, pop -up window push notification, etc., obtain your clear consent or authorization in advance, and only for legal, correct, necessary, specific, and clear purposes;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Get your clear consent or authorization in advance through this privacy policy or other reasonable methods, and only for the purpose of legality, right, necessary, specific, and clear."}
{"task": "rw_12.jsonl", "id": 41617, "text": "(2) Provide in accordance with the requirements of applicable laws and regulations, legal procedures, administrative or judicial organs.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "It is provided according to the requirements of applicable laws and regulations, legal procedures, administrative or judicial organs."}
{"task": "rw_12.jsonl", "id": 41618, "text": "2., you understand and agree that we may provide you with higher -quality services, personalized services, identifying related account abnormalities such as improving user experience, optimizing products, and related accounts.The company shared.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "We may share your personal information with our related companies for the purpose of improving user experience and optimizing products."}
{"task": "rw_12.jsonl", "id": 41619, "text": "We will only share the necessary personal information and be restricted by the purpose declared in this privacy policy.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only share the necessary personal information and be restricted by the purpose declared in this privacy policy."}
{"task": "rw_12.jsonl", "id": 41620, "text": "If we share your personal sensitive information or our affiliate company to change personal information, we will solicit your authorization consent again.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If we share your personal sensitive information or the purpose of the processing of personal information to change personal information, we will solicit your authorization consent again."}
{"task": "rw_12.jsonl", "id": 41621, "text": "3. In order to better handle your complaints and improve consumer protection mechanisms, or merge with other companies, acquire or conduct other capital market activities (including but not limited to IPO, bond issuance, etc.) in our plan andWhen receiving due diligence from other subjects, we may hire external professional intermediaries (such as law firms, accounting firms) to provide complaints, account information, and transaction information related to your complaints, prosecution, and prosecution to the institution.However, we will need to sign a confidentiality agreement with these subjects to request them to take reasonable and necessary confidentiality measures for your personal information, and require it to delete your information within a reasonable period after completing the necessary work.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We may hire external professional intermediaries to provide your personal identity information, account information, and transaction information to the institution during the due diligence survey.Delete your information."}
{"task": "rw_12.jsonl", "id": 41622, "text": "4. You understand and agree that our products and services may include third -party software tool development packs (SDK) and application interface (API), collect your personal information in the form of embedding code, plug -in, etc.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You understand and agree that the product and service may include third -party software tool development packages and application interface collection and use your personal information."}
{"task": "rw_12.jsonl", "id": 41623, "text": "In order to achieve related functions, third -party service providers may collect your relevant personal information. For details, please refer to the \"WiFi Universal Key Third -Party Service Provider Instructions\".", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For details of the third -party service provider collecting your relevant personal information, please refer to the \"WiFi Universal Key Third -Party Service Provider Instructions\"."}
{"task": "rw_12.jsonl", "id": 41624, "text": "Please rest assured, we will conduct a security test for the software tool development package (SDK), the application interface (API) of third -party software to obtain relevant information, and require it to be required toConfidential and security measures to handle personal information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will conduct security testing on the interface of third -party software to obtain relevant information, and require them to process personal information in accordance with relevant confidentiality and security measures."}
{"task": "rw_12.jsonl", "id": 41625, "text": "To protect your legitimate rights and interests, if you find such SDK, APIs, or other similar applications, there are risks, please immediately terminate the relevant operations and contact us in time.", "label": ["Important", "Data Security"], "rewrite": "If you find risks, immediately terminate related operations and get in touch with us in time."}
{"task": "rw_12.jsonl", "id": 41626, "text": "(2) Entrusted processing", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41627, "text": "We may entrust a partner to handle your personal information in order to authorize partners to represent you to provide you with certain services or fulfilling functions.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may entrust a partner to handle your personal information."}
{"task": "rw_12.jsonl", "id": 41628, "text": "We will only entrust their information for the legal, correct, necessary, specific, and clear goals of this policy statement. We can authorize partners to only contact the information required by their duties, and we will ask for the agreement to request that it must not be requiredThis information is used for any other purpose beyond the scope of commission.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will only entrust partners to process your information for the legal, correct, necessary, specific, and clear purpose of this policy statement."}
{"task": "rw_12.jsonl", "id": 41629, "text": "If the authorized partner will use your information for our unreasonable purpose, it will obtain your consent alone.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If the authorized partner will use your information for our unreasonable purpose, it will obtain your consent alone."}
{"task": "rw_12.jsonl", "id": 41630, "text": "At present, our authorized partners include the following types:", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41631, "text": "1. Authorized partners of advertising and analysis of service.", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41632, "text": "Under the premise of using industry -universal security technology, we will entrust these partners to handle information about advertising, coverage, and effectiveness related to advertising.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will entrust partners to process information related to advertising, coverage, and effectiveness related to advertising."}
{"task": "rw_12.jsonl", "id": 41633, "text": "We will not commission your personal identity information to commission partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not commission your personal identity information to commission partners."}
{"task": "rw_12.jsonl", "id": 41634, "text": "2. Supplier, service provider and other partners.", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41635, "text": "We entrust the information to the suppliers, service providers and other partners who support our business to handle it. These supports the technical infrastructure services that are entrusted by us, analyzing the usage methods of our services, providing customer services or conducting academic research and investigationEssence", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We entrust the information to partners who support our business."}
{"task": "rw_12.jsonl", "id": 41636, "text": "In order to ensure the stable operation and functional implementation of our client, so that you can use and enjoy more services and functions. Our application will embed the SDK or other similar applications of authorized partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Our applications are embedded in SDK or other similar applications of authorized partners."}
{"task": "rw_12.jsonl", "id": 41637, "text": "We will conduct strict security inspections on the application program interface (API) and software tool development kit (SDK) for authorized partners to obtain relevant information, and agree with authorized partners on strict data protection measures to make them comply with this policy and any other relevant confidentiality and security measures to process personal information.", "label": ["Important", "Data Security"], "rewrite": "We will conduct a security test on the interface of authorized partners and ask them to take confidentiality and security measures to process personal information."}
{"task": "rw_12.jsonl", "id": 41638, "text": "(3) Transfer", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41639, "text": "We will not transfer your personal information to any company, organization and individual, except the following situations: except:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not transfer your personal information to any company, organization and individual, except the following situations: except:"}
{"task": "rw_12.jsonl", "id": 41640, "text": "1., get your consent or authorization in advance;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Get your consent or authorization in advance may transfer your personal information."}
{"task": "rw_12.jsonl", "id": 41641, "text": "2., Provided in accordance with applicable laws and regulations, requirements of legal procedures, mandatory administrative or judicial requirements;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Provide your personal information according to the requirements of applicable laws and regulations, legal procedures, mandatory administrative or judicial requirements."}
{"task": "rw_12.jsonl", "id": 41642, "text": "3. In line with the relevant agreements signed with you (including the electronic agreement signed online and the corresponding platform rules) or other legal documents provided;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Provide your personal information in accordance with the relevant agreements signed with you or other legal documents."}
{"task": "rw_12.jsonl", "id": 41643, "text": "4. When involving mergers, acquisitions, asset transfers, or similar transactions, if personal information transfer, we will require new companies that hold your personal information and organizations to continue to be subject to this privacy policy.The company and organization are required to re -solicit authorization.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When involving mergers, acquisitions, or bankruptcy liquidation, if personal information transfer is involved, it will be required to continue to be bound by the policy, otherwise it will request that it will re -solicit authorization consent."}
{"task": "rw_12.jsonl", "id": 41644, "text": "(4) Public disclosure", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41645, "text": "We will only disclose your personal information only under the following circumstances and adopt the premise of the industry standards:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only disclose your personal information only under the following circumstances and adopt the premise of the industry standards:"}
{"task": "rw_12.jsonl", "id": 41646, "text": "1. According to your needs, disclose the personal information you specified under your clear consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "According to your needs, disclose your personal information you specified under the disclosure of your clear consent."}
{"task": "rw_12.jsonl", "id": 41647, "text": "2. When the requirements of laws and regulations, mandatory administrative law enforcement or judicial requirements must provide your personal information, we may disclose your personal information according to the types of personal information and disclosure required.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In accordance with the requirements of laws and regulations, mandatory administrative law enforcement or judicial requirements that must provide your personal information, we may disclose your personal information according to the types and disclosure methods required."}
{"task": "rw_12.jsonl", "id": 41648, "text": "Under the premise of compliance with laws and regulations, when we receive a request for the above disclosure information, we ask we must issue corresponding legal documents such as tickets or investigation letters.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When we receive a request to disclose information, we ask we must issue corresponding legal documents."}
{"task": "rw_12.jsonl", "id": 41649, "text": "We firmly believe that for the information requested by us, it should be as transparent as much as possible within the scope of law.", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41650, "text": "We have carefully reviewed all the requests to ensure that it has a legal basis and is limited to data obtained by law enforcement agencies because of specific investigations and legitimate rights.", "label": ["Important", "Data Security"], "rewrite": "We conducted a cautious review of all disclosure requests, and were limited to data obtained by law enforcement agencies for specific investigation purposes and have legal rights."}
{"task": "rw_12.jsonl", "id": 41651, "text": "Under the premise of laws and regulations, the documents we have disclosed are under the protection of the encryption key.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "The documents we disclosed are under the protection of the encryption key."}
{"task": "rw_12.jsonl", "id": 41652, "text": "Fifth, how can we protect and preserve your personal information safely", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41653, "text": "(1) Storage of information", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41654, "text": "1. Storage location", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41655, "text": "The personal information we collected and generated in the People's Republic of China is stored in the People's Republic of China.", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in domestic operations will be stored in China."}
{"task": "rw_12.jsonl", "id": 41656, "text": "WiFi universal keys will not provide or store personal information overseas of the People's Republic of China.", "label": ["Data Retention", "Important"], "rewrite": "WiFi universal keys will not provide or store personal information overseas of the People's Republic of China."}
{"task": "rw_12.jsonl", "id": 41657, "text": "2. Storage period", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41658, "text": "We only retain your personal information within the necessary time for service purposes. Except for other regulations, we will store your information according to the following period:", "label": ["Data Retention", "Important"], "rewrite": "Generally, your personal information is retained within the time limit required to achieve service purposes, unless the law has other requirements."}
{"task": "rw_12.jsonl", "id": 41659, "text": "(1) We will collect your personal information to meet our legitimate business needs, such as providing you with services or to meet the corresponding legal, tax and financial requirements.", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41660, "text": "(2) When we do not need these legitimate business needs that need to use your personal information, in your request, we will delete your personal data or processes it anonymous, or if it is anonymous or deleted, it is impossibleRealization (for example, your personal information is stored in the backup), we will securely store your personal information and separate these personal information from other data processing.", "label": ["Data Retention", "Important"], "rewrite": "When there is no need to use personal information with legitimate business needs, your personal information will be deleted or anonymous."}
{"task": "rw_12.jsonl", "id": 41661, "text": "(3) During your use of our products and services, your personal information will be stored within the time limit of the purpose of this policy, and at the same time, it will be determined in conjunction with the law of compulsory retention in the law.The E -Commerce Law requires that the preservation time of goods and service information and transaction information is not less than three years from the date of the transaction.", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41662, "text": "After exceeding the preservation period, we will delete your personal information according to the requirements of the applicable laws, or perform anonymous processing.", "label": ["Important", "Data Security"], "rewrite": "After exceeding the storage period, your personal information will be deleted or anonymous, except for other provisions of laws and regulations."}
{"task": "rw_12.jsonl", "id": 41663, "text": "(4) If we terminate our services or operations, we will notify you at least 30 days in advance, and delete or processes your personal information after terminating services or operations.", "label": ["Important", "Cessation of Operations"], "rewrite": "When stopping operations, we will notify and delete or processes your personal information."}
{"task": "rw_12.jsonl", "id": 41664, "text": "(2) We protect your personal information technology and measures", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41665, "text": "We attach great importance to personal information security and take all reasonable and feasible measures to protect your personal information:", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41666, "text": "1. [Data Security Technical Measures] We promise that we will make information security protection reach a reasonable level of security.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41667, "text": "In order to ensure your information security, we are committed to using various security technologies and supporting management systems to prevent your information from being leaked, damaged or lost, including establishing reasonable system specifications and security technologyAuthorized access and use, modification, avoid data damage or loss.", "label": ["Important", "Data Security"], "rewrite": "Establish a reasonable institutional norms and security technologies to protect your information security."}
{"task": "rw_12.jsonl", "id": 41668, "text": "The network service of WiFi universal key adopts encrypted technologies such as transport layer security protocols. It provides security services through HTTPS and other methods to ensure the security of data during transmission.", "label": ["Important", "Data Security"], "rewrite": "The network service of WiFi universal key adopts encrypted technologies such as transport layer security protocols to ensure data transmission security."}
{"task": "rw_12.jsonl", "id": 41669, "text": "The WiFi universal key adopts a variety of encrypted technologies to encrypt the user's personal information, and isolates the security domain isolate the storage medium or information system containing user personal information or information systems through logic or physical isolation.", "label": ["Important", "Data Security"], "rewrite": "The WiFi universal key adopts a variety of encrypted technologies to save user personal information."}
{"task": "rw_12.jsonl", "id": 41670, "text": "The WiFi universal key will carry out dual backups of local and different places for users and operating data, and regularly perform data recovery drills to ensure availability and continuity.", "label": ["Important", "Data Security"], "rewrite": "The WiFi Universal Key will carry out dual backups of local and different places for users and operating data, and regularly perform data recovery drills."}
{"task": "rw_12.jsonl", "id": 41671, "text": "In the use of personal information, such as personal information display and personal information association calculations, we will use multiple data desensitization technology to desensitify sensitive fields to enhance personal information in use.", "label": ["Important", "Data Security"], "rewrite": "We will use a variety of data desensitization technology to desensitify sensitive fields to enhance the security of personal information in use."}
{"task": "rw_12.jsonl", "id": 41672, "text": "The WiFi universal key attaches great importance to the security protection of WIFI hotspots and passwords. The WiFi hotspot password shared by all users uses 128 -bit keys. After 32 rounds of changes for encrypted storage and transmission, the encryption algorithm uses multiple confusion and reinforcement protection to ensure that anyone can not be able to.Check the password during the server and transmission.", "label": ["Important", "Data Security"], "rewrite": "WiFi universal key focuses on the security protection of WiFi hotspots and passwords."}
{"task": "rw_12.jsonl", "id": 41673, "text": "The WiFi universal key client is encrypted after the encryption is obtained, the encrypted storage is stored to the server database. When there are other users, when you share the hotspot connection network, the system query the encrypted password from the database. After the second encryptionConnecting hot spots, all the passwords are hidden to ensure safety.", "label": ["Important", "Data Security"], "rewrite": "The WiFi Universal Key Client is encrypted to be encrypted and stored to the server database."}
{"task": "rw_12.jsonl", "id": 41674, "text": "The password leakage and passwords that are not caused by WiFi universal keys are obtained and used by third parties, and the WiFi universal key shall not bear legal responsibility.", "label": ["Important", "Data Security"], "rewrite": "The password leakage and passwords that are not caused by WiFi universal keys are obtained and used by third parties, and the WiFi universal key shall not bear legal responsibility."}
{"task": "rw_12.jsonl", "id": 41675, "text": "2. [WiFi universal key to protect other security measures to protect personal information] WiFi universal key regulates personal information internally storage, use, sharing, etc.Safety behavior.", "label": ["Important", "Data Security"], "rewrite": "WiFi universal key regulates the processing behavior of personal information by establishing an information classification hierarchical system, user information security management system, and security development specifications."}
{"task": "rw_12.jsonl", "id": 41676, "text": "WiFi Universal Key has controlled the data comprehensively security control through the confidentiality agreement, monitoring and auditing mechanism of information contacts.", "label": ["Important", "Data Security"], "rewrite": "WiFi Universal Key has controlled the data comprehensively security control through the confidentiality agreement, monitoring and auditing mechanism of information contacts."}
{"task": "rw_12.jsonl", "id": 41677, "text": "WiFi Universal Key monitor the behavior of the staff to handle your information, and continuously promote the training of relevant laws and regulations, privacy safety standards and security awareness of staff training.Course, strengthen employees' awareness of protecting the importance of personal information.", "label": ["Important", "Data Security"], "rewrite": "WiFi Universal Key monitor the behavior of processing information, train staff, and continuously strengthen employees' understanding of the importance of protecting personal information."}
{"task": "rw_12.jsonl", "id": 41678, "text": "3. Please understand that due to technical level restrictions and possible various malicious means, problems may be due to factors outside the controlled range.", "label": ["Important", "Data Security"], "rewrite": "There may be problems due to factors outside the control scope."}
{"task": "rw_12.jsonl", "id": 41679, "text": "After unfortunately a personal information security incident, we will inform you in a timely manner in accordance with the requirements of the laws and regulations: the basic situation and possible impact of the security incident, the disposal measures we have taken or will take, you can independently prevent and reduce the risk of riskSuggestions, remedy measures, etc.", "label": ["Important", "Data Security"], "rewrite": "If a personal information security incident occurs, we will inform your basic situation, possible impact, disposal measures, independent prevention suggestions, etc."}
{"task": "rw_12.jsonl", "id": 41680, "text": "We will timely inform you that the incident -related situation is informing the email, letter, telephone, or push notification. When it is difficult to inform the subject of personal information one by one, we will publish a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "The relevant situation of security incidents will be informed by mail, letter, telephone, push notification, etc. When it is difficult to inform one by one, it will issue an announcement."}
{"task": "rw_12.jsonl", "id": 41681, "text": "At the same time, we will also actively report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "Report the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities."}
{"task": "rw_12.jsonl", "id": 41682, "text": "4. If we stop operations, we will stop the activities of continuing to collect your personal information in time, and notify you in the form of notifications to deliver or announce one by one, and destroy or anonymous processing of personal information held.", "label": ["Important", "Cessation of Operations"], "rewrite": "When stopping operation, we will make an announcement notice and delete or processes your personal information."}
{"task": "rw_12.jsonl", "id": 41683, "text": "6. How do you access and control your personal information", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41684, "text": "Your right to exercise your personal information:", "label": ["Important", "Edit/Control"], "rewrite": "Your right to exercise your personal information:"}
{"task": "rw_12.jsonl", "id": 41685, "text": "(1) Visit your personal information", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41686, "text": "1., you can log in to the account number through the WiFi universal key, check in the \"My-Personal Center\", and use \"my-settings-help and feedback-feedback\" online feedback, check all your personal information, or do it for conducting itRelated privacy and security settings.", "label": ["Edit/Control", "Important"], "rewrite": "You can log in to your account, check all your personal information, and use \"my-settings-help and feedback-feedback-feedback\" to check all your personal information, or perform related privacy and security settings."}
{"task": "rw_12.jsonl", "id": 41687, "text": "2. You can also make a request to access personal information to the contact information shown in the customer service at 400-035-8000 or \"How to contact us\".", "label": ["Edit/Control", "Contact Information", "Important"], "rewrite": "You can make a request to access personal information through customer service, the contact information shown in the part of the customer service at 400-035-8000 or \"How to contact us\"."}
{"task": "rw_12.jsonl", "id": 41688, "text": "Before responding to your above requirements, in order to ensure safety, you may need to provide written requests or prove your identity in other ways.", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "You may need to prove your identity before responding to your personal information request."}
{"task": "rw_12.jsonl", "id": 41689, "text": "We may first request your identity before processing your request.", "label": ["Important", "Data Security"], "rewrite": "We may first request your identity before processing your request."}
{"task": "rw_12.jsonl", "id": 41690, "text": "We promise to verify and deal with your requests within [15] from the date of receiving your above request.", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41691, "text": "(2) Correct your personal information", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41692, "text": "1., you can modify your mobile phone number through \"Settings-Account and Security-Replace your mobile phone number\", and modify your nickname, avatar, gender and other information through \"My-Personal Center\".", "label": ["Important", "Edit/Control"], "rewrite": "You can modify your mobile phone number through \"Settings-Account and Security-Replace your mobile phone number\", and modify your nickname, avatar, gender and other information through \"My-Personal Center\"."}
{"task": "rw_12.jsonl", "id": 41693, "text": "2. When you find that our personal information is wrong, you have the right to ask us to make corrections.", "label": ["Important", "Edit/Control"], "rewrite": "You have the right to correct it when you find that our personal information is wrong."}
{"task": "rw_12.jsonl", "id": 41694, "text": "You can make a correction application in the way you can listed in the \"(1) access to your personal information\".", "label": ["Important", "Edit/Control"], "rewrite": "You can make a correction application in the way you can listed in the \"(1) access to your personal information\"."}
{"task": "rw_12.jsonl", "id": 41695, "text": "Before responding to your above requirements, in order to ensure safety, you may need to provide written requests or prove your identity in other ways.", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "You may need to prove your identity before responding to your deletion requirements."}
{"task": "rw_12.jsonl", "id": 41696, "text": "We may first request your identity before processing your request.", "label": ["Important", "Data Security"], "rewrite": "We may first request your identity before processing your request."}
{"task": "rw_12.jsonl", "id": 41697, "text": "We promise to verify and deal with your requests within [15] from the date of receiving your above request.", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41698, "text": "(3) Delete your personal information", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41699, "text": "In the following circumstances, you can make a request to delete personal information to us through \"(1) access your personal information\":", "label": ["Edit/Control", "Important"], "rewrite": "You can make a request to delete personal information by \"(1) access your personal information\"."}
{"task": "rw_12.jsonl", "id": 41700, "text": "1. If you find that we collect and use your personal information, it violates the provisions of laws and administrative regulations or violates your agreement with you or has not obtained your consent;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41701, "text": "2. If you no longer use our products and services, or you cancel your account;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41702, "text": "3. If we no longer provide you with products and services.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41703, "text": "Please note: When you delete the information from our services, we may not immediately delete the corresponding information from the backup system, but will delete these information when the backup is updated (but the hotspot owner cancels the hotspot sharing in time to cancel the timely cancellationTo.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Delete the information you require delete in the backup update."}
{"task": "rw_12.jsonl", "id": 41704, "text": "Before responding to your above requirements, in order to ensure safety, you may need to provide written requests or prove your identity in other ways.", "label": ["Data Security", "Edit/Control"], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41705, "text": "We may first request your identity before processing your request.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41706, "text": "We promise to verify and deal with your requests within [15] from the date of receiving your above request.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41707, "text": "(4) Change the scope of your authorization consent or withdraw your authorization", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41708, "text": "You can change your authorization of the scope of your personal information or withdraw your authorization through \"Mine- [Settings]-[Perseverance Center]\".", "label": ["Important", "Edit/Control"], "rewrite": "You can change your authorization of the scope of your personal information or withdraw your authorization through \"Mine- [Settings]-[Perseverance Center]\"."}
{"task": "rw_12.jsonl", "id": 41709, "text": "You can also withdraw all the authorization of our personal information by canceling the account of the account.", "label": ["Important", "Edit/Control"], "rewrite": "You can withdraw all authorization by canceling the account."}
{"task": "rw_12.jsonl", "id": 41710, "text": "Please understand that each business function requires some basic personal information to be completed. When you withdraw consent or authorization, we cannot continue to provide you with the service corresponding to the withdrawal consent or authorization, and no longer handle your corresponding personal informationEssence", "label": ["Edit/Control", "Important"], "rewrite": "When you withdraw consent or authorization, we cannot continue to provide you with corresponding services and no longer process the corresponding personal information."}
{"task": "rw_12.jsonl", "id": 41711, "text": "But your decision to withdraw consent or authorization will not affect personal information processing based on your authorization.", "label": ["Important", "Edit/Control"], "rewrite": "The decision you withdraws or authorized will not affect personal information processing that was previously authorized."}
{"task": "rw_12.jsonl", "id": 41712, "text": "(5) Logging out your account", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41713, "text": "You have the right to cancel your registered account, and you can apply for a cancellation of your account through \"Settings-Account and Security-Logging out\".", "label": ["Edit/Control", "Important"], "rewrite": "You can apply for a cancellation of your account through \"Settings-Account and Security-Logging out\"."}
{"task": "rw_12.jsonl", "id": 41714, "text": "After the cancellation of your account, we will stop providing you with products and services, and timely delete your personal information in accordance with the provisions of laws and regulations or identify or anonymous processing of your personal information (but the laws and regulations have other provisionsOr except for the regulatory authorities, such as the \"Cyber Security Law of the People's Republic of China\", your network operation log will be reserved for at least six months), and the WiFi universal key account will not be restored after the cancellation of the WiFi universal key account.", "label": ["Data Retention", "Important", "Edit/Control"], "rewrite": "After cancellation, personal information will be deleted or anonymous and cannot be restored."}
{"task": "rw_12.jsonl", "id": 41715, "text": "Before responding to your above requirements, in order to ensure safety, you may need to provide written requests or prove your identity in other ways.", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "The identity will be verified when the account is canceled."}
{"task": "rw_12.jsonl", "id": 41716, "text": "We may first request your identity before processing your request.", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41717, "text": "We promise to verify and deal with your requests within [15] from the date of receiving your above request.", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41718, "text": "(6) Change the scope of your authorization consent", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41719, "text": "1. Each business function requires some basic personal information to complete (see this privacy policy \"1. How do we collect and use your personal information and other information\").", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41720, "text": "For the collection and use of additional personal information, you can give or withdraw your authorization consent at any time.", "label": ["Important", "Edit/Control"], "rewrite": "For the collection and use of additional personal information, you can give or withdraw your authorization consent at any time."}
{"task": "rw_12.jsonl", "id": 41721, "text": "You can operate yourself by yourself:", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41722, "text": "You can find the WiFi universal key in the system of your device and manage, modify or delete the relevant permissions in the \"Settings-Permanent Center\".", "label": ["Important", "Edit/Control"], "rewrite": "You can find the WiFi universal key through \"Settings-Permanent Center\" and manage, modify or delete relevant permissions."}
{"task": "rw_12.jsonl", "id": 41723, "text": "When you recover your consent, we will no longer process the corresponding personal information.", "label": ["Important", "Edit/Control"], "rewrite": "When you recover your consent, we will no longer process the corresponding personal information."}
{"task": "rw_12.jsonl", "id": 41724, "text": "But your decision to recover the consent will not affect personal information processing based on your authorization.", "label": ["Important", "Edit/Control"], "rewrite": "The decision you take back will not affect the personal information processing based on your previous authorization."}
{"task": "rw_12.jsonl", "id": 41725, "text": "2. If you find your personal information leakage, especially your account leak, please immediately contact us through the bottom of this policy, [How to contact us], so that we can take corresponding measures.", "label": ["Important", "Contact Information", "Data Security"], "rewrite": "If your personal information is leaked, please contact our customer service immediately."}
{"task": "rw_12.jsonl", "id": 41726, "text": "3. In the following circumstances, in accordance with the requirements of laws and regulations, we will not be able to respond to your request:", "label": ["Important", "Edit/Control"], "rewrite": "In the following circumstances, in accordance with the requirements of laws and regulations, we will not be able to respond to your request:"}
{"task": "rw_12.jsonl", "id": 41727, "text": "(1) What is related to the obligations stipulated in the performance of our laws and regulations;", "label": ["Important", "Edit/Control"], "rewrite": "If your request is related to the obligations stipulated in our laws and regulations, it may not be responding."}
{"task": "rw_12.jsonl", "id": 41728, "text": "(2) Directly related to national security and national defense security;", "label": ["Edit/Control", "Important"], "rewrite": "If your request is directly related to national security and national defense security, you may not be responded."}
{"task": "rw_12.jsonl", "id": 41729, "text": "(3) Directly related to public safety, public health, and major public interests;", "label": ["Important", "Edit/Control"], "rewrite": "Your request is directly related to public safety, public health, and major public interests and may not be responded."}
{"task": "rw_12.jsonl", "id": 41730, "text": "(4) Directly related to criminal investigation, prosecution, trial and judgment execution;", "label": ["Important", "Edit/Control"], "rewrite": "Your request is related to criminal investigation, prosecution, and trial, and may not be responded."}
{"task": "rw_12.jsonl", "id": 41731, "text": "(5) We have sufficient evidence that you have subjective malicious or abuse of rights;", "label": ["Edit/Control", "Important"], "rewrite": "We have sufficient evidence that if you have subjective malice or abuse of rights, you may not be able to respond to the request."}
{"task": "rw_12.jsonl", "id": 41732, "text": "(6) For major legitimate rights and interests such as maintaining your or other personal lives, property, etc., it is difficult to get my consent;", "label": ["Important", "Edit/Control"], "rewrite": "Out of the major legitimate rights and interests of the life and property of personal information subjects or other individuals, but it is difficult to get my consent, we may not be able to respond to the request."}
{"task": "rw_12.jsonl", "id": 41733, "text": "(7) responding to your request will cause the legitimate rights and interests of you or other individuals and organizations to be seriously damaged;", "label": ["Important", "Edit/Control"], "rewrite": "We may not be able to respond to the request that the legitimate rights and interests of personal information subjects or other individuals and organizations are seriously damaged."}
{"task": "rw_12.jsonl", "id": 41734, "text": "(8) Invading business secrets.", "label": ["Important", "Edit/Control"], "rewrite": "We may not be able to respond."}
{"task": "rw_12.jsonl", "id": 41735, "text": "(7) Personal information subject obtain a copy of personal information", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41736, "text": "You have the right to obtain your personal information copy. You can ask us to obtain a copy of your personal information through the contact information shown in the customer service or \"how to contact us\".supply.", "label": ["Edit/Control", "Important"], "rewrite": "You can ask us to obtain a copy of personal information."}
{"task": "rw_12.jsonl", "id": 41737, "text": "Under the premise of technical feasibility, if the data interface has been matched, we can also transmit your personal information copy directly to your specified third party according to your requirements.", "label": ["Important", "Edit/Control"], "rewrite": "Under the premise of technical feasibility, we can also transmit your personal information copy directly to your designated third party according to your requirements."}
{"task": "rw_12.jsonl", "id": 41738, "text": "(8) Automatic decision -making of constraint information systems", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41739, "text": "In certain business functions, we may make decisions only based on the non -artificial automatic decision -making mechanism, including information systems, algorithms, etc.", "label": ["Important", "Usage"], "rewrite": "In certain business functions, we may make decisions only based on the non -artificial automatic decision -making mechanism, including information systems, algorithms, etc."}
{"task": "rw_12.jsonl", "id": 41740, "text": "If these decisions significantly affect your legitimate rights and interests, you have the right to ask us to explain, and we will also provide appropriate relief methods.", "label": ["Important", "Edit/Control"], "rewrite": "If non -artificial decisions significantly affect your legitimate rights and interests, you have the right to ask us to explain."}
{"task": "rw_12.jsonl", "id": 41741, "text": "(9) Withdrawal of privacy policy functions", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41742, "text": "You can withdraw the privacy policy you have authorized to agree through the \"Settings-Privacy Agreement-Withdrawal\" function. If you need to continue to use WiFi universal key products and services, you need to read and agree to this privacy policy again.", "label": ["Edit/Control", "Important"], "rewrite": "You can withdraw the consent through the function of \"My-Settings-Privacy Agreement-Withdrawal\" function."}
{"task": "rw_12.jsonl", "id": 41743, "text": "(10) Transfer of personal information", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41744, "text": "In principle, the personal information we collected and generated in the territory of the People's Republic of China is stored in China, except for the following situations:", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in domestic operations will be stored in China, except for the following situations: 1. Applicable laws have clear stipulation; 2. Get your clear authorization; 3. You through the Internet cross -border transactions and other personal behaviors such as personal behavior and other personal behaviorEssence"}
{"task": "rw_12.jsonl", "id": 41745, "text": "1. Applicable laws are clearly stipulated;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41746, "text": "2. Get your clear authorization;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41747, "text": "3. Personal behavior such as cross -border transactions through the Internet.", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41748, "text": "However, we provide you with products and services in China. There is no cross -border transfer of personal information. We will strictly protect all personal information you authorized in accordance with the law.", "label": ["Data Retention", "Important"], "rewrite": "We provide you with products and services in China, and there is no cross -border transfer of personal information."}
{"task": "rw_12.jsonl", "id": 41749, "text": "7. Protection of personal information of dead users", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41750, "text": "1. The WiFi universal key will upgrade the personal information protection system of the deceased in accordance with the relevant provisions of the Personal Information Protection Law from November 1, 2021.", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41751, "text": "After the death of WiFi Universal Key users (only natural person), its close relatives can exercise the relevant personal information of the dead users through the \"contact us\" in order to see the legal and legitimate interests of this privacy policy., Copy, correct, delete the rights, but except for other arrangements during their lifetime.", "label": ["Specific Audiences", "Important"], "rewrite": "For the close relatives of the dead users, for their own legal and legitimate interests, they can exercise the rights of personal information about the relevant personal information of the dead users to check, copy, correct, delete, etc., except for other arrangements during their lifetime."}
{"task": "rw_12.jsonl", "id": 41752, "text": "2., you understand and confirm that in order to fully protect the personal information rights and interests of the dead users, the close relatives who apply for the right to exercise the rights of this article need to submit the identity document, death certificate document, death certificate document, death certificate document, death certificate document, death certificate document, and customer service prompts.The applicant's identity document, the proof of relative relationship documents of the applicant and the dead user, and provide the types and purpose of the right to exercise.", "label": ["Specific Audiences", "Data Security", "Important"], "rewrite": "Dead users of the dead users need to submit their identity documents, death certification documents, applicants' identity documents, applicants and relative relationship documents, and provide the types and purposes of the right to exercise."}
{"task": "rw_12.jsonl", "id": 41753, "text": "8. Notice and revision", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41754, "text": "1. In order to provide you with better services and the development of WiFi universal key business, this privacy policy will be updated from time to time.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41755, "text": "But without your clear consent, we will not reduce the rights you should enjoy in accordance with the privacy policy.", "label": ["Policy Change", "Important"], "rewrite": "Without your clear consent, we will not reduce the rights you should enjoy in accordance with the privacy policy."}
{"task": "rw_12.jsonl", "id": 41756, "text": "We will send a updated version through the WiFi universal key movement and remind you to update the relevant content through the website or other appropriate ways before taking effect. Please also visit the WiFi universal key to understand the latest privacy policy in time.", "label": ["Policy Change", "Important"], "rewrite": "We will remind you of the update of related content in the website announcement or other appropriate ways."}
{"task": "rw_12.jsonl", "id": 41757, "text": "When we release the updated version, we will not implement the reset authority status, modify the real -name authentication scenario, modify and modify and increase the setting of mobile network information permissions, and modify the storage permissions setting path.", "label": ["Policy Change", "Important"], "rewrite": "When publishing the update version, it will not implement the reset authority status, modify the real -name authentication scenario, modify and modify and increase the mobile network information authority settings, and modify the storage authority setting path."}
{"task": "rw_12.jsonl", "id": 41758, "text": "We will prompt or send you a message to you in a prominent position or send a message to you or other ways before the updated privacy policy takes effect and ask you again for your explicit consent.", "label": ["Policy Change", "Important"], "rewrite": "We will notify you before the updated privacy policy takes effect and solicit your explicit consent again."}
{"task": "rw_12.jsonl", "id": 41759, "text": "2. The major changes referred to in this privacy policy include, but not limited to:", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41760, "text": "(1) Our service model has changed significantly, such as the purpose of handling personal information, the type of personal information, the use of personal information, etc.;", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41761, "text": "(2) We have undergone major changes in the aspects of ownership structure and organizational structure.", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41762, "text": "Such as changes caused by business adjustments, bankruptcy mergers and acquisitions, etc.", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41763, "text": "(3) The main object of personal information sharing, transfer or public disclosure changes;", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41764, "text": "(4) The right to participate in personal information processing and its exercise methods have changed significantly;", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41765, "text": "(5) When we are responsible for handling the responsibility departments, contact methods and complaint channels of personal information security;", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41766, "text": "(6) Evaluation report on personal information security impact indicates that there is a high risk.", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41767, "text": "We will also archive the old version of this policy for you to check.", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41768, "text": "3. [Amendment to Privacy Policy] We may revise the privacy policy part of the privacy policy.", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41769, "text": "If you continue to use our products and services, it means that you agree with the restrictions of the revised privacy policy.", "label": ["Policy Change", "Important", "Risk"], "rewrite": "If you continue to use our products and services, it means that you agree with the restrictions of the revised privacy policy."}
{"task": "rw_12.jsonl", "id": 41770, "text": "Nine, applicable law and dispute resolution", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41771, "text": "1. [Law applicable] The implementation, interpretation and disputes of privacy policies are applicable to the laws of the People's Republic of China, without considering any conflict law.", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41772, "text": "2. [Dispute solution] If you and the WiFi universal key have any controversy on the content of the privacy policy or its execution, the two parties should be friendly and negotiated.", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41773, "text": "If the two parties cannot negotiate to resolve the dispute, the two parties agreed to submit the dispute to courts with jurisdictions where the company is located.", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41774, "text": "Ten, how to contact us", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41775, "text": "1. If you have any questions, opinions or suggestions on your privacy policy or your personal information, please send your mail to wifikeyService@zenmen.com or online feedback by calling our customer service phone 400-035-8000Contact us by way.", "label": ["Important", "Contact Information"], "rewrite": "Customer service phone 400-035-8000; email wifikeyservice@zenmen.com."}
{"task": "rw_12.jsonl", "id": 41776, "text": "2. We have set up a personal information protection full -time department (or personal information protection specialist). You can contact them by sending emails to (wifikeypis@zenmen.com).", "label": ["Important", "Contact Information"], "rewrite": "Personal information protection full -time department: wifikeypis@zenmen.com."}
{"task": "rw_12.jsonl", "id": 41777, "text": "3. Under normal circumstances, we will reply within [15 working days].", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41778, "text": "If you are not satisfied with our response, you can also complain to the consumer rights protection department or file a lawsuit with jurisdiction.", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41779, "text": "Nanjing Shangwang Network Technology Co., Ltd.", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41780, "text": "Address: 16th Floor, Southern Half -Floor, Building, Building 8, No. 8, Bailongjiang, Xincheng Science and Technology Park, Jianye District, Nanjing City", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41781, "text": "August 12, 2022", "label": [], "rewrite": []}
{"task": "rw_12.jsonl", "id": 41782, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
