{"task": "rw_1.jsonl", "id": 36688, "text": "Cainiao APP privacy policy", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36689, "text": "Effective date: January 25, 2018", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36690, "text": "Update date: June 17, 2022", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36691, "text": "【introduction】", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36692, "text": "You are welcome to use our products and services!", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36693, "text": "We know the importance of personal information to you. Your trust is very important to us. We will strictly abide by laws and regulations to take corresponding security protection measures to protect your personal information security and controlling.", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36694, "text": "Based on this, the Cainiao APP service provider (or \"we\") formulates this \"Cainiao APP Privacy Policy\" (hereinafter referred toIn the process, how will we collect, use, share, store, and protect your personal information, as well as how you can manage your personal information so that you can make better choices.", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36695, "text": "Before you start using our products and services, please read and understand this policy carefully. In particular, we should focus on reading the clauses we logging in the threatening of the body/coarse body to ensure that you fully understand and agree to use it before starting to use.", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36696, "text": "The professional vocabulary involved in this policy, we try to explain to you in a concise and popular expression in order to facilitate your understanding.", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36697, "text": "If you have any questions, opinions or suggestions on the content of this policy, you can contact us through the contact information at the end of this policy.", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36698, "text": "This privacy policy will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36699, "text": "1. Scope of application", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36700, "text": "2. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36701, "text": "3. How can we entrust the processing, sharing, transfer, or disclose your personal information publicly", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36702, "text": "4. How do we store your personal information", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36703, "text": "5. How do we protect your personal information", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36704, "text": "6. Your rights", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36705, "text": "7. How do we deal with juvenile personal information", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36706, "text": "8. How to update this policy", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36707, "text": "Nine, how to contact us", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36708, "text": "Appendix: Related Definition", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36709, "text": "1. Scope of application", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36710, "text": "Cainiao APP (formerly \"Rookie Wrap\") is a software product developed by us that can provide you with services such as checking, sending, pickup, and using the rookie station and smart cabinet online.", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36711, "text": "To explain how the Cainiao App will collect, use and store your personal information and what rights you enjoy, we will explain related matters through this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36712, "text": "Please pay special attention, such as the rookie APP service provider with a new form of privacy protection/privacy policy provided by the new forms provided by you with a website, client, applet, and new forms that appeared with technology development, thenThis privacy policy may also be applicable to this part of the product/service.", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36713, "text": "At the same time, this privacy policy is not applicable to the services you provided in other third directions (such as the application provided by third parties in the Cainiao APP). The service provided in the third direction is applicable to the privacy policy/guidelines that it explained to you separately.Before choosing to use this third -party service, you should fully understand its product functions, service agreements and privacy policies/guidelines, and then choose whether to open/use functions.", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36714, "text": "2. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36715, "text": "When you use our products/services, the personal information we need/may need to collect and use includes the following:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36716, "text": "(1) In order to provide you with basic functions to provide us products and/or services, you must authorize us to collect and use the necessary information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36717, "text": "If you refuse to provide the corresponding information, you will not be able to use all of our or some products and/or services;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36718, "text": "(2) In order to provide you with additional functions to provide us products and/or services, you can choose to agree or disagree with the information we collected and used alone.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36719, "text": "If you refuse to provide it, you will not be able to use related additional functions normally or to achieve the functional effects we intend to achieve, but it will not affect your basic functions.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36720, "text": "We are here to remind you that we are committed to creating a variety of products and services to meet your needs.", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36721, "text": "Because there are many types and services we provide to you, and there are differences in the scope of the specific product/service selected by different users, the basic/additional functions and the personal information types and scope of personal information and use will be different. Please use specific ones.Product/service function shall prevail.", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36722, "text": "The basic functions we will provide for you include:", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36723, "text": "(1) Help you register the account and account management of the Caisean APP", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36724, "text": "In order to use the rookie APP service, you need to have a rookie account.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36725, "text": "You can register the Caisea account in the following ways:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36726, "text": "1. Register through your mobile phone number.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36727, "text": "If you choose to register Caisea account in this way, you need to provide us with your mobile phone number.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you choose to register Cuicao account through your mobile phone number, you need to provide us with your mobile phone number."}
{"task": "rw_1.jsonl", "id": 36728, "text": "After you register your Cainiao account with your mobile phone number, you can choose to related your Taobao account so that the Cainiao App provides you with Taobao package logistics services.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can choose to related your Taobao account in order to provide you with Taobao package logistics services."}
{"task": "rw_1.jsonl", "id": 36729, "text": "When binding your Taobao account, you need to agree that we can get your Taobao product order logistics order logistics order to facilitate you to get related services on the Cainiao APP.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When binding your Taobao account, you need to agree to obtain the logistics number number of your Taobao product order."}
{"task": "rw_1.jsonl", "id": 36730, "text": "After completing the binding, you can also choose to provide us with your Taobao delivery address information and Taobao order information, so that you can get more detailed information about the relevant orders in the Cainiao APP.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can choose to provide your Taobao goods receiving address information and Taobao order information in order to obtain information in the Cainiao APP."}
{"task": "rw_1.jsonl", "id": 36731, "text": "2., you can also choose to log in to the rookie APP directly by using your Taobao account.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can choose to log in to the rookie APP directly by using your Taobao account."}
{"task": "rw_1.jsonl", "id": 36732, "text": "When you log in to the Cainiao APP in this way, you need to agree to authorize Taobao to log in to your Taobao account and the relevant information of your registration of Taobao platform accounts (including your membership name, mobile phone number of your Taobao platform account), and youUse Taobao platform accounts in e -commerce platforms related to trading in e -commerce platforms such as Taobao, Tmall, Gathering, 1688, Xianyu, Rural Taobao and other e -commerce platforms (including the product information, package logistics information, sender and recipient information you order, Your common address book information, information between you and merchants and logistics service providers) are provided to the rookie to complete the login.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When you log in to the rookie APP with Taobao account, you need to agree to authorize the login status of Taobao your Taobao account and the relevant information of your registration of Taobao platform accounts, and the information related to transactions to the rookie to complete the login."}
{"task": "rw_1.jsonl", "id": 36733, "text": "(2) Help you conduct real -name authentication or real person certification", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36734, "text": "When you use some functions of the Cainiao APP, such as the sending function, according to relevant laws and regulations, we may need to provide real -name authentication or real -person authentication.", "label": ["Important"], "rewrite": "When you use some functions of your Cainiao App, such as sending functions, we may need to perform real -name authentication or real -person authentication."}
{"task": "rw_1.jsonl", "id": 36735, "text": "In order to perform real -name authentication, we need to authorize Alipay to provide us with your region, gender, nickname and avatar information related to your Alipay account.", "label": ["Permission Acquisition", "Important"], "rewrite": "To perform real -name authentication, we need to authorize Alipay to provide us with your region, gender, nickname and avatar information."}
{"task": "rw_1.jsonl", "id": 36736, "text": "In order to perform practical authentication, we need you to agree to provide us with your facial information and authorize us to verify your identity information with legal data holders.", "label": ["Permission Acquisition", "Important"], "rewrite": "In order to perform practical authentication, we need you to agree to provide us with your facial information and authorize us to verify your identity information with legal data holders."}
{"task": "rw_1.jsonl", "id": 36737, "text": "(3) Provide you with logistics services such as sending, pickup, checking, and other logistics services", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36738, "text": "In order to provide you with checking and pickup services, we will use the mobile phone number you used to register and log in to your Cainiao account, or the mobile phone number you actively add, or you use the default to collect the linked login.The mobile phone number of the goods address.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to provide you with checking and pickup services, we will use your mobile phone number to register and log in to your rookie account, or the mobile phone number you actively add."}
{"task": "rw_1.jsonl", "id": 36739, "text": "We collect your above information to provide you with the needs of the express check -up function;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We collect your mobile phone number to provide you with the needs of the express check -up function."}
{"task": "rw_1.jsonl", "id": 36740, "text": "If you use the Cainiao APP, it means that you authorize us to collect your information. If you refuse to provide such information, you may not be able to use our services normally.", "label": ["Policy Change", "Important", "Usage"], "rewrite": "If you use the Cainiao APP, it means that you authorize us to collect your number information."}
{"task": "rw_1.jsonl", "id": 36741, "text": "You should ensure that you use the mobile phone number of registering and logging in to your Cainiao account, or the mobile phone number you actively add, or the mobile phone number of the default receipt address in the Taobao account you use to log in to the Taobao account is true and effective, for you yourselfAll or you have obtained the full authorization of everyone.", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36742, "text": "And you authorize us to inquire with relevant logistics companies, e -commerce platforms or other partners, and obtain the logistics status information and obtaining code information of the corresponding packaging of the above mobile phone number as the contact information of the sender or the recipient, and the inquiry will be inquired.As a result, after integration, it will be displayed to you.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You have authorized us to inquire with relevant logistics companies, e -commerce platforms or other partners, obtain logistics status information, pick up code information, and show you."}
{"task": "rw_1.jsonl", "id": 36743, "text": "If the above mobile phone number is not all of you or you have not been fully authorized, you need to bear all legal responsibilities, and we have the right to immediately terminate the service to you.", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36744, "text": "You can replace the binding mobile phone number on the Settings page of the Cainiao or delete your friends and friend mobile phone numbers. We will stop providing you with services related to unbinding and deleting mobile phone numbers.", "label": ["Important", "Edit/Control"], "rewrite": "You can replace the binding mobile phone number on the Settings page of the Cainiao at any time, or delete your mobile phone number you added."}
{"task": "rw_1.jsonl", "id": 36745, "text": "We may cooperate with various third -party platforms to enable you to check the logistics status of these third -party platforms to place orders or ships in the Cainiao APP.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You can check the logistics status of the third -party platform on the third -party platform on the third -party platform."}
{"task": "rw_1.jsonl", "id": 36746, "text": "To this end, you need to authorize your rookie account and the account of the third -party platform (such as Kuaishou), so that we can obtain the transport order number and logistics details of the relevant parcels.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You need to authorize your rookie account and the account of the third -party platform to obtain the transport order number and logistics details of the related parcels."}
{"task": "rw_1.jsonl", "id": 36747, "text": "For some platforms, you can also further authorize us to obtain product information (such as product pictures, product order information, etc.) to obtain more information when checking the piece.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can further authorize us to get the product information of related parcels in order to get more information when checking the piece."}
{"task": "rw_1.jsonl", "id": 36748, "text": "You can lift the binding with these third -party platform accounts in the Cainiao APP at any time.", "label": ["Important", "Edit/Control"], "rewrite": "You can lift the binding of the third -party platform account in the Cainiao APP at any time."}
{"task": "rw_1.jsonl", "id": 36749, "text": "If you do this, you will not be able to continue receiving the logistics status information of these third -party platforms on the third -party platform.", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36750, "text": "In addition, when you use the \"Express Single One One -click Check\" function, you authorize us to check and obtain the corresponding package logistics status information to the actual logistics company to be checked.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "When you use the \"Express Single One One -click check\" function, that is, authorize the logistics status information of the actual carrier logistics company to be checked to the parcel to be checked."}
{"task": "rw_1.jsonl", "id": 36751, "text": "We will collect the transportation order number information you entered in the search bar, and integrate the query results and display them on your checkpress page in Cainiao.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect information on the search bar, and integrate the inquiry results and display them uniformly."}
{"task": "rw_1.jsonl", "id": 36752, "text": "If you use the rookie's pickup reminder service, we will collect your geographical location information. If your package is placed in a courier service station or smart express box that cooperates with us, we will judge that you and the courier service station or smart express mailThe distance between the box is sent to you when you are close to the courier service station or smart express box.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If you use the pick -up reminder service, we will collect your geographical location information, judge the distance between you and the express service station or smart express box, and send you a reminder to you."}
{"task": "rw_1.jsonl", "id": 36753, "text": "This function belongs to the additional function. Rejection of this information will only make you unable to use the rookie's pickup reminder function, but it does not affect the other functions of your rookie normally.", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36754, "text": "When you turn on the camera/camera permissions, you can scan the shipping number number for fast check, or scan the QR code to quickly pick up the piece.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you turn on the camera/camera permissions, you can scan the shipping number number to check the piece, or scan the QR code to quickly pick it up."}
{"task": "rw_1.jsonl", "id": 36755, "text": "In order to provide you with shipping services, we need you to provide us with the name, phone number and location information of the sender or recipient.", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to provide you with a delivery service, we need to provide you with the name, phone number and location information of the sender or recipient."}
{"task": "rw_1.jsonl", "id": 36756, "text": "When you build the address of the sender or the recipient's address in the sending service, or associate your mobile phone number of your friends and relatives to check each other, if you click the \"address book\" logo, we will read and show you youThe contact name and corresponding phone number in the mobile phone address book are used to help you quickly enter the name and phone number of the sender or recipient or your relatives or friends you choose;", "label": ["Important", "First Party Collection Information"], "rewrite": "When you create the address of the sender or the recipient, if you click the \"address book\" logo, we will read and show you the name of the contact person in your mobile phone address book and the corresponding phone number."}
{"task": "rw_1.jsonl", "id": 36757, "text": "If you click the \"Positioning\" logo, we will collect your geographical location information to help you fill the sender or recipient address.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you click the \"Positioning\" logo, we will collect your geographical location information."}
{"task": "rw_1.jsonl", "id": 36758, "text": "This function belongs to the additional function. If you are unwilling to provide the information, please operate carefully, do not click the relevant logo.", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36759, "text": "Refusal to provide this information will only make you unable to use Cainiao's fast and intelligent input of sender or recipient or the information of relatives and friends you choose, but it will not affect your normal use of Cainiao's other functions.", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36760, "text": "In addition, when you use the shipping function, we will store your shipping records in Cainiao so that you can check them at any time.", "label": ["Data Retention", "Important", "First Party Collection Information"], "rewrite": "When you use the shipping function, we will store your shipping records in Cainiao so that you can check them at any time."}
{"task": "rw_1.jsonl", "id": 36761, "text": "At the same time, when you use the check and sending function, we need to obtain your shear information to help you quickly copy the transmit number information or collect (sending) person's name, mobile phone number, address information (with youThe specific functions used are subject to), we will only identify and process your shear information on your device, and will not store your shear information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the check and send functions, we need to obtain your clipboard information to help you quickly copy, but your clipboard information will not be stored."}
{"task": "rw_1.jsonl", "id": 36762, "text": "(4) Provide you with payment and settlement services", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36763, "text": "In order to complete the order payment, you need to provide Alipay accounts and choose the payment method. We will put your rookie account or your affiliate login, the Alipay account member name, order number, transaction time, transaction object, transaction product, order transaction, order transactionThe amount of amount, order status, order security related equipment information, and other necessary information required by other anti -money laundering laws provides Alipay companies such as the Alipay software tool development package (SDK) embedded in the application.", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to complete the order payment, you need to provide Alipay accounts and choose payment methods. We will provide information to Alipay."}
{"task": "rw_1.jsonl", "id": 36764, "text": "You can ask others to pay for you, then you need to provide the Alipay account and/or mobile phone number of the Alipay.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can ask others to pay for you, then you need to provide the Alipay account and/or mobile phone number of the Alipay."}
{"task": "rw_1.jsonl", "id": 36765, "text": "At the same time, in order for us to know and confirm your payment progress and status in a timely manner, and provide you with after-sales and dispute resolution services, you agree that we may collect information related to payment progress from Alipay.", "label": ["Important", "First Party Collection Information"], "rewrite": "In order for us to know and confirm your payment progress and status in a timely manner, you agree that we may collect information related to payment progress from Alipay."}
{"task": "rw_1.jsonl", "id": 36766, "text": "(5) Provide you with customer service and after-sales service", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36767, "text": "When you contact us or submit an application for handling disputes during and after sales, in order to protect your account and system security, we may require you to provide logistics order information and necessary personal information such as mobile phone number, name, etc. to verify your membership identity.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you contact us or submit an application for handling disputes during and after sales, you are required to provide logistics order information and necessary personal information."}
{"task": "rw_1.jsonl", "id": 36768, "text": "In order to facilitate contact with you, help you solve problems as soon as possible, or record the solutions and results of related problems, we may save your communication with us, communication/call records and related content (including account information, order information, your Other information provided by the facts, or the contact information you left), if you consult, complain or provide suggestions for specific orders, we will use your account information and order information.", "label": ["Data Retention", "Important", "Usage"], "rewrite": "In order to facilitate you and help you solve the problem of problems or record related issues as soon as possible, we may save your communication, communication/call records and related content."}
{"task": "rw_1.jsonl", "id": 36769, "text": "In addition, when you need to have a voice interaction with the seller, customer service or courier, we will collect your recording content to respond to your customer service or dispute handling needs.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you need voice interaction, we will collect your recording content to respond to your customer service or dispute handling needs."}
{"task": "rw_1.jsonl", "id": 36770, "text": "Please know that even if you have agreed to turn on the microphone rights, we will only obtain voice information through the microphone when you actively click on the microphone icon or recorded video in your client.", "label": ["Permission Acquisition", "Important"], "rewrite": "Even if you have agreed to turn on the microphone rights, we will only obtain voice information through the microphone when you actively click the microphone icon or recording a video."}
{"task": "rw_1.jsonl", "id": 36771, "text": "(6) Make sure your transaction security", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36772, "text": "When you use a rookie, in order to ensure your normal use of our services, we will collect your device -related information and service log information, including equipment location, equipment model, operating system, equipment recognition logo (such as IMEI, IMSI, MAC address) Log in to the IP address, the rookie software version number, the method and type of access network, operation log, service log, mobile application list.", "label": ["Important", "First Party Collection Information"], "rewrite": "To ensure that you use our services normally, we will collect your equipment -related information and service log information."}
{"task": "rw_1.jsonl", "id": 36773, "text": "This kind of information is the basic information that the service must be collected. You use a rookie, which means that you authorize us to collect your information. If you refuse to provide such information, you will not be able to use our services normally.", "label": ["Policy Change", "Important"], "rewrite": "If you use a rookie, it means that you authorize us to collect your device -related information and service log information."}
{"task": "rw_1.jsonl", "id": 36774, "text": "In addition to the above basic functions, in order to make you more convenient to use rookie services or services other than logistics services, we will provide you with various additional functions.", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36775, "text": "In order to provide you with these additional features, we may collect and use your personal information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36776, "text": "If you do not provide this information, you can still use the basic function of the rookie, but you may not be able to use these can bring you convenient additional functions or need to fill in some information.", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36777, "text": "These additional functions include:", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36778, "text": "(7) Community station life function", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36779, "text": "Cainiao may recommend the community and surrounding life service information based on the records of your Cainiao Station service.", "label": ["Important", "Usage"], "rewrite": "Cainiao may recommend the community and surrounding life service information based on the records of your Cainiao Station service."}
{"task": "rw_1.jsonl", "id": 36780, "text": "If you want to use this function, we need you to agree to provide you with a record of using the rookie station service to the rookie.", "label": ["Important", "First Party Collection Information"], "rewrite": "The living function of the community station requires you to provide you with a record of providing you with Cainiao Station service to Cainiao."}
{"task": "rw_1.jsonl", "id": 36781, "text": "In addition, we may also need you to agree to provide you with the name of your residence to show you more accurately to display the community and surrounding life service information.", "label": ["Important", "Usage"], "rewrite": "You need to agree to the name of the community that you live in the rookie to show you more accurate recommendation of community and surrounding life service information."}
{"task": "rw_1.jsonl", "id": 36782, "text": "To this end, we will ask you to agree to provide us with the name of the community where you live.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will ask you to agree to provide us with the name of your residence."}
{"task": "rw_1.jsonl", "id": 36783, "text": "(8) Message push", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36784, "text": "We may send you a variety of messages to you through your mobile phone number provided to us in the process of using our service, such as service information notification, authentication, security verification, dispute processing, etc.", "label": ["Important", "Usage"], "rewrite": "We may send you a variety of messages to you through the mobile phone number you provided to us."}
{"task": "rw_1.jsonl", "id": 36785, "text": "In addition, we may also send you commercial information such as services, functions or activities that you may be interested in through the above mobile phone number.", "label": ["Important", "Usage"], "rewrite": "We send you commercial information such as services, functions or activities that you may be interested in through the mobile phone number you provided."}
{"task": "rw_1.jsonl", "id": 36786, "text": "If you don't want to receive such information, you can withdraw the booking method by the message described by the message we sent to you or the commercial information, or contact us directly through the contact information of this policy to refund the refundorder.", "label": ["Important", "Edit/Control"], "rewrite": "You can withdraw messages through the message that we send to you or commercial information."}
{"task": "rw_1.jsonl", "id": 36787, "text": "(9) Additional functions based on system permissions", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36788, "text": "To provide you with more convenient, better, and personalized products and/or services, and strive to improve your experience, we may collect and use your personal information by opening system permissions.", "label": ["Usage", "Permission Acquisition"], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36789, "text": "If you do not agree to start the relevant authority, it will not affect your basic services to use the Cainiao APP, but you may not be able to get the user experience brought by these additional services to you.", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36790, "text": "You can decide these permissions to open or close at any time.", "label": ["Important", "Edit/Control"], "rewrite": "You can decide your own permissions to open or close at any time."}
{"task": "rw_1.jsonl", "id": 36791, "text": "Please note that when you start the right of power, it means that you authorize us to collect and use relevant personal information to provide you with corresponding services. Once you turn off the right of power, it means that you cancel the authorization.With relevant personal information, you cannot continue to provide you with the service corresponding to the permissions.", "label": ["Important", "Edit/Control"], "rewrite": "The opening of one authority means that the authorization is authorized to collect and use the relevant information to provide corresponding services. Close the authority to cancel the authorization representative, and no longer continue to collect and use relevant information based on the corresponding permissions."}
{"task": "rw_1.jsonl", "id": 36792, "text": "The decision of your closure authority will not affect the collection and use of information based on your authorization.", "label": ["Important", "Risk"], "rewrite": "The decision of your closure authority will not affect the collection and use of information based on your authorization."}
{"task": "rw_1.jsonl", "id": 36793, "text": "You can click here to view the application authority application and usage description.", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36794, "text": "(10) Additional functions based on cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36795, "text": "Cookie and similar device information identification technology are commonly used in the Internet.", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36796, "text": "When you use our service, we may use related technologies to send one or more, cookie, or anonymous identifiers (hereinafter referred to as \"Cookie\") to collect, identify and store your access, use this product, use this productInformation about time.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may use cookies or anonymous identification symbols to collect, identify and store your information when using this product."}
{"task": "rw_1.jsonl", "id": 36797, "text": "We promise that cookies will not be used for any other purposes other than the purpose of this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36798, "text": "We use Cookie to ensure the safety and efficient operation of products and services. It can make us confirm the security status of your account and transaction, check the relevant abnormal conditions of collapse and delay, and help you save the steps of filling in your form and entering search content.And process.", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36799, "text": "At the same time, we may use, cookie, show you the information or function you may be interested in, and optimize your choice of advertising.", "label": ["Important", "Usage"], "rewrite": "We may use Cookie to show you the information or functions you may be interested in and optimize your choice of advertising."}
{"task": "rw_1.jsonl", "id": 36800, "text": "Most browsers provide users with the function of removing the browser cache data. You can perform the corresponding data clearing operation, or you can modify the degree of acceptance of cookies or reject our cookies.", "label": ["Edit/Control", "Important"], "rewrite": "You can perform the corresponding data clearing operation, or you can modify the degree of acceptance of Cookie or reject our cookies."}
{"task": "rw_1.jsonl", "id": 36801, "text": "You may not be able to use services or corresponding functions that depend on cookies because of these modifications.", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36802, "text": "In addition to Cookie, we may also use other similar technologies such as website beacons, pixel labels, ETAG and other similar technologies on the website.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may use other similar technologies such as websites, pixel labels, ETAG and other similar technologies on the website."}
{"task": "rw_1.jsonl", "id": 36803, "text": "For example, the email we send to you may contain a link to the address link to our website content. If you click the link, we will track this click to help us understand your product or service preferences to actively improve our customer service to improve customer serviceExperience.", "label": ["Usage"], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36804, "text": "Website beacon is usually a transparent image embedded in a website or email.", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36805, "text": "With the pixel labels in emails, we can know whether the email has been opened.", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36806, "text": "If you don't want your activities to be tracked in this way, you can withdraw from our signal list at any time.", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36807, "text": "ETAG (physical label) is the HTTP protocol header that is transmitted behind the Internet browser and the Internet server, which can replace Cookie.", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36808, "text": "ETAG can help us avoid unnecessary server loads, improve service efficiency, and save resources and energy. At the same time, we may record your identity through ETAG so that we can understand and improve our products or services more deeply.", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36809, "text": "Most browsers provide users with the function of removing browser cache data. You can perform the corresponding data clearance operation in the browser settings function.", "label": ["Edit/Control", "Important"], "rewrite": "You can remove the operation in the browser settings function."}
{"task": "rw_1.jsonl", "id": 36810, "text": "But please note that if ETAG is discontinued, you may not be able to enjoy a relatively better product or service experience.", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36811, "text": "(11) Other usage methods", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36812, "text": "In addition to the above purposes, in order to abide by national laws and regulations and regulatory requirements, and to provide you with services and improve service quality, we will use your information in the following situations:", "label": ["Usage"], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36813, "text": "1. In order to ensure the security of the service and help us better understand the operation of our application, we may record the relevant information, including the frequency, duration, collapse data, overall use status, performance data, and application of your application.origin of.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may record your frequency, duration, collapse data, overall usage, performance data, and application sources of your application."}
{"task": "rw_1.jsonl", "id": 36814, "text": "We will not store the information we store in the analysis software with any personal identity information you provided in the application.", "label": ["Important", "Usage"], "rewrite": "We will not store the information we store in the analysis software with any personal identity information you provided in the application."}
{"task": "rw_1.jsonl", "id": 36815, "text": "2. In order to provide you with information, products or services that meet your personal needs, we can extract your preference characteristics according to your equipment information and service log information, and combine the affiliated company provided to us under the premise of obtaining user authorization to us.Users' characteristics and technical capabilities will push you information, recommend products or services to you through online and offline interactive channels.", "label": ["Important", "Usage"], "rewrite": "In order to provide you with information, products or services that are more in line with your personal needs, we will extract your preferences based on your equipment information and service log information."}
{"task": "rw_1.jsonl", "id": 36816, "text": "We strive to ensure your privacy experience through the following measures: you can choose the products or services we recommend in our recommended products or services and preferences by long -pressing the pictures of products or services.", "label": ["Usage"], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36817, "text": "This function belongs to the additional function. If you do not need this service, you can manage it in the Cainiao APP through \"My-Settings-Push Power Settings\".", "label": ["Edit/Control", "Important"], "rewrite": "You can manage personalized recommendations through \"My-Settings-Push Power Settings\" in the Cainiao APP."}
{"task": "rw_1.jsonl", "id": 36818, "text": "After you understand that after the promotion limit is closed, we will stop recommending products or services to you according to personal characteristics, but it does not affect us to continue to recommend universal products or services to you.", "label": ["Important"], "rewrite": "After the lift is closed, we will stop recommending products or services to you according to personal characteristics."}
{"task": "rw_1.jsonl", "id": 36819, "text": "3. In order to improve the security of your services to provide services with our affiliated companies and partners, protect the safety of personal property of you or other users or the public, and better prevent fishing websites, fraud, network vulnerabilities, computer viruses, Internet attacks, network invasion and other security risks, and more accurately identify the situation of violating laws and regulations or rookie related agreement rules. We embed the application of our related companies in the application.May use or integrate your membership account information and our affiliated companies and partners to obtain information on your authorization or sharing according to law to comprehensively judge your account and logistics order risk, verify, test and prevent security incidents, and take necessary in accordance with the law according to lawRecords, audit, analysis, and disposal measures.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "In order to improve the security you use, we embed the application security SDK developed by our affiliated companies in the application to collect your equipment information and service log information, and integrate it, and adopt necessary records, audit, analysis, and disposal measures."}
{"task": "rw_1.jsonl", "id": 36820, "text": "4. In order to help us evaluate, improve or design services and operation activities, we may adopt desensitization and de -identifying methods to comprehensively statistics and analysis and processing of your information.", "label": ["Important", "Data Security"], "rewrite": "We may adopt comprehensive statistics and analysis and processing of desensitization and dehuminification."}
{"task": "rw_1.jsonl", "id": 36821, "text": "5. Report to relevant departments in accordance with laws and regulations or regulatory requirements.", "label": ["Important", "Usage"], "rewrite": "Report to relevant departments in accordance with laws and regulations or regulatory requirements."}
{"task": "rw_1.jsonl", "id": 36822, "text": "(12) Algorithm usage", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36823, "text": "We may use algorithms to provide you with better services, such as predicting the rough time for the package for you.", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36824, "text": "You can click here to view our algorithm principles and information processing instructions.", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36825, "text": "3. How can we entrust the processing, sharing, transfer, or disclose your personal information publicly", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36826, "text": "(1) Entrusted processing", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36827, "text": "We may entrust a partner to handle your personal information in order to authorize partners to represent you to provide you with certain services or fulfilling functions.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may entrust a partner to handle your personal information in order to authorize partners to represent some of our services or fulfilling functions on behalf of our services."}
{"task": "rw_1.jsonl", "id": 36828, "text": "We will only entrust their information for the legal, correct, necessary, specific, and clear goals of this policy statement. We can authorize partners to only contact the information required by their duties, and we will ask for the agreement to request that it must not be requiredThis information is used for any other goals that exceed the scope of the commission and protect your personal information in accordance with laws and regulations and not lower than the standards required by this guideline.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only entrust them to process your information for the legal, correct, necessary, specific, and clear purpose of this policy. The authorized partners can only contact the necessary information, and must not exceed the purpose of the entrustment, and to your personal information for your personal informationProtect."}
{"task": "rw_1.jsonl", "id": 36829, "text": "If the authorized partner will use your information for our unreasonable purpose, it will obtain your consent alone.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If the authorized partner will use your information for our unreasonable purpose, it will obtain your consent alone."}
{"task": "rw_1.jsonl", "id": 36830, "text": "At present, our authorized partners include the following types:", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36831, "text": "1. Authorized partners of advertising and analysis of service.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36832, "text": "We will entrust these authorized partners to handle advertising and information related to advertising coverage and effectiveness.You use OS, IP, IMEI, Androidid, IDFA, OAID, User, Agent, etc.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will entrust advertising partners to process advertising and information related to advertising coverage and effectiveness."}
{"task": "rw_1.jsonl", "id": 36833, "text": "But unless you obtain your permission, we will not provide your personal identity information to partners who provide us with advertising and analysis services to us, or we will anonymous processing of this information, making the authorization partner unable to identify your individual.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not provide your personal identity information to advertising partners, or we will make this information anonymous processing so that it cannot identify you."}
{"task": "rw_1.jsonl", "id": 36834, "text": "Such partners may combine the above information with other data they have legally obtained to implement the advertising services or decision -making suggestions that we entrust.", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36835, "text": "2. Cooperate logistics service provider.", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36836, "text": "In order to cooperate with various logistics resources, entrust our cooperative logistics service providers to provide you with logistics services such as satisfactory delivery, checking, picking, and sending parts, and we may put your logistics order -related information (such as the recipient's name name, Address, mobile phone number, parcel information, etc.) are provided to courier companies, warehousing companies, trunk transportation companies, distribution companies, express service stations, and smart express box operation companies such as operational enterprises and other cooperative logistics service providers, so that they can provide you with corresponding logisticsServe.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to cooperate with various logistics resources and provide logistics services, we may cooperate with your logistics orders to cooperate with logistics service providers."}
{"task": "rw_1.jsonl", "id": 36837, "text": "This kind of information is necessary to provide logistics services. If you use a rookie, it means that you authorize us to provide this information to cooperative logistics service providers.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you use a rookie, it means that you authorize us to provide logistics order -related information to cooperative logistics service providers."}
{"task": "rw_1.jsonl", "id": 36838, "text": "If you refuse to authorize, please stop using rookie services.", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36839, "text": "In addition, if you want to query your parcels carried by these logistics service providers by subscribing to the applets of these logistics service providers in the Cainiao APP, you need to authorize the Cainiao APP to provide your mobile phone number to these logistics service providers to facilitate easynessIt query your corresponding package through your mobile phone number and display it in the package list of the Cainiao APP.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you want to query the package through the applet of the Subscribe to the Subscribe in the Cainiao App, you need to authorize the Cainiao App to provide your mobile phone number to these logistics service providers."}
{"task": "rw_1.jsonl", "id": 36840, "text": "If you do not want to continue to receive the parcel information of a logistics service provider in the future, you can cancel the authorization of the logistics service provider in the \"My\"-\"Permanent Settings\" in the upper right corner- \"Permanent Settings\".", "label": ["Edit/Control", "Important"], "rewrite": "You can cancel the authorization of the logistics service provider in the icon of \"Mine\"-\"Permanent Settings\"."}
{"task": "rw_1.jsonl", "id": 36841, "text": "After you cancel, you will not be able to view the package information of the logistics service provider.", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36842, "text": "At present, the authorized logistics service providers are Yuantong, Shentong, and extremely rabbits.", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36843, "text": "3. Logistics information partner.", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36844, "text": "In order to provide you with a satisfactory check and pick -up service, we will entrust your logistics order -related information (such as the recipient's mobile phone number, package information, etc.) to Alipay and other logistics information partners in order to facilitate you through Alipay and other otherEnjoy the corresponding information display and push service.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to provide you with a satisfactory check and pickup service, we will entrust your logistics order -related information to Alipay and other logistics information partners."}
{"task": "rw_1.jsonl", "id": 36845, "text": "4. Support other partners of our business.", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36846, "text": "We will entrust other third -party service providers to provide technical infrastructure services, analyze the usage methods of our services, provide customer service, pay convenience, or conduct academic research and investigation.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will entrust other third -party service providers to provide technical infrastructure services, analyze the usage methods of our services, provide customer service, pay convenience, or conduct academic research and investigation."}
{"task": "rw_1.jsonl", "id": 36847, "text": "(2) Sharing", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36848, "text": "We will not share your personal information with companies, organizations, and individuals other than the Cainiao APP service provider, except for the following situations:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not share your personal information with companies, organizations, and individuals other than the Cainiao APP service provider, except for the following situations:"}
{"task": "rw_1.jsonl", "id": 36849, "text": "1., fulfill the sharing necessary for the law office: we may share your personal information in accordance with the requirements of laws and regulations, litigation, and disputes in accordance with the requirements of administrative and judicial organs in accordance with the law, as well as other legal obligations, andEssence", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share your personal information in accordance with the requirements of laws and regulations, litigation, and disputes, or in accordance with the requirements put forward by administrative and judicial organs in accordance with the law, as well as other legal obligations."}
{"task": "rw_1.jsonl", "id": 36850, "text": "2. Share sharing when you get your consent: After getting your clear consent, we will share your personal information with other parties.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After getting your clear consent, we will share your personal information with other parties."}
{"task": "rw_1.jsonl", "id": 36851, "text": "3. Share with affiliated companies: In order to recommend information that you may be interested in, identify the account abnormal, and use the binding of Alipay to perform real -name authentication or identity verification or real person certification to protect our related companies or other users or public personal property exemptionIf you are infringed, your personal information may be shared with the rookie related company and/or its designated service provider.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Your personal information may be shared with the rookie associated company and/or its designated service provider."}
{"task": "rw_1.jsonl", "id": 36852, "text": "We will only share the necessary personal information and be restricted by the purpose declared in the privacy guidelines.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only share the necessary personal information and be restricted by the purpose declared in the privacy guidelines."}
{"task": "rw_1.jsonl", "id": 36853, "text": "If we share your personal sensitive information or related companies to change the purpose of the use and processing of personal information, we will solicit your authorization again.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If we share your personal sensitive information or related companies to change the purpose of the use and processing of personal information, we will solicit your authorization again."}
{"task": "rw_1.jsonl", "id": 36854, "text": "4. In order to enable you to receive information push, share information on third -party platforms, and use map services, etc., we will embed the SDK or other similar applications of authorized partners in our applications. You can click here to view usSDK details of the authorized partner.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Our applications will embed the SDK or other similar applications of authorized partners. You can click here to view the third -party SDK details."}
{"task": "rw_1.jsonl", "id": 36855, "text": "We will strictly test the application interface (API) and software tool development package (SDK) of the authorized partners to obtain relevant information, and strict data protection measures with the authorized partners, so that they will follow this guideline and any other other.Related confidentiality and security measures to handle personal information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will conduct strict security testing of authorized partners and agreed with data protection measures."}
{"task": "rw_1.jsonl", "id": 36856, "text": "5. Please note that the information you voluntarily shared or even publicly shared when using our service may involve your or other people's personal information and even sensitive personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Please note that the information you voluntarily shared or even publicly shared may involve personal information and even sensitive personal information."}
{"task": "rw_1.jsonl", "id": 36857, "text": "Please consider and make a decision more cautiously.", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36858, "text": "(3) Transfer", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36859, "text": "We will not transfer your personal information to any company, organization and individual, except the following situations: except:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not transfer your personal information to any company, organization and individual, except the following situations: except:"}
{"task": "rw_1.jsonl", "id": 36860, "text": "1. After getting your clear solo consent, we will transfer your personal information to other parties;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After getting your clear solo consent, we will transfer your personal information to other parties."}
{"task": "rw_1.jsonl", "id": 36861, "text": "2. When we have a merger, acquisition or bankruptcy liquidation situation, or other cases involving mergers, acquisitions or bankruptcy liquidation, if you involve personal information transfer, we will ask for new companies and organizations that hold your personal information to continue to be subject to this book.The constraints of the guidelines for privacy protection, otherwise we will ask the company, organization and individual to reconcile your authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When involving mergers, acquisitions, or bankruptcy liquidation, if personal information transfer is involved, it will be required to continue to be bound by the policy, otherwise it will request that it will re -solicit authorization consent."}
{"task": "rw_1.jsonl", "id": 36862, "text": "(4) Public disclosure", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36863, "text": "We will only publicly disclose your personal information in the following circumstances:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only publicly disclose your personal information in the following circumstances:"}
{"task": "rw_1.jsonl", "id": 36864, "text": "1. Get your clear consent or based on your active choice, we will publicly disclose your personal information;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Obtain your clear consent or based on your active choice, we will publicly disclose your personal information."}
{"task": "rw_1.jsonl", "id": 36865, "text": "2. If we determine that you have violations of laws and regulations, or to protect the security of the Cainiao App users or the public's personal property, we may disclose personal information about your personal information based on laws and regulations or obtain your consent.Including related violations and the measures that Cainiao APP has taken you.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you determine your violations of laws and regulations or protect the safety of all parties, we may disclose personal information about you in accordance with laws and regulations or obtain your consent."}
{"task": "rw_1.jsonl", "id": 36866, "text": "Please know that according to applicable laws, if we take technical measures and other necessary measures to take personal information, so that the data receiver cannot re -identify specific individuals and cannot recover, then the sharing, transfer, and public disclosure of data after this type of processing does not need to be disclosed.Notify you and obtain your consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The sharing, transfer, and public disclosure of anonymous data cannot be notified to you and obtain your consent."}
{"task": "rw_1.jsonl", "id": 36867, "text": "4. How do we store your personal information", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36868, "text": "(1) Storage period", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36869, "text": "We will only retain your personal information within the time required for the purpose of achieving costs, unless the law has compulsory deposit and retention requirements, such as the \"E -Commerce Law of the People's Republic of China\" requires that the goods and service information and transaction information deposit time are required.It is not less than 3 years from the date of completion.", "label": ["Data Retention", "Important"], "rewrite": "Generally, your personal information is retained within the time limit required to achieve service purposes, unless the law has other requirements."}
{"task": "rw_1.jsonl", "id": 36870, "text": "We judge the storage period of personal information mainly refer to the following standards and are based on the elderly:", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36871, "text": "1. Complete your related transaction purpose, maintain the corresponding transactions and business records to cope with your possible inquiries or complaints;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36872, "text": "2. Ensure that we provide you with service safety and quality;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36873, "text": "3. Do you agree to a longer retention period;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36874, "text": "4. Whether there are other special agreements in the reserved period.", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36875, "text": "When our products or services stop operating, we will notify you at least 15 working days in advance to push notifications, announcements and other forms, and delete your personal information within a reasonable period or perform anonymous processing.", "label": ["Data Retention", "Important", "Cessation of Operations"], "rewrite": "When stopping operations, we will notify it in advance and delete or processes your personal information."}
{"task": "rw_1.jsonl", "id": 36876, "text": "(2) Storage location", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36877, "text": "We will store personal information collected in the country in China in accordance with laws and regulations, and will not provide relevant personal information to overseas, unless we have clearly informs you the purpose of exit, receiving party, security measures, security risksWait for the situation and get your separate consent.", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in domestic operations will be stored in China."}
{"task": "rw_1.jsonl", "id": 36878, "text": "Please pay attention to the authorization agreement we provide on you on a specific function page. You have the right to choose to agree or refuse to authorize. If you refuse to provide us with relevant information and not allow cross -border to our overseas servers, you will not enjoy ourCross -border logistics services, but do not affect other functions of your Cainiao App.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "If you refuse to provide us with relevant information and not allow cross -border to reach our overseas servers, you will not be able to enjoy cross -border logistics services."}
{"task": "rw_1.jsonl", "id": 36879, "text": "5. How do we protect your personal information", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36880, "text": "We have adopted our information that meets industry standards, reasonable and feasible security measures to protect your information, and prevent personal information from being disclosed, used, modified, damaged or lost by unauthorized access, publicly disclosed, used, modified, damaged, or lost.", "label": ["Important", "Data Security"], "rewrite": "Take safety protection measures to protect your information."}
{"task": "rw_1.jsonl", "id": 36881, "text": "For example, when you exchange data between your browser and the server, the SSL protocol is encrypted;", "label": ["Important", "Data Security"], "rewrite": "When you exchange data between your browser and the server, the SSL protocol is encrypted and protected."}
{"task": "rw_1.jsonl", "id": 36882, "text": "We also provide the HTTPS protocol security browsing method at the same time;", "label": ["Important", "Data Security"], "rewrite": "We provide the HTTPS protocol security browsing method for the Cainiao App."}
{"task": "rw_1.jsonl", "id": 36883, "text": "We will use encryption technology to improve the security of personal information;", "label": ["Important", "Data Security"], "rewrite": "We use encrypted technology to improve the security of personal information."}
{"task": "rw_1.jsonl", "id": 36884, "text": "We will use a trusted protection mechanism to prevent personal information from being maliciously attacked;", "label": ["Important", "Data Security"], "rewrite": "We use trusted protection mechanisms to prevent personal information from being maliciously attacked."}
{"task": "rw_1.jsonl", "id": 36885, "text": "We will deploy the access control mechanism and try our best to ensure that only authorized personnel can access personal information;", "label": ["Important", "Data Security"], "rewrite": "We will deploy the access control mechanism to make every effort to ensure that only authorized personnel can access personal information."}
{"task": "rw_1.jsonl", "id": 36886, "text": "And we will organize safety and privacy protection training courses to strengthen employees' awareness of protecting the importance of personal information.", "label": ["Important", "Data Security"], "rewrite": "We will organize safety and privacy protection training courses to strengthen employees' awareness of protecting the importance of personal information."}
{"task": "rw_1.jsonl", "id": 36887, "text": "We have the industry's advanced data security management system based on data as the core and the data life cycle, and improves the security of the entire system from the aspects of organizational construction, system design, personnel management, and product technology.", "label": ["Important", "Data Security"], "rewrite": "We have a data security management system that improves the security of the entire system in terms of organizational construction, system design, personnel management, and product technology."}
{"task": "rw_1.jsonl", "id": 36888, "text": "At present, our important information system has passed the evaluation of network security level protection and certification of ISO27001.", "label": ["Important", "Data Security"], "rewrite": "Important information systems have passed the evaluation of network security level protection and certification of ISO27001."}
{"task": "rw_1.jsonl", "id": 36889, "text": "We will take reasonable and feasible measures to avoid collecting unrelated personal information.", "label": ["Important", "Data Security"], "rewrite": "We will try our best to avoid collecting unrelated personal information."}
{"task": "rw_1.jsonl", "id": 36890, "text": "We will only retain your personal information within the time limit required for the purpose of reaching the purpose of the privacy policy, unless the law has compulsory depository requirements.", "label": ["Data Retention", "Important"], "rewrite": "Reserves your personal information within the time limit required for the service purpose, unless the law has other requirements."}
{"task": "rw_1.jsonl", "id": 36891, "text": "The Internet is not an absolutely secure environment. When using the rookie APP service, we strongly recommend that you do not use the non -rookie APP to send your information.", "label": ["Important", "Data Security"], "rewrite": "It is recommended that you do not use the non -rookie App recommended to send your information."}
{"task": "rw_1.jsonl", "id": 36892, "text": "You can build connections and share with each other through our services.", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36893, "text": "When you create communication, transactions or sharing through our service, you can choose the objects that communicate, trades or share as a third party who can see related information such as your package content, contact method, communication information or sharing content.", "label": ["Edit/Control", "Important"], "rewrite": "When you create communication, transactions or sharing, you can choose objects that communicate, trades or share."}
{"task": "rw_1.jsonl", "id": 36894, "text": "When using the Cainiao APP for delivery operations, you inevitably need to disclose your personal information to cooperative express logistics service providers or potential express logistics service providers, such as contact methods or contact addresses.", "label": ["Important", "First Party Collection Information"], "rewrite": "When using the Cainiao APP for delivery operation, you inevitably disclose your personal information to the logistics service provider."}
{"task": "rw_1.jsonl", "id": 36895, "text": "Please protect your personal information properly and provide them with others only.", "label": ["Important", "Data Security"], "rewrite": "Please protect your personal information properly and provide it in the necessary situation."}
{"task": "rw_1.jsonl", "id": 36896, "text": "If you find your personal information, especially your account or password, please immediately contact the Cainiao App customer service so that we can take corresponding measures based on your application.", "label": ["Important", "Data Security"], "rewrite": "If your personal information is leaked, please contact our customer service immediately."}
{"task": "rw_1.jsonl", "id": 36897, "text": "Please note that when you use our service, you voluntarily share or even publicly share information, which may involve your or other people's personal information and even personal sensitive information. If you choose to upload pictures containing personal information when evaluating.", "label": ["Important", "Data Security"], "rewrite": "Please note that the information you shared or even publicly shared may involve personal information of you or others and even personal sensitive information."}
{"task": "rw_1.jsonl", "id": 36898, "text": "Please consider whether to share or even publicly share relevant information when using our services.", "label": ["Important", "Data Security"], "rewrite": "Please consider whether to share or even share relevant information."}
{"task": "rw_1.jsonl", "id": 36899, "text": "Please use complex passwords to help us guarantee your account security.", "label": ["Important", "Data Security"], "rewrite": "Please use complex passwords."}
{"task": "rw_1.jsonl", "id": 36900, "text": "We will try our best to ensure the security of any information you send to us.", "label": ["Important", "Data Security"], "rewrite": "We will try our best to ensure the security of any information you send to us."}
{"task": "rw_1.jsonl", "id": 36901, "text": "If our physical, technical, or management protection facilities are damaged, the information is caused by unauthorized access, public disclosure, tampering or destruction, which will cause your legitimate rights and interests to be damaged, and we will bear the corresponding legal responsibility.", "label": ["Important", "Data Security"], "rewrite": "If our physical, technical, or management protection facilities are damaged, the information is caused by unauthorized access, public disclosure, tampering or destruction, which will cause your legitimate rights and interests to be damaged, and we will bear the corresponding legal responsibility."}
{"task": "rw_1.jsonl", "id": 36902, "text": "We will update and disclose relevant content such as security risks, personal information security impact assessment reports, etc. You can get it through the Cainiao App announcement.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36903, "text": "After unfortunately a personal information security incident, we will inform you in accordance with the requirements of the laws and regulations: the basic situation and possible impact of the security incident, the disposal measures we have taken or we will take, the suggestions that you can prevent and reduce the risk,Remedy for your remedy.", "label": ["Important", "Data Security"], "rewrite": "If a personal information security incident occurs, we will inform your basic situation, possible impact, disposal measures, independent prevention suggestions, etc."}
{"task": "rw_1.jsonl", "id": 36904, "text": "In the event related to the incident, we will inform you in the form of mail, letter, telephone, push notification, etc. When it is difficult to inform the subject of personal information one by one, we will publish an announcement in a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "The relevant situation of security incidents will be informed by mail, letter, telephone, push notification, etc. When it is difficult to inform one by one, it will issue an announcement."}
{"task": "rw_1.jsonl", "id": 36905, "text": "At the same time, we will also report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "Report the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities."}
{"task": "rw_1.jsonl", "id": 36906, "text": "6. Your rights", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36907, "text": "You can check and manage your information through the following ways, and we will respond to your request in the case of compliance with laws and regulations:", "label": ["Important", "Edit/Control"], "rewrite": "You can check and manage your information through the following ways, and we will respond to your request in the case of compliance with laws and regulations:"}
{"task": "rw_1.jsonl", "id": 36908, "text": "(1) Check, correct and supplement your personal information", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36909, "text": "You have the right to check, correct and supplement your information through the following ways:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36910, "text": "Open the rookie app, click \"My\", and click the avatar in the upper left corner.", "label": ["Important", "Edit/Control"], "rewrite": "You have the right to check, correct and supplement your information through the following ways: Open the rookie APP, click \"My\", and click the avatar in the upper left corner."}
{"task": "rw_1.jsonl", "id": 36911, "text": "(2) Delete your personal information", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36912, "text": "You can open the rookie APP, click \"My\", click the avatar in the upper left corner to delete some of your information, or apply for cancellation account to delete all your information.", "label": ["Important", "Edit/Control"], "rewrite": "You can open the rookie APP, click \"My\", click the avatar in the upper left corner to delete some of your information, or apply for cancellation account to delete all your information."}
{"task": "rw_1.jsonl", "id": 36913, "text": "In the following circumstances, you can make a request to delete personal information by contacting our personal information protection full -time department:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36914, "text": "1. If our behavior of handling personal information violates laws and regulations;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36915, "text": "2. If we collect and use your personal information, it has not obtained your clear consent;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36916, "text": "3. If our behavior of handling personal information seriously violates your agreement;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36917, "text": "4. If our treatment purpose has been achieved, cannot be achieved or is not necessary for the purpose of the treatment;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36918, "text": "5. If we stop providing products or services, or the storage period has expired.", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36919, "text": "If we decide to respond to your deletion request, we will also notify the subject of your personal information from our personal information as much as possible at the same time, and ask them to delete it in time (unless laws and regulations have other regulations, or these subjects have independently obtained your authorization)Essence", "label": ["Important", "Edit/Control"], "rewrite": "If we decide to respond to your deletion request, we will notify the subject of your personal information from us at the same time as much as possible, and ask them to delete them in time."}
{"task": "rw_1.jsonl", "id": 36920, "text": "When you or we assisted you to delete the relevant information, because of the applicable legal and security technical restrictions, we may not be able to immediately delete the corresponding information from the backup system.Treatment until the backup can be removed or achieved anonymous.", "label": ["Important", "Edit/Control"], "rewrite": "We stop the processing of personal information that is difficult to delete due to applicable laws or technical restrictions, except for storage and adopting necessary security measures until we can be deleted or achieved anonymous."}
{"task": "rw_1.jsonl", "id": 36921, "text": "(3) Change the scope of your authorization consent", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36922, "text": "You can change or withdraw the scope of your personal information in the following ways or withdrawn or process your personal information:", "label": ["Edit/Control", "Important"], "rewrite": "You can change or withdraw the scope of authorization through the following ways: Open the rookie APP, click \"My\", and click the icon in the upper right corner."}
{"task": "rw_1.jsonl", "id": 36923, "text": "Open the rookie app, click \"My\", and click the icon in the upper right corner.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36924, "text": "You can change your authorization of system authority in \"privacy\" and change other authorization in \"authority settings\".", "label": ["Important", "Edit/Control"], "rewrite": "You can change your authorization of system authority in \"privacy\" and change other authorization in \"authority settings\"."}
{"task": "rw_1.jsonl", "id": 36925, "text": "For the authorization that you cannot directly set through the above methods, you can use contacting our personal information to protect the full -time department to modify it, but please note that for some types of personal information, such as the information necessary for the basic functions of the Cainiao APPThe required information required by the regulations may not be able to respond to the request that you change the scope of authorization.", "label": ["Important", "Edit/Control"], "rewrite": "You can authorize the authorization of our personal information protection full -time department, and we may not be able to respond to the request that you change some types of personal information authorization."}
{"task": "rw_1.jsonl", "id": 36926, "text": "When you withdraw authorization, we will no longer process the corresponding personal information.", "label": ["Important", "Edit/Control"], "rewrite": "When you withdraw authorization, we will no longer process the corresponding personal information."}
{"task": "rw_1.jsonl", "id": 36927, "text": "But your decision to withdraw authorization will not affect our personal information processing based on your previous authorization.", "label": ["Edit/Control", "Important"], "rewrite": "Your decision to withdraw authorization will not affect personal information processing based on your authorization."}
{"task": "rw_1.jsonl", "id": 36928, "text": "(4) Logging out your account", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36929, "text": "You can apply for a cancellation of your account in the following ways:", "label": ["Important", "Edit/Control"], "rewrite": "You can apply for a cancellation of your account in the following way: open the rookie app, click \"My\", then click the icon in the upper right corner, then click \"Account Management\", then click \"Account and Security\", and then click \"Account to Logar\"."}
{"task": "rw_1.jsonl", "id": 36930, "text": "Open the rookie APP, click \"My\", then click the icon in the upper right corner, then click \"Account Management\", then click \"Account and Security\", and then click \"Account to cancel\".", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36931, "text": "After you cancel your account, we will stop providing you with products/services and delete or processed your personal information according to the requirements of applicable laws.", "label": ["Important", "Edit/Control"], "rewrite": "After cancellation, personal information will be deleted or anonymous."}
{"task": "rw_1.jsonl", "id": 36932, "text": "(5) Automatic decision -making of constraint information systems", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36933, "text": "In certain business functions, we may make decisions only based on the non -artificial automatic decision mechanism, including the algorithm.", "label": ["Important"], "rewrite": "In certain business functions, we may only make decisions based on non -artificial automatic decision -making mechanisms."}
{"task": "rw_1.jsonl", "id": 36934, "text": "If these decisions affect your legitimate rights and interests, you can open the rookie APP, click \"My\", click the icon in the upper right corner, click \"Permanent Settings\", and then click \"Push Power Settings\" to turn off the automatic decision function.", "label": ["Edit/Control", "Important"], "rewrite": "You can open the rookie APP, click \"My\", click the icon in the upper right corner, click \"Permanent Settings\", and then click \"Push Power Settings\" to turn off the automatic decision -making function."}
{"task": "rw_1.jsonl", "id": 36935, "text": "You can also contact us through our personal information protection full -time department.", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36936, "text": "(6) responding to your above request", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36937, "text": "For the above requests made by your guardians, close relatives, and other authority, as well as your personal information rights stipulated in the laws of the People's Republic of China and other applicable laws, you can protect our personal information protection.The full -time department will make relevant requests.", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36938, "text": "We will respond within 15 working days.", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36939, "text": "In order to ensure your account security and your personal information security, when you make a request to us, we may verify your identity (such as adding account verification, asking you to provide written requests or other reasonable ways), and then process youRequest.", "label": ["Important", "Data Security"], "rewrite": "To ensure your account security and your personal information security, we may verify your identity first, and then process your request."}
{"task": "rw_1.jsonl", "id": 36940, "text": "For your reasonable request, we do not charge fees in principle, but we will charge a certain fee as appropriate for requests that repeat and beyond the reasonable limit.", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36941, "text": "For information that is not directly associated with your identity, the information that is repeatedly applied without reasonable reasons, or you need too many technical means (if you need to develop a new system or change the current convention fundamentally), bring risks to others' legitimate rights or notIn actual requests, we may refuse.", "label": ["Important"], "rewrite": "We may refuse to repeat for unseen, need too much technical means, bring risks or very unrealistic requests to others' legitimate rights and interests."}
{"task": "rw_1.jsonl", "id": 36942, "text": "In addition, in the following circumstances, in accordance with the requirements of laws and regulations, we will not be able to respond to your request:", "label": ["Important", "Edit/Control"], "rewrite": "In the following circumstances, in accordance with the requirements of laws and regulations, we will not be able to respond to your request:"}
{"task": "rw_1.jsonl", "id": 36943, "text": "1., related to national security and national defense security;", "label": ["Edit/Control", "Important"], "rewrite": "If your request is directly related to national security and national defense security, you may not be responded."}
{"task": "rw_1.jsonl", "id": 36944, "text": "2., related to public security, public health, and major public interests;", "label": ["Important", "Edit/Control"], "rewrite": "Your request is directly related to public safety, public health, and major public interests and may not be responded."}
{"task": "rw_1.jsonl", "id": 36945, "text": "3., related to criminal investigation, prosecution, trial and execution of judgments;", "label": ["Important", "Edit/Control"], "rewrite": "Your request is related to criminal investigation, prosecution, and trial, and may not be responded."}
{"task": "rw_1.jsonl", "id": 36946, "text": "4. There is sufficient evidence to indicate that the subject of personal information has subjective malice or abuse of rights;", "label": ["Edit/Control", "Important"], "rewrite": "We have sufficient evidence that if you have subjective malice or abuse of rights, you may not be able to respond to the request."}
{"task": "rw_1.jsonl", "id": 36947, "text": "5., Responding to your request will cause serious damage to the legitimate rights and interests of you or other individuals or organizations;", "label": ["Important", "Edit/Control"], "rewrite": "We may not be able to respond to the request that the legitimate rights and interests of you or other individuals and organizations are seriously damaged."}
{"task": "rw_1.jsonl", "id": 36948, "text": "6., involving commercial secrets;", "label": ["Important", "Edit/Control"], "rewrite": "We may not be able to respond to requests involving trade secrets."}
{"task": "rw_1.jsonl", "id": 36949, "text": "7. What is related to the obligations stipulated in the performance of our laws and regulations;", "label": ["Important", "Edit/Control"], "rewrite": "If your request is related to the obligations stipulated in our laws and regulations, it may not be responding."}
{"task": "rw_1.jsonl", "id": 36950, "text": "8. Out of maintaining major legitimate legitimate rights and interests such as the life and property of the personal information subject or other individuals, it is difficult to obtain the consent of my authority.", "label": ["Important", "Edit/Control"], "rewrite": "We may not be able to respond to requests for the protection of major legitimate rights and interests such as the life and property of the personal information subject or other individuals, but it is difficult to obtain the consent of the individual."}
{"task": "rw_1.jsonl", "id": 36951, "text": "7. How do we deal with juvenile personal information", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36952, "text": "We attach great importance to the protection of personal information of minors.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36953, "text": "According to the relevant laws and regulations, if you are a minor under the age of 18, before you use the Cainiao APP service, we ask you to ask your parents or other guardians to read this privacy policy carefully and obtain your parentsOr use our services or provide information to us under the consent of other guardians.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a minor under the age of 18, use our services or provide information to us under the premise of obtaining your consent of your supervisor."}
{"task": "rw_1.jsonl", "id": 36954, "text": "If you are the parents of the minor or other guardians, please pay attention to whether your minor uses our service after obtaining your authorization consent.", "label": ["Specific Audiences", "Important"], "rewrite": "Please pay attention to whether your minor will use our services after obtaining your authorization consent."}
{"task": "rw_1.jsonl", "id": 36955, "text": "If you have questions about the personal information of minors, please contact our personal information protection full -time department.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36956, "text": "8. How to update the policy", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36957, "text": "In order to bring you a better product and service experience, we continue to strive to improve our products, services and technology.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36958, "text": "When the new service and business processes change, we may update our privacy policy to inform you of specific changes.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36959, "text": "Without your clear consent, we will not restrict the rights you should enjoy in accordance with this privacy policy.", "label": ["Policy Change", "Important"], "rewrite": "Without your clear consent, we will not restrict the rights you should enjoy in accordance with this privacy policy."}
{"task": "rw_1.jsonl", "id": 36960, "text": "For major changes, we will also show you the guidelines after pushing notifications and pop -ups.", "label": ["Policy Change", "Important"], "rewrite": "For major changes, we will show you the guidelines after the change in a more significant way."}
{"task": "rw_1.jsonl", "id": 36961, "text": "The aforementioned major changes include but are not limited to:", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36962, "text": "(1) Our service model has changed significantly.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36963, "text": "Such as the purpose of processing personal information, the type of personal information processed, the way of using personal information, etc.;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36964, "text": "(2) We have changed significantly in control and other aspects.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36965, "text": "Change information controller caused by mergers and acquisitions and reorganizations;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36966, "text": "(3) The main object of personal information sharing, transfer or public disclosure changes;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36967, "text": "(4) The right to participate in personal information processing and its exercise methods have changed significantly;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36968, "text": "(5) We are responsible for handling the responsibility departments, contact methods and complaint channels for handling personal information security;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36969, "text": "(6) Others may have a significant impact on your personal information rights and interests.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36970, "text": "You can click on the \"historical version\" of this policy to consult the old version.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36971, "text": "Nine, how to contact us", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36972, "text": "You can contact us through the following ways. We will reply to your request within 15 working days:", "label": ["Important", "Contact Information"], "rewrite": "You can contact us through the following ways. We will reply to your request within 15 working days:"}
{"task": "rw_1.jsonl", "id": 36973, "text": "(1) If you have any questions, opinions or suggestions on the content of this privacy policy, you can contact us through: cn-provision@service.cainiao.com;", "label": ["Important", "Contact Information"], "rewrite": "You can contact us through: cn-provision@service.cainiao.com."}
{"task": "rw_1.jsonl", "id": 36974, "text": "(2) We have also set up a full-time department for personal information protection. You can use it: cn- partision@service.cainiao.com to contact it (please indicate that it is related to the Cainiao APP and explain the specific facts), office address: Hangzhou CityXixi, No. 588 West Road, Xihu District, the first B1-2 Eighth Floor legal service desk.", "label": ["Important", "Contact Information"], "rewrite": "Personal information protection full-time department: cn-partision@service.cainiao.com (please indicate related to the Cainiao APP and explain the specific facts), office address: No. 588 West West Road, Wenyi West Road, Xihu District, Hangzhou CityBuilding legal service desk."}
{"task": "rw_1.jsonl", "id": 36975, "text": "It should be noted that we may not reply to the issue of privacy policy or your personal information right.", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36976, "text": "(3) If you are not satisfied with our reply, especially if you think our personal information processing behavior has harm your legitimate rights and interests, you can also seek solutions by filed a lawsuit to a court with jurisdiction in the place of residence in the defendant.", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36977, "text": "Appendix: Related Definition", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36978, "text": "Cainiao APP service provider: Hangzhou Cainiao Logistics Information Technology Co., Ltd. provides Internet information services for Cainiao APP, Zhejiang Cainiao Supply Chain Management Co., Ltd. provides software technology services for Cainiao APP.", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36979, "text": "Hangzhou Cainiao Logistics Information Technology Co., Ltd. and Zhejiang Cainiao Supply Chain Management Co., Ltd. are collectively referred to as \"us\".", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36980, "text": "Related company: Refers to the related company of the rookie APP service provider disclosed by Alibaba Group Holding Limited (Alibaba Group Holding Limited).", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36981, "text": "Personal information: Refers to the various information that can be recorded alone or with other information with other information alone or with other information.", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36982, "text": "Personal sensitive information: Refers to personal information including identity documents, personal biometric information, bank accounts, property information, whereabouts, trading information, under 14 years of age (inclusive) children's information (we will be specific in the guidance of privacy protection. Personal sensitive information is marked with a significant line with a thorough line).", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36983, "text": "Personal information deletion: Refers to removing personal information in a system involved in daily business functions, so that it keeps them from being retrieved and accessed.", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36984, "text": "Minor: Refers to a natural person under the age of 18.", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36985, "text": "Equipment information: Including device identifier (IMEI, IDFA, Android ID, Mac, OAID, IMSI, SIM serial number, device sequence number and other device -related information), application informationProcess information and other application related information during operation), equipment parameters and system information (device type, equipment model, operating system and hardware -related information), device network environment information (IP address, WIFI information, base station information and other network -related information)Essence", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36986, "text": "The actual collection of the product shall prevail.", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36987, "text": "In addition to another agreement, the definition used in this guideline has the same meaning as the definition in the Cainiao Network Service Agreement.", "label": [], "rewrite": []}
{"task": "rw_1.jsonl", "id": 36988, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
