{"task": "rw_101.jsonl", "id": 71078, "text": "Thunder game user privacy policy", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71079, "text": "Release time: October 08, 2021", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71080, "text": "Effective time: October 08, 2021", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71081, "text": "You are welcome to choose from Shenzhen Thunder Information Technology Co., Ltd. and affiliated company (hereinafter referred to as \"Thunder Company\" or \"Us\", Shenzhen Thunder Information Technology Co., Ltd.'s registration address is Shenzhen Qianhai Shenzhen Port Cooperation Zone Linhai Avenue Center Port BuildingThe 610-E35, the contact information of personal information protection is: GMService@leiting.com) provided by this game.", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71082, "text": "In accordance with the \"Cyber Security Law of the People's Republic of China\", \"Information Security Technology Personal Information Security Standards\" and other relevant laws and regulations and technical specifications, the Thunder Company updated the \"Thunder Game User Privacy Policy\" (hereinafter referred to as \"Privacy Policy\")related information.", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71083, "text": "If you have any objections or doubts about the content of this \"Privacy Policy\", you can contact us through Article 9 of the Privacy Policy.", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71084, "text": "preface", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71085, "text": "Please read this \"Privacy Policy\" carefully before using/continue to use this game, especially the black bold clauses (minors should read with their legal guardians).", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71086, "text": "If you do not agree with this policy, it may cause this game to be unable to run normally or to achieve the service effect we are going to achieve, you should stop using this game.", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71087, "text": "If you checked \"agreeing and entering\" in the pop -up window, it means that you fully understand and agree with all the contents of the \"Privacy Policy\".", "label": ["Policy Change", "Important"], "rewrite": "If \"agreeing and entering\" in the pop -up window, it means fully understanding and agreeing with all the contents of the \"Privacy Policy\"."}
{"task": "rw_101.jsonl", "id": 71088, "text": "This policy will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71089, "text": "1. Personal information we may collect", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71090, "text": "2. How do we use your personal information", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71091, "text": "3. How do we store and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71092, "text": "4. How do we provide information outside", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71093, "text": "5. How do we use cookies and related technologies", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71094, "text": "6. How do we protect the rights and interests of minors", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71095, "text": "7. The control of your personal information", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71096, "text": "8. How to update this \"Privacy Policy\"", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71097, "text": "Nine, contact information", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71098, "text": "1. Personal information we may collect", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71099, "text": "When you use this game, we may need to collect and use some of your personal information. The personal information we collect and use includes two types: the first: the core function of this game.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71100, "text": "This kind of information is a must -have information for the normal operation of this game;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71101, "text": "Second: information that may be collected in this game's additional business functions.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71102, "text": "This type of information is used to support the additional functions you want to experience in the game. If you refuse to provide it, it will cause specific additional functions to be unable to achieve or achieve the effect we are going to achieve, but it will not affect the normal use of the core function of this game in this game.Essence", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If you refuse to provide information, it will cause specific additional functions to be unreasonable, but it will not affect the normal use of the core function of this game."}
{"task": "rw_101.jsonl", "id": 71103, "text": "We need to remind you in particular: In this game, in order to provide you with more comprehensive services, a third -party SDK or similar applications are embedded in the game. Therefore, third -party SDK or similar applications may also collect yourpersonal information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Third -party SDK or similar applications may collect your personal information."}
{"task": "rw_101.jsonl", "id": 71104, "text": "For details, please refer to Annex 1: \"Third -Party SDK and Similar Application\".", "label": ["Important", "First Party Collection Information"], "rewrite": "For details, please refer to Annex 1: \"Third -Party SDK and Similar Application\"."}
{"task": "rw_101.jsonl", "id": 71105, "text": "In addition, you understand and agree, and we hope that the products and services that you are provided to you are perfect, so we will continue to improve our products and services, which means that we may often launch new business functions, and may need to be collected.New personal information or change of personal information use purpose or method.", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71106, "text": "If a function that needs to collect your personal information is not explained in this \"Privacy Policy\", we will explain to you the purpose, content, content, content, content, content, content, content, content, content, content, content, and content of the \"Privacy Policy\" and pop -up windows.If you use it, you can choose whether you agree, and we will only collect relevant information after obtaining your consent.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will explain to you the purpose, content, usage methods and scope of the collection of the information by updating this \"Privacy Policy\" and pop -up window. You can choose whether you agree with your own consent.Essence"}
{"task": "rw_101.jsonl", "id": 71107, "text": "◆ When you run this game, in order to meet the relevant laws, regulations, policies and the needs of relevant competent authorities, ensure the authenticity of the user's identity, and realize the risk control, ensure system and service security such as anti -fraud, you need to certify the real -name.", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71108, "text": "We will collect your real -name identity information (including name, ID number, mobile phone number) when you get your consent or proactively provided.", "label": ["Important", "First Party Collection Information"], "rewrite": "With the consent or proactive provision, collect your real name information (including name, ID number, mobile phone number)."}
{"task": "rw_101.jsonl", "id": 71109, "text": "You should know that real -name identity information is sensitive information, please consider whether to provide it.", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71110, "text": "We will also treat and deal with your real -name identity information (including high -intensity encryption protection).", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71111, "text": "Refusing to provide real -name identity information may cause you to be unable to use this game.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Refusing to provide real -name identity information may cause you to be unable to use this game."}
{"task": "rw_101.jsonl", "id": 71112, "text": "◆ When you run this game, we need to collect the equipment information you use, including: the only device identification symbol (IMEI), MAC address, advertising identifier, Serial, device models, equipment names, operating systems and versions, and versions, and versions, and versions, and versions, and versions, and versions, and versions, and versions, and versions, and versions, and versions, and versions, and versions, and versions, and versions, and versions, and versions of versions, and versions of versions, and versions, and versions of versions.Equipment resolution, equipment settings, software installation lists, software and hardware feature information, device screen size, mobile network information, login IP address, log information, CPU information, software information.", "label": ["Important", "First Party Collection Information"], "rewrite": "You need to collect the equipment information you use, including: the only device recognition symbol (IMEI), MAC address, advertising identifier, Serial, device models, equipment names, operating systems and versions, equipment resolution, equipment settings, software installation lists, Software and hardware feature information, device screen size, mobile network information, login IP address, log information, CPU information, software information."}
{"task": "rw_101.jsonl", "id": 71113, "text": "It is used to identify the abnormal state of the account, understand the product adaptability, maintain the normal operation of basic functions, and realize the problem of this game.", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71114, "text": "In order to collect the above basic personal equipment information, we will apply for access to your equipment information authority. We collect this information to provide you with the core game function of this game.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "Will apply for access to your device information authority."}
{"task": "rw_101.jsonl", "id": 71115, "text": "◆ When you run this game, we will need to obtain your storage authority to enable the application to cache and read the necessary cache and read game resources during runtime.", "label": ["Permission Acquisition", "Important"], "rewrite": "You need to obtain your storage permissions for applications to cache and read the necessary cache and read game resources during runtime."}
{"task": "rw_101.jsonl", "id": 71116, "text": "The opening of the storage authority is to provide you with the core function of this game.", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71117, "text": "◆ When you use the Thunder account registration function, you need to complete a series of registration procedures according to our guidance.", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71118, "text": "In this process, you need to provide us with the following information: the matching result of the mobile phone number and the verification code.", "label": ["Important", "First Party Collection Information"], "rewrite": "You need to provide us with the following information: mobile phone number, verification code matching result."}
{"task": "rw_101.jsonl", "id": 71119, "text": "We collect this information to complete the Thunder account registration program, provide services for you to continuously stable, and protect your account security.", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71120, "text": "You should know that the matching result of the mobile phone number and verification code belongs to your personal sensitive information, please consider whether to provide it.", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71121, "text": "We will also treat and carefully handle your mobile phone number and SMS information (including high -intensity encryption protection).", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71122, "text": "We collected this type of information are based on laws and regulations. If you refuse to provide it, it may cause you to be unable to register a Thunder account.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If you refuse to provide information, it may cause you to register a Thunder account."}
{"task": "rw_101.jsonl", "id": 71123, "text": "But you can still enter the game as a tourist.", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71124, "text": "If you enter the game through the channel area, you can also register and log in to the channel account.", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71125, "text": "Personal information protection of channel accounts is responsible for third -party channels and is not subject to this \"Privacy Policy\". For details, please refer to the end of the article: \"third -party SDK and similar application description\".", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For details, please refer to the end of the article: \"Third -Party SDK and Similar Application\"."}
{"task": "rw_101.jsonl", "id": 71126, "text": "◆ When you interact with players in the same region in this game, we may need to obtain your vague geographical information or precise geographical location information (hereinafter referred to as \"geographical information\") to find nearby gamers in orderYou match with nearby players, teams, etc.", "label": ["Important", "First Party Collection Information"], "rewrite": "You need to collect your vague geographical information or precise geographical location information (hereinafter referred to as \"geographical information\") to find nearby gamers."}
{"task": "rw_101.jsonl", "id": 71127, "text": "Geographical location information belongs to your personal sensitive information, please consider whether to authorize.", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71128, "text": "We will also treat and carefully handle your location information (including high -intensity encryption protection).", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71129, "text": "Rejecting to provide this information will only cause you to be unable to interact with nearby gamers, but it does not affect other functions of your normal use of this game. You can also cancel your geographical location authority at any time.", "label": ["Risk", "Edit/Control", "First Party Collection Information", "Important"], "rewrite": "Refusing to provide this information can only cause it to be unable to interact with nearby gamers, but it does not affect other functions of the normal use of this game. You can cancel the geographical location authority at any time."}
{"task": "rw_101.jsonl", "id": 71130, "text": "When you cancel the authorization, we will no longer collect your geographical information, nor can you provide you with the above -mentioned services;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "After the authorization is canceled, you will no longer collect your geographical location information, and you can no longer provide you with the above -mentioned services."}
{"task": "rw_101.jsonl", "id": 71131, "text": "But unless you delete your personal information in accordance with the law, your cancellation behavior will not affect the processing and storage of our personal information based on your previous authorization.", "label": ["Permission Acquisition", "Edit/Control", "Risk", "Important"], "rewrite": "Unless you delete personal information in accordance with the law, cancellation will not affect the processing and storage of personal information based on your previous authorization."}
{"task": "rw_101.jsonl", "id": 71132, "text": "◆ When you use the camera and drawing function in this game, we may need to obtain your camera permissions. IOS devices may also obtain album permissions and photo permissions. Collect the picture information you provided. Refusal to provide the above information will only make the above information only make it only enableYou cannot use this feature, but it does not affect your normal experience of this game.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Risk"], "rewrite": "You may need to obtain your camera permissions. IOS devices may also obtain album permissions and photo permissions to collect the picture information you provided."}
{"task": "rw_101.jsonl", "id": 71133, "text": "You can also cancel your camera authority at any time;", "label": ["Edit/Control", "Important"], "rewrite": "You can also cancel your camera authority at any time."}
{"task": "rw_101.jsonl", "id": 71134, "text": "When you cancel the authorization, we will no longer collect the information, and we will no longer provide you with the above -mentioned services;", "label": ["Risk", "Edit/Control", "First Party Collection Information", "Important"], "rewrite": "After the authorization is canceled, the information will no longer be collected, and it will no longer provide you with the above -mentioned services."}
{"task": "rw_101.jsonl", "id": 71135, "text": "But unless you delete your personal information in accordance with the law, your cancellation behavior will not affect the processing and storage of our personal information based on your previous authorization.", "label": ["Permission Acquisition", "Edit/Control", "Risk", "Important"], "rewrite": "Unless deleting personal information in accordance with the law, cancellation will not affect the processing and storage of personal information we have authorized based on your previous authorization."}
{"task": "rw_101.jsonl", "id": 71136, "text": "◆ When you use the voice function in this game, we will need to obtain your device microphone rights and collect your voice information to provide social functional services in the form of voice.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "You need to obtain your equipment microphone permission and collect voice information to provide social functional services in voice form."}
{"task": "rw_101.jsonl", "id": 71137, "text": "Refusing to provide this information will only make you unable to use this function, but it does not affect the other functions of this game normally.", "label": ["Important", "First Party Collection Information"], "rewrite": "Refusing to provide this information will only make you unable to use this function, but it does not affect the other functions of this game normally."}
{"task": "rw_101.jsonl", "id": 71138, "text": "You can also cancel your microphone authority at any time;", "label": ["Important", "Edit/Control"], "rewrite": "You can also cancel your microphone authority at any time."}
{"task": "rw_101.jsonl", "id": 71139, "text": "When you cancel the authorization, we will no longer collect the information, and we will no longer provide you with the above -mentioned services;", "label": ["Risk", "Edit/Control", "First Party Collection Information", "Important"], "rewrite": "After the authorization is canceled, the information will no longer be collected, and it will no longer provide you with the above -mentioned services."}
{"task": "rw_101.jsonl", "id": 71140, "text": "But unless you delete your personal information in accordance with the law, your cancellation behavior will not affect the processing and storage of our personal information based on your previous authorization.", "label": ["Permission Acquisition", "Edit/Control", "Risk", "Important"], "rewrite": "Unless you delete personal information in accordance with the law, your cancellation behavior will not affect the processing and storage of our personal information based on authorization."}
{"task": "rw_101.jsonl", "id": 71141, "text": "◆ When you use the consumption function of this game, we will collect your recharge records and consumer records so that you can check your transaction information while protecting your virtual items to the greatest extent.", "label": ["Important", "First Party Collection Information"], "rewrite": "Will collect your recharge records and consumption records in order to query your transaction information."}
{"task": "rw_101.jsonl", "id": 71142, "text": "The recharge record and consumption record are sensitive information. Collecting the above information is necessary to achieve the consumption function of this game, otherwise you will not be able to complete the transaction.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting the above information is necessary to achieve the consumption function of this game, otherwise you will not be able to complete the transaction."}
{"task": "rw_101.jsonl", "id": 71143, "text": "◆ In order to ensure your account security and transaction information security, when you conduct virtual items in the market and Jubaozhai, the third -party face recognition plug -in we connect toApplication instructions \") may collect your facial recognition features.", "label": ["Important", "First Party Collection Information"], "rewrite": "Third -party face recognition plug -in (see attachment 1 for details: \"Third -party SDK and similar applications instructions\") will may collect your facial recognition characteristics."}
{"task": "rw_101.jsonl", "id": 71144, "text": "You should know that facial recognition characteristics are personal sensitive information, please consider whether to authorize.", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71145, "text": "We will also strictly monitor third -party plug -ins.", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71146, "text": "Related verification data for face recognition is only used to compare with the authoritative data platform of Public Security after encryption.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "Related verification data for face recognition is only used to compare with the authoritative data platform of Public Security after encryption."}
{"task": "rw_101.jsonl", "id": 71147, "text": "Please know and understand that in order to prevent criminals from using your real -name authentication account to engage in illegal activities to ensure your account and transaction information security, you need to perform face recognition again after you change the device.", "label": ["Important"], "rewrite": "You need to perform face recognition again after you change the device."}
{"task": "rw_101.jsonl", "id": 71148, "text": "Refusing to provide this information will only cause you to achieve the function of the virtual item trading function of this product, but it does not affect the other functions of your normal use of the game.", "label": ["Important", "First Party Collection Information"], "rewrite": "Refusing to provide this information can only cause the unable to realize the function of virtual items, but does not affect other functions of the game normally."}
{"task": "rw_101.jsonl", "id": 71149, "text": "◆ When you use the customer service function in the game, the third -party customer service SDK will start and may collect your equipment information, soliciting your microphone permission, camera permissions, albums, or photo authorization (see attachment 1 for details: see Attachment 1:\"Third -party SDK and similar application descriptions\").", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "The third -party customer service SDK will start and may collect your equipment information, soliciting your microphone permission, camera permissions, album permissions, or photo authorization (see Annex 1: \"Third -Party SDK and Similar Apps\")."}
{"task": "rw_101.jsonl", "id": 71150, "text": "For your account and system security, optimize the quality of service, we may contact your personal information from a third -party customer service SDK and indirectly collect your personal information, including your device information and the content of the communication with your customer service (including text, pictures, audio and video, callsRecord form).", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "It may be contacted from third -party customer service SDK and indirectly collect personal information, including your device information and the content of communication with your customer service (including text, pictures, audio and video, call records)."}
{"task": "rw_101.jsonl", "id": 71151, "text": "Please know and understand that if you involve account numbers or personal sensitive issues involving customer service, we may ask you to provide personal sensitive information (including mobile phone numbers and ID numbers) to verify the real -name authentication information with the account, judge the judgmentYour true identity;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "We may ask you to provide personal sensitive information (including mobile phone numbers and ID numbers) for verification information with the real -name authentication information of the account number."}
{"task": "rw_101.jsonl", "id": 71152, "text": "The above -mentioned sensitive information is only used for verification, and customer service will not be retained.", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71153, "text": "◆, you understand and agree that when you are Android users, some single services may need to obtain specific permissions in your device to achieve the collection and use of information involved in these permissions, as follows:", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "Some single -item services may need to obtain specific permissions in your device to achieve the collection and use of information involved in these permissions."}
{"task": "rw_101.jsonl", "id": 71154, "text": "(1), we will obtain your Get_Tasks (device running process information) permissions in order to detect some characteristics and individual characteristics of the simulator to push the awakening function;", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "Will get your get_tasks (device running process information) permissions."}
{"task": "rw_101.jsonl", "id": 71155, "text": "(2), we will obtain your suspension windows authority to verify the problems of the game crash and report errors;", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "Will obtain your suspended window authority to verify the problems such as the collapse of the game."}
{"task": "rw_101.jsonl", "id": 71156, "text": "(3), we will get your package_usage_stats (application process information) in order to detect the plug -in process;", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "You will get your package_usage_stats to detect the plug -in process."}
{"task": "rw_101.jsonl", "id": 71157, "text": "(4), we will obtain your Read_logs permissions in order to read the application yourself, logcat, log, and investigate the abnormal collapse of the game when the application collapse;", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "Read_logs (log information) permissions will be obtained in order to read the application of your own logcat log when applying the collapse."}
{"task": "rw_101.jsonl", "id": 71158, "text": "◆ According to relevant laws and regulations and national standards, in the following situations, we may collect and use your relevant personal information without asking for your authorization consent:", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "In the following circumstances, you may collect and use your relevant personal information without asking your authorization consent:"}
{"task": "rw_101.jsonl", "id": 71159, "text": "1., directly related to national interests such as national security and national defense security;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect personal information directly related to national interests such as national security and national defense security without agreeing."}
{"task": "rw_101.jsonl", "id": 71160, "text": "Directly related to the major public interests such as public safety, public health, and public knowledge;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect personal information directly related to public safety, public health, and public interest, and do not need to agree."}
{"task": "rw_101.jsonl", "id": 71161, "text": "2. Directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect direct personal information related to criminal investigation, prosecution, trial, and execution of judgments, and there is no need to agree."}
{"task": "rw_101.jsonl", "id": 71162, "text": "3. For major legitimate rights and interests such as maintaining the lives, property, and reputation of users or other individuals, it is difficult to get my consent;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting and maintaining major legitimate rights and interests, but it is difficult to get personal information that I agree, no need to agree."}
{"task": "rw_101.jsonl", "id": 71163, "text": "4. The collected personal information is made by the user to the public by itself;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "The collected personal information is disclosed by the user to the public and does not need to agree."}
{"task": "rw_101.jsonl", "id": 71164, "text": "5. Collect personal information from the information disclosed by legitimately publicly disclosed, such as legal news reports and government information disclosure;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If you collect personal information from the legal disclosure information, you don't need to agree."}
{"task": "rw_101.jsonl", "id": 71165, "text": "6. Sign and perform the contract according to user requirements;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting the personal information necessary for signing and fulfilling the contract according to the user's requirements, no consent is required."}
{"task": "rw_101.jsonl", "id": 71166, "text": "7. The necessary and stable operation of the products or services provided by maintaining it, such as the failure of discovering and disposing of products or services;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting the personal information necessary for the safe and stable operation of the product or service, there is no need to agree."}
{"task": "rw_101.jsonl", "id": 71167, "text": "8. What is necessary for carrying out legal news reports;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting the necessary personal information for legal news reports does not need to agree."}
{"task": "rw_101.jsonl", "id": 71168, "text": "9. Due to the need to carry out statistics or academic research in public interests, and the results of academic research or descriptions, the personal information contained in the results is identified;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "It is not necessary to agree to the personal information of statistics or academic research in the institute of statistics or academic research."}
{"task": "rw_101.jsonl", "id": 71169, "text": "10. What is related to the obligations stipulated in the performance of laws and regulations to fulfill the law and regulations of the Thunder Company;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting personal information related to the obligations stipulated in the implementation of laws and regulations in the performance of the Thunder Company without agreeing."}
{"task": "rw_101.jsonl", "id": 71170, "text": "11. Other circumstances stipulated in laws and regulations.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect personal information under other circumstances stipulated in laws and regulations, no need to agree."}
{"task": "rw_101.jsonl", "id": 71171, "text": "2. How can we use your personal information", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71172, "text": "We will strictly abide by the provisions of laws and regulations and the agreement with you, in accordance with the information collected by this \"Privacy Policy\" and \"Thunder Game Use License and User Agreement\".", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71173, "text": "(1) Use of information use rules", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71174, "text": "We will use the first collection of information collected by this \"Privacy Policy\" in accordance with the following rules:", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71175, "text": "1. We will provide you with various functions and services based on the collected information, including basic game functions, player interactive functions, consumption functions, execution software verification, execution software upgrades, network synchronization, etc.;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71176, "text": "2. We will analyze the operation of this game based on the frequency and situation of Thunder's products, fault information, performance information, etc. to ensure the security of the service, optimize our products, and improve our service quality.", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71177, "text": "We will not combine the information stored in the analysis software with the personal identity information you provide.", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71178, "text": "(2) Changes in information use rules and re -agree", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71179, "text": "We will use the collected information in the purpose covered by this \"Privacy Policy\".", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71180, "text": "If the scope of your personal information we intends to use is beyond the scope of this \"Privacy Policy\", we will modify the content of this \"Privacy Policy\" before collecting your personal information, and to timely in time through pop -up windows, push notifications, etc.You inform and get your explicit consent again.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The scope of personal information that is proposed exceeds the scope of this \"Privacy Policy\". Before collecting personal information, it will modify the content of this \"Privacy Policy\", and inform you in a timely manner through pop -up window, push notification, etc., and obtain it again.Express consent."}
{"task": "rw_101.jsonl", "id": 71181, "text": "3. How do we store and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71182, "text": "(1) Storage of personal information", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71183, "text": "1. Method and period of information storage", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71184, "text": "We will store your information in a safe way, including local storage (such as using APP for data cache), database and server logs.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "Store your information in a secure way, including local storage (such as using APP for data cache), database and server logs."}
{"task": "rw_101.jsonl", "id": 71185, "text": "We will only store your personal information within the time necessary for the purpose of service to achieve service purposes or under the conditions of laws and regulations.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "It will only store your personal information within the time necessary for the purpose of service to achieve service purposes or under the conditions of laws and regulations."}
{"task": "rw_101.jsonl", "id": 71186, "text": "Unless the law has other regulations or you ask for requests in accordance with this \"Privacy Policy\", we will save your personal information during the game operation.", "label": ["Data Retention", "Important"], "rewrite": "We will save your personal information during the game operation, unless there are other regulations."}
{"task": "rw_101.jsonl", "id": 71187, "text": "2. The area of information storage", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71188, "text": "We will store your personal information in China in accordance with laws and regulations.", "label": ["Data Retention", "Important"], "rewrite": "We will store your personal information in China in accordance with laws and regulations."}
{"task": "rw_101.jsonl", "id": 71189, "text": "3. Delete of information", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71190, "text": "When this game stops operation or does not save your information based on this \"Privacy Policy\", the electronic files that store personal information will be permanently deleted, and we will take reasonable measures to ensure that personal information cannot be restored.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "When this game stops operation or does not save your information according to this \"Privacy Policy\", the electronic files that store personal information will be permanently deleted, and reasonable measures will be taken to ensure that personal information cannot be recovered."}
{"task": "rw_101.jsonl", "id": 71191, "text": "If we should continue to save your personal information according to law, this part of personal information will also be isolated from other types of information.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "If we should continue to save your personal information according to law, this part of personal information will also be isolated from other types of information."}
{"task": "rw_101.jsonl", "id": 71192, "text": "(2) Protection of personal information", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71193, "text": "1. Information security", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71194, "text": "Under existing equipment and technical conditions, we have always actively adopted reasonable measures such as technical and management to ensure the security of your account and personal information;", "label": ["Important", "Data Security"], "rewrite": "We have always actively adopted reasonable measures such as technology and management to ensure the security of your account and personal information."}
{"task": "rw_101.jsonl", "id": 71195, "text": "We will use the collected information in good faith, take various effective and necessary measures to protect your privacy and security, and use a business and reasonable security technical measures to protect your privacy from unauthorized access, use or leakage.", "label": ["Important", "Data Security"], "rewrite": "Protect your privacy security and use reasonable security technical measures to protect your privacy from unauthorized access, use or leakage."}
{"task": "rw_101.jsonl", "id": 71196, "text": "At present, we have adopted the industry's leading technical protection measures.", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71197, "text": "The technical means we use include but not limited to firewalls, encryption (such as SSL), de -identification or anonymous treatment, access control measures (fortress machines, secondary verification, etc.).", "label": ["Important", "Data Security"], "rewrite": "The technical means used include but not limited to firewalls, encryption (such as SSL), de -identification or anonymous treatment, access control measures (fortress machines, secondary verification, etc.)."}
{"task": "rw_101.jsonl", "id": 71198, "text": "We have established a special management system, process and organization that guarantees personal information security.", "label": ["Important", "Data Security"], "rewrite": "Establish a special management system, process and organization that guarantees personal information security."}
{"task": "rw_101.jsonl", "id": 71199, "text": "We only allow the Thunder employees to know this information to visit your personal information and set up strict access to control and monitoring mechanisms for this.", "label": ["Important", "Data Security"], "rewrite": "Thunder employees who are only necessary to know about this information can access your personal information and set up strict access to control and monitoring mechanisms for this."}
{"task": "rw_101.jsonl", "id": 71200, "text": "We also require all personnel who may contact your information to fulfill the corresponding confidentiality obligations.", "label": ["Important", "Data Security"], "rewrite": "At the same time, all personnel who may be exposed to your information fulfill the corresponding confidentiality obligations."}
{"task": "rw_101.jsonl", "id": 71201, "text": "If we fail to fulfill these obligations, we will investigate its legal responsibilities.", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71202, "text": "2. Information security incident disposal measures", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71203, "text": "If personal information leaks and other security incidents occur, we will start emergency plans to prevent security incidents from expanding.", "label": ["Important", "Data Security"], "rewrite": "If personal information leaks and other security incidents occur, we will start emergency plans to prevent security incidents from expanding."}
{"task": "rw_101.jsonl", "id": 71204, "text": "If information security incidents occur, we will inform you the basic situation of the security incident in the form of announcement, push notification or email, the disposal measures and remedial measures we are about to adopt or we have already taken, and our proposal to your response.", "label": ["Important", "Data Security"], "rewrite": "If an information security incident occurs, we will inform you the basic situation of the security incident, the disposal measures and remedial measures we are about to adopt or we have already taken, and our proposal to your response."}
{"task": "rw_101.jsonl", "id": 71205, "text": "If it is difficult to achieve one by one, we will issue warnings through announcement and other methods.", "label": ["Important", "Data Security"], "rewrite": "If it is difficult to achieve one by one, we will issue warnings through announcement and other methods."}
{"task": "rw_101.jsonl", "id": 71206, "text": "4. How do we provide information outside", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71207, "text": "Except for the situation stipulated in the \"Privacy Policy\" and \"Thunder Game Use License and User Agreement\", we will not take the initiative to share, provide or transfer your personal information to a third party.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Except for the situation stipulated in the \"Privacy Policy\" and \"Thunder Game Use License and User Agreement\", they will not actively share, provide or transfer your personal information to third parties."}
{"task": "rw_101.jsonl", "id": 71208, "text": "If there are other sharing, providing or transferring your personal information, or you ask us to share, provide or transfer or transfer your personal information to a third party outside us, we will directly confirm to you and obtain your explicit consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If there is a sharing situation, we will directly confirm with you and obtain your explicit consent."}
{"task": "rw_101.jsonl", "id": 71209, "text": "According to relevant laws and regulations and national standards, in the following circumstances, we will share, transfer, and openly disclose your specific personal information on the premise that we will not obtain your authorization consent in advance:", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "In the following circumstances, we will share, transfer, and publicly disclose your specific personal information on the premise that we will not obtain your authorization consent in advance:"}
{"task": "rw_101.jsonl", "id": 71210, "text": "1., related to the obligations stipulated in the implementation of laws and regulations of the Thunder Company;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Sharing, transfer, and disclosure of personal information related to the obligations stipulated in the implementation of laws and regulations by the Thunder Company without agreeing."}
{"task": "rw_101.jsonl", "id": 71211, "text": "2., directly related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Personal information that shared, transferred, and disclosed directly related to national security and national defense security does not need to agree."}
{"task": "rw_101.jsonl", "id": 71212, "text": "3. It is directly related to public safety, public health, and major public interests;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Personal information of sharing, transfer, disclosure directly related to public safety, public health, and major public interests does not need to agree."}
{"task": "rw_101.jsonl", "id": 71213, "text": "4. Directly related to criminal investigation, prosecution, trial and judgment execution;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Direct related personal information such as sharing, transfer, disclosure is directly related to criminal investigation, prosecution, trial and judgment execution, and no consent is required."}
{"task": "rw_101.jsonl", "id": 71214, "text": "5. For the major legitimate rights and interests of the lives and property of users or other individuals, it is difficult to obtain the consent of my authorization;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Sharing, transfer, disclosure and maintenance major legitimate rights and interests, but it is difficult to get personal information that I have authorized, no need to agree."}
{"task": "rw_101.jsonl", "id": 71215, "text": "6. Personal information that users disclose to the public by themselves;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Share, transfer, and disclose personal information that users disclose to the public by themselves without agreeing."}
{"task": "rw_101.jsonl", "id": 71216, "text": "7. Collect personal information from the information disclosed by legal and publicly disclosed, such as legal news reports and government information disclosure;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "If you collect personal information from the legal disclosure information, you don't need to agree."}
{"task": "rw_101.jsonl", "id": 71217, "text": "8. Written authorized by your own (or the guardian of the minor) or authorize us to authorize us in accordance with the written request of your own (or the guardian of the minor);", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "If you authorize us (or guardian of minors) to authorize or authorize us to disclose or authorize the written request of your own (or juvenile guardian), we don't need to agree."}
{"task": "rw_101.jsonl", "id": 71218, "text": "9. Relevant laws require us to disclose.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "If the law requires us to disclose, there is no need to agree."}
{"task": "rw_101.jsonl", "id": 71219, "text": "5. How do we use cookies and related technologies", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71220, "text": "Cookies is a neutral technology that allows website server to store data on the client or read data from the client.", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71221, "text": "To optimize your experience, we will use cookies or similar technologies (for example: Web, Beacons, Log, Files, Scripts, ETAGS) (hereinafter collectively referred to as \"Cookies\" technology).", "label": ["Important", "First Party Collection Information"], "rewrite": "We will use cookies or similar technologies (for example: Web Beacons, Log Files, Scrips, ETAGS) (hereinafter collectively referred to as \"Cookies\" technology)."}
{"task": "rw_101.jsonl", "id": 71222, "text": "Cookies technology will generate small files in your device so that we can provide specific functions.", "label": ["Important", "First Party Collection Information"], "rewrite": "Cookies technology will generate small files in your device so that we can provide specific functions."}
{"task": "rw_101.jsonl", "id": 71223, "text": "You have the right to open or close cookies through the settings of equipment or browser.", "label": ["Important", "Edit/Control"], "rewrite": "You have the right to open or close cookies through the settings of equipment or browser."}
{"task": "rw_101.jsonl", "id": 71224, "text": "But when you choose to close the cookies technology, you may not experience some functions of our products.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "When you choose to close the cookies, you may not experience some functions of our products."}
{"task": "rw_101.jsonl", "id": 71225, "text": "6. How do we protect the rights and interests of minors", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71226, "text": "We attach great importance to the protection of personal information of minors and continue to explore the updated personal information protection methods of minors.", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71227, "text": "We will actively protect the legitimate rights and interests of minors by enabling the anti -addiction system in accordance with the requirements of national defense addiction policies.", "label": ["Specific Audiences", "Important"], "rewrite": "It will actively protect the legitimate rights and interests of minors by enabling the anti -addiction system in accordance with the requirements of national defense addiction."}
{"task": "rw_101.jsonl", "id": 71228, "text": "We will determine whether the real -name information of the relevant account is a minor through the real -name information verification, and then decide whether to incorporate this account into the anti -addiction system.", "label": ["Specific Audiences", "Important"], "rewrite": "The real -name information of the relevant account will be judged by the real -name information verification whether the real -name information of the relevant account is a minor, and then decide whether the account is included in the anti -addiction system."}
{"task": "rw_101.jsonl", "id": 71229, "text": "For the protection of minors' rights and interests, please refer to the \"Thunder Game Children's User Privacy Protection Policy\".", "label": ["Specific Audiences", "Important"], "rewrite": "For the protection of minors' rights and interests, please refer to the \"Thunder Game Children's User Privacy Protection Policy\"."}
{"task": "rw_101.jsonl", "id": 71230, "text": "If you are the legal guardian of the minor, please pay attention to whether the minors you are monitored use our services or provide personal information after obtaining your authorization consent.", "label": ["Specific Audiences", "Important"], "rewrite": "Please pay attention to whether the minors you are monitored use services or provide personal information after obtaining your authorization consent."}
{"task": "rw_101.jsonl", "id": 71231, "text": "If you have questions about the personal information of the minor you monitored, please contact us through the contact information of Article 9.", "label": ["Specific Audiences", "Important"], "rewrite": "If you have doubts about the personal information of the minors you monitor, please contact us through the contact information of Article 9."}
{"task": "rw_101.jsonl", "id": 71232, "text": "7. The right to manage personal information", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71233, "text": "You have multiple ways to control your personal information in this game, including: you can access, correct, and delete your personal information in this game (except for the prohibition of changes or deletion of the law of the People's Republic of China),Or get your personal information copy;", "label": ["Important", "Edit/Control"], "rewrite": "You have multiple ways to control personal information, including: you can access, correct, and delete your personal information in this game (except for information prohibiting changes or deletion of the law of the People's Republic of China), or obtain a copy of personal information."}
{"task": "rw_101.jsonl", "id": 71234, "text": "At the same time, you can also withdraw the authorization that has been agreed before;", "label": ["Important", "Edit/Control"], "rewrite": "At the same time, you can also withdraw the authorized authorization."}
{"task": "rw_101.jsonl", "id": 71235, "text": "Or log out your Thunder account and wipe out all your information in all the games of the Thunder.", "label": ["Important", "Edit/Control"], "rewrite": "You can cancel your Thunder account and erase all your information in all the games of the Thunder."}
{"task": "rw_101.jsonl", "id": 71236, "text": "Please know and understand that you can enter the game to enter the game for using a Thunder account:", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71237, "text": "1. If you have the needs of accessing, modifying, correcting, deleting your personal information in this game or obtaining your personal information copy, you can contact, gmservice@Leiting.com to handle it.", "label": ["Important", "Contact Information", "Edit/Control"], "rewrite": "If you have the needs of accessing, modifying, correcting, deleting personal information or obtaining a copy of personal information, you can contact gmservice@leiting.com for processing."}
{"task": "rw_101.jsonl", "id": 71238, "text": "2. If you have the need to cancel the Thunder account and erase your information in all the information of the Thunder, you can cancel the application platform (link:, https: //member.leiting.com/account_destroy,) to cancel it.", "label": ["Edit/Control", "Important"], "rewrite": "If you have the need to cancel the Thunder account and erase the information, you can cancel the application platform (link: https://member.leiting.com/account_destroy) on the account."}
{"task": "rw_101.jsonl", "id": 71239, "text": "Please know and understand that because your account may have a certain value, you can correct, delete personal information, withdraw personal information authorization, and cancel the Thunder account may require you to provide real -name identity information for identity test.", "label": ["Important", "First Party Collection Information", "Edit/Control"], "rewrite": "Correction, deleting personal information, withdrawing personal information authorization, and cancellation of the Thunder account may require you to provide real -name identity information for identity verification."}
{"task": "rw_101.jsonl", "id": 71240, "text": "After receiving the information, we will respond to your request within 15 working days, and we will delete the information collected in 2 working days.", "label": ["Important", "Edit/Control"], "rewrite": "After receiving the information, we will respond to the request within 15 working days, and the information collected above will be deleted within 2 working days."}
{"task": "rw_101.jsonl", "id": 71241, "text": "8. How to update this \"Privacy Policy\"", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71242, "text": "If business function changes, personal information outbound situation changes, changes in use, and changes in personal information protection and contact methods, we will make corresponding amendments to this \"Privacy Policy\", and inform you in a timely manner to inform you in a timely manner to inform youAnd re -obtain your consent. Only after you confirm and receive the change of the change, we will collect, use, handle, and store your personal information based on the change of \"Privacy Policy\";", "label": ["Policy Change", "Important"], "rewrite": "If the change occurs, the \"Privacy Policy\" will be revised accordingly, and will be told you in a timely manner to re -agree."}
{"task": "rw_101.jsonl", "id": 71243, "text": "If you do not agree with the change, you can choose to stop using our service.", "label": ["Policy Change", "Important"], "rewrite": "If you do not agree with the change, you can choose to stop using our service."}
{"task": "rw_101.jsonl", "id": 71244, "text": "Nine, contact information", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71245, "text": "If you have any questions, opinions or suggestions on the \"Privacy Policy\", or have any questions about the \"Privacy Policy\", or have any questions about our privacy measures, you can send emails to gmservice@leiting.com or write lettersMail to the following address:", "label": ["Important", "Contact Information"], "rewrite": "You can send mail to gmservice@leiting.com."}
{"task": "rw_101.jsonl", "id": 71246, "text": "Address: 17th Floor, Building 2, Building 2, Fourth Road, Longzhu Four Road, Longzhu, Nanshan District, Guangdong Province, China, Thunder Company, Ministry of Legal Affairs (closed)", "label": ["Important", "Contact Information"], "rewrite": "Write the mail to the following address: The 17th floor of the 17th floor of Building No. 2, No. 2, Building 2, Fourth Road, Longzhu, Shenzhen, Guangdong Province, China."}
{"task": "rw_101.jsonl", "id": 71247, "text": "Postcode: 518000", "label": ["Important", "Contact Information"], "rewrite": "Postal code: 518000."}
{"task": "rw_101.jsonl", "id": 71248, "text": "We will review the issues involved as soon as possible and reply within the fifteen working days when they receive the email.", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71249, "text": "Special reminder: This \"Privacy Policy\" is only applicable to this game user. This \"Privacy Policy\" is supplemented by the relevant game service agreement such as \"Thunder Game Use License and User Agreement\".What is inconsistent with this \"Privacy Policy\" is based on the \"Privacy Policy\".", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71250, "text": "Annex I:", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71251, "text": "Third -party SDK and similar application descriptions", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71252, "text": "To provide and optimize our services, this game may contain third -party SDK or other similar applications.", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71253, "text": "When you use the services provided by such third -party SDKs or similar applications in this game, you agree that you will directly collect and process your information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use this kind of third -party SDK, you agree to collect and process your information directly."}
{"task": "rw_101.jsonl", "id": 71254, "text": "Such SDKs or similar applications collect and process information to comply with their respective privacy policies, and do not apply to this \"Privacy Policy\".", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71255, "text": "We will strive to review the business access qualifications of such third -party SDKs and similar applications and strive to require their legitimate compliance and security.", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71256, "text": "In order to ensure your information security to the greatest extent, we strongly recommend that you check the privacy clauses of third -party SDKs and similar applications.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to ensure information security to the greatest extent, it is strongly recommended to check the privacy clauses of third -party SDKs and similar applications."}
{"task": "rw_101.jsonl", "id": 71257, "text": "In order to protect your legitimate rights and interests, if you find such SDKs or similar applications, there are risks in similar applications, it is recommended that you immediately terminate related operations and contact us in time.", "label": [], "rewrite": []}
{"task": "rw_101.jsonl", "id": 71258, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
