{"task": "rw_106.jsonl", "id": 72269, "text": "Thunder game user privacy policy", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72270, "text": "Effective time: July 1, 2020", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72271, "text": "You are welcome to choose from Shenzhen Thunder Information Technology Co., Ltd. and affiliated company (hereinafter referred to as \"Thunder Company\" or \"We\", Shenzhen Thunder Information Technology Co., Ltd.'s registered address is Shenzhen Qianhai Shenzhen Port Cooperation Zone Qianwan 1 Building ARoom (settled in Shenzhen Qianhai Business Secretary Co., Ltd.), the contact information about personal information protection is: gmservice@leiting.com).", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72272, "text": "The Thunder Company formulated the \"Thunder Game User Privacy Policy\" (hereinafter referred to as the \"Privacy Policy\") in accordance with the \"Cyber Security Law of the People's Republic of China\" and other relevant laws and regulations and technical specifications.related information.", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72273, "text": "If you have any objections or doubts about the content of this \"Privacy Policy\", you can contact us through Article 9 of the Privacy Policy.", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72274, "text": "preface", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72275, "text": "Please read this \"Privacy Policy\" carefully before using/continue to use this game, especially the black bold clauses (minors should read with their legal guardians).", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72276, "text": "If you do not agree with this policy, it may cause this game to be unable to run normally or to achieve the service effect we are going to achieve, you should stop using this game.", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72277, "text": "If you check \"Agree and Enter\" in the registered account program, it means that you fully understand and agree with all the contents of the \"Privacy Policy\".", "label": ["Policy Change", "Important"], "rewrite": "If you check \"consent and enter\" in the registered account program, it means fully understanding and agreeing with all the contents of the \"Privacy Policy\"."}
{"task": "rw_106.jsonl", "id": 72278, "text": "This policy will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72279, "text": "1. Personal information we may collect", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72280, "text": "2. How do we use your personal information", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72281, "text": "3. How do we store and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72282, "text": "4. How do we provide information outside", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72283, "text": "5. How do we use cookies and related technologies", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72284, "text": "6. How do we protect the rights and interests of minors", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72285, "text": "7. The control of your personal information", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72286, "text": "8. How to update this \"Privacy Policy\"", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72287, "text": "Nine, contact information", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72288, "text": "1. Personal information we may collect", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72289, "text": "When you use this game, we may need to collect and use some of your personal information. The personal information we collect and use includes two types: the first: the core function of this game.", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72290, "text": "This kind of information is a must -have information for the normal operation of this game. If you refuse to provide it, we will not be able to provide you with the core function of this game, which will cause you to be unable to use Thunder Games normally;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "This kind of information is a must -have information for the normal operation of this game. If it is refused, it will not be able to provide you with core functions, which will cause you to be unable to use Thunder Games normally."}
{"task": "rw_106.jsonl", "id": 72291, "text": "Second: information that may be collected in this game's additional business functions.", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72292, "text": "This type of information is used to support the additional functions you want to experience in the game. If you refuse to provide it, it will cause specific additional functions to be unable to achieve or achieve the effect we are going to achieve, but it will not affect the normal use of the core function of this game in this game.Essence", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If you refuse to provide information, it will cause specific additional functions to be unable to achieve or achieve effect, but it will not affect the normal use of core functions."}
{"task": "rw_106.jsonl", "id": 72293, "text": "We need to remind you in particular: In this game, in order to provide you with more comprehensive services, a third -party SDK or similar applications are embedded in the game. Therefore, third -party SDK or similar applications may also collect yourpersonal information.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Third -party SDK or similar applications are embedded in the game, and third -party SDK or similar applications may collect your personal information."}
{"task": "rw_106.jsonl", "id": 72294, "text": "For details, please refer to Annex 1: \"Third -Party SDK and Similar Application\".", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72295, "text": "In addition, you understand and agree, and we hope that the products and services that you are provided to you are perfect, so we will continue to improve our products and services, which means that we may often launch new business functions, and may need to be collected.New personal information or change of personal information use purpose or method.", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72296, "text": "If a function that needs to collect your personal information is not explained in this \"Privacy Policy\", we will explain to you the purpose, content, content, content, content, content, content, content, content, content, content, content, and content of the \"Privacy Policy\" and pop -up windows.If you use it, you can choose whether you agree, and we will only collect relevant information after obtaining your consent.", "label": ["Important", "First Party Collection Information"], "rewrite": "It will explain the purpose, content, usage methods, and scope of the collection of information by updating this \"Privacy Policy\" and pop -up windows. You can choose whether you agree to collect the relevant information after obtaining the consent."}
{"task": "rw_106.jsonl", "id": 72297, "text": "When you run this game, in order to meet the needs of relevant laws, regulations, policies and the needs of relevant competent authorities, ensure the authenticity of the user's identity, and realize the safety control of anti -fraud and other risk control systems and services, you need to perform real -name certification.", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72298, "text": "We will collect your real -name identity information (including name, ID number, mobile phone number) when you get your consent or proactively provided.", "label": ["Important", "First Party Collection Information"], "rewrite": "With the consent or proactive provision, collect your real name information (including name, ID number, mobile phone number)."}
{"task": "rw_106.jsonl", "id": 72299, "text": "You should know that real -name identity information is sensitive information, please consider whether to provide it.", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72300, "text": "We will also treat and carefully handle your real -name identity information (including high -intensity encryption protection, etc.).", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72301, "text": "Refusing to provide real -name identity information may cause you to be unable to use this game.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Refusing to provide real -name identity information may cause you to be unable to use this game."}
{"task": "rw_106.jsonl", "id": 72302, "text": "When you run this game, we need to collect the equipment information you use, including: the only device identification symbol, MAC address, Serial, device model, device name, operating system and version, device resolution, equipment settings, software and hardware, software and hardwareFeature information, device screen size, mobile network information, login IP address, log information (such as operation logs, service logs).", "label": ["Important", "First Party Collection Information"], "rewrite": "You need to collect the equipment information you use, including: the only device recognition symbol, MAC address, Serial, device model, device name, operating system and version, device resolution, equipment settings, software and hardware feature information, device screen size, movement, movementNetwork information, login IP address, log information (such as operation logs, service logs)."}
{"task": "rw_106.jsonl", "id": 72303, "text": "It is used to identify the abnormal state of the account, understand the product adaptability, maintain the normal operation of basic functions, and realize the problem of this game.", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72304, "text": "In order to collect the above basic personal equipment information, we will apply for access to your equipment information authority. We collect this information to provide you with the core game function of this game. If you refuse to authorize the above permissions, it will cause you to be unable to use this game.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Risk"], "rewrite": "I will apply for access to the equipment information authority. The collection of this information is to provide you with the core game function of this game. If you refuse to authorize the above permissions, the game will not be used."}
{"task": "rw_106.jsonl", "id": 72305, "text": "When you run this game, we need to obtain your storage authority to enable applications to cache and read the necessary cache and read game resources during runtime.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you run this game, we need to obtain your storage authority."}
{"task": "rw_106.jsonl", "id": 72306, "text": "The opening of the storage permissions is to provide you with the core function of this game. If you refuse to authorize the above permissions, it will cause you to be unable to use this game.", "label": ["Permission Acquisition", "Important", "Risk"], "rewrite": "The opening of the storage permissions is to provide the core function of this game. For example, the above permissions will be unable to use the above permissions."}
{"task": "rw_106.jsonl", "id": 72307, "text": "When you use a Thunder account registration function, you need to complete a series of registration procedures according to our guidance.", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72308, "text": "In this process, you need to provide us with the following information: the matching result of the mobile phone number and the verification code.", "label": ["Important", "First Party Collection Information"], "rewrite": "You need to provide us with the following information: mobile phone number, verification code matching result."}
{"task": "rw_106.jsonl", "id": 72309, "text": "We collect this information to complete the Leiting account registration process, provide you with continuous and stable services, and protect your account security.", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72310, "text": "You should know that the matching result of the mobile phone number and verification code belongs to your personal sensitive information, please consider whether to provide it.", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72311, "text": "We will also treat and carefully handle your mobile phone number and SMS information (including high -intensity encryption protection, etc.).", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72312, "text": "We collected this type of information are based on laws and regulations. If you refuse to provide it, it may cause you to be unable to register a Thunder account.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting this type of information is based on the requirements of laws and regulations. If it refuses to provide it, it may cause you to register a Thunder account."}
{"task": "rw_106.jsonl", "id": 72313, "text": "But you can still enter the game as a tourist.", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72314, "text": "If you enter the game through the channel area, you can also register and log in to the channel account.", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72315, "text": "Personal information protection of channel accounts is responsible for third -party channels and is not subject to this \"Privacy Policy\". For details, please refer to the end of the article: \"third -party SDK and similar application description\".", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Personal information protection of channel accounts is responsible for third -party channels and is not subject to this \"Privacy Policy\". For details, please refer to the end of the article: \"third -party SDK and similar application description\"."}
{"task": "rw_106.jsonl", "id": 72316, "text": "When you use the consumption function of this game, we will collect your recharge records and consumer records so that you can check your trading information while protecting your virtual items to the greatest extent.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect your recharge records and consumer records in order to query your transaction information."}
{"task": "rw_106.jsonl", "id": 72317, "text": "The recharge record and consumption record are sensitive information. Collecting the above information is necessary to achieve the consumption function of this game, otherwise you will not be able to complete the transaction.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "The recharge record and consumption record are sensitive information. Collecting the above information is necessary to achieve consumption functions, otherwise the transaction will not be completed."}
{"task": "rw_106.jsonl", "id": 72318, "text": "When you use the customer service function in the game, the third -party customer service SDK will start and may collect your equipment information, soliciting your microphone rights, camera permissions, album permissions, or photo authorization (see attachment 1 for details: \"No. 1: No. 1Three -party SDK and similar application descriptions \").", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "The third -party customer service SDK will start and collect equipment information, soliciting microphone permissions, camera permissions, album permissions, or license authorization (see Annex 1: \"Third -Party SDK and similar applications\")."}
{"task": "rw_106.jsonl", "id": 72319, "text": "For your account and system security, optimize the quality of service, we may contact your personal information from a third -party customer service SDK and indirectly collect your personal information, including your device information and the communication content of your customer service (package text/picture/audio and video/callRecord form).", "label": ["Important", "First Party Collection Information"], "rewrite": "We may contact the third -party customer service SDK and indirectly collect personal information, including the communication content of equipment information and your customer service (package text/picture/audio and video/call records)."}
{"task": "rw_106.jsonl", "id": 72320, "text": "Please know and understand that if you involve account numbers or personal sensitive issues involving customer service, we may ask you to provide personal sensitive information such as mobile phone numbers and ID numbers to verify the real -name authentication information with the account number to judge your youthreal identity;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "We may ask for personal sensitive information such as mobile phone numbers and ID numbers to verify the real -name authentication information with the account number to judge your true identity."}
{"task": "rw_106.jsonl", "id": 72321, "text": "The above -mentioned sensitive information is only used for verification, and customer service will not be retained.", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72322, "text": "According to relevant laws and regulations and national standards, in the following circumstances, we may collect and use your relevant personal information without asking your authorization consent:", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "In the following circumstances, we may collect and use your relevant personal information without asking for your authorization consent:"}
{"task": "rw_106.jsonl", "id": 72323, "text": "1., directly related to national interests such as national security and national defense security;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Personal information directly related to national interests such as national security and national defense security does not need to agree."}
{"task": "rw_106.jsonl", "id": 72324, "text": "Directly related to the major public interests such as public safety, public health, and public knowledge;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collection of personal information directly related to major public interests such as public safety, public health, and public awareness does not require consent."}
{"task": "rw_106.jsonl", "id": 72325, "text": "2. Directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collection of personal information directly related to criminal investigations, prosecutions, trials, and enforcement of sentences, etc., without consent."}
{"task": "rw_106.jsonl", "id": 72326, "text": "3. For major legitimate rights and interests such as maintaining the lives, property, and reputation of users or other individuals, it is difficult to get my consent;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting and maintaining major legitimate rights and interests, but it is difficult to get personal information that I agree, no need to agree."}
{"task": "rw_106.jsonl", "id": 72327, "text": "4. The collected personal information is made by the user to the public by itself;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "The collected personal information is disclosed by the user to the public and does not need to agree."}
{"task": "rw_106.jsonl", "id": 72328, "text": "5. Collect personal information from the information disclosed by legitimately publicly disclosed, such as legal news reports and government information disclosure;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If you collect personal information from the legal disclosure information, you don't need to agree."}
{"task": "rw_106.jsonl", "id": 72329, "text": "6. Sign and perform the contract according to user requirements;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting the personal information necessary for signing and performing the contract, there is no need to agree."}
{"task": "rw_106.jsonl", "id": 72330, "text": "7. The necessary and stable operation of the products or services provided by maintaining it, such as the failure of discovering and disposing of products or services;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting the personal information necessary for the safe and stable operation of maintaining products or services, there is no need to agree."}
{"task": "rw_106.jsonl", "id": 72331, "text": "8. What is necessary for carrying out legal news reports;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collection of personal information necessary for legal news reports does not need to agree."}
{"task": "rw_106.jsonl", "id": 72332, "text": "9. Due to the need to carry out statistics or academic research in public interests, and the results of academic research or descriptions, the personal information contained in the results is identified;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting public interests to carry out the necessary personal information necessary for statistics or academic research, no need to agree."}
{"task": "rw_106.jsonl", "id": 72333, "text": "10. Other circumstances stipulated in laws and regulations.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect personal information under other circumstances stipulated in laws and regulations, no need to agree."}
{"task": "rw_106.jsonl", "id": 72334, "text": "2. How can we use your personal information", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72335, "text": "We will strictly abide by the provisions of laws and regulations and the agreement with you, in accordance with the information collected by this \"Privacy Policy\" and \"Thunder Game Use License and User Agreement\".", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72336, "text": "(1) Use of information use rules", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72337, "text": "We will use the first collection of information collected by this \"Privacy Policy\" in accordance with the following rules:", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72338, "text": "We will provide you with various functions and services based on the collected information, including basic game functions, player interactive functions, consumption functions, execution software verification, execution software upgrades, network synchronization, etc.;", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72339, "text": "We will analyze the operation of this game based on the frequency and situation of Thunder's products, fault information, and performance information to ensure the security of the service, optimize our products, and improve our service quality.", "label": ["Important", "Usage"], "rewrite": "We will analyze the operation of this game based on the frequency and situation of Thunder's products, fault information, and performance information."}
{"task": "rw_106.jsonl", "id": 72340, "text": "We will not combine the information stored in the analysis software with the personal identity information you provide.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "We will not combine the information stored in the analysis software with the personal identity information you provide."}
{"task": "rw_106.jsonl", "id": 72341, "text": "(2) Changes in information use rules and re -agree", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72342, "text": "We will use the collected information in the purpose covered by this \"Privacy Policy\".", "label": ["Important", "Usage"], "rewrite": "We will use the collected information in the purpose covered by this \"Privacy Policy\"."}
{"task": "rw_106.jsonl", "id": 72343, "text": "If the scope of your personal information we want to use is beyond the scope of this \"Privacy Agreement\", we will modify the content of this \"Privacy Agreement\" before collecting your personal information, and to timely in time through pop -up windows, push notifications, etc.You inform and get your explicit consent again.", "label": ["Important", "First Party Collection Information"], "rewrite": "The scope of personal information we intends to use exceeds the scope. Before collecting personal information, we will modify the content of this \"Privacy Agreement\", and inform them in a timely manner through pop -ups and push notifications, and obtain consent again."}
{"task": "rw_106.jsonl", "id": 72344, "text": "3. How do we store and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72345, "text": "(1) Storage of personal information", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72346, "text": "1. Method and period of information storage", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72347, "text": "We will store your information in a safe way, including local storage (such as using APP for data cache), database and server logs.", "label": ["Data Retention", "Important"], "rewrite": "We will store information in a safe way, including local storage (such as using APP for data cache), database and server logs."}
{"task": "rw_106.jsonl", "id": 72348, "text": "We will only store your personal information within the time necessary for the purpose of service to achieve service purposes or under the conditions of laws and regulations.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "We will only store your personal information within the time necessary for the purpose of service to achieve service purposes or under the conditions of laws and regulations."}
{"task": "rw_106.jsonl", "id": 72349, "text": "Unless the law has other regulations or you ask for requests in accordance with this \"Privacy Policy\", we will save your personal information during the game operation.", "label": ["Data Retention", "Important"], "rewrite": "Unless the law has other regulations or requests a request in accordance with this \"Privacy Policy\", we will save personal information during the game operation."}
{"task": "rw_106.jsonl", "id": 72350, "text": "2. The area of information storage", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72351, "text": "We will store your personal information in China in accordance with laws and regulations.", "label": ["Data Retention", "Important"], "rewrite": "We will store your personal information in China in accordance with laws and regulations."}
{"task": "rw_106.jsonl", "id": 72352, "text": "3. Delete of information", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72353, "text": "When this game stops operation or does not save your information based on this \"Privacy Policy\", the electronic files that store personal information will be permanently deleted, and we will take reasonable measures to ensure that personal information cannot be restored.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "When this game stops operation or no longer saves information, the electronic files that store personal information will be permanently deleted, and we will take reasonable measures to ensure that personal information cannot be restored."}
{"task": "rw_106.jsonl", "id": 72354, "text": "If we should continue to save your personal information according to law, this part of personal information will also be isolated from other types of information.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "If we should continue to save personal information according to law, this part of personal information will also be isolated from other types of information."}
{"task": "rw_106.jsonl", "id": 72355, "text": "(2) Protection of personal information", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72356, "text": "1. Information security", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72357, "text": "Under existing equipment and technical conditions, we have always actively adopted reasonable measures such as technical and management to ensure the security of your account and personal information;", "label": ["Important", "Data Security"], "rewrite": "We have always actively adopted reasonable measures such as technology and management to ensure the security of your account and personal information."}
{"task": "rw_106.jsonl", "id": 72358, "text": "We will use the collected information in good faith, take various effective and necessary measures to protect your privacy and security, and use a business and reasonable security technical measures to protect your privacy from unauthorized access, use or leakage.", "label": ["Important", "Data Security"], "rewrite": "We will use the collected information of goodwill, take various measures to protect privacy and security, and use reasonable security technical measures to protect your privacy from unauthorized access, use, or leaked."}
{"task": "rw_106.jsonl", "id": 72359, "text": "At present, we have adopted the industry's leading technical protection measures.", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72360, "text": "The technical means we use include but not limited to firewalls, encryption (such as SSL), de -identification or anonymous treatment, access control measures (fortress machines, secondary verification, etc.).", "label": ["Important", "Data Security"], "rewrite": "The technical means we use include but not limited to firewalls, encryption (such as SSL), de -identification or anonymous treatment, access control measures (fortress machines, secondary verification, etc.)."}
{"task": "rw_106.jsonl", "id": 72361, "text": "We have established a special management system, process and organization that guarantees personal information security.", "label": ["Important", "Data Security"], "rewrite": "We have established a special management system, process and organization that guarantees personal information security."}
{"task": "rw_106.jsonl", "id": 72362, "text": "We only allow the Thunder employees to know this information to visit your personal information and set up strict access to control and monitoring mechanisms for this.", "label": ["Important", "Data Security"], "rewrite": "We only allow the Thunder employees who need to know the information to access personal information, and set up strict access to control and monitoring mechanisms for this."}
{"task": "rw_106.jsonl", "id": 72363, "text": "We also require all personnel who may contact your information to fulfill the corresponding confidentiality obligations.", "label": ["Important", "Data Security"], "rewrite": "We also require all personnel who may contact your information to fulfill the corresponding confidentiality obligations."}
{"task": "rw_106.jsonl", "id": 72364, "text": "If we fail to fulfill these obligations, we will investigate its legal responsibilities.", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72365, "text": "2. Information security incident disposal measures", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72366, "text": "If personal information leaks and other security incidents occur, we will start emergency plans to prevent security incidents from expanding.", "label": ["Important", "Data Security"], "rewrite": "If personal information leaks and other security incidents occur, we will start emergency plans to prevent security incidents from expanding."}
{"task": "rw_106.jsonl", "id": 72367, "text": "If information security incidents occur, we will inform you the basic situation of the security incident in the form of announcement, push notification or email, the disposal measures and remedial measures we are about to adopt or we have already taken, and our proposal to your response.", "label": ["Important", "Data Security"], "rewrite": "If information security incidents occur, we will inform you of the basic situation of security incidents, disposal measures and remedial measures, and cope with suggestions."}
{"task": "rw_106.jsonl", "id": 72368, "text": "If it is difficult to notify one by one, we will issue warnings through announcements and other means.", "label": ["Important", "Data Security"], "rewrite": "If it is difficult to notify one by one, we will issue warnings through announcements and other means."}
{"task": "rw_106.jsonl", "id": 72369, "text": "4. How do we provide information outside", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72370, "text": "Except for the situation stipulated in the \"Privacy Policy\" and \"Thunder Game Use License and User Agreement\", we will not take the initiative to share, provide or transfer your personal information to a third party.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Except for the situation stipulated in the \"Privacy Policy\" and \"Thunder Game Use License and User Agreement\", they will not actively share, provide or transfer your personal information to third parties."}
{"task": "rw_106.jsonl", "id": 72371, "text": "If there are other sharing, providing or transferring your personal information, or you ask us to share, provide or transfer or transfer your personal information to a third party outside us, we will directly confirm to you and obtain your explicit consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If there is a sharing situation, we will directly confirm with you and obtain your explicit consent."}
{"task": "rw_106.jsonl", "id": 72372, "text": "According to relevant laws and regulations and national standards, in the following circumstances, we will share, transfer, and openly disclose your specific personal information on the premise that we will not obtain your authorization consent in advance:", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "In the following circumstances, under the premise that your authorization consent will be obtained in advance, you will share, transfer, and publicly disclose your specific personal information:"}
{"task": "rw_106.jsonl", "id": 72373, "text": "After the written authorization of your (or the guardian of the minor) or the written request of your (or the guardian of the minor), we authorize us to disclose;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "If you have authorized or authorized us to disclose, you don't need to agree."}
{"task": "rw_106.jsonl", "id": 72374, "text": "Relevant laws require us to disclose;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "If the law requires us to disclose, there is no need to agree."}
{"task": "rw_106.jsonl", "id": 72375, "text": "The judicial organs or administrative agencies are provided based on legal procedures;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Judicial organs or administrative organs need to provide personal information based on legal procedures and do not need to agree."}
{"task": "rw_106.jsonl", "id": 72376, "text": "It is difficult to obtain the major legitimate rights and interests of the life and property of the subject of personal information or other individuals; it is difficult to get my consent;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Sharing, transfer, disclosure and maintenance major legitimate rights and interests, but it is difficult to get personal information that I agree, no need to agree."}
{"task": "rw_106.jsonl", "id": 72377, "text": "The subject of personal information disclose personal information to the public by themselves;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "The personal information of the personal information disclose personal information to the public on its own without consent."}
{"task": "rw_106.jsonl", "id": 72378, "text": "Collect personal information from legal public information, such as legal news reports, government information disclosure and other channels.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "If you collect personal information from the legal disclosure information, you don't need to agree."}
{"task": "rw_106.jsonl", "id": 72379, "text": "5. How do we use cookies and related technologies", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72380, "text": "Cookies is a neutral technology that allows website server to store data on the client or read data from the client.", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72381, "text": "To optimize your experience, we will use cookies or similar technologies (for example: Web, Beacons, Log, Files, Scripts, ETAGS) (hereinafter collectively referred to as \"Cookies\" technology).", "label": ["Important", "First Party Collection Information"], "rewrite": "We will use cookies or similar technologies."}
{"task": "rw_106.jsonl", "id": 72382, "text": "Cookies technology will generate small files in your device so that we can provide specific functions.", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72383, "text": "You have the right to open or close cookies through the settings of equipment or browser.", "label": ["Important", "Edit/Control"], "rewrite": "You have the right to open or close cookies through the settings of equipment or browser."}
{"task": "rw_106.jsonl", "id": 72384, "text": "But when you choose to close the cookies technology, you may not experience some functions of our products.", "label": ["Important", "Edit/Control"], "rewrite": "But when you choose to close the cookies technology, you may not experience some functions of our products."}
{"task": "rw_106.jsonl", "id": 72385, "text": "6. How do we protect the rights and interests of minors", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72386, "text": "We attach great importance to the protection of personal information of minors and continue to explore the updated personal information protection methods of minors.", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72387, "text": "We will actively protect the legitimate rights and interests of minors by enabling the anti -addiction system in accordance with the requirements of national defense addiction policies.", "label": ["Specific Audiences", "Important"], "rewrite": "Protect the legitimate rights and interests of minors by enabling the anti -addiction system."}
{"task": "rw_106.jsonl", "id": 72388, "text": "We will determine whether the real -name information of the relevant account is a minor through the real -name information verification, and then decide whether to incorporate this account into the anti -addiction system.", "label": ["Specific Audiences", "Important"], "rewrite": "We will judge whether the relevant account is minor through real -name information verification, and then decide whether to incorporate this account into the anti -addiction system."}
{"task": "rw_106.jsonl", "id": 72389, "text": "For the protection of minors' rights and interests, please refer to the \"Thunder Game Children's User Privacy Protection Policy\".", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72390, "text": "If you are the legal guardian of the minor, please pay attention to whether the minors you are monitored use our services or provide personal information after obtaining your authorization consent.", "label": ["Specific Audiences", "Important"], "rewrite": "Please pay attention to whether the minors you are monitored use our services or provide personal information after obtaining your authorization consent."}
{"task": "rw_106.jsonl", "id": 72391, "text": "If you have questions about the personal information of the minor you monitored, please contact us through the contact information of Article 9.", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72392, "text": "7. The right to manage personal information", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72393, "text": "You have multiple ways to control your personal information in this game, including: you can access, correct, and delete your personal information in this game (except for the prohibition of changes or deletion of the law of the People's Republic of China),You can also withdraw the authorized authorization before;", "label": ["Important", "Edit/Control"], "rewrite": "You have multiple ways to control personal information. You can access, correct, delete your personal information in this game, or withdraw the authorization of previous consent."}
{"task": "rw_106.jsonl", "id": 72394, "text": "At the same time, you can also cancel your Thunder account and wipe out all your information in all the games of the Thunder.", "label": ["Important", "Edit/Control"], "rewrite": "At the same time, you can also cancel your Thunder account and wipe out all your information in all the games of the Thunder."}
{"task": "rw_106.jsonl", "id": 72395, "text": "If you have the needs of visiting, modifying, correcting, withdrawing authorization, or deleting your personal information in this game, you can contact it, gmservice@leiting.com to handle;", "label": ["Edit/Control", "Contact Information", "Important"], "rewrite": "If you have the need to access, modify, correct, withdraw authorization or delete personal information, you can contact gmservice@leiting.com for handling."}
{"task": "rw_106.jsonl", "id": 72396, "text": "If you have the need to cancel the Thunder account and erase your information in all the information of the Thunder, you can cancel the application platform (link:, https: //member.leiting.com/account_destroy,) to cancel it.", "label": ["Important", "Edit/Control"], "rewrite": "If you have the need to cancel the Thunder account and erase information, you can cancel the application platform (link: https://member.leiting.com/account_destroy) to cancel."}
{"task": "rw_106.jsonl", "id": 72397, "text": "Please know and understand that because your account may have a certain value, you can correct, delete personal information, withdraw personal information authorization, and cancel the Thunder account may require you to provide real -name identity information for identity test.", "label": ["Important", "First Party Collection Information", "Edit/Control"], "rewrite": "Correction, deleting personal information, withdrawing personal information authorization, and cancellation of the Thunder account may require you to provide real -name identity information for identity verification."}
{"task": "rw_106.jsonl", "id": 72398, "text": "After receiving the information, we will respond to your request within 15 working days, and we will delete the information collected in 2 working days.", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72399, "text": "Please know and understand that if you are a user who enters the game through the channel area, the personal information provided to the channel party when you register or log in to other channel accounts will not be collected and stored.", "label": ["Important", "Risk"], "rewrite": "The personal information provided by the channel party when you register and log in to other channel accounts is not paid to us to collect and store it."}
{"task": "rw_106.jsonl", "id": 72400, "text": "After you submit the access, correction, modification, deletion, withdrawal of authorization, and cancellation needs of channel account information, we will assist you to clarify the information collector of the information and inform you the way you can handle your personal information correction and account cancellation.personal information.", "label": ["Important", "Edit/Control"], "rewrite": "After you submit the access, correction, modification, deletion, withdrawal of authorization, and cancellation of the needs of channel account information, you will assist you to clarify the information collector and inform the way of handling personal information correction and account cancellation."}
{"task": "rw_106.jsonl", "id": 72401, "text": "8. How to update this \"Privacy Policy\"", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72402, "text": "If business function changes, personal information outbound situation changes, changes in use, and changes in personal information protection and contact methods, we will make corresponding amendments to this \"Privacy Policy\", and inform you in a timely manner to inform you in a timely manner to inform youAnd re -obtain your consent. Only after you confirm and receive the change of the change, we will collect, use, handle, and store your personal information based on the change of \"Privacy Policy\";", "label": ["Policy Change", "Important"], "rewrite": "We will revise this \"Privacy Policy\" accordingly, and inform you in time through pop -ups, push notifications, etc., and re -obtain your consent."}
{"task": "rw_106.jsonl", "id": 72403, "text": "If you do not agree with the change, you can choose to stop using our service.", "label": ["Policy Change", "Important"], "rewrite": "If you do not agree with the change, you can choose to stop using our service."}
{"task": "rw_106.jsonl", "id": 72404, "text": "Nine, contact information", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72405, "text": "If you have any questions, opinions or suggestions on the \"Privacy Policy\", or have any questions about the \"Privacy Policy\", or have any questions about our privacy measures, you can send emails to gmservice@leiting.com or write lettersMail to the following address:", "label": ["Important", "Contact Information"], "rewrite": "You can send mail to gmservice@leiting.com."}
{"task": "rw_106.jsonl", "id": 72406, "text": "Address:, 17th floor of Building 2, Building 2, Fourth Road, Dragon Ball Fourth Road, Nanshan District, Shenzhen, Guangdong Province, Thunder Company, Legal Affairs (closed)", "label": ["Important", "Contact Information"], "rewrite": "Write the mail to the following address: The 17th floor of the 17th floor of Building No. 2, No. 2, Building 2, Fourth Road, Longzhu, Shenzhen, Guangdong Province, China."}
{"task": "rw_106.jsonl", "id": 72407, "text": "Postcode: 518000", "label": ["Important", "Contact Information"], "rewrite": "Postal code: 518000."}
{"task": "rw_106.jsonl", "id": 72408, "text": "We will review the issues involved as soon as possible and reply within the fifteen working days when they receive the email.", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72409, "text": "Special reminder: This \"Privacy Policy\" is only applicable to this game user. This \"Privacy Policy\" is supplemented by the relevant game service agreement such as \"Thunder Game Use License and User Agreement\".What is inconsistent with this \"Privacy Policy\" is based on the \"Privacy Policy\".", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72410, "text": "Annex I:", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72411, "text": "Third -party SDK and similar application descriptions", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72412, "text": "To provide and optimize our services, this game may contain third -party SDK or other similar applications.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "This game may contain third -party SDKs or other similar applications."}
{"task": "rw_106.jsonl", "id": 72413, "text": "When you use the services provided by such third -party SDKs or similar applications in this game, you agree that you will directly collect and process your information.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "When you use such third -party SDKs or similar services in this game, you agree to collect and process your information directly."}
{"task": "rw_106.jsonl", "id": 72414, "text": "Such SDKs or similar applications collect and process information to comply with their respective privacy policies, and do not apply to this \"Privacy Policy\".", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72415, "text": "We will strive to review the business access qualifications of such third -party SDKs and similar applications and strive to require their legitimate compliance and security.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Will strive to review business access qualifications of such third -party SDKs and similar applications and require them to legitimate compliance and security."}
{"task": "rw_106.jsonl", "id": 72416, "text": "In order to ensure your information security to the greatest extent, we strongly recommend that you check the privacy clauses of third -party SDKs and similar applications.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We strongly recommend that you view the privacy clauses of third -party SDKs and similar applications."}
{"task": "rw_106.jsonl", "id": 72417, "text": "In order to protect your legitimate rights and interests, if you find such SDKs or similar applications, there are risks in similar applications, it is recommended that you immediately terminate related operations and contact us in time.", "label": [], "rewrite": []}
{"task": "rw_106.jsonl", "id": 72418, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
