{"task": "rw_16.jsonl", "id": 42777, "text": "Meitu Wink Personal Information Protection Policy", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42778, "text": "Latest effective date: 2022 [8] month [23] Day", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42779, "text": "As an operator of Meitu Wink, Xiamen Hongtian Chuangshi Technology Co., Ltd. and its related parties (that is, \"we\"), the following or \"wink\" or \"Meitu Wink\" will be strictly in accordance with the provisions of the law to protect your individualInformation and privacy security, this Wink personal information protection policy (\"this policy\") aims to explain to you that when using Meitu WinkApp (hereinafter referred to as \"product\" or \"service\"), what you should understand:", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42780, "text": "We will explain to you how you will handle your personal information in different scenarios in this product.", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42781, "text": "Under the basic mode, except for the required information required by laws and regulations, we will not process any personal information of your personal information.", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42782, "text": "You can refuse us to handle your other personal information, but this may cause us to be unable to provide you with corresponding services.", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42783, "text": "We will explain to you in detail in this policy that the types of your personal information have been shown boldly. The type of sensitive personal information is to bold the oblique body and the line logo.Essence", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42784, "text": "This policy will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42785, "text": "1. How do we collect, store and use your personal information", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42786, "text": "2. How do we use cookies", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42787, "text": "3. How do we transmit, share and disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42788, "text": "4. How do we protect your personal information", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42789, "text": "5. Your rights", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42790, "text": "6. How do we deal with the personal information of minors", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42791, "text": "7. How can your personal information be transferred globally", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42792, "text": "8. Applicable laws and jurisdictions", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42793, "text": "Nine, how to update this policy", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42794, "text": "10. Our contact information", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42795, "text": "Eleven, appendix: authority application and application scenario list", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42796, "text": "We attach great importance to the protection of your personal information, and we are also committed to maintaining your trust in us. We promise to take corresponding security protection measures to protect your personal information in accordance with the universal security standards in the industry.The whole process of installation, opening, browsing, use, and cancellation (hereinafter collectively referred to as \"use\") Wink is suitable for this policy.", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42797, "text": "The Wink client is the \"Wink platform\", which is suitable for this \"Meitu Wink Personal Information Protection Policy\". We promise that the maximum limit of your personal information collection and use does not exceed the scope of this \"Meitu Wink Personal Information Protection Policy\".", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42798, "text": "1. How do we collect, store and use your personal information", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42799, "text": "1. Register, log in and use Meitu account number", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42800, "text": "(1) [Register and logging in] When you use this product and service, we recommend that you register a Meitu account to use all the functions of the product and service;", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42801, "text": "For this reason, you need to provide mobile phone numbers (for real -name authentication) and create passwords and nicknames.", "label": ["Important", "First Party Collection Information"], "rewrite": "Register the Meituan account, you need to provide your mobile phone number (for real -name authentication) and create a password and nickname."}
{"task": "rw_16.jsonl", "id": 42802, "text": "(2) If you have registered Meitu account, you can log in to WINK through the third -party account (such as Meitu Xiuxiu account), or you can log in with a third -party platform account.Will authorize WINK to obtain the public information on the third -party platform (avatar, nickname, and other information you authorize).", "label": ["Important", "First Party Collection Information"], "rewrite": "If you log in with a third -party platform account, get the public information of your authorized third -party platform."}
{"task": "rw_16.jsonl", "id": 42803, "text": "In the process of using this product and logging in, we may get your equipment information: such as equipment platforms, equipment manufacturers, equipment brands, equipment models and system versions.definition.", "label": ["Important", "First Party Collection Information"], "rewrite": "In the process of using this product and logging in, we may get your equipment information."}
{"task": "rw_16.jsonl", "id": 42804, "text": "We may collect your above device information according to a certain frequency of implementation of login certification requirements. This kind of information is the information that the service must be collected. After the collection, it is identified as the identification processing, which will not be used to identify any specific users.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may collect your device information at a certain frequency of login authentication requirements and do the de -identification place after collecting."}
{"task": "rw_16.jsonl", "id": 42805, "text": "(3) About Meitu account", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42806, "text": "Meitu account can be logged in and uses the APPs of Meitu Company (including but not limited to Meitu Xiuxiu, Meipai, Beauty Camera, Poster Factory, etc.).For other apps and choose to use the registered Meitu account, the Meitu account will synchronize your nickname, avatar, region, gender, etc., etc.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you log in to other APPs of Meitu and choose to use the registered Meitu account, the Meitu account will synchronize the public information you filled in."}
{"task": "rw_16.jsonl", "id": 42807, "text": "If you don't want the above content to be synchronized, please choose other registration and login methods when you log in to other APPs of Meitu.", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42808, "text": "2. Provide you with network security and operational security guarantee", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42809, "text": "In order to ensure your account, network, operation and system security, and prevent fraud and Trojan viruses from fishing websites, in the process of using this product, we may collect your equipment information according to a certain frequency that realizes security requirements, including unchanged non -changingThe device logo information (refers to a string of characters compiled by the device manufacturer into the device to identify it. Android such as IMEI, Androidid, OAID, IMSI, ICCID, GAID, MEID, VAID, AAID, iOS suchThe \"equipment identification information\" referred to in this policy is the same as this definition), hardware serial number, and MAC address.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your device information at a certain frequency that achieves security requirements to ensure your account, network, operation and system security."}
{"task": "rw_16.jsonl", "id": 42810, "text": "Please understand that when you will be switched to the background of WINK and APP in the device screen, due to some equipment models and system reasons, the information collection behavior you used to use WINK related functions may not stop immediately, so as to withstand it, so as to put it, so as to do it, so as to do it, so as to do it, so as to do it, so as to do it, so as to do it, so as to do it.Causes short -term background information collection behavior.", "label": ["Important", "First Party Collection Information"], "rewrite": "When the Wink APP is switched to the background, there may be a short -term background information collection behavior."}
{"task": "rw_16.jsonl", "id": 42811, "text": "3. Provide you with other related product functions and/or services", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42812, "text": "In order to achieve the following product functions and/or services, we may need to collect corresponding personal information from you. If you refuse to provide, you cannot use these specific services.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may need to collect corresponding personal information to you to achieve various product functions and/or services."}
{"task": "rw_16.jsonl", "id": 42813, "text": "1) Customer service.", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42814, "text": "When you make a complaint with Wink, consult or appeal, in order to contact you or help you solve the problem, we may need you to provide personal information such as names, mobile numbers, emails and other effective contact information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you have a complaint, consultation or appeal, you need to provide personal information such as names, mobile phone numbers, emails and other effective contact information."}
{"task": "rw_16.jsonl", "id": 42815, "text": "If you refuse to provide the above information, we may not be able to feedback the relevant processing results in time.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42816, "text": "2) We may also collect your network operators and types, network types, WIFI names (such as SSID, BSSID) to achieve the purpose of helping you save network traffic during the push process, for example: when we monitor you in the WIFI environmentWe may play video content directly for you;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your network operators and types, network types, and WIFI names to achieve the purpose of helping you save network traffic during the push process."}
{"task": "rw_16.jsonl", "id": 42817, "text": "When we detect that you are in an environment with no network or a weak mobile network, we will only push you relevant video content that you have cached locally.", "label": ["Important", "Usage"], "rewrite": "When you detect that you are in an environment without a network or a weak mobile network, we will only push you about the relevant video content that you have cached in the local area."}
{"task": "rw_16.jsonl", "id": 42818, "text": "3) Maintenance of product safety and timely eliminate failure.", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42819, "text": "Equipment brand, system version, CPU information, process information during operation.", "label": ["Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "Collect your EXIF data, device logo information, device model information and login IP address, operating log information, device brand, system version, CPU information, process information during operation to ensure service operation and account security."}
{"task": "rw_16.jsonl", "id": 42820, "text": "This kind of information is the information that the service must be collected. After the collection, it is used for identification processing, and it will not be used to identify any specific users.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42821, "text": "In order to ensure the effect of face image processing, our services may use the calculation results of face mapping depth-related information in Apple's ARKit and TrueDepth APIs. During this period, we will neither use such calculation results for other purposes, Nor will any data be captured on file or uploaded to a server for record-keeping purposes or otherwise to collect your facial mapping depth.", "label": ["Important", "Data Security", "Usage"], "rewrite": "The calculation results of Apple's Arkit and TrueDepth application interface are used for face image processing, but it will not be used for other purposes or uploading the server."}
{"task": "rw_16.jsonl", "id": 42822, "text": "4) Guarantee account security.", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42823, "text": "When you use modification passwords, security verification, appeal behavior, and abnormal operating behavior, we may ask you to provide effective identity information to ensure the security of the above operation behavior.", "label": ["Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "When your operating behavior is abnormal, we may ask you to provide effective identity information to ensure the safety of the operation."}
{"task": "rw_16.jsonl", "id": 42824, "text": "5) When you use the AI cloud processing function (such as image quality repair function, remove watermark, picture resolution repair, 3D photo special effects, video supplementary frames), we will collect the portrait characteristics of no specific personal portrait (suchFood, portrait, etc.) and analysis of image or video features through algorithms to help you get better cloud processing effects. You need to upload your image or video information to the background server for production. The generated images will return toYour device terminal, the upload and processing of this information are necessary for providing this function. We will take strict encryption measures on your type of information in the process of transmission and storage in accordance with the requirements of the law to ensure the security of your information security.The use of this information is limited to providing you with this functional service. We only provide image processing services. After the service is completed, the system will automatically delete the above information without retaining.", "label": ["Important", "Data Retention", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "When you use the AI cloud processing function, we will collect the portrait features that do not recognize any specific individuals and perform image or video feature analysis. Your information will take encrypted measures during the processing process and automatically delete after the service is completed."}
{"task": "rw_16.jsonl", "id": 42825, "text": "6) Image classification service.", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42826, "text": "When you use Meitu formula, intelligent optimization and other functions, we will collect the rough and indirect portrait features (such as large categories: landscape, food, portrait, etc.) that do not recognize any specific individuals, and use algorithm to analyze picture features to help help helpYou choose more accurate formula and so on.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use Meitu formula, intelligent optimization and other functions, collect non -rough indirect portrait features that do not recognize any specific individuals and help you choose more accurate formulas through feature analysis."}
{"task": "rw_16.jsonl", "id": 42827, "text": "7) Body contour recognition service.", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42828, "text": "When you use magic photos and other functions, we will use examples to segment technology to identify your head and body contour parameters to complete the matting.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use magic photos and other functions, we will use examples to segment technology to identify your parameters to complete the matting."}
{"task": "rw_16.jsonl", "id": 42829, "text": "This kind of information is the information that provides this service that must be collected. After collecting it, it will be identified and will not be used to identify any specific users.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "After the contour parameter information is collected, it will be identified and will not be used to identify any specific users."}
{"task": "rw_16.jsonl", "id": 42830, "text": "8) Video beauty function.", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42831, "text": "When you use the video beauty function, we will use Meitu face point technology to detect the facial features and contours in the photo or video you selected, and generate corresponding beauty effects according to the user's choice.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use a video beauty function, we will use Meitu human facial technology to detect the features and outlines of the facial five senses in the selected video or photos to generate beauty effects."}
{"task": "rw_16.jsonl", "id": 42832, "text": "This kind of information is the information that the service must collect for this service and will not be used to identify any specific users.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42833, "text": "The information collected by this function will be stored in the local draft of the device so that the user can edit the secondary editing and will not upload it to the server. When you uninstall this product, the above information will be deleted with the product.", "label": ["Data Retention", "Important"], "rewrite": "The information collected by the video beauty function will be stored in the local draft of the device, will not be uploaded to the server, and delete it with the uninstallation of the product."}
{"task": "rw_16.jsonl", "id": 42834, "text": "9) If you share the contents of Wink to a third -party platform, we will read your application list information to determine whether the third -party platform exists to achieve the purpose of sharing.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If you share the contents of Wink to a third -party platform, we will read your application list information to share."}
{"task": "rw_16.jsonl", "id": 42835, "text": "If you use the password function for sharing, we need to visit your shear information locally to read the password contained in it to achieve content sharing.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you use the password function to share, we need to access your clipboard information and read the password in it to realize content sharing."}
{"task": "rw_16.jsonl", "id": 42836, "text": "We will upload the server only when we identify the shear plate information is a password. In addition, we will not upload other information of the shear board to the server.", "label": ["Important", "First Party Collection Information"], "rewrite": "When we identify the shear plate information is a password, we upload it to the server."}
{"task": "rw_16.jsonl", "id": 42837, "text": "10) Additional functions:", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42838, "text": "Other partners: other functions provided by third parties.", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42839, "text": "Based on the characteristics of modern mobile Internet products, this product may access other products or functions of Meitu related companies or external partners. For example, Tencent voice recognition may need to identify your video background sound.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "This product may access other products or functions of Meitu related companies or external partners."}
{"task": "rw_16.jsonl", "id": 42840, "text": "We will only provide you with the above functions or access your relevant information, and we will not store the above information.", "label": ["Data Retention", "Important", "First Party Collection Information"], "rewrite": "We will only provide you with an additional function to access your relevant information without stored the above information."}
{"task": "rw_16.jsonl", "id": 42841, "text": "If you do not allow access to the above information, it only causes you to use related additional functions normally, and you can still use the basic functions and other business functions and services of this product normally.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42842, "text": "11) Message notification: Receive products, services, marketing or questionnaire information.", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42843, "text": "In order to better let you understand Meitu's products and related services, we will send one or more types of notifications to you in the process of using Wink products or services (suchProduct activities and welfare notifications, security verification, marketing information, product use experience return visits, or conduct related questionnaire surveys.", "label": ["Important", "Usage"], "rewrite": "We will send notifications to you to send a notification to make you better understand the product and use related services."}
{"task": "rw_16.jsonl", "id": 42844, "text": "But if you don't want to receive this kind of information we send to you, you can withdraw the booking method provided in the SMS or other methods we provide.", "label": ["Important", "Edit/Control"], "rewrite": "You can notify our notice through the withdrawal method provided in the text message or other methods provided."}
{"task": "rw_16.jsonl", "id": 42845, "text": "Under the premise of opening the notification permissions, we may send you our hot content. If you do not want to receive the above notice, you can turn off the WINK notification permissions in the mobile phone system settings.", "label": ["Important", "Edit/Control"], "rewrite": "Under the premise of opening the notification permissions, we may send you hotspot content, etc. You can turn off WINK notification permissions in the mobile phone system settings."}
{"task": "rw_16.jsonl", "id": 42846, "text": "You can also quickly understand how we collect your personal information through \"Personal Information Collection List\".", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42847, "text": "4. We may get your personal information indirectly from a third party", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42848, "text": "1) When you use a third -party account (Weibo, WeChat, QQ) to log in to Meitu, you can choose to authorize Meitu to read and obtain you register, announce, record, record on the third -party platform on the third -party platform on the premise of meeting the requirements of relevant laws and regulations.Public information (including nicknames, avatars).", "label": ["Important", "First Party Collection Information"], "rewrite": "When you log in with a third -party account, you can authorize Meitu to read and get your public information on the third -party platform."}
{"task": "rw_16.jsonl", "id": 42849, "text": "2) Meitu needs to obtain the above information from a third party to remember your login status as a Meitu user to provide you with better products and/or services.", "label": ["Important", "Usage"], "rewrite": "The third -party information obtained by Meituan is used to remember your login identity to provide you with products and/or services."}
{"task": "rw_16.jsonl", "id": 42850, "text": "We will only collect and use your personal information within the scope of your authorization consent.", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42851, "text": "After you register or log in with a third-party account, your third-party account will be bound to Meitu account, but you can choose in [Settings-Account Management-Third-Party Account Binding-Binding Third-Party Account]\"Lift the binding\" and cancel the account binding.", "label": ["Important", "Edit/Control"], "rewrite": "You can select \"Lien Binding\" third-party account number in [Settings-Account Management-Third-Party Account Binding-Binding a Third-Party Account]."}
{"task": "rw_16.jsonl", "id": 42852, "text": "3) In order to facilitate your fast login, when you use the Wink \"One -click login\" function, after your explicit consent, communication operators with cooperative relationships with our company will provide us your mobile phone number to achieve one to achieve one oneKey to be available.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the Wink \"One -click login\" function, after your explicit consent, the communication operator will provide us your mobile phone number to achieve one -click login."}
{"task": "rw_16.jsonl", "id": 42853, "text": "5. Meitu is based on your personal information based on other special situations", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42854, "text": "1) If you think that your relevant rights are violated, you can make complaints and reports based on our infringement complaint process and through our contact information.", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42855, "text": "In the process, we will ask you to provide personal effective identity information to verify the authenticity of complaints and reports.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In the process of your complaints and reports, we will ask you to provide personal effective identity information to verify authenticity."}
{"task": "rw_16.jsonl", "id": 42856, "text": "At the same time, if you apply for an abnormal state of your Meitu account, we may also ask you to provide valid identity information for verification.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "If you apply for an abnormal state of the account, we may also ask you to provide valid identity information for verification."}
{"task": "rw_16.jsonl", "id": 42857, "text": "This is personal sensitive information. We will take strict confidentiality measures and will not share them with third parties.", "label": ["Important", "Data Security"], "rewrite": "We will take strict confidentiality measures on your identity information and will not share it from third parties."}
{"task": "rw_16.jsonl", "id": 42858, "text": "2) Please understand that the functions and services we provide to you are constantly updated and developed.In other purposes, we will tell you in a reasonable way (such as page prompts, interactive processes, website announcements, etc.).", "label": ["Policy Change", "Important"], "rewrite": "If you need to use your personal information for other purposes that are not stated in this policy, or use the collected information for other purposes based on specific purposes, we will inform you in a reasonable way in accordance with the law."}
{"task": "rw_16.jsonl", "id": 42859, "text": "2. How do we use cookies", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42860, "text": "In order to ensure the normal operation of the website, to help you get a more relaxed access experience, and send you the service content we provide for you, we will store small data files named Cookie on your computer or mobile device.", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42861, "text": "Cookie usually contains identifiers, site names, and some numbers and characters.", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42862, "text": "With the help of cookies, the website can store data such as your preferences to help you avoid repeating personal information and entering historical search content;", "label": ["Important", "Usage"], "rewrite": "With the help of cookies, websites can store your preferences and other data to help you simplify operations."}
{"task": "rw_16.jsonl", "id": 42863, "text": "At the same time, we may also use the above technologies to send, display, and push the service content we provide for you.", "label": ["Important", "Usage"], "rewrite": "Use the cookie to send, display, and push the service content we provide for you."}
{"task": "rw_16.jsonl", "id": 42864, "text": "You can manage or delete Cookie according to your habits, and you can also remove everything stored on the computer, cookies.", "label": ["Edit/Control", "Important"], "rewrite": "You can clear all the cookies saved on the computer."}
{"task": "rw_16.jsonl", "id": 42865, "text": "See AboutCookies.org for details.", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42866, "text": "We will not use Cookie for any purpose outside the purpose of this policy.", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42867, "text": "Most network browsers have the function of preventing cookies. You can remove all cookies saved on the computer through the browser settings option, but if you do this, it may cause you to change it yourself when you visit our website yourself.user settings.", "label": ["Edit/Control", "Important"], "rewrite": "You can clear all the cookies saved on the computer through the browser settings option."}
{"task": "rw_16.jsonl", "id": 42868, "text": "3. How do we transmit, share and disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42869, "text": "1. Sharing", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42870, "text": "We will not share your personal information with any company, organization, or individual, except the following situations:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not share your personal information with any company, organization, or individual, except the following situations:"}
{"task": "rw_16.jsonl", "id": 42871, "text": "1) Shared in the case of clear consent: After getting your clear consent, we will share your personal information with other parties.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After getting your clear consent, we will share your personal information with other parties."}
{"task": "rw_16.jsonl", "id": 42872, "text": "2) Shared under legal conditions: We may share your personal information to the outside world in accordance with the requirements of laws and regulations, litigation disputes, and compulsory requirements put forward by the government authority or judicial organs in accordance with the law.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share your personal information to the outside world in accordance with the requirements of laws and regulations, litigation disputes, and compulsory requirements put forward by the government authority or judicial organs in accordance with the law."}
{"task": "rw_16.jsonl", "id": 42873, "text": "3) In the scope of legal requirements or permits, it is necessary to provide your personal information to the third party in order to protect the interests of Meitu and its users or the public.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the scope of legal requirements or permits, it is necessary to provide your personal information to third parties in order to protect the interests of all parties."}
{"task": "rw_16.jsonl", "id": 42874, "text": "4) Sharing with our affiliates: Most of the products/services we provide for you cannot be completed alone, so your personal information may share with our company (Xiamen Hongtian Chuangshi Technology Co., Ltd.)We will only share the necessary personal information for the purpose of providing you with the functions and services of this product and the purpose of this policy.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Your personal information may be shared with our affiliated company, thinking that you provide the functions and services of this product."}
{"task": "rw_16.jsonl", "id": 42875, "text": "If the affiliate company wants to change the purpose of personal information, you will solicit your consent again.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If the affiliate company wants to change the purpose of personal information, you will solicit your consent again."}
{"task": "rw_16.jsonl", "id": 42876, "text": "Our affiliated companies include: Xiamen Hongtian Chuangshi Technology Co., Ltd. and its points and subsidiaries;", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42877, "text": "Xiamen Meitu Home Technology Co., Ltd. and its scores and subsidiaries;", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42878, "text": "Xiamen Meitu Mobile Technology Co., Ltd. and its scores and subsidiaries;", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42879, "text": "Xiamen Meitu Diaoma Technology Co., Ltd. and their divisions, subsidiaries, etc.", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42880, "text": "Our company and our associate company are collectively referred to as \"Meitu\".", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42881, "text": "2. Share personal information from the partner", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42882, "text": "1) Only in order to achieve the purpose of this policy, some of our services will be provided by authorized partners, such as technical support services and product analysis services.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to achieve the purpose of this policy, some of our services will be provided by authorized partners."}
{"task": "rw_16.jsonl", "id": 42883, "text": "We may share some of your personal information with your partners to ensure that the services that you provide can be successfully completed and help us provide better customer service and user experience.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42884, "text": "We will only provide your personal information for the principles of legal, correctness, necessary, and integrity, and only share the personal information necessary for providing services;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only provide your personal information for the principles of legal, correctness, necessary, and integrity, and only share the personal information necessary for providing services."}
{"task": "rw_16.jsonl", "id": 42885, "text": "At the same time, we will sign a strict confidentiality agreement with their companies, organizations and individuals who receive personal information, or ask them to handle personal information in accordance with our Wink personal information protection policy and any other related confidentiality and security measures.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will sign the confidentiality agreement with the information receiver to process personal information in accordance with our personal information protection policies and any other related confidentiality and security measures."}
{"task": "rw_16.jsonl", "id": 42886, "text": "Our partners have no right to use the personal information they receive for any other purpose.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Our partners have no right to use the personal information they receive for any other purpose."}
{"task": "rw_16.jsonl", "id": 42887, "text": "Our partners include the following types:", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42888, "text": "Such as: Technical support partners.", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42889, "text": "Partners who provide us with technical support will collect relevant personal information to our users to realize the services they support.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Partners that provide us with technical support will collect relevant personal information to realize the services they support."}
{"task": "rw_16.jsonl", "id": 42890, "text": "At the same time, there are partners who provide analytical services that will collect a small amount of personal information based on their information security rules to complete the identification processing to help us statistically distribute and evaluate product promotion effects.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Partners who provide analytical services will collect a small amount of personal information based on their information security rules to complete the identification processing to help us statistical product user distribution and evaluate product promotion effects."}
{"task": "rw_16.jsonl", "id": 42891, "text": "3. The specific types and purposes of personal information shared with third parties, you can refer to the \"Personal Information Third Party Sharing Catalog\" for details.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For the specific types and purposes of personal information shared with third parties, please refer to the \"Personal Information Third Party Sharing Catalog\"."}
{"task": "rw_16.jsonl", "id": 42892, "text": "4. Transfer", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42893, "text": "We will not transfer your personal information to any company, organization and individual, except the following situations: except:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not transfer your personal information to any company, organization and individual, except the following situations: except:"}
{"task": "rw_16.jsonl", "id": 42894, "text": "1) Under the premise of clearing your consent, we will transfer your personal information to other parties;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Under the premise of clearing your consent, we will transfer your personal information to other parties."}
{"task": "rw_16.jsonl", "id": 42895, "text": "2) When involving mergers, acquisitions or bankruptcy liquidation, if personal information is transferred, we will continue to accept the constraints of this Wink personal information protection policy.The agreed personal information has changed, and the purpose of the personal information has changed. We will ask the company, the organization and other subjects to re -soliciting the authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When involving mergers, acquisitions, or bankruptcy liquidation, if personal information transfer is involved, it will be required to continue to be bound by the policy, otherwise it will request that it will re -solicit authorization consent."}
{"task": "rw_16.jsonl", "id": 42896, "text": "5. Public disclosure", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42897, "text": "We will only collect or publicly disclose your personal information in the following circumstances:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only collect or publicly disclose your personal information in the following circumstances:"}
{"task": "rw_16.jsonl", "id": 42898, "text": "1) After getting your alone consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After getting your individual consent, collect or publicly disclose your personal information."}
{"task": "rw_16.jsonl", "id": 42899, "text": "2) Based on the compulsory requirements of laws and regulations, judicial organs or administrative departments, we may disclose your personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Based on the compulsory requirements of laws and regulations, judicial organs or administrative departments, we may disclose your personal information."}
{"task": "rw_16.jsonl", "id": 42900, "text": "6. The situation of handling personal information in accordance with the law is not authorized", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42901, "text": "According to the relevant laws and regulations, in the following circumstances, we can process your personal information without obtaining your authorization consent.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "According to the relevant laws and regulations, in the following circumstances, we can process your personal information without obtaining your authorization consent."}
{"task": "rw_16.jsonl", "id": 42902, "text": "1. It is necessary for the contract to establish and fulfill your contract as one party;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to set up and fulfill your collection and use information for the contract as a party, no need to solicit authorization."}
{"task": "rw_16.jsonl", "id": 42903, "text": "2. In order to fulfill the statutory duties or the requirements of the statutory volunteer;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to fulfill the statutory duties or the collection and usage information necessary for the statutory volunteer, there is no need to solicit authorization consent."}
{"task": "rw_16.jsonl", "id": 42904, "text": "3. In order to deal with emergencies, or in urgent situations to protect your life, health and property security;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to cope with emergencies, or in urgent cases to protect the life and health of natural persons and the necessary collection and use information, no need to solicit authorization."}
{"task": "rw_16.jsonl", "id": 42905, "text": "4. Implement news reports and public opinion supervision for public interests, and handle personal information within a reasonable range;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to implement news reports and public opinion supervision, deal with personal information within a reasonable scope without soliciting authorization consent."}
{"task": "rw_16.jsonl", "id": 42906, "text": "5. In accordance with relevant laws and regulations, handle personal information on personal or other legal disclosure within a reasonable scope;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In accordance with laws and regulations, personal information is processed by individuals or other legal disclosure within a reasonable range, and no authorization consent is required."}
{"task": "rw_16.jsonl", "id": 42907, "text": "6. Other circumstances stipulated in laws and administrative regulations.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Other collection and use information stipulated in laws and regulations does not need to solicit authorization."}
{"task": "rw_16.jsonl", "id": 42908, "text": "4. How do we protect your personal information", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42909, "text": "1. We have used security measures that are in accordance with the industry standards to protect your personal information, preventing data from being unauthorized access, public disclosure, use, modification, damage or loss.", "label": ["Important", "Data Security"], "rewrite": "Use security protection measures to protect your personal information and prevent data from being unauthorized, disclosed, use, modified, damaged or lost."}
{"task": "rw_16.jsonl", "id": 42910, "text": "We will take all reasonable and feasible measures to protect your personal information.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42911, "text": "For example, when switching data between your browser and \"service\" is protected by SSL;", "label": ["Important", "Data Security"], "rewrite": "SSL is protected by SSL when switching data between your browser and \"service\"."}
{"task": "rw_16.jsonl", "id": 42912, "text": "We provide the HTTPS security access method for the supporting web service provided by the product;", "label": ["Important", "Data Security"], "rewrite": "We provide the HTTPS security access method for the supporting web services provided by the product."}
{"task": "rw_16.jsonl", "id": 42913, "text": "We will use encryption technology to ensure the confidentiality of the data;", "label": ["Important", "Data Security"], "rewrite": "We will use encryption technology to ensure the confidentiality of data."}
{"task": "rw_16.jsonl", "id": 42914, "text": "We will use a trusted protection mechanism to prevent data from being maliciously attacked;", "label": ["Important", "Data Security"], "rewrite": "We will use a trusted protection mechanism to prevent data from being maliciously attacked."}
{"task": "rw_16.jsonl", "id": 42915, "text": "We will deploy the access control mechanism to ensure that only authorized personnel can access personal information;", "label": ["Important", "Data Security"], "rewrite": "We will deploy the access control mechanism to ensure that only authorized personnel can access personal information."}
{"task": "rw_16.jsonl", "id": 42916, "text": "And we will organize safety and privacy protection training courses to strengthen employees' awareness of protecting the importance of personal information.", "label": ["Important", "Data Security"], "rewrite": "We will organize safety and privacy protection training courses to strengthen employees' awareness of protecting the importance of personal information."}
{"task": "rw_16.jsonl", "id": 42917, "text": "2. Storage period: We will only retain your personal information within the time limit required for the purpose of reaching the cost of the cost, unless laws and regulations have compulsory retention requirements, such as the \"E -Commerce Law of the People's Republic of China\" requires commodity and service information, and service information, and service information,The preservation time of transaction information is not less than three years from the date of the transaction;", "label": ["Data Retention", "Important"], "rewrite": "Generally, your personal information is retained within the time limit required to achieve service purposes, unless the law has other requirements."}
{"task": "rw_16.jsonl", "id": 42918, "text": "For example, the \"Cyber Security Law\" requires no less than six months in accordance with regulations.", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42919, "text": "We judge the storage period of personal information. The following standards are mainly referred to the following standards and are based on the elders: to complete the necessary period of reserved the required services related to your services;", "label": ["Data Retention", "Important"], "rewrite": "We judge the storage period of personal information. The following standards are mainly referred to the following standards and are based on the elderly: 1) in response to your possible inquiries or complaints; 2) to ensure that we provide you with service safety and quality; 3) the longer you agreeDuring retention; 4) Whether there are other special agreement or laws and regulations on the retention period."}
{"task": "rw_16.jsonl", "id": 42920, "text": "To deal with your possible queries or complaints;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42921, "text": "Make sure we provide you with service safety and quality;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42922, "text": "Do you agree to a longer retention period;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42923, "text": "Whether there are other special agreement or laws and regulations on the retention period.", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42924, "text": "For personal information beyond the deadline, we will immediately delete or do anonymous processing.", "label": ["Data Retention", "Important"], "rewrite": "Personal information exceeding the deadline will be deleted or anonymous."}
{"task": "rw_16.jsonl", "id": 42925, "text": "3. The Internet is not an absolutely secure environment, and emails, instant messaging, and communication methods with other users are not encrypted. We strongly recommend that you do not send personal information in this way.", "label": ["Important", "Data Security"], "rewrite": "It is recommended that you do not send personal information through uncomfortable methods such as email and instant messaging."}
{"task": "rw_16.jsonl", "id": 42926, "text": "Please use complex passwords to help us guarantee your account security.", "label": ["Important", "Data Security"], "rewrite": "Please use complex passwords."}
{"task": "rw_16.jsonl", "id": 42927, "text": "4. The Internet environment is not 100 % security. We will try our best to ensure or guarantee the security of any information you send to us.", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42928, "text": "5. After the personal information security incident occurs unfortunately, we will inform you in a timely manner in accordance with the requirements of the laws and regulations: the basic situation and possible impact of the security incident, the disposal measures we have taken or we will take, you can take it alone to prevent and reduceSuggestions for risk, remedy measures, etc.", "label": ["Important", "Data Security"], "rewrite": "If a personal information security incident occurs, we will inform your basic situation, possible impact, disposal measures, independent prevention suggestions, etc."}
{"task": "rw_16.jsonl", "id": 42929, "text": "We will promptly inform you that the incident -related situation is informing the email, letter, telephone, push notification, etc. When it is difficult to inform the subject of personal information one by one, we will publish an announcement in a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "The relevant situation of security incidents will be informed by mail, letter, telephone, push notification, etc. When it is difficult to inform one by one, it will issue an announcement."}
{"task": "rw_16.jsonl", "id": 42930, "text": "At the same time, we will also actively report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "Report the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities."}
{"task": "rw_16.jsonl", "id": 42931, "text": "5. Your rights", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42932, "text": "In accordance with China's relevant laws, regulations, and standards, we guarantee the following rights to exercise your personal information:", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42933, "text": "1. Visit, delete, correct your personal information", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42934, "text": "1) Personal information access and correction-you can use [WINK]-[Settings]-[Click the avatar]-[Account and Security]-[Click the avatar]-[Edit Information] to the individual in your Meitu account numberInformation, nicknames, gender, avatar, region, birthday, etc. are visited and corrected.", "label": ["Important", "Edit/Control"], "rewrite": "You can use [Wink]-[Settings]-[Click avatars]-[Account and Security]-[Click the avatar]-[Edit information] to access and correct personal information, nickname, gender, avatar, region, birthday, birthday, etc."}
{"task": "rw_16.jsonl", "id": 42935, "text": "2) Account information access and correction-you can visit or replace your mobile phone number, modify password, login record, third-party account number in [WINK]-[Settings]-[Click avatars]-[Account number and security]Binded information.", "label": ["Important", "Edit/Control"], "rewrite": "You can access or replace your mobile phone number, modification password, login record, third-party account binding in [Wink]-[Click avatars]-[Account and Security]."}
{"task": "rw_16.jsonl", "id": 42936, "text": "3) Revisit related authorization-you can notify the transfer permissions in [Settings]-[Privacy and Notice] and the withdrawal of cloud landscaping services through the way to turn off the switch.", "label": ["Important", "Edit/Control"], "rewrite": "You can use the closing the switch to the closing of the switch and the withdrawal of the cloud landscaping service in the way [Settings]-[Privacy and Notice]."}
{"task": "rw_16.jsonl", "id": 42937, "text": "4) In the following circumstances, you can make a request to delete personal information to us:", "label": ["Edit/Control", "Important"], "rewrite": "In the following circumstances, you can make a request to delete personal information to us: a. The processing purpose has been achieved, cannot be achieved, or is not necessary for the purpose of the treatment;You withdraw your consent; d. We violate laws, administrative regulations or deal with personal information in violation of agreed;"}
{"task": "rw_16.jsonl", "id": 42938, "text": "A. The purpose of the processing has been achieved, cannot be achieved, or is not necessary for the purpose of processing;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42939, "text": "B. We stop providing products or services, or the storage period has expired;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42940, "text": "C. You withdraw consent;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42941, "text": "D. We violate laws, administrative regulations or deal with personal information in violation of agreed;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42942, "text": "E. Other circumstances stipulated in law and administrative regulations.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42943, "text": "Once the above deletion requests are responding, we will also notify the main body of your personal information from Meitu as much as possible at the same time, asking them to delete the corresponding information in time unless the laws and regulations have other regulations, or these subjects obtain your independent authorization.", "label": ["Important", "Edit/Control"], "rewrite": "If you respond to your deletion request, you will notify the subject of your personal information from our office, asking them to delete information, unless the laws and regulations have other provisions or you authorize."}
{"task": "rw_16.jsonl", "id": 42944, "text": "When you delete the information from our services, we may not immediately delete the corresponding information from the backup system. We will delete the information or achieve anonymous processing when the backup is updated.", "label": ["Data Security", "Important", "Risk"], "rewrite": "Delete or anonymous backup system when backup update."}
{"task": "rw_16.jsonl", "id": 42945, "text": "2. Personal information browsing and export", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42946, "text": "In the case of account login, if you need to browse your personal information or want to export your personal information copy, you can be in [Settings]-[Account Management]-[Meitu Security Center]-[Personal Information Browse and Export]Apply for the extraction of personal information copy, after you submit your application, we will send it to your designated mailbox within 24 hours.", "label": ["Important", "Edit/Control"], "rewrite": "You can apply for the extraction of personal information copy in the [Settings]-[Account Management]-[Meitu Security Center]-[Personal Information Browse and Export] We will send it to you designated within 24 hours after your submission.Mail."}
{"task": "rw_16.jsonl", "id": 42947, "text": "3. Use of basic mode", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42948, "text": "Formula browsing is the basic function of Wink. Video editing and beautification are the main functions of Wink.", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42949, "text": "If you only want to use the formulas provided by Wink for the basic services that you can use without personal information, you can choose to enter the basic mode.", "label": ["Important", "Edit/Control"], "rewrite": "If you only need to browse the basic services that you can use without personal information, you can enter the basic mode."}
{"task": "rw_16.jsonl", "id": 42950, "text": "When you use the basic mode, you will not be able to use the functions such as picture quality repair, one -click blockbuster and video editing/beauty function.", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42951, "text": "At the same time, you will not be able to experience rich services such as registration/login, information release, and focusing on the collection.", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42952, "text": "In the basic function mode, Wink will not upload any relevant personal information that can recognize your personal.", "label": ["Important", "First Party Collection Information"], "rewrite": "In the basic function mode, Wink will not upload any relevant personal information that can recognize your personal."}
{"task": "rw_16.jsonl", "id": 42953, "text": "4. Withdraw your authorization", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42954, "text": "If you want to cancel and agree to collect, use and disclose other personal information of your collections, or hope that we can correct, update or delete your personal information, you can withdraw from us through the path provided by the client or contact us through the contact information in this policy.", "label": ["Edit/Control", "Important"], "rewrite": "You can contact us to withdraw your consent or correction, update or delete your personal information."}
{"task": "rw_16.jsonl", "id": 42955, "text": "We will handle your requests within a reasonable time after receiving your email or registration letter and stop collecting, using and disclosing your personal information.", "label": ["Important", "Edit/Control"], "rewrite": "We will handle your request and stop collecting, using and disclosing your personal information within a reasonable time."}
{"task": "rw_16.jsonl", "id": 42956, "text": "But please understand and agree that when you withdraw from certain authorization, it will cause the relevant product functions to be unavailable. We cannot continue to provide you with specific functions and/or services corresponding to the withdrawal consent or authorization, and you withdraw the authorization authorization.The decision will not affect personal information processing based on your authorization.", "label": ["Important", "Edit/Control"], "rewrite": "The withdrawal of certain authorizations will cause the corresponding specific functions and/or services to be unavailable, but it will not affect personal information processing carried out based on authorization."}
{"task": "rw_16.jsonl", "id": 42957, "text": "5. Logging out account", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42958, "text": "1) Logging out the current application account", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42959, "text": "You can operate in [Settings]-[Account Management]-[Meitu Security Center]-[Logging out]-[Logging out the current application account] to carry out the operation of winning Wink, APP account alone.", "label": ["Edit/Control", "Important"], "rewrite": "You can cancel the account number in [Settings]-[Account Management]-[Meitu Security Center]-[Logging out]-[Logging out the current application account] to cancel the account."}
{"task": "rw_16.jsonl", "id": 42960, "text": "When choosing to cancel the current Wink and APP account, we will immediately remove all your personal information and data stored in Wink after you log out.", "label": ["Important", "Edit/Control"], "rewrite": "After the account is canceled, the personal information and data stored in it will be immediately removed."}
{"task": "rw_16.jsonl", "id": 42961, "text": "For details, please refer to the \"Meitu Account Rules\".", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42962, "text": "2) Logging out the Meitu account", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42963, "text": "You can cancel the Meitu account in [Settings]-[Account Management]-[Meitu Security Center]-[Logging out]-[Logging out Meitu account].", "label": ["Important", "Edit/Control"], "rewrite": "You can cancel the account in [Settings]-[Account Management]-[Meitu Security Center]-[Logging out]-[Logging out Meitu account]."}
{"task": "rw_16.jsonl", "id": 42964, "text": "We will provide you with an account cancellation service after verifying your identity and cleaning up the assets in your account.", "label": ["Important", "Edit/Control"], "rewrite": "After verifying your identity and cleaning up the assets in your account, you will provide you with an account cancellation service."}
{"task": "rw_16.jsonl", "id": 42965, "text": "After you successfully cancel, we will stop providing you with products or services, and delete your corresponding personal information or anonymous processing according to the requirements of applicable laws.", "label": ["Important", "Edit/Control"], "rewrite": "After cancellation, personal information will be deleted or anonymous."}
{"task": "rw_16.jsonl", "id": 42966, "text": "When choosing to cancel the current Meitu account, the cancellation is irreversible. After the cancellation, the Meitu account cannot be logged in and cannot be retrieved.", "label": ["Important", "Edit/Control"], "rewrite": "Once the cancellation is completed, it will not be restored."}
{"task": "rw_16.jsonl", "id": 42967, "text": "All information (including but not limited to your personal information, fans, publishing works, comments, likes, trading information, etc.) will be cleared, and your friends will be cleared.The account account is contacted, please handle it carefully.", "label": ["Important", "Edit/Control"], "rewrite": "All the information in the account will be cleared."}
{"task": "rw_16.jsonl", "id": 42968, "text": "6. Response of your claims", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42969, "text": "To ensure safety, when you propose the above right claims, you may need to provide a written request or prove your identity in other ways.", "label": ["Important", "Data Security"], "rewrite": "When you claim your rights, you need to provide a written request or prove your identity in other ways."}
{"task": "rw_16.jsonl", "id": 42970, "text": "We will process your request after verifying your identity.", "label": ["Important", "Data Security"], "rewrite": "We will process your request after verifying your identity."}
{"task": "rw_16.jsonl", "id": 42971, "text": "Under normal circumstances, we will respond in [15].", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42972, "text": "For your reasonable request, we do not charge fees in principle, but we will charge a certain fee as appropriate for requests that repeat and beyond the reasonable limit.", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42973, "text": "For information that is not directly associated with your identity, unprecedented information, or too many technical means (for example, you need to develop a new system or change the current practice fundamentally), bring risks or unrealistic requests to other people's legitimate rights and interests to othersWe may refuse.", "label": ["Important", "Data Security"], "rewrite": "We may refuse to repeat for unseen, need too much technical means, bring risks or very unrealistic requests to others' legitimate rights and interests."}
{"task": "rw_16.jsonl", "id": 42974, "text": "In the following circumstances, in accordance with the requirements of laws and regulations, we will not be able to respond to your request:", "label": ["Important", "Edit/Control"], "rewrite": "In the following circumstances, in accordance with the requirements of laws and regulations, we will not be able to respond to your request:"}
{"task": "rw_16.jsonl", "id": 42975, "text": "1) Related to national security and national defense security;", "label": ["Edit/Control", "Important"], "rewrite": "If your request is directly related to national security and national defense security, you may not be responded."}
{"task": "rw_16.jsonl", "id": 42976, "text": "2) Related to public safety, public health, and major public interests;", "label": ["Important", "Edit/Control"], "rewrite": "Your request is directly related to public safety, public health, and major public interests and may not be responded."}
{"task": "rw_16.jsonl", "id": 42977, "text": "3) Related to crime investigation, prosecution, trial, and execution judgment;", "label": ["Important", "Edit/Control"], "rewrite": "Your request is related to criminal investigation, prosecution, and trial, and may not be responded."}
{"task": "rw_16.jsonl", "id": 42978, "text": "4) There is sufficient evidence that the subject of personal information has subjective malicious or abuse of rights;", "label": ["Important", "Edit/Control"], "rewrite": "If we have sufficient evidence that the subject of personal information has subjective malice or abuse of rights, we may not be able to respond to requests."}
{"task": "rw_16.jsonl", "id": 42979, "text": "5) Response your request will cause the legitimate rights and interests of you or other individuals and organizations to be seriously damaged;", "label": ["Important", "Edit/Control"], "rewrite": "We may not be able to respond to requests that exceed the storage range, exceed the reasonable limit, or the legitimate rights and interests of personal information subjects or other individuals and organizations will be seriously damaged."}
{"task": "rw_16.jsonl", "id": 42980, "text": "6) Involved in business secrets.", "label": ["Important", "Edit/Control"], "rewrite": "We may not be able to respond."}
{"task": "rw_16.jsonl", "id": 42981, "text": "6. How do we deal with the personal information of minors", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42982, "text": "1. Limited by the characteristics of this product, our company has not developed product functions that identify your real age. Our products are mainly adults.", "label": ["Specific Audiences", "Important"], "rewrite": "Our products are mainly for adults."}
{"task": "rw_16.jsonl", "id": 42983, "text": "Without the consent of parents or guardians, minors should not create their own personal information main account.", "label": ["Specific Audiences", "Important"], "rewrite": "Without the consent of parents or guardians, minors should not create their own personal information main account."}
{"task": "rw_16.jsonl", "id": 42984, "text": "If your age is under the age of 14, before using our products and/or services, please read this policy accompanied by your guardian and ensure that your guardian has clearly agreed before using our consent before using our consent.Serve.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a child under the age of 14, please read the privacy policy with your guardian and use services under the consent and guidance of the guardian."}
{"task": "rw_16.jsonl", "id": 42985, "text": "2. For the consent of the guardian to collect the personal information of minors to collect our products or services, we will only process this information with laws and regulations permit, the guardian clearly agrees or protects the necessary minors.", "label": ["Policy Change", "Specific Audiences", "Important"], "rewrite": "We will only process the personal information of minors without laws and regulations, the guardian clearly agree or protect the necessary minors."}
{"task": "rw_16.jsonl", "id": 42986, "text": "3. If your guardian does not agree that you use our services or provide personal information to us in accordance with this policy, please immediately terminate our services and inform us in time.", "label": ["Specific Audiences", "Important"], "rewrite": "If the guardian does not agree that you can use services or provide information on this policy, please immediately terminate our services and inform us in time."}
{"task": "rw_16.jsonl", "id": 42987, "text": "4. If you are a parent or a guardian, if you have any questions about using our product/service or the user information you provided to us, please contact us in time.", "label": ["Specific Audiences", "Important"], "rewrite": "If the guardian has doubts about children's service or information, please contact us."}
{"task": "rw_16.jsonl", "id": 42988, "text": "5. If we find that we have collected minor personal information without obtaining the consent of the guardian, we will try to delete relevant personal information of the relevant minor as soon as possible.", "label": ["Specific Audiences", "Important"], "rewrite": "If the personal information of minors was collected without the consent of the legal guardian, he would try to delete relevant information as soon as possible."}
{"task": "rw_16.jsonl", "id": 42989, "text": "At the same time, in order to protect personal information security of minors, we have set up a special \"Protection Rules for the Personal Information of the Minor\". Please read it carefully.", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42990, "text": "7. How can your personal information be transferred globally", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42991, "text": "We will strictly store personal information collected by the People's Republic of China (hereinafter referred to as \"China\") in accordance with the provisions of laws and regulations.", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in domestic operations will be stored in China."}
{"task": "rw_16.jsonl", "id": 42992, "text": "We will not transmit the above information abroad. When it is really necessary to transmit to overseas, we will follow relevant national laws and regulations to evaluate and certify, and obtain your separate consent.", "label": ["Important", "Data Security"], "rewrite": "If we need to transmit information to overseas, we will follow the laws and regulations to evaluate, certify, and obtain your separate consent."}
{"task": "rw_16.jsonl", "id": 42993, "text": "8. Applicable laws and jurisdictions", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42994, "text": "This Wink personal information protection policy applies to the laws of the People's Republic of China.", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42995, "text": "The controversy under this Wink personal information protection policy is under the jurisdiction of the defendant's residence.", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42996, "text": "Nine, how to update this policy", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42997, "text": "Our Wink personal information protection policy may be changed in time according to business adjustment, laws and regulations or policies.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_16.jsonl", "id": 42998, "text": "Without your clear consent, we will not reduce the rights that you should enjoy in accordance with this Wink personal information protection policy.", "label": ["Policy Change", "Important"], "rewrite": "Without your clear consent, we will not reduce the rights that you should enjoy in accordance with this Wink personal information protection policy."}
{"task": "rw_16.jsonl", "id": 42999, "text": "After this policy is updated, we will issue a updated version and remind you of the updated content through private messages, notifications, announcements or other appropriate ways before the update.", "label": ["Policy Change", "Important"], "rewrite": "After this policy is updated, we will remind you of the updated content before the updated terms takes effect, so that you can understand the latest version of this policy in time."}
{"task": "rw_16.jsonl", "id": 43000, "text": "If the type of change in this policy involves the processing purpose, processing methods and personal information types of human information, our company will re -obtain your consent.", "label": ["Policy Change", "Important"], "rewrite": "If the type of change in this policy involves the processing purpose, processing methods and personal information types of human information, our company will re -obtain your consent."}
{"task": "rw_16.jsonl", "id": 43001, "text": "If you do not agree with the modified Wink personal information protection policy, you have the right and immediately stop using our products and/or services.", "label": ["Policy Change", "Important"], "rewrite": "If you do not agree with the modified personal information protection policy, you have the right to stop using it immediately."}
{"task": "rw_16.jsonl", "id": 43002, "text": "If there is a doubt about the update of this policy, please contact us in time through the contact information of this policy.", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 43003, "text": "10. Our contact information", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 43004, "text": "Our company is [Xiamen Hongtian Chuangshi Technology Co., Ltd.], which is established in the People's Republic of China, and is the only operating subject of Wink. Register address: Xiamen Torch High-tech Zone Software Park Huaxun Tower B1F-055.", "label": ["Important", "Contact Information"], "rewrite": "Registration address: Xiamen Torch High-tech Zone Software Park Huaxun Tower C District B1F-055."}
{"task": "rw_16.jsonl", "id": 43005, "text": "The developers of this product are Xiamen Meitu.com Technology Co., Ltd.", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 43006, "text": "If you have any questions, opinions, suggestions, or appeal about the content of this policy, you can contact us in the following ways: Please send an email to the personal information protection specialist mailbox: legal@meitu.com, or you can register the letter to send it to:Software Park 2, Software Park, Xiamen City, the People's Republic of China.", "label": ["Important", "Contact Information"], "rewrite": "Personal Information Protection Specialist Email: Legal@meitu.com; Post Address: 1-3 Floor, Unit 2, Building 2, Hai Road, Software Park, Simpo District, Xiamen City, Xiamen City, China."}
{"task": "rw_16.jsonl", "id": 43007, "text": "Eleven, appendix: authority application and application scenario list", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 43008, "text": "Here is only the relevant instructions of the permissions. When you use a specific product function, we will apply for the permissions required to use the function. If you do not agree to turn on the permissions, please click \"Not allowed\", or you want to withdraw authorized authorization.You can turn off your authorized authority in the setting function of the device.", "label": ["Important", "Edit/Control"], "rewrite": "If you want to withdraw authorization, you can turn off your authorized authority in the setting function of the device."}
{"task": "rw_16.jsonl", "id": 43009, "text": "Application for refusing or withdrawal of this permissions will only affect your use of specific product functions.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_16.jsonl", "id": 43010, "text": "Here we list you the type of permissions and its purpose that the product will be collected.", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 43011, "text": "APP permissions", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 43012, "text": "Power and acquisition of information description Permissions and business scenarios", "label": [], "rewrite": []}
{"task": "rw_16.jsonl", "id": 43013, "text": "Storage permissions (writing), accessing the album information, writing and reading external storage, which is used to save the pictures and videos that are edited by the user.", "label": ["Permission Acquisition", "Important"], "rewrite": "Get the storage permissions (writing) access album information, write and read external storage, and save the files that have been edited by the user to save the files to the local and other file saving functions."}
{"task": "rw_16.jsonl", "id": 43014, "text": "Storage permissions (read), read external storage, read local pictures, videos and other files to help users perform normal download and access to pictures, video beautification.", "label": ["Permission Acquisition", "Important"], "rewrite": "Get the storage permissions (read) read external storage and read local pictures, videos and other files to help users perform normal download and access to pictures, video beautification."}
{"task": "rw_16.jsonl", "id": 43015, "text": "Notice permissions, send notifications to users, push platform activities, marketing information, etc. to users.", "label": ["Permission Acquisition", "Important"], "rewrite": "Get the notification permissions to push platform activities, marketing information, etc. to users."}
{"task": "rw_16.jsonl", "id": 43016, "text": "Camera permissions, allowing the use of cameras, the functions of taking pictures or video recording of the product: including picture beautification and video beautification.", "label": ["Permission Acquisition", "Important"], "rewrite": "The function of obtaining camera permissions for product camera or video recording: including picture beautification and video beautification."}
{"task": "rw_16.jsonl", "id": 43017, "text": "Phone permissions/device permissions, read the status of the mobile phone, read the mobile phone status, involve IMEI information of user devices, to identify users, ensure your account, network, operation and system security, prevent fishing websites fraud and Trojan virus and perform performed by the Trojan horses virus and perform performed by the Trojan virus and perform performed by the Trojan virus.User data statistics (installation, activity, etc.).", "label": ["Permission Acquisition", "Important"], "rewrite": "Get the phone permissions/equipment authority read the mobile phone status, involving IMEI information of user equipment, to identify users, ensure your account, network, operation and system security, prevent fishing websites fraud and Trojan virus and user data statistics (installation, Activity, etc.)."}
{"task": "rw_16.jsonl", "id": 43018, "text": "Recording permissions, allowing the use of microphones for recording functions in the product video editing module, to support users to record or commentary as a video recording.", "label": ["Permission Acquisition", "Important"], "rewrite": "Get the recording right limits for recording functions in the product video editing module, supporting users to recording bearing or commentary as a video recording."}
{"task": "rw_16.jsonl", "id": 43019, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
