{"task": "rw_14.jsonl", "id": 42002, "text": "\"Baidu\" mobile application privacy policy", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42003, "text": "Welcome to the services provided by the \"Baidu\" mobile application!", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42004, "text": "Baidu (this privacy policy refers to Beijing Baidu Net News Technology Co., Ltd., also known as \"we\") attaches great importance to your privacy protection and personal information protection.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42005, "text": "This privacy policy is suitable for access and use of various services provided by \"Baidu\" mobile applications in any way.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42006, "text": "In order to avoid unnecessary, the \"Baidu\" mobile application in this privacy policy (in some functional scenarios in this \"Baidu\" mobile application, also known as \"Baidu APP\" or \"This software\")\"Mobile application products do not refer to other mobile application products from Baidu or its affiliates.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42007, "text": "You can search for information, browse information, watch videos or live broadcasts, publish and interact, shopping/payment, read novels and animation, social and attention, instant messaging, query weather, mini games, download files, registration/registration/registration/registration/registration/registration.Log in to Baidu account, etc. (hereinafter collectively referred to as \"'Baidu' Mobile Application Products or Service\").", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42008, "text": "We will only handle personal information you need to use products or services.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42009, "text": "\"Baidu\" mobile applications include, but not limited to multiple application versions such as iOS and Android. Please select a version that matches the installed terminal device when using the \"Baidu\" mobile application.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42010, "text": "The personal information that \"Baidu\" mobile application may obtain depends on the \"Baidu\" mobile application version you use, the specific type/version of the terminal device you use, and the functions you use.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42011, "text": "This privacy policy aims to help you understand which personal information we will collect, why these personal information is collected, what these personal information will use and how to protect these data.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42012, "text": "We will solicit your separate consent in strict accordance with the requirements of laws and regulations.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42013, "text": "In addition to this privacy policy, we may also explain the rules of our personal information through product page notifications, pop -ups prompts, information push, etc.The specific rules have the same effect as the privacy policy.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42014, "text": "Unless laws and administrative regulations have other provisions, in response to how we handle your personal information, you have the right to know and decide, and have the right to restrict or reject us or other parties to deal with your personal information;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42015, "text": "At the same time, you have the right to ask us to explain to the personal information processing rules we provide.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42016, "text": "Please read and understand the privacy policy carefully before using the \"Baidu\" mobile application and related products and services to make appropriate choices.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42017, "text": "This privacy policy will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42018, "text": "1. The information we collect and the corresponding purpose of the use", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42019, "text": "2. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42020, "text": "3. How do we share, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42021, "text": "4. How do we save and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42022, "text": "5. Your rights", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42023, "text": "6. How do we deal with the personal information of minors", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42024, "text": "7. How to update this policy", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42025, "text": "8. How to contact us", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42026, "text": "We know the importance of personal information to you, and also know that effective protection for your information is the cornerstone of our business healthy and sustainable development.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42027, "text": "Thank you for your use and trust in \"Baidu\"!", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42028, "text": "We are committed to maintaining your trust in us, abiding by the following principles, and protecting your personal information: the principles of consistency and responsibility, the principles of clear purpose, the principle of choice, at least the principle of safety, the principles of safety, the principle of subject participation, the principle of openness and transparency, etc.Essence", "label": ["Data Security"], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42029, "text": "We solemnly promise that we will take corresponding security protection measures to protect your personal information in accordance with the mature safety standards of the industry.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42030, "text": "1. The information we collect and the corresponding purpose of the use", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42031, "text": "We will follow the principles of legitimate, correct, and necessary to collect and use your personal information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42032, "text": "Specifically, we collect and process your personal information for your corresponding business functions.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42033, "text": "In the corresponding features, if you provide personal information of others, please make sure that you have obtained the authorization of the relevant subject, we reserved the right to check the legal source of these personal information at any time.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42034, "text": "You need to provide us with personal information for us to realize the basic business functions of \"Baidu\" mobile applications.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42035, "text": "In order to achieve the necessary personal information necessary for the information necessary for basic business functions, if you refuse to provide these necessary personal information, we will not be able to provide you with the information necessary for the basic business functions.The purpose you use will be told you and processed this information based on your authorization consent. If you refuse to provide such non -necessary personal information, it will not affect your basic business functions.", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to achieve basic business functions, you need to provide the necessary personal information to do not need to realize the information necessary to achieve basic business functions. We will tell you the purpose of use and processing this information based on your authorization consent."}
{"task": "rw_14.jsonl", "id": 42036, "text": "In addition to basic business functions, you can choose to provide us with some personal information to expand business functions for us to realize the \"Baidu\" mobile application.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42037, "text": "We will process these personal information based on your authorization consent or realize the necessary purpose of expanding business functions.", "label": ["Usage"], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42038, "text": "You refuse to provide such expansion business functions, which will not affect your basic business functions, but if you refuse to provide personal information necessary for implementing the function of expanding business functions, we will not be able to provide you with expanded business functions.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42039, "text": "To facilitate your understanding, we will be listed below to the business functions, processing purposes and personal information of the provided:", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42040, "text": "1.1. Search, browse", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42041, "text": "You can use the search and browsing service of the \"Baidu\" mobile application without logging in to the Baidu account.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42042, "text": "In order to fulfill the cyber security guarantee obligations stipulated in laws and regulations, the management responsibility of Internet information content, and the more content that shows the correlation and what you may be interested in, our server will automatically record your activity information according to law, including the following:", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The server will automatically record your activity information in accordance with the law to fulfill the obligation of network security, the management responsibility of Internet information content, and a more relevant display for you."}
{"task": "rw_14.jsonl", "id": 42043, "text": "The search keyword information you entered", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42044, "text": "Your browsing records, your collection, publishing, attention, comments, likes, reposting and other operating behavior records", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42045, "text": "Your live broadcast/information flow/video playback information and operating behavior record", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42046, "text": "Your device information", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42047, "text": "Your other log information", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42048, "text": "We may also use the aforementioned information to bring you more convenient search and information flow services to continuously improve the \"Baidu\" mobile application products and services.", "label": ["Important", "Usage"], "rewrite": "We may use your behavior information to provide you with more convenient search and information flow services."}
{"task": "rw_14.jsonl", "id": 42049, "text": "For this purpose, we may also use the browser network storage and other mechanisms (including HTML5) and application data cache to collect information on your device and perform local storage.", "label": ["Data Retention", "Important"], "rewrite": "We may collect information on your device and make local storage."}
{"task": "rw_14.jsonl", "id": 42050, "text": "1.2. Register and log in to account", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42051, "text": "You can create a Baidu general account with your mobile phone number, and you can improve your account information.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can create a Baidu general account with your mobile phone number and improve your account information."}
{"task": "rw_14.jsonl", "id": 42052, "text": "When registering and logging in to Baidu general account, you need to provide us with your mobile phone number.", "label": ["Important", "First Party Collection Information"], "rewrite": "When registering and logging in to Baidu general account, you need to provide your mobile phone number."}
{"task": "rw_14.jsonl", "id": 42053, "text": "You can choose to set the account name, avatar, login password, account binding mailbox.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can choose to set the account name, avatar, login password, account binding mailbox."}
{"task": "rw_14.jsonl", "id": 42054, "text": "You can also log in to the \"Baidu\" mobile application with a third -party account (such as WeChat, Weibo, QQ).", "label": ["Important", "First Party Collection Information"], "rewrite": "You can also use a third -party account to log in to \"Baidu\" mobile application."}
{"task": "rw_14.jsonl", "id": 42055, "text": "At this time, you will authorize the \"Baidu\" mobile application to get the public information registered in the third -party account (including your nickname, avatar, and other information you authorize).", "label": ["Important", "First Party Collection Information"], "rewrite": "You will authorize the \"Baidu\" mobile application to get the public information you register in the third -party account."}
{"task": "rw_14.jsonl", "id": 42056, "text": "In order to meet the compulsory requirements of laws and regulations, for providing products or services, or based on your demand for enhanced account protection levels, when you use the \"Baidu\" mobile application for certain services or if you have further needs, you need to provide it withYour real name, ID number, and face information complete the real -name authentication of the account number.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use certain services or you have further needs, you need to provide your real name, ID number, face information to complete the real -name authentication of the account number."}
{"task": "rw_14.jsonl", "id": 42057, "text": "If you do not register your account and log in to the \"Baidu\" mobile application, it will not prevent you from using most of the business functions of the \"Baidu\" mobile application, but it may affect the business functions that you need to use by real -name authentication.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you do not register an account and log in to the \"Baidu\" mobile application, it may affect the business functions that need to be used by real -name authentication."}
{"task": "rw_14.jsonl", "id": 42058, "text": "In order to verify the accuracy and integrity of the information, or to ensure your account security, we may make your corresponding information preserved by the agencies or government agencies allowed by the real -name information and laws and regulations provided to BaiduComparison test.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We may compare and verify the real -name information you provide with your corresponding information preserved by the rights agency."}
{"task": "rw_14.jsonl", "id": 42059, "text": "You can choose whether to log in to the \"Baidu\" mobile application by yourself. If you choose the login method, the operator will process your mobile phone number information.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you choose to log in \"One -click login\", the operator will process your mobile phone number information."}
{"task": "rw_14.jsonl", "id": 42060, "text": "1.3. Release and interaction", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42061, "text": "When you publish the content of text dynamics, articles, audio and video, pictures, etc., or open broadcast or comment, we will collect the information, feedback, reviews, uploaded pictures, audio and video content, etc., and display your nicknames, etc., and show your nicknames, Avatar, publishing content and information, or recommending related content publishers for you.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you publish the content of text dynamics, articles, audio and video, pictures, etc., or open broadcast or comment, we will collect the information, feedback, reviews, etc. of your release, and display your nicknames, avatars, content and information, or as information, or as to, or as to, or to be as information, or as a information, or as a information, or as a information, or as a information, or to be, or as a information, or as a information, or as a information, or as a information, or as a information, or as a information, or information, or as a information, or as a information, or information, or as a information, or information, it is to be it, or it is for it.You recommend related content publishers."}
{"task": "rw_14.jsonl", "id": 42062, "text": "When you publish pictures and audio and video functions, we will apply for the cameras, photos, and recording rights of your device system.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you publish pictures and audio and video functions, we will apply for the cameras, photos, and recording rights of your device system."}
{"task": "rw_14.jsonl", "id": 42063, "text": "If you refuse to authorize, you will not be able to use the corresponding function, but it does not affect other functions that you can achieve based on the above permissions without affecting your normal use of the \"Baidu\" mobile application;", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42064, "text": "At the same time, when you choose to show where you are published, we will apply for your location authority to meet your needs. If you refuse to provide it, it will not affect your normally publishing function.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you choose to show where you are published, we will apply for your location rights to meet your needs."}
{"task": "rw_14.jsonl", "id": 42065, "text": "When you use live broadcasts and other functions, in order to provide you with filter and face stickers, we will process your facial information locally. Our processing is only for this function, and unless there is a clear explanation and obtain yourAgree, we will not return, store or share any facial feature value information.", "label": ["Data Retention", "Important", "Usage"], "rewrite": "When you use live broadcasts and other functions, we will handle your facial information locally and will not return, store or share any facial feature value information."}
{"task": "rw_14.jsonl", "id": 42066, "text": "When you pay attention to or share your account, or browse, collecting, following attention, comments, likes, and reposting, we will collect your aforementioned information and display the content published by the corresponding content publisher, or recommend you that you may be interested in you.Publishes of similar content or content, gathered to show your public interaction information to the publisher.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you pay attention to or share your account, or browse, collecting, paying attention, comments, likes, and reposting, we will collect your aforementioned information and show you or recommend it to you."}
{"task": "rw_14.jsonl", "id": 42067, "text": "When you make information sharing or receive information, we will read the passwords, links and other contents in the shear plate to realize the jump and sharing of the information content.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you make information sharing or receive information, we will read the passwords, links and other contents in the shear plate to realize the jump and sharing of the information content."}
{"task": "rw_14.jsonl", "id": 42068, "text": "In principle, the information you choose to publish publicly will be visible to all users. If you involve your personal information and even sensitive personal information, please consider it carefully.", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "In principle, the information you choose to publish publicly will be visible to all users."}
{"task": "rw_14.jsonl", "id": 42069, "text": "If your personal information involves the personal information of others, you need to obtain the consent of others before disclosure.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42070, "text": "1.4. Voice search, picture search", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42071, "text": "\"Baidu\" mobile application provides you with equipment -based voice recognition and picture recognition functions to provide you with voice search services and picture search services.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42072, "text": "If you use voice search services, we will apply for the recording authority of your device system.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you use voice search services, we will apply for recording authority."}
{"task": "rw_14.jsonl", "id": 42073, "text": "After your authorization and consent, we will collect your voice information, send your voice instructions to the server, and then give feedback based on your voice instructions.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will give feedback based on your consent to collect voice information to the server, and then make feedback based on your voice instructions."}
{"task": "rw_14.jsonl", "id": 42074, "text": "You can learn more about voice search services through [Mine]-[Settings]-[Voice Settings] through the \"Baidu\" mobile application.", "label": ["Edit/Control", "Important"], "rewrite": "You can learn more about voice search services by [Mine]-[Settings]-[Settings]."}
{"task": "rw_14.jsonl", "id": 42075, "text": "If you use a picture search service, we will apply for the album authority and camera permissions of your equipment system, so that you can upload pictures or take pictures through the album.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you use a picture search service, we will apply for your album authority and camera authority."}
{"task": "rw_14.jsonl", "id": 42076, "text": "After you have authorized consent, we will collect your picture information, send your picture to the server, and then give feedback based on your picture.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect the picture information to the server by your consent, and then give feedback based on your picture."}
{"task": "rw_14.jsonl", "id": 42077, "text": "If you use a picture search service, choose a face -to -face search to provide you with the function of measuring facial features, skin testing, virtual makeup testing, measuring human settings, and blessing qi. We will also collect and process the facial picture information you provideFacial pictures are sent to the server, and then feedback based on your picture, our processing is only used for this function.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If you choose a face -to -face search when you use the picture search service, we will also collect and process the facial picture information you provide to send it to the server to make feedback."}
{"task": "rw_14.jsonl", "id": 42078, "text": "You can obtain your recording authority, album permissions, and camera permissions by canceling the system authorized \"Baidu\" mobile application at any time to stop our collection of your information. After that, you may not be able to use the above -mentioned related services based on voice information and picture information.Or features, or the effect of the relevant services provided by the above -mentioned voice information and picture information, it will not affect other business functions that can be realized based on the above permissions that are not based on the above permissions.", "label": ["Important", "Edit/Control"], "rewrite": "You can obtain your recording authority, album permissions, and camera permissions by canceling the \"Baidu\" mobile application at any time."}
{"task": "rw_14.jsonl", "id": 42079, "text": "1.5. New service and functional operation and customer service processing", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42080, "text": "\"Baidu\" mobile applications will launch operating activities for newly launched services and functions from time to time. For example, the new service launched needs to handle your personal information or application equipment system permissions, and before with your authorization consent, we will obtain you separately.Agree, if it involves the processing of sensitive personal information, we will obtain your separate consent.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "If the new service launched needs to handle your personal information or apply for equipment system permissions, and before your authorization consent, we will get your consent separately."}
{"task": "rw_14.jsonl", "id": 42081, "text": "If you participate in related operating activities, we may collect but not be limited to your identity information, contact information, and trading account information through the operating activity interface to get in touch with you and send operation rewards to you.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If you participate in related operational activities, we may collect but not be limited to your identity information, contact information, and trading account information to get in touch with you and send operation rewards to you."}
{"task": "rw_14.jsonl", "id": 42082, "text": "If you do not participate in related operating activities, you do not need to provide the aforementioned information.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42083, "text": "If you need to make an appointment for live activities or operating activities, we may apply for the calendar permissions of the equipment system. You can at any time to authorize the system to access your calendar by cancel the system of \"Baidu\" mobile applications, stop our collection of your calendar information, and then then the collection of your calendar information. After that, our calendar information is collected.You may not be able to use the relevant services or functions provided by the above calendar -based information, or to achieve the effect of the relevant services provided by the above calendar -based information, but it will not affect your normal use of the \"Baidu\" mobile application.The business function that can be implemented;", "label": ["Permission Acquisition", "Important", "Edit/Control"], "rewrite": "If you need to make an appointment for live activities or operating activities, we may apply for the calendar authority of the equipment system, and you can cancel the system authorization at any time."}
{"task": "rw_14.jsonl", "id": 42084, "text": "If you need to invite friends to participate in the event, we may apply for a visit to your address book. With the consent of your authorization, we will use the information in the communication record to be high -intensity encryption and then use it to recommend friends who can participate in the event in the address book.If you refuse to visit your address book, you can also invite friends to participate in the event in other ways.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "If you need to invite friends to participate in the event, we may apply for access to your address book and approve you to encrypt the information and then recommend friends who can participate in the event in the address book."}
{"task": "rw_14.jsonl", "id": 42085, "text": "If you have questions about the products and services we provide or need customer service intervention for disputes, in order to verify your identity and position your problem, you may need to provide your identity information for verification.", "label": ["Important", "Data Security"], "rewrite": "If you have questions about product services or need customer service intervention for disputes, you may need to provide your identity information for verification."}
{"task": "rw_14.jsonl", "id": 42086, "text": "In order to ensure the quality of calls and ensure that the dispute is properly resolved, we may save your communication records with us, including call records, related information you provided with your disputes, and contact information you use or retained.", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to ensure the quality of calls and ensure that the dispute is properly resolved, we may save your communication records with us."}
{"task": "rw_14.jsonl", "id": 42087, "text": "1.6. Friends recommendation", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42088, "text": "We will recommend friends to you and other users based on your browsing records, attention situation, fan situation, link sharing, interactive behavior and other information.", "label": ["Important", "Usage"], "rewrite": "We will recommend friends to you and other users based on your browsing records, attention situation, fan situation, link sharing, interactive behavior and other information."}
{"task": "rw_14.jsonl", "id": 42089, "text": "1.7. Receive address management and mobile phone recharge", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42090, "text": "If you use the receipt address management and mobile phone recharge function, we may apply for access your address book. After you have authorized the consent, you can quickly fill in the related mobile phone number you read by reading the address book.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you use the receiving address management and mobile phone recharge function, we may apply for access to your communication records to fill in the address book to quickly fill."}
{"task": "rw_14.jsonl", "id": 42091, "text": "You can access your address book by littering the \"Baidu\" mobile application at any time to stop the collection of your address book information. After that, you may not be able to use the relevant services or functions provided by the above -mentioned address book information, or it cannot meetThe above -mentioned relevant services provided by the address book information are intended to achieve, but it will not affect your normal use of the \"Baidu\" mobile application other business functions that can be realized based on the communication record right.", "label": ["Permission Acquisition", "Important"], "rewrite": "You can access your address book by cancel the system \"Baidu\" mobile applications at any time."}
{"task": "rw_14.jsonl", "id": 42092, "text": "1.8. News notice", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42093, "text": "Please know and agree that for your contact information (for example: contact telephone number) provided in the process of using the product and/or service, we may send one or more types of notifications to one or more in operation.Used for user messages, authentication, security verification, and user experience survey.", "label": ["Important", "Usage"], "rewrite": "We may send notifications to the contact information provided by you during operation, for user messages, authentication, security verification, and user experience research."}
{"task": "rw_14.jsonl", "id": 42094, "text": "In addition, we may also provide you with commercial information such as services, functions, or activities that may be interested in. If you do not want to accept this information, you can refund the withdrawal method provided in the phone SMSYou can also contact us directly to the withdrawal.", "label": ["Important", "Usage"], "rewrite": "We may provide you with commercial information in a SMS and phone call. You can withdraw bips."}
{"task": "rw_14.jsonl", "id": 42095, "text": "1.9. Additional function of location information", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42096, "text": "When you use the \"Baidu\" mobile application to provide related services based on position, we may collect and process your equipment information, location information, network identity identification information, so that you can use it manually to enter your geographical coordinates, you can use it.Ready related services.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the relevant services provided by the location, we may collect and process the information, location information, and network identity information about your equipment information, location information, and network identity identification information."}
{"task": "rw_14.jsonl", "id": 42097, "text": "Location information includes the accurate location information obtained by the WLAN access point, Bluetooth, base station, and other sensor information, as well as rough geographical location information obtained through IP addresses or other network information.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42098, "text": "When you use the following features, we will request accurate geographical location permission. If you refuse to authorize the accurate geographical location permissions, we will not provide you with the above services according to the accurate location information. We will only via the IP address or other network information.The corresponding cities and/or district and county information, and the rough location information speculated by other network location information to provide you with services.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use the following features, we will request accurate geographical location permission, otherwise we will provide services through the IP address."}
{"task": "rw_14.jsonl", "id": 42099, "text": "Please understand that the IP address information we use is de -identified. Data analysis and speculation only correspond to the coding that only corresponds to your identity and will not be related to your real information.", "label": ["Important", "Data Security"], "rewrite": "The IP address information we use is degraded to identify, and will not be associated with your real information."}
{"task": "rw_14.jsonl", "id": 42100, "text": "When you use the search service, in order to provide you with more accurate search results recommendation, we will collect your location information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use a search service, we will collect your location information to provide more accurate search results recommendation."}
{"task": "rw_14.jsonl", "id": 42101, "text": "When you use the information flow service, in order to provide you with personalized content recommendation, we will collect your location information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the information flow service, we will collect your location information to provide personalized content recommendation."}
{"task": "rw_14.jsonl", "id": 42102, "text": "When you use local channel services or urban channel services, in order to provide you with more accurate local or your city information, we will collect your location information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use local channel services or urban channel services, we will collect your location information to provide information from local or located."}
{"task": "rw_14.jsonl", "id": 42103, "text": "When you use weather services, in order to provide accurate weather information to you anymore, we will collect your location information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the weather service, we will collect your location information to provide weather information anytime, anywhere."}
{"task": "rw_14.jsonl", "id": 42104, "text": "When you use Baidu Flash Payment service, in order to show you nearby merchants and discount activities, we will collect your location information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use Baidu flash payment service, we will collect your location information to display nearby merchants and preferential activities."}
{"task": "rw_14.jsonl", "id": 42105, "text": "When you use the welfare center service, in order to provide refined operating services, we will provide different operating activities for users in different regions. We will collect your location information so that you can recommend more accurate operating information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the welfare center service, we will collect your location information to recommend more accurate operating information to you."}
{"task": "rw_14.jsonl", "id": 42106, "text": "When you use the information release service, in order to provide you with the information release service of \"adding position\", we will apply for your location information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use information release services, we will apply for your location information to provide \"adding position\" information release services."}
{"task": "rw_14.jsonl", "id": 42107, "text": "When you use the address service, in order to facilitate your quick filling address information, we may apply for your location information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the address service, we may apply for your location information to facilitate you to fill in the address information."}
{"task": "rw_14.jsonl", "id": 42108, "text": "You can access your accurate location information by cancel the system \"Baidu\" mobile application at any time to stop the collection of your precise geographical location information. After that, you may not be able to use the relevant services or functions provided by the above -mentioned accurate location information, or you mayIt is impossible to achieve the effect of the relevant services provided by the above -mentioned accurate location information.", "label": ["Edit/Control", "Important"], "rewrite": "You can access your accurate location information by cancel the system \"Baidu\" mobile applications at any time."}
{"task": "rw_14.jsonl", "id": 42109, "text": "But this does not affect your normal use of \"Baidu\" mobile application other business functions that can be achieved based on accurate location information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42110, "text": "1.10. To ensure service security, optimization and improve service purposes", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42111, "text": "When you use the \"Baidu\" mobile application, in order to ensure that you use the \"Baidu\" mobile application service normally, it is more accurate and solve the problems you encountered when using the \"Baidu\" mobile application service, and improve and optimize the \"Baidu\" mobile applicationThe service experience to ensure your account security, prevent, discover, investigate fraud, harm security, illegal or violate our agreement, policies, or rules to protect you, our or our related companies, partners and the public in the public.For legitimate rights and interests, we will collect your equipment information, location information, log information, and other information related to the login environment.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect your equipment information, location information, log information, and other information related to the login environment to ensure service security, optimization and improvement of service purposes."}
{"task": "rw_14.jsonl", "id": 42112, "text": "Please understand that when you will be switched to the equipment background in the device screen to run, due to some equipment models and system reasons, you have previously used the information collection of \"Baidu\" mobile applications.Unable to stop immediately, which leads to a short -term background information collection behavior.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you switch the \"Baidu\" mobile application to the equipment background, you may not stop the information collection immediately."}
{"task": "rw_14.jsonl", "id": 42113, "text": "1.11. Information convergence, personalized recommendation, and automated decision -making", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42114, "text": "Gathering and integration: You agree that we will converge, identify and analyze, data portraits or further processing of personal information provided by your active or passive provided in this service through our own or subject technology, and form a variety of types and different particles.Tag information reflecting the characteristics of your behavior habits, hobbies or credit status (hereinafter referred to as \"label information\"), we will use the label information for automated decision -making in specific scenarios and purposes, push you personalized information informationAnd/or commercial marketing information.", "label": ["Important", "Usage"], "rewrite": "You agree that we will converge, identify analysis, data portrait or further processing and forming label information for your active or passive personal information provided in this service."}
{"task": "rw_14.jsonl", "id": 42115, "text": "In addition to the information in this service to gather integration, we may associate and converge for the information collected from your various devices so that we can provide you with consistent services on these devices.", "label": ["Important", "Usage"], "rewrite": "For information collected from your various devices, we may associate and gather them."}
{"task": "rw_14.jsonl", "id": 42116, "text": "For example, we may associate your device information or phone number with your Baidu account.", "label": ["Important", "Usage"], "rewrite": "We may associate your device information or phone number with your Baidu account."}
{"task": "rw_14.jsonl", "id": 42117, "text": "In the case of ensuring that personal information is under the control of the same business entity and does not change the data security guarantee capabilities and management level, it provides you with a consistent experience. You may actively or passively provided in this service mayCultivate and integrate the personal information provided by your active or passively in other product services you operate, and may form label information after further processing.middle.", "label": ["Important", "Usage"], "rewrite": "After processing your information may be used to provide you with this service or other product services that we operate."}
{"task": "rw_14.jsonl", "id": 42118, "text": "Such information that converges and fusion does not include information that can directly identify your personal identity, and we will guarantee the security processing of information after the fusion.", "label": ["Important", "Data Security"], "rewrite": "The information that gathers integration does not include information that can directly identify your personal identity."}
{"task": "rw_14.jsonl", "id": 42119, "text": "Personalized recommendation: We will use the label information and your search, browsing and other use information, equipment information and location information in search and browsing in the \"Baidu\" mobile application, so that you can recommend that you may be more interested and related.", "label": ["Important", "Usage"], "rewrite": "We will recommend you that you may be more interested and correlated based on label information and your behavior information."}
{"task": "rw_14.jsonl", "id": 42120, "text": "In the personalized recommendation service, we will provide you with convenient rejection methods at the same time. We have established an independent control mechanism for personal information (such as labels, portrait dimensions, etc.) that users rely on personalized display to ensure that you regulate personalized display of personalized displayAffairs of correlation.", "label": ["Important", "Usage", "Edit/Control"], "rewrite": "We have established the user's autonomous control mechanism of personal information that users depend on personalized display."}
{"task": "rw_14.jsonl", "id": 42121, "text": "For details, please refer to this policy \"5.9. The display and control of personalized content and advertising\"", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42122, "text": "Automation decision -making: Automated decision -making activities also depend on the processing of our use information, equipment information, location information, and label information.", "label": ["Important", "Usage"], "rewrite": "Automated decision -making activities depend on the processing of our use information, equipment information, location information, and label information."}
{"task": "rw_14.jsonl", "id": 42123, "text": "If we make a decision to have a significant impact on your personal rights and interests through automated decision -making, you have the right to explain through this policy \"8. How to contact us\" and have the right to refuse us to make decisions only through automated decision -making.Essence", "label": ["Important", "Edit/Control"], "rewrite": "The decision of automated decision -making methods has a significant impact on your personal rights and interests. You have the right to request or refuse to make a decision only through automated decision -making."}
{"task": "rw_14.jsonl", "id": 42124, "text": "1.12. Indirect collection information", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42125, "text": "In order to provide you with reasonable needs such as the quality and personalization of products/services or improvement of product services, or for consideration of product and service safety, we may follow the Baidu platform, or based on your effective authorization or based on your effective authorization or based on your effective authorization.Reception companies, partners and other trusted third -party suppliers receive your personal information and other information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may receive your personal information and other information from third -party suppliers in accordance with the provisions of laws and regulations or based on your effective authorization."}
{"task": "rw_14.jsonl", "id": 42126, "text": "We will ask the personal information provider in advance to explain the source of personal information and confirm the legality of the source of their personal information. At the same time, we will understand the scope of the authorization consent of the personal information processing of the personal information provider.If the personal information processing activity is performed beyond the scope of obtained authorization consent, we will obtain your explicit consent within the reasonable period of obtaining personal information or before processing personal information, or the provider of the personal information provided by your explicit statement by your explicit statement.agree.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "We will request personal information providers in advance to explain the source of personal information and confirm the legality of the source and the scope of authorization consent. If we exceed the scope of authorization consent, we will obtain your explicit consent."}
{"task": "rw_14.jsonl", "id": 42127, "text": "1.13. Exception of obtaining authorization in advance", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42128, "text": "Please note: In the following circumstances, collecting or using personal information does not need to obtain your authorization consent in advance:", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In the following circumstances, collecting or using personal information does not need to obtain your authorization consent in advance:"}
{"task": "rw_14.jsonl", "id": 42129, "text": "Directly related to national security and national defense security;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The collection and use information directly related to national security and national defense security does not need to solicit authorization consent."}
{"task": "rw_14.jsonl", "id": 42130, "text": "In order to establish and fulfill the individual's contract as a party, or to implement human resource management in accordance with the labor rules and regulations and collective contracts signed in accordance with the law in accordance with the law;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to establish or fulfill your contract as a party, or to implement the collection and use information necessary for human resource management in accordance with the laws and regulations formulated in accordance with the law and the collective contract signed in accordance with the law, no authorization consent is required."}
{"task": "rw_14.jsonl", "id": 42131, "text": "To fulfill the statutory duties or the requirements of the statutory duty;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to fulfill the statutory duties or the collection and usage information necessary for the statutory volunteer, there is no need to solicit authorization consent."}
{"task": "rw_14.jsonl", "id": 42132, "text": "In order to deal with emergencies, or in urgent situations, it is necessary to protect the health and property security of natural people in emergency situations;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to cope with emergencies, or in urgent cases to protect the life and health of natural persons and the necessary collection and use information, no need to solicit authorization."}
{"task": "rw_14.jsonl", "id": 42133, "text": "Directly related to criminal investigation, prosecution, trial, and execution of judgment;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Directly related to the collection and usage information such as criminal investigation, prosecution, trial, and judgment execution does not need to solicit authorization consent."}
{"task": "rw_14.jsonl", "id": 42134, "text": "It is difficult to obtain the major legitimate rights and interests such as maintaining your life, property, etc., but it is difficult to get it;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Out of maintaining major legitimate rights and interests such as life and property of you or other individuals, it is difficult to obtain the collection and use information that I agree, and there is no need to solicit authorization consent."}
{"task": "rw_14.jsonl", "id": 42135, "text": "Collect your own personal information to the public or other legally disclosure within a reasonable scope in accordance with the provisions of laws and regulations;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In accordance with laws and regulations, personal information is processed by individuals or other legal disclosure within a reasonable range, and no authorization consent is required."}
{"task": "rw_14.jsonl", "id": 42136, "text": "Collect your personal information from the legally disclosed information in accordance with the provisions of laws and regulations in accordance with the provisions of laws and regulations, such as legal news reports and government information disclosure;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collecting your personal information from the legal and publicly disclosed information in accordance with the provisions of laws and regulations in accordance with the provisions of laws and regulations, without requiring authorization consent."}
{"task": "rw_14.jsonl", "id": 42137, "text": "Implement news reports, public opinion supervision and other behaviors for public interests, and handle personal information within a reasonable range;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to implement news reports and public opinion supervision, deal with personal information within a reasonable scope without soliciting authorization consent."}
{"task": "rw_14.jsonl", "id": 42138, "text": "When academic research institutions are necessary to carry out statistics or academic research based on public interests, and provide academic research or description results, the personal information contained in the results is identified by", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When academic research institutions are necessary to carry out statistics or academic research based on public interests, and provide academic research or description results, they can identify the personal information contained in the results without requiring the consent of authorization."}
{"task": "rw_14.jsonl", "id": 42139, "text": "Other circumstances stipulated in laws and regulations.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Other collection and use information stipulated in laws and regulations does not need to solicit authorization."}
{"task": "rw_14.jsonl", "id": 42140, "text": "1.14. Anonymous processing of personal information", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42141, "text": "Under the premise of not disclosing public information and providing your personal information, Baidu has the right to excavate, analyze and use the user database after anonymous processing (including commercial use), and has the right to count the product/service usage andShare statistical information after anonymous processing with the public/third parties.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Under the premise of not disclosing and providing your personal information, Baidu has the right to dig, analyze and use the anonymous user database, and share statistics after anonymous processing."}
{"task": "rw_14.jsonl", "id": 42142, "text": "1.15.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42143, "text": "In the process of providing services, in order to ensure that you can use the product function normally, we will apply for the following system equipment permissions of your device to the system. Before the application, we will consult your consent. You can choose \"allowed\" or \"prohibited\" permissions to apply.", "label": ["Permission Acquisition", "Important"], "rewrite": "To ensure that you can use the product function normally, we will apply for your system equipment permissions to the system."}
{"task": "rw_14.jsonl", "id": 42144, "text": "After your authorization, we will turn on the relevant authority. You can cancel the authorization in the system at any time. You cancel the authorization that will cause you to unable to use related business functions, but it will not cause you to use other business functions.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42145, "text": "The calls of various business functions on system privacy rights are as follows:", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42146, "text": "Whether equipment permissions business function permission authorization can be closed", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42147, "text": "Storage, picture search, sweeping, mobile file management, file download and novel reading. When the user opens the Baidu app for the first time, the pop -up window is asked, yes", "label": ["Permission Acquisition", "Important"], "rewrite": "Get the storage right limit for picture search, sweeping, mobile file management, file download and novel reading functions."}
{"task": "rw_14.jsonl", "id": 42148, "text": "Wireless network, various business functions conduct network connections. When the user opens the Baidu app for the first time, the pop -up window inquires, yes", "label": ["Permission Acquisition", "Important"], "rewrite": "Obtain unlimited network permissions for various business functions for network connection."}
{"task": "rw_14.jsonl", "id": 42149, "text": "Location, search service; information flow service; weather service; local life service; release service; welfare zone; Baidu flash payment; address management, user first uses geographical location -related business functions", "label": ["Permission Acquisition", "Important"], "rewrite": "Get location authority for searching services, information flow services, weather services, local life services, release services, welfare zones, Baidu flash payment, address management."}
{"task": "rw_14.jsonl", "id": 42150, "text": "The address book, use the receipt address management and mobile phone recharge function; quickly fill in the related mobile phone number by reading the address book;", "label": ["Permission Acquisition", "Important"], "rewrite": "Get the authority of the communication records to use the receipt address management and mobile phone recharge function, quickly fill in the relevant mobile phone number by reading the address book, and invite friends to participate in the event."}
{"task": "rw_14.jsonl", "id": 42151, "text": "Invite friends from friends to participate in the activity users when using the address book -related business function to ask the pop -up window to ask", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42152, "text": "Camera, use image recognition and search service (AR, sweeping recognition, translation, topics, flowers, and garbage); use small video functions to shoot short videos; use Baidu flash payment scan code payment; shoot and post pictures/videos to release pictures/videosDynamic, the user asked the pop -up window when shooting the camera for the first time, yes", "label": ["Permission Acquisition", "Important"], "rewrite": "Get the camera permissions for taking pictures and using image recognition and search services."}
{"task": "rw_14.jsonl", "id": 42153, "text": "Album, upload pictures using image recognition and search services (AR, sweeping, translation, title, flower knowledge, and garbage); upload short videos with small video functions; post pictures/video dynamics; save pictures/videos to album, user users, usersWhen uploading or saving the picture/video, the pop -up window asked, yes", "label": ["Permission Acquisition", "Important"], "rewrite": "Get the album permissions for uploading pictures to use image recognition and search service, upload short videos with small video functions, release pictures/video dynamics, save pictures/videos to the album."}
{"task": "rw_14.jsonl", "id": 42154, "text": "Recording, voice search service; release video services; open live broadcast;", "label": ["Permission Acquisition", "Important"], "rewrite": "Get recording authority for voice search services, release video services, and open live broadcasts."}
{"task": "rw_14.jsonl", "id": 42155, "text": "When a voice input method is sent, a private message user uses the relevant features for the first time. The pop -up window is asked", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42156, "text": "Notification, send notification message, the user pops up when the user opens the Baidu APP for the first time.", "label": ["Permission Acquisition", "Important"], "rewrite": "Get the notification permissions for sending notification messages."}
{"task": "rw_14.jsonl", "id": 42157, "text": "Calendar, the pop -up window inquiries when the user expires reminders and other subscription functions.", "label": ["Permission Acquisition", "Important"], "rewrite": "Get the permissions of the calendar to the subscription function such as reminding the user's expiration."}
{"task": "rw_14.jsonl", "id": 42158, "text": "Telephone (some models are also called \"equipment information\" permissions), improve and optimize service experience; ensure your account security, user pop -up inquiries when the user opens the Baidu app for the first time, yes", "label": ["Permission Acquisition", "Important"], "rewrite": "Get phone permissions to improve and optimize service experience and ensure your account security."}
{"task": "rw_14.jsonl", "id": 42159, "text": "IDFA, improvement and optimization service experience; advertising recommendation; guarantee your account security, user pop -up window inquiries when you open Baidu app for the first time, yes", "label": ["Permission Acquisition", "Important"], "rewrite": "Get IDFA permissions to improve and optimize service experience, advertising recommendations, and ensure your account security."}
{"task": "rw_14.jsonl", "id": 42160, "text": "You can use the [My]-[Privacy Settings]-[Application Railive Instructions]-[Settings of Application Power Settings] to check the details of privacy permissions and close the corresponding permissions through the \"Baidu\" mobile application and turn off the corresponding permissions.", "label": ["Important", "Edit/Control"], "rewrite": "You can use the [My]-[Privacy Settings]-[Application Railive Instructions]-[Settings of Application Power Settings] to check the details of privacy permissions and close the corresponding permissions through the \"Baidu\" mobile application and turn off the corresponding permissions."}
{"task": "rw_14.jsonl", "id": 42161, "text": "In different devices, the right display method and closing method may be different. For details, please refer to the device and system developer instructions or guidance.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42162, "text": "1.16.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42163, "text": "When we want to use other purposes that the information is not stated in this privacy policy, we will solicit your consent in advance.", "label": ["Usage"], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42164, "text": "When we want to use the information collected based on specific purposes for other purposes, we will solicit your consent in advance.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42165, "text": "2. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42166, "text": "Cookie and anonymous identifier tool.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42167, "text": "Cookie is a mechanism that supports the server (or script) to store and retrieve information on the client.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42168, "text": "When you use the \"Baidu\" mobile application product or service, we will send one or more cookies or anonymous identifiers to your device.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42169, "text": "When you interact with the \"Baidu\" mobile application service, we allow Cookie or anonymous logo to send it to Baidu's server.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you interact with the \"Baidu\" mobile application service, the cookie or anonymous identifier sends the information to Baidu's server."}
{"task": "rw_14.jsonl", "id": 42170, "text": "Cookie usually contains identifiers, site names, and some numbers and characters.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42171, "text": "Using cookie technology, Baidu can understand your habits, remember your preferences, save your steps to enter duplicate information, provide you with more thoughtful personalized services, or help you judge the security of your account.", "label": ["Important", "Usage"], "rewrite": "Use cookie technology to understand your habits, preferences, simplify operations, or help you judge the security of your account."}
{"task": "rw_14.jsonl", "id": 42172, "text": "Cookie can also help us statistical traffic information, analyze the effectiveness of page design and advertising.", "label": ["Important", "Usage"], "rewrite": "Cookie can count the traffic information, analyze the effectiveness of page design and advertising."}
{"task": "rw_14.jsonl", "id": 42173, "text": "We will not use Cookie for any purpose outside the purpose of this policy.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42174, "text": "You can manage or delete according to your preferences, cookies.", "label": ["Important", "Edit/Control"], "rewrite": "You can manage or delete Cookie according to your preferences."}
{"task": "rw_14.jsonl", "id": 42175, "text": "For details, see aboutcookies.org.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42176, "text": "You can clear all the functions saved on the computer, cookies, and most of the network browsers have the functions of stopping, cookies.", "label": ["Edit/Control", "Important"], "rewrite": "You can clear all the cookies saved on the computer."}
{"task": "rw_14.jsonl", "id": 42177, "text": "But if you do this, you need to change the user settings when you visit our website, but you may not be able to log in or use the services or functions provided by Baidu that depend on Cookie because of these modifications.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42178, "text": "You can connect [Mine]-[Settings]-[Clean up the cache], choose to remove your cookie.", "label": ["Important", "Edit/Control"], "rewrite": "You can connect [Mine]-[Settings]-[Clean up the cache], choose to remove your cookie."}
{"task": "rw_14.jsonl", "id": 42179, "text": "3. How do we share, transfer, publicly disclose, entrust your personal information and the third parties to be accessed", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42180, "text": "Some of our services will be provided by authorized partners. Only in order to achieve the purpose of the privacy policy, we may share some of your personal information with our partners to provide better customer service and user experience.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share some of your personal information with your partners to use it for joint services."}
{"task": "rw_14.jsonl", "id": 42181, "text": "We will only share your personal information for legal, correct, necessary, specific, and clear purposes, and only share the personal information necessary for providing services.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only share your personal information for legal, correct, necessary, specific, and clear purposes, and only share the personal information necessary for providing services."}
{"task": "rw_14.jsonl", "id": 42182, "text": "In addition to obtaining additional authorization or laws and regulations, our partners have no right to use the personal information shared on any other purpose.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In addition to obtaining additional authorization or laws and regulations, our partners have no right to use the personal information shared on any other purpose."}
{"task": "rw_14.jsonl", "id": 42183, "text": "3.1. Sharing", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42184, "text": "Unless you have a separate consent or in accordance with other laws and regulations, we will not share your personal information from a third party other than Baidu, except for the processing that cannot be identified and cannot be restored.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Except for you in advance or other provisions of laws and regulations, we will not share your personal information from a third party other than Baidu, except for being unable to identify specific individuals and restore."}
{"task": "rw_14.jsonl", "id": 42185, "text": "Companies, organizations and individuals who share personal information with us, we will investigate their data security environment, sign strict confidentiality agreement with them, and ask them to take confidentiality and security measures in accordance with the law to handle personal information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will investigate the data security environment of the shared party, signing a confidentiality agreement with them, asking them to take confidentiality measures to handle personal information."}
{"task": "rw_14.jsonl", "id": 42186, "text": "In the following circumstances, we may share your personal information with the following third parties:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the following circumstances, we may share your personal information with the following third parties:"}
{"task": "rw_14.jsonl", "id": 42187, "text": "3.1.1. Third -party products or service providers.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42188, "text": "\"Baidu\" mobile applications access to rich third -party services (including third -party applets).", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42189, "text": "When you use a third -party service with the \"Baidu\" mobile application, you may need to submit your personal information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use a third -party service with the \"Baidu\" mobile application, you may need to submit your personal information."}
{"task": "rw_14.jsonl", "id": 42190, "text": "We will provide your personal information to a third party based on your effective authorization or in the case of a contract that must be established or fulfilled as a party as a party.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will share your personal information based on your effective authorization or in the case of a contract that must be established or fulfilled as a party as a party."}
{"task": "rw_14.jsonl", "id": 42191, "text": "Regarding how to collect and use your personal information on third -party services, it is recommended that you refer to the relevant service agreements and privacy policies of third -party services.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42192, "text": "When you generate a transaction with a third party in the \"Baidu\" mobile application, and the third party obtains your contact information, and the receiving address is necessary to provide product services, we will fill the address information you filled in in the \"receipt address\" functionAnd the contact information you provide provides you with a third party with products or services;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When you generate a transaction with a third party in the \"Baidu\" mobile application, and the third party obtains your contact information, and the receiving address is necessary to provide product services, we will share the information you filled in in the \"receiving address\" functionFor third parties."}
{"task": "rw_14.jsonl", "id": 42193, "text": "When a third party obtains your invoice information is necessary for providing product services, we will provide the invoice information you filled in in the \"Invoice Management\" function to a third party that provides you with products or services.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When a third party obtains your invoice information is necessary for providing product services, we will share your invoice information with a third party."}
{"task": "rw_14.jsonl", "id": 42194, "text": "When you participate in the marketing activities or service content provided by a third party, based on the service needs, you may need to provide you with information such as account nickname, avatar, name, contact information and other information.When the content of the service content is necessary, share your personal information from a third party to ensure that third parties can provide you smoothly or to fulfill you in time.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When you participate in the marketing activities or service content provided by a third party, you may need to provide information such as account nickname, avatar, name, contact information and other information."}
{"task": "rw_14.jsonl", "id": 42195, "text": "In the case of providing you with marketing activities or service content, if you refuse to share, third parties will not be able to provide you with services or reject your participation.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42196, "text": "\"Baidu\" mobile applications access to a rich third -party mini -program service.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42197, "text": "Third -party mini -programs may collect and use your relevant information, call your equipment permissions so that you can use the services it provided.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "Third -party mini -programs may collect and use your relevant information, call your equipment permissions so that you can use the services it provided."}
{"task": "rw_14.jsonl", "id": 42198, "text": "Different third -party mini -program services collected and used information and the type of equipment that are called may be different.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42199, "text": "When you choose to use a third -party mini -program service, with the consent of your authorization, we will provide your information to the third -party mini -program service provider based on your authorization so that it can provide you with relevant information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When you choose to use a third -party mini -program service, we will provide your information to the third -party applet service provider based on your authorization."}
{"task": "rw_14.jsonl", "id": 42200, "text": "Regarding the type of equipment permissions for the specific call of third -party mini -programs, and how to collect and use your personal information, it is recommended that you refer to the relevant service agreements and privacy policies of the third -party applet.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42201, "text": "3.1.2.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42202, "text": "We have highly consistent data security security measures and management levels between our affiliated companies or the use of the same account system.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42203, "text": "In order to provide you with a service experience that provides you, improves your product security and convenience, and guarantee consistency, under the premise of following the legal requirements, we will share your individuals between the related company or the same account system userinformation.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "In order to provide you with the security and convenience of service and improve the use, we will share your personal information between the related companies or the use of the same account system."}
{"task": "rw_14.jsonl", "id": 42204, "text": "In this case, we will only share the necessary personal information. If we share your sensitive personal information or the purpose of changing the use and processing of personal information, we will solicit your authorization consent again.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only share the necessary personal information between the affiliated company or the use of the same account system, otherwise we will solicit your authorization consent again."}
{"task": "rw_14.jsonl", "id": 42205, "text": "For the use party of the same account system, in order to fulfill the supervision requirements, ensure account security, conduct consistent display, and contact you, based on your effective authorization, we may share your account information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For the same account system, based on your effective authorization, we may share your account information."}
{"task": "rw_14.jsonl", "id": 42206, "text": "For example: When you use the YY live broadcast service through Baidu account, we will share your username, nickname, avatar, attention number, fans, comment information, tie, binding to YY live service provider (Guangzhou Jinhong Network Media Co., Ltd.)Fixed mobile numbers, adult status, account binding name and ID number (support inquiries only when protecting the user's rights or fulfilling legal obligations) and IP information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When you use the YY live broadcast service through Baidu account, we will share your personal information with the YY live service provider."}
{"task": "rw_14.jsonl", "id": 42207, "text": "When you use the Baidu account to use small full finance, rich money, and small Manchu financial services, we will share your account user name, nickname, avatar, real -name information information with the service provider (Chongqing Duman Information Technology Co., Ltd.)(For example: name, ID number and mobile phone number), account risk (including the login status), IP information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When you use the Baidu account, you can share your personal information with the service provider when you use the Baidu account, wealth, and small Manchu financial services."}
{"task": "rw_14.jsonl", "id": 42208, "text": "3.1.3. You take the initiative to choose a third party that share with you personal information", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42209, "text": "You can use the sharing function of \"Baidu\" mobile applications to share with Baidu friends, QQ friends, WeChat friends, Weibo friends sharing, including but not limited to information content and search results you are interested in.", "label": ["Third Party Sharing/ Disclosure", "Edit/Control", "Important"], "rewrite": "You can use the sharing function of \"Baidu\" mobile application to share with friends."}
{"task": "rw_14.jsonl", "id": 42210, "text": "Please fully consider the reputation of the information receiving person before using the third -party service or sharing function, and suggest that you check the privacy statement of the social network or third -party service provider you use to understand how they handle your information so that they can be cautious so that they can be cautious.decision making.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42211, "text": "3.2. Transfer", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42212, "text": "We will not transfer your personal information to any company, organization and individual except Baidu Company, except the following situations: except:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not transfer your personal information to any company, organization and individual except Baidu Company, except the following situations: except:"}
{"task": "rw_14.jsonl", "id": 42213, "text": "Get your clear authorization or consent in advance;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Get your clear authorization or consent in advance, you may transfer your personal information."}
{"task": "rw_14.jsonl", "id": 42214, "text": "Meet the requirements of laws and regulations, legal procedures or government requirements or judicial rulings;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Meeting the requirements of laws and regulations, legal procedures or government requirements or judicial rulings, may transfer your personal information."}
{"task": "rw_14.jsonl", "id": 42215, "text": "If we or our affiliated companies involve transactions such as mergers, separation, liquidation, assets or business, your personal information may be transferred as part of such transactions. We will ensureConfidentiality, to tell you the names or names and contact information of the receiver, and do your best to ensure that the company that holds your personal information and the organization will continue to be constrained by this privacy policy.You ask for authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When involving mergers, acquisitions, or bankruptcy liquidation, if personal information transfer is involved, it will be required to continue to be bound by the policy, otherwise it will request that it will re -solicit authorization consent."}
{"task": "rw_14.jsonl", "id": 42216, "text": "3.3. Public disclosure", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42217, "text": "We will only publicly disclose your personal information in the following circumstances:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only publicly disclose your personal information in the following circumstances:"}
{"task": "rw_14.jsonl", "id": 42218, "text": "Get your individual consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Getting your individual consent may disclose your personal information publicly."}
{"task": "rw_14.jsonl", "id": 42219, "text": "Based on laws and regulations, legal procedures, litigation, or mandatory requirements for government authorities.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Based on laws and regulations, legal procedures, litigation, or the mandatory requirements of government authorities, your personal information may be disclosed publicly."}
{"task": "rw_14.jsonl", "id": 42220, "text": "When a punishment announcement of illegal accounts and violations, we will disclose information about the relevant account. This information will inevitably include related certification information and violations.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When a penalty announcement of illegal accounts and violations, we will disclose information about the relevant account, including the relevant certification information and violations of the account."}
{"task": "rw_14.jsonl", "id": 42221, "text": "3.4. Sharing, transfer, and public disclosure of personal information.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42222, "text": "In the following circumstances, sharing, transfer, and publicly disclose personal information without obtaining the authorization of the subject of personal information in advance:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the following circumstances, sharing, transfer, and publicly disclose personal information without obtaining the authorization of the subject of personal information in advance:"}
{"task": "rw_14.jsonl", "id": 42223, "text": "Directly related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The sharing or disclosure directly related to national security and national defense security does not require authorization."}
{"task": "rw_14.jsonl", "id": 42224, "text": "In order to establish and fulfill the contract as a party as a party;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to establish and fulfill the sharing, transfer or disclosure of the contract as a party as a party, no authorization is required."}
{"task": "rw_14.jsonl", "id": 42225, "text": "To fulfill the statutory duties or the requirements of the statutory duty;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to fulfill the shared, transferred or disclosed by the statutory duties or the necessary sharing, transfer, or disclosure necessary for the statutory duty, no authorization is required."}
{"task": "rw_14.jsonl", "id": 42226, "text": "Directly related to public safety, public health, and major public interests.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Sharing or disclosure directly related to public safety, public health and major public interests does not need to be authorized."}
{"task": "rw_14.jsonl", "id": 42227, "text": "For example: to deal with emergencies, or in urgent situations to protect the health and property security of natural people;", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42228, "text": "Directly related to criminal investigation, prosecution, trial, and execution of judgment;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Sharing or disclosure related to criminal investigation, prosecution, trial, and judgment execution does not need to be authorized."}
{"task": "rw_14.jsonl", "id": 42229, "text": "It is difficult to obtain the major legitimate rights and interests of the life and property of the subject of personal information or other individuals; it is difficult to get my consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Out of the major legitimate rights and interests of the life and property of the subject of personal information or other individuals, it is difficult to get shared or disclosed by my consent, and there is no need to solicit."}
{"task": "rw_14.jsonl", "id": 42230, "text": "In accordance with the provisions of laws and regulations, handle individuals' self -disclosure or other legal personal information within a reasonable scope, such as: legal news reports, government information disclosure and other channels;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In accordance with the provisions of laws and regulations, handle individuals' self -disclosure or other legitimate personal information within a reasonable scope without authorization."}
{"task": "rw_14.jsonl", "id": 42231, "text": "Law and administrative regulations have other stipulated situations.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42232, "text": "3.5. The third -party software development tool package (SDK) we connect", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42233, "text": "In order to adapt to the use of \"Baidu\" mobile applications and third -party platform services on different mobile phone devices to achieve your mobile phone device identity authentication, mobile phone equipment security, receiving information push, logging in to third -party platform accounts, sharing information through third -party platforms, and paymentSafe, \"Baidu\" mobile applications are connected to third -party SDK.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "\"Baidu\" mobile applications access to third -party SDK."}
{"task": "rw_14.jsonl", "id": 42234, "text": "The above -mentioned third -party SDK providers include mobile phone equipment manufacturers, social platforms, communication operators and third -party payment institutions.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42235, "text": "Some third -party SDKs may call your device permissions and get your relevant information so that you can use the corresponding functions normally on different mobile phone devices or third -party platforms.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Some third -party SDKs may call your device permissions and get your relevant information."}
{"task": "rw_14.jsonl", "id": 42236, "text": "Different third -party SDKs may have different types of equipment permissions and the information obtained. It may include getting your location information, reading/writing your external memory card, reading your mobile phone status and identity, viewing WLAN connection, retrieval, retrievalApplication/Bluetooth is running.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Different third -party SDKs call the types of equipment permissions and the information obtained may be different."}
{"task": "rw_14.jsonl", "id": 42237, "text": "Regarding the type of equipment permissions for third -party SDK, and how to collect and use your personal information, it is recommended that you refer to the relevant service agreement and privacy policy of the third -party SDK.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "It is recommended that you refer to the related service agreement and privacy policy of third -party SDK."}
{"task": "rw_14.jsonl", "id": 42238, "text": "If you want to learn more about the third -party SDK of our access, please read the third -party SDK description.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42239, "text": "3.6. Entrusted processing and common treatment", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42240, "text": "In order to provide you better, we may entrust third -party partners to process your personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may entrust third -party partners to process your personal information."}
{"task": "rw_14.jsonl", "id": 42241, "text": "We will only entrust third -party partners to handle your information for legal, correct, necessary, specific, and clear purposes.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only entrust third -party partners to handle your information for legal, correct, necessary, specific, and clear purposes."}
{"task": "rw_14.jsonl", "id": 42242, "text": "We will strictly restrict the information processing purpose of the trustee and require the trustees to take full data security guarantee methods.", "label": ["Important", "Data Security"], "rewrite": "We will strictly restrict the information processing purpose of the trustee and require the trustees to take full data security guarantee methods."}
{"task": "rw_14.jsonl", "id": 42243, "text": "If a third -party partner uses your information for our unreasonable purpose, it will obtain your consent separately.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If a third -party partner uses your information for our unreasonable purpose, it will obtain your consent separately."}
{"task": "rw_14.jsonl", "id": 42244, "text": "Our authorized partners include authorized partners of advertising and analytical services.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42245, "text": "We will entrust these partners to deal with information about advertising, advertising effects, and advertising reaching rates related to the safety technology of the industry.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will entrust these partners to handle information related to advertising, advertising effects, and advertising reach."}
{"task": "rw_14.jsonl", "id": 42246, "text": "Without your effective authorization, we will not commission the third -party partner for information that can directly identify your personal identity.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Without your effective authorization, we will not commission the third -party partner for information that can directly identify your personal identity."}
{"task": "rw_14.jsonl", "id": 42247, "text": "If you actively leave your contact information, address information and other personal information for specific third -party partners to contact you, it will directly process your personal information.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42248, "text": "In the joint processing scenario, we will also sign relevant agreements with the requirements of the partner in accordance with the requirements of the laws and regulations and fulfill the relevant personal information protection obligations.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In joint processing scenarios, we will sign relevant agreements that meet the requirements of laws and regulations and fulfill their relevant personal information protection obligations."}
{"task": "rw_14.jsonl", "id": 42249, "text": "4. How do we save and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42250, "text": "4.1. Save period", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42251, "text": "We will save your personal information within the required period of the service, but the laws and regulations have other regulations on the period of preservation, you agree to retain longer periods, ensure the safety and quality of services, and achieve disputes.Below, after the foregoing period of preservation expires, we will extend the storage period in accordance with the law, according to law, or in a reasonable range.", "label": ["Data Retention", "Important"], "rewrite": "Generally, your personal information is retained within the time limit required to achieve service purposes, unless the law has other requirements."}
{"task": "rw_14.jsonl", "id": 42252, "text": "After exceeding the storage period, we will delete your personal information or perform anonymous processing in accordance with the law.", "label": ["Data Retention", "Important"], "rewrite": "After exceeding the storage period, your personal information will be deleted or anonymous."}
{"task": "rw_14.jsonl", "id": 42253, "text": "4.2. Save area", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42254, "text": "In principle, the personal information we collected and generated in the territory of the People's Republic of China will be stored in the territory of the People's Republic of China.", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in domestic operations will be stored in China."}
{"task": "rw_14.jsonl", "id": 42255, "text": "If your personal information may be transferred to the overseas jurisdiction of your country or the country/region, or by the interview from these jurisdictions, we will strictly fulfill the obligations stipulated in the laws and regulations and obtain you in accordance with the laws and regulations.Agree alone.", "label": ["Data Retention", "Important", "Risk"], "rewrite": "If your information is transferred or accessed by cross -border, we will get your separate consent in advance."}
{"task": "rw_14.jsonl", "id": 42256, "text": "There may be different data protection laws in such jurisdictions, and no relevant laws are set up.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42257, "text": "In such circumstances, we will transmit your personal information in accordance with the provisions of the current laws of China, and will ensure that your personal information is sufficiently protected in the People's Republic of China.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "We will transmit your personal information in accordance with the provisions of the current laws of Chinese and ensure that your personal information is sufficiently protected in the territory."}
{"task": "rw_14.jsonl", "id": 42258, "text": "For example, we will ask you to agree to cross -border transfer of personal information, or implement security measures such as data to identify data before cross -border data transfer.", "label": ["Data Retention", "Important"], "rewrite": "We will ask you to agree to cross -border transfer of personal information, or implement security measures such as data to identify data before cross -border data transfer."}
{"task": "rw_14.jsonl", "id": 42259, "text": "4.3. Safety measures", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42260, "text": "We will collect, use, store, and transmit user information with the \"minimization\" principle, and inform you the purpose and scope of the relevant information through user agreements and privacy policies.", "label": ["Important", "Data Security"], "rewrite": "We will collect, use, store, and transmit user information with the \"minimization\" principle, and inform the purpose and scope of the use through user agreements and privacy policies."}
{"task": "rw_14.jsonl", "id": 42261, "text": "We attach great importance to information security.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42262, "text": "We have set up a specialized team responsible for research and development and application of multiple security technologies and procedures. We will conduct a security background review of the person in charge of safety management and key safety positions. We have established a comprehensive information security management system and internal security incident disposal mechanismwait.", "label": ["Important", "Data Security"], "rewrite": "We set up a specialized team responsible for a variety of security technologies and procedures, conducting safety background review of the person in charge of safety management and key security positions, and establishing an information security management system and internal security incident disposal mechanism."}
{"task": "rw_14.jsonl", "id": 42263, "text": "We will adopt appropriate security measures and technical means to storage and protect your personal information that meets industry standards to prevent your information from being lost, being disclosed, use, damage, lost or leaked by unauthorized access, public disclosure, use, damage, loss, or leakage.", "label": ["Important", "Data Security"], "rewrite": "Take security measures and technical means to store and protect your personal information."}
{"task": "rw_14.jsonl", "id": 42264, "text": "We will take all reasonable and feasible measures to protect your personal information.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42265, "text": "We will use encryption technology to ensure the confidentiality of the data;", "label": ["Important", "Data Security"], "rewrite": "We will use encryption technology to ensure the confidentiality of data."}
{"task": "rw_14.jsonl", "id": 42266, "text": "We will use a trusted protection mechanism to prevent data from being maliciously attacked.", "label": ["Important", "Data Security"], "rewrite": "We will use a trusted protection mechanism to prevent data from being maliciously attacked."}
{"task": "rw_14.jsonl", "id": 42267, "text": "We will conduct data security awareness training and assessment and assessment of security capabilities, and strengthen employees' awareness of protecting the importance of personal information.", "label": ["Important", "Data Security"], "rewrite": "We will conduct data security awareness training and assessment and assessment of security capabilities, and strengthen employees' awareness of protecting the importance of personal information."}
{"task": "rw_14.jsonl", "id": 42268, "text": "We will perform identity authentication and authority control to employees who handle personal information, and sign a confidentiality agreement with employees and partners who are in contact with your personal information to clarify job responsibilities and code of conduct to ensure that only authorized personnel can access personal information.", "label": ["Important", "Data Security"], "rewrite": "We will perform identity authentication and permissions for employees who handle personal information, and sign a confidentiality agreement with them to clarify job responsibilities and code of conduct."}
{"task": "rw_14.jsonl", "id": 42269, "text": "If there is an act of violating the confidentiality agreement, it will be immediately terminated with the cooperative relationship with Baidu, and will be held accountable for relevant legal responsibilities. It also puts forward confidentiality requirements for personnel in contact with personal information when leaving the post.", "label": ["Important", "Data Security"], "rewrite": "If there is an act of violating the confidentiality agreement, it will be immediately terminated with the cooperative relationship with Baidu company, and will be held accountable for relevant legal responsibilities, and also requires confidentiality requirements for the person who leaves."}
{"task": "rw_14.jsonl", "id": 42270, "text": "We remind you that the Internet is not an absolutely secure environment. When you interact with other users in third -party social software, emails, SMS, etc. in the mobile application of \"Baidu\" mobile applicationsWhether the three -party software's transmission of information is completely encrypted to ensure the security of your personal information.", "label": ["Important", "Data Security"], "rewrite": "When you use a third -party application embedded in the \"Baidu\" mobile application, pay attention to ensure the security of your personal information."}
{"task": "rw_14.jsonl", "id": 42271, "text": "We also ask you to understand that due to the technical restrictions and rapid development of the Internet industry, and various malicious attack methods that may exist, even if we can do our best to strengthen security measures, it is impossible to ensure 100 % security of information.", "label": ["Important", "Data Security"], "rewrite": "Although there are security measures, it is impossible to fully guarantee that there is no security problem."}
{"task": "rw_14.jsonl", "id": 42272, "text": "Please understand that the system and communication network you used when using our products and/or services may have security problems in other links other than our control.", "label": ["Important", "Data Security"], "rewrite": "Systems and communication networks may have problems due to unprepared factors."}
{"task": "rw_14.jsonl", "id": 42273, "text": "According to our security management system, personal information leakage, damage or loss is listed as the most major security incident. Once it occurs, the company's highest -level emergency plan will occur.Emergency response group treatment.", "label": ["Important", "Data Security"], "rewrite": "Once personal information leakage, damage or loss, will start the company's highest -level emergency plan."}
{"task": "rw_14.jsonl", "id": 42274, "text": "4.4. Safety event notice", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42275, "text": "We will develop emergency plans for cyber security incidents to deal with security risks such as system vulnerabilities, computer viruses, cyber attacks, and network invasion in time. When incidents that endanger network security occur, we will immediately start the emergency plan, take corresponding remedies, and follow in accordance with the corresponding remedial measures, and follow in accordance with the according to theReport to the relevant authorities.", "label": ["Important", "Data Security"], "rewrite": "When incidents that are harmful to network security, we will immediately launch an emergency plan, take corresponding remedial measures, and report to the relevant authorities in accordance with regulations."}
{"task": "rw_14.jsonl", "id": 42276, "text": "Personal information leakage, damage, and loss belong to the company -level super -large security incidents. We will be responsible for regularly organizing working group members to conduct safety plan drills to prevent such security incidents from occurring.", "label": ["Important", "Data Security"], "rewrite": "We will be responsible for regularly organizing working group members to conduct safety plans to prevent company -level super -large security incidents."}
{"task": "rw_14.jsonl", "id": 42277, "text": "Once unfortunately, we will start emergency plans in accordance with the highest priority to form an emergency emergency group to trace the causes and reduce losses in the shortest time.", "label": ["Important", "Data Security"], "rewrite": "Once unfortunately, the company -level super security incident will occur, we will start emergency plans in accordance with the highest priority."}
{"task": "rw_14.jsonl", "id": 42278, "text": "After unfortunately a personal information security incident, we will tell you the basic situation and possible impact of the security incident in time in accordance with the requirements of the laws and regulations.Suggestions, remedy measures, etc.", "label": ["Important", "Data Security"], "rewrite": "If a personal information security incident occurs, we will inform your basic situation, possible impact, disposal measures, independent prevention suggestions, etc."}
{"task": "rw_14.jsonl", "id": 42279, "text": "We will promptly tell you the incident -related situation in the site notification, SMS notification, telephone, email, etc. Informing you, it is difficult to inform you one by one, we will publish a reasonable and effective way to publish an announcement.", "label": ["Important", "Data Security"], "rewrite": "The relevant situation of security incidents will be informed by mail, letter, telephone, push notification, etc. When it is difficult to inform one by one, it will issue an announcement."}
{"task": "rw_14.jsonl", "id": 42280, "text": "At the same time, we will also actively report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "Report the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities."}
{"task": "rw_14.jsonl", "id": 42281, "text": "Please understand that according to the provisions of laws and regulations, if the measures we take can effectively avoid information leakage, tampering, and loss, causing harm, unless the regulatory authorities ask you to notify you, we can choose not to notify you information security incidents.", "label": ["Important", "Data Security"], "rewrite": "If the measures we take can effectively avoid information leakage, tampering, and loss of information, we can choose not to notify you, except for the regulatory authority requested."}
{"task": "rw_14.jsonl", "id": 42282, "text": "5. Your rights", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42283, "text": "In accordance with China's relevant laws, regulations, standards, and the practice of other countries and regions, we guarantee that you exercise the following rights on your personal information. If you have doubts about your rights or claims, you can also send emails to [Shoujibaidu@baidu.com,] The way to get in touch with us:", "label": ["Important", "Contact Information"], "rewrite": "Email: Shoujibaidu@baidu.com."}
{"task": "rw_14.jsonl", "id": 42284, "text": "5.1. Review right", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42285, "text": "In principle, you can check your personal information in the following ways:", "label": ["Important", "Edit/Control"], "rewrite": "In principle, you can check your personal information in the following ways:"}
{"task": "rw_14.jsonl", "id": 42286, "text": "Account Information: You can log in to passport.baidu.com at any time or visit [My]-[Settings]-[Account Management], access or edit your personal information in your account, change your password, perform account association or identityCertification, etc.", "label": ["Important", "Edit/Control"], "rewrite": "You can log in to passport.baidu.com or visit [Mine]-[Account Management] to access or edit your personal information."}
{"task": "rw_14.jsonl", "id": 42287, "text": "Use information: You can check or clear your search records and browse records in the \"Baidu\" mobile application.", "label": ["Important", "Edit/Control"], "rewrite": "You can check or clear your search records and browse records in the \"Baidu\" mobile application."}
{"task": "rw_14.jsonl", "id": 42288, "text": "You can use [My]-[Privacy Settings]-[History Settings]-[Search History]-[My Privacy Settings]-[History Settings]-[Historical Record]-[History]-[History]-[History]-[History]-[History settings]-[History settings]-[History.Your historical record is displayed.", "label": ["Important", "Edit/Control"], "rewrite": "You can use [Mine]-[Privacy Settings]-[History Settings]-[Search History]-[Mine]-[History Settings]-[History] to close your historical recordShow."}
{"task": "rw_14.jsonl", "id": 42289, "text": "Order information: You can check or clear the third -party platform of \"Baidu\" mobile application or access to the \"Baidu\" mobile application.", "label": ["Important", "Edit/Control"], "rewrite": "You can check or clear the order information on the third -party platform of \"Baidu\" mobile application or access to the \"Baidu\" mobile application."}
{"task": "rw_14.jsonl", "id": 42290, "text": "5.2. Correction and replenishment", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42291, "text": "When you find that there are errors or incomplete personal information that we processed, you have the right to verify your identity and correct your identity without affecting the objectivity and accuracy of the information.The information is correct or supplemented. You can use [My]-[Settings]-[Account Management,] to correct or supplement it in the \"Baidu\" mobile application.Submit to us.", "label": ["Edit/Control", "Important"], "rewrite": "You can use [Mine]-[Settings]-[Account Management] in mobile applications to make corrections or supplements or submit them to us."}
{"task": "rw_14.jsonl", "id": 42292, "text": "5.3. Delete right", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42293, "text": "In the following circumstances, you can make a request to delete personal information:", "label": ["Important", "Edit/Control"], "rewrite": "In the following circumstances, you can make a request to delete personal information: violate laws and regulations or handle your personal information with your agreement; the purpose of the processing purpose has been achieved, unable to achieve or for the purpose of the processing purpose;Services, or the storage period has expired; you withdraw your consent; other circumstances stipulated in laws and administrative regulations."}
{"task": "rw_14.jsonl", "id": 42294, "text": "If we violate laws and regulations or deal with your personal information with your agreement;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42295, "text": "If our treatment purpose has been achieved, unable to achieve or for the purpose of the treatment, it is no longer necessary;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42296, "text": "If we stop providing products or services, or the storage period has expired;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42297, "text": "If you withdraw consent;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42298, "text": "Other circumstances stipulated in laws and administrative regulations.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42299, "text": "When you delete the information from our services, we may not immediately delete the corresponding information in the backup system, but will delete these information when the backup is updated.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Delete the information you require delete in the backup update."}
{"task": "rw_14.jsonl", "id": 42300, "text": "Please know and understand that if the preservation period stipulated in laws and administrative regulations or the explanation of this privacy policy has not been expired, or delete personal information is difficult to achieve from technically, we will stop except storage and adopting necessary security measures.deal with.", "label": ["Important", "Edit/Control"], "rewrite": "We have not yet expired or technically difficult to delete the specified preservation period or technically difficult to delete."}
{"task": "rw_14.jsonl", "id": 42301, "text": "5.4. Withdrawal consent", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42302, "text": "Each business function requires some basic personal information to complete.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42303, "text": "For the collection and use of additional personal information, you can give or withdraw your authorization consent at any time.", "label": ["Important", "Edit/Control"], "rewrite": "For the collection and use of additional personal information, you can give or withdraw your authorization consent at any time."}
{"task": "rw_14.jsonl", "id": 42304, "text": "You can log in to passport.baidu.com to relieve the binding relationship between Baidu account and third -party account. You can also close multiple settings in the personal center of the \"Baidu\" mobile application (such as voice search settings, historical record settings, etc.) to close it.Some functional options are revoked to be partially authorized.", "label": ["Important", "Edit/Control"], "rewrite": "You can log in to passport.baidu.com to relieve the binding relationship between Baidu account and third -party account. You can also close some functional options through multiple settings in the personal center of mobile applications to revoke some authorization."}
{"task": "rw_14.jsonl", "id": 42305, "text": "You can directly turn off the authority of accurate geographical location information, address book, camera, camera, microphone, album permissions and other system permissions to change the scope of consent or withdraw your authorization.", "label": ["Important", "Edit/Control"], "rewrite": "You can directly turn off the authority of accurate geographical location information, address book, camera, camera, microphone, album permissions and other system permissions to change the scope of consent or withdraw authorization."}
{"task": "rw_14.jsonl", "id": 42306, "text": "When you withdraw your consent, we cannot continue to provide you with the service corresponding to the withdrawal consent, and we will no longer use your corresponding personal information.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42307, "text": "But your decision to withdraw consent will not affect personal information processing based on your consent.", "label": ["Important", "Edit/Control"], "rewrite": "The decision to withdraw consent will not affect personal information processing based on consent."}
{"task": "rw_14.jsonl", "id": 42308, "text": "5.5. List of cancellation", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42309, "text": "You can cancel the previously registered account.", "label": ["Edit/Control", "Important"], "rewrite": "You can cancel the previously registered account."}
{"task": "rw_14.jsonl", "id": 42310, "text": "You can log in to passport.baidu.com and cancel your Baidu account.", "label": ["Important", "Edit/Control"], "rewrite": "You can log in to passport.baidu.com and cancel your Baidu account."}
{"task": "rw_14.jsonl", "id": 42311, "text": "You can cancel your account number in \"Baidu\" mobile applications through the following path: [Mine]-[Settings]-[Account Management]-[Account Logging out].", "label": ["Important", "Edit/Control"], "rewrite": "You can use [Mine]-[Settings]-[Account Management]-[Account Logging out] Logging out your account."}
{"task": "rw_14.jsonl", "id": 42312, "text": "Once you cancel the Baidu account, you will not be able to use the services of Baidu's entire line user products, so please do it carefully.", "label": ["Important", "Edit/Control"], "rewrite": "Once you cancel the Baidu account, you will not be able to use the service."}
{"task": "rw_14.jsonl", "id": 42313, "text": "In order to protect the legitimate rights and interests of you or others, we will determine whether you support your cancellation request for the use of Baidu's products.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42314, "text": "For example, if you have unsolved manuscript fees in Baidu's experience, or you have unprepared glutinous rice storage cards in Baidu Nuomi, or there are information in your network disk, we will not immediately support your request.", "label": ["Important", "Edit/Control"], "rewrite": "If you have unsolved manuscript fees in Baidu's experience, or you have unprepared glutinous rice storage cards in Baidu Nuomi, or if you still have information in your network disk, you will not immediately support your request."}
{"task": "rw_14.jsonl", "id": 42315, "text": "In addition to other provisions of laws and regulations, we will stop providing you with products and services and delete your personal information according to your requirements.", "label": ["Important", "Edit/Control"], "rewrite": "After canceling the account, it will stop providing you with products and services, and delete your personal information according to your requirements."}
{"task": "rw_14.jsonl", "id": 42316, "text": "If you only need to remove the traces of your use of your \"Baidu\" mobile application, you can refer to the following path implementation: [Mine]-[Settings]-[Account Management]-[Account Logging out]-[Delete the current application service traces].", "label": ["Important", "Edit/Control"], "rewrite": "You can use [Mine]-[Settings]-[Account Management]-[Account Logging out]-[Delete the current application service traces] Clear use traces."}
{"task": "rw_14.jsonl", "id": 42317, "text": "You need to apply for a cancellation account to a third party through a third -party account (such as WeChat, Weibo, QQ, etc.).", "label": ["Important", "Edit/Control"], "rewrite": "When you log in to the \"Baidu\" mobile application through a third -party account, you need to apply for a cancellation account with a third party."}
{"task": "rw_14.jsonl", "id": 42318, "text": "5.6. Copy power and the right to carry", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42319, "text": "You have the right to copy your personal information we collected.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42320, "text": "Under the conditions stipulated by laws and regulations, instructions and conditions stipulated by the national network information department at the same time, if technology is feasible, you can also ask us to transfer your personal information to other subjects you designated.", "label": ["Important", "Edit/Control"], "rewrite": "When the conditions and technologies that meet the laws and regulations are feasible, you can also ask your personal information to the other subjects you designated."}
{"task": "rw_14.jsonl", "id": 42321, "text": "5.7. Well in advance that products and services stop operating rights.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42322, "text": "\"Baidu\" mobile application is willing to accompany you. If \"Baidu\" mobile application product is stopped due to special reasons, we will send e -mail or other appropriate energy to you during the reasonable period of the product or service during a reasonable periodTouch your way to notify you and stop collecting your personal information. At the same time, you will delete or processes your personal information that has been collected in accordance with the law.", "label": ["Important", "Cessation of Operations"], "rewrite": "When stopping operation, we will make an announcement notice and delete or processes your personal information."}
{"task": "rw_14.jsonl", "id": 42323, "text": "5.8. Get the right to explain", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42324, "text": "You have the right to ask us to explain the personal information processing rules.", "label": ["Important"], "rewrite": "You have the right to ask us to explain the personal information processing rules."}
{"task": "rw_14.jsonl", "id": 42325, "text": "You can get in touch with us through the contact information in part 9.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42326, "text": "5.9. Personalized content and advertising display and control", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42327, "text": "5.9.1. Exhibition and control of personalized content", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42328, "text": "To facilitate your independent control of personalized information you want to receive, you can dynamically adjust your interest preferences through the following paths, and we will push related personalized content based on your choice.", "label": ["Edit/Control", "Important"], "rewrite": "We will push you related personalized content based on your choice."}
{"task": "rw_14.jsonl", "id": 42329, "text": "You can dynamically adjust the channels interested in the \"channel management\" dynamic adjustment of the \"channel management\" in the \"Baidu\" mobile application homepage setting item, and you can drag and sort it.", "label": ["Important", "Edit/Control"], "rewrite": "You can dynamically adjust the channels interested in the \"channel management\" dynamic adjustment of the \"channel management\" in the \"Baidu\" mobile application homepage setting item, and you can drag and sort it."}
{"task": "rw_14.jsonl", "id": 42330, "text": "\"Baidu\" mobile application will adjust the content you are interested in on the homepage points channel according to your channel.", "label": ["Important", "Usage"], "rewrite": "\"Baidu\" mobile application will adjust the content you are interested in on the homepage points channel according to your channel."}
{"task": "rw_14.jsonl", "id": 42331, "text": "Path: [The \"\" icon on the right side of the channel list under the search box of the homepage]-[Channel Management]-[Edit]", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42332, "text": "You can also adjust at any time when browsing personalized recommendations.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42333, "text": "If you do nt like or are interested in the personalized recommendation content, you can click the content of the content at any time by clicking on the  icon or  icon at the bottom right or above the right.\"not interested\".", "label": ["Important", "Edit/Control"], "rewrite": "You can turn off the content at any time by clicking the \"\" icon or \"...\" icon at the bottom right or above the right. You can also choose to \"not interested\" the content."}
{"task": "rw_14.jsonl", "id": 42334, "text": "If you choose to \"not interested\" the content, we will reduce similar content based on your choice.", "label": ["Important", "Edit/Control"], "rewrite": "If you choose to be \"not interested\" in the content, we will reduce similar content."}
{"task": "rw_14.jsonl", "id": 42335, "text": "We also provide the report/feedback entrance to listen to your opinions and suggestions.", "label": ["Important"], "rewrite": "We also provide the report/feedback entrance to listen to your opinions and suggestions."}
{"task": "rw_14.jsonl", "id": 42336, "text": "path:", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42337, "text": "[The \"\" icon or \"...\" icon at the bottom right or at the top right of the content]-[Reason for selecting]-[OK]", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42338, "text": "[The \"\" icon or \"...\" icon at the bottom right or above the right]-[Not interested]", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42339, "text": "[The \"\" icon at the bottom right or above the right]-Report/Feedback", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42340, "text": "[The \"...\" icon at the bottom right of the content]-[Not interested]-[Report/feedback]", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42341, "text": "If you do not want to receive our relevant personalized content based on your interest preferences, you can use [My]-[Privacy Settings]-[Recommended Settings]-[Recommended interest recommendation] Close personalized content recommendation.", "label": ["Important", "Edit/Control"], "rewrite": "You can use [Mine]-[Privacy Settings]-[Recommended settings]-[Recommended interest recommendation] Close personalized content recommendation."}
{"task": "rw_14.jsonl", "id": 42342, "text": "When you choose to close the personalized content recommendation, you cannot enjoy personalized recommendation services. We will show you the content based on non -personalized factors such as content heat. You may see what you are not interested in or even dislikes.Experience may be affected.", "label": ["Important", "Edit/Control"], "rewrite": "When you choose to close the recommendation of personalized content, we will show you the content based on non -personalized factors such as content heat."}
{"task": "rw_14.jsonl", "id": 42343, "text": "5.9.2. The display and control of personalized advertisements", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42344, "text": "We may collect and use advertising identification information that meets national or industry group standards. This logo is based on non -sensitive personal information such as equipment models and system configurations to ensure your privacy and service security.Advertising makes you enjoy more convenient services.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may collect and use advertising identification information to provide you with more personalized advertisements."}
{"task": "rw_14.jsonl", "id": 42345, "text": "After we are online, we will provide you with a close function and inform you that the way off. If you do not want us to use the advertising identification information for the above, we can choose to close at any time.", "label": ["Important", "Edit/Control"], "rewrite": "We will also provide you with the closing advertising identification information function and inform you the closing path."}
{"task": "rw_14.jsonl", "id": 42346, "text": "After closing, we will no longer obtain and handle the Internet advertising logo.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42347, "text": "If you don't like or are interested in the ads we push for you, you can close the advertisement at any time by clicking the \"\" icon at the bottom right of the advertisement, or you can choose to \"not interested\" the advertisement.", "label": ["Important"], "rewrite": "You can click the \"\" icon at the bottom right of the advertisement to close the advertisement at any time, or you can choose to \"not interested\" the advertisement."}
{"task": "rw_14.jsonl", "id": 42348, "text": "If you choose to be \"not interested\" for this advertisement, we will adjust personalized recommendation strategies based on your feedback.", "label": ["Edit/Control", "Important"], "rewrite": "If you choose to be \"not interested\" for this advertisement, we will adjust personalized recommendation strategies based on your feedback."}
{"task": "rw_14.jsonl", "id": 42349, "text": "We also provide the report/feedback entrance to listen to your opinions and suggestions.", "label": ["Important"], "rewrite": "We also provide the report/feedback entrance to listen to your opinions and suggestions."}
{"task": "rw_14.jsonl", "id": 42350, "text": "path:", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42351, "text": "[The \"\" icon at the bottom right of the advertisement]-[Reason for selecting]-[OK]", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42352, "text": "[The \"\" icon at the bottom right of the advertisement]-[Not interested]", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42353, "text": "[\"\" icon at the bottom right of the advertisement]-[Report/Feedback]", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42354, "text": "If you do not want to receive our relevant personalized advertising content based on your interest preferences, you can choose to close personalized content recommendation through [My]-[Privacy Settings]-[Advertising Settings]-[Close Personalized Advertising].", "label": ["Important", "Edit/Control"], "rewrite": "You can use [Mine]-[Privacy Settings]-[Advertising Settings]-[Close Personalized Advertising] Select Closing Personalized Content Recommendations."}
{"task": "rw_14.jsonl", "id": 42355, "text": "When you choose to close personalized advertising recommendations, you cannot enjoy personalized recommendation services. We will show you the content based on non -personalized factors such as content heat. You may see that you are not interested in or even dislike an advertisement. Your use of your use.Experience may be affected.", "label": ["Important", "Edit/Control"], "rewrite": "When you choose to close personalized advertising recommendations, we will show you the content based on non -personalized factors such as content heat."}
{"task": "rw_14.jsonl", "id": 42356, "text": "Programmized advertisements are based on your preferences in third -party applications. It is one of the general advertising technology.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42357, "text": "We only have programmatic advertising docking technology and will not obtain your behavior or personal data in third -party applications.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42358, "text": "You can open/close [Mine]-[Privacy Settings]-[Advertising Settings]-[Turn off programmatic advertisement] switch, choose to open or turn off the technology.", "label": ["Edit/Control", "Important"], "rewrite": "You can open/close [Mine]-[Privacy Settings]-[Advertising Settings]-[Close programmatic advertising] switch, select or close programmatic advertising technology."}
{"task": "rw_14.jsonl", "id": 42359, "text": "If the switch is turned on, the number of ads you see will not decrease, but the accuracy of the advertisement will be reduced.", "label": ["Edit/Control", "Important"], "rewrite": "If you close programmatic advertisements, the number of advertisements you see will not decrease, but the accuracy of advertising will decrease."}
{"task": "rw_14.jsonl", "id": 42360, "text": "5.10. Exception of rights exercise", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42361, "text": "In the following circumstances, we may not be able to respond to your inspection, correction and supplementation, deletion, copying, and request for carrying, knowing, knowing, and deciding:", "label": ["Important", "Edit/Control"], "rewrite": "In the following circumstances, we may not be able to respond to your inspection, correction and supplementation, deletion, copying, and request for carrying, knowing, knowing, and deciding:"}
{"task": "rw_14.jsonl", "id": 42362, "text": "Directly related to national security and national defense security;", "label": ["Edit/Control", "Important"], "rewrite": "If your request is directly related to national security and national defense security, you may not be responded."}
{"task": "rw_14.jsonl", "id": 42363, "text": "Directly related to public safety, public health, and major public interests;", "label": ["Important", "Edit/Control"], "rewrite": "Your request is directly related to public safety, public health, and major public interests and may not be responded."}
{"task": "rw_14.jsonl", "id": 42364, "text": "Directly related to criminal investigation, prosecution, trial, and execution judgment;", "label": ["Important", "Edit/Control"], "rewrite": "Your request is related to criminal investigation, prosecution, and trial, and may not be responded."}
{"task": "rw_14.jsonl", "id": 42365, "text": "We have sufficient evidence that you have subjective malice or abuse of rights (such as your request will endanger public safety and the legitimate rights and interests of others, or your request exceeds the scope of general technical means and commercial costs);", "label": ["Important", "Edit/Control"], "rewrite": "If we have sufficient evidence that the subject of personal information has subjective malice or abuse of rights, we may not be able to respond to requests."}
{"task": "rw_14.jsonl", "id": 42366, "text": "The request to respond to the subject of the personal information will cause the legitimate rights and interests of you or other individuals and organizations to be seriously damaged;", "label": ["Important", "Edit/Control"], "rewrite": "We may not be able to respond to requests that exceed the storage range, exceed the reasonable limit, or the legitimate rights and interests of personal information subjects or other individuals and organizations will be seriously damaged."}
{"task": "rw_14.jsonl", "id": 42367, "text": "Involved in business secrets;", "label": ["Important", "Edit/Control"], "rewrite": "We may not be able to respond."}
{"task": "rw_14.jsonl", "id": 42368, "text": "Law and administrative regulations have other stipulated situations.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42369, "text": "5.11. How to respond to your rights request", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42370, "text": "To ensure safety, you may need to provide a written request or prove your identity in other ways.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42371, "text": "We may ask you to verify your identity first, and then process your request.", "label": ["Important", "Data Security"], "rewrite": "We may ask you to verify your identity first, and then process your request."}
{"task": "rw_14.jsonl", "id": 42372, "text": "After verification, we will respond within 15 working days.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42373, "text": "If you are not satisfied, you can also pass the following channels: Shoujibaidu@baidu.com.", "label": ["Important", "Contact Information"], "rewrite": "Complaint pathway: Shoujibaidu@baidu.com."}
{"task": "rw_14.jsonl", "id": 42374, "text": "For your reasonable request, we do not charge fees in principle, but we will charge a certain cost fee depending on the request that repeats and beyond the reasonable limit.", "label": ["Important", "Edit/Control"], "rewrite": "Reasonable requests are not charged in principle without charging and exceeding the reasonable limit."}
{"task": "rw_14.jsonl", "id": 42375, "text": "For those who have no repetition and need too much technical means (for example, need to develop new systems or fundamentally change the current practice), bring risks to others' legitimate rights and interests or very unrealistic (for example, information involved in backup tapes)We may refuse.", "label": ["Important", "Data Security"], "rewrite": "We may refuse to repeat for unseen, need too much technical means, bring risks or very unrealistic requests to others' legitimate rights and interests."}
{"task": "rw_14.jsonl", "id": 42376, "text": "6. How do we deal with the personal information of minors", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42377, "text": "Baidu attaches great importance to the protection of minors' information.", "label": ["Specific Audiences", "Important"], "rewrite": "Baidu attaches great importance to the protection of minors' information."}
{"task": "rw_14.jsonl", "id": 42378, "text": "Our products and services are mainly adults.", "label": ["Specific Audiences", "Important"], "rewrite": "Our products and services are mainly adults."}
{"task": "rw_14.jsonl", "id": 42379, "text": "We will only process minor personal information under the consent of laws and regulations, parents or other guardians.", "label": ["Specific Audiences", "Important"], "rewrite": "We will only process minor personal information under the consent of laws and regulations, parents or other guardians."}
{"task": "rw_14.jsonl", "id": 42380, "text": "If you are a minor under the age of 14, before using the \"Baidu\" mobile application products and services, you should ask your parents or other guardians to read it carefully, or be careful under the supervision and guidance of your parents or other guardians.Read this privacy policy and \"Baidu Children's Personal Information Protection Statement\", and use our products and services under the consent of your parents or other guardians, or provide us with information.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a child under the age of 14, please use the promoter to read this policy carefully and the \"Physical Information Protection Statement of Baidu Children\" and agree to use services or provide information under the guidance of the guardian."}
{"task": "rw_14.jsonl", "id": 42381, "text": "If we find personal information of minors under the age of 14 without the consent of parents or other guardians who can be proven in advance, we will take measures to delete relevant information as soon as possible.", "label": ["Specific Audiences", "Important"], "rewrite": "If the personal information of minors was collected without the consent of the legal guardian, he would try to delete relevant information as soon as possible."}
{"task": "rw_14.jsonl", "id": 42382, "text": "If the guardian has reason to collect the personal information of minors without the consent of the guardian, please please via the \"Mine]-[Settings]-[Help and Feedback]-[help and feedback]-[help and feedback]-[help and feedback]-[Feedback suggestions] Contact us, we will take measures to delete relevant data as soon as possible.", "label": ["Edit/Control", "Specific Audiences", "Important"], "rewrite": "If the guardian has reason to believe that we have collected personal information of minors without obtaining its consent, please follow the [Baidu \"mobile application [Mine]-[Settings]-[Help and Feedback]-[Feedback Suggestion] Contact Usdelete."}
{"task": "rw_14.jsonl", "id": 42383, "text": "7. Revision of privacy policy", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42384, "text": "Our privacy policy may change.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42385, "text": "Without your clear consent, we will not reduce the rights you should enjoy in accordance with this privacy policy.", "label": ["Policy Change", "Important"], "rewrite": "Without your clear consent, we will not reduce the rights you should enjoy in accordance with this privacy policy."}
{"task": "rw_14.jsonl", "id": 42386, "text": "We will post any changes to this privacy policy on this page.", "label": ["Policy Change", "Important"], "rewrite": "We will post any changes to this privacy policy on this page."}
{"task": "rw_14.jsonl", "id": 42387, "text": "For major changes, we will notify you in the main exposure page or in -site exposure pages or in -site letters or sending emails or other appropriate ways to reach you.", "label": ["Policy Change", "Important"], "rewrite": "We will notify your major changes in this policy on the main exposure page of the product or service on the main exposure page of the product or service."}
{"task": "rw_14.jsonl", "id": 42388, "text": "If you do not agree with these changes, please stop using the \"Baidu\" mobile application products and services immediately.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42389, "text": "The major changes in this policy include, but not limited to:", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42390, "text": "Our service model has changed significantly.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42391, "text": "Such as the purpose of handling personal information, the type of personal information, the use of personal information, etc.;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42392, "text": "We have changed significantly in the aspects of ownership structure and organizational structure.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42393, "text": "Such as changes caused by business adjustments, bankruptcy mergers and acquisitions, etc.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42394, "text": "The main objects that provide, transfer or publicly disclose personal information have changed;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42395, "text": "You participated in the right of personal information processing and its exercise methods have undergone major changes;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42396, "text": "When we are responsible for handling the responsibility departments, contact methods and complaint channels of personal information security;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42397, "text": "The personal information security impact assessment report shows that there is a high risk.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42398, "text": "If there is no such thing as a privacy policy, the \"Baidu Privacy Protection Statement\" shall prevail.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42399, "text": "8. How to contact us", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42400, "text": "The growth of the \"Baidu\" mobile application is inseparable from the joint efforts of users of all parties. We are very grateful for your contribution to \"Baidu\" mobile application data updates and feedback.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42401, "text": "You can feedback your suggestions for \"Baidu\" mobile applications and problems encountered during the use of \"Baidu\"-[Settings]-[Help and Feedback]-To help us optimize product functions and services, and make more users use our products and services more conveniently.", "label": ["Important", "Contact Information"], "rewrite": "You can feedback through [Mine]-[Settings]-[Help and Feedback]-[Feedback Suggestion] or send emails to Shoujibaidu@baidu.com."}
{"task": "rw_14.jsonl", "id": 42402, "text": "You can contact us through personal information protection problem feedback platform (http://help.baidu.com/personalinFormation).", "label": ["Important", "Contact Information"], "rewrite": "You can contact us through personal information protection problem feedback platform (http://help.baidu.com/personalinFormation)."}
{"task": "rw_14.jsonl", "id": 42403, "text": "You can also contact us by contacting us as follows:", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42404, "text": "No. 10, Shangdi Street, Haidian District, Beijing, China", "label": ["Important", "Contact Information"], "rewrite": "Contact address: Beijing Baidu Net News Technology Co., Ltd., Beijing Baidu News Technology Co., Ltd., 10 10th Street, Haidian District, Beijing."}
{"task": "rw_14.jsonl", "id": 42405, "text": "Beijing Baidu Net News Technology Co., Ltd. Legal Affairs Department", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42406, "text": "Postal code: 100085", "label": ["Important", "Contact Information"], "rewrite": "Postal code: 100085"}
{"task": "rw_14.jsonl", "id": 42407, "text": "In order to ensure our efficient handling of your problems and feedback to you in time, you need to submit identity certificates, effective contact information and written requests and related evidence. We will verify your identity to deal with your request.", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "You need to submit identity certificates, effective contact information, written requests and related evidence, we will verify your identity to handle your request."}
{"task": "rw_14.jsonl", "id": 42408, "text": "If you are not satisfied with our response, especially if you think our personal information processing behavior harms your legitimate rights and interests, you can also seek solutions through the following external channels: a lawsuit with the Beijing People's Court of Beijing.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42409, "text": "Attachment: term explanation", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42410, "text": "Personal information refers to the various information related to the recognized or recognizable natural person recorded in electronics or other methods, excluding information after anonymous processing.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42411, "text": "Personal information includes names, date of birth, ID number, personal biometric information, address, communication and communication contact information, communication records and content, account password, property information, credit information, travel information, accommodation information, health and physiological information, transactions, transactions, transactionsInformation, etc.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42412, "text": "Sensitive personal information refers to personal information that can easily cause the personality and dignity of natural persons to be infringed or harmed by personal and property security, including biometrics, religious beliefs, specific identities, medical health, financial accounts, trajectory trajectory and other informationAnd personal information under minor at the age of 14.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42413, "text": "Device refers to devices that can be used to use Baidu products and/or services, such as desktop devices, tablets or smartphones.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42414, "text": "Equipment information may include the device attribute information of the terminal device you used to install and run the \"Baidu\" mobile application (for exampleCode IMSI, network device hardware address Mac, advertising identifier IDFA, supply trademark identification IDFV, mobile device recognition code Meid, anonymous device identifier OAID, integrated circuit card recognition code ICCID, Android ID, hardware serial number and other equipment identifier), Equipment connection information (such as the type of browser, telecommunications operator, language used, WIFI information), and device status information (such as device application installation list).", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42415, "text": "Log information refers to the requests issued by our server automatically when visiting the \"Baidu\" mobile application, such as your IP address, the type of browser and the language used, hardware equipment information, operating system versions, network operations, network operations, network operations, network operations, and network operationsBusiness information, the date, time, and length of your access service are provided, formed or reserved when using our products or services.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42416, "text": "Cookie refers to a mechanism that supports the server (or script) to store and retrieve information on the client. By adding a simple and persistent client state to expand the web -based client/server application.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42417, "text": "The server sends a status information while returning the HTTP object to the client, and is stored by the client.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42418, "text": "The state information shows the effective URL range in this state.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42419, "text": "Since then, the HTTP request within this range initiated by the client will return the current value of the status information from the client to the server. This state information is called Cookie.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42420, "text": "Location information refers to the accurate location information obtained by GPS information, WLAN access points, Bluetooth, base stations, and other sensor information, as well as rough geographical location information obtained through IP addresses or other network information.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42421, "text": "User portraits refer to analysis or predictions of personal characteristics of a certain natural person through collecting, gathering, and analyzing personal information, such as their occupations, economy, health, education, personal preferences, credit, behavior, etc., to form their personal characteristic modelEssence", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42422, "text": "Use personal information of specific natural persons to form a characteristic model of the natural person, called direct user portraits.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42423, "text": "The use of personal information from specific natural persons, such as the data of its group, forms a characteristic model of the natural person, called indirect user portraits.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42424, "text": "Decoration refers to the process of processing personal information, so that it cannot recognize a specific natural person without using additional information.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42425, "text": "Anonymous refers to the process that the personal information subject cannot be recognized by the technical processing of personal information, and the processing information cannot be restored.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42426, "text": "The information obtained by personal information after anonymous processing does not belong to personal information.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42427, "text": "Baidu platform refers to the special channels or platform services under Baidu Company (including Baidu Search, Baidu Encyclopedia, Baidu Zhi, Baidu Tieba, Baidu Nuomi, Baidu Mobile Assistant and other Baidu products https://www.baidu.com/more/) and other websites, programs, services, tools and clients.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42428, "text": "A related company refers to Beijing Baidu Net News Technology Co., Ltd., an operator of \"Baidu\" Mobile Application, and other companies that are related to the company that are related to Baidu.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42429, "text": "\"Related relationship\" refers to the subject (including individuals, companies, partnerships, organizations, or other entities), that is, the subject that directly or indirectly controls, or the subject that controls it directly or indirectlyMaster controlled by the same subject.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42430, "text": "The aforementioned \"control\" means that through holding voting rights, contracts or other methods, directly or indirectly have the power or other relationships that instructions or instructions that to instructions to make instructions by others.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42431, "text": "Thank you again for your trust and use of \"Baidu\" mobile application!", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42432, "text": "Beijing Baidu Net News Technology Co., Ltd.", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42433, "text": "Update date: December 30, 2021", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42434, "text": "Effective date: January 06, 2022", "label": [], "rewrite": []}
{"task": "rw_14.jsonl", "id": 42435, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
