{"task": "rw_13.jsonl", "id": 41783, "text": "WPS privacy policy", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41784, "text": "Update date: May 19, 2022", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41785, "text": "Effective date: May 24, 2022", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41786, "text": "Thank you for choosing WPS Office Software Services (hereinafter referred to as \"this service\") developed and operated by Zhuhai Jinshan Office Software Co., Ltd. and/or its related company (hereinafter referred to as \"we\").", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41787, "text": "Scope of application of this service:", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41788, "text": "WPS Office Personal Version Client (including clients running in Windows, Mac, Android, iOS, Linux operating system);", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41789, "text": "Access to WPS Office Personal Client, Jinshan Document Client (operating in Windows, Mac, Android, iOS operating system)Kingsoft form, Kingsoft calendar, Kingsoft to be managed, rice shells, WPS members and other services;", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41790, "text": "WPS Office WeChat/QQ/Alipay Mini Program, WPS Member WeChat/QQ/Alipay Mini Program, rice shell WeChat/QQ/Alipay applet, Jinshan form WeChat/QQ applet, Kingsoft calendar WeChat mini program, Kingsoft to run WeChat mini programs, File Assistant Mini Program.", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41791, "text": "Special Note:", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41792, "text": "Before you use this service, please be sure to read this policy carefully. We will always show us the personal information we collected in any part or in the process of any part or in the process of protecting your use of this service.", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41793, "text": "Important clauses that are closely related to your rights (possibilities) in this policy have been reminded by bold fonts to remind you. Please focus on it.", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41794, "text": "contact us", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41795, "text": "In order to effectively manage and protect your personal information, we have set up a special personal information protection team and person in charge. If you have any questions, opinions or suggestions on the protection of this policy or personal information, we can contact us through the following ways.Acceptance and processing within 15 working days:", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41796, "text": "Address: Building 5, Jinshan Software Park, No. 321, Qiandao Ring Road, Tangjiawan Town, Zhuhai City, Guangdong Province, Personal Information Protection Office (receipt)", "label": ["Important", "Contact Information"], "rewrite": "Address: Personal Information Protection Office (receipt)"}
{"task": "rw_13.jsonl", "id": 41797, "text": "Postcode: 519080", "label": ["Important", "Contact Information"], "rewrite": "Postcode: 519080"}
{"task": "rw_13.jsonl", "id": 41798, "text": "Email: wps@wps.cn", "label": ["Important", "Contact Information"], "rewrite": "Email: wps@wps.cn"}
{"task": "rw_13.jsonl", "id": 41799, "text": "Tel: 400-677-5005", "label": ["Important", "Contact Information"], "rewrite": "Tel: 400-677-5005"}
{"task": "rw_13.jsonl", "id": 41800, "text": "definition", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41801, "text": "Related Company: Refers to controlling the company and institutions under the control of Zhuhai Jinshan Office Software Co., Ltd., controlled by Zhuhai Jinshan Office Software Co., Ltd. or under the joint control with Zhuhai Jinshan Office Software Co., Ltd..", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41802, "text": "Control refers to the ability to directly or indirectly affected the controlled management/operation of the controlled objects directly or indirectly through ownership, contract, actual operation association, or other methods identified in accordance with the law.", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41803, "text": "Personal information: Refers to various information related to recognized or recognized natural persons recorded in electronics or other ways, excluding information after anonymous processing.", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41804, "text": "Personal sensitive information: It refers to personal information that once leaked, illegally provided or abuses the security of people and property, and it is easy to lead to personal information that causes personal reputation, physical and mental health or discrimination. Make a significant identification with a thick body.", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41805, "text": "Personal information deletion: Refers to removing personal information in a system involved in daily business functions, so that it keeps them from being retrieved and accessed.", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41806, "text": "Personal information anonymity: Through the technical processing of personal information, you cannot be recognized, and the processing information after processing cannot be restored.", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41807, "text": "Application information: Including the package name, version number, distribution channels, and distribution channel types of host applications, it is based on the actual collection of the product.", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41808, "text": "Equipment information: Including device names, equipment brands, equipment models, device manufacturers, MAC address, device logo(MD5 values based on device MAC address encryption) Software feature information, operating system versions, operating system language, resolution, service provider network ID, sensor information (such as acceleration sensor, magnetic field sensor, gyroscope, pressure sensor), etc.), etc.), etc.)The actual collection of the product shall prevail.", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41809, "text": "Network location information: The general geographical location information obtained through IP address, operator information, base station information, nearby WiFi, connected WIFI obtained, and only collect it to the state/provincial/municipalities.", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41810, "text": "Accurate geographical location information: Obtaining accurate geographical location information obtained through sensor information such as GPS information and base stations, we will obtain your separate authorization before collecting this information.", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41811, "text": "How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41812, "text": "For the following goals described in this policy, we will collect and use your personal information, and we will also explain through the \"Personal Information Collection List\".", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41813, "text": "In order to provide you with a service, we may need to apply to you within the necessary range to obtain the following permissions. We will explain the authority of the relevant operating system that may apply and use through the \"Application Power List\", and you can manage the relevant permissions according to actual needs.", "label": ["Permission Acquisition", "Important"], "rewrite": "In order to provide you with services, we may need to apply to you within the necessary range to obtain the following permissions."}
{"task": "rw_13.jsonl", "id": 41814, "text": "Please rest assured that we will not open these permissions by default. Only after you have a separate consent, you will access it when you realize specific services/functions;", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41815, "text": "Even after your authorization, you can access your corresponding permissions, we will only access within the scope of your authorization and obtain the corresponding information (such as involved);", "label": ["Permission Acquisition", "Important"], "rewrite": "Even after your authorization, we will only access within the scope of your authorization and obtain the corresponding information."}
{"task": "rw_13.jsonl", "id": 41816, "text": "And you can withdraw authorization at any time. After you withdraw authorization, we will stop accessing the corresponding permissions, and we will no longer provide you with some services corresponding to it, but it will not affect the other services you provide.", "label": ["Important"], "rewrite": "After you withdraw authorization, we will stop accessing the corresponding permissions and will no longer provide you with some corresponding services, but it will not affect the other services you provide."}
{"task": "rw_13.jsonl", "id": 41817, "text": "Help you become our user and account management", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41818, "text": "Register becoming our user", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41819, "text": "In order to help you become our user, you can complete the WPS account creation and use the WPS account to log in to use this service so that we can provide you with registered our user services. We provide you with a variety of registered channels for you to choose from.", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41820, "text": "When you choose to register with your mobile phone number or email, you need to provide us with your mobile phone number, email address and password. We use this kind of information to send the verification code information to submit whether you are valid.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you choose to register with your mobile phone number or email, you need to provide us with your mobile phone number, email address and password."}
{"task": "rw_13.jsonl", "id": 41821, "text": "Based on our cooperation with communication operators, when you use the one -click login function, after your consent, the operator will send us your mobile phone number to us so that we will provide you with a fast login service.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use one -click login function, after your consent, the operator will send us your mobile phone number to us to provide you with a fast login service."}
{"task": "rw_13.jsonl", "id": 41822, "text": "When you choose to register and log in to this service more conveniently and log in to this service when you choose to use a third -party account (such as WeChat, QQ, nailing, Weibo, etc.), we will access and collect your personal information after indirectly.Nickname, avatar, gender, region, specifically the content you authorize) and bind your third -party account with your account.", "label": ["Important", "First Party Collection Information"], "rewrite": "When registering and logging in with a third -party account, access and collect your personal information after your authorization, and bind it."}
{"task": "rw_13.jsonl", "id": 41823, "text": "If you refuse to provide information under a third -party account, you cannot choose to register and log in with a third -party account.", "label": ["Important"], "rewrite": "If you refuse to provide information under a third -party account, you cannot choose to register and log in with a third -party account."}
{"task": "rw_13.jsonl", "id": 41824, "text": "Please know and understand that we collect mobile phone numbers and email address to meet the real -name system requirements of relevant laws and regulations. If you do not provide such information, you may not be able to use the services that we need to use normally.", "label": ["Important", "First Party Collection Information"], "rewrite": "We collect mobile phone numbers and email address to meet the real -name system requirements of relevant laws and regulations."}
{"task": "rw_13.jsonl", "id": 41825, "text": "Help you find your account", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41826, "text": "When your account cannot log in or forgot the password, and cannot receive the SMS verification code, you can retrieve the account through the account appeal. To ensure that the account you apply forWe will verify your identity information through a third -party authentication agency, and we will check your identity information through a third -party authentication agency.", "label": ["Important", "First Party Collection Information"], "rewrite": "To ensure that the account you apply for is owned by you, you need to provide a real name, ID number, mobile phone number, and handheld ID photo. We will verify your identity information."}
{"task": "rw_13.jsonl", "id": 41827, "text": "Provide you online services", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41828, "text": "The functional services that we have already launched in the future that need to be interacted with the server is uploaded by you in the state of the network and after logging in to the account.With automatic roaming) to the server as the premise, we collect the file information you uploaded to the server side (including file type, size, pages, modification time, document authority, storage location, the same below).of.", "label": ["Important", "First Party Collection Information"], "rewrite": "The functional services that need to be interacted with the server are based on the premise of uploading the content to the server under the network state and login account. We collect the file information you uploaded to the server."}
{"task": "rw_13.jsonl", "id": 41829, "text": "Online documentation", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41830, "text": "The online preview, editors, multi -person online collaboration editing, document sharing, real -time preservation of documents to the cloud, etc. The functions that need to be implemented in the cloud and subsequent launch of Yuyun will be launched in the cloud.Upload relevant document materials (including manual uploading and automatic roaming) to the function/service of the cloud as the premise.Provide you with related cloud services.", "label": ["Important", "First Party Collection Information"], "rewrite": "Based on the function/services that you upload the relevant document materials to the cloud in the cloud under the network and login account, we collect your document and document information you uploaded to the cloud."}
{"task": "rw_13.jsonl", "id": 41831, "text": "The relevant document materials you uploaded will read and use it as the basic materials for AI training after desensitization, but please rest assured that we will take security measures and technical means to protect your personal information and will use technical means to this equation.The data is identified to reduce your risks to reduce other organizations or individuals after identifying personal information.", "label": ["Important", "Data Security"], "rewrite": "The relevant document materials you uploaded will be read and used as the basic materials for AI training after desensitization. We will take security measures and technical means to protect your personal information."}
{"task": "rw_13.jsonl", "id": 41832, "text": "In the collaboration of online documentation, in order to make the parties participating in the editor know the edited and modified information, we will show your avatars, nicknames and modification traces, and for the historical version of the document to view the document.", "label": ["Important"], "rewrite": "In the collaboration of online documentation, we will show your avatars, nicknames and modification traces, and for all parties to view the historical version of the document."}
{"task": "rw_13.jsonl", "id": 41833, "text": "In addition, you can set document permissions according to your needs.", "label": ["Important", "Edit/Control"], "rewrite": "You can set up document permissions according to your needs."}
{"task": "rw_13.jsonl", "id": 41834, "text": "Kingsoft Conference", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41835, "text": "You can use the audio and video conference function provided by the Kingsoft Conference. In order to use the audio and video conference function, you need to authorize the camera/microphone rights of the device to obtain the device. If you refuse to authorize, you will not be able to use this function.", "label": ["Permission Acquisition", "Important"], "rewrite": "To use the audio and video conference function, you need to authorize the camera/microphone right of our device."}
{"task": "rw_13.jsonl", "id": 41836, "text": "Kingsoft Calendar", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41837, "text": "You can use Jinshan calendar function to add your own schedule and incident notification, accept or send conference invitations to subscribe to the schedule information provided by a third party.", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41838, "text": "You can set the permissions of your calendar arrangement.", "label": ["Important", "Edit/Control"], "rewrite": "You can set the permissions of your calendar arrangement."}
{"task": "rw_13.jsonl", "id": 41839, "text": "Kingsoft", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41840, "text": "Create a form", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41841, "text": "When you can use the Kingsoft form function to create, edit, and publish forms, we will review whether the content of the form is suspected of infringing on national security and interests, public interests or other illegal activities involving other illegal activities.", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41842, "text": "Fill in the form", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41843, "text": "The contents of the form are edited by the form of the form. The formula of the format of the form has the right to determine the form, content, and the scope of whether it is public and public.As a technical provider, you will not use any information you submit in any way without your permission.", "label": ["Edit/Control", "Usage", "Important"], "rewrite": "The form of the form of the form to determine the form, content, and the scope of whether it is public and public, the Kingsoft office will not use any information you submitted in any way."}
{"task": "rw_13.jsonl", "id": 41844, "text": "You (as a form to fill in the form) should judge whether to fill in the form and whether to submit your personal information to the form from the form (such as name, ID number, mobile phone number, address, WeChat, QQ number, bank account number, Alipay, AlipayAccount, geographical location, etc.).", "label": ["Important", "Edit/Control"], "rewrite": "Form fillers shall determine whether to fill in the form by themselves, and whether to submit your personal information to the form to send your personal information to the form."}
{"task": "rw_13.jsonl", "id": 41845, "text": "Once you fill in and submit the form, the relevant form data is attributed to the formula of the form tuscape control. If you refuse to provide the answer data to the formula party, please do not actively fill in and submit the form.", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41846, "text": "Statistical form", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41847, "text": "We will help you count the form that you will fill in and submit it by your post and form answers.", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41848, "text": "As the sponsor of the form, you are the collector and controller of the data, and the data you recover may contain personal information of other subjects such as the format answer.", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41849, "text": "You enjoy the use and control of the data collected form data. We only provide you with technical services that recycling, storage and statistics of form data recycling, storage and statistics, so that you can retrieve analysis and use. Without the consent of your personal information related to the form data, weIt will not exceed the provisions of laws and regulations and the scope of the scope of the policy authorization, processing, transmission, and sharing your form data.", "label": ["Important"], "rewrite": "We will not exceed the provisions of laws and regulations and the scope of the scope of this policy to use, process, transmit, and share your form data."}
{"task": "rw_13.jsonl", "id": 41850, "text": "Copy and share", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41851, "text": "When you share and copy information, we need to access your shear plates and read the links contained in it and other content information contained in it to achieve functions or services such as jumping, copying, and sharing.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you share and copy the information, we need to access your shear plate and read the links and other content information contained in it."}
{"task": "rw_13.jsonl", "id": 41852, "text": "Public account article transfer to Yunwen file", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41853, "text": "When you use the public account article to save the cloud document service, we will collect your account information and WeChat public account article link to identify your user identity and save the successful cloud document to your account number to your account numberEssence", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the public account article to save the cloud document service, we will collect your account information and WeChat public account article link to save the successful cloud document to your account."}
{"task": "rw_13.jsonl", "id": 41854, "text": "Order and payment", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41855, "text": "Order and order management", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41856, "text": "Invoice related invoice information (type of invoice, invoice head, tax number, registered address, registered phone number, bank account, bank account number, invoice content, invoice amount, invoice remarks, invoice acceptance phone or email address).", "label": ["Important", "First Party Collection Information"], "rewrite": "When you buy this service value -added service, we need to collect information such as your transaction product/service information, order number, order time and other information based on the product/service type."}
{"task": "rw_13.jsonl", "id": 41857, "text": "Please know and understand that we collect this information to help you successfully complete product/service purchase, reception, query order information, and provide customer service (such as after -sales service).", "label": ["Important", "Usage"], "rewrite": "We collect this information to help you successfully complete the purchase, receipt, query order information, and provide customer service."}
{"task": "rw_13.jsonl", "id": 41858, "text": "At the same time, in order to facilitate your understanding, query order information, and manage order information, we will use the order information that you generate in the process of using our service to display it to you.", "label": ["Important", "Usage"], "rewrite": "We will use the order information that you generate in the process of using our service to display it to you."}
{"task": "rw_13.jsonl", "id": 41859, "text": "Pay", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41860, "text": "In order to complete the order payment and ensure the security of transactions, we need to collect your transaction amount, order time, order merchant, order number, payment method, payment account, payment status information, and through security methods and payment institutions (such as WeChat, Alipay, etc.Financial institutions) Shared the aforementioned part or all information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We need to collect your transaction amount, order time, order merchant, order number, payment method, payment account, payment status information, and share with the payment institution through security methods."}
{"task": "rw_13.jsonl", "id": 41861, "text": "Improve our products or services", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41862, "text": "Location information, operating behavior data (including process information during operation, frequency of documentation, and use time) for data analysis to understand the use of the product, adaptation, and the development, existing functions, services of new products and new servicesPerfect the data support.", "label": ["Important", "Usage"], "rewrite": "We will analyze data analysis through the software information, device information, device connection information, account information, network location information, and operating behavior data you use this service."}
{"task": "rw_13.jsonl", "id": 41863, "text": "For your personal information generated by this service, we may associate with your personal information collected with other products/services that we develop and operates you have developed and operated in the absence of your authorization and consent, so you can use us to use us.Uniform services in different products (such as unified account login service).", "label": ["Important", "Usage"], "rewrite": "In the case of obtaining your authorization and consent, we may associate your personal information generated by this service with your personal information collected by other products/services."}
{"task": "rw_13.jsonl", "id": 41864, "text": "Provide you with security", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41865, "text": "In order to improve the security of your service, protect the safety of personal property of you, other users or the public, be exempted from infringement, and better prevent security risks such as fishing websites, fraud, network vulnerabilities, computer viruses, cyber attacks, network invasion, etc.Accurately identify the situation of violating laws and regulations or our relevant agreement rules, we may use or integrate your account information, equipment information, network logs, and the frequency, collapse data, and channel distribution information you use this service to comprehensively judge your accountRisk, identity verification, testing and prevention of safety incidents, and adopting necessary records, audits, analysis, and disposal measures in accordance with the law.", "label": ["Important", "Data Security"], "rewrite": "We may use or integrate your account information, equipment information, network logs, and the frequency, collapse data, and channel distribution information you use this service to improve service security, and take necessary records, audit, analysis, disposal measures in accordance with the lawEssence"}
{"task": "rw_13.jsonl", "id": 41866, "text": "For example, we will comprehensively analyze the abnormal user account activity, multi -end login, and abnormal traffic to protect your account security.", "label": ["Important", "Data Security"], "rewrite": "We will comprehensively analyze the abnormal user account activity, multi -end login, and abnormal traffic to protect your account security."}
{"task": "rw_13.jsonl", "id": 41867, "text": "Customer service and after -sales", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41868, "text": "If you need to support after -sales service in using this service process, we will check your identity and related products or services based on your account information (if any), and according to your application information, device information, equipment information, andEquipment information, network location information, log information, and your email content, screenshot, documentation, public account message, or telephone conversation content with our customer service staff to submit consultations to help you find the cause and solve the problem.", "label": ["Important", "Usage"], "rewrite": "If you need after -sales service support, we will check your identity and related products or services based on your account information, and help you solve the problem according to your application information and equipment information of this service."}
{"task": "rw_13.jsonl", "id": 41869, "text": "Other uses", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41870, "text": "Judgment of news push, soft text and participation: We may launch activities such as drawing, gifts, welfare receiving, competitions, promotions, use of points for products, etc., or to launch new products, services, and functions from time to time.In order to accurately push activity information, related soft texts or related products, services, and reduce the interference of non -activity objects, we will use your device information, account information, and behavior data of this service to determine whether you are related objects and then decide whether to go towards or not to go towards it.You push, display activity information, related soft texts, and use the information collected above as the basis for determining that you have the qualifications for participating in activities.", "label": ["Important", "Usage"], "rewrite": "We will use your device information, account information, and behavioral data of this service to determine whether you are related objects and then decide whether to push, display activity information, and related soft texts to you."}
{"task": "rw_13.jsonl", "id": 41871, "text": "If you purchase this service from our dealers and agents channels, we will obtain your order information from these third -party channels, including your name/nickname, and the specific content information of the service purchased by the account information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If you purchase this service from our dealers and agents channels, we will obtain your order information from these third -party channels."}
{"task": "rw_13.jsonl", "id": 41872, "text": "If you participate in our lottery, gift, welfare collection, competition, promotion, use of points for products, etc., because you need to distribute related prizes, gifts, and products to you, so you need to provide you or your designated recipients of the recipients.Receive information (the name of the consignee, the receipt phone (including the mobile phone number), the receiving address).", "label": ["Important", "First Party Collection Information"], "rewrite": "When distributing related prizes, gifts, and products to you, you need to provide you or your designated recipients."}
{"task": "rw_13.jsonl", "id": 41873, "text": "We will use technical means anonymous processing collected your personal information.", "label": ["Important", "Data Security"], "rewrite": "We will use technical means anonymous processing collected your personal information."}
{"task": "rw_13.jsonl", "id": 41874, "text": "Exception of obtaining authorization consent", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41875, "text": "You fully know that in the following situations, we do not need to obtain your authorization consent:", "label": ["Important", "First Party Collection Information"], "rewrite": "You fully know that in the following situations, we do not need to obtain your authorization consent:"}
{"task": "rw_13.jsonl", "id": 41876, "text": "Related to the obligations stipulated in the performance of laws and regulations;", "label": ["Important", "First Party Collection Information"], "rewrite": "The collection and use information related to the obligation stipulated in the performance of laws and regulations does not need to solicit authorization consent."}
{"task": "rw_13.jsonl", "id": 41877, "text": "Directly related to national security and national defense security;", "label": ["Important", "First Party Collection Information"], "rewrite": "The collection and use information directly related to national security and national defense security does not need to solicit authorization consent."}
{"task": "rw_13.jsonl", "id": 41878, "text": "It is directly related to public safety, public health, and major public interests;", "label": ["Important", "First Party Collection Information"], "rewrite": "The collection and use information directly related to public safety, public health, and major public interests does not need to solicit authorization consent."}
{"task": "rw_13.jsonl", "id": 41879, "text": "Directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Important", "First Party Collection Information"], "rewrite": "Direct related collection and use information such as criminal investigation, prosecution, trial, and execution of judgments does not need to solicit authorization consent."}
{"task": "rw_13.jsonl", "id": 41880, "text": "It is difficult to obtain your consent for maintaining major legitimate rights and interests such as life and property of you or other individuals;", "label": ["Important", "First Party Collection Information"], "rewrite": "Out of maintaining major legitimate rights and interests such as life and property of you or other individuals, it is difficult to obtain the collection and use information you agree with, without requiring the consent of authorization."}
{"task": "rw_13.jsonl", "id": 41881, "text": "The personal information involved is made by your own public;", "label": ["Important", "First Party Collection Information"], "rewrite": "The personal information involved in collecting and using is public to the public by itself, and there is no need to solicit authorization consent."}
{"task": "rw_13.jsonl", "id": 41882, "text": "Signing and fulfilling the contract according to your requirements;", "label": ["Important", "First Party Collection Information"], "rewrite": "The collection and use information necessary for signing and fulfilling the contract according to your requirements does not need to solicit authorization consent."}
{"task": "rw_13.jsonl", "id": 41883, "text": "Collect personal information from the legal public information, such as legal news reports, government information disclosure and other channels;;", "label": ["Important", "First Party Collection Information"], "rewrite": "If you collect personal information from the legal disclosure information, you do not need to solicit authorization consent."}
{"task": "rw_13.jsonl", "id": 41884, "text": "Maintain the safe and stable operation of the products or services provided by maintenance, such as discovery and disposal of products or services;", "label": ["Important", "First Party Collection Information"], "rewrite": "Maintaining the collection and use information necessary for the safe and stable operation of the products or services provided by the maintenance, without requiring the consent of authorization."}
{"task": "rw_13.jsonl", "id": 41885, "text": "Other circumstances stipulated in laws and administrative regulations.", "label": ["Important", "First Party Collection Information"], "rewrite": "Other collection and use information stipulated in laws and regulations does not need to solicit authorization."}
{"task": "rw_13.jsonl", "id": 41886, "text": "How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41887, "text": "Cookie", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41888, "text": "To ensure the normal operation of this service, we will use related technologies to store small data files named Cookie from your device.", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41889, "text": "Cookie usually contains identifiers, site names, and some numbers and characters.", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41890, "text": "We may set up Cookie, which guarantees security and ensure security to confirm whether you log in to the service safely, or whether you encounter dispersion, fraud and other illegal behaviors.", "label": ["Important"], "rewrite": "Set up authentication and guarantee of security to confirm whether you log in to the service safely, or whether you encounter stolen, fraud and other illegal behaviors."}
{"task": "rw_13.jsonl", "id": 41891, "text": "These technologies also help us improve service efficiency, improve login and response speed.", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41892, "text": "Using cookie can also help you save the steps and processes of your personal information and enter search content.", "label": ["Important"], "rewrite": "Using cookies can help you save your steps and processes for your personal information and enter search content."}
{"task": "rw_13.jsonl", "id": 41893, "text": "We will not use Cookie for any purpose outside the purpose of this policy.", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41894, "text": "Do not track (Do not track)", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41895, "text": "You can manage or delete Cookie according to your preferences.", "label": ["Important", "Edit/Control"], "rewrite": "You can manage or delete Cookie according to your preferences."}
{"task": "rw_13.jsonl", "id": 41896, "text": "You can remove all the cookies saved on your device. Many network browsers have do, not, track functions, which can release Do, not, track requests to the website.", "label": ["Important", "Edit/Control"], "rewrite": "You can remove all the cookies saved on your device."}
{"task": "rw_13.jsonl", "id": 41897, "text": "At present, the major Internet standard organization has not yet established relevant policies to stipulate how websites should respond to such requests.", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41898, "text": "But if your browser enables Do Not Track, all our websites will respect your choices.", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41899, "text": "How can we share, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41900, "text": "shared", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41901, "text": "We share your personal information on the premise that we follow the premise of \"legitimate legitimacy, minimum necessity, and clear principle of purpose.\"", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We share your personal information on the premise that we follow the premise of \"legitimate legitimacy, minimum necessity, and clear principle of purpose.\""}
{"task": "rw_13.jsonl", "id": 41902, "text": "At the same time, we will evaluate the impact of personal information protection on personal information in advance, and take effective technical protection measures on the output form, circulation, use, etc.", "label": ["Important", "Data Security"], "rewrite": "We will conduct an evaluation of personal information protection for the shared activities of personal information, and take effective technical protection measures on the output form, circulation, use, etc."}
{"task": "rw_13.jsonl", "id": 41903, "text": "At the level of the cooperation agreement, the partners are strictly required to fulfill the obligations and responsibilities of the protection of your personal information, and sign a protection agreement on data security before cooperation with business partners.", "label": ["Important", "Data Security"], "rewrite": "Strictly require partners to fulfill the obligations and responsibilities of your personal information, and sign a protection agreement on data security before cooperation with business partners."}
{"task": "rw_13.jsonl", "id": 41904, "text": "To facilitate your reading, we have developed the \"Third -Party Information Sharing List\" to clearly and simply introduce the situation of our main personal information sharing and access software tool development package (SDK).", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For details, please refer to \"Third -Party Information Sharing List\""}
{"task": "rw_13.jsonl", "id": 41905, "text": "transfer", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41906, "text": "In principle, we will not transfer your personal information, except the following situations: except:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In principle, we will not transfer your personal information, except the following situations: except:"}
{"task": "rw_13.jsonl", "id": 41907, "text": "Based on the transfer requirements you put forward, and meet the requirements of laws and regulations and relevant regulatory regulations;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Based on your transfer requirements and meet the requirements of laws and regulations and regulatory regulations, your personal information may be transferred."}
{"task": "rw_13.jsonl", "id": 41908, "text": "If we need to transfer your personal information for the reasons of the company's merger, separation, dissolution, and declaration of bankruptcy, we will inform you of the name and contact information of the receiving party in advance and publicly obtain your clear authorization and consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When involving mergers, acquisitions, or bankruptcy liquidation, if personal information transfer is involved, you will obtain your authorization and consent in advance, and ask the recipient to continue to be subject to this policy, otherwise it will request that it will re -authorize your authorization consent."}
{"task": "rw_13.jsonl", "id": 41909, "text": "We will ask the receiver of the newly holding your personal information to continue to be constrained by this policy, and the receiver changes the original processing purpose and processing method. We will ask the receiver to re -solicit your authorization and consent.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41910, "text": "Disclose", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41911, "text": "We will not disclose your personal information that you have unprecedentedly or unintentionally disclosed, unless the disclosure is performed or obtained in compliance with laws and regulations or obtained your separate authorization and consent, and we will fully disclose your personal information.Evaluate and use safety protection measures that meet the industry's standards.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not publicly disclose your personal information that you have unprecedentedly or other unparalleled disclosure, unless the disclosure is conducting or obtained your separate authorization and consent in accordance with the provisions of laws and regulations."}
{"task": "rw_13.jsonl", "id": 41912, "text": "How do we protect and save your personal information", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41913, "text": "Technical protection", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41914, "text": "We will strictly abide by the relevant laws and regulations on handling personal information in mainland China, and adopt strict security protection measures to protect your personal information and prevent your personal information from being disclosed, use, modify, damage or lose.", "label": ["Important", "Data Security"], "rewrite": "We will take strict security protection measures to protect your personal information."}
{"task": "rw_13.jsonl", "id": 41915, "text": "The safety protection measures we have taken are as follows, but please understand that any security measures cannot be impeccable.", "label": ["Important", "Data Security"], "rewrite": "Although there are security measures, it is impossible to fully guarantee that there is no security problem."}
{"task": "rw_13.jsonl", "id": 41916, "text": "When you send or collect information with our server, we ensure that the use of the transport layer security protocol (TLS, WSS) and other appropriate encryption algorithms encrypt it.", "label": ["Important", "Data Security"], "rewrite": "When you send or collect information with our server, we ensure that the transfer layer security protocol is encrypted with other appropriate encryption algorithms."}
{"task": "rw_13.jsonl", "id": 41917, "text": "Your personal information is all stored on a safe server and protected in the controlled facilities.", "label": ["Important", "Data Security"], "rewrite": "Your personal information is all stored on a safe server and protected in the controlled facilities."}
{"task": "rw_13.jsonl", "id": 41918, "text": "We classify your information based on importance and sensitivity, and ensure that your personal information has corresponding security levels.", "label": ["Important", "Data Security"], "rewrite": "We classify personal information based on importance and sensitivity."}
{"task": "rw_13.jsonl", "id": 41919, "text": "Similarly, we have special access control measures for data storage based on clouds. We regularly review information collection, storage and processing practice, including physical security measures to prevent any unauthorized access and use.", "label": ["Important", "Data Security"], "rewrite": "We have special access control measures for data storage based on clouds, and regularly review information collection, storage and processing practice."}
{"task": "rw_13.jsonl", "id": 41920, "text": "We will perform their due diligence on third -party partners to ensure that they are capable of protecting your personal information.", "label": ["Important", "Data Security"], "rewrite": "We will perform their due diligence on third -party partners to ensure that they are capable of protecting your personal information."}
{"task": "rw_13.jsonl", "id": 41921, "text": "We will also check and evaluate it by implementing appropriate contract restrictions and conducting audit and evaluation when necessary to check whether the third party has adopted appropriate security standards.", "label": ["Important", "Data Security"], "rewrite": "We will make an appropriate contract restriction and make audit and evaluation when necessary."}
{"task": "rw_13.jsonl", "id": 41922, "text": "In addition, employees and third -party partners who visit your personal information all follow the obligations of strict contract confidentiality.", "label": ["Important", "Data Security"], "rewrite": "Employees and third -party partners who visit your personal information all follow the strict contract confidentiality obligations."}
{"task": "rw_13.jsonl", "id": 41923, "text": "We will carry out training and examinations of information security and privacy protection to strengthen employees' awareness of protecting the importance of personal information.", "label": ["Important", "Data Security"], "rewrite": "We will carry out training and examinations of information security and privacy protection to strengthen employees' awareness of protecting the importance of personal information."}
{"task": "rw_13.jsonl", "id": 41924, "text": "We will revise and improve the above measures and management methods from time to time to improve the overall security.", "label": ["Important", "Data Security"], "rewrite": "From time to time, we will revise and improve security measures and management methods to improve the overall security."}
{"task": "rw_13.jsonl", "id": 41925, "text": "Security system guarantee", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41926, "text": "We establish a data security management system around the data life cycle, and improve the security of this service from the aspects of organizational construction, system design, personnel management, product technology, and personal information security impact assessment.", "label": ["Important", "Data Security"], "rewrite": "We establish a data security management system around the data life cycle."}
{"task": "rw_13.jsonl", "id": 41927, "text": "At present, we have passed the third -level certification of information security level, ISO/IEC, 27001: 2013 information security international standard certification, ISO/IEC, 27701: 2019 personal information protection international standard certification.", "label": ["Important", "Data Security"], "rewrite": "The system has passed the third -level certification of information security level, ISO/IEC 27001: 2013 information security international standard certification, ISO/IEC 27701: 2019 personal information protection international standard certification."}
{"task": "rw_13.jsonl", "id": 41928, "text": "Information security incident processing", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41929, "text": "When we are informed of a security incident that has occurred, illegal provision or abuse of personal information, we will inform you in a timely manner in accordance with the requirements of laws and regulations: the basic situation and possible impact of security incidents, the disposal measures we have adopted or we are going to take, and we will adopt the disposal measures, and we have to take or to be taken.You can independently prevent and reduce risk suggestions, remedy measures, etc.", "label": ["Important", "Data Security"], "rewrite": "If a personal information security incident occurs, we will inform your basic situation, possible impact, disposal measures, independent prevention suggestions, etc."}
{"task": "rw_13.jsonl", "id": 41930, "text": "The incident -related situation will be informed by pushing notification. When it is difficult to inform you one by one, we will publish an announcement in a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "The relevant situation of security incidents will be informed by mail, letter, telephone, push notification, etc. When it is difficult to inform one by one, it will issue an announcement."}
{"task": "rw_13.jsonl", "id": 41931, "text": "At the same time, we will also report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "Report the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities."}
{"task": "rw_13.jsonl", "id": 41932, "text": "How do we save your personal information", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41933, "text": "Storage place", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41934, "text": "In accordance with the provisions of laws and regulations, we store your personal information collected and generated during the operation of mainland China to mainland China.", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in domestic operations will be stored in China."}
{"task": "rw_13.jsonl", "id": 41935, "text": "At present, we will not transmit your personal information overseas. If we transmit to overseas, we will follow relevant state regulations or solicit your consent.", "label": ["Data Retention", "Important"], "rewrite": "We will not transmit your personal information abroad. If we transmit them abroad, we will follow relevant state regulations or solicit your consent."}
{"task": "rw_13.jsonl", "id": 41936, "text": "Storage period", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41937, "text": "We will take reasonable and feasible measures to avoid collecting unrelated personal information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will take reasonable and feasible measures to avoid collecting unrelated personal information."}
{"task": "rw_13.jsonl", "id": 41938, "text": "We will only retain your personal information within the shortest period of the purpose of the cost of reaching the cost policy, unless you agree to extend the retention period or be permitted by law.", "label": ["Data Retention", "Important"], "rewrite": "Reserves your personal information within the time limit required for the service purpose, unless the law has other requirements."}
{"task": "rw_13.jsonl", "id": 41939, "text": "After exceeding the storage period, we will delete your personal information or take technical measures for anonymized processing, except for other provisions of laws and regulations.", "label": ["Data Retention", "Important"], "rewrite": "After exceeding the storage period, your personal information will be deleted or anonymous, except for other provisions of laws and regulations."}
{"task": "rw_13.jsonl", "id": 41940, "text": "Your rights", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41941, "text": "We attach great importance to your management of personal information and do our best to protect your rights to the right to check, replicate, correct, supplement, delete, and withdraw consent authorization of personal information.", "label": ["Important", "Edit/Control"], "rewrite": "We do our best to ensure the exercise of the rights of consultation, replication, correction, supplement, deletion, and withdrawal of authorization of personal information."}
{"task": "rw_13.jsonl", "id": 41942, "text": "Change or withdraw the scope of authorization", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41943, "text": "You can change or withdraw the scope of your personal information through the following ways:", "label": ["Important", "Edit/Control"], "rewrite": "You can change or withdraw the scope of authorization through the following ways:"}
{"task": "rw_13.jsonl", "id": 41944, "text": "System permissions settings", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41945, "text": "You can turn off the relevant permissions in the operating system settings of the device itself, change the scope of consent or withdraw your authorization.", "label": ["Edit/Control", "Important"], "rewrite": "You can turn off the relevant permissions in the operating system settings of the device itself, change the scope of consent or withdraw your authorization."}
{"task": "rw_13.jsonl", "id": 41946, "text": "After withdrawal authorization, we will no longer collect information related to this permissions.", "label": ["Edit/Control", "Important"], "rewrite": "After withdrawal authorization, we will no longer collect information related to this permissions."}
{"task": "rw_13.jsonl", "id": 41947, "text": "You can manage the system permissions (including cameras, albums/storage, microphone, etc.) in WPS, Office mobile clients in WPS, Office mobile clients.", "label": ["Important", "Edit/Control"], "rewrite": "You can manage the system permissions authorized in the WPS Office mobile client to manage the system permissions of our products in the [I -Settings -System permissions Management]."}
{"task": "rw_13.jsonl", "id": 41948, "text": "Recommended management management", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41949, "text": "You can choose your favorite push content.", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41950, "text": "For example: Whether the settings are allowed to recommend the corresponding content based on historical records on WPS, Office mobile client [me,-, settings,-, intelligent recommendation].", "label": ["Edit/Control", "Important"], "rewrite": "You can set whether to set the corresponding content based on historical records in WPS Office mobile client [I -Settings -Smart Recommendation]."}
{"task": "rw_13.jsonl", "id": 41951, "text": "Please understand that when you withdraw or authorize, we cannot continue to provide you with the service corresponding to the withdrawal consent or authorization, and no longer handle your corresponding personal information, but your decision to withdraw consent or authorization will not affect the previous previousPersonal information processing based on your consent or authorization.", "label": ["Important", "Risk"], "rewrite": "The decision you withdraws or authorized will not affect personal information processing carried out based on your consent or authorization."}
{"task": "rw_13.jsonl", "id": 41952, "text": "Your personal information rights", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41953, "text": "Query and correct your personal information", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41954, "text": "You can check and correct your personal information through the following channels:", "label": ["Important", "Edit/Control"], "rewrite": "You can query and correct your personal information through the following channels: web page (URL is https://account.wps.cn) [Personal Information Query and Export];Query and export];"}
{"task": "rw_13.jsonl", "id": 41955, "text": "Web page (URL is https://account.wps.cn) [Personal information query and export];", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41956, "text": "WPS Office mobile client [I -account and security -personal information query and export];", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41957, "text": "WPS Office Computer Client [Personal Center -Account Security -Personal Information Inquiry and Export].", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41958, "text": "Personal information copy acquisition", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41959, "text": "You can obtain your personal information copy through the following ways, but the laws and regulations have other provisions and other provisions of this policy:", "label": ["Edit/Control", "Important"], "rewrite": "You can obtain your personal information copy through the following ways, but the laws and regulations have other provisions and other provisions of this policy:"}
{"task": "rw_13.jsonl", "id": 41960, "text": "Get online.", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41961, "text": "Office client [Personal Center,-, Account Security,-, Personal Information Inquiry and Export];", "label": ["Important", "Edit/Control"], "rewrite": "On the web side (https://account.wps.cn) [Personal Information Inquiry and Export], WPS Office Mobile Client [I-Account and Security-Personal Information Inquiry and Export], WPS Office Computer Client [Personal Center-Account Security-Personal Information Inquiry and Export]"}
{"task": "rw_13.jsonl", "id": 41962, "text": "Contact us through the way provided by this policy. After verifying your identity, we will provide you with a copy of personal information stored in this service.", "label": ["Edit/Control", "Important"], "rewrite": "After verifying your identity is correct, we will provide you with a copy of personal information stored in this service."}
{"task": "rw_13.jsonl", "id": 41963, "text": "Manage your login device", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41964, "text": "To help you implement account security management, you can manage your login device through the following channels:", "label": ["Important", "Edit/Control"], "rewrite": "You can manage your login device through the following channels:"}
{"task": "rw_13.jsonl", "id": 41965, "text": "Web page (URL is https://account.wps.cn) [Current online device];", "label": ["Important", "Edit/Control"], "rewrite": "Web page (URL is https://account.wps.cn) [Current online device];"}
{"task": "rw_13.jsonl", "id": 41966, "text": "WPS, Office mobile client [I,-, account and security,-, login device management];", "label": ["Important", "Edit/Control"], "rewrite": "WPS Office mobile client [I -account and security -login device management];"}
{"task": "rw_13.jsonl", "id": 41967, "text": "WPS, Office Computer Client [Personal Center,-, Online Device] or [Personal Center,-, Account Security,-, login device management].", "label": ["Edit/Control", "Important"], "rewrite": "WPS Office Computer Client [Personal Center -Online Device] or [Personal Center -Account Security -Login Device Management]."}
{"task": "rw_13.jsonl", "id": 41968, "text": "Query and correct your other information", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41969, "text": "You can enter the web page (URL is https://kdocs.cn) or WPS, Office mobile client [document/cloud file] or WPS, Office computer client [Document] View, modify, delete and share your documents;", "label": ["Edit/Control", "Important"], "rewrite": "You can enter the web page (URL is https://kdocs.cn) or WPS Office mobile client [Document/Cloud File] or WPS Office Computer Client [Document] View, modify, delete and share your documents."}
{"task": "rw_13.jsonl", "id": 41970, "text": "You can enter the web page (URL is https://vip.wps.cn) or WPS, Office mobile client [I,-, wallet,-, order center] or WPS, office computer client [Personal center,-,Wallet,-, order/invoice] View your order or order management;", "label": ["Important", "Edit/Control"], "rewrite": "You can enter the web page (URL is https://vip.wps.cn) or WPS Office mobile client [I-wallet-order center] or WPS Office computer client [Personal Center-Wallet-Order/Invoice] View youOrder or order management."}
{"task": "rw_13.jsonl", "id": 41971, "text": "You can enter the web page (https://vip.wps.cn) or WPS, Office mobile client [I, -, member] or WPS, Office computer client [personal center, -, member] to view your Membership status, membership benefits and membership expiry date or purchase of membership.", "label": ["Important", "Edit/Control"], "rewrite": "You can enter the web page (URL is https://vip.wps.cn) or WPS Office mobile client [I-Member] or WPS Office computer client [Personal Center-Member] View your membership, membership rights and interests and interests and interestsMember expiration date or purchase membership."}
{"task": "rw_13.jsonl", "id": 41972, "text": "Log out your account", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41973, "text": "You can cancel your account through the following ways and according to the relevant prompts (if any):", "label": ["Important", "Edit/Control"], "rewrite": "You can cancel your account through the following ways and according to the relevant prompts (if any):"}
{"task": "rw_13.jsonl", "id": 41974, "text": "Web page (URL is https://account.wps.cn) [permanent delete account];", "label": ["Important", "Edit/Control"], "rewrite": "The web page (URL is https://account.wps.cn) [permanently delete account]."}
{"task": "rw_13.jsonl", "id": 41975, "text": "WPS, Office mobile client [I,-, account and security,-, permanent delete account];", "label": ["Important", "Edit/Control"], "rewrite": "WPS Office Client [I -Account and Security -Permanent Delete Account]."}
{"task": "rw_13.jsonl", "id": 41976, "text": "WPS, Office Computer Client [Personal Center,-, Account Security,-, Permanent Delete Account].", "label": ["Important", "Edit/Control"], "rewrite": "WPS Office Computer Client [Personal Center -Account Security -Permanent Delete of Account]."}
{"task": "rw_13.jsonl", "id": 41977, "text": "Before your account is canceled, we will verify your personal identity, security status, equipment information and other information, and confirm that your account number has no public and private documentation, and the team that has been deleted (if any) is deleted.The super administrator of the enterprise will help you complete the cancellation.", "label": ["Important", "Edit/Control"], "rewrite": "We will help you complete the cancellation after verifying your information and recognizing that your account has no public and private documentation, the team that has been deleted independently, and the super administrator who is no longer located."}
{"task": "rw_13.jsonl", "id": 41978, "text": "You know and understand that the behavior of canceling the account is an irreversible behavior. After your account is canceled, we will delete the relevant information about you or perform anonymous processing, but the laws and regulations have other regulations or are processed separately according to your requirements.Except for personal information.", "label": ["Important", "Edit/Control"], "rewrite": "The behavior of canceling the account is irreversible behavior. After cancellation, personal information will be deleted or anonymous."}
{"task": "rw_13.jsonl", "id": 41979, "text": "Complaint report and response", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41980, "text": "If you have any opinions or you think your personal information rights may be infringed, or you can find a clue to infringe your right to personal information, you can contact us through the contact information of this policy.", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41981, "text": "We will accept and deal with it within 15 working days.", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41982, "text": "Viewing privacy policy", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41983, "text": "You can on the web page (URL is https://privacy.wps.cn/policies/privacy/wps-perfice) or WPS Office mobile client [I-Settings-Privacy Settings and Legal Terms] View the policy of this policyall content.", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41984, "text": "Please understand that the relevant functions of this service in this policy may be different according to factors such as the equipment model, system version, software application version you use.", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41985, "text": "Know the product and/or service in advance to stop operation", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41986, "text": "We will continue to provide you with high -quality services. If our part or all products and/or services are forced to stop operations for special reasons, we will send push messages to you in advance The collection of your personal information will be stopped and within the minimum period that complies with laws and regulations, we will delete or processes your personal information.", "label": ["Important", "Cessation of Operations"], "rewrite": "When stopping operations, we will notify it in advance and delete or processes your personal information."}
{"task": "rw_13.jsonl", "id": 41987, "text": "other", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41988, "text": "For example, according to the relevant provisions of the legal and effective handling of personal information at that time, your close relatives have the right to exercise, copy, correct, and delete your relevant personal information after your death.We encourage you to arrange another arrangement of your personal information in your will or other inheritance plans.", "label": ["Important"], "rewrite": "After your death, your close relatives have the right to exercise, copy, correct, and delete your relevant personal information for your own legal and legitimate interests."}
{"task": "rw_13.jsonl", "id": 41989, "text": "Protection of personal information of minors", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41990, "text": "We attach great importance to the protection of personal information of minors.", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41991, "text": "According to the relevant laws and regulations, if you are a minor under the age of 18, please obtain the written consent of your parents or legal guardians before using this service.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a minor under the age of 18, please obtain the written consent of your parents or legal guardians before using this service."}
{"task": "rw_13.jsonl", "id": 41992, "text": "If you are a guardian of minors, when you have relevant questions about the personal information of the minor information collected and handled in accordance with this policy, please contact us with contact information provided by this policy.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are the guardian of minors, when you have any questions about the personal information of the minor information collected and handled in accordance with this policy, please contact us."}
{"task": "rw_13.jsonl", "id": 41993, "text": "Special reminder, if you are a child under the age of 14, we also set up the \"Jinshan Office Children Information Protection Statement\" for you. You need to read carefully with your guardian before completing the registration and binding of this service.\"Jinshan Office Children's Information Protection Statement\", you can use this service only after obtaining your guardian's consent of the \"Jinshan Office Children Information Protection Statement\".", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a child under the age of 14, you can use this service only after obtaining your guardian's consent of the \"Jinshan Office Children's Information Protection Statement\"."}
{"task": "rw_13.jsonl", "id": 41994, "text": "How to update this policy", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41995, "text": "In order to provide you with better services and with the development of our business, the provisions of this policy may be modified from time to time, but without your explicit consent, we will not reduce the rights you should enjoy in accordance with this policy.", "label": ["Policy Change", "Important"], "rewrite": "The provisions of this policy may be modified from time to time, but without your explicit consent, we will not reduce the rights you should enjoy in accordance with this policy."}
{"task": "rw_13.jsonl", "id": 41996, "text": "After this policy is updated, we will show you the change of the policy in the form of push notifications and pop -ups when you log in and version update, so that you can understand the latest version of this policy in time.", "label": ["Policy Change", "Important"], "rewrite": "After this policy is updated, we will show you the changes to this policy so that you can understand the latest version of this policy in time."}
{"task": "rw_13.jsonl", "id": 41997, "text": "This update", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41998, "text": "The content of this update mainly includes:", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 41999, "text": "Simplify the content of the capital, so that the policy is more suitable for reading and understanding;", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 42000, "text": "The \"Personal Information Collection List\", \"Third -Party Information Sharing List\" and \"Application Power List\" are updated to increase information such as sensors and shear plates.", "label": [], "rewrite": []}
{"task": "rw_13.jsonl", "id": 42001, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
