{"task": "rw_113.jsonl", "id": 73692, "text": "CLOVER Siya New Media", "label": [], "rewrite": []}
{"task": "rw_113.jsonl", "id": 73693, "text": "Project Projects", "label": [], "rewrite": []}
{"task": "rw_113.jsonl", "id": 73694, "text": "Recruitment Career", "label": [], "rewrite": []}
{"task": "rw_113.jsonl", "id": 73695, "text": "Contact Contory", "label": [], "rewrite": []}
{"task": "rw_113.jsonl", "id": 73696, "text": "Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_113.jsonl", "id": 73697, "text": "2010-1-1", "label": [], "rewrite": []}
{"task": "rw_113.jsonl", "id": 73698, "text": "Update date: January 25, 2021", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_113.jsonl", "id": 73699, "text": "Effective date: July 31, 2019", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_113.jsonl", "id": 73700, "text": "Welcome to use Daily Technology (Shanghai) Co., Ltd. (hereinafter referred to as \"Daily Technology\") products (including but not limited to websites, mobile clients) and services!", "label": [], "rewrite": []}
{"task": "rw_113.jsonl", "id": 73701, "text": "\"Daily Science and Technology\" attaches great importance to your privacy.", "label": [], "rewrite": []}
{"task": "rw_113.jsonl", "id": 73702, "text": "Therefore, we have formulated a privacy policy covering, using, disclosure, transfer, and storing your information.", "label": [], "rewrite": []}
{"task": "rw_113.jsonl", "id": 73703, "text": "The following is the types of personal information we may collect and some examples of how we use this information. The main points are as follows:", "label": [], "rewrite": []}
{"task": "rw_113.jsonl", "id": 73704, "text": "We will explain one by one to our personal information types and its corresponding uses so that you can understand the category, use reasons and collection methods of the specific personal information collected for a specific function.", "label": [], "rewrite": []}
{"task": "rw_113.jsonl", "id": 73705, "text": "When you use some functions, we will collect some of your sensitive information after obtaining your consent. For example, when you use the \"address book recommendation friends\" function, we will collect some of your mobile phone contact information, you are inWhen using the \"distance me\" function, we will use your location information locally.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use some functions, we will collect some of your sensitive information after getting your consent."}
{"task": "rw_113.jsonl", "id": 73706, "text": "Unless it is collected in accordance with the requirements of relevant laws and regulations, refusing to provide this information will only make you unable to use relevant features, but it does not affect your normal use of \"daily science and technology\" services.", "label": ["Important", "First Party Collection Information"], "rewrite": "Refusing to provide sensitive personal information, it is not only necessary to use relevant specific functions, and does not affect the use of other services. Except for other provisions of laws and regulations."}
{"task": "rw_113.jsonl", "id": 73707, "text": "\"Daily Science and Technology\" will not share or transfer your personal information to a third party outside \"Daily Science and Technology\". If you need us to share or transfer your personal information to a third party outside the \"Daily Technology\",We will directly or confirm that the third party obtains your consent of the above behavior. In addition, we will evaluate the risk of providing information on the outside world.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will not share or transfer your personal information until the third party. If you ask for sharing or transfer, we will confirm in advance that the third party has obtained your consent and conducts the risk assessment provided by the information."}
{"task": "rw_113.jsonl", "id": 73708, "text": "You can access, correct, and delete your personal information through this guide, or you can withdraw consent, cancel account number, complain report, and set privacy functions.", "label": ["Important", "Edit/Control"], "rewrite": "You can access, correct, and delete your personal information through this guide, or you can withdraw consent, cancel account number, complain report, and set privacy functions."}
{"task": "rw_113.jsonl", "id": 73709, "text": "If you want to know more detailed information, please read the corresponding chapter according to the following index:", "label": [], "rewrite": []}
{"task": "rw_113.jsonl", "id": 73710, "text": "What personal information do we collect", "label": [], "rewrite": []}
{"task": "rw_113.jsonl", "id": 73711, "text": "How do we use your personal information", "label": [], "rewrite": []}
{"task": "rw_113.jsonl", "id": 73712, "text": "Collection and use of non -personal information", "label": [], "rewrite": []}
{"task": "rw_113.jsonl", "id": 73713, "text": "Cookie and other technologies", "label": [], "rewrite": []}
{"task": "rw_113.jsonl", "id": 73714, "text": "Disclosure to third parties", "label": [], "rewrite": []}
{"task": "rw_113.jsonl", "id": 73715, "text": "How do we protect your personal information", "label": [], "rewrite": []}
{"task": "rw_113.jsonl", "id": 73716, "text": "Third -party website and service", "label": [], "rewrite": []}
{"task": "rw_113.jsonl", "id": 73717, "text": "Personal information about children", "label": [], "rewrite": []}
{"task": "rw_113.jsonl", "id": 73718, "text": "How can your personal information be transferred globally", "label": [], "rewrite": []}
{"task": "rw_113.jsonl", "id": 73719, "text": "change", "label": [], "rewrite": []}
{"task": "rw_113.jsonl", "id": 73720, "text": "How to contact us", "label": [], "rewrite": []}
{"task": "rw_113.jsonl", "id": 73721, "text": "What personal information do we collect", "label": [], "rewrite": []}
{"task": "rw_113.jsonl", "id": 73722, "text": "When you create us, icity, cloud service accounts, we will collect the basic information required by laws and regulations: your email address and mobile phone number.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When creating an ICITY cloud service account, we will collect your email address and mobile phone number."}
{"task": "rw_113.jsonl", "id": 73723, "text": "The mobile phone number is a sensitive information. The collection of such information is to meet the real -name system requirements of relevant laws and regulations.", "label": ["Important", "Usage"], "rewrite": "Collecting the mobile phone number is to meet the requirements of the online real -name system."}
{"task": "rw_113.jsonl", "id": 73724, "text": "If you do not provide such information, you may not be able to use our services normally.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you do not provide a mobile phone number, you may not be able to use the service normally."}
{"task": "rw_113.jsonl", "id": 73725, "text": "When you use it, icity, cloud services, we will collect basic information necessary for providing services: your device model, operating system, login, IP, address, device identifiers and other basic information to provide related services.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the ICITY cloud service, we will collect basic information such as device models, operating systems, login IP addresses, device identifiers."}
{"task": "rw_113.jsonl", "id": 73726, "text": "When you use the \"distance me\" and \"near\" features, we will use your geographical location information to query and calculate the distance after obtaining your independent choice. The purpose is to provide you withKeep any information on the server.", "label": ["Data Retention", "Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the \"distance me\" and \"near\" features, we will collect but not save the geographical location information that you authorize."}
{"task": "rw_113.jsonl", "id": 73727, "text": "This information is a sensitive information. Rejecting to provide this information will only make you unable to use the above features, but it does not affect other functions of your normal use of software.", "label": ["Important", "First Party Collection Information"], "rewrite": "Refusing to provide geographical information can cause the unavailable \"distance me\" and \"near\" functions, but does not affect other functions."}
{"task": "rw_113.jsonl", "id": 73728, "text": "In addition, you can turn off related functions at any time.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_113.jsonl", "id": 73729, "text": "When you use it and the icity \"geographical location\" function, we will record your geographical location information after obtaining your independent choice, the purpose is to provide you with the service.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the ICITY \"Geographical Location\" function, we will record the geographical location information that you authorize."}
{"task": "rw_113.jsonl", "id": 73730, "text": "This information is a sensitive information. Rejecting to provide this information will only make you unable to use the above features, but it does not affect other functions of your normal use of software.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_113.jsonl", "id": 73731, "text": "In addition, you can turn off related functions at any time.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_113.jsonl", "id": 73732, "text": "When you use the \"address book recommendation friend\" function, we will only collect the number in the address book, and will be irreversible and encrypted for your address book information for single use, and will not keep any information on the server side.", "label": ["Data Retention", "Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the \"address book recommendation friend\" function, we only collect but not save the number of the address book and encrypted a single use."}
{"task": "rw_113.jsonl", "id": 73733, "text": "The above information is a sensitive information. Rejection of the information will only make you unable to use the above features, but it does not affect other functions of your normal use of software.", "label": ["Important", "First Party Collection Information"], "rewrite": "Refusing to provide address book information, it will only be unable to use the \"address book recommendation friend\" function, but does not affect other functions."}
{"task": "rw_113.jsonl", "id": 73734, "text": "Except for the above functions, the following, apps, and no personal information, the relevant information of the application permissions will not be sent to the server side. This list may change according to the application version update:", "label": ["Data Retention", "Important", "First Party Collection Information"], "rewrite": "· Imart · My Tag · Course Table · Classtable · One Week Plan · Myweek · Countdown Air · Day Matter Air · iCare Reminder · My AR ruler and flashlight · MyTools send or send any personal information to the server any personal information to the server.Essence"}
{"task": "rw_113.jsonl", "id": 73735, "text": "· Imart · My Tag · Course Table · Classtable · One Week Plan · Myweek · Countdown AIR · Day Matter Air · ICare Reminder · My AR ruler and flashlight MyTools", "label": [], "rewrite": []}
{"task": "rw_113.jsonl", "id": 73736, "text": "How do we use your personal information", "label": [], "rewrite": []}
{"task": "rw_113.jsonl", "id": 73737, "text": "We will use personal information for the following goals: help you use our services, help us improve the services you use, help to prevent loss, help to prevent fraud and prevent illegal acts.", "label": ["Important", "Usage"], "rewrite": "We will use personal information to help you use services, improve services, help lose loss, prevent fraud and prevent illegal acts."}
{"task": "rw_113.jsonl", "id": 73738, "text": "If you participate in registration, competition, shopping, or similar real -name activities, we will use the information you provide to manage such activities.", "label": ["Important", "Usage"], "rewrite": "We will use information to manage your participation in registration, competition, shopping or similar real -name activities."}
{"task": "rw_113.jsonl", "id": 73739, "text": "Collection and use of non -personal information", "label": [], "rewrite": []}
{"task": "rw_113.jsonl", "id": 73740, "text": "Under the necessary circumstances, collect and use data that cannot be directly established with specific individuals.", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_113.jsonl", "id": 73741, "text": "We can collect, use, transfer, and disclose non -personal information for necessary reasons.", "label": ["Usage", "Third Party Sharing/ Disclosure", "First Party Collection Information", "Risk"], "rewrite": []}
{"task": "rw_113.jsonl", "id": 73742, "text": "The following is some examples of non -personal information we may collect and how we use this information.", "label": [], "rewrite": []}
{"task": "rw_113.jsonl", "id": 73743, "text": "We will collect information such as language, location, and users when using \"Daily Technology\" products, so that we can better understand customer behavior and improve our products, services and advertising.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We will collect information, location, time zone and other information to understand customer behavior."}
{"task": "rw_113.jsonl", "id": 73744, "text": "We may collect and store detailed information about how you use our services, including search and query.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect and store detailed information about how you use our services."}
{"task": "rw_113.jsonl", "id": 73745, "text": "Such information may be used to improve the results of our services provided and make it more correlated.", "label": ["Important", "Usage"], "rewrite": "Collect the information you use your service to increase service correlation."}
{"task": "rw_113.jsonl", "id": 73746, "text": "In addition to a few cases, we need to ensure the quality of services provided by the Internet, such information will not involve you, IP, address.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In addition to ensuring the quality of the services provided by the Internet, your IP address will not be collected."}
{"task": "rw_113.jsonl", "id": 73747, "text": "If we use non -personal information with personal information, such information will be regarded as personal information during the combination of use.", "label": [], "rewrite": []}
{"task": "rw_113.jsonl", "id": 73748, "text": "Cookie and other technologies", "label": [], "rewrite": []}
{"task": "rw_113.jsonl", "id": 73749, "text": "\"Daily Science and Technology\" websites, online services, interactive application software, emails and advertisements may use \"cookie\" and other technologies, such as pixel labels and website letter marks.", "label": ["Important", "First Party Collection Information"], "rewrite": "\"Daily Science and Technology\" products and advertisements may use \"Cookie\" and other technologies."}
{"task": "rw_113.jsonl", "id": 73750, "text": "These technologies help us better understand the behavior of users, tell us what parts of our websites have been browsed, measuring the effects of advertising and online search and improvement.", "label": ["Important", "Usage"], "rewrite": "\"Cookie\" and other technologies are used to understand user behavior."}
{"task": "rw_113.jsonl", "id": 73751, "text": "We will pass the information collected by, cookies, and other technologies as non -personal information.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "We will be regarded as non -personal information collected through cookies and other technologies."}
{"task": "rw_113.jsonl", "id": 73752, "text": "However, if local laws are general, internet, protocol, (IP), address, or similar identification marks are deemed as personal information, we also regard these identification marks as personal information.", "label": ["Important"], "rewrite": "If local laws regard the Internet protocol (IP) address or similar identification mark as personal information, we also regard these identification marks as personal information."}
{"task": "rw_113.jsonl", "id": 73753, "text": "Similarly, as far as the privacy policy is concerned, in the case of combining non -personal information and personal information, we regard the information used by combined as personal information.", "label": [], "rewrite": []}
{"task": "rw_113.jsonl", "id": 73754, "text": "Like most Internet services, we will automatically collect certain information and store them in the log file.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We will automatically collect certain information and store it in the log file."}
{"task": "rw_113.jsonl", "id": 73755, "text": "This type of information includes, Internet, protocols, (IP), address, browser type and language, Internet service provider, (ISP), referral/exit website and application software, operating system, date/time stamp, and click stream data.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will automatically collect the Internet protocol (IP) address, browser type and language, Internet service provider (ISP), referral/exit website and application software, operating system, date/time stamp, and click flow data."}
{"task": "rw_113.jsonl", "id": 73756, "text": "We use these information to understand and analyze the trend, manage websites, understand user behavior on the website, improve our products and services, and collect the overall audience characteristics of the user base.", "label": ["Important", "Usage"], "rewrite": "We use information to understand and analyze trends, manage websites, understand user behavior, improve products and services, and collect audience feature information."}
{"task": "rw_113.jsonl", "id": 73757, "text": "\"Daily Science and Technology\" can use such information for our marketing and advertising services.", "label": ["Important", "Usage"], "rewrite": "Daily Science and Technology can use such information for our marketing and advertising services."}
{"task": "rw_113.jsonl", "id": 73758, "text": "In addition to Cookie, we will also use other similar technologies such as website beacons and pixel labels on the website.", "label": [], "rewrite": []}
{"task": "rw_113.jsonl", "id": 73759, "text": "For example, the email we send to you may contain a link to the URL of our website content.", "label": [], "rewrite": []}
{"task": "rw_113.jsonl", "id": 73760, "text": "If you click the link, we will track this click to help us understand your product or service preferences and improve customer service.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If you click the link we send, we will track this click to help us understand your preferences and improve customer service."}
{"task": "rw_113.jsonl", "id": 73761, "text": "Website beacon is usually a transparent image embedded in a website or email.", "label": [], "rewrite": []}
{"task": "rw_113.jsonl", "id": 73762, "text": "With the pixel labels in emails, we can know whether the email has been opened.", "label": [], "rewrite": []}
{"task": "rw_113.jsonl", "id": 73763, "text": "If you don't want your activities to be tracked in this way, you can withdraw from our signal list at any time.", "label": ["Edit/Control", "Important"], "rewrite": "If you don't want your activities to be tracked, you can withdraw from the letter list."}
{"task": "rw_113.jsonl", "id": 73764, "text": "Disclosure to third parties", "label": [], "rewrite": []}
{"task": "rw_113.jsonl", "id": 73765, "text": "\"Daily Science and Technology\" will not share and disclose your personal privacy information with third parties.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "\"Daily Science and Technology\" will not share and disclose your personal privacy information with third parties."}
{"task": "rw_113.jsonl", "id": 73766, "text": "According to the requirements of legal, legal procedures, litigation and/or government departments in your country and abroad, \"Daily Science and Technology\" may need to disclose your personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "According to the requirements of legal, legal procedures, litigation and/or government departments in your country and abroad, \"Daily Science and Technology\" may need to disclose your personal information."}
{"task": "rw_113.jsonl", "id": 73767, "text": "If we determine other matters that are concerned about national security, law enforcement or public importance, disclosure is necessary or appropriate, and we may also disclose information about you.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "As far as other matters of national security, law enforcement or public importance, disclosure is necessary or appropriate, and may disclose information about you."}
{"task": "rw_113.jsonl", "id": 73768, "text": "If we determine that in order to perform our terms and conditions or protect our operations or users, disclosure is reasonable, we may also disclose the collected information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "In order to implement our terms and conditions or protect our operations or users, disclosure is reasonable and may disclose the collected information."}
{"task": "rw_113.jsonl", "id": 73769, "text": "If there is a transaction such as mergers, acquisitions, and asset transfer, we will inform you that the relevant situation will continue to protect your personal information in accordance with the laws and regulations and the standards that are not lower than the standards required by this guideline.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If there is a transaction such as mergers, acquisitions, and asset transfer, we will inform you that the relevant situation will continue to protect your personal information in accordance with the laws and regulations and the standards that are not lower than the standards required by this guideline."}
{"task": "rw_113.jsonl", "id": 73770, "text": "How do we protect your personal information", "label": [], "rewrite": []}
{"task": "rw_113.jsonl", "id": 73771, "text": "\"Daily Science and Technology\" attaches great importance to your personal information.", "label": [], "rewrite": []}
{"task": "rw_113.jsonl", "id": 73772, "text": "\"Daily Science and Technology\" online service (such as, icity, account system and cloud service), will use the transport layer security protocol, (TLS), and other encryption technology to protect your personal information during the transmission process.", "label": ["Important", "Data Security"], "rewrite": "Use SSL and other technologies to protect your information during transmission."}
{"task": "rw_113.jsonl", "id": 73773, "text": "When \"Daily Science and Technology\" stores your personal data, we will use a computer system with limited access rights, which are deployed in facilities that are protected by physical security measures.", "label": ["Important", "Data Security"], "rewrite": "When \"Daily Science and Technology\" stores your personal data, we will use a computer system with limited access rights, which are deployed in facilities that are protected by physical security measures."}
{"task": "rw_113.jsonl", "id": 73774, "text": "We will use encryption technology to ensure the confidentiality of the data;", "label": ["Important", "Data Security"], "rewrite": "We will use encryption technology to ensure the confidentiality of data."}
{"task": "rw_113.jsonl", "id": 73775, "text": "We will use a trusted protection mechanism to prevent data from being maliciously attacked;", "label": ["Important", "Data Security"], "rewrite": "We will use a trusted protection mechanism to prevent data from being maliciously attacked."}
{"task": "rw_113.jsonl", "id": 73776, "text": "We will deploy the access control mechanism to ensure that only authorized personnel can access personal information;", "label": ["Important", "Data Security"], "rewrite": "We will deploy the access control mechanism to ensure that only authorized personnel can access personal information."}
{"task": "rw_113.jsonl", "id": 73777, "text": "And we will organize safety and privacy protection training courses to strengthen employees' awareness of protecting the importance of personal information.", "label": ["Important", "Data Security"], "rewrite": "We will organize safety and privacy protection training courses to strengthen employees' awareness of protecting the importance of personal information."}
{"task": "rw_113.jsonl", "id": 73778, "text": "We will take all reasonable and feasible measures to ensure unrelated personal information.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_113.jsonl", "id": 73779, "text": "Unless you obtain your written license, we will retain your personal information for 36 months after you delete or cancel your account. After this period, we will anonymous processing or destroy your personal information.", "label": ["Data Retention", "Important"], "rewrite": "We will retain your personal information 36 months after you delete or log out your account, unless you get your written permission."}
{"task": "rw_113.jsonl", "id": 73780, "text": "When you use some \"daily science and technology\" products, services or application software or post on social network services, the personal information and content you share will be seen by other users. They may read, collect or use your personalinformation.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "When you post some products, your personal information and content you share will be read, collected or used by other users."}
{"task": "rw_113.jsonl", "id": 73781, "text": "You should be responsible for your own personal information that you decide to share or submit in the above situation.", "label": ["Important"], "rewrite": "You decide to share or submit personal information in the above situation, and you should be responsible for yourself."}
{"task": "rw_113.jsonl", "id": 73782, "text": "For example, if you post your name and email address in the forum, this information is public.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The names and email addresses published in the forum are public."}
{"task": "rw_113.jsonl", "id": 73783, "text": "We strongly recommend that you do not send personal information in this way.", "label": ["Important"], "rewrite": "It is strongly recommended that you do not share personal information publicly."}
{"task": "rw_113.jsonl", "id": 73784, "text": "Third -party website and service", "label": [], "rewrite": []}
{"task": "rw_113.jsonl", "id": 73785, "text": "\"Daily Science and Technology\" websites, products, application software and services may contain links to third -party websites, products and services.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_113.jsonl", "id": 73786, "text": "Our products and services may also use or provide products or services from third parties, for example, statistical services for third parties.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Our products and services may also use or provide products or services from third parties."}
{"task": "rw_113.jsonl", "id": 73787, "text": "The information collected by a third party, which may contain location data or contact information, must abide by the third -party regulations on privacy.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Third -party collection information must comply with the provisions of third parties on privacy."}
{"task": "rw_113.jsonl", "id": 73788, "text": "We hope you can understand the privacy regulations of these third parties.", "label": [], "rewrite": []}
{"task": "rw_113.jsonl", "id": 73789, "text": "Our application uses the statistical information provided by Google Information Technology (China) Co., Ltd., Firebase, statistical service collection, and the collapse logs provided by Microsoft (China) Co., Ltd., Software version, all information is anonymous without involving any user's unique identifier.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Our application uses the statistical information collected by the Firebase statistics service provided by Google Information Technology (China) Co., Ltd., and the collapse log collected by the App Center service collected by Microsoft (China) Co., Ltd., the collected information includes the equipment model and software version. AllThe information is anonymous and does not involve the unique identifier of any user."}
{"task": "rw_113.jsonl", "id": 73790, "text": "In addition, it does not involve the use of any third -party services.", "label": [], "rewrite": []}
{"task": "rw_113.jsonl", "id": 73791, "text": "Personal information about children", "label": [], "rewrite": []}
{"task": "rw_113.jsonl", "id": 73792, "text": "Our products, websites and services are mainly adults.", "label": ["Specific Audiences", "Important"], "rewrite": "Our products, websites and services are mainly adults."}
{"task": "rw_113.jsonl", "id": 73793, "text": "Without the consent of parents or guardians, minors may not create their own user accounts.", "label": ["Specific Audiences", "Important"], "rewrite": "Without the consent of parents or guardians, minors shall not create their own user account."}
{"task": "rw_113.jsonl", "id": 73794, "text": "For the collection of minors' personal information with the consent of their parents, we will only use or publicly disclose this information when required by judicial or administrative agencies, with the explicit consent of parents or guardians, or when it is necessary to protect minors.", "label": ["Specific Audiences", "Important"], "rewrite": "For the collection of minors' personal information with the consent of their parents, we will only use or publicly disclose this information when required by judicial or administrative agencies, with the explicit consent of parents or guardians, or when it is necessary to protect minors."}
{"task": "rw_113.jsonl", "id": 73795, "text": "Although local laws and customs have different definitions of minors, we will be dissatisfied, and anyone of 16 or years of age is deemed to be minors.", "label": ["Specific Audiences", "Important"], "rewrite": "We regard anyone under 16 years of age as minors."}
{"task": "rw_113.jsonl", "id": 73796, "text": "If we find that we collect personal information of minors without the consent of parents who can be confirmed in advance, they will try to delete relevant data as soon as possible.", "label": ["Specific Audiences", "Important"], "rewrite": "If the personal information of minors was collected without the consent of the parents, he would try to delete relevant information as soon as possible."}
{"task": "rw_113.jsonl", "id": 73797, "text": "How can your personal information be transferred globally", "label": [], "rewrite": []}
{"task": "rw_113.jsonl", "id": 73798, "text": "The personal information we collected and generated in the People's Republic of China will be stored in the territory of the People's Republic of China without any personal information out of the country.", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in domestic operations will be stored in China."}
{"task": "rw_113.jsonl", "id": 73799, "text": "change", "label": [], "rewrite": []}
{"task": "rw_113.jsonl", "id": 73800, "text": "We may revise this guidelines in a timely manner.", "label": [], "rewrite": []}
{"task": "rw_113.jsonl", "id": 73801, "text": "When the guidelines are changed, we will show you the changes in the form of push notifications and pop -ups when you log in and update.", "label": ["Policy Change", "Important"], "rewrite": "After the privacy policy is updated, you will show you the change of privacy policy after login and version update."}
{"task": "rw_113.jsonl", "id": 73802, "text": "Please note that only after you click the consent button in the pop -up window, we will collect, use, and store your personal information according to the updated guidelines.", "label": ["Policy Change", "Important"], "rewrite": "Only after you click the consent button in the pop -up window, will we collect, use, and store your personal information according to the updated guidelines."}
{"task": "rw_113.jsonl", "id": 73803, "text": "How to contact us", "label": [], "rewrite": []}
{"task": "rw_113.jsonl", "id": 73804, "text": "When you have other complaints, suggestions, and personal information related to minors, please contact us by email, lucky@clover.ly, and contact us.", "label": ["Important", "Contact Information"], "rewrite": "Email: lucky@clover.ly"}
{"task": "rw_113.jsonl", "id": 73805, "text": "We will review the issues involved as soon as possible and reply within 30 days after verifying your user identity.", "label": ["Important", "Contact Information"], "rewrite": "We will review the issues involved as soon as possible and reply within 30 days after verifying your user identity."}
{"task": "rw_113.jsonl", "id": 73806, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
