{"task": "rw_126.jsonl", "id": 76829, "text": "Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76830, "text": "This platform and its related companies (hereinafter referred to as \"this platform\", \"related companies\" refer to companies and institutions under the control of this platform, controlled by this platform or under the joint control of this platform.", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76831, "text": "Control refers to the promise to protect the use of the platform's products and services (hereinafter collectively referred to as the ability to be managed/operated directly or indirectly with the ability to directly or indirectly have the ability to be managed/operated by the method of actual operations, or other methods of being identified in accordance with the law.Personal information and privacy security of users (hereinafter collectively referred to as \"user\" or \"you\") of users (hereinafter collectively referred to as \"user\" or \"you\").", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76832, "text": "When you use this platform service, we may collect and use your personal information.", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76833, "text": "We hope to explain to you through the \"Privacy Policy\" (hereinafter referred to as \"this policy\") to explain related matters such as collecting and using your relevant personal information to better protect your rights and interests.", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76834, "text": "This policy is suitable for all products and services provided by this platform.", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76835, "text": "When you use any single service, you agree to accept this policy and the protection of specific privacy information policies (hereinafter referred to as \"specific terms\") that we have issued in this single service.Terms also have the effect on you at the same time.", "label": ["Policy Change", "Important"], "rewrite": "When you use any single service, you agree to accept this policy."}
{"task": "rw_126.jsonl", "id": 76836, "text": "Users under the age of fourteen, at the same time, apply this policy and \"Personal Information Protection Policy\" (see attachment).", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76837, "text": "If the specific terms of specific terms and the terms of the policy have inconsistent agreement, the specific terms shall be subject to specific terms within the scope of the constraints.", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76838, "text": "If a single service we provide is not applicable to this policy, the service will explicitly explicitly eliminate the applicable policy in an appropriate manner.", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76839, "text": "Please read and thoroughly understand this policy, especially the clauses that are identified by the threading line. You should focus on reading and start using it after confirmation and consent.", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76840, "text": "If you do not agree with the content of this policy, it may cause the service of this platform to fail to operate normally, or the service effect we intend to achieve cannot be achieved, and you should immediately stop accessing/using the service of this platform.", "label": ["Policy Change", "Important"], "rewrite": "If you do not agree with the content of this policy, you should stop visiting/use this platform service immediately."}
{"task": "rw_126.jsonl", "id": 76841, "text": "If you use or continue to use this platform service, you agree that you agree that we collect, use, store, share, transfer, and disclose your personal information in accordance with this policy (including updated versions).", "label": ["Policy Change", "Important"], "rewrite": "By using or continuing to use the services of this platform, you agree that we will process personal information in accordance with this policy (including updated versions)."}
{"task": "rw_126.jsonl", "id": 76842, "text": "If you have any questions about this policy or related matters related to this policy, you can contact us through the feedback channel listed in the chapter of \"How to contact us\" in this policy, and we will answer you as soon as possible.", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76843, "text": "Table of contents", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76844, "text": "1. How do we collect and use information", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76845, "text": "2. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76846, "text": "3. Storage of information", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76847, "text": "Fourth, information security protection", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76848, "text": "Fifth, share, transfer, and publicly disclose personal information", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76849, "text": "6. How do you access and manage your personal information", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76850, "text": "Seven, change", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76851, "text": "8. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76852, "text": "Nine, contact us", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76853, "text": "1. How do we collect and use information", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76854, "text": "In the process of using our service, we will collect and use the information provided by your service when using the service as follows, to provide you, optimize our services and ensure your account securityIn this information, including personal sensitive information, personal sensitive information refers to personal information such as leakage, illegal provision or abuse that may endanger people's body and property, and it is easy to lead to personal information such as personal reputation, physical and mental health damage or discriminatory treatment.", "label": ["Important", "First Party Collection Information"], "rewrite": "Personal information will be collected in the following way, including personal sensitive information."}
{"task": "rw_126.jsonl", "id": 76855, "text": "Personal sensitive information involved in this privacy policy includes your personal biometric information (including facial features, voice), personal identification information (including ID information), log information, address book information, personal property information, personal common equipment information, personal common equipment information, Other information (including personal phone number, mobile phone number, whereabouts of the trajectory information, general geographical location, precise positioning information, web browsing records).", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76856, "text": "You agree to your personal sensitive information according to the purpose and method described in the \"Privacy Policy\":", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76857, "text": "1. When you register or use our game service, we will collect your, network identity information information and personal common equipment information, to mark users who are game for us.", "label": ["Important", "First Party Collection Information"], "rewrite": "It will collect network identity information and personal common equipment information to mark users who are playing for us."}
{"task": "rw_126.jsonl", "id": 76858, "text": "If you get the verification code to register or log in through the mobile phone, we will collect your, mobile phone number and SMS information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Those who register or log in through the mobile phone obtaining the verification code will collect the mobile phone number and SMS information."}
{"task": "rw_126.jsonl", "id": 76859, "text": "2. In order to meet the requirements of relevant laws, regulations and policies and the requirements of relevant competent authorities, we need to take real -name authentication measures for game users.", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76860, "text": "We will collect your, real -name identity information when obtaining your consent or proactive provided by you, this information is sensitive information, refuse to provide, real -name identity information may cause you to be unable to log in to our game or use our game to use our gameDuring the process, it is subject to corresponding restrictions.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting real -name identity information, refusing to provide real -name identity information may cause failure to log in or be restricted in use in use."}
{"task": "rw_126.jsonl", "id": 76861, "text": "3. In order to ensure your normal use of our service, maintain the normal operation of the basic functions of the game, optimize the performance of the game product, improve your gaming experience and ensure your account security, we will collect your, ID, device name, equipment, equipment, equipment, and equipmentTypes and versions, system versions, IP addresses ,, device recognition symbols (such as, IMEI, IMSI, MAC address), application, ID, network type information,.", "label": ["Important", "First Party Collection Information"], "rewrite": "Will collect your device ID, device name, device type and version, system version, IP address, device recognition symbols (such as IMEI, IMSI, MAC address), application ID, network type information."}
{"task": "rw_126.jsonl", "id": 76862, "text": "4. When you use our game service, we will collect your, game log information, such as logging in logs, items, chat records, etc., so that you can view your game history records on the client, and at the same time for game operationsStatistical analysis, customer service complaint processing, and other game security analysis, and in order to improve your game experience, we may synchronize the aforementioned information to the follow -up version of the game or the other products you are provided by us.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect game log information for viewing game history."}
{"task": "rw_126.jsonl", "id": 76863, "text": "5. When you use the consumption function of our game products, we will collect your, recharge records, consumption records, and information, so that you can check your transaction records while protecting your virtual items to the greatest extent.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect recharge records and consumer record information in order to query your transaction records."}
{"task": "rw_126.jsonl", "id": 76864, "text": "The recharge records and consumption records are sensitive information. Collecting the above information is necessary to achieve the consumption function of our game products, otherwise the transaction will not be completed.", "label": ["Important", "First Party Collection Information"], "rewrite": "Recharge records and consumption records are sensitive information. The collection of the above information is necessary to realize the consumption function of game products, otherwise the transaction will not be completed."}
{"task": "rw_126.jsonl", "id": 76865, "text": "6. In order to ensure your game account security, create a fair, healthy and safe game environment, we will collect information such as your game recognition information, hardware and operating system information, processes, and game crash recordsEnvironmental or interference and normal behavior of game services (such as to detect piracy, scanned plug -ins, prevent cheating, etc.).", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect information such as game recognition information, hardware and operating system information, processes and game crash records to maintain game fairness."}
{"task": "rw_126.jsonl", "id": 76866, "text": "7. If the game services we provide include passing, text, pictures, voice, videos, and other methods to interact with other players, and if you want to use these services, we may collect and preserve the above information content you sent.Used to filter the improper content of pornography, violence, politics, abuse, malicious advertisements, etc., to purify the game environment and maintain a healthy Internet environment.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect and save the interactive information you sent to purify the game environment."}
{"task": "rw_126.jsonl", "id": 76867, "text": "8. If the game services we provide include interacting with other game players through voice and videos, and participate in live broadcasts, and you want to use these services, after you authorize your consent, the game will access you, microphone, camera, (camera), (camera),, To provide you with functions such as voice chat, live interactive interaction.", "label": ["Permission Acquisition", "Important"], "rewrite": "Apply for access to microphones, cameras (cameras), and provide functions such as voice chat and live broadcast interaction."}
{"task": "rw_126.jsonl", "id": 76868, "text": "9. If we provide you who can interact with nearby gamers and you want to use these services, after you authorize the consent, we will collect your, geographical location information, and find it to find nearby gamers in order to find youMatching with nearby players, teaming, etc.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "Collect geographical information to find nearby gamers."}
{"task": "rw_126.jsonl", "id": 76869, "text": "Geographical location information is a sensitive information. Refusing to provide this information will only cause you to be unable to interact with nearby gamers, but it does not affect other functions of your game normally. You can also cancel your geographical location information at any time.", "label": ["Edit/Control", "First Party Collection Information", "Important"], "rewrite": "You can cancel your geographical information authorization at any time."}
{"task": "rw_126.jsonl", "id": 76870, "text": "10. If we provide you who can interact with your friends to interact with you and you want to use these services, after you authorize the unification, we will collect information about your address book or call records so that you can realize that you interact with your friends interact with your friends.The purpose, the address book and call records are sensitive information, refusing to provide this information will only cause you to be unable to realize interaction with the communication record friends, but it does not affect other functions of our game normally, you can also cancel your relevant related related related related to your related related functions.Authorized.", "label": ["Important", "First Party Collection Information", "Edit/Control"], "rewrite": "Collect the information of the address book or call records in order to achieve the purpose of interacting with friends."}
{"task": "rw_126.jsonl", "id": 76871, "text": "11. You can use or order third -party products or services.", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76872, "text": "In order to give you more convenient life services, this platform may access you rich third -party services.", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76873, "text": "You can use related functions through related product modules.", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76874, "text": "Nicknames, review content, bank accounts, etc., and personal clear authorization can share information).", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect personal information (some cases include your identity information, contact information, accommodation information, itinerary information, trading information, payment information, account information, account information, nickname, comment content, bank account, etc., and personal clear authorization can share information)."}
{"task": "rw_126.jsonl", "id": 76875, "text": "You have authorized us to provide the third party that provides you with services, and authorize us to indirectly obtain relevant information from third parties.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "We authorize us to provide this information to a third party that provides you and authorize us to indirectly obtain relevant information from third parties."}
{"task": "rw_126.jsonl", "id": 76876, "text": "If you refuse us to collect such information, we will not be able to provide you with relevant functions and services, but it will not affect your use of basic functions of products or services.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If such information is refused, it will not be provided with relevant functions and services, but it will not affect the use of basic functions of products or services."}
{"task": "rw_126.jsonl", "id": 76877, "text": "11.2, when you log in to our products or services when you use Taobao account, WeChat, Weibo ,, QQ account, we need to verify your identity or bind your account information. After your authorization, the relevant account is associated to ourProducts or services.", "label": ["Permission Acquisition", "Important"], "rewrite": "After authorization, related accounts are associated into our products or services."}
{"task": "rw_126.jsonl", "id": 76878, "text": "11.3 In order to ensure specific functions, some games may access the software tool development package developed by third -party development (SDK).", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76879, "text": "We will conduct security monitoring on the mobile phone SDK that involves personal information accessed by the game to protect the security of your personal information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "SDKs involving personal information mobile phones involving personal information will be monitored to protect personal information security."}
{"task": "rw_126.jsonl", "id": 76880, "text": "Please check the third parties and SDKs that are connected to this game product listed in the following catalog as needed.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Check out the third -party SDK of this game product in the following directory."}
{"task": "rw_126.jsonl", "id": 76881, "text": "You can also view the third-party SDK's rules for collecting and using personal information through the official SDK website link.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "You can also collect the rules of using personal information through the SDK official website link."}
{"task": "rw_126.jsonl", "id": 76882, "text": "The third -party SDK may change its personal information collection and processing rules due to the version or function upgrade. Please refer to the official instructions of its publicity:", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76883, "text": "11.3.1 Friend League SDK", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76884, "text": "Objective: Message Sharing 2", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76885, "text": "Involved in personal information types: device information (IMEI/MAC/Android/IDFA/Openudid/Guid/SIM card IMSI/geographical location, etc.)", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76886, "text": "Official link: https://www.umeng.com/page/policy", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76887, "text": "If you refuse to provide the above information or refuse to authorize, you may not be able to use the corresponding products or services of our affiliated companies or third parties, or you may not be able to display relevant information, but this will not affect the basic functions of using this product or service.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "If you refuse to provide the above information or reject authorization, you may not be able to use the corresponding products or services, or to display the relevant information, but do not affect the use of basic functions."}
{"task": "rw_126.jsonl", "id": 76888, "text": "12., according to relevant laws and regulations and national standards, in the following situations, we may collect or use your relevant personal information without soliciting your authorization consent:", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "In the following circumstances, you will collect or use your relevant personal information without asking your authorization consent:"}
{"task": "rw_126.jsonl", "id": 76889, "text": "1) Directly related to national interests such as national security and national defense security;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect personal information directly related to national interests such as national security and national defense security, and you don't need to agree;"}
{"task": "rw_126.jsonl", "id": 76890, "text": "Directly related to the major public interests such as public safety, public health, and public knowledge;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect personal information directly related to public safety, public health, and public interest in public safety, public interest, and public interest, and no need to agree;"}
{"task": "rw_126.jsonl", "id": 76891, "text": "2) Directly related to criminal investigation, prosecution, trial and judgment execution;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect direct personal information related to directly related information such as investigation, prosecution, trial, and judgment execution of criminal investigation, no consent;"}
{"task": "rw_126.jsonl", "id": 76892, "text": "3) For major legitimate rights and interests such as maintaining your life, property, and reputation of your or other individuals, but it is difficult to get my consent;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting and maintaining major legitimate rights and interests, but it is difficult to get personal information that I agree, no need to agree;"}
{"task": "rw_126.jsonl", "id": 76893, "text": "4), the personal information you collected is publicly disclosed to the public by yourself;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "The collected personal information is publicly disclosed to the public on its own, so no need to agree;"}
{"task": "rw_126.jsonl", "id": 76894, "text": "5) Collect personal information from legal public information, such as legal news reports and government information disclosure;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If you collect personal information from the legal disclosure information, you don't need to agree;"}
{"task": "rw_126.jsonl", "id": 76895, "text": "6), signing and fulfilling the contract according to your requirements;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect the personal information necessary for signing and fulfilling the contract according to your requirements, no need to agree;"}
{"task": "rw_126.jsonl", "id": 76896, "text": "7), the safe and stable operation of the products or services provided by maintenance, such as discovering and disposing of products or services;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect the personal information necessary for maintaining products or services to safe and stable operations, no need to agree;"}
{"task": "rw_126.jsonl", "id": 76897, "text": "8) For the necessary news reports;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting the required personal information for legal news reports, no need to agree;"}
{"task": "rw_126.jsonl", "id": 76898, "text": "9), when the public interest is necessary to carry out statistics or academic research, and when it provides academic research or description results, it is identified by the personal information contained in the results;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting the personal information necessary for statistics or academic research in the public interest, no need to agree;"}
{"task": "rw_126.jsonl", "id": 76899, "text": "10), other circumstances stipulated in laws and regulations.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect personal information under other circumstances stipulated in laws and regulations, no need to agree."}
{"task": "rw_126.jsonl", "id": 76900, "text": "12. Please understand that the functions and services we provide to you are constantly updated and developed. If a function or service is not in the aforementioned instructions and collected your information, we will use page prompts, interactive processes, website announcementsTo explain the content, scope and purpose of information collection to you to obtain your consent.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76901, "text": "At present, in addition to collecting game research information from a third -party research agency to help us improve game products, we will not take the initiative to obtain your personal information from the third party outside our group.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will not take the initiative to obtain your personal information from a third party outside our group."}
{"task": "rw_126.jsonl", "id": 76902, "text": "If the business development needs to obtain your personal information from a third party outside our group, we will show you the source, type, and scope of use of your personal information before acquisition.The activity exceeded the scope of authorization consent when you originally provided personal information to our group outside the group. We will obtain your explicit consent before dealing with your personal information;", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Obtaining personal information from a third party will explicitly explicit the source, type, and scope of use of personal information before obtaining. If the personal information processing activity exceeds the scope of the original authorization consent, we will obtain your explicit consent."}
{"task": "rw_126.jsonl", "id": 76903, "text": "In addition, we will also strictly abide by the provisions of relevant laws and regulations and ask the third party to protect the legitimacy of the information provided by it.", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76904, "text": "2. How do we use cookie and similar technologies", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76905, "text": "(1) Cookie", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76906, "text": "In order to ensure the normal operation of this product, provide you with an easier access experience, and recommend content that you may be interested in, we may store a small data file named \"Cookie\" on your computer or mobile device.", "label": ["Important", "First Party Collection Information"], "rewrite": "Small data files named Cookie on your computer or mobile device."}
{"task": "rw_126.jsonl", "id": 76907, "text": "Cookie usually contains identifiers, site names, and some numbers and characters.", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76908, "text": "With the help of cookies, websites and clients can store data such as registered accounts, mailboxes, passwords, preferences, bank accounts, network payment and/or trading accounts.", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76909, "text": "You can manage or delete according to your preferences, cookies.", "label": ["Important", "Edit/Control"], "rewrite": "You can manage or delete Cookie according to your preferences."}
{"task": "rw_126.jsonl", "id": 76910, "text": "You can clear all the functions saved on the computer, cookies, and most of the network browsers have the functions of stopping, cookies.", "label": ["Important", "Edit/Control"], "rewrite": "You can remove all the cookies saved on the computer."}
{"task": "rw_126.jsonl", "id": 76911, "text": "But if you do this, you need to change the user settings when you visit our website.", "label": ["Important", "Edit/Control"], "rewrite": "To clear Cookie, you need to change the user settings when you visit our website."}
{"task": "rw_126.jsonl", "id": 76912, "text": "To learn more about how to change the browser settings in detail, visit the related setting page of the browser you use.", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76913, "text": "(2) Website beacon and pixel label", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76914, "text": "In addition to Cookie, we may also use other similar technologies such as websites and pixel labels on the website or client.", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76915, "text": "For example, the email we send to you may contain a link to the address link to our website content. If you click the link, we will track this click to help us understand your product or service preferences to actively improve our customer service to improve customer serviceExperience.", "label": ["Important", "Risk", "Usage"], "rewrite": "Crackers of the address link to understand your product or service preference."}
{"task": "rw_126.jsonl", "id": 76916, "text": "Website beacon is usually a transparent image embedded in a website or email.", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76917, "text": "With the pixel labels in emails, we can know whether the email has been opened.", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76918, "text": "If you do not want your activities to be tracked in this way, you can contact us from our letter of sending or in accordance with the contact information contained in this \"Privacy Policy\" at any time.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76919, "text": "(3) Do Not Track (Do not track)", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76920, "text": "Many network browsers have the Do not track function, which can release the DO Not Track request to the website.", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76921, "text": "At present, the major Internet standard organization has not yet established relevant policies to stipulate how websites should respond to such requests.", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76922, "text": "But if your browser enables Do Not Track, all our websites will respect your choices.", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76923, "text": "But please note that it may affect your experience of providing products and services with this platform.", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76924, "text": "Third, the storage of information", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76925, "text": "1. The method and period of information storage", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76926, "text": "We will store your information in a safe way, including local storage (such as using, APP for data cache), database and server logs.", "label": ["Data Retention", "Important"], "rewrite": "It will store information in a secure way, including local storage (such as using APP for data cache), database and server logs."}
{"task": "rw_126.jsonl", "id": 76927, "text": "Generally, we will only store your personal information for the time necessary to achieve the service purpose or under the conditions stipulated by laws and regulations.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "Your personal information will only be stored for the time necessary to achieve the purpose of the service or under the conditions stipulated by laws and regulations."}
{"task": "rw_126.jsonl", "id": 76928, "text": "2. The area where information is stored", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76929, "text": "We will store the personal information of users collected in China in China in accordance with laws and regulations.", "label": ["Data Retention", "Important"], "rewrite": "In accordance with laws and regulations, personal information collected in China will be stored in China."}
{"task": "rw_126.jsonl", "id": 76930, "text": "3. Notice when the product or service ceases to operate", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76931, "text": "When our products or services stop operation, we will announce notifications in accordance with relevant laws and regulations and protect your legitimate rights and interests in accordance with the law.", "label": ["Important", "Cessation of Operations"], "rewrite": "When the product or service stops operation, it will be announced."}
{"task": "rw_126.jsonl", "id": 76932, "text": "Fourth, information security protection", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76933, "text": "1. Safety protection measures", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76934, "text": "We strive to provide protection for users' information security to prevent information leakage, loss, improper use, unauthorized access and disclosure.", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76935, "text": "The technical means we use include but not limited to firewalls, encryption (eg, SSL), de -identification or anonymous treatment, access control measures, etc.", "label": ["Important", "Data Security"], "rewrite": "The technical means used include but not limited to firewalls, encryption (such as SSL), de -identification or anonymous treatment, access control measures, etc."}
{"task": "rw_126.jsonl", "id": 76936, "text": "2. Safety event disposal measures", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76937, "text": "If personal information leaks and other security incidents occur, we will start emergency plans to prevent security incidents from expanding.", "label": ["Important", "Data Security"], "rewrite": "If personal information leaks such as personal information, emergency plans will be initiated to prevent security incidents from expanding."}
{"task": "rw_126.jsonl", "id": 76938, "text": "After the security incident occurs, we will inform you the basic situation of the security incident in the form of announcement, push notification or email, we are about or already adopted, and our proposals for your response.", "label": ["Important", "Data Security"], "rewrite": "After the security incident, the basic situation will be informed in the form of announcement, push notification or email."}
{"task": "rw_126.jsonl", "id": 76939, "text": "If it is difficult to achieve one by one, we will issue warnings through announcement and other methods.", "label": ["Important", "Data Security"], "rewrite": "If it is difficult to achieve one by one, the warning will be issued through the announcement."}
{"task": "rw_126.jsonl", "id": 76940, "text": "V. External sharing, transfer, and public disclosure of personal information", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76941, "text": "(1) Sharing", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76942, "text": "If you understand and agree, we will ensure that the data receiver cannot re -recognize the subject of the personal information to the third party by sharing.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Under the premise of ensuring that the data receiver cannot re -identify the subject of personal information, it is provided to a third party in a shared manner."}
{"task": "rw_126.jsonl", "id": 76943, "text": "We may share your personal information with any company, organization and individual other than this platform under the following circumstances:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the following cases, share your personal information with any company, organization and individual other than this platform:"}
{"task": "rw_126.jsonl", "id": 76944, "text": "1. Share when obtaining clear consent: After getting your clear consent, we will share your personal information with other parties.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After obtaining clear consent, share personal information."}
{"task": "rw_126.jsonl", "id": 76945, "text": "2., we may share your personal information to the outside world in accordance with the provisions of laws and regulations, or in accordance with the mandatory requirements of the administrative department.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In accordance with laws and regulations, or in accordance with the mandatory requirements of the administrative department, share your personal information."}
{"task": "rw_126.jsonl", "id": 76946, "text": "3. Share with our affiliated companies: Your personal information may be shared with the affiliated company of this platform.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Your personal information may be shared with the affiliated company of this platform."}
{"task": "rw_126.jsonl", "id": 76947, "text": "We will only share the necessary personal information and be restricted by the purpose declared in this \"Privacy Policy\".", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "It will only share the necessary personal information and be subject to the purpose of the purpose declared in the \"Privacy Policy\"."}
{"task": "rw_126.jsonl", "id": 76948, "text": "If related companies want to change the purpose of personal information, they will solicit your authorization consent again.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If related companies want to change the purpose of personal information, they will solicit your authorization consent again."}
{"task": "rw_126.jsonl", "id": 76949, "text": "4. Share with authorized partners: Only in order to achieve the purpose of this policy, some of our services will be provided by authorized partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share personal information with authorized partners."}
{"task": "rw_126.jsonl", "id": 76950, "text": "We may share some of your personal information with our partners to provide better customer service and user experience.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share some personal information with your partners."}
{"task": "rw_126.jsonl", "id": 76951, "text": "We will only share your personal information for legal, correct, necessary, specific, and clear purposes, and only share the personal information necessary for providing services.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "It will only share necessary personal information for legal, correct, necessary, specific, and clear purposes."}
{"task": "rw_126.jsonl", "id": 76952, "text": "Our partners have no right to use the shared personal information for any other purpose.", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76953, "text": "At present, our authorized partners include the following two types:", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76954, "text": "1) Authorized partners of advertising and analytical service.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76955, "text": "We may share your personal identity information (referring to information that is sufficient to identify your identity, such as names or email, you can contact you or identify your identity through this information) to share with partners who provide advertising and analysis services. These partnersIt may include channel vendors who provide advertising services such as fast hands ,, UC, today's headlines, and Tencent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share personal identity information with partners who provide advertising and analysis services."}
{"task": "rw_126.jsonl", "id": 76956, "text": "2) Suppliers, service providers and other partners.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76957, "text": "We send information to suppliers, service providers and other partners that support our business, such as communication service providers on behalf of us, and providing communication service providers with certification services.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share personal information with suppliers, service providers and other partners."}
{"task": "rw_126.jsonl", "id": 76958, "text": "These supports include providing technical infrastructure services, analyzing the usage methods of our services, measurement of the effectiveness of advertising and services, providing customer service, payment convenience, and other support for products and services for this platform.", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76959, "text": "(2) Transfer", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76960, "text": "We will not transfer the user's personal information to any company, organization or individual, except for those that must be transferred in accordance with the laws and regulations of the People's Republic of China, and we will continue to protect or require new managers to comply with the standards required by laws and regulations. This policy continues to protect users' personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Personal information will not be transferred to any company, organization, and individuals, except except for transferring laws and regulations."}
{"task": "rw_126.jsonl", "id": 76961, "text": "(3) Public disclosure", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76962, "text": "We will only publicly disclose your personal information in the following circumstances:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the following circumstances, you will publicly disclose your personal information:"}
{"task": "rw_126.jsonl", "id": 76963, "text": "1. After getting your clear consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After getting your clear consent, disclose personal information."}
{"task": "rw_126.jsonl", "id": 76964, "text": "2. Related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Public personal information related to national security and national defense security."}
{"task": "rw_126.jsonl", "id": 76965, "text": "3. It is related to public safety, public health, and major public interests;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Public information related to public safety, public health, and major public interests."}
{"task": "rw_126.jsonl", "id": 76966, "text": "4. It is related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Public personal information related to criminal investigation, prosecution, trial, and judgment execution."}
{"task": "rw_126.jsonl", "id": 76967, "text": "5. Out of major legitimate rights and interests of the life and property of the main body or other individuals, it is difficult to get your consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "It is difficult to obtain the personal information that I agree with the major legitimate rights and interests."}
{"task": "rw_126.jsonl", "id": 76968, "text": "6. The collected information is disclosed to the public by you yourself;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Personal information that publicly discloses the public by itself."}
{"task": "rw_126.jsonl", "id": 76969, "text": "7. Collect information from the information disclosed by legitimately publicly disclosed, such as legal news reports and government information disclosure;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Information collected from the legal disclosure channels publicly."}
{"task": "rw_126.jsonl", "id": 76970, "text": "8., signing the contract according to your requirements;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Public information necessary for signing the contract."}
{"task": "rw_126.jsonl", "id": 76971, "text": "9. It is necessary to maintain the safe and stable operation of the platform's services, such as discovering and disposing of products or services;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Publicly maintain the personal information necessary for the safe and stable operation of the platform's services."}
{"task": "rw_126.jsonl", "id": 76972, "text": "10. It is necessary for legal news reports;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Public information necessary for public news reports."}
{"task": "rw_126.jsonl", "id": 76973, "text": "11. The academic research institution is necessary to carry out statistics or academic research based on public interests, and provides the results of academic research or descriptions, to identify the information contained in the results;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Public academic research institutions carry out statistical or necessary personal information for statistics or academic research based on public interests."}
{"task": "rw_126.jsonl", "id": 76974, "text": "12. Other circumstances stipulated in laws and regulations.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Personal information under other circumstances stipulated in laws and regulations."}
{"task": "rw_126.jsonl", "id": 76975, "text": "6. How do you access and manage your personal information", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76976, "text": "(1) Visit your personal information", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76977, "text": "1. You have the right to access your personal information, except for the exception stipulated in laws and regulations.", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76978, "text": "If you wish to access or edit the basic profile information in your account, you can do so by logging into your account.", "label": ["Important", "Edit/Control"], "rewrite": "If you want to visit or edit the basic information and information in the account, you can perform such operations by logging in to the account."}
{"task": "rw_126.jsonl", "id": 76979, "text": "You can check and manage your personal information at any time. The account name is your important network identity identification. For the consideration of security and identification, it cannot be changed after registration.", "label": ["Important", "Edit/Control"], "rewrite": "You can check and manage your personal information at any time."}
{"task": "rw_126.jsonl", "id": 76980, "text": "2. If you cannot access these personal information through the above path, you can get in touch with us at any time through our customer service.", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76981, "text": "We will reply to your access request as soon as possible.", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76982, "text": "3. For other personal information you generated during our products or services, we will provide you with the relevant arrangements in your \"(7) in response to your above requests\" according to the \"No. 7).", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76983, "text": "(2) more correct or supplement your personal information", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76984, "text": "When you find that the personal information we process about you is wrong, you have the right to ask us to make corrections or additions.", "label": ["Important", "Edit/Control"], "rewrite": "When there is an error in your personal information, we have the right to ask us to make corrections or supplements."}
{"task": "rw_126.jsonl", "id": 76985, "text": "You can make corrections or supplementary applications in the way you can use \"(1) access your personal information\".", "label": ["Important", "Edit/Control"], "rewrite": "You can make corrections or supplementary applications in the way of \"(1) access your personal information\"."}
{"task": "rw_126.jsonl", "id": 76986, "text": "(3) Delete your personal information", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76987, "text": "1. You can delete some of your personal information in the way you can be listed in \"(1) access your personal information\".", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76988, "text": "2. In the following circumstances, you can make a request to delete personal information:", "label": ["Important", "Edit/Control"], "rewrite": "In the following circumstances, you can make a request to delete personal information:"}
{"task": "rw_126.jsonl", "id": 76989, "text": "(1) If our behavior of handling personal information violates laws and regulations;", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76990, "text": "(2) If we collect and use your personal information, it has not obtained your clear consent;", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76991, "text": "(3) If our behavior of handling personal information seriously violates your agreement;", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76992, "text": "(4) If you no longer use our products or services, or you take the initiative to cancel your account;", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76993, "text": "(5) If we will no longer provide you with products or services.", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76994, "text": "3. If we decide to respond to your deletion request, we will also notify the subject of your personal information from our personal information as much as possible at the same time, asking them to delete timely, unless the laws and regulations have other regulations, or these subjects obtain your independent authorization.", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76995, "text": "4. When you delete the information from our service, we may not immediately delete the corresponding information from the backup system, but will delete these information when the backup is updated.", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76996, "text": "(4) Change the scope of your authorization consent", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76997, "text": "Each business function requires some basic personal information to be completed (see the first of the Privacy Policy).", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 76998, "text": "In addition, you can withdraw part of the authorization by dismissing binding, modifying personal settings, deleting relevant information, etc., or you can revoke partial authorization by closing the function.", "label": ["Important", "Edit/Control"], "rewrite": "Part of the authorization can be withdrawn, and part of the authorization can also be revoked by turning off the function."}
{"task": "rw_126.jsonl", "id": 76999, "text": "For example, if you want to stop sharing your geographical location information when you use geographical location -related services, you can stop sharing the closing method of closing functions, software and hardware service providers and communication service providers through your mobile phone.", "label": ["Important", "Edit/Control"], "rewrite": "It can be stopped to stop sharing through the closure of functions, software and hardware service providers and communication service providers through mobile phones."}
{"task": "rw_126.jsonl", "id": 77000, "text": "When you withdraw your consent, we will no longer process the corresponding personal information.", "label": ["Important", "Edit/Control"], "rewrite": "When you withdraw your consent, we will no longer process the corresponding personal information."}
{"task": "rw_126.jsonl", "id": 77001, "text": "But your decision to recover the consent will not affect personal information processing based on your authorization.", "label": ["Permission Acquisition", "Edit/Control", "Risk", "Important"], "rewrite": "The decision you take back will not affect the personal information processing based on your authorization."}
{"task": "rw_126.jsonl", "id": 77002, "text": "(5) List of personal information main body", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 77003, "text": "1. You can be on your own, and submit your account to cancel your application on your own.", "label": ["Important", "Edit/Control"], "rewrite": "You can submit an account cancellation application on the \"Cancel Account\" page by yourself."}
{"task": "rw_126.jsonl", "id": 77004, "text": "2. After you actively cancel your account, we will stop providing you with products or services, delete your personal information according to the requirements of applicable laws, or make it anonymous processing.", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "After actively canceling the account, it will stop providing products or services, delete personal information, or make it anonymous."}
{"task": "rw_126.jsonl", "id": 77005, "text": "(6) Automatic decision -making of constraint information system", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 77006, "text": "In certain business functions, we may make decisions only based on the non -artificial automatic decision mechanism, including information systems, algorithms, etc..", "label": ["Important", "Usage"], "rewrite": "Decisions are made based on the non -artificial automatic decision -making mechanism, including information systems, algorithms, etc."}
{"task": "rw_126.jsonl", "id": 77007, "text": "If these decisions significantly affect your legitimate rights and interests, you have the right to ask us for an explanation, and we will also provide appeal methods on the premise of not infringing on the trade secrets of this product or other user rights and social public interests.", "label": ["Important", "Edit/Control"], "rewrite": "You have the right to ask us to explain, and we will also provide an appeal method."}
{"task": "rw_126.jsonl", "id": 77008, "text": "(7) Responsive your above request", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 77009, "text": "1. To ensure safety, you may need to provide a written request or prove your identity in other ways.", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 77010, "text": "We may ask you to verify your identity first, and then process your request.", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 77011, "text": "2. We will make a reply as soon as possible.", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 77012, "text": "If you are not satisfied, a complaint can be initiated through the customer service contact information stated by Article 9 of the privacy policy.", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 77013, "text": "3. For your reasonable requests, we do not charge fees in principle, but we will charge a certain cost fee depending on requests that repeat and beyond the reasonable limit.", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "In principle, no fee is charged, but for repeated requests that exceed reasonable limits, a certain cost will be charged depending on the situation."}
{"task": "rw_126.jsonl", "id": 77014, "text": "For those unprocessed, too many technical means (for example, need to develop new systems or fundamentally change the current practice), bring risks or very unrealistic requests to the legitimate rights and interests of others, we may refuse.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Unrealistic requests may refuse."}
{"task": "rw_126.jsonl", "id": 77015, "text": "4. In the following circumstances, in accordance with the requirements of laws and regulations, we will not be able to respond to your request:", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "In the following circumstances, in accordance with the requirements of laws and regulations, we will not be able to respond to your request:"}
{"task": "rw_126.jsonl", "id": 77016, "text": "(1), related to national security and national defense security;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Requesting the request with national security and national defense security cannot be responded."}
{"task": "rw_126.jsonl", "id": 77017, "text": "(2), related to public safety, public health, and major public interests;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "If it is related to public safety, public health, and major public interests, the request cannot be responded."}
{"task": "rw_126.jsonl", "id": 77018, "text": "(3), related to criminal investigation, prosecution, trial, and execution judgment;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "It cannot be responded to the request that is related to criminal investigation, prosecution, trial, and execution judgment."}
{"task": "rw_126.jsonl", "id": 77019, "text": "(4) There are sufficient evidence that the subject of personal information has subjective malicious or abuse of rights;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "If there is sufficient evidence that the subject of personal information has subjective malice or abuse of rights, the request cannot be responded."}
{"task": "rw_126.jsonl", "id": 77020, "text": "(5) In response to your request, the legitimate rights and interests of you or other individuals and organizations are severely damaged;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "The response request will cause serious damage to the legitimate rights and interests and cannot respond to the request."}
{"task": "rw_126.jsonl", "id": 77021, "text": "(6), involved business secrets.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Those who involve business secrets cannot respond to requests."}
{"task": "rw_126.jsonl", "id": 77022, "text": "Seven, change", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 77023, "text": "We may revise this agreement in a timely manner.", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 77024, "text": "When the terms of this agreement change, we will prompt you the change of the agreement in an appropriate manner when the version is updated.", "label": ["Policy Change", "Important"], "rewrite": "When the version is updated, it will prompt you to change the agreement in an appropriate manner."}
{"task": "rw_126.jsonl", "id": 77025, "text": "Please read the privacy protection protocol after the change. You continue to use our game to indicate that you agree to collect, process or use your personal information according to the updated privacy protection agreement.", "label": ["Policy Change", "Important"], "rewrite": "Continue to use the game to express personal information according to the updated privacy protection agreement."}
{"task": "rw_126.jsonl", "id": 77026, "text": "8. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 77027, "text": "We attach great importance to the protection of minors' personal information.", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 77028, "text": "We will actively protect the legitimate rights and interests of minors by enabling the anti -addiction system in accordance with the requirements of national defense addiction policies.", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 77029, "text": "If you are under the age of 16, please read the privacy protection agreement with your guardian (legal agent) before using the services we provided for you and obtain your guardian (Agreement of legal agent).", "label": ["Specific Audiences", "Important"], "rewrite": "Minors under the age of 16 must read the privacy protection agreement with the guardian (legal agent) and obtain the consent of the guardian (legal agent)."}
{"task": "rw_126.jsonl", "id": 77030, "text": "Nine, contact us", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 77031, "text": "If you have any questions about this \"Privacy Policy\" or related matters, please contact us through [, ggamekf@qq.com,].", "label": ["Important", "Contact Information"], "rewrite": "Please contact us through [ggamekf@qq.com]."}
{"task": "rw_126.jsonl", "id": 77032, "text": "Recent Updated: August 2, 2021", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 77033, "text": "Agreement Effective time: August 2, 2021", "label": [], "rewrite": []}
{"task": "rw_126.jsonl", "id": 77034, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
