{"task": "rw_114.jsonl", "id": 73807, "text": "\"Swordsman World 3\" mobile game privacy policy", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73808, "text": "Kind tips", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73809, "text": "Welcome to use \"Swordsman World 3\" mobile game!", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73810, "text": "We attach great importance to protecting your personal information and privacy.", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73811, "text": "You can learn about the situation of our collection, use, and storage of user information through \"Swordsman World 3 Privacy Policy\", and the relevant rights you enjoy.", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73812, "text": "Please read carefully and fully understand the relevant content:", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73813, "text": "1. In order to provide you with game services, we will collect, use, and store the necessary information based on \"Swordsman World 3 Privacy Policy\".", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73814, "text": "In order to provide you with game entertainment services and interactive services with players, we need to collect information such as your equipment information, login logs.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect information such as equipment information and login logs to provide services."}
{"task": "rw_114.jsonl", "id": 73815, "text": "2. In order to achieve business functions or necessary in accordance with the requirements of laws and regulations, we will collect and use your sensitive personal information when you use specific functions or services.Astimore face recognition function for some users (based on specific game strategies).", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In specific functions or services, collect and use your sensitive information to achieve business functions or need to be in accordance with laws and regulations."}
{"task": "rw_114.jsonl", "id": 73816, "text": "In the process of face recognition function, we will obtain your face images and video information. The above -mentioned face verification information is mainly compared with the user's real -name authentication information and real facial information with the data source of the public security authority.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In the process of face recognition function, the collector's face image and video information are compared with the data source of the Public Security's authoritative data platform."}
{"task": "rw_114.jsonl", "id": 73817, "text": "3. In order to achieve business functions or necessary in accordance with the requirements of laws and regulations, we may apply for opening your equipment permissions when you use specific functions or services.It will be opened by default. Only after your explicit authorization will use it when you implement specific functions or services, you can also withdraw authorization.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "It may be that you can apply for the device authority with a specific function or service, but it will not be opened by default, and the license can be withdrawn in the future."}
{"task": "rw_114.jsonl", "id": 73818, "text": "4. You can access, correct and delete your personal information, and you can also withdraw authorization consent, cancel account number, complain report, and adjust other privacy settings.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73819, "text": "5. We have taken security measures that meet industry standards to protect your personal information.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73820, "text": "6. If you are a minor, please and your guardian to read this privacy policy carefully, and use our service or provide personal information to us under the premise of obtaining the consent of your guardian.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73821, "text": "Please read the full version of \"Swordsman World 3 User Agreement\" and \"Swordsman World 3 Privacy Policy\" for details.", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73822, "text": "If you agree with the Swordsman World 3 User Agreement and \"Swordsman World 3 Privacy Policy\", please click \"Agree\" to start using our products and services. We will do our best to protect your personal information security.", "label": ["Policy Change", "Important"], "rewrite": "Please click \"Agree\" to start using our products and services."}
{"task": "rw_114.jsonl", "id": 73823, "text": "\"Swordsman World 3\" privacy policy", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73824, "text": "Release date of this version: December 20, 2021", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73825, "text": "Effective date: December 21, 2021", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73826, "text": "Welcome to use \"Wuhan Xishanju Shiyou Technology Co., Ltd.\" and its affiliates (Chengdu Xishanju Shiyou Technology Co., Ltd., Zhuhai Xishanju Shiyou Technology Co., Ltd., Zhuhai Xishanju Digital Technology Co., Ltd., Beijing Jinshan Digital Entertainment Technology Co., Ltd.Company, Chengdu Jinshan Digital Entertainment Technology Co., Ltd., Zhuhai Xishanju Digital Technology Co., Ltd., Zhuhai Jinshan Digital Network Technology Co., Ltd., hereinafter referred to as \"We\" or \"Xishanju\") operation \"Swordsman World 3\" mobile game (hereinafter referred to as\"This product\").", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73827, "text": "This \"Privacy Policy\" will strive to explain the policies and measures of this product in collecting, using, managing, and protecting your personal information through the easy -to -understand and concise text expression, as well as the visits and updates we provide for you, Delete and protect this information.", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73828, "text": "It is clear to you that this \"Privacy Policy\" is an integral part of the \"Jinshan Online Privacy Policy\". For example, this \"Privacy Policy\" and \"Jinshan Online Privacy Policy\" conflict, which are subject to this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73829, "text": "If you are at the age of 14, you should apply \"Child Privacy Policy\" at the same time, please pay special attention.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73830, "text": "The following \"you\", if there is no special explanation, refers to the guardian who is under the age of fourteen years old or a user who is 14 years old.", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73831, "text": "Before using the product services we provided, we recommend that you carefully read the \"Privacy Policy\" (especially the bold clauses that are directly related to your rights, involving your personal sensitive information), and then decide whether to use us to use us to use us to our direction.For this product service, please know that this policy is only applicable to the information collected to you through this product, and it is not applicable to the third -party collected by the third party that provides you to the product or service.information.", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73832, "text": "If you do not agree with any content of this policy, we will not be able to provide you with this product service (hereinafter referred to as \"service\"), you should immediately stop using our services.", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73833, "text": "When you agree with this policy, you have agreed that we have agreed to process your relevant information in accordance with this policy.", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73834, "text": "When you agree to use our services, it means you have agreed that we have dealt with your relevant personal information in accordance with this policy.", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73835, "text": "The main content of this \"Privacy Policy\" is as follows:", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73836, "text": "1. How do we collect and use personal information", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73837, "text": "2. Sharing, transfer and public disclosure of personal information", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73838, "text": "Third, the use of cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73839, "text": "Fourth, the protection of personal information", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73840, "text": "5. Your right to personal information", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73841, "text": "6. Special protection for personal information of minors (including children)", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73842, "text": "7. Application and modification of this \"Privacy Policy\"", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73843, "text": "8. Application and dispute resolution of law", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73844, "text": "Nine, contact us", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73845, "text": "10. Keyword description", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73846, "text": "List of Permanent Corporation of Affiliated Table", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73847, "text": "Attached Table 2 third -party SDK list", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73848, "text": "You can view this privacy policy in the following way:", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73849, "text": "1. The \"Guidelines for User Privacy Conservation\" popped up when the product is launched for the first time;", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73850, "text": "2. The privacy policy column of this product starts interface;", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73851, "text": "3. The user's privacy policy announced in the announcement column of this product;", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73852, "text": "4. When the content of the privacy policy is updated, we will pop up the updated privacy policy after you start the product next time, and re -consults you;", "label": ["Policy Change", "Important"], "rewrite": "When the content of privacy policy is updated, we will re -solicit your consent by popping up a new way of privacy policy."}
{"task": "rw_114.jsonl", "id": 73853, "text": "1. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73854, "text": "(1) We will collect and obtain your personal information through the following channels:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73855, "text": "1. The information you provide.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73856, "text": "(1) The information you provided to us when you register the game account or use this product.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73857, "text": "(2) The information stored when you use this product.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73858, "text": "2. Your information that is legally shared by a third party.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73859, "text": "3. The information that we obtain legally obtained in the process of providing you, if you collect, summarize, and record information when using this product.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73860, "text": "(2) We will collect and use your personal information for the following goals:", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73861, "text": "(1) Help you complete the registration and login", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73862, "text": "In order to facilitate us to provide you with continuous and stable services and ensure the security of your services you provide, you need to use the Jinshan Pass account that you enjoy the right to use as the account of this product. When you register for the Jinshan Pass, you need to provide it with you to provide providedBasic registration information, including the account name you prepared, the password you created, your email (unnecessary), the real -name mobile phone number under your own name, we will use the way to send a SMS verification code to help verify your identityEssence", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you register for the Jinshan Pass, collect the account name of the account you are preparing, the password created, the email address (unnecessary), the real -name mobile phone number under your own name, and use the SMS verification code to assist the verification identity."}
{"task": "rw_114.jsonl", "id": 73863, "text": "In order to provide you with better services and improve product experience, when you log in to this product, we will collect your avatars, nicknames, and IDs for in -product information display.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you log in, we collect your avatars, nicknames, and IDs for in -product information display."}
{"task": "rw_114.jsonl", "id": 73864, "text": "We may provide you with relevant permissions depending on the specific situation of the product so that you can set the relevant information about whether the relevant information described before.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73865, "text": "You can also use the account of the third -party platform recognized by Xishanju to log in to this product. When you log in to this product with the account of the third -party platform recognized by Xishanju, we will obtain the relevant information under these accounts based on your authorization (for example:Username, nickname, avatar, specifically your authorization content), is used to help you complete login and realize a better gaming entertainment experience.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When registering and logging in with a third -party account, visit and collect your personal information after your authorization."}
{"task": "rw_114.jsonl", "id": 73866, "text": "(2) Realize real -name authentication and the integration of people's certificates", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73867, "text": "In accordance with relevant laws and regulations and regulatory requirements, or in order to meet the needs of user identity, guarantee systems and service security, and other specific service functions, we need to collect your name, certificate type, and document number.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your name, certificate type, certificate number to meet regulatory requirements or authentication or security service security."}
{"task": "rw_114.jsonl", "id": 73868, "text": "At the same time, in order to achieve the purpose of real -name authentication, you agree and authorize us to provide, inquire, and check your aforementioned identity information for the relevant real -name certification agencies (such as government departments).", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "You agree and authorize us to verify your identity by yourself or entrust our third parties to verify your identity."}
{"task": "rw_114.jsonl", "id": 73869, "text": "Please note that your identity information is a personal sensitive information. Please provide it with caution. If you do not provide such information, you will be unable to register, log in to this product or be subject to corresponding restrictions in the process of using this product.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you do not provide identity information, you will be unable to register, log in to this product or be limited."}
{"task": "rw_114.jsonl", "id": 73870, "text": "At the same time, in order to realize the combination of human certificates or provide online game protection of minors and promote the healthy online game of minors, we may enable face recognition functions in some games or for some users (based on specific game strategies).", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may use face recognition functions to achieve certification unity or provide online game protection of minors."}
{"task": "rw_114.jsonl", "id": 73871, "text": "In the process of face recognition, we will obtain your face image and video information. The above -mentioned face recognition is mainly to compare the user real -name authentication information and real facial information with the data source of the Public Security Authoritative Data Platform.Face verification information is a personal sensitive information. Please provide it with caution. If you do not refuse to perform face recognition, you will be restricted in the process of using this product.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We will compare your face image and video information with the data source of the Public Security Data Platform.If you refuse face recognition, you will be limited to using this product."}
{"task": "rw_114.jsonl", "id": 73872, "text": "(3) Help you complete the order, pay, recharge, and deliver the goods or services to you", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73873, "text": "If you buy the paid service of this product, when you settle the content of the service content you choose, the order will stipulate the order number, the content you purchased, the amount you should pay, the recharge record and payment method so that you can inquireYour transaction records and protection of your transaction security are necessary for the above information to achieve paid service functions.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you settlement, the order will indicate the order number, service content, amount, recharge records and payment methods for inquiries and protection of transactions in transaction records."}
{"task": "rw_114.jsonl", "id": 73874, "text": "The recharge record and consumption record are sensitive information. Collecting the above information is necessary to achieve the consumption function of our game products, otherwise the transaction will not be completed.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect recharge records and consumer records as necessary for consumption functions."}
{"task": "rw_114.jsonl", "id": 73875, "text": "When you use the consumption function and choose to pay, you can choose a third -party payment institution that cooperates with this product (such as Alipay, WeChat Pay, JD Pay and UnionPay, and Netlinage Payment channels.Payment service.", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73876, "text": "The payment function itself does not collect your personal information, but we need to share your order number and transaction amount information with these payment institutions to realize its confirmation of your payment instructions and complete the payment.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We need to share your order number and transaction amount information with the third -party payment institutions you choose to achieve the payment function."}
{"task": "rw_114.jsonl", "id": 73877, "text": "The transaction completion or event prize distribution, such as distribution and mailing services, the third -party distribution company we cooperates (such as SF, Zhongtong, etc., hereinafter referred to as \"distribution company\") will complete the delivery and mailing services for you.", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73878, "text": "You know and agree that the third -party distribution company that cooperates with us will use your order information in the above link to ensure that the product/service you order can be delivered safely.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Our third -party distribution company uses your order information to provide you with delivery and mailing services."}
{"task": "rw_114.jsonl", "id": 73879, "text": "(4) To provide you with customer service functions", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73880, "text": "When you contact our customer service, our system will record the communication records between you and customer service.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you contact the customer service, the system will record the communication record."}
{"task": "rw_114.jsonl", "id": 73881, "text": "Our customer service will use your account information based on your identity needs.", "label": ["Important", "Usage"], "rewrite": "Customer service uses your account information to verify the identity."}
{"task": "rw_114.jsonl", "id": 73882, "text": "When you need us to provide customer service services related to your order information, we will check your order information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will check your order information to provide you with services related to this."}
{"task": "rw_114.jsonl", "id": 73883, "text": "When you need us to provide further customer service services, you will need to provide separate necessary information according to the actual service needs.", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73884, "text": "If you ask us to issue an invoice, we will collect your order information, address and contact information (paper invoice needs) to respond to this request.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect your order information, address and contact information for issuing invoices."}
{"task": "rw_114.jsonl", "id": 73885, "text": "(5) Provide basic functions of the game", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73886, "text": "In order to provide you with product services, maintain the normal operation of the basic functions of the game, optimize the performance of the game product, and improve your gaming experience, we will collect your login log, item log, operation information, game pairBureau information, game friends information and interactive records, login account, game ID, search query content, IP address, network environment, language use, visit date and time PUSH open record, stay duration, refresh records, release records, follow, subscribe, subscribe, Collect and share.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We will collect information related to your game to provide you with basic services for you."}
{"task": "rw_114.jsonl", "id": 73887, "text": "(6) Make sure your account security and monitoring games illegal behavior and the necessary functions necessary for anti -addiction", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73888, "text": "In order to ensure your system security when using this product, we will collect your device model, IP address, equipment software version information, equipment brand and model, memory size, whether simulator, equipment identification code, equipment identifier, area where you are located, Internet usage habits, product collapse information, and record link information we think are risky;", "label": ["Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "We will collect your device model, IP address, device software version information, brand and model, memory size, whether it is simulator, device identification code, device identifier, area, network usage habits, product crash information for guarantee to guaranteeproduct Safety."}
{"task": "rw_114.jsonl", "id": 73889, "text": "To further analyze and investigate the existing system abnormalities and system risks, to combat the destroying the fair environment or interference of the product or the normal conduct of the product and services (such as the testing of piracy, scanning plug -in, preventing cheating, etc.).", "label": ["Important", "Usage"], "rewrite": "The information we collect is used to further analyze and check risks."}
{"task": "rw_114.jsonl", "id": 73890, "text": "At the same time, in order to ensure network security and operational security, prevent minors from adding to games, control illegal information in the game, crack down on the fair environment or interference of the game, the behavior of destroying game services, and restrict the trial account, the personal equipment information we collect: MAC address, IMEI, IMSI, IP, device serial number, mobile phone recognition code, and mobile phone number of the machine, so as to be the unique identification and judgment basis for the device.", "label": ["Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "We will collect your personal equipment information to ensure network security and operational security, and prevent minors from adding to the game."}
{"task": "rw_114.jsonl", "id": 73891, "text": "(7) Provide you with interactive functions", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73892, "text": "When you interact with other users of the product, or actively publish information, we will collect and save the relevant information content you send, such as speaking, posts, comments, comments, collection, rewards, etc.Laws and policies and relevant competent departments are filtered in improper content.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We will collect and save the interactive information you send or actively published to filter in improper content in accordance with regulations."}
{"task": "rw_114.jsonl", "id": 73893, "text": "(8) Marketing promotion or special activities", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73894, "text": "You through our customer service or the information submitted by our activities and investigations.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect information you participate in or pass through customer service or survey."}
{"task": "rw_114.jsonl", "id": 73895, "text": "For example, you may include information such as your name, phone, address and other information in the questionnaire you filled in when we participate in our research activities.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect the content of your questionnaire."}
{"task": "rw_114.jsonl", "id": 73896, "text": "After participating in our raffle and winning, in order to facilitate us to contact us and send gifts to you, personal information provided to us, such as your address, name, phone number.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We will collect personal information provided after winning your prize to contact and send gifts."}
{"task": "rw_114.jsonl", "id": 73897, "text": "When you receive products and corresponding after -sales service through the event, you need to provide us with your personal information to confirm your identity, such as your ID number.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you receive the product or provide you with after -sales service, your personal information will be collected for authentication."}
{"task": "rw_114.jsonl", "id": 73898, "text": "(9) If you copy the information sharing in the product or accept the information in the product, we need to visit your shear plate locally to read the password, redemption code or other content in it to achieve welfare acquisition, Event participation and sharing functions.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We will access your shear plates and read the content in the device to achieve welfare acquisition, activities participation and sharing."}
{"task": "rw_114.jsonl", "id": 73899, "text": "We will only read the information related to our service, we will not read other unrelated information in the shear plate, and we will not store such information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will not read or save information that has nothing to do with us in the shear plate."}
{"task": "rw_114.jsonl", "id": 73900, "text": "(3) Equipment rights adjustment", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73901, "text": "You understand and agree that some single services may require you to turn on specific access permissions in your device to achieve the collection and use of information involved in these permissions.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73902, "text": "For example, when you want to interact with other game players through pictures, voice, videos, and participate in live broadcasts. After you have authorized consent, we will access your photos or storage files, microphones, cameras, and geographical location to provide you with screenshots saving, pictures, picturesUpload, voice chat, find nearby gamers to interact with them.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "We will visit you with the authorized photos or storage files, microphones, cameras, and geographical locations to provide you with corresponding interactive functions."}
{"task": "rw_114.jsonl", "id": 73903, "text": "You can choose to close part or all permissions at any time in the setting function of the device to withdraw your consent to grant us a certain permissions.", "label": ["Edit/Control", "Important"], "rewrite": "You can withdraw authorization by closing all or partial permissions."}
{"task": "rw_114.jsonl", "id": 73904, "text": "In different devices, the right display mode and closing method may be different. Most mobile devices will support your needs. For specific methods, please refer to or contact your mobile device service providers or manufacturers.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73905, "text": "See Table 1 for the calling information of the detailed device.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73906, "text": "Please note that when you start the right of power, it means that you authorize us to collect and use relevant information to provide you with corresponding services. Once you turn off the right of authority, it means that you cancel the authorization.Using relevant information, it is impossible to provide you with the service corresponding to the permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "The opening of one authority means that the authorization is authorized to collect and use the relevant information to provide corresponding services. Close the authority to cancel the authorization representative, and no longer continue to collect and use relevant information based on the corresponding permissions."}
{"task": "rw_114.jsonl", "id": 73907, "text": "However, your decision to close permissions will not affect the collection and use of information based on your authorization.", "label": ["Permission Acquisition", "Important"], "rewrite": "Close authority will not affect the collection and use of information based on authorization."}
{"task": "rw_114.jsonl", "id": 73908, "text": "(4) Exception of your authorization", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73909, "text": "According to relevant laws and regulations and national standards, in the following circumstances, we may collect and use your relevant personal information without asking your authorization consent:", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "According to relevant laws and regulations and national standards, in the following circumstances, we may collect and use your relevant personal information without asking your authorization consent:"}
{"task": "rw_114.jsonl", "id": 73910, "text": "(1) It is necessary for the contract to establish and fulfill your contract as one party;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "(1) It is necessary for the contract to establish and fulfill your contract as one party;"}
{"task": "rw_114.jsonl", "id": 73911, "text": "(2) To fulfill the statutory duties or the requirements of the statutory volunteer;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "(2) To fulfill the statutory duties or the requirements of the statutory volunteer;"}
{"task": "rw_114.jsonl", "id": 73912, "text": "(3) In order to deal with emergencies, or in urgent situations to protect the health and property security of you or others;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "(3) In order to deal with emergencies, or in urgent situations to protect the health and property security of you or others;"}
{"task": "rw_114.jsonl", "id": 73913, "text": "(4) Implement news reports and public opinion supervision for public interests, and deal with your personal information within a reasonable range;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "(4) Implement news reports and public opinion supervision for public interests, and deal with your personal information within a reasonable range;"}
{"task": "rw_114.jsonl", "id": 73914, "text": "(5) Treatment your own personal information that you disclose or have legal disclosure within a reasonable range;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "(5) Treatment your own personal information that you disclose or have legal disclosure within a reasonable range;"}
{"task": "rw_114.jsonl", "id": 73915, "text": "(6) Other circumstances stipulated in laws and administrative regulations.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "(6) Other circumstances stipulated in laws and administrative regulations."}
{"task": "rw_114.jsonl", "id": 73916, "text": "(5) Refined information collected due to service updates", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73917, "text": "Limited by the nature of our service, please know and understand that our services will continue to be updated and improved, and new and changes may occur in various business functions.", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73918, "text": "If we need to supplement the collection of a specific information of your service update, we will follow the actual situation, through the revision of this policy, obtain your authorization, page prompts, and publish one or more ways in the announcement method.You explain to obtain your consent.", "label": ["Policy Change", "Important"], "rewrite": "According to the actual situation of service updates, we will obtain your consent to supplement the collection information through revised policies, obtaining authorization, page prompts, and publishing announcements."}
{"task": "rw_114.jsonl", "id": 73919, "text": "2. Sharing, transfer and public disclosure of personal information", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73920, "text": "(1) Sharing of personal information", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73921, "text": "(1) Partner type", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73922, "text": "In order to achieve the purpose of declared in this privacy policy, we may share your necessary information with our partners for the necessary, legal, legitimate, and specific purposes.Use your information within the range.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share your necessary information with partners for the necessary, legal, legitimate, and specific purposes, and will require it to use information within the scope of the service."}
{"task": "rw_114.jsonl", "id": 73923, "text": "The current partners of this product include:", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73924, "text": "：, Payment service provider: In order to realize the product payment function, we will share the necessary information related to the transaction to the payment service provider.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We will share the necessary information related to the transaction to the payment service provider to achieve the payment function."}
{"task": "rw_114.jsonl", "id": 73925, "text": "应, service providers, suppliers: In order to better realize our service functions so that we can bring you a better product experience, we will provide us with business support for us, service providers (including technical infrastructure services, Data analysis services, customer service, or academic research and investigation) provide the necessary information related to the service.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will provide us with the necessary information related to the service providers and service providers that provide us with business support."}
{"task": "rw_114.jsonl", "id": 73926, "text": "：, Third -party merchants: When the content of your purchase involves products or services provided by third -party merchants, we must share your order information and necessary information related to transactions with third -party merchants to realize your purchase of goods orThe demand for service is prompted to complete the subsequent after -sales service.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We share your order information and necessary information related to transactions with third -party merchants to respond to your purchase demand and after -sales service."}
{"task": "rw_114.jsonl", "id": 73927, "text": "服务, Advertising and Analysis Service Providers: We will not directly provide your personal information to advertising or analytical service providers.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not directly provide your personal information to advertising or analytical service providers."}
{"task": "rw_114.jsonl", "id": 73928, "text": "In order to help advertising services improve the effective touch rate of advertising without identifying your personal information, or to improve the effectiveness of the analysis results of the analysis service provider, we will provide relevant information and provideYou personally.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will provide information that cannot directly identify personal information to advertising and analytical service providers."}
{"task": "rw_114.jsonl", "id": 73929, "text": "验 Face recognition verification service provider: In order to better respond to the country's relevant policies for the protection of minors, we will use third -party face recognition functions for suspected minor users in the game to further improve the precise accuracy of real -name authentication.Degree to maximize the minor to prevent minors from using the identity information of others. We will send your name, ID number, face verification data, equipment information, log information, and operating information to a third -party service provider. At the same time, face recognition is requiredVerify service providers also abide by relevant legal policies to protect your personal information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "When the minor enables face recognition, we collect real identity information and send them to third -party face recognition verification service commercials for identity verification to further improve the accuracy of real -name certification, and ask them to comply with regulations to protect your personal information."}
{"task": "rw_114.jsonl", "id": 73930, "text": "需 The essential subject to provide products and services: Based on the performance of legal obligations or contractual obligations, preventing technology or security issues, we should disclose the essential subject of your personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We disclose your personal information to the necessary subjects providing product services."}
{"task": "rw_114.jsonl", "id": 73931, "text": "当, government agencies: When you involve your complaints, disputes, litigation, law enforcement surveys with others, we may provide the relevant content, your contact information, and the necessary information designated by government agencies to government agencies to promote related matters to promote related mattersSolving in a timely manner unless the laws and regulations are clearly prohibited.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "When you involve your complaints, disputes, lawsuits, law enforcement surveys with others, we will share the relevant content, your contact information and other necessary information with government agencies, except for laws and regulations."}
{"task": "rw_114.jsonl", "id": 73932, "text": "Companies, organizations and individuals who share personal information with us, we will ask them to comply with confidentiality agreement, and ask them to handle personal information in accordance with our instructions, privacy policies, and any other related confidentiality and security measures.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will ask shareders to comply with confidentiality and take confidentiality and security measures to handle personal information."}
{"task": "rw_114.jsonl", "id": 73933, "text": "(2) Special instructions for embedding third -party code and plug -in", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73934, "text": "In order to achieve the purpose of this policy, we may access the SDK or other similar applications provided by third -party service providers (such as embedded code, plug -in, etc.) to provide you with better customer service and user experience and user experienceEssence", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will access SDK or other similar applications provided by third -party service providers to achieve the purpose of this policy statement."}
{"task": "rw_114.jsonl", "id": 73935, "text": "At present, the third -party service providers we connect mainly include the following types:", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73936, "text": "功能 For message push functions, including mobile phone manufacturer PUSH push, specific events reminders, etc.;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73937, "text": "， For payment related services, including order payment, transaction behavior verification, income settlement, payment information remittance president, etc.;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73938, "text": "的In the case of your consent, obtain equipment location permissions, collect equipment information and log information, such as the MAC address, application list, IMEI, IMSI, etc.;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73939, "text": "授 For third -party authorization services, including third -party account login, sharing related content to third -party products, etc.;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73940, "text": "块 Used to support product function modules, including online live broadcast, video playback, voice recognition, AR, smart customer service, barrage playback, content storage, etc.;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73941, "text": "能 Used to optimize product performance, including improving the ability of hardware distribution, reducing server costs, function heat repair, etc.;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73942, "text": "、 For account security, product reinforcement related services, including network monitoring, domain name analysis, anti -hijacking, anti -junk anti -cheating, plus decryption services, etc.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73943, "text": "检 Face recognition verification for people who are used for the integration of human certificates and preventing minors from adding to online games", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73944, "text": "Some third -party SDKs or applications we access may collect your personal information. If you use such services provided by third parties in our services, you agree that you will process your information.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Risk"], "rewrite": "Some third -party SDKs or similar applications we access may collect your personal information.When you use the services provided by a third party, you agree to process the information by it."}
{"task": "rw_114.jsonl", "id": 73945, "text": "We will evaluate the legality, legitimacy, and necessity of such third -party services to collect personal information, and require these third parties to take protection measures for your personal information, and strictly abide by relevant laws and regulations and regulatory requirements.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will evaluate the legality, legitimacy, and necessity of third -party services to collect personal information, require them to take protection measures, and strictly abide by relevant laws and regulations and regulatory requirements."}
{"task": "rw_114.jsonl", "id": 73946, "text": "You can view the basic situation of the third -party SDK we access to the second -party SDK.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You can view the basic situation of the third -party SDK we access to the second -party SDK."}
{"task": "rw_114.jsonl", "id": 73947, "text": "(3) Transfer of personal information", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73948, "text": "Without your authorization, we will not want third parties to transfer your personal information. When involving mergers, acquisitions, asset transfer or similar transactions, if you involve personal information transfer, we will ask for the new holding of your personal informationThe company and organizations continue to be subject to the \"Privacy Policy\", otherwise, we will ask the company and the organization to reconcile your authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If transactions such as business mergers, acquisitions, and asset transfer involve personal information transfer, the receiver will be required to be subject to this policy constraint, otherwise you will re -solicit your authorization consent."}
{"task": "rw_114.jsonl", "id": 73949, "text": "(4) Public disclosure of personal information", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73950, "text": "We will not disclose your information unless we follow the provisions of national laws and regulations or obtain your consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not disclose your information unless we follow the provisions of national laws and regulations or obtain your consent."}
{"task": "rw_114.jsonl", "id": 73951, "text": "Please note that when the punishment announcement of destroying the fair environment or interference of the game or the normal conduct of game services, we will disclose relevant account information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will disclose relevant account information that destroys the fairness and normal of the game."}
{"task": "rw_114.jsonl", "id": 73952, "text": "2.4 Exception", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73953, "text": "According to relevant laws and regulations and national standards, in the following circumstances, we may provide partners with or disclose disclosure of personal information without obtaining your authorization consent in advance:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "According to relevant laws and regulations and national standards, in the following circumstances, we may provide partners with or disclose disclosure of personal information without obtaining your authorization consent in advance:"}
{"task": "rw_114.jsonl", "id": 73954, "text": "(1) It is necessary for the contract to establish and fulfill your contract as one party;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "(1) It is necessary for the contract to establish and fulfill your contract as one party;"}
{"task": "rw_114.jsonl", "id": 73955, "text": "(2) To fulfill the statutory duties or the requirements of the statutory volunteer;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "(2) To fulfill the statutory duties or the requirements of the statutory volunteer;"}
{"task": "rw_114.jsonl", "id": 73956, "text": "(3) In order to deal with emergencies, or in urgent situations to protect the health and property security of you or others;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "(3) In order to deal with emergencies, or in urgent situations to protect the health and property security of you or others;"}
{"task": "rw_114.jsonl", "id": 73957, "text": "(4) Implement news reports and public opinion supervision for public interests, and deal with your personal information within a reasonable range;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "(4) Implement news reports and public opinion supervision for public interests, and deal with your personal information within a reasonable range;"}
{"task": "rw_114.jsonl", "id": 73958, "text": "(5) Treatment your own personal information that you disclose or have legal disclosure within a reasonable range;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "(5) Treatment your own personal information that you disclose or have legal disclosure within a reasonable range;"}
{"task": "rw_114.jsonl", "id": 73959, "text": "(6) Other circumstances stipulated in laws and administrative regulations;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "(6) Other circumstances stipulated in laws and administrative regulations;"}
{"task": "rw_114.jsonl", "id": 73960, "text": "Third, the use of cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73961, "text": "(1) By using cookies, we provide users with a safe service experience.", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73962, "text": "We and third -party partners will store Cookies, Flash Cookies, or browsers (or related applications) provided on your computer or mobile devices.Collation of \"cookies\").", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73963, "text": "We and our third -party partners may collect your information through Cookies and use the information for the following uses:", "label": ["Important", "First Party Collection Information"], "rewrite": "We and our third -party partners may collect your information through Cookies."}
{"task": "rw_114.jsonl", "id": 73964, "text": "1. Remember your identity.", "label": ["Usage"], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73965, "text": "For example: cookies or similar technologies help us identify your identity as our registered user, or save you to provide us with your preferences or other information;", "label": ["Important", "Usage"], "rewrite": "Cookies or similar technologies are used to identify your identity or save your personalized information."}
{"task": "rw_114.jsonl", "id": 73966, "text": "2. Ensure the safety of products and services.", "label": ["Usage"], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73967, "text": "We can use cookies or similar technologies to make us confirm whether you are safely logging in to the service, or whether you encounter illegal behaviors such as stolen or fraud;", "label": ["Important", "Usage"], "rewrite": "We can use cookies or similar technologies to confirm whether logging in is safe and illegal."}
{"task": "rw_114.jsonl", "id": 73968, "text": "(2) Third -party partners collect and use your information through cookies are not subject to this policy, but are subject to their own information protection statements. We do not assume responsibility for third -party Cookies or similar technologies.", "label": ["Important"], "rewrite": "Third -party partners collect and use your information through cookies are not subject to this policy, and we do not take responsibility for this."}
{"task": "rw_114.jsonl", "id": 73969, "text": "Fourth, the protection of personal information", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73970, "text": "(1) Storage", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73971, "text": "In addition to laws and regulations or regulatory authorities, we only store your personal information in the purpose of this policy's purpose and shortest time limit.", "label": ["Data Retention", "Important"], "rewrite": "Reserves your personal information within the time limit required for the purpose of the cost of reaching the cost of the cost, unless the law has other requirements."}
{"task": "rw_114.jsonl", "id": 73972, "text": "If our products have terminated operations, we will make notice in advance.", "label": ["Important", "Cessation of Operations"], "rewrite": "We will announce the termination operation of the product in advance."}
{"task": "rw_114.jsonl", "id": 73973, "text": "After exceeding the storage period, we will delete or processes your personal information, but national laws, regulations, regulations, standardized documents, or government policies and orders have other requirements or to fulfill our compliance obligationsExcept for your personal information.", "label": ["Data Retention", "Important"], "rewrite": "After exceeding the storage period, you will delete your personal information or perform anonymous processing, except for other provisions of laws and regulations."}
{"task": "rw_114.jsonl", "id": 73974, "text": "In principle, the personal information we collected and generated in the territory of the People's Republic of China will be stored in the territory of the People's Republic of China.", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in domestic operations will be stored in China."}
{"task": "rw_114.jsonl", "id": 73975, "text": "If you need to transport your personal information cross -border, we will obtain your authorization consent alone.", "label": ["Data Retention", "Important"], "rewrite": "If you need to transport your personal information cross -border, we will obtain your authorization consent alone."}
{"task": "rw_114.jsonl", "id": 73976, "text": "After getting your authorization consent, your personal information may be transferred to overseas jurisdictions of your products or services where your products or services are located, or are accessed by these jurisdictions.", "label": ["Data Retention", "Important", "Risk"], "rewrite": "Your personal information may be transferred to the overseas jurisdiction of the country where the product or service is located, or it is accessed by these jurisdictions."}
{"task": "rw_114.jsonl", "id": 73977, "text": "There may be different data protection laws in such jurisdictions, and no relevant laws are set up.", "label": ["Important", "Risk"], "rewrite": "Even if there may be different data protection laws in overseas jurisdictions, and no relevant laws are set up, your personal information will be sufficiently protected in China."}
{"task": "rw_114.jsonl", "id": 73978, "text": "In such circumstances, your personal information will be sufficient to protect in the People's Republic of China.", "label": ["Risk"], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73979, "text": "Before cross -border data transfer, we will implement security measures such as data dementification.", "label": ["Important", "Data Security"], "rewrite": "Before cross -border data transfer, we will implement security measures such as data dementification."}
{"task": "rw_114.jsonl", "id": 73980, "text": "(2) Guarantee measures", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73981, "text": "This product will do everything in reasonable efforts to protect your personal information under the current technical level.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73982, "text": "To prevent your personal information from being illegally accessed, replicated, modified, transmitted, lost, lost, processed or used under unexpected and unauthorized circumstances.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73983, "text": "We use multi -directional security protection measures (including technical protection methods, management system measures, etc.) to ensure that your personal information protection treatment is reasonable.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73984, "text": "This product will adopt technical means such as encrypted technology (such as SSL), firewalls, restrictions on unauthorized access, de -identification or anonymous treatment to protect your personal information.", "label": ["Important", "Data Security"], "rewrite": "Use technologies such as SSL, firewall, restricting unauthorized access, de -identification or anonymous processing to protect your information."}
{"task": "rw_114.jsonl", "id": 73985, "text": "We will also continue to strengthen the construction of software security capabilities, such as completing some information encryption work locally to consolidate security transmission;", "label": ["Important", "Data Security"], "rewrite": "Complete part of the information encryption work in the equipment to consolidate security transmission."}
{"task": "rw_114.jsonl", "id": 73986, "text": "Understand the application information and running process information installed by your device to prevent malicious programs such as viruses and Trojans.", "label": ["Important", "Data Security"], "rewrite": "Understand the application information and running process information installed by your device to prevent malicious programs such as viruses and Trojans."}
{"task": "rw_114.jsonl", "id": 73987, "text": "However, please understand that due to the technical restrictions and various malicious means, in the Internet industry, even if you can do your best to strengthen security measures, it is impossible to ensure that the information is 100 % security.", "label": ["Important", "Data Security"], "rewrite": "Although there are security measures, it is impossible to fully guarantee that there is no security problem."}
{"task": "rw_114.jsonl", "id": 73988, "text": "You need to understand that the systems and communication networks you use to access our services may be due to factors outside of our controllable scope.", "label": ["Important", "Data Security"], "rewrite": "Systems and communication networks may have problems due to unprepared factors."}
{"task": "rw_114.jsonl", "id": 73989, "text": "We will continue to improve the relevant management system and establish related processes and organizations simultaneously to further protect your personal information and prevent your personal information from being accessed, used or disclosed by unauthorized personnel.", "label": ["Important", "Data Security"], "rewrite": "Continuously improve the relevant management system, establish relevant processes and organizations simultaneously to further protect information security and prevent information leakage."}
{"task": "rw_114.jsonl", "id": 73990, "text": "We will strictly restrict the scope of the personnel accessing information and sign a confidentiality agreement with the aforementioned personnel. Persons who violate the obligations of confidentiality will be punished in accordance with the management system.", "label": ["Important", "Data Security"], "rewrite": "Strictly restrict the scope of the personnel who access information, and sign a confidentiality agreement with them to punish those who violate the obligations of confidentiality."}
{"task": "rw_114.jsonl", "id": 73991, "text": "We will take all reasonable and feasible measures to ensure unrelated personal information.", "label": ["Important", "Data Security"], "rewrite": "Take all reasonable and feasible measures to ensure unrelated personal information."}
{"task": "rw_114.jsonl", "id": 73992, "text": "We will only retain your personal information within the time limit required by the cost of reaching the cost of the cost, unless you need to extend the retention period or be permitted by law.", "label": ["Data Retention", "Important"], "rewrite": "Reserves your personal information within the time limit required for the purpose of the cost of reaching the cost of the cost, unless the law has other requirements."}
{"task": "rw_114.jsonl", "id": 73993, "text": "(3) Safety event handling", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73994, "text": "If a personal information security incident occurs, we will inform you the basic situation of the security incident in time through the requirements of the laws and regulations, through the announcement, push notification, and the contact information you reserved.To minimize your losses or remedy your losses.", "label": ["Important", "Data Security"], "rewrite": "Timely inform you the basic situation and processing process of safety events to minimize losses or make up for losses."}
{"task": "rw_114.jsonl", "id": 73995, "text": "At the same time, we will also actively report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "The disposal of personal information security incidents will be reported in accordance with the requirements of the regulatory authorities."}
{"task": "rw_114.jsonl", "id": 73996, "text": "(4) Safety suggestions", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 73997, "text": "Although the above -mentioned reasonable and effective measures have been taken and the standards required by relevant laws have been adopted, they are limited by the existing technical restrictions. This product still cannot guarantee that your personal information can be controlled by an unsafe way or the parts that we can control.Safety during communication.", "label": ["Important", "Data Security"], "rewrite": "This product cannot guarantee the security of your personal information through unsafe ways or non -controllable links."}
{"task": "rw_114.jsonl", "id": 73998, "text": "Therefore, it is recommended that you take positive measures to ensure the security of personal information, such as setting complex passwords, modifying the account password regularly, and not disclosing personal information such as your account password to others.", "label": ["Important", "Data Security"], "rewrite": "It is recommended that you take positive measures to keep your password and other personal information to ensure personal information security."}
{"task": "rw_114.jsonl", "id": 73999, "text": "When you submit personal information to the website other than this product, you should try to avoid providing personal sensitive information and decide carefully.", "label": ["Important", "Data Security"], "rewrite": "Please try to avoid providing personal sensitive information to websites other than this product."}
{"task": "rw_114.jsonl", "id": 74000, "text": "If you find your personal information disclosure, especially your account password leak, please contact us immediately according to the contact information provided in this privacy policy so that we can take corresponding measures.", "label": ["Important", "Data Security"], "rewrite": "If the personal information discovered, please contact our customer service immediately."}
{"task": "rw_114.jsonl", "id": 74001, "text": "5. Your right to personal information", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 74002, "text": "We will exercise the following rights in accordance with relevant Chinese laws and regulations to ensure your personal information, but please understand that due to technical restrictions, laws or regulatory requirements, we may not be able to meet all your requirements:", "label": ["Important", "Edit/Control"], "rewrite": "We will exercise your right to your personal information in accordance with relevant Chinese laws and regulations, but due to technical restrictions, laws or regulatory requirements, you may not meet all requirements."}
{"task": "rw_114.jsonl", "id": 74003, "text": "(1) Query, correction", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 74004, "text": "You can log in to your account at any time to view, correct account settings and information.", "label": ["Important", "Edit/Control"], "rewrite": "You can log in to your account at any time to view, correct account settings and information."}
{"task": "rw_114.jsonl", "id": 74005, "text": "If you find that the information is wrong, inaccurate or incomplete, and hope to correct and supplement your personal information reserved in our system, you can log in to the account to modify your account information in your account settingsThe contact information of the column proposes objection and requests us to correct and supplement.", "label": ["Important", "Edit/Control"], "rewrite": "You can modify your account information in your account settings or contact us to correct and supplement."}
{"task": "rw_114.jsonl", "id": 74006, "text": "But for security and identity identification (such as number appeal services), you may not be able to modify some initial registration information and verification information provided by registration.", "label": ["Important", "Edit/Control"], "rewrite": "You may not be able to modify some initial registration information and verification information provided during registration."}
{"task": "rw_114.jsonl", "id": 74007, "text": "If you cannot correct it through the above way, you can contact us in accordance with the contact information agreed in Article 9 (in general, we will reply to your request within 15 working days).", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_114.jsonl", "id": 74008, "text": "(2) Delete", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 74009, "text": "You can contact us in accordance with the following circumstances, and contact us in accordance with the contact information agreed in Article 9, and make a request to delete personal information (in general, we will reply to your request within 15 working days)Essence", "label": ["Important", "Edit/Control"], "rewrite": "In the following circumstances, you can make a request to delete personal information: (1) If our behavior of handling personal information violates laws and regulations; (2) If we collect and use your personal information, it has not obtained your consent.; (3) If our behavior of handling personal information violates your agreement; (4) If you no longer use our products or services, or you cancel the account; (5) If we no longer provide you with a product orServe."}
{"task": "rw_114.jsonl", "id": 74010, "text": "(1) If our behavior of handling personal information violates laws and regulations;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_114.jsonl", "id": 74011, "text": "(2) If we collect and use your personal information, it has not obtained your consent;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_114.jsonl", "id": 74012, "text": "(3) If our behavior of handling personal information violates your agreement;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_114.jsonl", "id": 74013, "text": "(4) If you no longer use our products or services, or you cancel your account;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_114.jsonl", "id": 74014, "text": "(5) If we no longer provide products or services for you.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_114.jsonl", "id": 74015, "text": "If we decide to respond to your deletion request, we will also promptly notify the entities that obtain your personal information in a timely manner, asking them to delete them in time, unless the laws and regulations have other regulations, or these entities have obtained your independent authorization.", "label": ["Edit/Control", "Important"], "rewrite": "When we delete your personal information, it will require the entity that obtains your personal information to delete in time, unless laws and regulations have other regulations or you have authorized it alone."}
{"task": "rw_114.jsonl", "id": 74016, "text": "When you delete the information from our services, we may not back up the corresponding information in the system, but will delete these information when the backup is updated.", "label": ["Important", "Edit/Control"], "rewrite": "Delete the information you require delete in the backup update."}
{"task": "rw_114.jsonl", "id": 74017, "text": "(3) Logging out", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 74018, "text": "You can log in to Xiaoyao.com-personal center-cancellation account or in this product to cancel your registered Jinshan Pass account through the user center-security center, but once you cancel your account, you will no longer use the account corresponding product service.", "label": ["Important", "Edit/Control"], "rewrite": "You can cancel the account by logging in to Xiaoyao.com-personal center-cancellation account or in this product through the user center-security center."}
{"task": "rw_114.jsonl", "id": 74019, "text": "And your information and account -related data will be deleted or anonymous after the account is canceled, so please do it carefully.", "label": ["Edit/Control", "Important"], "rewrite": "Your information and account -related data will be deleted or anonymous after the account cancellation."}
{"task": "rw_114.jsonl", "id": 74020, "text": "If you cannot cancel it in the above way, you can contact us in accordance with the contact information agreed in Article 9, and make a request for the cancellation of the account (in general, we will reply to your request within 15 working days).", "label": ["Important", "Edit/Control"], "rewrite": "You can cancel the account by contact us."}
{"task": "rw_114.jsonl", "id": 74021, "text": "If you log in quickly through a third -party account, you will need to contact the third party to deal with the cancellation account.", "label": ["Important", "Edit/Control"], "rewrite": "If you log in quickly through a third -party account, you will need to contact the third party to deal with the cancellation account."}
{"task": "rw_114.jsonl", "id": 74022, "text": "(4) Withdrawing authorization", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 74023, "text": "You can apply through the settings of this product or mobile device (close the corresponding permissions, close some functional options) or apply for the withdrawal of your authorization in accordance with laws and regulations.", "label": ["Important", "Edit/Control"], "rewrite": "You can apply for withdrawal authorization through the setting of this product or mobile device or in accordance with laws and regulations."}
{"task": "rw_114.jsonl", "id": 74024, "text": "If you withdraw your authorization, it will not affect your personal information processing before withdrawing. After you withdraw, we may not be able to continue to provide you with the corresponding service content.", "label": ["Edit/Control", "Important"], "rewrite": "Withdrawal authorization will not affect personal information processing based on previous authorization."}
{"task": "rw_114.jsonl", "id": 74025, "text": "If you cannot withdraw authorization through the above way, you can contact us in accordance with the contact information agreed in Article 9 (in general, we will reply to your request within 15 working days).", "label": ["Important", "Edit/Control"], "rewrite": "You can withdraw authorization by contacting us."}
{"task": "rw_114.jsonl", "id": 74026, "text": "(5) Reminder of exercise of rights", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 74027, "text": "In order to protect the security of the account, when you make aforemention, delete, cancel, and withdraw authorization, we may ask you to verify your identity.", "label": ["Important", "Edit/Control"], "rewrite": "You need to first correct, delete, cancel, and withdraw authorization through authentication."}
{"task": "rw_114.jsonl", "id": 74028, "text": "For your reasonable request, we do not charge fees in principle, but for multiple repeated and more reasonable requests, we may charge a certain cost fee as actual situation.", "label": ["Important", "Edit/Control"], "rewrite": "Reasonable requests are not charged in principle without charging and exceeding the reasonable limit."}
{"task": "rw_114.jsonl", "id": 74029, "text": "We may refuse to reject those who have no repetition, need too much technical means, bring risks or very unrealistic requests to others.", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "We may refuse to repeat for unseen, need too much technical means, bring risks or very unrealistic requests to others' legitimate rights and interests."}
{"task": "rw_114.jsonl", "id": 74030, "text": "(6) Exceptions", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 74031, "text": "When involving the following situation, we may not be able to respond to your decision, etc.", "label": ["Important", "Edit/Control"], "rewrite": "When involving the following situation, we may not be able to respond to your decision, etc."}
{"task": "rw_114.jsonl", "id": 74032, "text": "(1) Directly related to national security and national defense security;", "label": ["Important", "Edit/Control"], "rewrite": "(1) Directly related to national security and national defense security;"}
{"task": "rw_114.jsonl", "id": 74033, "text": "(2) Directly related to public safety, public health, and major public interests;", "label": ["Important", "Edit/Control"], "rewrite": "(2) Directly related to public safety, public health, and major public interests;"}
{"task": "rw_114.jsonl", "id": 74034, "text": "(3) Directly related to criminal investigation, prosecution, trial, and execution judgment;", "label": ["Important", "Edit/Control"], "rewrite": "(3) Directly related to criminal investigation, prosecution, trial, and execution judgment;"}
{"task": "rw_114.jsonl", "id": 74035, "text": "(4) We have sufficient evidence that you have subjective malicious or abuse of rights (such as your request will endanger public safety and the legitimate rights and interests of others, or your request exceeds the scope of general technical means and commercial costs);", "label": ["Important", "Edit/Control"], "rewrite": "(4) We have sufficient evidence that you have subjective malicious or abuse of rights;"}
{"task": "rw_114.jsonl", "id": 74036, "text": "(5) The request to respond to the subject of the personal information will cause the legitimate rights and interests of you or other individuals and organizations to be seriously damaged;", "label": ["Important", "Edit/Control"], "rewrite": "(5) The request to respond to the subject of the personal information will cause the legitimate rights and interests of you or other individuals and organizations to be seriously damaged;"}
{"task": "rw_114.jsonl", "id": 74037, "text": "(6) Involved in business secrets.", "label": ["Important", "Edit/Control"], "rewrite": "(6) Involved in business secrets."}
{"task": "rw_114.jsonl", "id": 74038, "text": "6. Special protection for personal information of minors (including children)", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 74039, "text": "We attach great importance to the protection of personal information of minors. We have actively actively protect the legitimate rights and interests of minors by enabling the requirements of national defense addiction policy.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_114.jsonl", "id": 74040, "text": "We will determine whether the real -name information of the relevant account is minor through information verification such as real -name identity, and then decide whether to incorporate this account into the anti -addiction system.", "label": ["Specific Audiences", "Important"], "rewrite": "Determine whether it is a minor by verifying information such as the real name identity, and decide whether to be included in the anti -addiction system."}
{"task": "rw_114.jsonl", "id": 74041, "text": "In addition, we will collect information such as your login time and game duration. By automatic intervention from the system level and restricting the game time of minors, enabled and compulsory offline functions to guide minors to make reasonable games and help minors healthy access to the InternetEssence", "label": ["Specific Audiences", "First Party Collection Information", "Usage", "Important"], "rewrite": "Collect information such as login time, game duration, etc., automatically intervention and restrict the game time of minors at the system level, and enable the forced offline function."}
{"task": "rw_114.jsonl", "id": 74042, "text": "At the same time, in order to better protect the physical and mental health of the minor and promote the healthy access of minors, we may implement stricter anti -addiction measures on the basis of the state's relevant national online game anti -addiction policy regulations.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_114.jsonl", "id": 74043, "text": "At the same time, we also continue to study and test new technologies that protect minors.", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 74044, "text": "For example, in order to further improve the accuracy of real -name authentication and prevent minors from using the identity information of others, we may be in some games or for some users (based on specific game strategies) (if you log in to the game when you log in to the game, Or when the game recharge, consumption, or trading) during the game), enable face recognition verification (if the face recognition is enabled, we will use the face recognition function provided by Tencent Cloud or Alibaba Cloud to bring your relevant real name identity identityInformation, face images, and video information are provided to Tencent Cloud or Alibaba Cloud for face recognition).", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Important", "First Party Collection Information", "Usage"], "rewrite": "When using face recognition, use Tencent Cloud or Alibaba Cloud to collect real identity information for identity verification to further improve the accuracy of real -name authentication."}
{"task": "rw_114.jsonl", "id": 74045, "text": "The above -mentioned face recognition verification mainly compares the real -name authentication information with the user's real facial information with the data source of the police's authoritative data platform. If the comparison result is consistent, that is, successfully pass the certification, and match the corresponding game time limit according to the actual age group of the user.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Usage", "Important"], "rewrite": "Face recognition results are used to match the corresponding game time limit according to the actual age group."}
{"task": "rw_114.jsonl", "id": 74046, "text": "If the resulting result is inconsistent or the user refuses to verify, we regard it as a 12 -year -old minor, and the corresponding playable game time period and recharge limit will be limited (that is, only every Friday, Saturday, Sunday, and Sunday, and Sunday, and Sunday, and Sunday, and Sunday, and Sunday, and Sunday, and Sunday, and Sunday, and Sunday, and Sunday, and Sunday, and Sunday, and Sunday, and Sunday, and Sunday, and Sunday, and Sunday, and Sunday, and Sunday, and Sunday, and Sunday, and Sunday, and Sunday, and Sunday, and Sunday, and Sunday, and Sunday, and Sunday, and Sunday, and Sunday, and Sunday, and Sunday, and Sunday, and Sunday, and Sunday, and Sunday, and Sunday, and Sunday, and Sunday, Sunday, Sunday, and Sunday,Log in to the game at 20: 00-21: 00 on the statutory holiday, the upper limit of the single recharge amount is 50 yuan, the amount of upper monthly recharge is 200 yuan), and the account number is included in the anti-induction supervision.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Usage", "Important"], "rewrite": "If the comparison result does not match or the user refuses to verify, we regard it as a 12 -year -old minor and restrict it."}
{"task": "rw_114.jsonl", "id": 74047, "text": "Related verification data for face recognition is only used for comparison of Tencent Cloud or Alibaba Cloud's authoritative data platforms after encryption, and we will not keep it.", "label": ["Data Retention", "Third Party Sharing/ Disclosure", "Specific Audiences", "Important"], "rewrite": "The relevant verification data of face recognition will not be retained, and after encryption, it is only used to compare with the data source of the authoritative data platform of Public Security."}
{"task": "rw_114.jsonl", "id": 74048, "text": "Although the definition of children and customs in various places is different, we will be dissatisfied. Anyone who is 14 years old is regarded as children.", "label": ["Specific Audiences", "Important"], "rewrite": "We regard anyone under the age of 14 as children."}
{"task": "rw_114.jsonl", "id": 74049, "text": "This product will protect personal information of minors in accordance with relevant laws and regulations and the provisions of this \"Privacy Policy\".", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 74050, "text": "For the protection of personal information under the age of 14, please refer to our \"Child Privacy Policy\".", "label": ["Specific Audiences", "Important"], "rewrite": "For the protection of personal information under the age of 14, please refer to our \"Child Privacy Policy\"."}
{"task": "rw_114.jsonl", "id": 74051, "text": "If you are a minor, please ask your guardian to read this privacy policy carefully before using the service of this product, and please make sure you use the product before using the consent of the guardian before using this product.", "label": ["Policy Change", "Specific Audiences", "Important"], "rewrite": "If you are a minor, please use our services after your parents or other guardians read this policy carefully."}
{"task": "rw_114.jsonl", "id": 74052, "text": "For the consent of the guardian to collect personal information of minors, we will only use or disclose this information if they are allowed to be allowed, the guardian clearly consent or protects the necessary minors.", "label": ["Specific Audiences", "Important"], "rewrite": "It will only collect personal information of minors without laws and regulations, parents or guardians clearly agree or protect the necessary minors."}
{"task": "rw_114.jsonl", "id": 74053, "text": "If you are a minor but failed to get the consent of your guardian, or if your guardian consent uses this product and provides us with information, please or your guardian will immediately stop using this product and contact us in timeEssence", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a minor but failed to get the consent of your guardian, or if your guardian consent uses this product and provides us with information, please or your guardian will immediately stop using this product and contact us in timeEssence"}
{"task": "rw_114.jsonl", "id": 74054, "text": "If you have obtained the consent of the guardian, please and your guardian to read the relevant provisions of user data collection in this policy and ensure that our personal data collection has obtained the consent of your guardian.", "label": ["Specific Audiences", "Important"], "rewrite": "If you have obtained the consent of the guardian, please and your guardian to read the data collection regulations in this policy and ensure that the data collection has obtained the consent of your guardian."}
{"task": "rw_114.jsonl", "id": 74055, "text": "Once we find that the collection of related data has not obtained the consent of your guardian, we will temporarily suspend the relevant services of this product to your related services and try to delete relevant data as soon as possible.", "label": ["Specific Audiences", "Important"], "rewrite": "If the personal information of minors was collected without the consent of the parents, he would try to delete relevant information as soon as possible."}
{"task": "rw_114.jsonl", "id": 74056, "text": "7. Application and modification of this \"Privacy Policy\"", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 74057, "text": "(1) Application of this \"Privacy Policy\"", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 74058, "text": "Except for some specific services, all our services are applicable to this policy.", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 74059, "text": "For specific personal information protection policies for certain services, we will more specifically explain how we use your personal information in these services.", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 74060, "text": "The personal information protection policy of these specific services constitutes part of the cost.", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 74061, "text": "If the personal information protection policy of related specific services is inconsistent with this policy, the personal information protection policy for the specific service is applicable.", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 74062, "text": "(2) Modification of this \"Privacy Policy\"", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 74063, "text": "The content of this \"Privacy Policies\" may change due to changes in our business functions, changes in personal information, and changes in the way of contact with the person in charge of personal information protection. Without your clear consent, we will not reduce your privacy according to this privacy.Policies should enjoy the rights.", "label": ["Policy Change", "Important"], "rewrite": "After the policy is updated, we will not restrict your rights in accordance with this policy without your consent."}
{"task": "rw_114.jsonl", "id": 74064, "text": "Once the content of \"Privacy Policy\" changes, we will mainly expose the \"Privacy Policy\" after the amendment is announced on this page or on this page, or notify you through the way you are reserved, or appropriate ways such as pop -up windows;", "label": ["Policy Change", "Important"], "rewrite": "After the privacy policy is updated, the changed privacy policy will be displayed to you in the way you reserved, pop-up windows, etc. when you log in and update the version."}
{"task": "rw_114.jsonl", "id": 74065, "text": "The aforementioned announcement and notification behavior will be deemed to be notified that we have notified you to modify the content.", "label": ["Policy Change", "Important"], "rewrite": "The publication and notification of the privacy policy will be deemed that we have notified you of the revised content."}
{"task": "rw_114.jsonl", "id": 74066, "text": "If you do not agree with our amendments to the relevant provisions of this \"Privacy Policy\", you have the right to stop using this product.", "label": ["Policy Change", "Important"], "rewrite": "If you do not agree with the modification of the relevant terms of Privacy Policy, you have the right to stop using this product."}
{"task": "rw_114.jsonl", "id": 74067, "text": "8. Application and dispute resolution of law", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 74068, "text": "This \"Privacy Policy\" applies to the laws of the People's Republic of China (only for the purpose of this clause, excluding the laws of the Hong Kong Special Administrative Region, Macau Special Administrative Region and Taiwan), without regard to any conflict of laws.", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 74069, "text": "If you have related disputes with us, you should submit the lawsuit of the people's court where the product operator is registered.", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 74070, "text": "Nine, contact us", "label": [], "rewrite": []}
{"task": "rw_114.jsonl", "id": 74071, "text": "Our registered address is located in China (Hubei) Wuhan Donghu New Technology Development Zone No. 77 Financial Background Service Center Building Project No. 2 Phase 2.7 Phase 2.7 Building B24 401 401. If you have any opinions or any opinions on this \"Privacy Policies\" orSuggestions, or have any opinions, suggestions or complaints on your personal information access, modification, etc. (under normal circumstances, we will reply within 15 working days):", "label": ["Important", "Contact Information"], "rewrite": "Registration address: China (Hubei) Wuhan Donghu New Technology Development Zone No. 77 Financial Background Service Center Base Construction Project No. 2 Phase 2.7 Phase 2.7, B24, 401 Room 401 401"}
{"task": "rw_114.jsonl", "id": 74072, "text": "Contact information of our personal information protection officer: Tel: 028-85309940.", "label": ["Important", "Contact Information"], "rewrite": "Contact information of the person in charge of personal information protection: Tel: 028-85309940"}
{"task": "rw_114.jsonl", "id": 74073, "text": "In order to protect your personal information and your rights, we may ask you to verify your personal information or other rights.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_114.jsonl", "id": 74074, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
