{"task": "rw_109.jsonl", "id": 72791, "text": "Avaron Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72792, "text": "Update date: May 30, 2022", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72793, "text": "Avaron is a registered address of our company [Company Name: Beijing Xinghe Times Information Technology Co., Ltd.: No. 128, West side of the Central Archives of Hot Spring Town, Haidian District, Haidian District, BeijingFor short, \"We\" or \"Avaron\") provide services with services.", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72794, "text": "In addition to the \"Avaron Service Agreement\", we will further stroke you through the \"Avaron Privacy Policy\" (hereinafter referred to as \"this policy\") to explain that when we use Awaron, we collect, use, store, share, shareThe situation of personal information and the rights you enjoy, this policy is an important part of the Avaron Service Agreement.", "label": [], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72795, "text": "Avaron knows the importance of personal information to you and will do its best to protect your personal information security and reliable.", "label": [], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72796, "text": "We are committed to maintaining your trust in us, abiding by the following principles, and protecting your personal information: the principles of consistency and responsibility, the principle of clear purpose, the principle of minimal use of the principle, the principles of consent and consent, the principle of openness and transparency, and ensuring safety principles.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72797, "text": "At the same time, the Avaron platform promises that we will arrange the industry's mature security standards and take corresponding security measures to protect your personal information.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72798, "text": "Please read and understand this \"Privacy Policy\" before using our products.", "label": [], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72799, "text": "If you use the products or services we provide, it means that you have fully understood and agreed to what we described in this policy.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72800, "text": "This policy will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72801, "text": "1. How do we collect your personal information", "label": [], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72802, "text": "2. How can we share, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72803, "text": "3. How do we protect your personal information", "label": [], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72804, "text": "Fourth, your rights", "label": [], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72805, "text": "Fifth, personal information of minors", "label": [], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72806, "text": "6. Information storage", "label": [], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72807, "text": "Seven, policy updates", "label": [], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72808, "text": "8. How to contact us", "label": [], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72809, "text": "1. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72810, "text": "Personal information refers to a variety of information that can identify specific natural persons or reflects the activity of specific natural persons in a single or other information with other information.", "label": [], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72811, "text": "According to the principles of legal, correctness, and necessary, we collect and use your personal information in order to realize the following functions of this policy:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72812, "text": "(1) Meet the needs of network security guarantee and security risk control", "label": [], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72813, "text": "In order to ensure your normal use of Awaron's basic functions and normal services, optimize the performance of game product product performance according to your device terminal and network status, improve your game experience and ensure your account security, meet network security guarantee and security risk control, cope withAnti -cheating, anti -fraud, illegal and bad information management and other security risks, we will collect your equipment model, operating system version number, and sole device recognition symbol (IMEI refers to a stream of characters that are inserted into the device by equipment manufacturers, which can be used for used for it for use for it.Identify the corresponding devices in a unique way), the international mobile user identification code (IMSI), the login IP address, the way of accessing the network, the type and status of the network, the network quality and data, the operation log, the service log, the MAC address of the device, the storage and telephone permissionsSoftware installation list information.", "label": ["Data Security", "Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "Collect equipment model, operating system version number, unique device recognition symbol, international mobile user identification code, login IP address, method of access network, type and status, network quality and data, operation logs, service logs, equipment MAC addresses, storage and storage and storage and storage and storage and storage and storage and storage and storage and storage and storage and storagePhone permissions, software installation list information to provide services and ensure security."}
{"task": "rw_109.jsonl", "id": 72814, "text": "Please understand that this kind of information is the basis and necessary information that must be collected for services.", "label": [], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72815, "text": "We will not store the information we store in the analysis software with any personal identity information you provided in the application.", "label": [], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72816, "text": "(2) Registered account", "label": [], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72817, "text": "1. When you register an account on the Awaron APP, you need to provide us with your account name and mobile phone number.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you register your account on the Awaron APP, we will collect your account name and collect number."}
{"task": "rw_109.jsonl", "id": 72818, "text": "Collecting this information is to help you complete the Avaron account registration and real -name authentication. After registration verification and you read and agree to this policy and user agreement, you will complete the account registration.Participate in games, send barrage, comments and other functions.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your account name and mobile phone number to help you complete the Avaron account registration and real -name authentication."}
{"task": "rw_109.jsonl", "id": 72819, "text": "If you do not agree with authorization or rejecting the above information, you can still browse on the Avaron platform as a tourist, but you will not be able to enjoy the functions and services of other registered users.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you do not provide an account name and mobile phone number, you can only browse as a tourist."}
{"task": "rw_109.jsonl", "id": 72820, "text": "2. When you register or log in to the product through a third -party account (WeChat, QQ, Weibo), you need to authorize us to obtain the public information (including avatars, nicknames, gender) of the third -party account you used for logging in, and bring the account numberBind to your product account.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When registering and logging in with a third -party account, access and collect your personal information after your authorization, and bind it."}
{"task": "rw_109.jsonl", "id": 72821, "text": "If you do not agree with authorization or rejecting the above information, you will not be able to register or log in to the product through a third -party account, but it will not affect other functions of your normal use of the product.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide information on a third -party account, you cannot register and log in with a third -party account."}
{"task": "rw_109.jsonl", "id": 72822, "text": "3. After completing the product account registration, you can decide whether to improve your avatar, nickname, gender, birthday, region, personalized signature and other account information.", "label": ["Important", "Edit/Control"], "rewrite": "You can decide whether to improve your avatar, nickname, gender, birthday, region, personalized signature and other account information."}
{"task": "rw_109.jsonl", "id": 72823, "text": "If you improve the above additional information, it will help us provide you with better services and experiences, but if you do not provide the above information, it will not affect the basic functions of the product.", "label": [], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72824, "text": "(3) Real -name authentication user authentication", "label": [], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72825, "text": "According to relevant national regulations, you need to complete the real -name identity certification. We will collect real identity information such as your name, ID number, etc. for account registration and login. This information is sensitive information. The collection of this information is to meet the relevant national regulations.Live publisher conducts authentication and use.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect real identity information such as your name, identity document number, etc. for authentication."}
{"task": "rw_109.jsonl", "id": 72826, "text": "If you don't agree with us to collect the above information, you will not be able to complete the real -name authentication, nor can it be used on the Avaron platform to use our products and services or restricted.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you do not provide your name and ID number, you cannot complete the real -name authentication and limited use."}
{"task": "rw_109.jsonl", "id": 72827, "text": "(4) Provide functions or services related to recharge consumption", "label": [], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72828, "text": "When you use the consumption function of Awaron products, we will collect information such as your recharge records, consumption records, etc., so that you can check your transaction records and protect your virtual items to the greatest extent.", "label": ["Data Security", "First Party Collection Information"], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72829, "text": "The above information is sensitive information, but the collection of the above information is necessary to realize the relevant functions, otherwise the transaction will not be completed.", "label": [], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72830, "text": "(5) Realize personal dynamic sharing function", "label": [], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72831, "text": "When you use comments, dynamics, and photo wall functions, the text, pictures, voice, short videos, and likes information you upload will be stored in our server because storage is necessary to achieve this function.", "label": ["Data Retention", "Important", "First Party Collection Information"], "rewrite": "Collect and store the text, pictures, voice, short videos, likes, and like information you uploaded so that you can use comments, dynamics, and photo wall functions."}
{"task": "rw_109.jsonl", "id": 72832, "text": "You can delete this information at any time.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72833, "text": "Unless you choose or comply with relevant laws and regulations, we will not provide the above information or use it for other purposes other than this function.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not take the initiative to provide the information you publish or use it for other purposes."}
{"task": "rw_109.jsonl", "id": 72834, "text": "Please note that the information you post may involve personal information or even sensitive personal information of you or others. If you choose to upload pictures containing personal information, please consider more carefully whether to share or even make it public when using our services Share relevant information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Edit/Control"], "rewrite": "Please consider whether to share or even publicly publicize the relevant information including personal sensitive information."}
{"task": "rw_109.jsonl", "id": 72835, "text": "(6) Provide personalized recommendations, display or push services and provide corresponding exit mechanisms", "label": [], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72836, "text": "1. In order to provide you with personalized content display and push, and improve the user experience, we will collect and use your personal information to analyze and understand your partial number through automatic decision -making, so as to provide you with targeted content displayAnd push.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect and use personal information for automation decision analysis and understand your preferences."}
{"task": "rw_109.jsonl", "id": 72837, "text": "Please know that personalized recommendations in this game product will not identify the true identity of specific natural persons, but only provide more information content based on user behavior and characteristics.", "label": ["Important", "Usage"], "rewrite": "Personalized recommendations in this product will not identify the true identity of a specific natural person."}
{"task": "rw_109.jsonl", "id": 72838, "text": "2. You can always enter my-settings-open or cancel \"personalized recommendation\".", "label": ["Important", "Edit/Control"], "rewrite": "You can enter my-settings-open or cancel \"personalized recommendation\"."}
{"task": "rw_109.jsonl", "id": 72839, "text": "You need to show us that the location of the device is located so that we can recommend the game content or dynamics of the \"city\" users based on your geographical location, and make your game content or dynamics be presented on the \"city\" page.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect the location information you voluntarily provide to recommend the game content or news of users in the same city, and display your game content or news."}
{"task": "rw_109.jsonl", "id": 72840, "text": "The \"City\" channel will recommend users where the city is being played according to your real -time geographical location.", "label": ["Important", "Usage"], "rewrite": "The \"City\" channel recommends that your city is playing games based on real -time geographical location."}
{"task": "rw_109.jsonl", "id": 72841, "text": "Refusing to provide the location information and permissions of the device will affect our accurate positioning of your location and affect the realization of the \"city\" channel function, but it will not affect your normally use other functions of Awaron.", "label": ["Important", "First Party Collection Information"], "rewrite": "The location information of the device is refused to affected the realization of the \"city\" channel function, but it will not affect other functions."}
{"task": "rw_109.jsonl", "id": 72842, "text": "(7) When you use this game product service, we will collect your game log information, such as logging in logs, operation information, game -to -game information, dating information, item logs, etc., so that you can use all types of games normallyRelated functions and scenarios are also used for customer service complaint processing and game security and loopholes.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your game log information to provide game entertainment, complaint processing, and game security processing analysis."}
{"task": "rw_109.jsonl", "id": 72843, "text": "To ensure the consistency and stability of your game experience, we may synchronize the aforementioned information to the subsequent version of the game.", "label": ["Important", "Usage"], "rewrite": "Synchronous game log information to the follow -up version of the game."}
{"task": "rw_109.jsonl", "id": 72844, "text": "(8) In order to collect information to achieve the corresponding game functions and scenarios, we may apply for some system permissions to you in specific business scenarios. You can choose whether to authorize.", "label": ["Permission Acquisition", "Important"], "rewrite": "Under the specific business scenario, apply for some system permissions to collect information to achieve the corresponding functions and scenarios."}
{"task": "rw_109.jsonl", "id": 72845, "text": "The following lists the purpose, methods, and scope of the relevant permissions we will retrieve the relevant functions.", "label": [], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72846, "text": "The purpose, method, or scope of calling permissions calls", "label": [], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72847, "text": "Camera, start broadcasting in the game room, send dynamic photos, send private messages pictures, edit avatars", "label": ["Permission Acquisition", "Important"], "rewrite": "Get the camera permissions for the launch of the game room, dynamic photos, sending private messages, and editing avatars."}
{"task": "rw_109.jsonl", "id": 72848, "text": "Recording, private messaging voice, game rooms, wheat, game room", "label": ["Permission Acquisition", "Important"], "rewrite": "Get the recording right limits for private messages, macaros, and game rooms."}
{"task": "rw_109.jsonl", "id": 72849, "text": "Positioning, sending the dynamics containing positioning, displaying the current position during the game, and displaying the current position to other users", "label": ["Permission Acquisition", "Important"], "rewrite": "Obtain positioning permissions for sending dynamics containing positioning, displaying the current position when the game, and displaying the current position to other users."}
{"task": "rw_109.jsonl", "id": 72850, "text": "Reading and storage permissions, dynamics, photography, viewing, real -name authentication, saving pictures, Weibo login, editing avatars", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "Reading and writing storage rights are limited to dynamics, photos, watching, real -name authentication, preservation of pictures, Weibo login, editing avatars."}
{"task": "rw_109.jsonl", "id": 72851, "text": "*The above permissions will not be opened by default. We will only apply to you in specific business scenarios to apply for the above permissions*.", "label": ["Permission Acquisition", "Important"], "rewrite": "The cameras, recording, and reading and storage permissions will not be opened by default. We will only apply to you in specific business scenarios to apply for the above permissions."}
{"task": "rw_109.jsonl", "id": 72852, "text": "Rejecting the above permissions will only affect the specific game functions and business scenarios that are related to it, and will not affect your other functions of using the game.", "label": [], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72853, "text": "Please understand that with the reasons of different terminal equipment operating systems, the permissions names on different terminals will be different.", "label": [], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72854, "text": "You can manage system permissions through the terminal device [Settings] page.", "label": ["Important", "Edit/Control"], "rewrite": "You can manage system permissions through the terminal device [Settings] page."}
{"task": "rw_109.jsonl", "id": 72855, "text": "2. How can we share, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72856, "text": "(1) Sharing, you can share your relevant information with your friends, family and other users through our services.", "label": ["Edit/Control", "Important"], "rewrite": "You can share your relevant information with your friends, family and other users."}
{"task": "rw_109.jsonl", "id": 72857, "text": "For example, the text and photos you publicly shared on the Avaron platform.", "label": ["Edit/Control", "Important"], "rewrite": "Text and photos that you can share publicly on the Avalon platform."}
{"task": "rw_109.jsonl", "id": 72858, "text": "Please note that this may include sensitive information such as your personal identity information and personal property information.", "label": [], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72859, "text": "You can control the scope of your sharing information through the privacy settings in our service. You can also delete the information you shared publicly through the service settings or the guidelines we provide.", "label": ["Important", "Edit/Control"], "rewrite": "The privacy settings in our service can control the scope of the information and delete the information you shared publicly."}
{"task": "rw_109.jsonl", "id": 72860, "text": "But please note that this information may still be stored independently by other users or non -associated third parties that are not controlled by us.", "label": ["Important", "Risk"], "rewrite": "The information you shared publicly may be stored independently by other users or non -associated third parties that are not controlled by us."}
{"task": "rw_109.jsonl", "id": 72861, "text": "Please consider disclosing your relevant personal sensitive information.", "label": [], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72862, "text": "We will not share your personal information with any company, organization and individual other than Awaron Group Corporation, except the following situations: except:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not share your personal information with any company, organization and individual other than Awaron Group Corporation, except the following situations: except:"}
{"task": "rw_109.jsonl", "id": 72863, "text": "1. We may share your personal information to the outside world in accordance with laws and regulations, or in accordance with the mandatory requirements of the government authority.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "1. We may share your personal information to the outside world in accordance with laws and regulations, or in accordance with the mandatory requirements of the government authority."}
{"task": "rw_109.jsonl", "id": 72864, "text": "2. Shared with authorized partners: Only in order to achieve the purpose of this policy, some of our services will be provided by authorized partners.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "2. In order to achieve the purpose of this policy, we may share some of your personal information with our partners."}
{"task": "rw_109.jsonl", "id": 72865, "text": "We may share some of your personal information with our partners to provide better customer service and user experience.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72866, "text": "For example, when you buy our yield online, we must share your personal information with paying third parties to provide services to partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We share your personal information with the third party to provide you with product sales."}
{"task": "rw_109.jsonl", "id": 72867, "text": "We will only share your personal information for legal, correct, necessary, specific, and clear purposes, and only share the personal information necessary for providing services.", "label": ["Third Party Sharing/ Disclosure", "Data Security"], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72868, "text": "Our partners have no right to use the personal information they shared for any other purpose.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Our partners have no right to use the personal information they shared for any other purpose."}
{"task": "rw_109.jsonl", "id": 72869, "text": "At present, our authorized partners include the following categories: 1) Authorized partners of advertising and analysis of service categories.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72870, "text": "Unless you get your permission, we will not share your personal identity information with partners who provide advertising and analyzing services.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not share partners who provide advertising and analysis services without your personal identity information."}
{"task": "rw_109.jsonl", "id": 72871, "text": "We will provide these partners with information about their advertising coverage and effectiveness without providing your personal identity information, or we will summarize this information so that it will not identify you.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will provide advertising and analytical service partners with information about their advertising coverage and effectiveness or de -identifying personal information."}
{"task": "rw_109.jsonl", "id": 72872, "text": "2) Suppliers, service providers and other partners.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72873, "text": "We send information to suppliers, service providers, and other partners that support our business worldwide. These support include providing technical infrastructure services, analyzing the usage methods of our services, measuring the effectiveness of advertising and services, providing customers to provide customersServices, payment convenience or academic research and investigation.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "We share information with suppliers, service providers and other partners that support our business worldwide."}
{"task": "rw_109.jsonl", "id": 72874, "text": "For companies and organizations that share personal information with us, we will sign a strict confidentiality agreement with them, asking them to handle personal information in accordance with our instructions, privacy policies, and any other related related to security measures.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will sign a confidentiality agreement with sharing to process personal information in accordance with our instructions, this privacy policy, and other confidentiality and security measures."}
{"task": "rw_109.jsonl", "id": 72875, "text": "3), Our product integration of You alliance+(friendly privacy policy), individual push (push user privacy policy), Baidu positioning (Baidu positioning privacy policy), Xiaomi push (Xiaomi push privacy policy), Kingshan Yun (Jinshan CloudPrivacy policy), sound network SDK (sound network privacy policy), these SDKs need to collect your device MAC address, unique device recognition code (IMEI/Android, ID/IDFA/Openudid/Guid, SIM, card, information)Provide statistical analysis services, and provide basic anti -cheating capabilities and push services through the accuracy of geographical location data.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Our product integrates SDK needs to collect your device MAC address, the unique device recognition code to provide statistical analysis services, and provide basic anti -cheating capabilities and push services through the accuracy of geographical location report data."}
{"task": "rw_109.jsonl", "id": 72876, "text": "The following lists specific authorization partners and provide the third -party privacy policy link. Among them, it clearly shows the purpose, method, and scope of collecting personal information. We recommend that you read the privacy policy of the third party:", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72877, "text": "SDK Name Service Types (Demplasses) Personal Information Type Privacy Links", "label": [], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72878, "text": "Push SDK (Huawei Message Service, Huawei HMS, SDK, Agent, Huawei HMS core function, Meizu push, vivo push), push technical service, risk control, push and provides a collection and use in the process of collection and certification services collected and used.Information: 1. Equipment information: The device recognition code will be used to generate the unique client ID, that is, GYUID;", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Push SDK collection equipment information, application list information, network information, encrypted login information, and location related information are used to push technical services, risk control, and push a push to provide a risk control and certification services."}
{"task": "rw_109.jsonl", "id": 72879, "text": "Equipment platforms, equipment manufacturers, equipment brands, equipment models and other equipment related information helps us help developers better identify the current equipment, which will enhance our anti -fraud ability.", "label": ["Usage", "Third Party Sharing/ Disclosure", "First Party Collection Information"], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72880, "text": "2. Application list information, network information, encrypted login information, and*position*Related information: We can analyze the risk level of the current equipment through the above information, which can effectively identify various cheating behaviors, effectively identify risk equipment, and can be used to evaluate channel quality, Identify malicious brushing, malicious procedures, protect your account security, etc.", "label": ["Usage", "Third Party Sharing/ Disclosure", "First Party Collection Information"], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72881, "text": "Through the above information, we can help developers provide you with more secure services through our risk control and certification services.", "label": ["Important", "Usage"], "rewrite": "Use your information to provide you with more secure services."}
{"task": "rw_109.jsonl", "id": 72882, "text": "Push message push SDK: Message push service provider: Daily Interactive Co., Ltd. provides push technical services, we may make your equipment platform, equipment manufacturer, equipment brand, equipment identification code and other equipment information, apply list information, apply list information, and apply list information, and apply list information, and apply list information, and apply list information, list information, and apply list information, list information, and apply list information, and apply list information, and apply list information, and apply list information, and apply list information, and apply list information, and apply list information, and apply list information, and apply list information, and apply list information.Network information and location related information are provided to Daily Interactive Co., Ltd. to provide you with message push technical services.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Push message push SDK collecting device information, apply list information, network information, and location related information to provide message push technical services."}
{"task": "rw_109.jsonl", "id": 72883, "text": "When we push you a message to you, we may authorize daily interactive shares to conduct link adjustment and promote the closed SDK push process of each other to ensure that you can receive the messages we pushed you in time.", "label": ["Usage", "Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72884, "text": "For details, please visit \"Push User Privacy Policy\" (need to push the \"Pushing User Privacy Policy\" hyperchain to: https://docs.getui.com/privacy).https://docs.getui.com/privacy/", "label": [], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72885, "text": "Push one-key login SDK (Unicom SaaS-free login, mobile license login, China Telecom account certification, extreme one-click login, China Telecom-mobile phone number verification), one-click login, will collect your phone permissions, Sensor permissions, positioning (for risk recognition control purposes), etc., to help users log in to the mobile phone number on the login page, save the time for entering the mobile phone number to get the verification code.https://docs.getui.com/privacy/", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Push one -button login SDK to collect phone permissions, sensor permissions, positioning, etc. to help users realize one -click login."}
{"task": "rw_109.jsonl", "id": 72886, "text": "The use and device data collection of You alliance SDK, app, device information (IMEI/MAC/Android, ID/idfa/Openudid/GUID, SIM, Card, IMSI, Information), https://www.umeng.com/page/Policy", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Youmeng SDK collects device information for the use of apps and equipment data collection."}
{"task": "rw_109.jsonl", "id": 72887, "text": "Baidu positioning SDK (Baidu riding navigation, Baidu map, Baidu map API certification, Baidu map computing function), access Wi-Fi status, acquisition location, device information (IMei/Mac/AndroidId/idfa/Openudid/GUID, SIM, SIM, SIM, SIM, SIM, SIM, SIM, SIM, SIM, SIM,Card, IMSI, Information), https://lbsyun.baidu.com/index.php? Title = Open/Privacy", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Baidu Positioning SDK access Wi-Fi status and collect location and equipment information."}
{"task": "rw_109.jsonl", "id": 72888, "text": "Xiaomi push SDK, push technical service, device information= 1822", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Xiaomi push SDK collection equipment information to provide push technology services."}
{"task": "rw_109.jsonl", "id": 72889, "text": "Jinshan Cloud SDK, live broadcast push, streaming, transcoding, video, customer data, access records, application and behavioral logs except for statistical analysis of the operating status of the product operating status, it will not be used for other data analysis.Information data will not be provided to third parties.All data in the data centers of the domestic data centers in Jinshan Cloud will not be used by overseas data centers, nor is it used for overseas business or data analysis.https://docs.ksyun.com/documens/5230", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Jinshan Cloud SDK collects customer data, access records, applications and behavioral logs stored in the country for statistical analysis of product operation status and will not be provided to third parties."}
{"task": "rw_109.jsonl", "id": 72890, "text": "The same shield SDK, risk control, equipment related information, including IP addresses, operating system information, and sensor permissions.https://www.tongdun.cn/other/privacy/id=1", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "The relevant information of the same shield SDK collection device is used for risk control."}
{"task": "rw_109.jsonl", "id": 72891, "text": "Tencent RTMP Push SDK (Tencent Video Communication Function, Tencent Cloud Short Video SDK), live, Lianmai, see the right link for details.https://cloud.tencent.com/document/product/267/32732", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Tencent RTMP push SDK is used for live broadcast and Lianmai."}
{"task": "rw_109.jsonl", "id": 72892, "text": "See the linked on the right side for the sound network live broadcast and Lianmai.https://www.agora.io/cn/privacy-policy", "label": ["Usage"], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72893, "text": "Alipay SDK (device logo generate library, Alipay security), payment function, see the right link for details.https://opendocs.alipay.com/open/54/01g6qm", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Alipay SDK is used for payment function implementation."}
{"task": "rw_109.jsonl", "id": 72894, "text": "Sina Weibo SDK, authorize login, see the right link for details.https://open.weibo.com/wiki/ Developer Agreement", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Sina Weibo SDK is used to authorize login."}
{"task": "rw_109.jsonl", "id": 72895, "text": "Bugly, SDK, stability monitoring, see the right link for details.https://stative.bugly.qq.com/bugly-sdk- privacy-statement.pdf", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Bugly SDK is used for stability monitoring."}
{"task": "rw_109.jsonl", "id": 72896, "text": "QQ login and share, see the right link for details.https://wiki.connect.qq.com/qq connected SDK privacy protection statement", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "QQ login is used for sharing."}
{"task": "rw_109.jsonl", "id": 72897, "text": "Firebase, Google statistics, see the right link for details.https://firebase.google.com/support/privacy?", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Firebase is used for Google statistics."}
{"task": "rw_109.jsonl", "id": 72898, "text": "hl=zh-cn", "label": [], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72899, "text": "The mobile security alliance is unified QAID, statistics, see the right link for details.http://www.msa- alliance.cn/col.jsp?", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "The unified QAID of the mobile security alliance is used for statistics."}
{"task": "rw_109.jsonl", "id": 72900, "text": "id=120", "label": [], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72901, "text": "(2) Transfer, we will not transfer your personal information to any company, organization, and individual, but the following situations, except: 1. In the case of obtaining a clear consent: After obtaining your clear consent, we will go to itOther parties transfer your personal information;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not transfer your personal information to any company, organization, and individual, except for the following situations: 1. Transfer with clear consent;"}
{"task": "rw_109.jsonl", "id": 72902, "text": "2. When involving mergers, acquisitions or bankruptcy liquidation, if personal information is transferred, we will require new companies and organizations to continue to be subject to this privacy policy.Organization re -solicit authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When involving mergers, acquisitions or bankruptcy liquidation, if personal information transfer is involved, companies and organizations that require your personal information will continue to be subject to this policy. Otherwise, the company and organization will be required to re -authorize your authorization consent."}
{"task": "rw_109.jsonl", "id": 72903, "text": "(3) Public disclosure, we will only publicly disclose your personal information in the following circumstances:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only publicly disclose your personal information in the following circumstances:"}
{"task": "rw_109.jsonl", "id": 72904, "text": "1. After getting your clear consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "1. After getting your clear consent;"}
{"task": "rw_109.jsonl", "id": 72905, "text": "2. Based on legal disclosure: In the case of compulsory requirements of legal, legal procedures, litigation or government authorities, we may disclose your personal information publicly.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "2. Based on legal disclosure;"}
{"task": "rw_109.jsonl", "id": 72906, "text": "three.How do we protect your personal information", "label": [], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72907, "text": "(1) We strive to provide guarantees for user information security to prevent information loss, improper use, unauthorized access or disclosure.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72908, "text": "We will use various security protection measures within a reasonable security level to ensure information security.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72909, "text": "For example, we will use encryption technology (for example, SSL), anonymous processing and other means to protect your personal information.", "label": ["Important", "Data Security"], "rewrite": "Use encryption technology (for example, SSL), anonymous processing and other means to protect personal information."}
{"task": "rw_109.jsonl", "id": 72910, "text": "We have continuously enhanced the security capabilities of software installed on your device through continuous improvement to prevent your personal information leakage.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72911, "text": "For example, we will complete some information encryption in your device for security transmission;", "label": ["Important", "Data Security"], "rewrite": "Complete some information encryption in the device to transmit some information encryption."}
{"task": "rw_109.jsonl", "id": 72912, "text": "To prevent viruses, Trojan programs or other malicious programs, websites, you will understand the application information installed by your device or the process information that is being running.", "label": ["Important", "Data Security"], "rewrite": "Understand the application information of the device or the processing information that is running to prevent viruses, Trojan programs or other malicious programs."}
{"task": "rw_109.jsonl", "id": 72913, "text": "(2) We will take all reasonable and feasible measures to ensure unrelated personal information.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72914, "text": "We will only retain your personal information within the time limit required by the cost of reaching the cost of the cost, unless you need to extend the retention period or be permitted by law.", "label": ["Important", "Data Security"], "rewrite": "Reserves your personal information within the time limit required for the service purpose, unless the law has other requirements."}
{"task": "rw_109.jsonl", "id": 72915, "text": "(3) The Internet is not an absolutely secure environment, and email, instant messaging, and communication methods with other Awaron users are not encrypted. We strongly recommend that you do not send personal information in this way.", "label": ["Important", "Data Security"], "rewrite": "It is recommended that you do not send personal information through emails, instant messaging, and other non -encrypted methods."}
{"task": "rw_109.jsonl", "id": 72916, "text": "Please use complex passwords to help us guarantee your account security.", "label": ["Important", "Data Security"], "rewrite": "Please use complex passwords to help us guarantee your account security."}
{"task": "rw_109.jsonl", "id": 72917, "text": "(4) We establish a special management system, process and organization to ensure the security of information.", "label": ["Important", "Data Security"], "rewrite": "Establish a special management system, process and organization to ensure information security."}
{"task": "rw_109.jsonl", "id": 72918, "text": "For example, we strictly restrict the scope of the personnel of access information and require them to obey the confidentiality obligations.", "label": ["Important", "Data Security"], "rewrite": "Strictly restrict the scope of the personnel of access information, and requires it to comply with confidentiality obligations."}
{"task": "rw_109.jsonl", "id": 72919, "text": "(5) If security incidents such as personal information leakage occur, we will start emergency plans to prevent the expansion of security incidents. In accordance with the requirements of laws and regulations, inform you in a timely manner, letter, telephone, push notification, etc.And possible influence, we have taken the disposal measures that may be adopted, your advice that can prevent and reduce risks, remedy measures, etc.", "label": ["Important", "Data Security"], "rewrite": "Inform you in a timely manner that the basic situation and possible impact of safety events, handling measures that have been taken or will be adopted, suggestions that can prevent and reduce risks, and remedy measures."}
{"task": "rw_109.jsonl", "id": 72920, "text": "Avaron passed the evaluation and filing of the national network security level protection (level 2), and has the corresponding data security and information protection capabilities.", "label": ["Important", "Data Security"], "rewrite": "Avaron passed the evaluation and filing of the national network security level protection (level 2)."}
{"task": "rw_109.jsonl", "id": 72921, "text": "Four.Your rights", "label": [], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72922, "text": "In accordance with China's relevant laws, regulations, standards, and the practice of other countries and regions, we guarantee that you exercise the following rights on your personal information:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72923, "text": "(1) Visit, modify and delete information", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72924, "text": "You can access, modify and delete the registration information and other personal information in the process of using our service.", "label": ["Important", "Edit/Control"], "rewrite": "You can access, modify and delete your registration information and other personal information."}
{"task": "rw_109.jsonl", "id": 72925, "text": "The scope and way you visit, modify and delete personal information will depend on the specific services you use.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72926, "text": "We will collect and use your information in accordance with the functions of our products or services in accordance with the functions of our products or services.", "label": [], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72927, "text": "If you find that we violate the provisions of laws and administrative regulations or the agreed collection and use your personal information between the two parties, you can ask us to delete it.", "label": ["Important", "Edit/Control"], "rewrite": "You can ask us to delete your personal information of illegal or breach of contract collection and use."}
{"task": "rw_109.jsonl", "id": 72928, "text": "If you find that our personal information we collect and store is wrong, you can also ask us to correct it.", "label": ["Important", "Edit/Control"], "rewrite": "You can ask us to correct your wrong personal information."}
{"task": "rw_109.jsonl", "id": 72929, "text": "You can access, modify, and delete your information through the following methods:", "label": ["Important", "Edit/Control"], "rewrite": "You can access, modify, and delete your information through the following methods:"}
{"task": "rw_109.jsonl", "id": 72930, "text": "1. Log in to the Avaron Live APP, enter \"My\" →, access, modify, and delete information such as personal information and other information;", "label": ["Important", "Edit/Control"], "rewrite": "1. Log in to the Avaron Live APP and enter \"My\" → Access, modify, and delete information such as personal information and other information;"}
{"task": "rw_109.jsonl", "id": 72931, "text": "2. Log in to the Avaron Live APP, enter \"My\" →, (Settings button), select the corresponding setting option, access, modify or delete information such as account number and security, privacy settings;", "label": ["Important", "Edit/Control"], "rewrite": "2. Log in to the Avaron Live APP, enter \"My\" → (Settings button), select the corresponding setting option, access, modify or delete information such as account number and security, privacy settings;"}
{"task": "rw_109.jsonl", "id": 72932, "text": "3. In accordance with the public contact information listed at the end of this policy, get in touch with us.", "label": [], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72933, "text": "(2) Change the scope of your authorization consent", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72934, "text": "You have the right to withdraw the authorization of the consent. After the consent is withdrawn, we will no longer handle your corresponding personal information.", "label": ["Important", "Edit/Control"], "rewrite": "We will no longer deal with the corresponding personal information of your withdrawal."}
{"task": "rw_109.jsonl", "id": 72935, "text": "But your decision to recover the consent will not affect personal information processing based on your authorization.", "label": ["Important", "Edit/Control"], "rewrite": "The withdrawal permissions will not affect the information collection and use of information based on authorization."}
{"task": "rw_109.jsonl", "id": 72936, "text": "The client supports you to revoke the existing authorization. You can turn off the relevant privacy authorization in the \"mobile phone settings → permissions\", specifically:", "label": ["Important", "Edit/Control"], "rewrite": "Relevant privacy authorization can be closed in \"mobile phone settings → permissions\"."}
{"task": "rw_109.jsonl", "id": 72937, "text": "Android phone: Settings → Application → permissions", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72938, "text": "iOS mobile phone: setting → privacy → permissions → application", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72939, "text": "(3) How do we respond to your above request", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72940, "text": "When you visit, modify or delete related information or accounts, we may ask you to verify your identity to ensure the security of the account.", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "When you visit, modify or delete related information or accounts, we may ask you to verify your identity."}
{"task": "rw_109.jsonl", "id": 72941, "text": "Please understand that due to technical restrictions, laws or regulatory requirements, we may not be able to meet all your requirements, and we will answer your request within a reasonable period.", "label": ["Important", "Edit/Control"], "rewrite": "If we cannot meet your requirements for accessing, modifying or deleting relevant information or accounts, you will reply to your request in a reasonable period."}
{"task": "rw_109.jsonl", "id": 72942, "text": "At the same time, in accordance with relevant laws and regulations and national standards, in the following circumstances, we may not be able to respond to your request:", "label": ["Important", "Edit/Control"], "rewrite": "According to relevant laws and regulations and national standards, in the following situations, we may not be able to respond to your request:"}
{"task": "rw_109.jsonl", "id": 72943, "text": "1. Directly related to national security and national defense security;", "label": ["Edit/Control", "Important"], "rewrite": "1. Directly related to national security and national defense security;"}
{"task": "rw_109.jsonl", "id": 72944, "text": "2. Directly related to public safety, public health, and major public interests;", "label": ["Important", "Edit/Control"], "rewrite": "2. Directly related to public safety, public health, and major public interests;"}
{"task": "rw_109.jsonl", "id": 72945, "text": "3. Directly related to criminal investigation, prosecution, trial, and execution judgment;", "label": ["Important", "Edit/Control"], "rewrite": "3. Directly related to criminal investigation, prosecution, trial, and execution judgment;"}
{"task": "rw_109.jsonl", "id": 72946, "text": "4. There is sufficient evidence that you have subjective malice or abuse of rights;", "label": ["Important", "Edit/Control"], "rewrite": "4. There is sufficient evidence that you have subjective malice or abuse of rights;"}
{"task": "rw_109.jsonl", "id": 72947, "text": "5. Response your request will cause serious damage to the legitimate rights and interests of other individuals and organizations;", "label": ["Important", "Edit/Control"], "rewrite": "5. Response your request will cause serious damage to the legitimate rights and interests of other individuals and organizations;"}
{"task": "rw_109.jsonl", "id": 72948, "text": "6. Involving business secrets.", "label": ["Edit/Control", "Important"], "rewrite": "6. Involving business secrets."}
{"task": "rw_109.jsonl", "id": 72949, "text": "(4) Logging out the account", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72950, "text": "Logging out: Mine-Settings-About us-cancellation account number", "label": ["Important", "Edit/Control"], "rewrite": "Logging out: Mine-Settings-About us-cancellation account number"}
{"task": "rw_109.jsonl", "id": 72951, "text": "Limited time: We will review your application within seven working days and cancel the eligible accounts.", "label": ["Important", "Edit/Control"], "rewrite": "Limited time: We will review your application within seven working days and cancel the eligible accounts."}
{"task": "rw_109.jsonl", "id": 72952, "text": "five.Personal information of minors", "label": [], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72953, "text": "Our products, websites and services are mainly adults.", "label": ["Important"], "rewrite": "Our products, websites and services are mainly adults."}
{"task": "rw_109.jsonl", "id": 72954, "text": "Without the consent of parents or guardians, minors may not create their own user accounts.", "label": ["Specific Audiences", "Important"], "rewrite": "Without the consent of parents or guardians, minors may not create their own user accounts."}
{"task": "rw_109.jsonl", "id": 72955, "text": "For the case of collecting personal information of minors with the consent of parents, we will only use or disclose this information if they are allowed to be allowed, parents or guardians to clearly consent or protect minors.", "label": ["Specific Audiences", "Important"], "rewrite": "For the case of collecting personal information of minors with the consent of parents, we will only use or disclose this information if they are allowed to be allowed, parents or guardians to clearly consent or protect minors."}
{"task": "rw_109.jsonl", "id": 72956, "text": "Although local laws and customs have different definitions of minors, we will be dissatisfied, 18, and anyone in the age of 18 is deemed to be minors.", "label": ["Specific Audiences", "Important"], "rewrite": "We regard anyone under the age of 18 as minors."}
{"task": "rw_109.jsonl", "id": 72957, "text": "If we find that we collect personal information of minors without the consent of parents who can be confirmed in advance, they will try to delete relevant data as soon as possible.", "label": ["Specific Audiences", "Important"], "rewrite": "If the personal information of minors was collected without the consent of the parents, he would try to delete relevant information as soon as possible."}
{"task": "rw_109.jsonl", "id": 72958, "text": "If you think we may not hold information about children, please contact us according to the public contact information listed at the end of this policy.", "label": ["Specific Audiences", "Important"], "rewrite": "If you think we may not hold information about children, please contact us."}
{"task": "rw_109.jsonl", "id": 72959, "text": "six.Information storage", "label": [], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72960, "text": "In principle, the personal information we collected and generated in the territory of the People's Republic of China will be stored in the territory of the People's Republic of China.", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in domestic operations will be stored in China.Except for the following situations: 1. Applicable laws have clear stipulation; 2. Get your clear authorization consent."}
{"task": "rw_109.jsonl", "id": 72961, "text": "Except for the following situations:", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72962, "text": "1. Applicable laws are clearly stipulated;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72963, "text": "2. Get your clear authorization consent.", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72964, "text": "We promise that the storage time of your personal information is always within a reasonable and necessary period.", "label": ["Data Retention", "Important"], "rewrite": "The storage time of personal information is always within a reasonable and necessary period."}
{"task": "rw_109.jsonl", "id": 72965, "text": "For personal information beyond the period, we will delete or do anonymous processing.", "label": ["Data Retention", "Important"], "rewrite": "Personal information exceeding the deadline is deleted or anonymous."}
{"task": "rw_109.jsonl", "id": 72966, "text": "When our products or services stop operation, we will notify you in the form of push notifications and announcements, and delete your personal information or perform anonymous processing within a reasonable period.", "label": ["Important", "Cessation of Operations"], "rewrite": "When the operation is stopped, the announcement will be announced in accordance with relevant laws and regulations, and personal information will be deleted or anonymous."}
{"task": "rw_109.jsonl", "id": 72967, "text": "seven.Policy update", "label": [], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72968, "text": "We may revise this guidelines in a timely manner.", "label": [], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72969, "text": "When the guidelines are changed, we will show you the changes in the form of push notifications and pop -ups when you log in and update.", "label": ["Policy Change", "Important"], "rewrite": "After the privacy policy is updated, you will show you the change of privacy policy after login and version update."}
{"task": "rw_109.jsonl", "id": 72970, "text": "Please note that only after you click the consent button in the pop -up window, we will collect, use, and store your personal information according to the updated guidelines.", "label": ["Policy Change", "Important"], "rewrite": "Only after you click the consent button in the pop -up window, will we collect, use, and store your personal information according to the updated guidelines."}
{"task": "rw_109.jsonl", "id": 72971, "text": "eight.How to contact us", "label": [], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72972, "text": "If you have any questions, opinions or suggestions on this privacy policy, please contact us through online customer service.", "label": [], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72973, "text": "You can also fill in the relevant information according to the guidelines we provide, send your question to the mailbox: tousu@myhug.cn or send it to the following address:", "label": ["Important", "Contact Information"], "rewrite": "Email: Tousu@myHug.cn"}
{"task": "rw_109.jsonl", "id": 72974, "text": "Company Name: Beijing Xinghe Times Information Technology Co., Ltd.", "label": ["Important", "Contact Information"], "rewrite": "Company Name: Beijing Xinghe Times Information Technology Co., Ltd."}
{"task": "rw_109.jsonl", "id": 72975, "text": "Address: Room 1701, Block F, No. 19, Beiyuan East Road, Chaoyang District, Beijing", "label": ["Important", "Contact Information"], "rewrite": "Address: Room 1701, Block F, No. 19, Beiyuan East Road, Chaoyang District, Beijing"}
{"task": "rw_109.jsonl", "id": 72976, "text": "Contact: Avaron Data and Privacy Protection Center", "label": ["Important", "Contact Information"], "rewrite": "Contact: Avaron Data and Privacy Protection Center"}
{"task": "rw_109.jsonl", "id": 72977, "text": "Postcode: 100012", "label": ["Important", "Contact Information"], "rewrite": "Postcode: 100012"}
{"task": "rw_109.jsonl", "id": 72978, "text": "Customer service phone: (010) 84947811, (010) 64133601", "label": ["Important", "Contact Information"], "rewrite": "Customer service phone: (010) 84947811 (010) 64133601"}
{"task": "rw_109.jsonl", "id": 72979, "text": "Under normal circumstances, we will reply within 15 days.", "label": [], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72980, "text": "If you are not satisfied with our reply, especially our personal information processing behavior harms your legitimate rights and interests, you can also find solutions through the following external channels:", "label": ["Important"], "rewrite": "You can seek solutions through the following external channels: 1. The Beijing Arbitration Commission applies for arbitration.2. Complaints from the competent government department."}
{"task": "rw_109.jsonl", "id": 72981, "text": "1. The Beijing Arbitration Commission applies for arbitration.", "label": [], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72982, "text": "2. Complaints from the competent government department.", "label": [], "rewrite": []}
{"task": "rw_109.jsonl", "id": 72983, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
