{"task": "rw_130.jsonl", "id": 77811, "text": "Thunder Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77812, "text": "Update date: 2022 [11] month [29] Day", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77813, "text": "Effective date: 2022 [11] month [29] Day", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77814, "text": "About this privacy policy", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77815, "text": "1. The Privacy Policy of Xunlei (hereinafter referred to as \"this policy\") is provided by Shenzhen Thunder Network Technology Co., Ltd. (\"We\" or \"Thunder\").Site, iOS applications, Android applications, TV -side applications and other terminal clients.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77816, "text": "Overview of this policy how Thunder collects, protects, and uses users (hereinafter referred to as \"user\" or \"you\") personal information, how users manage their personal information, a statement of third -party responsibilities, the privacy rights of minors.Application and update.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77817, "text": "You can also quickly understand the main situation of our personal information collection and use through \"Personal Information Collection List\", as well as the authority we will use when we use Thunder when using Thunder.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "You can quickly understand the main situation of personal information collection and use through the \"Personal Information Collection List\", and to view the permissions of the use of the \"Application Restrictions\" instruction"}
{"task": "rw_130.jsonl", "id": 77818, "text": "2. We attach great importance to the protection of user personal information. It is recommended that users read and understand all the contents of this policy, especially the use of rough types, oblique or lower lines, etc., to remind you of special attention.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77819, "text": "If the terms of this policy and any service agreement adopted by Thunder are inconsistent or conflict specified in the provisions of the privacy and authorization clauses, the relevant terms of this policy shall prevail.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77820, "text": "Please note that this policy is not applicable to the services you provided in other third directions, and the third direction you provide to the privacy policy that you will explain to you.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77821, "text": "3. This policy has the following content:", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77822, "text": "1 Collect user information", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77823, "text": "2 About the use of cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77824, "text": "3 Protect user information", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77825, "text": "4 Use user information", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77826, "text": "5 Provide user information to the outside world", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77827, "text": "6 The right to manage its information and cancel account number", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77828, "text": "7 Special agreement for privacy of minors", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77829, "text": "8 Application and update of this policy", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77830, "text": "9 Survey and law applicable to law", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77831, "text": "10 Contact us", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77832, "text": "4. Thunder knows the importance of personal information to you and will do its best to protect your personal information security and reliable.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77833, "text": "We are committed to maintaining your trust in us, adhere to the following principles: protect your personal information;", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77834, "text": "The principles of consistency and responsibility, the principles of clear purpose, the principle of consent, at least enough principles, ensuring safety principles, subject participation principles, open and transparent principles, etc.", "label": ["Important", "Data Security"], "rewrite": "Adhere to the principles of consistency and responsibility, the principles of clear purpose, the principle of selecting consent, the minimum principles of the selection, the principle of at least the principles, the principles of safety, the principles of subject participation, and the principle of openness and transparency to protect personal information."}
{"task": "rw_130.jsonl", "id": 77835, "text": "At the same time, Thunder promises that we will take corresponding security protection measures to protect your personal information in accordance with laws and regulations and mature security standards in the industry.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77836, "text": "Please read and understand this policy carefully before using our products (or services).", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77837, "text": "1. Collect user information", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77838, "text": "1.1 Overview", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77839, "text": "When Xunlei provides services, according to the real -name system requirements and specific service types, it may be based on product functional requirements collection, storage and use information related to users, including ID numbers, contact addresses, phone numbers, and equipment used for third -party login.Account number, email or bank card number, and log information (user operation records, device models, software versions, software information, mobile phone status identity, device memory information, system types, operating system versions, equipment belonging, network type, network typeIMSI), the equipment has been installed and applied, the face, ID personal information, sensor information (acceleration, magnetic field, gyroscope, direction, pressure, rotation vector, light, magnetic meter, angle speed, gravity), process information get_tasks, SIM cards during operationInformation (national code, SIM service provider information, SIM card serial number), read system setting information, CPU model, device storage space information (obtaining SD card data information), hardware serial number, Bluetooth information (Bluetooth name, Bluetooth adapter), WIFI information (WIFI name, WIFI scanning results, WIFI status, nearby WIFI hotspots), notification bar setting information, shear information (paste plate), and system name.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collection, storage, and use information related to users, including ID numbers, contact address, phone number, account number, email or bank card number, and log information (user operation records, device models, software, software, software models, software models, softwareVersion, software information, mobile phone status identity, device manufacturer, equipment memory information, system types, operating system versions, device belonging, network types, Device_ID), IP address, GPS, WLAN (SSID, BSSID, WLAN access points) or access point) orGyroscope, direction, pressure, rotation vector, light, magnetic meter, angle speed, gravity), process information get_tasks, SIM card information (national code, SIM service provider information, SIM card sequence number)CPU model, device storage space information (obtaining SD card data information), hardware serial number, Bluetooth information (Bluetooth name, Bluetooth adapter), WIFI information (WIFI name, WIFI scanning result, WIFI status, nearby WiFi hotspot), notification bar notification barSet information, shear information (paste plate), system name"}
{"task": "rw_130.jsonl", "id": 77840, "text": "If the user does not provide such information, it may not be able to register as a user or some services provided by Thunder.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If the user does not provide such information, it may not be able to register as a user who becomes Thunder or some services provided by Thunder"}
{"task": "rw_130.jsonl", "id": 77841, "text": "Thunder will also use a third -party SDK to collect your equipment information, browse information, click on information, and store these information as a log information to remember your identity, analyze your use of Thunder services, and optimize advertising. Among them,If you use Xiaomi, Meizu, Huawei, OPPO, vivo mobile phones, the above -mentioned mobile phone manufacturer PUSH connected by Thunder, SDK needs to collect the only identification information of the mobile phone, and may collect your mobile phone model, system type, system version, device screen sizeParameters are used to push information such as promotion activities, video content and other information.", "label": ["Important", "First Party Collection Information"], "rewrite": "It will use third -party SDK to collect device information, browse information, click on information, and store these information as a log information to optimize advertising; collect the only identification information of the mobile phone, your mobile phone model, system type, system version, device screenParameters such as size are used to achieve information such as promotion activities, video content and other information"}
{"task": "rw_130.jsonl", "id": 77842, "text": "When providing users with services, Thunder will also use the following SDK technology, the functions provided by SDK, the authority required for the required authority and the collection of user information: mobile phone Thunder SDK permissions and collecting user information description", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "It will also use the following SDK technology, the functions provided by SDK, the required permissions and the collection user information are: mobile phone Thunder SDK permissions and collection user information description"}
{"task": "rw_130.jsonl", "id": 77843, "text": "When collecting your personal information, Xunlei will comply with the following requirements:", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77844, "text": "1.1.1, collection method: before collecting, you will obtain user consent;", "label": ["Important", "First Party Collection Information"], "rewrite": "Before collecting the collection, the user's consent will be obtained"}
{"task": "rw_130.jsonl", "id": 77845, "text": "1.1.2, information storage area: According to the law, your personal information will be stored in the mainland of the People's Republic of China;", "label": ["Data Retention", "Important"], "rewrite": "Your personal information will be stored in the mainland of the People's Republic of China"}
{"task": "rw_130.jsonl", "id": 77846, "text": "1.1.3, information storage period: We only keep your personal information required for the purpose of achieving product and service purposes. When your Thunder account is recovered, or you terminate the service provided by Thunder and require Thunder to delete your individualAfter information or personal information exceeds the necessary preservation period, Thunder will delete or processes your information, but according to the requirements of information retention of information on law or for financial, auditing, dispute resolution, etc.except;", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "Reserve your personal information only to achieve the shortest time to achieve product and service purposes"}
{"task": "rw_130.jsonl", "id": 77847, "text": "1.1.4 Data security capacity: data security capacity required by laws and regulations.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77848, "text": "1.2 use", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77849, "text": "Thunder collecting user information is mainly used as the following use: provides users with services;", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77850, "text": "Used for user authentication, customer service, security defense, number recovery, fraud monitoring, archiving and backup, and advertising services;", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77851, "text": "Further evaluate our service effects and improve our services (including advertising services).", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77852, "text": "In order to ensure the security and accuracy of the service and help us better understand the operation of our application, we may record relevant information, including related device information and operating behavior data (the frequency of your application, the collapse data, the overall usage,, the overall use situation,,,,,,,,,, the overall use situation, the situation,,,,,,,, the overall usage,,,,, the overall usage,,,,,, the overall use,,,,,,,,,,,,Performance data and the source of applications).", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect relevant information, including related device information and operating behavior data (the frequency of your application, the collapse data, the overall usage, performance data, and the source of the application)"}
{"task": "rw_130.jsonl", "id": 77853, "text": "1.3 Definition of personal information", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77854, "text": "User personal information refers to a variety of information that can be recorded alone or with other information to identify a specific natural person or reflects the activity of specific natural persons alone, including the following information: the basic information of natural persons (including personal name, birthday, gender gender, Address, personal phone number, email address), personal identity information (including identity documents), personal biometric information (including fingerprints, facial features), network identity identification information (including system account number, IP address, personal digital certificate, etc.) Personal property information (including bank accounts, passwords, transactions and consumption records, virtual currency, virtual transactions, redemption codes and other virtual property information), address book information, personal Internet records (including website browsing records, software use records, in use in use, in use in useSoftware lists), personal common equipment information (including hardware serial numbers, hardware models, equipment MAC addresses, operating system types, software lists, unique device identification codes), personal location information (including general geographical location and accurate positioning information).", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77855, "text": "The types of personal information that are actually collected by Thunder are described in this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77856, "text": "User's personal sensitive information refers to personal information that once leaked, illegally provided or abuses the security of people and property, which can easily lead to personal information that causes personal reputation, physical and mental health, or discriminatory treatment.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77857, "text": "Including your personal property information, personal identity information, personal biometric information, network identity identification information, address book information, accurate positioning information, and delivery address.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77858, "text": "The types of personal sensitive information that are actually collected by Thunder are described in this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77859, "text": "At present, Thunder will collect your personal information only for the following goals described in this policy.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77860, "text": "If Thunder wants to use your personal information for other purposes that are not stated in this policy, you will recruit your consent again.", "label": ["Important", "First Party Collection Information"], "rewrite": "If Xunlei wants to use your personal information for other purposes that are not stated in this policy, you will recruit your consent again"}
{"task": "rw_130.jsonl", "id": 77861, "text": "1.3.1 Provide you with cloud disk, download, acceleration, bandwidth improvement, video playback and cloud game service", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77862, "text": "1.3.1.1 Business Function 1: Register becomes a user.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77863, "text": "When completing the account registration/login function, we need to authorize us to collect personal basic information (mobile phone number), network identity information (network type, IP address, WLAN access point), equipment information (equipment model, equipment manufacturer, equipment memoryInformation, system types, operating system versions, device_id, hardware serial number, CPU model, system settings information, system name).", "label": ["Important", "First Party Collection Information"], "rewrite": "Device_id, hardware serial number, CPU model, system settings information, system name)"}
{"task": "rw_130.jsonl", "id": 77864, "text": "The above information you provide will continue to authorize us to use it during your service.", "label": ["Important", "First Party Collection Information"], "rewrite": "The above information you provide will continue to authorize us to use it during your service."}
{"task": "rw_130.jsonl", "id": 77865, "text": "We collect this information to complete the registration procedure, provide you with products and/or services exclusive to registered users, and protect your account security.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77866, "text": "If you do not provide this information, you will not be able to use your account registration/login function.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If you do not provide this information, you will not be able to use your account registration/login function."}
{"task": "rw_130.jsonl", "id": 77867, "text": "After you register a user, if you are an Apple mobile phone user, you can also authorize us to use the camera to unlock the use through the face recognition function.", "label": ["Permission Acquisition", "Important"], "rewrite": "It can authorize us to use the camera to unlock the use through the face recognition function"}
{"task": "rw_130.jsonl", "id": 77868, "text": "In order to achieve this function, you need to first authorize the face ID on the Apple mobile phone, and then open the face unlocking function by accessing the \"Settings-Privacy Settings-Open the APP password unlock-open face recognition and unlock] by accessing\" Mobile Thunder APP \".", "label": ["Permission Acquisition", "Important"], "rewrite": "You need to authorize the enabled Face ID on the Apple phone first, and then open the face unlock function by accessing [Settings-Privacy Settings-Open App Password Unlock-Open Face Recognition Unlock] of the \"Mobile Thunder APP\""}
{"task": "rw_130.jsonl", "id": 77869, "text": "If you want to close the face recognition unlocking function, you can turn off this function by visiting [Settings-Privacy Settings-APP password unlock-closure of face recognition unlock] by visiting \"Mobile Thunder APP\".", "label": ["Important", "Edit/Control"], "rewrite": "You can close the function by visiting the [Settings-Privacy Settings-APP password unlock-APP password unlock-APP password of mobile phone Thunder APP] to close this function"}
{"task": "rw_130.jsonl", "id": 77870, "text": "If you refuse to authorize such information, you will not be unlocked using face ID, but it will not affect the normal use of other products and services we provide for you.", "label": ["Important", "Edit/Control"], "rewrite": "If you refuse to authorize such information, you cannot use the face ID to unlock, but it does not affect the normal use of other products and services we provided for you."}
{"task": "rw_130.jsonl", "id": 77871, "text": "In view of the highly sensitive personal information, please learn that your mobile phone has taken extraordinary protection measures, so we cannot contact these data. This facial unlocking function only uses encrypted mathematical expressions.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77872, "text": "After you register a user, if you are a mobile phone user of Android, you can also authorize us to use the touch function to unlock the use through the fingerprint recognition function.", "label": ["Permission Acquisition", "Important"], "rewrite": "Can authorize us to use the touch function to unlock the use through the fingerprint recognition function"}
{"task": "rw_130.jsonl", "id": 77873, "text": "In order to achieve this function, you need to first authorize the touch function on your mobile phone, and then open the touch unlocking function by accessing the \"Cloud Drive-Super Sales-Fingerprint Logging-Open Fingerprint Link\" of the \"mobile phone Thunder APP\".", "label": ["Permission Acquisition", "Important", "Edit/Control"], "rewrite": "You need to first authorize the touch function on the mobile phone, and then open the touch unlocking function by visiting the \"Cloud Plate-Super Sales-Fingerprint Logging-Open Fingerprint Link\" of \"Mobile Thunder APP\""}
{"task": "rw_130.jsonl", "id": 77874, "text": "If you want to close the touch recognition unlocking function, you can turn off the function through \"Mobile phone settings-password security-closing fingerprints\" to turn off this function or click on the upper right corner when the fingerprint is unlocked by Thunder.", "label": ["Important", "Edit/Control"], "rewrite": "You can turn off the touch recognition unlocking function by \"mobile phone settings-password security-turn off fingerprint\" or click on the upper right corner when the fingerprint is required to be unlocked by Thunder"}
{"task": "rw_130.jsonl", "id": 77875, "text": "If you refuse to authorize such information, you will not be unlocked using the touch ID, but it will not affect the normal use of other products and services we provide for you.", "label": ["Permission Acquisition", "Edit/Control", "Risk", "Important"], "rewrite": "If you refuse to authorize such information, you cannot use the touch ID to unlock, but it does not affect the normal use of other products and services we provided for you."}
{"task": "rw_130.jsonl", "id": 77876, "text": "In view of the highly sensitive personal information, please learn that your mobile phone has taken extraordinary protection measures, so we cannot contact these data. The touch unlocking function only uses encrypted mathematical expressions.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77877, "text": "It should be noted that some of our functions support you to log in with the account of the third -party platform. If you log in with the account of the third -party platform, we will obtain the relevant information under the third party account based on your authorization. We will collect the above above.Information is used to provide you with account login service and ensure your account security and prevent security risks.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "Collecting the above information is used to ensure account security and prevent security risks"}
{"task": "rw_130.jsonl", "id": 77878, "text": "If you refuse to authorize such information, you will not be able to log in to our platform with an account on a third -party platform, but it will not affect the normal use of other products and services we provide for you.", "label": ["Permission Acquisition", "Important", "Risk"], "rewrite": "If such information is rejected, it will not be able to log in to our platform with an account on a third -party platform, but it will not affect the normal use of other products and services"}
{"task": "rw_130.jsonl", "id": 77879, "text": "At the same time, you can provide you with more personal information according to your personal preference, such as gender, birthday, and location to improve your account information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77880, "text": "You do not provide these additional information and will not affect your application of basic functions.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77881, "text": "The above information you provide will continue to authorize us to use it during your service.", "label": ["Important", "First Party Collection Information"], "rewrite": "The above information you provide will continue to authorize us to use it during your service."}
{"task": "rw_130.jsonl", "id": 77882, "text": "After you cancel your account, we will stop using and delete the above information.", "label": ["Edit/Control", "Important"], "rewrite": "After you cancel your account, we will stop using and delete the above information."}
{"task": "rw_130.jsonl", "id": 77883, "text": "If the above information needs to be transmitted cross -border, we will obtain your authorization consent alone.", "label": ["Data Retention", "Important"], "rewrite": "If the above information needs to be transmitted cross -border, your authorization consent will be obtained separately."}
{"task": "rw_130.jsonl", "id": 77884, "text": "1.3.1.2 Business Function 2: Cloud Plate Function", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77885, "text": "When using the personal resource cloud disk function, we need to authorize us to collect personal basic information (mobile phone number), network identity identification information (network type, IP address, WLAN access point).", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "When using the personal resource cloud disk function, we need to authorize us to collect personal basic information (mobile phone number), network identification information (network type, IP address, WLAN access point)"}
{"task": "rw_130.jsonl", "id": 77886, "text": "The above information you provide will continue to authorize us to use it during your service.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77887, "text": "We collect this information to complete the registration procedure, provide you with products and/or services exclusive to registered users, and protect your account security.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77888, "text": "If you do not provide this information, you will not be able to use the cloud disk function.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If you do not provide this information, you will not be able to use the cloud disk function."}
{"task": "rw_130.jsonl", "id": 77889, "text": "The above information you provide will continue to authorize us to use it during your service.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77890, "text": "After you cancel your account, we will stop using and delete the above information.", "label": ["Edit/Control", "Important"], "rewrite": "After you cancel your account, we will stop using and delete the above information."}
{"task": "rw_130.jsonl", "id": 77891, "text": "If the above information needs to be transmitted cross -border, we will obtain your authorization consent alone.", "label": ["Data Retention", "Important"], "rewrite": "If the above information needs to be transmitted cross -border, we will obtain your authorization consent alone."}
{"task": "rw_130.jsonl", "id": 77892, "text": "1.3.1.3 Business function three: download function", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77893, "text": "Device_id, hardware serial number, CPU model, system settings information, system name), network type, IP address, WLAN (SSID, BSSID, WLAN access point).", "label": ["Permission Acquisition", "Important"], "rewrite": "We need to authorize us to read or modify, delete external storage permissions, write SDCARD data, equipment storage space information, equipment information (equipment manufacturer, equipment model, equipment memory information, system types, operating system versions, Device_id, hardware sequence number, CPUModel, system settings information, system name), network type, IP address, WLAN (SSID, BSSID, WLAN access point))"}
{"task": "rw_130.jsonl", "id": 77894, "text": "The above information you provide will match the verification before you use this function for your account number and system security.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77895, "text": "If you do not provide this information, you will not be able to use the download function.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you do not provide this information, you will not be able to use the download function"}
{"task": "rw_130.jsonl", "id": 77896, "text": "The above information you provide will continue to authorize us to use it during your service.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77897, "text": "After you cancel your account, we will stop using and delete the above information.", "label": ["Important", "Edit/Control"], "rewrite": "After you log out the account, we will stop using and delete the above information"}
{"task": "rw_130.jsonl", "id": 77898, "text": "If the above information needs to be transmitted cross -border, we will obtain your authorization consent alone.", "label": ["Data Retention", "Important"], "rewrite": "If the above information needs to be transmitted cross -border, we will obtain your authorization consent alone."}
{"task": "rw_130.jsonl", "id": 77899, "text": "1.3.1.4 Business Function 4: Accelerate Function", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77900, "text": "When using the acceleration function, we need to authorize us to read or modify, delete external storage permissions, equipment information (equipment manufacturers, equipment models, equipment memory information, system types, operating system versions, device_id, hardware sequence number, CPU model, system system, systemSet information, system name), network type, IP address, WLAN (SSID, BSSID, WLAN access point).", "label": ["Permission Acquisition", "Important"], "rewrite": "You need to authorize us to read or modify, delete external storage permissions, equipment information (equipment manufacturers, equipment models, equipment memory information, system types, operating system versions, DEVICE_ID, hardware serial number, CPU model, system setting information, system name), Network type, IP address, WLAN (SSID, BSSID, WLAN access point"}
{"task": "rw_130.jsonl", "id": 77901, "text": "The above information you provide will match the verification before you use this function for your account number and system security.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77902, "text": "If you do not provide this information, you will not be able to use the download function.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If you do not provide this information, you will not be able to use the download function."}
{"task": "rw_130.jsonl", "id": 77903, "text": "The above information you provide will continue to authorize us to use it during your service.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77904, "text": "After you cancel your account, we will stop using and delete the above information.", "label": ["Important", "Edit/Control"], "rewrite": "After you log out the account, we will stop using and delete the above information"}
{"task": "rw_130.jsonl", "id": 77905, "text": "If the above information needs to be transmitted cross -border, we will obtain your authorization consent alone.", "label": ["Data Retention", "Important"], "rewrite": "If the above information needs to be transmitted cross -border, we will obtain your authorization consent alone."}
{"task": "rw_130.jsonl", "id": 77906, "text": "1.3.1.5 Business Function 5: Broadband improvement", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77907, "text": "When providing you with broadband upgrade services, we need to authorize us to collect personal basic information (mobile phone number), network identity information (network type, IP address, WLAN access point).", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect personal basic information (mobile phone number), network identity identification information (network type, IP address, WLAN access point)"}
{"task": "rw_130.jsonl", "id": 77908, "text": "The above information you provide will continue to authorize us to use it during your service.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77909, "text": "We collect this information to complete the registration procedure, provide you with products and/or services exclusive to registered users, and protect your account security.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77910, "text": "If you do not provide this information, you will not be able to use the broadband improvement function.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If you do not provide this information, you will not be able to use the broadband improvement function."}
{"task": "rw_130.jsonl", "id": 77911, "text": "The above information you provide will continue to authorize us to use it during your service.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77912, "text": "After you cancel your account, we will stop using and delete the above information.", "label": ["Important", "Edit/Control"], "rewrite": "After you log out the account, we will stop using and delete the above information"}
{"task": "rw_130.jsonl", "id": 77913, "text": "If the above information needs to be transmitted cross -border, we will obtain your authorization consent alone.", "label": ["Data Retention", "Important"], "rewrite": "If the above information needs to be transmitted cross -border, we will obtain your authorization consent alone."}
{"task": "rw_130.jsonl", "id": 77914, "text": "1.3.1.6 Business Function 6: Video Playing Service", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77915, "text": "When displaying, browsing and playing video, audio, and live broadcast services, you need to provide the following information: personal commonly used equipment information (equipment manufacturers, equipment models, equipment memory information, system types, operating system versions, device_id, hardware serial number, CPU modelgravity).", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the following information: Personal commonly used equipment information (equipment manufacturers, equipment models, equipment memory information, system types, operating system versions, device_id, hardware serial number, CPU model, system settings information, system name), network identity identification information (network type type type type type type, IP address, WLAN access point), sensor information (acceleration, magnetic field, gyroscope, direction, pressure, rotation vector, light, magnetometer, angle speed, gravity)."}
{"task": "rw_130.jsonl", "id": 77916, "text": "The above information you provide will continue to authorize us to use it during your service.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77917, "text": "If you provide the following additional information, it will help us provide you with better content recommendation services: geographical location.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting additional information such as geographical location will help provide better content recommendation services"}
{"task": "rw_130.jsonl", "id": 77918, "text": "If you do not provide this information, you will not be able to complete live broadcast or Lianmai.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you do not provide this information, you will not be able to complete the broadcast or Lianmai."}
{"task": "rw_130.jsonl", "id": 77919, "text": "The above information you provide will continue to authorize us to use it during your service.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77920, "text": "After you cancel your account, we will stop using and delete the above information.", "label": ["Important", "Edit/Control"], "rewrite": "After canceling the account, it will stop using and delete the above information."}
{"task": "rw_130.jsonl", "id": 77921, "text": "If the above information needs to be transmitted cross -border, we will obtain your authorization consent alone.", "label": ["Data Retention", "Important"], "rewrite": "If the above information needs to be transmitted cross -border, we will obtain your authorization consent alone."}
{"task": "rw_130.jsonl", "id": 77922, "text": "1.3.1.7 Business Function Seven: Cloud Games", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77923, "text": "), Network identity identification information (network type, IP address, WLAN access point), sensor information (acceleration, magnetic field, gyroscope, direction, pressure, rotation vector, light, magnetic meter, angle speed, gravity).", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the following information: Personal commonly used equipment information (equipment manufacturers, equipment models, equipment memory information, system types, operating system versions, device_id, hardware serial number, CPU model, system settings information, system name), network identity identification information (network type type type type type type, IP address, WLAN access point), sensor information (acceleration, magnetic field, gyroscope, direction, pressure, rotation vector, light, magnetometer, angle speed, gravity))"}
{"task": "rw_130.jsonl", "id": 77924, "text": "The above information you provide will continue to authorize us to use it during your service.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77925, "text": "If you provide the following additional information, it will help us provide you with better content recommendation services: geographical location.", "label": ["Important", "First Party Collection Information"], "rewrite": "Provide additional information such as geographical location, which helps to provide better content recommendation services"}
{"task": "rw_130.jsonl", "id": 77926, "text": "If you do not provide this information, you will not be able to play cloud games.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If you do not provide this information, you will not be able to play cloud games."}
{"task": "rw_130.jsonl", "id": 77927, "text": "The above information you provide will continue to authorize us to use it during your service.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77928, "text": "After you cancel your account, we will stop using and delete the above information.", "label": ["Edit/Control", "Important"], "rewrite": "After you cancel your account, we will stop using and delete the above information."}
{"task": "rw_130.jsonl", "id": 77929, "text": "If the above information needs to be transmitted cross -border, we will obtain your authorization consent alone.", "label": ["Data Retention", "Important"], "rewrite": "If the above information needs to be transmitted cross -border, your authorization consent will be obtained separately."}
{"task": "rw_130.jsonl", "id": 77930, "text": "1.3.1.8 Business Function 8: Real -name certification", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77931, "text": "In order to meet the requirements of relevant laws, regulations and policies and the requirements of relevant competent authorities, when you use cloud games and recharge consumption, you need to perform real -name certification to enjoy related services., ID number, mobile phone number.", "label": ["Important", "First Party Collection Information"], "rewrite": "You will collect your following information when you take the initiative: real name, ID number, mobile phone number"}
{"task": "rw_130.jsonl", "id": 77932, "text": "The above information you provide will continue to authorize us to use it during your service.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77933, "text": "If you provide the following additional information, it will help us provide you with better content recommendation services: geographical location.", "label": ["Important", "First Party Collection Information"], "rewrite": "Provide additional information such as geographical location, which helps to provide better content recommendation services"}
{"task": "rw_130.jsonl", "id": 77934, "text": "If you do not provide this information, you will not be able to use cloud game -related services, but it will not affect your other functions.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If you do not provide this information, you will not be able to use cloud game -related services, but it will not affect your other functions."}
{"task": "rw_130.jsonl", "id": 77935, "text": "The above information you provide will continue to authorize us to use it during your service.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77936, "text": "After you cancel your account, we will stop using and delete the above information.", "label": ["Edit/Control", "Important"], "rewrite": "After you cancel your account, we will stop using and delete the above information."}
{"task": "rw_130.jsonl", "id": 77937, "text": "If the above information needs to be transmitted cross -border, we will obtain your authorization consent alone.", "label": ["Data Retention", "Important"], "rewrite": "If the above information needs to be transmitted cross -border, we will obtain your authorization consent alone."}
{"task": "rw_130.jsonl", "id": 77938, "text": "1.3.1.9 Business Function Nine: Share and interact.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77939, "text": "In order to achieve jumping, sharing, activity linkage functions or services, you need to provide the following information: shear information (including passwords, sharing codes or links), mobile phone albums, and installed application lists.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the following information: shear information (including passwords, sharing codes or links), mobile phone album, installed application list"}
{"task": "rw_130.jsonl", "id": 77940, "text": "But you can choose not to provide such information. If you do not provide this information, we will not be able to provide you with an interactive function.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "You can choose not to provide such information, do not provide this information, and will not be able to provide you with interactive functions."}
{"task": "rw_130.jsonl", "id": 77941, "text": "We will upload our server only when the contents of the shear plates belong to the Thunder Jump, Share, and Activity linkage instructions.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77942, "text": "If your mobile phone equipment system prompts that the application is reading the shear plate or album, but it is impossible to distinguish whether it is local processing or uploading. If you have any questions about this, you can contact usposition.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77943, "text": "The above information you provide will continue to authorize us to use it during your service.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77944, "text": "After you cancel your account, we will stop using and delete the above information.", "label": ["Edit/Control", "Important"], "rewrite": "After you cancel your account, we will stop using and delete the above information."}
{"task": "rw_130.jsonl", "id": 77945, "text": "If the above information needs to be transmitted cross -border, we will obtain your authorization consent alone.", "label": ["Data Retention", "Important"], "rewrite": "If the above information needs to be transmitted cross -border, we will obtain your authorization consent alone."}
{"task": "rw_130.jsonl", "id": 77946, "text": "1.3.1.10 Business Function Ten: Enjoy member privileges.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77947, "text": "In order to distribute the content of privileges, goods or services, and depending on the content distributed, you need to provide the following information: personal commonly used equipment information (equipment manufacturers, equipment models, equipment memory information, system types, operating system versions, device_id, hardware, hardware, hardwareSerial number, CPU model, system settings information, system name), network identity identification information (network type, IP address, WLAN access point), receiving address, and agree to the account information to the supplier to the corresponding account for the corresponding account to conductRecharge, delivery operation.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the following information: Personal commonly used equipment information (equipment manufacturers, equipment models, equipment memory information, system types, operating system versions, device_id, hardware serial number, CPU model, system settings information, system name), network identity identification information (network type type type type type type, IP address, WLAN access point), receiving address"}
{"task": "rw_130.jsonl", "id": 77948, "text": "But you can choose not to provide such information. If you do not provide this information, we will not be able to distribute members or pay gifts (if.).", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "You can choose not to provide this kind of information. If you do not provide this information, we will not be able to issue a member or a gift (if any)"}
{"task": "rw_130.jsonl", "id": 77949, "text": "The above information you provide will continue to authorize us to use it during your service.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77950, "text": "After you cancel your account, we will stop using and delete the above information.", "label": ["Edit/Control", "Important"], "rewrite": "After you cancel your account, we will stop using and delete the above information."}
{"task": "rw_130.jsonl", "id": 77951, "text": "If the above information needs to be transmitted cross -border, we will obtain your authorization consent alone.", "label": ["Data Retention", "Important"], "rewrite": "If the above information needs to be transmitted cross -border, we will obtain your authorization consent alone."}
{"task": "rw_130.jsonl", "id": 77952, "text": "1.3.1.11 Business Function 11: Buy platform service", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77953, "text": "When you use the recharge consumption function of the network disk, we will collect your WeChat payment information, Alipay payment information, recharge records, consumer record information, virtual property information (gold coins), so that you can query your transaction records, and at the same time do your best to maximize the maximum extentProtect your property and virtual property safety.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your WeChat payment information, Alipay payment information, recharge records, consumer record information, virtual property information (gold coins) in order to check your transaction records"}
{"task": "rw_130.jsonl", "id": 77954, "text": "The above information is a sensitive information, but collecting the above information is necessary to achieve relevant functions, otherwise the transaction will not be completed.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77955, "text": "The above information you provide will continue to authorize us to use it during your service.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77956, "text": "After you cancel your account, we will stop using and delete the above information.", "label": ["Edit/Control", "Important"], "rewrite": "After you cancel your account, we will stop using and delete the above information."}
{"task": "rw_130.jsonl", "id": 77957, "text": "If the above information needs to be transmitted cross -border, we will obtain your authorization consent alone.", "label": ["Data Retention", "Important"], "rewrite": "If the above information needs to be transmitted cross -border, we will obtain your authorization consent alone."}
{"task": "rw_130.jsonl", "id": 77958, "text": "1.4 Maintenance/Improve our product and/or service must and personalized recommendations", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77959, "text": "1.4.1 We may collect equipment information when you use our products and/or services when using our products and/or services (equipment manufacturers, equipment models, equipment memory information, system types, operating system versions, Device_ID, hardware serial number, hardware serial number, hardware sequence number, hardware sequence number, hardware sequence number, hardware sequence number, hardware sequence number, hardware sequence number, hardware sequence number, hardware sequence number, hardware sequence number, hardware sequence number,CPU models, system settings information, system names), network type, IP address, WLAN (SSID, BSSID, WLAN access point), device identifier (MAC address, IMEI, Android_id, OAID, ICCID, GAID, MEID, and IMSI), Wifi information (WIFI name, WiFi scanning result, WIFI status, nearby WiFi hotspot), process information get_tasks, installed application lists, sensor information (acceleration, magnetic field, gyroscope, direction, pressure, rotation vector, light, light, light, light, light, light, Magnetic Messians, Corner Speed, Gravity) to help us know how to access and use our products and/or services, provide users with problem diagnosis and investigation, software and services safely, maintain, and improve our products and improvement of our products and improvement of our products and services./Or service or respond to you.", "label": ["Important", "First Party Collection Information"], "rewrite": "Type, IP address, WLAN (SSID, BSSID, WLAN access point), device identifier (MAC address, IMEI, Android_id, OAID, ICCID, GAID, Meid, and IMSI), WIFI information, WIFI scanning results, WiFi scan results, WiFi scan results, WiFi scan results, WiFi scan results, scanning results, scanning results, results, WiFi scan results, results, resultsWIFI status, nearby WiFi hotspot), process information get_tasks during operation, installed application list, sensor information (acceleration, magnetic field, gyroscope, direction, pressure, rotation vector, light, magnetic meter, angle speed, gravity)"}
{"task": "rw_130.jsonl", "id": 77960, "text": "The above information you provide will continue to authorize us to use it during your service.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77961, "text": "After you cancel your account, we will stop using and delete the above information.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77962, "text": "If the above information needs to be transmitted cross -border, we will obtain your authorization consent alone.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77963, "text": "1.4.2 We may analyze your preferences, habits, and location based on the collected information, so as to provide you with more suitable customized services to show you or recommended to youPush) search results, live content, information flow results.", "label": ["Important", "Usage"], "rewrite": "Based on the collection of information, analyze your preferences, habits, and location of user's preferences and user portraits in order to provide you with more suitable customized services"}
{"task": "rw_130.jsonl", "id": 77964, "text": "To this end, the information we need to collect includes your device information (hardware model, equipment MAC address, OAID, IMEI, IDFA, IMSI, necessary software list), browser model, log information, browsing records, click/follow/comments/comments/Interactive objects, search words, consumption records, base station information, network status information, personal location information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your device information (hardware model, device MAC address, OAID, IMEI, IDFA, IMSI, necessary software list), browser model, log information, browsing records, clicks/attention/comments/interaction words, search words, search wordsWords, consumer records, base station information, network status information, personal location information"}
{"task": "rw_130.jsonl", "id": 77965, "text": "If you do not provide this information, we will not be able to provide targeted recommendations.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77966, "text": "When you are not interested in personalized advertisements or content we recommend or do not want to receive such personalized advertising or content, you can use our products and/or service related functions to set up/close personalized advertising recommendations.", "label": ["Edit/Control", "Usage", "Important"], "rewrite": "You can use our product and/or service related feature setting page to open/close personalized advertising recommendation"}
{"task": "rw_130.jsonl", "id": 77967, "text": "The setting path of personalized advertising or content recommendation in the \"Thunder App\" is: \"Mine-Settings-General-Advertising Recommendation Settings, content recommendation settings\" (Android path), \"My-Settings-Privacy Settings-Personalized Advertising AdvertisingRecommended \"(iPhone path).", "label": ["Important", "Edit/Control"], "rewrite": "The setting path of personalized advertising or content recommendation in the \"Thunder App\" is: \"Mine-Settings-General-Advertising Recommendation Settings, content recommendation settings\" (Android path), \"My-Settings-Privacy Settings-Personalized Advertising AdvertisingRecommended \"(iPhone path)"}
{"task": "rw_130.jsonl", "id": 77968, "text": "1.5 No need to agree", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77969, "text": "In the following circumstances, Xunlei collects personal information without obtain your authorization consent:", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "In the following circumstances, Xunlei collects personal information without obtain your authorization consent:"}
{"task": "rw_130.jsonl", "id": 77970, "text": "1.5.1, related to the obligations stipulated by Xunlei to fulfill the laws and regulations;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect personal information related to the obligations stipulated in the law and regulations of Xunlei, no need to agree"}
{"task": "rw_130.jsonl", "id": 77971, "text": "1.5.2, directly related to national security and national defense security;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect personal information directly related to national security and national defense security, no need to agree"}
{"task": "rw_130.jsonl", "id": 77972, "text": "1.5.3, directly related to public safety, public health, and major public interests;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect personal information directly related to public safety, public health, and major public interests."}
{"task": "rw_130.jsonl", "id": 77973, "text": "1.5.4, directly related to criminal investigation, prosecution, trial, and execution of judgment;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect direct personal information related to criminal investigation, prosecution, trial, and execution of judgments. No need to agree;"}
{"task": "rw_130.jsonl", "id": 77974, "text": "1.5.5, because of maintaining major legitimate rights and interests such as life and property of you or other individuals, but it is difficult to get my consent;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting and maintaining major legitimate rights and interests, but it is difficult to get personal information that I agree, no need to agree"}
{"task": "rw_130.jsonl", "id": 77975, "text": "1.5.6, the personal information involved is made by your own public;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "The collected personal information is made by your own public to the public, so you dont need to agree"}
{"task": "rw_130.jsonl", "id": 77976, "text": "1.5.7, collecting personal information from the legal publicly disclosed information, such as legal news reports and government information disclosure;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If you collect personal information from the legal disclosure information, you don't need to agree"}
{"task": "rw_130.jsonl", "id": 77977, "text": "1.5.8 Intellectual property and other important rights to maintain and maintain Thunder in accordance with the law.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77978, "text": "1.6 Special statement", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77979, "text": "In order to push you the latest information or follow the information in time, Thunder may have a brief self -starting behavior in the background after you exit the application.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77980, "text": "2. About the use of cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77981, "text": "2.1 Cookie is a small file containing user access to the website. When you log in and use the website or other network content, you can store or send these cookie data through your computer, mobile terminal or other devices. The content is usually encrypted.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77982, "text": "Similar cookies are other technologies that can be used as similar to cookies, such as: Web Beacon, Proxy, embedded script, etc.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77983, "text": "2.2 Cookie and similar technologies are mainly used to optimize your product and/or service experience of our products, mainly including simplifying your repeated operation (such as registration, login), which is convenient for youThe content of the personal service content is more interested in what you may be more interested in, protect your information and account security, and improve our products and services.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77984, "text": "We will not use Cookie for any purpose except the purpose of this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77985, "text": "2.3, when you use our products and/or services, we will send cookies to your device through related products and/or services, and when you and us provide services to our partners (such as advertising and/or promotion servicesAnd when the service function provided by us may be displayed on other websites, we allow it to send us cookies.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use our products, and when you interact with the services you provide to our partners, you allow the sending cookie"}
{"task": "rw_130.jsonl", "id": 77986, "text": "2.4, you can manage or delete cookies according to your preference.", "label": ["Important", "Edit/Control"], "rewrite": "You can manage or delete Cookie according to your preferences."}
{"task": "rw_130.jsonl", "id": 77987, "text": "If you refuse us to collect and use your relevant information with Cookie and similar technologies, you can change your browser settings to limit our use of Cookie, or delete cookies that have been stored in your computer, mobile terminal or other devices.With/or refusal to use other similar technologies, so that we cannot track your personal information all or partially.", "label": ["Edit/Control", "Important"], "rewrite": "If we reject us to collect and use relevant information using Cookie and similar technologies, you can change your browser settings to limit the use of cookies"}
{"task": "rw_130.jsonl", "id": 77988, "text": "You understand and know: We need to achieve certain products and/or services through cookies or similar technologies. If you refuse to use or delete Cookie or refuse to use other similar technologies, you may not be able to use our related products and///Or service or unable to obtain the best service experience through our products and/or services.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "You need to use cookies or similar technologies to achieve certain products and/or services. If you refuse to use or delete cookies, you may not be able to use our related products and/or services normally"}
{"task": "rw_130.jsonl", "id": 77989, "text": "3. Protect user information", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77990, "text": "3.1 Protection measures", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77991, "text": "We use various security technologies and procedures to prevent information loss, improper use, unauthorized reading or disclosure, sharing.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77992, "text": "We use SSL for data encryption transmission, perform AES encryption storage of sensitive data, use MD5 \\ SHA-256 \\ SHA-1 and other algorithms to protect your personal information and protect your personal information and protect your personal information and protect your personal information.The mechanism prevent your personal information from being maliciously attacked.", "label": ["Important", "Data Security"], "rewrite": "Use SSL for data encryption transmission, perform AES encryption storage of sensitive data, and use MD5 \\ SHA-256 \\ SHA-1 and other algorithms for privacy information to protect your personal information such as anonymous and feasible means such as"}
{"task": "rw_130.jsonl", "id": 77993, "text": "We have established a comprehensive access control mechanism to authorize according to the principle of minimizing authority to ensure that only authorized personnel can access personal information.", "label": ["Important", "Data Security"], "rewrite": "We have established a comprehensive access control mechanism to authorize according to the principle of minimizing authority to ensure that only authorized personnel can access personal information."}
{"task": "rw_130.jsonl", "id": 77994, "text": "However, please understand that due to the technical restrictions and various malicious means, in the Internet industry, even if you can do your best to strengthen security measures, it is impossible to ensure that the information is 100 % security.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77995, "text": "If your information is caused by unauthorized access, public disclosure, tampering, or destruction, and your legal rights and interests are damaged, we will bear the corresponding legal liability.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77996, "text": "You need to understand that the systems and communication networks you use to access our services may be due to factors outside of our controllable scope.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77997, "text": "3.2 Basic Protection Policy", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77998, "text": "Respecting and protecting users' personal privacy is a basic policy of Thunder.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 77999, "text": "Xunlei will not be disclosed, edited or disclosed without the user's authorization and disclosed its registered information and the non -public content stored in various services in Thunder. Unless Xunlei Company believes that it is necessary on the basis of integrity.Article 1.4 and Treaty 5", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78000, "text": "3.3 Reasonable protection measures", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78001, "text": "We will take all reasonable and feasible measures to ensure unrelated personal information.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78002, "text": "We will only retain your personal information within the period described in this policy, unless extended the retention period meets laws and regulations.", "label": ["Data Retention", "Important"], "rewrite": "We will only retain your personal information within the period described in this policy, unless extended the retention period meets laws and regulations."}
{"task": "rw_130.jsonl", "id": 78003, "text": "3.4 Use complex passwords", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78004, "text": "The Internet is not an absolutely secure environment, and email, instant messaging, and communication methods with other users are not encrypted. We strongly recommend that you do not send personal information in this way.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78005, "text": "Please use complex passwords to help us guarantee your account security.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78006, "text": "3.5 Remedy of accidental events", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78007, "text": "After unfortunately a personal information security incident, we will inform you in a timely manner in accordance with the requirements of the laws and regulations: the basic situation and possible impact of the security incident, the disposal measures we have taken or will take, you can independently prevent and reduce the risk of riskSuggestions, remedy measures, etc.", "label": ["Important", "Data Security"], "rewrite": "After unfortunately a personal information security incident, in accordance with the requirements of the laws and regulations, inform you in a timely manner: the basic situation and possible impact of the security incident, the disposal measures that have been adopted or will be taken, your advice that can prevent and reduce risks, you can independently prevent risks, and you can self -prevent and reduce risk suggestions.Remedy for your remedy."}
{"task": "rw_130.jsonl", "id": 78008, "text": "We will inform you in the station notification or text message notification or telephone or email. When it is difficult to inform you one by one, we will issue a reasonable and effective way to issue an announcement.", "label": ["Important", "Data Security"], "rewrite": "It will be informed by the contact information of your reserved in the station notification or text message notification or telephone or email. It is difficult to inform them one by one. We will publish a reasonable and effective way."}
{"task": "rw_130.jsonl", "id": 78009, "text": "3.6 Reserve and delete", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78010, "text": "Thunder will retain user information in accordance with this policy.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78011, "text": "When our products or services stop operation, we will notify you in the form of push notifications, announcements, etc., and delete your personal information or perform anonymous processing within 90 days.", "label": ["Important", "Data Security", "Cessation of Operations"], "rewrite": "When the product or service stops operation, it will notify you in the form of push notifications, announcements, etc., and delete personal information within 90 days or perform anonymous processing"}
{"task": "rw_130.jsonl", "id": 78012, "text": "3.7 Information security guarantee", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78013, "text": "Thunder strives to provide support for users' information security to prevent information loss, improper use, unauthorized access or disclosure.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78014, "text": "Thunder will comprehensively use various security protection measures within a reasonable level to ensure information security.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78015, "text": "Fourth, user information", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78016, "text": "4.1 Use situation", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78017, "text": "Thunder will need to use the user's information based on the following reasons:", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78018, "text": "4.1.1 Perform software verification service;", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78019, "text": "4.1.2 Execution software upgrade service;", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78020, "text": "4.1.3 network synchronization service;", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78021, "text": "4.1.4 Improve user security and provide customer service support;", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78022, "text": "4.1.5 The purpose of the service functions such as the advertisement described in Article 1 of this policy;", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78023, "text": "4.1.6 Others are conducive to the common interests of users' legitimate rights and interests or the common interests of users and Thunder.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78024, "text": "4.2 Provide outside", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78025, "text": "We will provide user information to the outside world in accordance with the 5th treaty of this policy.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will provide user information to the outside world in accordance with the 5th treaty of this policy."}
{"task": "rw_130.jsonl", "id": 78026, "text": "4.3 Collection frequency", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78027, "text": "We will only collect and use the necessary personal information for the minimum and reasonable frequency to run the business functions.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "It will only collect and use the necessary personal information required for normal operation of business functions with the minimum and reasonable frequency."}
{"task": "rw_130.jsonl", "id": 78028, "text": "5. Provide user information to the outside world", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78029, "text": "5.1 Provide situations outside", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78030, "text": "Thunder has a confidentiality obligation to your information, and we will only provide your information outside of this policy.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78031, "text": "When we share your information, we will urge related companies, partners, or other trusted third -party suppliers, service providers and agents to comply with this policy and ask them to take relevant confidentiality and security measures to handle the above information.", "label": ["Third Party Sharing/ Disclosure", "Data Security"], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78032, "text": "In the following circumstances, we will share user information to the outside world:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the following circumstances, we will share user information to the outside world:"}
{"task": "rw_130.jsonl", "id": 78033, "text": "5.1.1, get your clear consent or authorization in advance;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Get your clear consent or authorization in advance, and share personal information"}
{"task": "rw_130.jsonl", "id": 78034, "text": "5.1.2, in order to provide or recommend services, products, or to provide you with more complete services, or to give you a wider social experience, Xunlei will share your relevant information within the Thunder Group;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Thunder will share your relevant information within the Thunder Group"}
{"task": "rw_130.jsonl", "id": 78035, "text": "5.1.3, shared with authorized partners: In order to achieve the purpose of this policy, some of our services will be provided by authorized partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Only in order to achieve the purpose of this policy, some of our services will be provided by authorized partners"}
{"task": "rw_130.jsonl", "id": 78036, "text": "We may share some of your personal information with our partners to provide better customer service and user experience.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "May share some of your personal information with your partners to provide better customer service and user experience"}
{"task": "rw_130.jsonl", "id": 78037, "text": "5.1.4, in some cases, only to share your information can you provide the service and (or) products you need, or deal with your transaction disputes or disputes with others;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In some cases, only by sharing your information can you provide your needs and (or) products you need"}
{"task": "rw_130.jsonl", "id": 78038, "text": "5.1.5 In order to judge whether your account or purchase and use our products or services is safe;", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78039, "text": "5.1.6, certain services and (or) products are provided by Thunder's partners or are provided by Thunder with partners and suppliers. Thunder will share information that provides services and (or) products required by it;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Thunder will share the information required by the partners and suppliers to provide services and (or) products required by products"}
{"task": "rw_130.jsonl", "id": 78040, "text": "5.1.7, Thunder and third parties conduct joint marketing activities. Thunder may be produced in the process of sharing activities and the necessary personal information for completing the event, such as the number of users who participated in the event, the list of winners, and the contact information of the winner in order to be the first.Three parties can distribute prizes in time;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Thunder and third parties conduct joint marketing activities. Thunder may have the personal information that is necessary for completing the activity in the process of sharing activities with them."}
{"task": "rw_130.jsonl", "id": 78041, "text": "5.1.8 To maintain the legitimate rights and interests of users, Thunder Group and other Thunder Group users;", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78042, "text": "5.1.9, in accordance with the law and reasonable business habits, when the Thunder Program is merged with other companies or was acquired or performed by it or for other capital market activities (including but not limited to IPO, bond issuance)During the due diligence of institutions and agencies, Xunlei will provide your information to the necessary subject after obtaining your second authorization, but Thunder will require it to be reasonable for your personal information through signing a confidentiality agreement with these subjects.Confidential measures;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When the Thunder Plan is merged with other companies or was acquired or carried out or carried out other capital market activities (including but not limited to IPOs, bond issuance), and due to due diligence investigations by non -governmental institutions and government agencies, Xunlei obtained secondary authorization after obtaining secondary authorization.Will provide your information to the necessary subject"}
{"task": "rw_130.jsonl", "id": 78043, "text": "5.1.10, if you authorize the third direction of Thunder inquiries and collect your account -related information of your company's company's company, Xunlei has the right to share some information of your account from the third party within the scope of laws and regulations and your authorization license;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Thunder has the right to share some information of your account from a third party within the scope of laws and regulations with your authorized license"}
{"task": "rw_130.jsonl", "id": 78044, "text": "5.1.11 In order to maintain and improve services;", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78045, "text": "5.1.12, shared your personal information to the outside world in accordance with the provisions of laws and regulations, or in accordance with the mandatory requirements of the government authority.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "According to laws and regulations, or in accordance with the mandatory requirements of the government authority, share your personal information to the outside world"}
{"task": "rw_130.jsonl", "id": 78046, "text": "5.1.13, when the above situation is required to provide your information, we may obtain your authorization consent through pop -up windows and other methods. The pop -up window will form an effective part of the cost of the cost.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When the above situation needs to provide your information to the outside world, we may obtain your authorization consent through pop -ups and other methods."}
{"task": "rw_130.jsonl", "id": 78047, "text": "If you refuse to share your personal information with a third party when you provide services, it may cause you to be unable to use the services provided by the third party, but it does not affect other services on your platform.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you refuse to share your personal information with a third party, it may cause you to be unable to use the services provided by the third party, but it does not affect other services on your platform"}
{"task": "rw_130.jsonl", "id": 78048, "text": "5.2 Transfer information", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78049, "text": "We will transfer your personal information in the following circumstances:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will transfer your personal information in the following circumstances:"}
{"task": "rw_130.jsonl", "id": 78050, "text": "5.2.1, after getting your clear consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After getting your clear consent, transfer personal information"}
{"task": "rw_130.jsonl", "id": 78051, "text": "5.2.2, when involving mergers, acquisitions or bankruptcy liquidation, if personal information transfer, we will ask new companies that hold your personal information and organizations to continue to be subject to this policy, otherwise we will ask the company and organization to organize the organization and organizationRe -solicitting authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When involving mergers, acquisitions, or bankruptcy liquidation, if the transfer of personal information is involved, new personal information processors will continue to be constrained by the policy, otherwise they will ask them to solicit authorization consent"}
{"task": "rw_130.jsonl", "id": 78052, "text": "5.3 Discover information", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78053, "text": "We will publicly disclose your personal information in the following circumstances:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the following circumstances, publicly disclose your personal information:"}
{"task": "rw_130.jsonl", "id": 78054, "text": "5.3.1, after getting your clear consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After getting your clear consent, disclose personal information"}
{"task": "rw_130.jsonl", "id": 78055, "text": "5.3.2, based on legal disclosure: In the case of compulsory requirements of legal, legal procedures, litigation or government authorities, we may publicly disclose your personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the case of compulsory requirements of legal, legal procedures, litigation, or government authorities, you may disclose your personal information publicly"}
{"task": "rw_130.jsonl", "id": 78056, "text": "5.4 Entrusted processing", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78057, "text": "For the reliability and efficiency of improving the use and processing of information, and optimizing the purpose of Thunder services, we may entrust a professional third -party to deal with your personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You may entrust a professional third -party to process your personal information."}
{"task": "rw_130.jsonl", "id": 78058, "text": "5.5 The requirements provided by the outside world", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78059, "text": "Thunder will comply with the following requirements before sharing, transfer, disclose, and entrust your user information to third parties:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Thunder will comply with the following requirements before sharing, transfer, disclose, and entrust your user information to third parties:"}
{"task": "rw_130.jsonl", "id": 78060, "text": "5.5.1, carry out the evaluation of personal information security impact in advance, and take effective measures to protect your personal information according to the evaluation results;", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Before sharing, transfer, and commissioning, carry out the evaluation of personal information security impact in advance, and take effective measures to protect personal information according to the evaluation results"}
{"task": "rw_130.jsonl", "id": 78061, "text": "5.5.2, tell you the purpose of providing personal information and the type of data receiver.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Before sharing, transfer, and commission processing, inform you that the purpose of providing personal information and the type of data receiving party"}
{"task": "rw_130.jsonl", "id": 78062, "text": "Provide personal information that has been identified and processed, and ensure that the data receiver cannot re -identify your identity;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Before sharing, transfer, and commission processing, provide personal information that is identified as well as, and ensure that the data receiver cannot re -identify your identity"}
{"task": "rw_130.jsonl", "id": 78063, "text": "5.5.3, tell you the type of personal information involved, the purpose of provided, the identity and data security ability of the data receiver;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Before sharing, transfer, and entrust processing, inform the type of personal information, the purpose of provided, the identity and data security ability of the data receiver"}
{"task": "rw_130.jsonl", "id": 78064, "text": "5.5.4, accurately record and preserve the provision of personal information, including the date, scale, purpose, and the basic situation of the data receiver, etc.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Before sharing, transfer, and commission processing, accurately record and preserve the provision of personal information, including the date, scale, purpose, and the basic situation of the data receiver provided"}
{"task": "rw_130.jsonl", "id": 78065, "text": "5.5.5, help you understand the preservation, use of personal information, and your rights, such as access, correction, delete, canceling accounts, etc.;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Before sharing, transfer, and commission processing, help understand the preservation and use of personal information, as well as your rights, such as access, correction, deletion, cancellation of accounts, etc."}
{"task": "rw_130.jsonl", "id": 78066, "text": "5.5.6 Requires third parties to process and protect your personal information in accordance with this policy, our instructions or other related requirements.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78067, "text": "5.6 Thunder Open Platform", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78068, "text": "Regarding the open platform and user of the Thunder account: Thunder has provided the Thunder Account Open Platform Service (http://dev.open-am.xunlei.com) to third-party software, websites or applications.In the future, you can log in to third -party software, websites or applications, and use third -party software, websites or applications services and products.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78069, "text": "6. Users to manage their information and cancel accounts' rights", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78070, "text": "6.1 Query the user's personal information", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78071, "text": "Users can check the user's account information and use information on the personal center page or specific functional page.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78072, "text": "Account Information: You can log in to your personal account at any time through the related product page, check or access your personal information information in your account at any time, including: avatar, nickname, UID, gender, birthday, personal signature, etc.The access path of nickname, UID, gender, birthday, personal signature \"in\" Mobile Thunder APP \"is:\" My - Settings -Personal Information \";", "label": ["Edit/Control", "Important"], "rewrite": "You can log in to your personal account at any time through the related product page, check or access the personal information and information in your account at any time"}
{"task": "rw_130.jsonl", "id": 78073, "text": "Or through Thunder Personal Center: https://i.xunlei.com/xluser/account/acc_info.html, query personal information in the account number;", "label": ["Edit/Control", "Important"], "rewrite": "Or through Thunder Personal Center: https://i.xunlei.com/xluser/account/acc_info.html to query the personal information in the account;"}
{"task": "rw_130.jsonl", "id": 78074, "text": "Use information: You can access your usage information at any time through the related product page, including dynamic release content, collection records, historical records, etc. For example: \"Release Content\" information in the \"mobile phone Thunder APP\"- Personal avatar \": Click on the avatar to access the publishing content of the current login users;", "label": ["Important", "Edit/Control"], "rewrite": "You can access your use information at any time through the related product page"}
{"task": "rw_130.jsonl", "id": 78075, "text": "6.2 Correct user information", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78076, "text": "You can correct/modify your relevant personal information in our products and/services.", "label": ["Important", "Edit/Control"], "rewrite": "You can correct/modify your relevant personal information in our products and/services"}
{"task": "rw_130.jsonl", "id": 78077, "text": "In order to facilitate your above -mentioned rights, we provide you with two ways: online correction/modification and correct/modification application to us.", "label": ["Important"], "rewrite": "In order to facilitate exercise of the above rights, it provides two ways: online self -correction/modification and propose correction/modification application to us"}
{"task": "rw_130.jsonl", "id": 78078, "text": "For some of your personal information, we provide you with operational guidelines and operation settings on the relevant functional page of the product. You can directly correct/modify, such as: \"avatar, nickname, UID, gender, birthday, personal signature\" information on \"The correction/modification path in \"Mobile Thunder APP\" is: \"My - Settings -Personal Information\";", "label": ["Edit/Control", "Important"], "rewrite": "For some of your personal information, we provide you with operational guidelines and operation settings for the relevant function page of the product. You can directly correct/modify"}
{"task": "rw_130.jsonl", "id": 78079, "text": "Or log in directly to Xunlei Personal Center to complete the correction/modify https://i.xunlei.com/xluser/account/acc_info.html", "label": ["Important", "Edit/Control"], "rewrite": "Or log in directly to Xunlei Personal Center to complete the correction/modify https://i.xunlei.com/xluser/account/acc_info.html"}
{"task": "rw_130.jsonl", "id": 78080, "text": "For the difficulties you encountered in the process of exercising the above rights, or other may not/cannot provide you with online correction/modification permissions, verify your identity, and correct the objectivity and accuracy that does not affect the information of the information.Below, you have the right to correct or modify the error or incomplete information, or in specific circumstances, especially when data errors, you can publish the feedback & complaint address of the Customer Service Center: https: //help.xunlei.com/, submitted your correction/modification information to us, asking us to correct or modify your data, except for other provisions of laws and regulations.", "label": ["Important", "Edit/Control"], "rewrite": "You have the right to correct or modify the error or incomplete information"}
{"task": "rw_130.jsonl", "id": 78081, "text": "But for the consideration of security and identification, you may not be able to modify some initial registration information submitted during registration.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "For the consideration of security and identity, you may not be able to modify some initial registration information submitted during the registration"}
{"task": "rw_130.jsonl", "id": 78082, "text": "6.3 Delete user personal information", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78083, "text": "Generally speaking, we only save your personal information stipulated in laws and regulations or necessary and shortest times.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "It will only save your personal information in the laws and regulations or the shortest and short time"}
{"task": "rw_130.jsonl", "id": 78084, "text": "In order to facilitate your exercise of your above -mentioned deletion right, we provide you with two ways to delete online or ask us to delete your application.", "label": ["Edit/Control", "Important"], "rewrite": "In order to facilitate the exercise of the above -mentioned deletion right, it provides you with online deletion or proposal to us to delete the application."}
{"task": "rw_130.jsonl", "id": 78085, "text": "For some of your personal information, we provide you with operational guidelines and operation settings on the relevant functional page of the product. You can directly delete it.Mine: Personal avatar \": Click the avatar to delete the content of the current login users.", "label": ["Important", "Edit/Control"], "rewrite": "On the related functional page of the product, the operation guidance and operation settings are provided for you. You can directly delete"}
{"task": "rw_130.jsonl", "id": 78086, "text": "When you or we assist you to delete relevant information, because of the applicable legal and security technology, we may not be able to immediately delete the corresponding information from the backup system. We will securely store your personal information and separate it from any further processing.Until the backup can be removed or achieved anonymous.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "When the relevant information is deleted, the corresponding information may not be removed immediately from the backup system, and personal information is stored securely until the backup can be removed or achieved anonymous."}
{"task": "rw_130.jsonl", "id": 78087, "text": "6.4 Withdrawal of authorization", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78088, "text": "Permanent authorization withdrawal: Users can withdraw notifications, geographical location, storage space, etc. in the operating system of the device, or in the \"Thunder APP\" \"My-Settings-Application Power Settings\" (Android operation path) (Android operation path)\"Mine-Settings-Privacy Settings\" (iPhone operation path) withdrew the authorization of push notifications, geographical location, storage space, etc. of Thunder, and Thunder will no longer collect information related to these permissions after the withdrawal authorization.", "label": ["Important", "Edit/Control"], "rewrite": "Users can withdraw the authorization notification, geographical location, storage space, etc. in the operating system of the device. After the withdrawal authorization, Thunder will no longer collect information related to these permissions."}
{"task": "rw_130.jsonl", "id": 78089, "text": "Privacy policy agrees to withdraw: users can \"My-Settings-Settings-\" Thunder-\"Thunder Privacy Policy\" -I has agreed to \"Thunder Privacy Policy\" \"and cancel\" I have agreed to the \"Thunder Privacy Policy Policy Policy\"\"The options are checked, so as to withdraw the consent of privacy policies.", "label": ["Important", "Edit/Control"], "rewrite": "Users can in the \"Thunder APP\" \"Mine-Settings-About Thunder-\" Thunder Privacy Policy \"-I have agreed to\" Thunder Privacy Policy \"\" and cancel the \"I have agreed to the\" Thunder Privacy Policy \"option.Selected, so as to withdraw the consent of privacy policy"}
{"task": "rw_130.jsonl", "id": 78090, "text": "After the user withdrew the authorization, Xunlei could not continue to provide the corresponding services of the authorization, and no longer handled the corresponding information of the user.", "label": ["Important", "Edit/Control"], "rewrite": "After the user withdrew the authorization, Xunlei could not continue to provide the corresponding services of the authorization, and no longer handled the corresponding information of the user."}
{"task": "rw_130.jsonl", "id": 78091, "text": "The decision to withdraw authorization of the user does not affect the information processing based on the user's authorization.", "label": ["Permission Acquisition", "Edit/Control", "Risk", "Important"], "rewrite": "The decision to withdraw authorization of the user does not affect the information processing based on the user's authorization."}
{"task": "rw_130.jsonl", "id": 78092, "text": "6.5 Logging out your account", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78093, "text": "Users can pass, http://i.xunlei.com/xluser/logoff/notice.html, or cancel the account number on the \"My-Settings-Account and Security-Account Logistics\" page.", "label": ["Important", "Edit/Control"], "rewrite": "Users can cancel the account number through http://i.xunlei.com/xluser/logoff/notice.html or on the \"I-Settings-Account and Security-Account Logging\" page."}
{"task": "rw_130.jsonl", "id": 78094, "text": "When you cancel your account, it is an irreversible operation because there are members such as members, game equipment and other high -value property in the account. To avoid the cancellation of the use of the user or the malicious cancellation of the user or the malicious cancellation, it will cause losses to the user.Provide ID number information and mobile phone numbers to verify your identity and determine whether you support your cancellation request for the use of all products and/or services of Thunder, but we will complete the verification and cancellation within 15 working days.", "label": ["Important", "First Party Collection Information", "Edit/Control"], "rewrite": "You need to collect ID number information and mobile phone numbers to verify your identity, and determine whether to support cancellation requested in conjunction with usage."}
{"task": "rw_130.jsonl", "id": 78095, "text": "But we will not set unreasonable obstacles for your cancellation behavior.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78096, "text": "If you have a third -party payment service such as a third -party payment service such as Alipay, WeChat, Apple, and telecommunications operators, etc.Signing or authorization relationship of third -party payment services.", "label": ["Important", "Edit/Control"], "rewrite": "Please dismiss your signing or authorization of your Thunder account and third -party payment service before canceling"}
{"task": "rw_130.jsonl", "id": 78097, "text": "The user information provided when canceling the account is only used to verify the security of the cancellation account, and Thunder will be desensitized and confidential.", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "The user information provided when canceling the account is only used to verify the security of the cancellation account, and Thunder will be desensitized and confidential."}
{"task": "rw_130.jsonl", "id": 78098, "text": "After the cancellation is completed, we no longer provide you with services, and no longer collect your personal information, and delete your personal information or anonymous processing related to your requirements according to your requirements, but the laws and regulations or regulatory agencies storage time for user information storage timeExcept for other regulations.", "label": ["Important", "Edit/Control"], "rewrite": "After the cancellation is completed, it will no longer provide you with services, and no longer collect your personal information, and delete personal information or treat it anonymous, but the laws and regulations or regulators are stipulated in the user information storage time."}
{"task": "rw_130.jsonl", "id": 78099, "text": "6.6 Personal information copy acquisition and transfer", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78100, "text": "If you need your personal information copy, you can contact us through the method provided by this privacy policy section 10. After verifying your identity, we will provide you with your personal information copy in our service, but laws and regulationsExcept for other regulations.", "label": ["Important", "Edit/Control"], "rewrite": "After verifying your identity, we will provide you with your personal information copy in our service, except for other provisions of laws and regulations"}
{"task": "rw_130.jsonl", "id": 78101, "text": "If you need to transfer your personal information, you can contact us through the method provided by section 10 of this privacy policy. After verifying your identity, we will assist you in accordance with the requirements of relevant laws and regulations.", "label": ["Important", "Edit/Control"], "rewrite": "After verifying your identity, we will help you transfer personal information according to the requirements of relevant laws and regulations"}
{"task": "rw_130.jsonl", "id": 78102, "text": "6.7 Automatic decision -making information system automatic decision -making", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78103, "text": "In certain business functions, we may make decisions only based on the non -artificial automatic decision -making mechanism, including information systems, algorithms, etc.", "label": ["Important", "Usage"], "rewrite": "Decisions are made based on the non -artificial automatic decision mechanism, including information systems, algorithms, etc."}
{"task": "rw_130.jsonl", "id": 78104, "text": "If these decisions significantly affect your legitimate rights and interests, you can contact us through the method provided by section 10 of this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78105, "text": "6.8 User feedback & complaint & response to your above request", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78106, "text": "If you have any issues, opinions or suggestions on this \"Privacy Policy\" and your information related to this \"Privacy Policy\", and you can contact us with issues of privacy measures about this statement or Thunder (Webpage visit https://help.xunlei.com/, and submit a complaint to the mailbox: xlkefu@xunlei.com, contact number: 400-11111-000), we will receive your feedback [7] work that work that you are receiving your feedback.Reply within the day.", "label": ["Important", "Contact Information"], "rewrite": "Submit a complaint contact mailbox: xlkefu@xunlei.com, contact number: 400-1111-000"}
{"task": "rw_130.jsonl", "id": 78107, "text": "7. Special agreed privacy of minors", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78108, "text": "7.1 Protecting minor information", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78109, "text": "Thunder will establish and maintain reasonable procedures to protect the confidentiality and security of juvenile personal data.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78110, "text": "Thunder solemnly stated: Any minor under 18 years of age should be verified by the parents or its legal guardians (hereinafter collectively referred to as \"guardian\") in advance.", "label": ["Specific Audiences", "Important"], "rewrite": "Any minor under 18 years of age should be consent to the parents or its legal guardians (hereinafter collectively referred to as the \"guardian\")."}
{"task": "rw_130.jsonl", "id": 78111, "text": "Thunder will protect personal information of minors in accordance with the requirements of relevant national laws and regulations.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78112, "text": "7.2 Unaware of the consent of the guardian", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78113, "text": "Without the consent of the guardian, Xunlei will not use the personal information of minors, nor will it disclose or transmit personal information that can be recognized by any third party.Or except in emergency situations to maintain the privacy and security of users and the public.", "label": ["Specific Audiences", "Important"], "rewrite": "Without the consent of the guardian, Xunlei will not use the personal information of minors, nor will it disclose or transmit to any third party to identify the personal information that can be recognized."}
{"task": "rw_130.jsonl", "id": 78114, "text": "7.3 The consent of the guardian", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78115, "text": "After the consent of the prosecutors of the minor, Thunder may collect the necessary personal information of minors, but these materials are simply used to protect the security of minors when they participate in network activities, rather than the use of other goals.", "label": ["Specific Audiences", "First Party Collection Information", "Important"], "rewrite": "After the consent of the prosecutors of the minor, Xunlei may collect the necessary personal information of minors"}
{"task": "rw_130.jsonl", "id": 78116, "text": "Thunder guarantees that minors will not request additional personal information as a condition for allowing them to participate in online activities.", "label": ["Specific Audiences", "First Party Collection Information", "Important"], "rewrite": "Thunder guarantees that minors will not require minors to provide additional personal information as a condition to allow them to participate in online activities"}
{"task": "rw_130.jsonl", "id": 78117, "text": "7.4 Information deletion", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78118, "text": "If we find that we collect the personal information of minors without the consent of the guardian in advance, or if the guardian of the minor withdraws from the consent, it will try to delete the relevant information as soon as possible.", "label": ["Specific Audiences", "Data Security", "Important"], "rewrite": "If the personal information of minors is collected without the consent of the guardian in advance, or if the guardian of the minor is withdrawn, the relevant information will be deleted as soon as possible as soon as possible"}
{"task": "rw_130.jsonl", "id": 78119, "text": "7.5 The guardian contacts us", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78120, "text": "If you are the guardian of the minor, when you have any questions about the personal information of the minors you monitor, please contact us.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78121, "text": "8. Application and update of this policy", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78122, "text": "8.1 Revision notice", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78123, "text": "In order to better serve users and business development, Thunder will revise this policy in a timely manner.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78124, "text": "During the revision, Xunlei will display the changes after a reasonable form such as push notification, pop -up window, station letter, and announcement.", "label": ["Policy Change", "Important"], "rewrite": "During the revision, Xunlei will display the changes after a reasonable form such as push notification, pop -up window, station letter, and announcement."}
{"task": "rw_130.jsonl", "id": 78125, "text": "8.2 Accepting revision", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78126, "text": "If you continue to use Thunder services after the policy update is effective, it means that you have fully read, understand and accept the updated policy and are willing to be subject to updated policy constraints.", "label": ["Policy Change", "Important"], "rewrite": "After the renewal of this policy continues to use the Thunder service, it means that it has fully read, understands and accepts the updated policy, and is willing to be constrained by the updated policy"}
{"task": "rw_130.jsonl", "id": 78127, "text": "9. Application with laws under jurisdiction", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78128, "text": "9.1 Law applicable", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78129, "text": "The establishment, effectiveness, performance, interpretation, and dispute resolution of this policy applies to laws of the People's Republic of China in mainland China.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78130, "text": "9.2 Jurisdiction", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78131, "text": "If you have any disputes or disputes with us, you should first solve the friendly negotiation;", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78132, "text": "If the negotiation is not possible, you agree to submit disputes or disputes to the people's court with jurisdictions (Nanshan District, Guangdong Province, Guangdong Province, Guangdong Province, China).", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78133, "text": "10. Contact us", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78134, "text": "If you have any questions, opinions or suggestions on this policy, you can contact us in the following ways:", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78135, "text": "Company Name: Shenzhen Xunlei Network Technology Co., Ltd.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78136, "text": "Address: 21st Floor, Block B, Building 12, Shenzhen Bay Science and Technology Ecological Park, No. 18 Keji South Road, Nanshan District, Shenzhen", "label": ["Important", "Contact Information"], "rewrite": "Address: 21st Floor, Block B, Building 12, Shenzhen Bay Science and Technology Ecological Park, No. 18 Keji South Road, Nanshan District, Shenzhen"}
{"task": "rw_130.jsonl", "id": 78137, "text": "Personal information protection Related feedback Tel: 400-11111-000", "label": ["Important", "Contact Information"], "rewrite": "Personal information protection Related feedback Tel: 400-11111-000"}
{"task": "rw_130.jsonl", "id": 78138, "text": "Contact email: xlkefu@xunlei.com", "label": ["Important", "Contact Information"], "rewrite": "Contact email: xlkefu@xunlei.com"}
{"task": "rw_130.jsonl", "id": 78139, "text": "We will arrange a specialist to provide you with consultation or coordination to solve your complaints and feedback.", "label": [], "rewrite": []}
{"task": "rw_130.jsonl", "id": 78140, "text": "After receiving the feedback, we will reply within 7 working days.", "label": [], "rewrite": []}
