{"task": "rw_107.jsonl", "id": 72419, "text": "Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72420, "text": "This privacy policy was updated on January 19, 2022", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72421, "text": "Shanghai.com's Yiwang Technology Development Co., Ltd. (hereinafter referred to as \"Yisi\" or \"us\") attaches importance to the privacy and security of our players and online visitors, and will ensure that you in accordance with relevant laws and regulations and this privacy policy.Personal information.", "label": [], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72422, "text": "This privacy policy clarifies how we collect, store and use your personal information provided to us through the following websites, applications and game products:", "label": [], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72423, "text": "The website includes but not limited to: www.battlenet.com.cn, www.blizzardgames.cn, www.wowchina.com, www.blizzard.cn, and its subsequent inheritance website, etc.;", "label": [], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72424, "text": "Mobile applications include, but not limited to: Battle Network APP, Battle.net Security Order, \"Hearthstone Legend\", \"World of Warcraft\" with you;", "label": [], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72425, "text": "Game products include but are not limited to: \"World of Warcraft®\", \"Warcraft®\", \"Hearthstone Legend®\", \"Heroes of the Storm\", \"Overwatch®\", \"Diablo Aii® III\", \"StarCraft®\"wait.", "label": [], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72426, "text": "This privacy policy is applicable to personal information that we collect, use, store, and provide through the above channels.", "label": [], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72427, "text": "For personal information that collects, use, store, and provide personal information through other channels, we will formulate other separate privacy policies or sign an agreement with you.", "label": [], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72428, "text": "We will collect and use your personal information for the following purposes described in this privacy policy.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72429, "text": "If we want to use your personal information for other purposes that have not been stated in this privacy policy, or use the information collected for other purposes based on specific purposes, or if you need to authorize it according to laws and regulations, we will be reasonableThe method will tell you and obtain your consent again before use.", "label": ["Usage"], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72430, "text": "Before using the products or services we provide, please read this privacy policy carefully and make the appropriate choice you think.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72431, "text": "For issues or policies on privacy protection, please contact us through the following website:, https://www.battlenet.com.cn/support/zh//zh/", "label": ["Important", "Contact Information"], "rewrite": "Contact us through the following website: https://www.battlenet.com.cn/support/zh//"}
{"task": "rw_107.jsonl", "id": 72432, "text": "who are we?", "label": [], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72433, "text": "For this privacy policy, the personal information processor is Shanghai Net Technology Development Co., Ltd., which is located in Room 301-A, Building, No. 5, Bobo Road, Pudong New District, Shanghai, China.", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72434, "text": "Shanghai.com has been designated as a Blizzard® Blizzard Services and Blizzard Games (including but not limited to: \"Blizzard Entertainment (Blizzard Entertainment) and its related companies (collectively referred to as\" Blizzard \").Warcraft ® \"\" \"Warcraft ®\", \"Hearthstone Legend®\", \"Storm Heroes ™\", \"Overwatch®\", \"Diablo AII\", \"StarCraft®\") ServicesThe purpose is not included in the Hong Kong, Macao and Taiwan region, and the exclusive permission in the region in the region.", "label": [], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72435, "text": "Shanghai.com is a related company of Netease.com (Netease.com, Inc.).", "label": [], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72436, "text": "What personal information will we collect?", "label": [], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72437, "text": "In the process of using the game service you provided, we will collect the information that you actively provide or because of the service provided by the service as follows, to provide you, optimize our services, and ensure your account securityThe", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72438, "text": "(1) Account registration", "label": [], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72439, "text": "When you register or use the game services we provide, we will collect personal information such as your phone number, email address to create the only account for you and mark your game users.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect personal information such as your phone number, email address, and other personal information for creating an account and marking you as a game user."}
{"task": "rw_107.jsonl", "id": 72440, "text": "In order to meet the relevant laws, regulations, policies and the requirements of relevant competent authorities, our game users need to perform real -name certification to continue to use our games.", "label": ["Important", "Usage"], "rewrite": "Game users need to perform real -name authentication to continue using the game."}
{"task": "rw_107.jsonl", "id": 72441, "text": "We will collect your real -name identity information (including name, ID number, photo, etc.) when obtaining your consent or proactive provision.Our platform and games.", "label": ["Important", "First Party Collection Information"], "rewrite": "Refusing to provide real -name identity information may cause you to be unable to log in to our platform and games."}
{"task": "rw_107.jsonl", "id": 72442, "text": "(2) Use game service", "label": [], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72443, "text": "When you use our game service, we will collect your game log information, such as logging in logs to use customer service complaints, prevent cheating and fraud and other game security analysis.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your game log information for customer service complaints, prevent cheating and fraud and other game security analysis."}
{"task": "rw_107.jsonl", "id": 72444, "text": "In addition, we may receive and record related information (such as IMEI, IDFA, device models, operating systems and versions, customers, customersEdition), IP address, etc., for customer service complaint processing and other game security analysis.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect the relevant information, IP address, etc. you use for customer service complaint processing and other game security analysis."}
{"task": "rw_107.jsonl", "id": 72445, "text": "(3) Buy product or service", "label": [], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72446, "text": "When you use the game product or service purchase function provided by our platform, we will collect information such as your recharge records, consumption records, etc., in order to provide services and allow you to inquire about your transaction records, and at the same time protect your virtual items to the greatest extentSafety.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect information such as your recharge records, consumption records in order to provide services and allow you to inquire about transaction records while protecting the safety of virtual items."}
{"task": "rw_107.jsonl", "id": 72447, "text": "The information we collected under this business function includes sensitive personal information. Collecting the above information is necessary to achieve the consumption function of game products, otherwise the transaction will not be completed.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect recharge information and consumer records are necessary for the consumption function of game products."}
{"task": "rw_107.jsonl", "id": 72448, "text": "(4) Message board, forum, and in -game interaction", "label": [], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72449, "text": "When you interact with other users through our message board, forum or in the game through text, pictures, voice, videos, and other methods, we may collect and save the above information content you send to filter pornPolitics, abuse, malicious advertising and other improper content, in order to perform improper behavior analysis, prevent cheating and fraud, supervise bad speech, or implement the \"Battle Network End User License Agreement\"", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect and save the content of the interactive information you sent to filter improper content such as pornography, violence, politics, abuse, and malicious advertisements."}
{"task": "rw_107.jsonl", "id": 72450, "text": "(5) Survey questionnaire", "label": [], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72451, "text": "If you participate in the questionnaire we conduct, we may ask you to provide other personal information, such as your age, birth date, gender and/or game and preference platforms, and integrate this kind of information with your personal information, use it, useTo improve our products and services.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect the integration of other personal information provided by you when participating in the questionnaire with existing personal information to improve our products and services."}
{"task": "rw_107.jsonl", "id": 72452, "text": "(6) Customer service or technical support", "label": [], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72453, "text": "In order to provide you with customer service or technical support, we may need you to provide the necessary personal information for authentication to ensure your account security.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your necessary personal information for authentication to provide customer service or technical support."}
{"task": "rw_107.jsonl", "id": 72454, "text": "In order to provide services in accordance with your demands, after your authorization, artificial customer service personnel need to inquire or verify your relevant information within the scope of your authorization. We will take technical and management measures to ensure your information security and confidentiality, and within the necessary range, and within the necessary rangeUse.", "label": ["Important", "Data Security", "Usage"], "rewrite": "Inquiry or verification of relevant information within your authorization scope, we will adopt technical and management measures to ensure information security and confidentiality."}
{"task": "rw_107.jsonl", "id": 72455, "text": "We may also save your contact information (the mobile phone number, email address or other contact information you use or actively provided), your communication records and content with us, and other necessary information to provide you with and record customersServe.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Save your contact information, your communication records and content and other necessary information for customer service."}
{"task": "rw_107.jsonl", "id": 72456, "text": "(7) Real -name friends", "label": [], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72457, "text": "Real -name friends are a function that allows you to show your registered name (\"registered name\") and other information to other users who use the service through real -name friends.", "label": [], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72458, "text": "If you use the real -name friend's function and agree to the invitation of other real -name friends users, then real -name friends can see the registered names of each other and can see all the product roles and services of each other under the war network.", "label": ["Third Party Sharing/ Disclosure", "Edit/Control", "Usage", "Important"], "rewrite": "When using real -name friends functions and accepting other users' invitation, real -name friends can see each other's registered names and all product roles and services under the war network."}
{"task": "rw_107.jsonl", "id": 72459, "text": "Join the real -name friend, your registered name will also be displayed to your real -name friend of your real -name friend. The real -name friend can also invite you to become her/his real -name friend.", "label": ["Edit/Control", "Important"], "rewrite": "Join a real -name friend, your registered name will be displayed to a real -name friend."}
{"task": "rw_107.jsonl", "id": 72460, "text": "When you and a real -name friend's functional user agrees to become real -name friends, the functions you can use include:", "label": [], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72461, "text": "When friends can see each other registered names:, when chatting or in -game dialogue or viewing character information, the real -name friends on your friend list will display their registration name;", "label": ["Important", "Usage"], "rewrite": "After becoming a real -name friend, you can see each other's name."}
{"task": "rw_107.jsonl", "id": 72462, "text": "Cross -region, cross -game chat: With real -name friends, friends can cross -region in products and services under the Battle Network platform, cross -game races, and cross -game products;", "label": [], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72463, "text": "Rich information: You will see other information on your friends list. Your real -name friend is doing something in the product under the Battle.net platform.", "label": [], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72464, "text": "(8) News and notice", "label": [], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72465, "text": "Your information will enable us to provide the products or services you ordered the products or whether you can (depending on whether you choose these functions or services), notify you about new products, services, functions, or improved information, process/arrange your required you needCustomer service/technical inquiry or question, and/or notify your latest updates, competitions, promotional information, special activity information or discounts.", "label": ["Important", "Usage"], "rewrite": "Your information is used to provide the products or services you ordered, notify youUpdate, competition, promotional information, special activity information or discounts."}
{"task": "rw_107.jsonl", "id": 72466, "text": "(9) Others", "label": [], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72467, "text": "We may apply your information in marketing, chart analysis, or user statistics to make products and services more in line with user needs.", "label": ["Important", "Usage"], "rewrite": "Your information may be applied to marketing, chart analysis or user statistics."}
{"task": "rw_107.jsonl", "id": 72468, "text": "The purpose of this approach is to better understand and serve our users.", "label": [], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72469, "text": "In addition, according to the law, in the following circumstances, we collect and use your personal information without obtain your authorization consent:", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "According to the law, in the following circumstances, we collect and use your personal information without obtain your authorization consent:"}
{"task": "rw_107.jsonl", "id": 72470, "text": "To fulfill the statutory duties or the requirements of the statutory duty;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to fulfill the statutory duties or the required requirements of the statutory volunteer, no authorization is required;"}
{"task": "rw_107.jsonl", "id": 72471, "text": "In order to deal with emergencies, or in urgent situations, it is necessary to protect the health and property security of natural people in emergency situations;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to cope with emergencies, or in urgent situations, it is necessary to protect the life and health and property safety of natural people, and no authorization is required;"}
{"task": "rw_107.jsonl", "id": 72472, "text": "Implement news reports, public opinion supervision and other behaviors for public interests, and handle personal information within a reasonable range;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Implement news reports, public opinion supervision and other behaviors for public interests, and handle personal information within a reasonable range without obtaining authorization;"}
{"task": "rw_107.jsonl", "id": 72473, "text": "Card the personal information of individuals or other legal disclosure within a reasonable scope in accordance with the law;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In accordance with the law, handle individuals' self -disclosure or other personal information that have been legal and disclosed within a reasonable scope, and no authorization is required;"}
{"task": "rw_107.jsonl", "id": 72474, "text": "You ask for signing and fulfilling the necessary contract;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "You require the signing and performance of the contract, no need to obtain authorization;"}
{"task": "rw_107.jsonl", "id": 72475, "text": "Other circumstances stipulated in laws and regulations.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Other circumstances stipulated in laws and regulations need to be authorized."}
{"task": "rw_107.jsonl", "id": 72476, "text": "How do we save your information?", "label": [], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72477, "text": "We will only retain your personal information during the period of time and time limit required by the purpose of the privacy policy, and your information will be stored in the territory of the People's Republic of China after collecting.", "label": ["Data Retention", "Important"], "rewrite": "Reserve personal information within the necessary time limit and store in China."}
{"task": "rw_107.jsonl", "id": 72478, "text": "When we no longer need to use your personal information, we will delete these information and/or anonymous measures in the system and records so that your identity cannot be recognized (unless we comply with the law or regulatory obligations we must comply withYou need to keep your information).", "label": ["Data Retention", "Important"], "rewrite": "For personal information we no longer need to use, it will delete or anonymous in systems and records, except for other provisions of laws and regulations."}
{"task": "rw_107.jsonl", "id": 72479, "text": "Who will your personal information be provided?", "label": [], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72480, "text": "In order to provide you with our services, we fulfill our obligations in the \"Battle Network End User License\" or in this privacy policy and exercise our rights, understand, maintain and improve our services.", "label": [], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72481, "text": "We may need to provide your personal information to the following third parties.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72482, "text": "Our service provider:, we may need to provide your personal information (based on whether these functions or services are provided to determine whether it is applicable) to third -party service providers to complete product order. Specific services include account login, payment, mail processing, Message push, account security, cracking down cheating, voice services, or processing, analysis and/or storage data.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We may need to provide your personal information to third -party service providers to complete specific services such as product order."}
{"task": "rw_107.jsonl", "id": 72483, "text": "To achieve the above, we may access the software tool development package (\"SDK\") provided by a third -party service provider or other similar applications in order to provide you with a better game service and user experience. For details, see the list here.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may access the software tool development package provided by third -party service providers."}
{"task": "rw_107.jsonl", "id": 72484, "text": "We will ask these companies not to use your personal information as any other purposes and ask them to maintain the confidentiality, security and integrity of our personal information.", "label": ["Important", "Data Security"], "rewrite": "We will require third -party companies to use personal information as other purposes and maintain the confidentiality, security and integrity of personal information."}
{"task": "rw_107.jsonl", "id": 72485, "text": "SDK's specific information collection and usage should be based on the privacy policy or related statement of the SDK operator.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72486, "text": "We reserved the right to disclose your personal information because of law, including but not limited to in response to the state's disclosure of the country's requirements for preventing minors from adding to the requirements of online games, that is, when the parents of the minor's parents or guardians are effective requirementsWe can reveal some individuals and/or game information of minors to their parents or guardians.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We reserve the right to disclose your personal information due to law.\nIn response to the requirements of anti -fidelity, we can disclose some individuals and/or game information of minors to their parents or guardians."}
{"task": "rw_107.jsonl", "id": 72487, "text": "In addition, if you violate the use terms contained in this website or product may be agreed, or it may be caused by the rights or property of us or Blizzard, other users of this website or product, or anyone who may be hurt by your behavior,(Intentionally or unintentional) damage or obstruction, we retain the right to provide your personal information in accordance with laws and regulations under special circumstances.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you violate the terms of use may be agreed or may cause damage or obstructing others, we will retain the right to provide your personal information in accordance with laws and regulations under special circumstances."}
{"task": "rw_107.jsonl", "id": 72488, "text": "Like other areas, your personal information is also asset and will become part of our conventional business archives.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Your personal information is also asset and will become part of our conventional business archives."}
{"task": "rw_107.jsonl", "id": 72489, "text": "And, if we decide to sell a certain product line, license or outsourcing to third parties, we will also transfer your personal information to third parties at the same time, so that you can continue to obtain services and information about the product, minimize as much as possible to youImpact.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Your personal information may be transferred to a third party with a certain product line, license or outsourcing."}
{"task": "rw_107.jsonl", "id": 72490, "text": "Similar situations also include the company's merger, acquisition, reorganization, bankruptcy or other similar events. In this situation, your personal information will be transferred to our successor or designated party.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The company's merger, acquisition, reorganization, bankruptcy or other similar incidents, your personal information will be transferred to our successor or designated party."}
{"task": "rw_107.jsonl", "id": 72491, "text": "We will tell you the name and contact information of the personal information receiver and ask the receiver to continue to abide by the constraints of this policy.", "label": [], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72492, "text": "This website has information boards and/or chat areas for users to exchange opinions and communicate with each other.", "label": [], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72493, "text": "Please pay attention when you publish information in the information board or chat area. Please pay attention to the information published on the Internet, and information publishers will be responsible for this.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The information you posted on the information board or chat area will be made public on the Internet, and you will be responsible for it."}
{"task": "rw_107.jsonl", "id": 72494, "text": "You know and agree to the purpose of our privacy policy and share your personal information with the above third parties according to its regulations.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72495, "text": "At the same time, as a battle network service in mainland China (excluding Taiwan, Hong Kong Special Administrative Region, and Macau Special Administrative Region) designated as a Blizzard's Republic of China (exclusive to the licensee and operating party in the mainland of the People's Republic of China (excluding Taiwan, Hong Kong Special Administrative Region and the Macau Special Administrative Region), we may provide you with your individual to BlizzardInformation so that we can provide you with better game services and user experiences, including account security, cracking down on cheating, or processing, analyzing data, etc.", "label": [], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72496, "text": "We will take all reasonable and necessary measures to ensure that your personal information is handled safely and properly, and complies with this privacy policy and applicable data protection laws.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72497, "text": "If we need to transmit your personal information to overseas partners, we will also take reasonable and necessary measures to meet the provisions and requirements under the applicable legal items.", "label": ["Important", "Risk"], "rewrite": "If we need to transmit your personal information to overseas partners, we will also take reasonable and necessary measures."}
{"task": "rw_107.jsonl", "id": 72498, "text": "Recommended by personal information for personalized recommendations", "label": [], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72499, "text": "We allow you to control the personal information we can get.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72500, "text": "While you provide personal information, we will let you choose whether to receive information such as future new products, publicity, service and other information.", "label": ["Important", "Edit/Control"], "rewrite": "When you provide personal information, you can choose whether to receive information such as future new products, publicity, service and other information."}
{"task": "rw_107.jsonl", "id": 72501, "text": "At any time, if you want to stop (via email or mail) to receive information about new products, services, publicity, personalized decision -making, or targeted advertisements, you can contact us through the following website https://www.battlenet.com.cn/support/zh/.", "label": ["Important", "Edit/Control"], "rewrite": "You can contact us to stop receiving relevant information through the following website.https://www.battlenet.com.cn/support/zh//"}
{"task": "rw_107.jsonl", "id": 72502, "text": "Please write the name of the message or service that you do not want to continue to receive so that we can better solve it for you.", "label": [], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72503, "text": "Please note that not all of our products provide such services. For details, please refer to the setting options for each product.", "label": ["Important", "Edit/Control"], "rewrite": "Not all products provide services to stop receiving information. For details, please refer to the setting options for each product."}
{"task": "rw_107.jsonl", "id": 72504, "text": "Do we collect personal information of minors?", "label": [], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72505, "text": "Child supervisor needs to know", "label": [], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72506, "text": "Once a minor declared that he was a child under the age of 14, he should obtain the consent of the child supervisor before creating his own personal information subject account.", "label": ["Specific Audiences", "Important"], "rewrite": "Children under the age of 14 can create their own personal information main account after obtaining the consent of the guardian."}
{"task": "rw_107.jsonl", "id": 72507, "text": "In addition to the must -have privacy policies, children's guardians will need to read and agree to the \"Children's Privacy Policy\".", "label": ["Policy Change", "Specific Audiences", "Important"], "rewrite": "In addition to the must -have privacy policies, children's guardians will need to read and agree to the \"Children's Privacy Policy\"."}
{"task": "rw_107.jsonl", "id": 72508, "text": "Regarding the consent of the guardian to collect children's personal information, we will only process this information when they are allowed or guarded by law or guardian to clearly agree or protect children.", "label": ["Specific Audiences", "Important"], "rewrite": "We will only process the collection of collected information when they are allowed or guarded by law or guardians to protect children."}
{"task": "rw_107.jsonl", "id": 72509, "text": "If we find that the child's personal information is collected without the consent of the guardian in advance, we will try to delete relevant information as soon as possible.", "label": ["Specific Audiences", "Important"], "rewrite": "If the personal information of minors was collected without the consent of the parents, he would try to delete relevant information as soon as possible."}
{"task": "rw_107.jsonl", "id": 72510, "text": "Young guardian needs to know", "label": [], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72511, "text": "Young people aged 14 to 18 should read and agree, and should notify the guardian to read this privacy policy, and contact us when revoking services or asking questions.", "label": ["Specific Audiences", "Important"], "rewrite": "Young people aged 14 to 18 should read and agree, and should notify the guardian to read this privacy policy, and contact us when revoking services or asking questions."}
{"task": "rw_107.jsonl", "id": 72512, "text": "We recognize the special responsibility of protecting the personal information of minors.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72513, "text": "We urge the guardian to guide the minor and not to reveal your real name, address or telephone number and other personal information to others in the network without permission.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72514, "text": "What is Cookie?", "label": [], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72515, "text": "How will we use cookies?", "label": [], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72516, "text": "Cookie is a feature of your web browser, allowing the website to send a certain amount of information to your computer for saving records.", "label": [], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72517, "text": "COOKIE stored on your computer can be used to \"memory\" certain information, such as your password or recorded items you have registered, by saving you input your password or registration information, so that you will be on the website in the future on the websiteThe operation is faster and time -saving.", "label": ["Important", "First Party Collection Information"], "rewrite": "Cookie can be used to collect and save certain information."}
{"task": "rw_107.jsonl", "id": 72518, "text": "In addition, for publicity, marketing or security considerations, we will also recover user information through cookies.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will recover user information through cookies."}
{"task": "rw_107.jsonl", "id": 72519, "text": "We use cookies for the following goals:", "label": [], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72520, "text": "Realize the basic functions of the website;", "label": ["Important"], "rewrite": "Use cookies to implement the basic functions of the website;"}
{"task": "rw_107.jsonl", "id": 72521, "text": "Carry out network analysis to improve our website (structure, function, accessibility, availability and content) or solve technical problems by collecting related technical data;", "label": ["Important", "Usage"], "rewrite": "Cookie is used to improve our website or solve technical problems by collecting related technical data."}
{"task": "rw_107.jsonl", "id": 72522, "text": "Look at the effectiveness of our online advertising and marketing (by recording your advertising with us on a third -party website, our social media platform, or our marketing email);", "label": ["Important", "Usage"], "rewrite": "Cookie is used to view the effectiveness of online advertising and marketing."}
{"task": "rw_107.jsonl", "id": 72523, "text": "Understand more information about your preferences and online browsing habits in order to provide you with personalized advertisements (we believe you don't want to see advertisements you are not interested in).", "label": ["Important", "Usage"], "rewrite": "Understand your preferences and online browsing habits through cookies to provide personalized advertisements."}
{"task": "rw_107.jsonl", "id": 72524, "text": "How to manage your cookies", "label": [], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72525, "text": "Most browsers of computers, smartphones and other network devices are usually set to accept cookies.", "label": [], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72526, "text": "If you want to modify the cookies options of our website or any other website, you can set up refusal or managing cookies through your browser settings.", "label": ["Edit/Control", "Important"], "rewrite": "You can refuse or manage Cookies through the browser."}
{"task": "rw_107.jsonl", "id": 72527, "text": "Please note that Cookies itself is often used to enable and improve the functions of our website.", "label": [], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72528, "text": "If you choose to close some cookies, it may affect our website operation.", "label": ["Important", "Edit/Control"], "rewrite": "If you choose to close some cookies, it may affect our website operation."}
{"task": "rw_107.jsonl", "id": 72529, "text": "What personal information protection rights do you have?", "label": [], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72530, "text": "Regarding your personal information, you have the following rights:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72531, "text": "Review:, you can apply to us to check and copy your personal information (but except the situation that should be kept confidential or not needed according to the law).", "label": ["Edit/Control", "Important"], "rewrite": "You can apply to us to check and copy your personal information."}
{"task": "rw_107.jsonl", "id": 72532, "text": "For your privacy and security, we may ask you to prove your identity as appropriate before providing you.", "label": ["Important", "Edit/Control"], "rewrite": "We may take your identity verification before you will provide you with information."}
{"task": "rw_107.jsonl", "id": 72533, "text": "Correction: You have the right to ask us to correct and supplement your incomplete or inaccurate personal information, and we will correct and supplement it after verifying it.", "label": ["Important", "Edit/Control"], "rewrite": "You have the right to ask us to correct and supplement your incomplete or inaccurate personal information."}
{"task": "rw_107.jsonl", "id": 72534, "text": "Delete right: In the following circumstances, we will take the initiative (you also have the right to request a request to us through the contact information provided by this privacy policy) to delete or anonymous processing your personal information or (if the preservation period determined by the law is not expired,Or delete personal information from technically difficult to achieve) to stop making any unnecessary processing:", "label": ["Important", "Edit/Control"], "rewrite": "You can ask us to delete or anonymize your personal information or stop making any unnecessary processing."}
{"task": "rw_107.jsonl", "id": 72535, "text": "The treatment purpose has been achieved, cannot be achieved, or is not necessary for the purpose of the treatment;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72536, "text": "We stop providing products or services, or the storage period has expired;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72537, "text": "You withdraw consent;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72538, "text": "Our collection, use or processing of your personal information violates relevant laws and regulations;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72539, "text": "The way we collect, use, or handle your personal information violate the agreement between us;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72540, "text": "Other circumstances stipulated in laws and administrative regulations.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72541, "text": "But if we need to retain such information to fulfill their legal obligations or exercise or defend legal claims, we have no obligation to delete your personal information.", "label": ["Important", "Edit/Control"], "rewrite": "If we need to retain the information you ask for deletion to fulfill the legal obligations or exercise or defend the legal claim, we have no obligation to delete it."}
{"task": "rw_107.jsonl", "id": 72542, "text": "Logging out: You have the right to ask us to cancel your account.", "label": ["Important", "Edit/Control"], "rewrite": "You have the right to ask us to cancel your account."}
{"task": "rw_107.jsonl", "id": 72543, "text": "For your privacy and security, we may ask you to prove your identity as appropriate before canceling you.", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "We may ask you to prove your identity as appropriate before canceling you."}
{"task": "rw_107.jsonl", "id": 72544, "text": "Withdrawal consent: If you have agreed to handle your personal information, you have the right to withdraw your consent.", "label": ["Important", "Edit/Control"], "rewrite": "You have the right to withdraw your consent of your personal information processing."}
{"task": "rw_107.jsonl", "id": 72545, "text": "This situation includes you want to withdraw our marketing information, but it does not affect the personal information processing we carried out based on your authorization.", "label": ["Important", "Edit/Control"], "rewrite": "The withdrawal authorization does not affect the personal information processing we carried out based on your authorization."}
{"task": "rw_107.jsonl", "id": 72546, "text": "If you have any questions about our personal information in any reason, you want to check, correct or delete your personal information, or you need to apply for a cancellation account, or you need to change the scope of your authorization to collect information, or withdraw your authorization.You can manage your personal information by accessing, correcting or deleting information, cancellation accounts, and closing device functions.", "label": ["Important", "Edit/Control"], "rewrite": "You can manage your personal information by accessing, correcting or deleting information, cancellation accounts, and closing device functions."}
{"task": "rw_107.jsonl", "id": 72547, "text": "Please read the instructions here. You can also call 0571-28090163 or through the website https://www.battlenet.com.cn/support/zh/ and consult our personal information protection team or personal information protection person in charge.", "label": ["Edit/Control", "Contact Information", "Important"], "rewrite": "You can call 0571-28090163 or via the website https://www.battlenet.com.cn/support/zh/ to inquire about the exercise of our personal information rights."}
{"task": "rw_107.jsonl", "id": 72548, "text": "After receiving your correction, delete personal information, cancel your account, change the scope of authorization or withdraw your authorization, we will answer within 15 working days after verifying your user information.", "label": ["Important", "Edit/Control"], "rewrite": "We will answer your request within 15 working days after verifying your user information."}
{"task": "rw_107.jsonl", "id": 72549, "text": "Please note that deleting your information, canceling your account, or withdrawing your authorization will cause your account and/or corresponding service to close.", "label": ["Important", "Edit/Control"], "rewrite": "Delete your information, cancel your account or withdraw your authorization will cause your account and/or corresponding service to close."}
{"task": "rw_107.jsonl", "id": 72550, "text": "The withdrawal of your authorization does not affect the information processing we have performed based on your authorization consent before the withdrawal of your authorization.", "label": ["Important", "Edit/Control"], "rewrite": "The withdrawal authorization does not affect the information processing based on the previous authorization consent."}
{"task": "rw_107.jsonl", "id": 72551, "text": "How do we protect your personal information", "label": [], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72552, "text": "We take various measures to ensure the security of the collected information and not be damaged (for example, not being modified), while strictly controlling access to any personal information.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72553, "text": "For example, the purpose of the privacy policy, including the formulation of internal management systems and operating procedures, employees and authorized service providers who only need to know personal information, and other management, technology and physical guarantee measures.", "label": ["Important", "Data Security"], "rewrite": "Employees and authorized service providers who formulate internal management systems and operating procedures to open up necessary personal information to employees and authorized service providers who only know about personal information."}
{"task": "rw_107.jsonl", "id": 72554, "text": "In addition, we will take reasonable measures to ensure that all third parties that share our data provide sufficient security guarantee for personal information.", "label": ["Important", "Data Security"], "rewrite": "Take measures to ensure that all third parties that share our data provide security guarantee for personal information."}
{"task": "rw_107.jsonl", "id": 72555, "text": "When the personal information security incident may or no luck, we will inform you in a timely manner that the basic situation of security incidents, possible impacts, remedial measures we have taken or we will take, what you can takeRelief measures, remedial measures, etc.", "label": ["Important", "Data Security"], "rewrite": "If a personal information security incident occurs, the basic situation of the security incident, the possible impact, and remedy measures will be told to you in time."}
{"task": "rw_107.jsonl", "id": 72556, "text": "We will promptly inform you that the incident -related situation is informing the email, letter, telephone, push notification, etc. When it is difficult to inform the subject of personal information one by one, we will publish an announcement in a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "The relevant situation of security incidents will be informed by mail, letter, telephone, push notification, etc. When it is difficult to inform one by one, it will issue an announcement."}
{"task": "rw_107.jsonl", "id": 72557, "text": "At the same time, we will also actively report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "The disposal of personal information security incidents will be reported in accordance with the requirements of the regulatory authorities."}
{"task": "rw_107.jsonl", "id": 72558, "text": "How to deal with problems or opinions, or perform complaints and reports related to personal information security", "label": [], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72559, "text": "If you have any questions about this privacy clause or our personal information processing rules, or if you want to submit questions or opinions, please contact us through the following website https://www.battlenet.com.cn/support/zh/.", "label": ["Important", "Contact Information"], "rewrite": "Contact us with the following website https://www.battlenet.com.cn/support/zh//"}
{"task": "rw_107.jsonl", "id": 72560, "text": "If you need to complain or report personal information security, please contact us through 0571-28090163.", "label": ["Important", "Contact Information"], "rewrite": "Tel: 0571-28090163"}
{"task": "rw_107.jsonl", "id": 72561, "text": "Please read and agree with the privacy policy carefully before using this website or the products or services we provide.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72562, "text": "If you do not accept this privacy policy, you will not be able to use other functions except the browse function, or fully experience the products or services we provide.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72563, "text": "This privacy policy may be revised, please check regularly to ensure that all the amendments are known.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72564, "text": "If a major revision of this privacy policy, including but not limited to: our service model has changed significantly;", "label": ["Policy Change", "Important"], "rewrite": "If this privacy policy has been revised significantly, including but not limited to: our service model has changed significantly; the main object of personal information sharing, transfer or public disclosure changes;; Our contact information and complaint channels have changed; the evaluation report of personal information security impact indicates that there is a high risk."}
{"task": "rw_107.jsonl", "id": 72565, "text": "The main object of personal information sharing, transfer or public disclosure changes;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72566, "text": "You participated in the right of personal information processing and its exercise methods have undergone major changes;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72567, "text": "Our contact information and complaint channels have changed;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72568, "text": "The personal information security impact assessment report shows that there is a high risk.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72569, "text": "We will notify you through mail, applications, special prompts in the game, this website or this privacy policy page, and obtain your clear consent in accordance with the requirements of laws and regulations;", "label": ["Policy Change", "Important"], "rewrite": "After changes in privacy policy, you will notify you and get your clear consent."}
{"task": "rw_107.jsonl", "id": 72570, "text": "If necessary, it will also provide you with other notification methods.", "label": [], "rewrite": []}
{"task": "rw_107.jsonl", "id": 72571, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
