{"task": "rw_10.jsonl", "id": 39743, "text": "Soul app personal information protection policy", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39744, "text": "Update date: August 26, 2022", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39745, "text": "Effective date: August 26, 2022", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39746, "text": "Soul APP is a user (hereinafter referred to as \"we\" or \"soul\") as a user (hereinafter referred to as \"you\", the following abbreviationPlease check the definition of keywords) provided by the social application software, including mobile applications, applets and fast applications (hereinafter referred to as \"Soul APP\").", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39747, "text": "We provide you with functions such as \"soul matching, posting reply, chat\" through the Soul App. We may also provide you with other products and/or services in the future (hereinafter referred to as \"SOUL products and/or services or this product and/or/or or/or or/or or/or or/or or/or or/or or/or or/or or/or or/or or/or itService \", please refer to the definition of keywords for details).", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39748, "text": "We formulated the \"Soul APP Personal Information Protection Policy\" (hereinafter referred to as \"this policy\") and protect your personal information security in accordance with relevant laws and regulations of the People's Republic of China and the Cyber Security Law of the People's Republic of China) and protect your personal information security.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39749, "text": "All SOUL products are applicable to this policy with/or services.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39750, "text": "This policy introduces the purpose, method, scope, scope, storage period, and information security protection measures for your personal information during the process of providing SOUL products and/or services, as well as methods and procedures you exercise the rights stipulated in the law.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39751, "text": "Please know that Soul does not use cookie or other similar technologies to track your personal information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Soul does not use Cookie or other similar technologies to track your personal information."}
{"task": "rw_10.jsonl", "id": 39752, "text": "Please read this policy carefully in accordance with our \"Soul APP User Service Agreement\", and use Soul products and/or services when agreeing with the content of this policy.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39753, "text": "For all key content, we will use the \"bold\" writing method to prompt.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39754, "text": "The following is our special reminder, please focus on:", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39755, "text": "1. For personal sensitive information, we use the \"thick oblique body\" writing method to make special reminders. I hope you pay special attention to when reading.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39756, "text": "Before you provide us with any personal sensitive information, you have carefully considered and confirmed that this provision is appropriate. You agree that your personal sensitive information can be processed in accordance with the purpose and method described in this policy.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39757, "text": "2. The implementation of personal information rights includes but not limited to inspection, replication, correction, replenishment, deletion, cancellation, withdrawal authorization, requiring us to explain this policy, timely response, etc.Essence", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39758, "text": "3. We will handle your personal information strictly according to this policy and your consent.", "label": ["Usage"], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39759, "text": "If you do not agree with this policy, you should stop using SOUL products and/or services.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39760, "text": "4. Please understand that after the soul app is updated, if you are a minor less than 18, please do not register the soul app.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39761, "text": "If you are a minor less than 18 years old, but you will register the Soul account before the update of the Soul App (version number: 3.8.36), we will provide you with a youth protection service model.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39762, "text": "For the specific content and restrictions of the adolescent protection service model, please refer to the actual page display.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39763, "text": "This privacy policy will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39764, "text": "Table of contents", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39765, "text": "1. How to collect and use your personal information 3", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39766, "text": "2. How to commission to deal with, share, transfer and disclose your personal information 12", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39767, "text": "3. How do you manage your personal information 15", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39768, "text": "4. How to store your personal information 18", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39769, "text": "5. How to protect your personal information 18", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39770, "text": "6. How to protect personal information of minors 20", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39771, "text": "7. How to update this policy 21", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39772, "text": "8. How to contact us 22", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39773, "text": "9. Attachment 22", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39774, "text": "10. Keyword definition 22", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39775, "text": "1. How to collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39776, "text": "We will collect and use your personal information based on the purpose of legal, correctness, necessary, and integrity based on the purpose of this policy.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39777, "text": "If we use your personal information for other purposes that are not stated in this policy, or collect your personal information based on other specific purposes, we will inform you in a reasonable way and obtain your consent again before use.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39778, "text": "1.1 Provide you with personal information you actively provide in the process of product and/or service", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39779, "text": "1.1.1 In order to achieve our basic business functions, we need to collect the following personal information from you. If you refuse to provide it, we will not be able to provide you with corresponding services.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39780, "text": "Note that you note: If you provide your personal information, please make sure you have obtained the authorization consent of the relevant subject.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you provide your personal information, please make sure you have obtained the authorization consent of the relevant subject."}
{"task": "rw_10.jsonl", "id": 39781, "text": "(1) Account registration, login and verification", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39782, "text": "When you register the soul account in Soul and APP, you need to provide us with the following information to complete the registration:", "label": ["Important", "First Party Collection Information"], "rewrite": "When you register the soul account in the Soul App, you need to provide your mobile phone number and SMS verification code."}
{"task": "rw_10.jsonl", "id": 39783, "text": "1) Your mobile phone number and SMS verification code: We will send you SMS verification code based on the mobile phone number you provide to verify your identity.", "label": ["Important", "Usage"], "rewrite": "We will send you a text message verification code based on the mobile phone number you provide to verify your identity."}
{"task": "rw_10.jsonl", "id": 39784, "text": "If you do not provide the SMS verification code you receive, it will cause registration failure, and you will not be able to register and continue to use this product and/or service.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39785, "text": "It is prompted that your mobile phone number will be used as a user account for your subsequent Soul, APP and as a user identity certificate for logging in to this product.", "label": ["Important", "Usage"], "rewrite": "The mobile phone number you provided will be used as your subsequent user account with Soul APP and as a user identity certificate for logging in to this product."}
{"task": "rw_10.jsonl", "id": 39786, "text": "2) Password information: You can also set a login password for your account. This information is not necessary to provide. You have the right to choose to use the mobile phone number encryption password to log in or log in to only through the mobile verification code.", "label": ["Edit/Control", "Important"], "rewrite": "You have the right to choose to log in with a mobile phone number encryption or log in to only through the mobile phone verification code."}
{"task": "rw_10.jsonl", "id": 39787, "text": "3) Third -party user information: If you choose to log in with a third -party user account, you agree that we will collect your WeChat nickname, avatar and/or Apple user name and mailbox name according to your choice.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39788, "text": "4) Birth year and day: We will judge your age based on the birth year you provided. If you are less than 18 years old or do not provide us for your birthday information when you are registered, you will not be able to register asOur users continue to use this product and/or service.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you are less than 18 years old or do not provide us your birthday information when you are registered, you will not be able to register as a user."}
{"task": "rw_10.jsonl", "id": 39789, "text": "5) Gender and nickname: We will provide you with gender matching services based on the gender information you provide. If you do not provide such information, you will fail to register and continue using this product and/or service.", "label": ["Important", "Usage"], "rewrite": "We will provide you with gender matching services based on the gender information you provide."}
{"task": "rw_10.jsonl", "id": 39790, "text": "6) \"Soul Test\" answers: You need to answer the test questions we set for you to complete the registration. We will allocate you to the virtual community \"Planet\" suitable for your virtual community based on your answer. Please check the definition of keywords)This distribution will not have any substantial impact on your rights.", "label": ["Usage"], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39791, "text": "In addition, we will make preliminary judgments on your personality based on your answers, which is convenient for you to match or recommend you a chat object and \"dynamic moment\" (please refer to the definition of keywords).", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39792, "text": "The characteristic of the Soul APP is based on the user's personality and interest. If you refuse to answer such personality test questions, you will fail to register and you cannot continue to register and use this product and/or service.", "label": ["Usage"], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39793, "text": "When you complete the registration link through the above information and get a soul account, you are deemed that you have successfully logged in to the Soul APP and are always in a login state. In order to protect your account security, you agree to handle your account information based on the purpose of risk control.In addition, in order to facilitate the supervision of the public for the public interest, you understand and agree to display the Internet agreement (IP) address of your account homepage on your account homepage, display the corresponding provincial information in the country, and display the corresponding countries (regions) information overseasThe information is based on the data of the network operator.", "label": ["Usage"], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39794, "text": "Please understand that the information will not leak your detailed address.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39795, "text": "If you need to exit the login status and log in again, you need to enter the login password set when entering the mobile phone number or select the login password or select the SMS verification code to complete the login.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39796, "text": "You can also choose to log in with one -click login. If you collect the details of your personal information in this way, please refer to the content of Section 1.4 of this policy.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39797, "text": "(2) Retrieve the password", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39798, "text": "When you need to retrieve your password, you need to provide the mobile phone number provided by you and the receiving SMS verification code to verify your identity.", "label": ["Important", "Usage"], "rewrite": "When you need to retrieve your password, you need to provide the mobile phone number provided by you and the receiving SMS verification code to verify your identity."}
{"task": "rw_10.jsonl", "id": 39799, "text": "After passing the verification, you need to set a new password instead of the original password to log in to the Soul APP when choosing a username+password.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39800, "text": "(3) Change the mobile phone number", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39801, "text": "If you want to replace the mobile phone number provided when you register, you need to go to [Settings-Account and Security-Change Binding Mobile Phone] to enter your new mobile phone number and enter the new mobile phone number and receive it.After the verification code is verified, the switch is completed.", "label": ["Edit/Control", "Important"], "rewrite": "You need to go to [Settings-Account and Security-Change Binding Mobile Phone] to replace the mobile phone number provided when you register."}
{"task": "rw_10.jsonl", "id": 39802, "text": "If you are logging in to change your mobile phone number because you are not using the original mobile phone number, you need to check the nickname, gender, registered birthday, registered city, common cities, common equipment, common equipment, common equipment, common equipment, common equipment, common equipment, common equipment, common equipment you have previously provided by the pageFor information such as mailboxes (if any), we will decide whether to pass your account application application through your account, or ask you to apply for an application after the real -name verification, or refuse your application.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39803, "text": "If you have any problems with us, you can contact us to ask for help.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39804, "text": "(4) Real -name authentication and age correction", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39805, "text": "When you use some specific types of products and/or services (including: as a \"group chat party\" (for details, please refer to the definition of keywords) in some specific types of products in the app, the owner of the text group, \"community SSR certification)(For details, please refer to the definition of keywords), when you join the campus, the title appeal, and the login scene of overseas mobile phones), you need to provide us with your real name and ID number information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use some specific types of products and/or services in the Soul App, and the owner of the text group, you need to provide your real name and ID number information."}
{"task": "rw_10.jsonl", "id": 39806, "text": "In addition, we will invite you to face face recognition verification. The service is provided by a third party (Ali Cloud). We only collect the verification results and will not collect your facial information.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "We only collect the verification results and will not collect your facial information."}
{"task": "rw_10.jsonl", "id": 39807, "text": "If you refuse to provide the above information, you will not be able to use such specific types of products and/or services.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39808, "text": "In addition, in order to verify that your account is held in order to verify that your account is held, we will also use the real -name mobile phone number you use when you register for three elemental authentication.", "label": ["Important", "Usage"], "rewrite": "We will use the real -name mobile phone number you use when you register for three element authentication."}
{"task": "rw_10.jsonl", "id": 39809, "text": "If you apply for joining the campus, in order to verify your status of your school student, we will also collect and verify your campus mailbox, Xuexin.com information, student ID information or campus card information.Freshmen can also choose to take the admission notice method for verification.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to verify your status of your school student, we will also collect and verify your campus mailbox, Xuexin.com information, student ID information, or campus card information."}
{"task": "rw_10.jsonl", "id": 39810, "text": "If you belong to users who are registered as minors before the app update, but the actual age is 18 years of age, I hope to modify the age you filled in when you register.Can be changed to age consistent with ID cards.", "label": ["Important", "Data Security", "Usage"], "rewrite": "If your actual age is over 18 years old, you need to make real -name authentication, and you can change the age you filled in after the certification is passed."}
{"task": "rw_10.jsonl", "id": 39811, "text": "(5) Information content release, browsing, likes and sharing functions", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39812, "text": "When you publish \"instantaneous\" or commented on \"instantaneous\" of others, you need to provide us with the text information, pictures, audio, and videos you publish/sending/sent.The review will be conducted as the retain evidence of the user complaints.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you publish \"instantaneous\" or comment on others, you need to provide us with the text information, pictures, audio, and videos you posted/sent."}
{"task": "rw_10.jsonl", "id": 39813, "text": "If you don't want to provide the above information, you will not be able to publish related functions with information content.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39814, "text": "In order to enhance your release of the \"instantaneous\" experience, before you click \"Publish\" to confirm upload, we will temporarily load the content to the server and automatically identify the content you entered by technology and recommend related topics to you to help more moreMulti -user finds your \"moment\" after you \"publish\". If you do not accept recommendation, you can close it through Article 3.5 of this agreement.", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39815, "text": "If you cancel the release or upload it for other reasons, we will immediately delete the content.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39816, "text": "When you improve your personal \"gravity sign\" (please check the definition of keywords), you need to provide us with the keyword information (including your personal education and work information), we will match you\"Gravity Sign\" sets similar users.", "label": ["Important", "Usage"], "rewrite": "When you improve your personal \"gravity sign\", you need to provide you input keyword information."}
{"task": "rw_10.jsonl", "id": 39817, "text": "You refuse to improve the \"gravity sign\" will not affect your normal use, but it may moderately affect the accuracy of the matching results.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39818, "text": "When you browse information in functions such as \"City\", we will display relevant information content based on the user's IP address.", "label": ["Important", "Usage"], "rewrite": "When you browse information in functions such as \"City\", we will display relevant information content based on the user's IP address."}
{"task": "rw_10.jsonl", "id": 39819, "text": "The IP address only corresponds to the location of the city/district and county, and the positioning information of the user will not be used or leaked without the consent of the user.", "label": ["Important", "Usage"], "rewrite": "Without the consent of the user, the positioning information of the user will not be used or leaked."}
{"task": "rw_10.jsonl", "id": 39820, "text": "(6) Chat and matching function", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39821, "text": "You can chat with other users through the matching function provided by the Soul App.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39822, "text": "When you match the \"Face -based matching\" function, we will provide you with matching services based on your user portrait.", "label": ["Important", "Usage"], "rewrite": "When you match the \"Face -based matching\" function, we will provide you with matching services based on your user portrait."}
{"task": "rw_10.jsonl", "id": 39823, "text": "When communicating with other users, we will handle your face based on your choice (with special effects blindfold) instead of truly displaying your appearance.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39824, "text": "When the two sides call the conditions announced by the game rules (based on the actual display rules of the interface), you can voluntarily choose not to make a face and communicate with the other party with a real face.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39825, "text": "When you use the \"Face -based matching\" function and \"voice matching\" function, you must provide us with your voice information to achieve your voice call function.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39826, "text": "The \"voice matching\" function can also help the sound matching effect through your voice information.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39827, "text": "When you turn on \"Love Bell\", we will use your geographical information to match your friends nearby.", "label": ["Important", "Usage"], "rewrite": "When you turn on \"Love Bell\", we will use your geographical information to match your friends nearby."}
{"task": "rw_10.jsonl", "id": 39828, "text": "If you refuse to authorize the location authority but turn on the \"love bell\", we will match your IP address based on your IP address.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39829, "text": "You can also turn off the function at any time in the \"Love Bell\" settings.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39830, "text": "You can chat and communicate with other users through the matching of the matching function provided by the Soul App. You can select text chat and/or voice chat according to different chat scenes, and you can upload pictures, audio and videos according to your needs(\"Voice matching\" and \"Face Gini match\" can only be chatted with voice chat).", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39831, "text": "If you want to synchronize chat records with other users (currently only \"super-star people\"), you can start by clicking \"Chat Settings-Message Cloud Row\".", "label": ["Data Retention", "Important"], "rewrite": "If you want to synchronize chat records with other users, you can start by clicking \"Chat Settings-Message Cloud Roaming\"."}
{"task": "rw_10.jsonl", "id": 39832, "text": "Please understand that, according to the requirements of applicable laws and regulations, we will conduct legal compliance reviews of text information, pictures, audio, and videos published/uploaded by you, and will use these contents for user complaints and reports.evidence.", "label": ["Important", "Usage"], "rewrite": "We will review the text information, pictures, audio, and videos you posted/sent you publish/send, and will use these contents for evidence retained when user complaints report."}
{"task": "rw_10.jsonl", "id": 39833, "text": "If you don't want to provide the above information, you will not be able to use the corresponding features.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39834, "text": "At the same time, please know that for the text information that you posted/sent in the \"Square\", the pictures, audio, and video uploaded by you, we will not only conduct legal compliance review, but also extract keyword informationPolicies 1.1.1 (7) the function described, but you can close according to the guidelines of Article 3.5 of this policy.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "For the text information, pictures, audio, and videos you posted/sent in the \"Square\", we will not only conduct legality and compliance review, but also extract keyword information."}
{"task": "rw_10.jsonl", "id": 39835, "text": "Special reminder: In the content uploaded by the Soul APP \"Instant\", \"Gravity Sign\" and \"Chat\" function, if you contain personal information of others, please make sure that you have obtained the authorization of the subject of personal information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39836, "text": "(7) Personalized push and matching", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39837, "text": "Personalized matching and recommendation are one of the core features of the Soul App.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39838, "text": "In order to provide you with better and more in line with your needs, let you have a better experience of using SOUL products and/or services. Under the premise of laws and regulations, we may actively provide2. After your consent, it is provided by our partner and your personal information that we actively collects, conducts data analysis, conducts comprehensive statistics, and analyzes user characteristics and preferences through specific algorithms to form portraits in order to display or provide you with you to provide you with youInterested, more in line with your actual information, or push you more suitable for you to specific functions and/or services, specifically:", "label": ["Important", "Usage"], "rewrite": "We may conduct data analysis based on what you actively provide and our personal information, comprehensively statistics, and form a portrait in order to show you or provide information, functions, functions, functions that meet your actual needs, and more in line with your actual needs.Serve."}
{"task": "rw_10.jsonl", "id": 39839, "text": "1) Personalized content: In order to show, recommend or push you the graphic video/group/party/\"instant\" topic/intelligent auxiliary chat content that you may be interested in, provide search results, recommend products and services, we will use it will use it, we will use it. We will use it. We will use it. We will use it. We will use it.The basic information provided when you register (including age/birthday, gender, location, gravity signing, academic situation), behavior data generated during your service period (including registration time, \"instant\", user interaction records, network logs), consumption), consumption consumption)Situation and equipment information form a user attribute classification, and use different content display strategies for users of different attributes.", "label": ["Important", "Usage"], "rewrite": "We will use the basic data provided by you, the behavior data generated during the use service, etc. to show you personalized content."}
{"task": "rw_10.jsonl", "id": 39840, "text": "For example, if you explain that you like travel in the gravitational signing, we may show you more about the content of the travel topic label;", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39841, "text": "Gravity sign), the behavior data generated during the service period (including advertising clicks, transformations, network logs) equipment information and network types, forming user characteristics labels, and according to the target type specified by the advertiserPut it to users of relevant people.", "label": ["Important", "Usage"], "rewrite": "We will use the basic data provided by you when registering, and the behavior data generated during the service period to form a user -featured label to provide personalized advertisements."}
{"task": "rw_10.jsonl", "id": 39842, "text": "For example, if you are a female user, we may put you on cosmetics advertisements;", "label": ["Usage"], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39843, "text": "3) Personalized matching: In order to show, recommend or push to users who have a higher degree of correlation with you in the \"user matching\" function such as the \"user matching\" function, we will use the basic information provided when you registerAge/birthday, gender, location, gravity sign), the behavior data generated during the service period (including \"instantaneous\", user interaction, matching records, network logs), consumption situation and equipment information, forming user portraits, and providing users withSimilar chat objects such as similar hobbies.", "label": ["Important", "Usage"], "rewrite": "We will use your personal information to show you, recommending or pushing you to users who have a higher degree of correlation with you in the \"user matching\" function such as soul matching and love bell."}
{"task": "rw_10.jsonl", "id": 39844, "text": "For example, if your status is in Beijing, we may match you who are also located in Beijing.", "label": ["Usage"], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39845, "text": "It is prompted to know that when you use Soul, the APP \"User Matching\" function, you can choose the friend of a friend who wants to chat.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the Soul App \"User Matching\" function, you can choose the friend of a friend who wants to chat."}
{"task": "rw_10.jsonl", "id": 39846, "text": "If you do not provide such information, it will not affect your normal matching function, but you may not be able to match the interested chat objects.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39847, "text": "If you ask for exit personalized push -related automation decision -making models, you can handle it in the form of Article 3.5 of this policy.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39848, "text": "(8) Search function", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39849, "text": "When you use the \"Search\" function in this product and/or service, you need to provide us with the keyword information you enter to show you the content you need and the historical record you searched. You can choose to delete historySearch records.", "label": ["Edit/Control", "First Party Collection Information", "Important"], "rewrite": "When you use the \"search\" function in this product and/or service, you need to provide keyword information to show you what you need, you can choose to delete."}
{"task": "rw_10.jsonl", "id": 39850, "text": "If you don't want to provide the above information, please don't use the search function.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39851, "text": "(9) Feedback", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39852, "text": "If you have any feedback on this product and/or service, you can give feedback through \"yourself\"- \"setting\"- \"help and feedback\"- \"feedback\" in the soul app.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39853, "text": "You need to provide your opinion description, upload proved photos to help us know the questions you have raised and find the corresponding solution.", "label": ["Important", "Usage"], "rewrite": "You need to provide your opinion description and upload certification photo to solve the problem."}
{"task": "rw_10.jsonl", "id": 39854, "text": "In order to give feedback to your opinions in time, you need to provide us with your mobile phone number so that we can contact you in time.", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to give feedback to your opinions in time, you need to provide your mobile phone number."}
{"task": "rw_10.jsonl", "id": 39855, "text": "(10) Marketing activities", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39856, "text": "In order to provide you better, we may send you commercial service information reasonably through SMS.", "label": ["Important", "Usage"], "rewrite": "We may send you commercial service information reasonably by SMS."}
{"task": "rw_10.jsonl", "id": 39857, "text": "If you don't want to receive such commercial marketing activities, you can edit \"T\" or \"TD\" and reply to the SMS for a copy. After the successful withdrawal, we will no longer send you such text messages.", "label": ["Important", "Edit/Control"], "rewrite": "You can edit \"T\" or \"TD\" and reply to SMS for the commercial marketing activity information."}
{"task": "rw_10.jsonl", "id": 39858, "text": "In order to facilitate your understanding of the relevant situations and discounts of products and services, we will recommend marketing activity information to you based on your consumer records and use preferences through the product and service display page, station letter and other methods.", "label": ["Important", "Usage"], "rewrite": "We will recommend marketing activities based on your consumption records and use preferences."}
{"task": "rw_10.jsonl", "id": 39859, "text": "If you do not agree to receive personalized marketing information, you can reject it in the form of Article 3.5 of this agreement.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39860, "text": "1.1.2 In order to provide you with a better use experience, we will provide you with the following expansion business functions. When you use this function, we will collect your personal information based on specific purposes.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use extended business functions, we will collect your personal information based on specific purposes."}
{"task": "rw_10.jsonl", "id": 39861, "text": "If you do not provide such information, you will not be able to use the following extension business functions, but it will not affect the normal use of your basic business functions.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39862, "text": "(1) Soul shooting the camera", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39863, "text": "When you use \"Soul, Taking Camera\" to take the corresponding photos or videos, we will think that you provide targeted stickers and special effects rendering and other effects based on the specific content taken by your camera.", "label": ["Important", "Usage"], "rewrite": "When you take the corresponding photos or make a video, we will think that you provide targeted stickers and special effects rendering and other effects based on the specific content taken by the camera."}
{"task": "rw_10.jsonl", "id": 39864, "text": "It is prompted that if the content you shoot contains the personal information of others, please make sure you have the consent of the personal information subject.", "label": ["Important", "First Party Collection Information"], "rewrite": "If the content you shoot contains the personal information of others, please make sure you have obtained the consent of others."}
{"task": "rw_10.jsonl", "id": 39865, "text": "(2) Shielding mobile phone contacts", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39866, "text": "If you do not want to match the contact person in your mobile phone address book when using this product and/or service, you need to open the permissions of visiting your mobile phone address book in order to facilitate us to achieve the shielding matching/display your selection you choose.Users who register SOUL accounts for mobile phone numbers.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you don't want to match the contact person in your mobile phone address book, you need to open the authority of visiting your mobile phone address book to us."}
{"task": "rw_10.jsonl", "id": 39867, "text": "To achieve this function, we will collect the name and mobile phone number of the contact person in your mobile phone address book.", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to shield the mobile phone contact, we will collect the name and mobile phone number of the contact person in your mobile phone address book."}
{"task": "rw_10.jsonl", "id": 39868, "text": "If you refuse to provide the above information, the aforementioned function will not be implemented.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39869, "text": "(3) One -click invitation to friends", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39870, "text": "If you want to invite your friends in the mobile phone communication recording to register and use Soul, APP, you need to start the access to your mobile phone communication recording authority, you can choose the contact person you want to register soul, the app, we will collect youThe contact name and mobile phone number in the mobile phone address book.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "If you want to invite friends in the communication records to register and use the Soul App, you need to start access to your mobile phone communication recording permissions, we will collect the contact name and mobile phone number in your mobile phone address book."}
{"task": "rw_10.jsonl", "id": 39871, "text": "If you refuse to provide the above information, you will not be able to use the \"one -click invitation\" function, but you can still invite friends to join the Soul APP by sharing links.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39872, "text": "(4) Gift purchase and mailing", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39873, "text": "We will regularly hold some online/offline activities with different themes, and choose some lucky users to give away the Soul App peripheral gifts.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39874, "text": "When you receive notifications from our gift gift, you need to provide your recipient's name, receiving address and contact information in order to send us the corresponding gifts to you.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you receive a notice from our gift, you need to provide your recipient's name, receiving address and contact information."}
{"task": "rw_10.jsonl", "id": 39875, "text": "If you refuse to provide such information, we will not be able to send gifts to you.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39876, "text": "If you buy or receive physical gifts presented by other users in Soul, APP, you need to provide us with a redeeming application code and the consignee's name, receiving address and mobile phone number.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you buy or receive physical gifts presented by other users, you need to provide us with the exchange application code and the consignee's name, receiving address and mobile phone number."}
{"task": "rw_10.jsonl", "id": 39877, "text": "If you refuse to provide the above information, the aforementioned function will not be realized.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39878, "text": "If you provide personal information of others in the receiving information, please make sure you have obtained the consent of others.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you provide personal information of others in the receiving information, you need to obtain the consent of others."}
{"task": "rw_10.jsonl", "id": 39879, "text": "1.2 Provide you with personal information that we actively collect in the process of products and/or services", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39880, "text": "Under the premise of compliance with laws and regulations, in order to ensure your account security and provide you with better services, we will collect and use the following information that you generate in the process of using Soul products and/or services:", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39881, "text": "1.2.1 Equipment information", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39882, "text": "In order to make the necessary adaptation with your mobile device, provide you with a safe, credible product and use environment, and ensure the safe operation of Soul, APP. When you use Soul, APP, install according to the software installation in software.And the specific permissions granted in the use, we will collect your device model, device recognition code (including IMei/Android, ID,/IDFA/IDFV/Open, udid/guid/oAID/SN, ID/meid, advertising ID, SIM, SIM, SIMCard number, IMSI, ICCID), software list, device running status information, system version, MCC, MNC, MAC address information (including mobile phone MAC address and Bluetooth MAC address), device sensor information, external virtual keyboard recognition.", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to make the necessary adaptation, provide you with a safe, credible product and use environment to ensure the safe operation of the Soul APP.MCC, MNC, MAC address information, etc."}
{"task": "rw_10.jsonl", "id": 39883, "text": "The collection of information is to help us carry out security protection work such as BUG analysis, anti -cheating, anti -black production, and ensure that you use this product and/or service, improve and optimize our product experience, and ensure your account security.", "label": ["Important", "Usage"], "rewrite": "Collecting equipment information, hardware information, etc. to help us carry out security protection work such as BUG analysis, anti -cheating, anti -black production and other safety protection work."}
{"task": "rw_10.jsonl", "id": 39884, "text": "At the same time, except for this policy, we will not provide your equipment information to any third party, but we cannot guarantee that other third parties will not know your device information through other channels, and your device information and other are otherIf the information is combined to identify your personal identity, and it causes any loss of you, you should claim compensation to the third party.", "label": ["Important", "First Party Collection Information"], "rewrite": "Except for this policy, we will not provide your equipment information to any third party."}
{"task": "rw_10.jsonl", "id": 39885, "text": "The above equipment information is the basic information collected for the service. If you do not want to collect the above equipment information by us, it may cause us to be unable to provide you with normal services.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39886, "text": "Please know, in order to help us carry out security protection work such as BUG analysis, anti -cheating, anti -black production, etc., to ensure your normal use of this product and/or service, improve and optimize our product experience, and ensure your account security.Soul, app switching to the background or in a silent state, we will collect your MAC address information (including mobile phone MAC address and Bluetooth MAC address) and IMEI.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When your Soul App is switched to the background or in a silent state, we will collect your MAC address information and IMEI."}
{"task": "rw_10.jsonl", "id": 39887, "text": "1.2.2 log information", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39888, "text": "When you use SOUL products and/or services, we will collect your related network log information, including APP crash, system activity information, equipment networking conditions, browsing records, click records, software use records and IP address information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use SOUL products and/or services, we will collect your related network log information."}
{"task": "rw_10.jsonl", "id": 39889, "text": "We collect the above information to better use it to safeguard and optimize the product and/or services, and provide you with a better experience.", "label": ["Important", "Usage"], "rewrite": "We collect log information to better use it for security maintenance and optimization of this product and/or service."}
{"task": "rw_10.jsonl", "id": 39890, "text": "The above log information is the basic information collected for services. If you do not want to collect the above log information by us, it may cause us to be unable to provide you with normal services.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39891, "text": "1.2.3 Geographical location information", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39892, "text": "When you agree to open your location permissions, we will collect your geographical location information to show your geographical location, match and inform your friends appearing nearby when you postmoment.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "When you agree to open your location permissions, we will collect your geographical location information to display, match notifications, etc. when you post."}
{"task": "rw_10.jsonl", "id": 39893, "text": "If you refuse us to collect such information, the aforementioned related features will not be used normally, but it does not affect other functions of your use of Soul APP.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39894, "text": "In order to protect your legitimate rights and interests (combat black production, prevent fraud) and safeguard the safe operation of the product and/or service, we will collect the base station information (including base station status, LAC, BID, NID, SID, signalsStrength) with WIFI information (including BSSID, SSID, signal strength).", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to protect your legitimate rights and interests and safeguard the safe operation of the product and/or service, we will collect the base station information connected by your device."}
{"task": "rw_10.jsonl", "id": 39895, "text": "1.2.4 Consumption Record Information", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39896, "text": "When you use the third -party payment function provided by this product for recharge and consumption, we will collect and preserve your recharge, consumer record information, order information, and reconciliation information for your payment instructions and help you complete the payment.At the same time, such information will also be used as a voucher for your recharge and consumption.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use a third -party payment function for recharge and consumption, we will collect and save your recharge, consumer record information, order information, and reconciliation information for your payment instructions and help you complete the payment."}
{"task": "rw_10.jsonl", "id": 39897, "text": "1.2.5 Clipping board information", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39898, "text": "When you use SOUL products and/or services, we will use the function of the clipboard on your device and read the contents of the clipboard to achieve: when you will share the link or sharing code generated by a specific activity,You can automatically jump to the corresponding activity content when you open the soul, which will facilitate your convenient browsing activities.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use SOUL products and/or services, we will use the clipboard function on your device and read the contents of the clipboard to achieve automatic jump."}
{"task": "rw_10.jsonl", "id": 39899, "text": "At the same time, we will also read your clipboard information based on the purpose of risk control.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We will also read your clipboard information based on the purpose of risk control."}
{"task": "rw_10.jsonl", "id": 39900, "text": "1. System permissions called 3Soul app", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39901, "text": "As mentioned above, in order to provide you with SOUL products and/or services, we may need to use the system permissions in your device (excluding permissions that are connected to the third -party call) to collect relevant personal information.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39902, "text": "Although we are already involved in the aforementioned chapter, this section will summarize all system permissions used by Soul APP to facilitate you to be more systematic, complete and transparent.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39903, "text": "You can choose whether to authorize us to use the relevant permissions of your device. If you do not authorize us to use the relevant permissions, it may cause some services to be unavailable, but it does not affect your other functions of using Soul APP.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39904, "text": "1.3.1 Album and storage permissions", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39905, "text": "When you agree to open this permissions, we will use the album reading and storage function on your device.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39906, "text": "This feature will be used to upload text, images, videos and other contents for you, and you can also cache the text, images, and video content generated by your product and/or service process.", "label": ["Important", "Usage"], "rewrite": "Album storage permissions will be used to upload text, images, videos and other contents for you, and you can also cache the text, images, and video content generated during your use."}
{"task": "rw_10.jsonl", "id": 39907, "text": "Please know that we will not automatically read the storage content of your local album. Only after you agree to open this permissions and take the initiative to choose the corresponding picture in the album, you will get the picture/video data.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will not automatically read the storage content of your local album. Only after you agree to open this permissions and take the initiative to choose the corresponding picture in the album, you will get the data."}
{"task": "rw_10.jsonl", "id": 39908, "text": "If you refuse to authorize, the aforementioned function will not be used normally.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39909, "text": "1.3.2 microphone permission", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39910, "text": "When you agree to open this permissions, we will use the microphone function on your device and identify the voice information you uploaded.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you agree to turn on the microphone rights, we will use the microphone function on your device and identify the voice information you uploaded."}
{"task": "rw_10.jsonl", "id": 39911, "text": "This permissions will be used to achieve voice input, voice -changing function, and collect and identify the voice information entered in the process of implementing the above functions.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39912, "text": "If you refuse to authorize, the aforementioned function will not be used.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39913, "text": "1.3.3 Message Push permissions", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39914, "text": "When you agree to open this permissions, we will push the message for you, so that you can receive and understand the notice we issued in time.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you agree to open the message push permissions, we will push the message for you."}
{"task": "rw_10.jsonl", "id": 39915, "text": "If you refuse this authorization, you will not be able to receive the news we push for you.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39916, "text": "1.3.4 camera permissions", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39917, "text": "When you agree to start this permission, we will use the camera shooting function on your device.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you agree to turn on the camera authority, we will use the camera shooting function on your device."}
{"task": "rw_10.jsonl", "id": 39918, "text": "This function will be used to achieve photo shooting, recording video functions, and collect and identify pictures and video information taken by the above functions.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39919, "text": "If you refuse to authorize, the aforementioned function will not be used.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39920, "text": "1.3.5 Communication recording authority", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39921, "text": "When you agree to open this permissions, we will access the address book on your device to obtain the contact name and mobile phone number information in your communication record, and use the contact person in the communication record for you according to your choice or press or press.You choose to invite contacts in the communication record to register Soul, APP.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "When you agree to start the communication records, we will access the address book to get the contact name and mobile phone number information in your communication record to block or invite."}
{"task": "rw_10.jsonl", "id": 39922, "text": "If you refuse to authorize, the aforementioned function will not be used.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39923, "text": "1.3.6 Read the application of the installation list permissions", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39924, "text": "When you agree to open this permissions, we will collect your application installation list to protect your legitimate rights and interests (such as cracking down on black) and enrich your portrait, which is convenient for us to achieve Article 1.1.1 of this agreementThe function.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "When you agree to open up the authority of the application and installation list, we will collect your application installation list to protect your legitimate rights and interests and enrich your portrait."}
{"task": "rw_10.jsonl", "id": 39925, "text": "1.3.7 Geographical location permissions", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39926, "text": "When you agree to open this permissions, we will collect your geographical location information to show your geographical location, match and inform your friends that appear nearby, or match nearby users or dynamic moments when you post.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "When you agree to open the geographical location authority, we will collect geographical location information to show your geographical location, match and inform your friends to appear nearby, or match you with nearby users or dynamic moments."}
{"task": "rw_10.jsonl", "id": 39927, "text": "If you refuse such authorization, the above functions will not be realized.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39928, "text": "1.3.8 Equipment information access permissions", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39929, "text": "When you agree to start this permission, in order to protect your account and login security, we will collect your corresponding equipment information to optimize the user experience, security inspections, identification whether it is commonly used equipment and equipment binding.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "When you agree to open the device information access permissions, we will collect your corresponding device information to optimize whether the user experience, security inspections, and identification are common equipment and equipment binding."}
{"task": "rw_10.jsonl", "id": 39930, "text": "If you are a user of Android, your rejection of this authorization will cause you to be unable to use this product and/or service normally.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39931, "text": "If you are a user of the iOS system and are restricted by the iOS system, you may not be able to directly refuse or close the above authorization, but for some device information (for example: IDFA information, the actual situation of the IOS system policy is subject to the actual situation), you can yourself you can yourselfSelect whether to authorize us to collect it. If you refuse to authorize, we may not be able to provide you with the corresponding functions or services (such as: you reject us to collect your IDFA information, and we will not be able to provide you with personalized display based on the IDFA tracking logo).", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39932, "text": "1.3.9 Access network and obtain network status permissions", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39933, "text": "When you agree to open this permissions, our APP can be connected to the Internet.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you agree to access the network and get the power of the network status, our APP can be connected to the Internet."}
{"task": "rw_10.jsonl", "id": 39934, "text": "At the same time, based on the purpose of risk control and providing services, we can also monitor the changes in the network and remind users of the current network environment.", "label": ["Important", "Usage"], "rewrite": "Based on the purpose of risk control and providing services, we can monitor and remind users of network changes."}
{"task": "rw_10.jsonl", "id": 39935, "text": "You rejecting this authorization will cause you to be unable to use this product and/or service normally.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39936, "text": "1.4 Your personal information obtained from a third party", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39937, "text": "We may collect and use your personal information from a third party (our partner) within your consent.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may collect and use your personal information from a third party within your consent."}
{"task": "rw_10.jsonl", "id": 39938, "text": "We promise to handle your personal information in accordance with the contract signed with the third party and the relevant laws and regulations. At the same time, please read the personal information protection policy and user agreement of the third party in detail.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39939, "text": "If you refuse to collect and use your personal information when providing services, it may cause you to be unable to use some soul products and/or services.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39940, "text": "Regarding the identity of third -party partners, the types of information we have obtained, for details, please click \"\" Personal Information Sharing List \".", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For details, please click \"\" Personal Information Sharing List \"."}
{"task": "rw_10.jsonl", "id": 39941, "text": "1.5 Exception of consent", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39942, "text": "According to laws and regulations, collecting and using your personal information in the following situations do not need to obtain your consent:", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "According to laws and regulations, collecting and using your personal information in the following situations do not need to obtain your consent:"}
{"task": "rw_10.jsonl", "id": 39943, "text": "(1) It is necessary for the contract to establish and fulfill the individual as one party;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to establish and fulfill the collection and use information necessary for the person as a party as a party, there is no need to solicit authorization consent."}
{"task": "rw_10.jsonl", "id": 39944, "text": "(2) To fulfill the statutory duties or the requirements of the statutory volunteer;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to fulfill the statutory duties or the collection and usage information necessary for the statutory volunteer, there is no need to solicit authorization consent."}
{"task": "rw_10.jsonl", "id": 39945, "text": "(3) In order to deal with emergencies, or in urgent situations to protect the health and property safety of natural people;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to cope with emergencies, or in urgent cases to protect the life and health of natural persons and the necessary collection and use information, no need to solicit authorization."}
{"task": "rw_10.jsonl", "id": 39946, "text": "(4) Implement news reports and public opinion supervision such as public interests, and deal with personal information within a reasonable scope;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to implement news reports and public opinion supervision, deal with personal information within a reasonable scope without soliciting authorization consent."}
{"task": "rw_10.jsonl", "id": 39947, "text": "(5) Treatment of personal information that individuals are disclosed or other legally disclosed within a reasonable scope in accordance with the personal information protection law;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In accordance with laws and regulations, personal information is processed by individuals or other legal disclosure within a reasonable range, and no authorization consent is required."}
{"task": "rw_10.jsonl", "id": 39948, "text": "(6) Other circumstances stipulated in laws and administrative regulations.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Other collection and use information stipulated in laws and regulations does not need to solicit authorization."}
{"task": "rw_10.jsonl", "id": 39949, "text": "2. How to commission to deal with, share, transfer and disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39950, "text": "2.1 Entrusted processing", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39951, "text": "In order to provide you with more complete and better products and services, some functions may be provided by our technical service partners, and we may entrust partners to handle some personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may entrust partners to process some of your personal information."}
{"task": "rw_10.jsonl", "id": 39952, "text": "For companies, organizations, and individuals who entrust your personal information, we will clearly request the partners to handle your partners in accordance with our requirements, the provisions of this policy, and any other related confidentiality measures in accordance with our requirementsPersonal information and supervise their personal information processing activities.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39953, "text": "We will entrust a third -party SDK provider that provides technical services to handle your personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will entrust a third -party SDK provider that provides technical services to handle your personal information."}
{"task": "rw_10.jsonl", "id": 39954, "text": "These third -party providers will process your personal information depending on its needs when you use the Soul App, or when you switch the Soul App to the background or in a silent state.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39955, "text": "Regarding the identity of the provider, the purpose, method, scope, etc. of collecting personal information, please click to check the \"Personal Information Sharing List\", and based on the official privacy policy of the partner attached to the list.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For details, please click \"\" Personal Information Sharing List \"."}
{"task": "rw_10.jsonl", "id": 39956, "text": "If you refuse our suppliers to collect personal information for services when providing services, it may cause you to be unable to enjoy the corresponding service.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39957, "text": "2.2 Sharing", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39958, "text": "Unless there is the following or various situations, we will not share your personal information with any third -party company, organization and individual:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Unless there is the following or various situations, we will not share your personal information with any third -party company, organization and individual:"}
{"task": "rw_10.jsonl", "id": 39959, "text": "(1) Based on your own requirements, or get your explicit authorization or consent in advance;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Based on your own requirements, or obtaining your explicit authorization or consent in advance, we may share your personal information."}
{"task": "rw_10.jsonl", "id": 39960, "text": "(2) Related to the obligations stipulated in the performance of our laws and regulations;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share your personal information with our obligations stipulated in laws and regulations."}
{"task": "rw_10.jsonl", "id": 39961, "text": "(3) Directly related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The sharing or disclosure directly related to national security and national defense security does not require authorization."}
{"task": "rw_10.jsonl", "id": 39962, "text": "(4) Directly related to public safety, public health, and major public interests;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Sharing or disclosure directly related to public safety, public health and major public interests does not need to be authorized."}
{"task": "rw_10.jsonl", "id": 39963, "text": "(5) Directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Sharing or disclosure related to criminal investigation, prosecution, trial, and judgment execution does not need to be authorized."}
{"task": "rw_10.jsonl", "id": 39964, "text": "(6) For the protection of your or other personal life, property and other major legal rights and interests, but it is difficult to obtain the consent of the person;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Out of the major legitimate rights and interests of the life and property of the subject of personal information or other individuals, it is difficult to get shared or disclosed by my consent, and there is no need to solicit."}
{"task": "rw_10.jsonl", "id": 39965, "text": "(7) Your personal information that you disclose to the public yourself;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The collected personal information is the sharing or disclosure of the subject of the personal information to the public by themselves without authorization."}
{"task": "rw_10.jsonl", "id": 39966, "text": "(8) Collecting personal information from legally disclosed information, such as through legal news reports, government information disclosure and other channels.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you collect personal information from the legal disclosure information, no authorization is required."}
{"task": "rw_10.jsonl", "id": 39967, "text": "(9) Sharing with the partner: In order to provide you with more complete and high -quality products and services, some of our services will be provided by the partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to provide you with perfect services, we will share your relevant personal information with our partners."}
{"task": "rw_10.jsonl", "id": 39968, "text": "We may share some of your personal information with partners to provide better customer service and user experience.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39969, "text": "We will only share your personal information for legal, legitimate, necessary, specific, and clear purposes, and will only share personal information necessary to provide services.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only share your personal information for legal, legitimate, necessary, specific, and clear purposes, and will only share personal information necessary to provide services."}
{"task": "rw_10.jsonl", "id": 39970, "text": "We will take reasonable security control measures for the software toolkit (SDK) and application program interface (API) that our partners obtain information to protect data security.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will take security control measures for the software and interfaces used by our partners to obtain information to protect data security."}
{"task": "rw_10.jsonl", "id": 39971, "text": "At the same time, in the cooperation agreement signed with the partner, we will clearly require it to abide by relevant laws and regulations to protect and handle your personal information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will ask the partner to protect your personal information in the cooperation agreement signed with the partner."}
{"task": "rw_10.jsonl", "id": 39972, "text": "We will require our partners not to have the right to use the shared personal information for any other purpose.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "The partner has no right to use the personal information that is shared for any other purpose."}
{"task": "rw_10.jsonl", "id": 39973, "text": "Please be aware that such shared partners are data controllers who have obtained your consent to process your personal information in their own names.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The partner obtains your consent to process your personal information in its own name."}
{"task": "rw_10.jsonl", "id": 39974, "text": "Cooperators may have their independent privacy policies and user agreements. We recommend that you read and abide by third -party user agreements and privacy policies.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39975, "text": "If you refuse our partners to collect personal information necessary to provide services when providing services, it may result in you being unable to use the corresponding services.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39976, "text": "At present, our partners include the following types, about the identity of the partner, the purpose, scope of collecting personal information, etc. For details, please click to check the \"Personal Information Sharing List\" \":", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For detailed information on the use of personal information by partners, please click to view the \"Personal Information Sharing List\"."}
{"task": "rw_10.jsonl", "id": 39977, "text": "a) Third-party SDK partners.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39978, "text": "b) Advertising partner.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39979, "text": "In order to help invest in advertising or provide commercial decision -making suggestions, increase the effective touch rate of advertising, and further understand the needs of user needs, we will be with advertisers and/or its entrusted agent, advertising service providers, and advertising monitoring companies (collectively referred to as \"advertising cooperation\" cooperationPartner \") Sharing your logo equipment information or user portrait statistics information, without using additional information, this information is difficult or unable to associate with your true identity.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We will share the identified device information or user portrait statistics information with advertising partners to help invest in advertising or provide commercial decision -making suggestions, increase the effective touch rate of advertising, and further understand user needs."}
{"task": "rw_10.jsonl", "id": 39980, "text": "To protect your information security, we will sign strict data security agreements with advertising partners.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39981, "text": "c) Partners who provide technical services such as infrastructure and safety monitoring.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39982, "text": "In order to improve the security of SOUL products and/or service systems, protect account security, monitor account risk, record and analyze the risk links, investigate the system problems and abnormal information of this platform, and conduct anti -fraud and anti -pseudo thief, we may take youinvestigation.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We may provide your mobile phone number, ID number, geographical location information, and log in to the IP address to provide partners in technical services to analyze the use of our service, measure the effectiveness of services, and provide customer service and investigation."}
{"task": "rw_10.jsonl", "id": 39983, "text": "d) Gift service partner.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39984, "text": "If you buy or receive physical gifts presented by other users through Soul, APP, we will provide the consignee's name, the receiving address, and the consignee's mobile phone number to the LinkedMall system operated by Alibaba Cloud Computing Co., Ltd.Gift suppliers connected by the system to help you successfully convert and mail physical gifts.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We will provide the consignee's name, the receiving address, and the consignee's mobile phone number to the gift supplier partners to help you successfully convert and mail the physical gift."}
{"task": "rw_10.jsonl", "id": 39985, "text": "(10) Situation stipulated in other laws and regulations.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39986, "text": "Please know: You can take the initiative to disclose and share your relevant information to the third -party platform (such as WeChat friend/friends circle/QQ, etc.) through the functions provided by SOUL products and/or services.", "label": ["Third Party Sharing/ Disclosure", "Edit/Control"], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39987, "text": "In this case, shared information will be spread immediately and widely.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39988, "text": "Once you share such information, it is difficult to ensure that when you need to delete information, the information you share is deleted in all Internet platforms that are reposted.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "You take the initiative to disclose and share information on a third -party platform. When you need to delete, it is difficult to ensure that the information is deleted in all Internet platforms that are reposted."}
{"task": "rw_10.jsonl", "id": 39989, "text": "In some cases, even if you delete the information you shared from SOUL products and/or services, this type of information may still leave the areas where the public can be known, and it can still be affected by other users or we are not associated with us without being controlled by us.Third -party cache, copy or storage independently, and preserved through other users or such third parties in areas that can be known in the public.", "label": ["Important", "Risk"], "rewrite": "Even if you delete the information you shared from SOUL products and/or services, this type of information may still be cached, copied or stored by other users or unrelated to us and is not controlled by us and is not controlled by us."}
{"task": "rw_10.jsonl", "id": 39990, "text": "2.3 Transfer", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 39991, "text": "In principle, we will not transfer your personal information control to other companies, organizations and individuals, except the following situations: except:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not transfer your personal information control to other companies, organizations and individuals, except the following situations: except:"}
{"task": "rw_10.jsonl", "id": 39992, "text": "(1) Based on your own requirements, or get your clear consent or authorization in advance;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Based on your own requests or obtained your clear consent or authorization in advance, we may transfer your personal information."}
{"task": "rw_10.jsonl", "id": 39993, "text": "(2) Related to the obligations stipulated in the performance of our laws and regulations;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may transfer your personal information with our obligations stipulated in laws and regulations."}
{"task": "rw_10.jsonl", "id": 39994, "text": "(3) Directly related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Directly related to national security and national defense security, we may transfer your personal information."}
{"task": "rw_10.jsonl", "id": 39995, "text": "(4) Directly related to public safety, public health, and major public interests;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Directly related to public safety, public health, and major public interests, we may transfer your personal information."}
{"task": "rw_10.jsonl", "id": 39996, "text": "(5) Directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Directly related to criminal investigation, prosecution, trial and judgment execution, we may transfer your personal information."}
{"task": "rw_10.jsonl", "id": 39997, "text": "(6) For the protection of your or other personal life, property and other major legal rights and interests, but it is difficult to obtain the consent of the person;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Out of major legitimate rights and interests such as maintaining your or other individuals, but it is difficult to get your consent, you may transfer your personal information."}
{"task": "rw_10.jsonl", "id": 39998, "text": "(7) Your personal information you disclose to the public by yourself;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may transfer your personal information of your own public to the public."}
{"task": "rw_10.jsonl", "id": 39999, "text": "(8) Collect personal information from the legal disclosure information, such as through legal news reports and government information disclosure;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may transfer personal information collected from the information disclosed by legal public."}
{"task": "rw_10.jsonl", "id": 40000, "text": "(9) Transfer of the company's merger, acquisition or bankruptcy liquidation, and the operation subject is changed.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The company may transfer personal information when the company merges, acquisitions or bankruptcy liquidation. When the operating subject is changed."}
{"task": "rw_10.jsonl", "id": 40001, "text": "Please know: If there is a need to transfer the above reasons, we will tell you the name, name, contact information, processing purpose, processing method, and personal information of the receiver before the transfer, and to transfer it after the obtaining your consent, Except for other provisions of laws and regulations.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will inform you the relevant information of the receiver before the transfer and transfer it after obtaining your consent, except for the laws and regulations."}
{"task": "rw_10.jsonl", "id": 40002, "text": "2.4 Public disclosure", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40003, "text": "In principle, we will not publish your personal information to the society or unspecified people, except the following situations: except:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In principle, we will not publish your personal information to society or unspecified people, except the following situations: (1) based on the agreement with you; (2) disclosed according to laws and regulations."}
{"task": "rw_10.jsonl", "id": 40004, "text": "(1) Based on the agreement with you;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40005, "text": "(2) Disclosure shall be disclosed in accordance with laws and regulations.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40006, "text": "3. How do you manage your personal information", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40007, "text": "3.1 Check/copy or correct/supplement your personal information", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40008, "text": "If your account is in normal use state, you have the right to log in and access your soul account at any time, check your personal information, including your account information, your personal information, comments published, and \"instant\".", "label": ["Important", "Edit/Control"], "rewrite": "You have the right to log in and visit your soul account at any time to check your personal information."}
{"task": "rw_10.jsonl", "id": 40009, "text": "If you find that your personal information is inaccurate or incomplete, or you can correct and supplement your personal information under other circumstances stipulated in laws and regulations.", "label": ["Important", "Edit/Control"], "rewrite": "If you find that your personal information is inaccurate or incomplete, you can correct and supplement your personal information."}
{"task": "rw_10.jsonl", "id": 40010, "text": "You can exercise such rights through the following path:", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40011, "text": "(1) You can click \"yourself\" to check or correct, supplement your nickname, avatar, background map, gravity signature and other information;", "label": ["Important", "Edit/Control"], "rewrite": "You can click \"yourself\" to check or correct, supplement your nickname, avatar, background map, gravity signature and other information."}
{"task": "rw_10.jsonl", "id": 40012, "text": "(2) You can check or correct your nickname, gender, password and other personal information by clicking on \"yourself-setting-account number and security\";", "label": ["Edit/Control", "Important"], "rewrite": "You can check or correct, supplement your nickname, gender, password and other personal information by clicking \"yourself-setting-account and security\"."}
{"task": "rw_10.jsonl", "id": 40013, "text": "(3) You can click \"yourself\" to visit the moment you published, and check the moments you have liked, commented and commented by clicking \"Plaza-Envelope icon\";", "label": ["Edit/Control", "Important"], "rewrite": "You can click \"yourself\" to visit the moment you published, and to check the moment you have liked and commented by clicking the \"Plaza-Envelope icon\"."}
{"task": "rw_10.jsonl", "id": 40014, "text": "(4) You can copy and export your personal information by clicking \"yourself-setting-privacy-personal information browsing and export\".", "label": ["Important", "Edit/Control"], "rewrite": "You can copy and export your personal information by clicking \"yourself-setting-privacy-personal information browsing and export\"."}
{"task": "rw_10.jsonl", "id": 40015, "text": "In the case of compliance with the law, you can also ask us to transfer your personal information to the specified personal information processor.", "label": ["Important", "Edit/Control"], "rewrite": "You can ask us to transfer your personal information to the specified personal information processor."}
{"task": "rw_10.jsonl", "id": 40016, "text": "If you cannot realize the corresponding rights through the above path, you can contact us through the contact information provided by Article 8 of this policy, and we will respond to your request in time after verifying your identity, but the laws and regulations have other provisions or this policy.Except for another agreement.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40017, "text": "3.2 Delete your personal information", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40018, "text": "In the following circumstances, you can make a request to delete your personal information to us, but except for anonymous processing of personal information or other provisions of laws and regulations:", "label": ["Edit/Control", "Important"], "rewrite": "You can make a request to delete your personal information, but except for anonymous processing of personal information or other provisions of laws and regulations."}
{"task": "rw_10.jsonl", "id": 40019, "text": "(1) We violate the provisions of laws and administrative regulations or have a agreement with you to collect, store, use, transfer, and disclose your personal information;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40020, "text": "(2) Our scope or necessary period of collection, storage, use, transfer, and disclosure of your personal information;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40021, "text": "(3) You can terminate the use of soul products and/or services by canceling or withdrawing or withdrawal consent;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40022, "text": "(4) Other circumstances stipulated in laws and regulations.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40023, "text": "In the case of meeting the above conditions, if you want to delete your personal information, you can contact us through the contact information provided by Article 8 of this policy. We will respond to your request in time after verifying your identity, but laws and regulations will be anotherExcept for other provisions or this policy.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40024, "text": "Please know that you agree that once the request is deleted, your personal information will be deleted or anonymous, unless laws, regulations or normative documents are provided.", "label": ["Important", "Edit/Control"], "rewrite": "Once the request is deleted, your personal information will be deleted or anonymous, unless laws and regulations or normative documents are provided."}
{"task": "rw_10.jsonl", "id": 40025, "text": "Please know that we may not delete the response information immediately from the backup system, but will be deleted when the backup system is updated.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Delete the information you require delete in the backup update."}
{"task": "rw_10.jsonl", "id": 40026, "text": "3.3 Change the scope of your authorization consent", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40027, "text": "Please know that in order to use SOL products and/or services normally, you need to open the relevant permissions and/or provide basic personal information to us.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40028, "text": "If you want to close the device permissions in Article 1.3 above, you can operate through the settings page in your device.", "label": ["Important", "Edit/Control"], "rewrite": "You can close the device permissions through the settings page in your device."}
{"task": "rw_10.jsonl", "id": 40029, "text": "If you want to withdraw your previous authorization of the corresponding functions of SOUL products and/or services, you can operate the corresponding operation through Soul's settings or settings in your device.", "label": ["Important", "Edit/Control"], "rewrite": "You can withdraw authorization through SOUL settings or settings in your device."}
{"task": "rw_10.jsonl", "id": 40030, "text": "When you change your consent range, we will no longer collect and use your corresponding personal information, but at the same time, please understand that we can no longer provide you with the corresponding products and/or services.", "label": ["Edit/Control", "First Party Collection Information", "Important"], "rewrite": "When you change your consent scope, we will no longer collect and use your corresponding personal information, nor provide corresponding products and/or services with it."}
{"task": "rw_10.jsonl", "id": 40031, "text": "You agree here, the scope of your authorization consent or withdrawal of the consent of authorization will not affect our personal information based on your previous authorization consent.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Your change or withdrawal authorization will not affect our personal information based on your previous authorization."}
{"task": "rw_10.jsonl", "id": 40032, "text": "3.4 Logging out your account", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40033, "text": "You can make a request to cancel your registered Soul account by clicking \"yourself\"-\"Settings\"-\"Account and Security\"-\"Logging out\"-\"Logging out\". We will verify your personal identity information and confirm that you satisfy the cancellation of cancellationAfter the condition, cancel your account.", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "You can make a request to cancel the soul account by clicking \"yourself\"-\"setting\"-\"account and security\"-\"cancellation account\"."}
{"task": "rw_10.jsonl", "id": 40034, "text": "Please know that after canceling the account, unless we retain or store your personal information in accordance with the laws and regulations or in accordance with the requirements of the regulatory authority, we will delete your personal information in time or make anonymous processing.", "label": ["Important", "Edit/Control"], "rewrite": "After canceling the account, we will delete your personal information in time or make anonymous processing, unless laws and regulations and regulatory authorities have other requirements."}
{"task": "rw_10.jsonl", "id": 40035, "text": "Please know that we may not delete these information immediately from the backup system, but delete it when the backup system is updated.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Delete the information you require delete in the backup update."}
{"task": "rw_10.jsonl", "id": 40036, "text": "The behavior of your cancellation account is irreversible. Once your account is canceled, we will no longer collect your personal information, but at the same time, please understand that we can no longer provide you with the corresponding products and/or services.", "label": ["Important", "Edit/Control"], "rewrite": "The behavior of canceling the account is irreversible."}
{"task": "rw_10.jsonl", "id": 40037, "text": "So we recommend that you choose to cancel your account carefully.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40038, "text": "3.5 Reject automation decision", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40039, "text": "In the process of using this product and/or service, we will make a decision based on non -artificial automatic decision -making mechanisms including information systems and algorithms.", "label": ["Important", "Usage"], "rewrite": "We will make decisions based on non -artificial automatic decision -making mechanisms."}
{"task": "rw_10.jsonl", "id": 40040, "text": "If you think these decisions significantly affect your legitimate rights and interests, you have the right to ask us to explain.", "label": ["Important", "Edit/Control"], "rewrite": "You have the right to ask us to explain to the decision that affects your legitimate rights and interests."}
{"task": "rw_10.jsonl", "id": 40041, "text": "(1) For the \"square\" content you are not interested, you can block the dynamic by clicking \"dislike\".", "label": ["Edit/Control", "Important"], "rewrite": "For the content of the \"square\" you are not interested in, you can block the dynamics by clicking \"dislike\"."}
{"task": "rw_10.jsonl", "id": 40042, "text": "If you don't want us to push the information and content you may be interested in when you use it, you can close the personalized recommendation function for this part by clicking \"I-Settings-Privacy-Personalized Service\".", "label": ["Important", "Edit/Control"], "rewrite": "You can close the personalized recommendation function by clicking \"I-Settings-Privacy-Personalized Service\"."}
{"task": "rw_10.jsonl", "id": 40043, "text": "(2) If you are unwilling to see the advertisements we show us according to your preference, you can close the personalized advertisement recommendation function by clicking \"yourself-setting-privacy-personalized advertisement\"., But the degree of personalization will be reduced.", "label": ["Important", "Edit/Control"], "rewrite": "You can turn off the personalized advertising recommendation function by clicking \"yourself-setting-privacy-personalized advertising\"."}
{"task": "rw_10.jsonl", "id": 40044, "text": "(3) But please understand that the \"friend matching\" function provided by your label information is because it belongs to the basic characteristics of this product, so it is impossible to provide you with a close function. If you dont agree with youUsers, please do not use soul, app.", "label": ["Important", "Edit/Control"], "rewrite": "The \"friend matching\" function provided by your label information for you cannot provide you with a close function because it belongs to the basic characteristics of this product."}
{"task": "rw_10.jsonl", "id": 40045, "text": "3.6 The right to close relatives", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40046, "text": "In the case of compliance with the law, your close relatives can exercise the rights of your relevant personal information to check, copy, correct, delete, etc.", "label": ["Important", "Edit/Control"], "rewrite": "In the case of compliance with the law, your close relatives can exercise the rights of your relevant personal information to check, copy, correct, delete, etc."}
{"task": "rw_10.jsonl", "id": 40047, "text": "You have other arrangements.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40048, "text": "3.7 respond to your above request", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40049, "text": "In order to realize the user rights described in Article 3.1-3.5 of this policy, you can click \"yourself\"-\"Settings\"-\"Help and Feedback\".plan.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40050, "text": "If you still cannot realize your user's rights in this way, you can send emails to contact us to contact us.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40051, "text": "To ensure security, we may first ask you to submit a relevant certificate to verify your identity before processing your request.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40052, "text": "For your request, we will complete the inspection and processing within 15 working days after receiving your request and give you a reply.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40053, "text": "For your reasonable request, we do not charge fees in principle.", "label": ["Important", "Edit/Control"], "rewrite": "In principle, we will not charge for your reasonable request."}
{"task": "rw_10.jsonl", "id": 40054, "text": "For not directly associated with your identity or repeat information, or need too much technical means (for example, you need to develop new systems or fundamentally change the current practice), bring risk or unrealistic requests to the legitimate rights and interests of others, we mayWill refuse.", "label": ["Important", "Data Security"], "rewrite": "We will refuse to be unrelated with your identity, repeat, need too much technical means, risk or unrealistic requests for others."}
{"task": "rw_10.jsonl", "id": 40055, "text": "If you have any questions, opinions, or suggestions, or ask us to explain to you, you can also contact us by sending emails to Soulprivacy@soulapp.cn.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40056, "text": "4. How to store your personal information", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40057, "text": "We will store your personal information collected and generated in the operation of the People's Republic of China in the operation of the People's Republic of China in the data centers of our people's Republic of China, except for cross -border transmission according to the provisions of applicable laws.", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in domestic operations will be stored in China."}
{"task": "rw_10.jsonl", "id": 40058, "text": "Since Soul, APP serves global users, the personal information we collected outside China is stored in Soul's data centers abroad. In this case, we will protect yourpersonal information.", "label": ["Data Retention", "Important"], "rewrite": "The personal information we collected outside China is stored in Soul's data centers abroad."}
{"task": "rw_10.jsonl", "id": 40059, "text": "We are not currently transmitted by the information collected and generated in the operation of the People's Republic of China in the operation of the People's Republic of China. If we need to transfer the personal information collected in mainland China to other judicial regions, we will follow the requirements of relevant applicable laws.For data outbound security impact assessment, implementing unified security measures, and soliciting your consent to ensure that all such transfer meets the requirements of local data protection laws.", "label": ["Important"], "rewrite": "The information collected and generated in the operations of mainland China in mainland China is not currently transmitted. If we need to transmit cross -border transmission, we will conduct a security assessment, implement safety security measures, and solicit your consent to ensure the transfer to meet the local data protection laws.Requirements."}
{"task": "rw_10.jsonl", "id": 40060, "text": "We promise that except for laws and regulations, or you ask us to delete personal information in accordance with the law, our storage time for your personal information will be limited to the shortest time for the purpose of your authorization.", "label": ["Data Retention", "Important"], "rewrite": "Reserves your personal information within the time limit required for the service purpose, unless the law has other requirements."}
{"task": "rw_10.jsonl", "id": 40061, "text": "If we have partial or all due to poor management or other reasons, unless laws, regulations or standardized documents have other provisions or other parties, we will inform you that this situation and stop your personal informationCollect it, delete the collected personal information or anonymous processing it.", "label": ["Important", "Cessation of Operations"], "rewrite": "When stopping operations, we will inform you and delete or processes your personal information."}
{"task": "rw_10.jsonl", "id": 40062, "text": "5. How to protect your personal information", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40063, "text": "We attach great importance to your personal information security. To this end, we have adopted multi -level protection measures such as security technical measures that meet industry standards and supporting organizational structures and management systems to prevent your personal information from being leaked, damaged, and misused to the greatest extent.Unauthorized access, unauthorized disclosure or change, specifically:", "label": ["Important", "Data Security"], "rewrite": "We have adopted multi -level protection measures such as security technical measures that meet industry standards and supporting organizational structures and management systems to protect your information security."}
{"task": "rw_10.jsonl", "id": 40064, "text": "5.1 Data security measures", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40065, "text": "In terms of data security transmission, we adopt password technologies such as transport layer security protocols to prevent the transmission link from being eavesdropped and intercepted through HTTPS and other methods to establish a secure privacy data environment to ensure the privacy and integrity of the data;", "label": ["Important", "Data Security"], "rewrite": "In terms of data security transmission, we adopt password technologies such as transport layer security protocols."}
{"task": "rw_10.jsonl", "id": 40066, "text": "We also use Token technology to protect the security of data during its transmission, and use a proper protection mechanism to prevent the data from being maliciously attacked;", "label": ["Important", "Data Security"], "rewrite": "We use Token technology to protect the security of data during its transmission."}
{"task": "rw_10.jsonl", "id": 40067, "text": "In addition, we will take additional security protection measures such as encrypted storage.", "label": ["Important", "Data Security"], "rewrite": "We will take additional security protection measures such as encrypted storage."}
{"task": "rw_10.jsonl", "id": 40068, "text": "In terms of data access and use security control, we have implemented a strict data permissions control mechanism to monitor the behavior of handling your personal information to avoid data from illegal access and unauthorized use.", "label": ["Important", "Data Security"], "rewrite": "We have implemented a strict data permissions control mechanism to monitor the behavior of handling your personal information."}
{"task": "rw_10.jsonl", "id": 40069, "text": "We will scan all the interfaces of this product on a regular basis, and take protection measures such as preventing malicious code and traffic attacks to prevent your personal information from undergoing unauthorized access, public disclosure, use, modification, artificial or accidental damage or loss of damage or losswait.", "label": ["Important", "Data Security"], "rewrite": "We will regularly scan all the interfaces of this product."}
{"task": "rw_10.jsonl", "id": 40070, "text": "In order to protect your information security, if the user's personal information is incorrect, this product will access, correct or delete relevant information according to the user's requirements after strictly verifying and verifying the user identity (unless Soul must retain these personal information for legal reasons, these personal information must be retained.To.", "label": ["Edit/Control", "Important"], "rewrite": "If the user's personal information is incorrect, this product will access, correct or delete relevant information according to the user's requirements after strictly verifying and verifying the user identity."}
{"task": "rw_10.jsonl", "id": 40071, "text": "We will take all reasonable and feasible measures to ensure that unrelated personal information is not collected.", "label": ["Important", "Data Security"], "rewrite": "We will take measures to ensure that unrelated personal information is not collected."}
{"task": "rw_10.jsonl", "id": 40072, "text": "We will only retain your personal information within the time limit required by the cost of reaching the cost policy, unless the reserved period is extended within the scope of law.", "label": ["Data Retention", "Important"], "rewrite": "Reserves your personal information within the time limit required for the service purpose, unless the law has other requirements."}
{"task": "rw_10.jsonl", "id": 40073, "text": "5.2 Data security organization and management measures", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40074, "text": "According to the requirements of relevant regulations, we have established departments responsible for personal information protection, and the person in charge of personal information protection is established.", "label": ["Important", "Data Security"], "rewrite": "We set up a department specializing in personal information protection and set up the person in charge of personal information protection."}
{"task": "rw_10.jsonl", "id": 40075, "text": "We have also established relevant internal control management processes, with the principle of minimum authorization, and strictly set information access permissions for staff who may contact your personal information, and know the scope of knowledge of personal information.", "label": ["Important", "Data Security"], "rewrite": "We have established relevant internal control management processes, with the principle of minimum authorization."}
{"task": "rw_10.jsonl", "id": 40076, "text": "We have established an internal norm system for data securely using to ensure the processing of your personal information and meet the security requirements of laws and regulations in the collection, transmission, use, storage, transfer, and destruction.", "label": ["Important", "Data Security"], "rewrite": "We have established internal normative system for data securely use."}
{"task": "rw_10.jsonl", "id": 40077, "text": "According to the requirements of relevant regulations, for staff who need to access personal information, we will ask them to approve the person in charge of personal information or their authorized managers, record the visits, and take technical measures to avoid illegal replication and download personal information.", "label": ["Important", "Data Security"], "rewrite": "For the staff who need to visit personal information, we will ask them to be approved by the person in charge of personal information or their authorized managers, record the visits, and take technical measures."}
{"task": "rw_10.jsonl", "id": 40078, "text": "We organize employees to participate in the training of safety and privacy protection and require them to complete the requirements for assessment to strengthen employees' awareness of protecting the importance of personal information.", "label": ["Important", "Data Security"], "rewrite": "Organize safety and privacy protection training courses to strengthen employee understanding."}
{"task": "rw_10.jsonl", "id": 40079, "text": "5.3 Safety event processing", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40080, "text": "In order to cope with the possible risks of personal information leakage, damage and loss, we have established a dedicated emergency response team to launch a safety plan for different security incidents in accordance with the company's relevant security incidents in accordance with the company., Joint relevant departments conduct traceability and crackdown.", "label": ["Important", "Data Security"], "rewrite": "We have established a special emergency response team to launch a safety plan for different security events."}
{"task": "rw_10.jsonl", "id": 40081, "text": "At the same time, we will inform you in a timely manner in accordance with the requirements of laws and regulations: the basic situation and possible impact of security incidents, the disposal measures we have adopted or we are going to take, the suggestions that you can prevent and reduce risks, and remedy your remedy measures, etc.Essence", "label": ["Important", "Data Security"], "rewrite": "If a personal information security incident occurs, we will inform your basic situation, possible impact, disposal measures, independent prevention suggestions, etc."}
{"task": "rw_10.jsonl", "id": 40082, "text": "At the same time, we will inform you that the incident -related situation is in the form of email, letter, telephone, push notification, etc. When it is difficult to inform the subject of personal information one by one, we will publish an announcement in a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "The relevant situation of security incidents will be informed by mail, letter, telephone, push notification, etc. When it is difficult to inform one by one, it will issue an announcement."}
{"task": "rw_10.jsonl", "id": 40083, "text": "At the same time, we will also actively report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "Report the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities."}
{"task": "rw_10.jsonl", "id": 40084, "text": "Please know and understand that the Internet is not an absolute security environment. We strongly recommend that you help us ensure your account security through a security method and complex password.", "label": ["Important", "Data Security"], "rewrite": "Please use complex passwords to help us guarantee your account security."}
{"task": "rw_10.jsonl", "id": 40085, "text": "If you find your personal information disclosure, especially your account or password leak, please contact Soulprivacy@soulapp.cn so that we can take corresponding measures to protect your information security.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40086, "text": "6. How to protect personal information of minors", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40087, "text": "After the revision of Soul, the APP, if your age is less than 18 years old, you will not be able to register this product.", "label": ["Specific Audiences", "Important"], "rewrite": "After the Soul APP is revised, if your age is less than 18 years old, you will not be able to register this product."}
{"task": "rw_10.jsonl", "id": 40088, "text": "If you are a minor user who has already registered before the revision, we will protect your personal information security according to the requirements of my country's laws and regulations.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a minor user who has already registered before the revision, we will protect your personal information security according to the requirements of my country's laws and regulations."}
{"task": "rw_10.jsonl", "id": 40089, "text": "If you are: (1) Children (please refer to the definition of keywords for details), we must read and agree with the entire content of this agreement and the \"Soul Child Privacy Protection Guide\" by your guardianProducts and/or services in service mode.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a child, you must read and agree with the entire content of this agreement and the \"Soul Child Privacy Protection Guide\", you can use products and/or services."}
{"task": "rw_10.jsonl", "id": 40090, "text": "In order to obtain the consent of the guardian, we will ask the guardian to submit the name, ID number, and mobile phone number, and verify the guardianship relationship between the guardian and the guardian in a reasonable way;", "label": ["Specific Audiences", "Important"], "rewrite": "In order to obtain the consent of the guardian, we will ask the guardian to submit the name, ID number, and mobile phone number, and to verify the guardian relationship between the guardian and the guardian in a reasonable way."}
{"task": "rw_10.jsonl", "id": 40091, "text": "(2) User users who are already 14 years old must be accompanied by your guardian to read all the contents of this agreement, and you can use the Soul youth protection service model after the guardian or you agree with the entire content of this agreement.Products and/or services below.", "label": ["Specific Audiences", "Important"], "rewrite": "Minor users who have reached 14 years of age can only be used after the guardian agrees with the content of this agreement."}
{"task": "rw_10.jsonl", "id": 40092, "text": "If we have evidence to prove that you have violated the above agreement, we have the right to stop providing our products and/or services.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40093, "text": "You understand and promise that the age information you provided to us is real. If we analyze and calculate that you may belong to minors through technical means, we have the right to take restrictions on your soul account, that is, restricting your account number restricting your account numberBrowse, use specific functions and consumer behavior.", "label": ["Specific Audiences", "Important"], "rewrite": "If we analyze and calculate that you may belong to minors through technical means, we have the right to take restrictions on your soul account."}
{"task": "rw_10.jsonl", "id": 40094, "text": "The above restrictions are to protect the physical and mental health and safety of minors, and you cannot withdraw any claims to us.", "label": ["Specific Audiences", "Important", "Risk"], "rewrite": "Take restrictions on your soul account to protect the physical and mental health and safety of minors, and you cannot withdraw any claims to us."}
{"task": "rw_10.jsonl", "id": 40095, "text": "If you think you are not minors, please make real -name authentication.", "label": ["Specific Audiences", "Important"], "rewrite": "If you think you are not minors, please make real -name authentication."}
{"task": "rw_10.jsonl", "id": 40096, "text": "After verifying your identity, we immediately revoke you and restore it to the original state of use.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40097, "text": "If the guardian of minors finds that once the minor reports the age registration soul account, the soul account of the minor can be suspended/terminated to us through the method of Article 8 of this policy or provided Soul to the minor to provide SOUL SOULProducts and/or services in the adolescent protection service mode.", "label": ["Edit/Control", "Specific Audiences", "Important"], "rewrite": "If the guardian of the minor is found that once the minor reports the age registered SOUL account, the SOUL account number of the minor may be proposed or the product and/or service of the product in the SOUL youth protection service model."}
{"task": "rw_10.jsonl", "id": 40098, "text": "In order to verify that the request party is the guardian of the minor, please provide us with a copy/scanning piece and a guardian mobile phone number of the identity card (front and negative) of the guardian and guardian to ensure the security of SOUL users.", "label": ["Data Security", "Specific Audiences", "First Party Collection Information", "Important"], "rewrite": "In order to verify that the requestant is the guardian of the minor, please provide us with a copy/scanning piece and a guardian's mobile phone number of the identity card of the guardian and the guardian."}
{"task": "rw_10.jsonl", "id": 40099, "text": "After receiving your above -mentioned documents, we will timely review its authenticity and effectiveness, and please ensure that the guardian's mobile phones are unobstructed so that our professional customer service will contact you to further verify your identity (if you need).", "label": ["Data Security"], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40100, "text": "Regarding the consent of the guardian to collect personal information of minors, we will only use or disclose the information when the law allows, the guardian clearly agrees or protects the necessary minors.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Important"], "rewrite": "We will only use or disclose the information of minors when the law allows, the guardian's clear consent or protection of minors."}
{"task": "rw_10.jsonl", "id": 40101, "text": "If we find that the personal information of minors who have been guarded by the guardian in advance, we will delete relevant information as soon as possible.", "label": ["Specific Audiences", "Important"], "rewrite": "If the personal information of minors was collected without the consent of the legal guardian, he would try to delete relevant information as soon as possible."}
{"task": "rw_10.jsonl", "id": 40102, "text": "7. How to update this policy", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40103, "text": "Due to business development and regulations, we may update or modify this policy from time to time.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40104, "text": "We will publish the updated privacy policy on this page, but without your clear consent, we will not reduce the rights you should enjoy in accordance with this policy.", "label": ["Policy Change", "Important"], "rewrite": "We will release the updated privacy policy, but without your clear consent, we will not reduce the rights you should enjoy in accordance with this policy."}
{"task": "rw_10.jsonl", "id": 40105, "text": "These changes are part of the cost policy.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40106, "text": "Please read the content of this policy carefully.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40107, "text": "You agree and continue to use SOUL products and/or services, which means that you agree with the content of this policy (including the updated version).", "label": ["Policy Change", "Important", "Risk"], "rewrite": "You use SOUL products and services to indicate that you agree with the content of this policy (including the updated version)."}
{"task": "rw_10.jsonl", "id": 40108, "text": "If it involves major and substantial changes, we will notify you in a significant way (including but not limited to \"Settings-About Soul-Barrow Board\" in a significant way In -site letter prompts, etc.).", "label": ["Policy Change", "Important"], "rewrite": "If it involves major and substantive changes, we will notify you in a significant way in accordance with the specific situation."}
{"task": "rw_10.jsonl", "id": 40109, "text": "The situation of major and substantive changes includes but not limited to the following situations:", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40110, "text": "(1) Our service model has changed significantly.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40111, "text": "Such as the purpose of processing personal information, the type of personal information processed, the way of using personal information, etc.;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40112, "text": "(2) We have undergone major changes in the aspects of ownership structure and organizational structure.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40113, "text": "Such as changes caused by business adjustments, bankruptcy mergers and acquisitions, etc.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40114, "text": "(3) The main object of personal information sharing, transfer or public disclosure changes;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40115, "text": "(4) The right to participate in personal information processing and its exercise methods have changed significantly;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40116, "text": "(5) When we are responsible for handling the responsibility departments, contact methods and complaint channels of personal information security;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40117, "text": "as well as", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40118, "text": "(6) Evaluation report on the protection of personal information shows that there is a high risk.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40119, "text": "8. How to contact us", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40120, "text": "If you have any questions, reports or complaints on this privacy policy when using Soul's products and/or services, you can send emails to soulprivacy@soulapp.cn or via Soul's \"Settings-Settings-Help and Feedback\" channel or feedback or feedback \"Other contact information announced on the Soul website (www.soulapp.cn) contact the person in charge of our personal information protection.", "label": ["Important", "Contact Information"], "rewrite": "Email: Soulprivacy@soulapp.cn; Online contact information: other contact information publicized by the \"yourself-setting-help and feedback\" channel or SOUL website (www.soulapp.cn) in Soul contacts the person in charge of personal information protection."}
{"task": "rw_10.jsonl", "id": 40121, "text": "We will review the issues involved as soon as possible, and complete the verification and processing within 15 working days after receiving your request and give a reply.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40122, "text": "9. Attachment", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40123, "text": "The interpretation and dispute resolution of this policy shall apply the laws of the People's Republic of China.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40124, "text": "Any disputes related to this policy, the two parties should be resolved by friendly negotiation;", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40125, "text": "If you cannot negotiate, you will agree to submit the dispute to the People's Court of Pudong New District, Shanghai.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40126, "text": "If any court with jurisdiction rules or judge any terms of this policy invalid, this clause will be removed from this policy, but the invalidation of this clause will not affect the effectiveness of the other terms of this policy.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40127, "text": "The remaining terms of this policy will continue to be implemented.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40128, "text": "The title of this policy is only designed for the convenience of reading, and does not affect the meaning or explanation of any terms of this policy.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40129, "text": "10. Keyword definition", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40130, "text": "SOUL: refers to the Soul APP and their respective versions developed by Shanghai Renyimen Technology Co., Ltd..", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40131, "text": "/SOUL products and/or services: refers to the following products and/or services provided by Soul: (1) Soul products and/or services provided by Soul APP;", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40132, "text": "(2) Any software related to/or service related to the above products;", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40133, "text": "(3) Other products and/or services we provide for you from time to time.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40134, "text": " User or you: refers to users who use this product and/or service.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40135, "text": " Minor: Refers to minors who are not more than 18 years old.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40136, "text": " Personal information: Refers to various information recorded by electronics or other methods, being able to identify specific natural persons or reflect the activity of specific natural person activities with other information.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40137, "text": "Personal information includes personal information, personal identity information, personal biometric information, network identity identification information, personal health and physiological information, personal education work information, personal property information, personal communication information, contact information, personal Internet records, personal commonly used devices for individualsInformation, personal location information, etc.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40138, "text": "To avoid doubt, personal information includes but is not limited to personal sensitive information.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40139, "text": " Personal sensitive information: Refers to personal information such as leakage, illegal provision or abuse that may endanger people's body and property, and it is easy to lead to personal information such as personal reputation, physical and mental health damage or discriminatory treatment.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40140, "text": "Personal sensitive information includes personal property information, personal health and physiological information, personal biometric information, personal identity information, network identity identification information, etc.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40141, "text": " Devitization: Refers to the process of processing your process without using additional information through technical processing of personal information.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40142, "text": " Anonymous: Refers to the process that you cannot be recognized by the technical processing of personal information, and the processing information after processing cannot be restored.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40143, "text": " Device: refers to devices that can access SOUL products and/or services.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40144, "text": " The territory of China and the People's Republic of China: Refers to the mainland of the People's Republic of China (only the purpose of this policy, does not include the Hong Kong Special Administrative Region, the Macau Special Administrative Region and Taiwan).", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40145, "text": "1 Children: Refers to minors under the age of 14.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40146, "text": " Planet: According to the list of user lists that may be interested in algorithm, the star group is simulated at the visual and interactive level.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40147, "text": "Sstate: Users can share their own information in the form of publishing dynamics, and obtain information shared by others in the form of browsing dynamics.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40148, "text": "The medium of information contains but is not limited to text, pictures, videos, audio, music links, voting, location, and interactive exchanges that can like information, comment, collect, and repost.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40149, "text": " Community SSR certification: \"SSR\" full name \"Super Soul Real\" is a collective name for Soul's high -quality content creators.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40150, "text": "The SOUL \"SSR\" plan is committed to digging, cultivating, and supporting original content authors.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40151, "text": "If users become SSR masters, they will have the opportunity to obtain a number of exclusive rights and interests such as exclusive signs, cash incentives, and official recommendations.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40152, "text": " Group chat party: Theme multiplayer voice chat function. Users can participate in multiplayer voice chat. After real -name authentication, you can create a multi -person voice chat room.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40153, "text": "Gravity signing: Users can add the label describing themselves, which may involve describing the user's interest, hobbies, personality, resumes, or occupational information.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40154, "text": "The system will apply these tags to content recommendations with users, push the content or other users that may be interested in.", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40155, "text": "Appendix: SOUL APP Personal Information Sharing List", "label": [], "rewrite": []}
{"task": "rw_10.jsonl", "id": 40156, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
