{"task": "rw_129.jsonl", "id": 77513, "text": "Release date: May 13, 2019", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77514, "text": "Recent update date: November 30, 2022", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77515, "text": "Effective time of this version: December 5, 2022", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77516, "text": "Update prompt:", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77517, "text": "Dear tiger teeth users, in order to protect your right to knowledge and strengthen the protection of your personal information security, we have recently updated the \"Huya Live Privacy Policy\".", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77518, "text": "The main content of this version of \"Huya Live Privacy Policy\" is to improve the required collection of your personal information in the first part (3) the security guarantee scene;", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77519, "text": "The third -party third -party SDK directory adds the third -party SDK (pangolin) and your personal information content.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77520, "text": "Please read and fully understand the full text before using/continue to use Huya live product and/or service, and use/continue to use after agreeing with all the content.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77521, "text": "introduction", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77522, "text": "Huya Live provides product operation and services by Guangzhou Huya Information Technology Co., Ltd. and its affiliated companies (hereinafter referred to as \"we\" or \"company\").", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77523, "text": "We know the importance of personal information to you and do our best to protect your personal information security and reliable.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77524, "text": "This policy is applicable to Huya Live Client applications, applets and related product services.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77525, "text": "Before using Huya live broadcast, please read carefully and thoroughly understand this policy, especially the clauses that are identified by the threading of the threatened/thick body. You should focus on reading and use related products or services after confirming and agreeing to.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77526, "text": "In addition to this privacy policy, in specific scenarios, we will also explain the corresponding information collection purposes, scope, and usage methods through instant notifications (such as pop -up windows, page prompts, message reminders), web announcement, etc.The notification, webpage announcement, etc. constitute a part of the privacy policy, and have the same effect as the privacy policy.", "label": ["Policy Change", "Important", "First Party Collection Information"], "rewrite": "It will explain the purpose, scope, and usage method of information collection through instant notification (such as pop -up window, page prompts, message reminders), web announcement, etc., which are part of these privacy policies that constitute the privacy policy."}
{"task": "rw_129.jsonl", "id": 77527, "text": "In order to facilitate your rapid understanding of the content of \"Huya Live Privacy Policy\", we will briefly and intuitively explain how we handle and protect your personal information through the \"Summary of the Privacy Policy of Huya Live\", which is more detailed in our personal information about your personal information.For processing rules, please continue to consult this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77528, "text": "The following will help you understand how we collect, use, store, transmit and protect personal information;", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77529, "text": "Help you understand the way to query, correct, supplement, delete, and copy personal information.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77530, "text": "Among them, important terms of your personal information rights and interests We have reminded in bold forms, please pay special attention.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77531, "text": "1. How do we collect and use personal information", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77532, "text": "2. How do we use cookies equivalent technology", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77533, "text": "3. How can we share, transfer, and publicly disclose personal information", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77534, "text": "4. How do we store personal information", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77535, "text": "5. How do we protect the security of personal information", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77536, "text": "6. Manage your personal information", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77537, "text": "7. Terms of minors", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77538, "text": "8. Privacy policy update", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77539, "text": "Nine, dispute resolution", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77540, "text": "10. Contact us", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77541, "text": "1. How do we collect and use personal information", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77542, "text": "Huya live broadcast and use your personal information based on laws and regulations and follow the principles of legitimate, legal, and necessary.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "Huya live broadcast and use your personal information based on laws and regulations and follow the principles of legitimate, legal, and necessary."}
{"task": "rw_129.jsonl", "id": 77543, "text": "You can use Huya Live APP [Settings]-[Personal Information Collection List] to specifically check our collection and use your personal information.", "label": ["Important", "First Party Collection Information"], "rewrite": "View the situation of collecting and using personal information through Huya Live APP [Settings]-[Personal Information Collection List]."}
{"task": "rw_129.jsonl", "id": 77544, "text": "In the process of using our products or services, we usually collect and use your personal information in the following scenes.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77545, "text": "(1) Register and log in", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77546, "text": "(1) When you register and log in to Huya live accounts, we will collect your mobile phone number, email, and password, and may send you a verification code to verify the effectiveness of the account to generate a Huya account for registered users.", "label": ["Important", "First Party Collection Information"], "rewrite": "Will collect your mobile phone number, email and password"}
{"task": "rw_129.jsonl", "id": 77547, "text": "Please know that we collect this information to meet the real -name system requirements of relevant laws and regulations and help you generate efficient and reliable login vouchers to protect your account security.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77548, "text": "If you only need to use basic live broadcast and video browsing service, you do not need to register your account and provide the above information.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77549, "text": "(2) You can also log in to our platform with third -party accounts (including WeChat, QQ, Sina Weibo, third -party channel vendors (such as Huawei, Apple and other manufacturers).", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77550, "text": "If you log in with a third -party platform account, we will obtain the relevant information under your third -party account (including user ID, nickname, avatar and account verification information) based on your authorization.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "It will obtain the relevant information under your third -party account based on your authorization (including user ID, nickname, avatar and account verification information)"}
{"task": "rw_129.jsonl", "id": 77551, "text": "The purpose of obtaining your above information from a third party is to help you quickly generate user login status so that you can complete the registration and login faster.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77552, "text": "You can at any time in Huya Live APP [Settings]-[Account number and security]-[third-party binding], choose to bind or cancel the above-mentioned third-party account information.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77553, "text": "(3) After you log in to Huya live account, if you are willing to add an additional avatar, nickname, gender, birthday, region, signature, draft box, video publishing, etc., it will help you get more social funIf you do not provide the aforementioned information, it will not affect your basic features of Huya live broadcast.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect personal information such as avatars, nicknames, gender, birthday, region, signature, draft box, video published video"}
{"task": "rw_129.jsonl", "id": 77554, "text": "If you only need to use the browse function, you can also choose to do it without logging in and not providing the above information.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77555, "text": "(2) Real -name authentication", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77556, "text": "When you use the functions or services that you need to apply for live, apply for withdrawal or other real -name authentication, according to relevant national laws and regulations, you need to provide us and a third -party authentication agency providing your authentication services with your true identity information to complete the real -name certification.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your real identity information to complete the real -name authentication"}
{"task": "rw_129.jsonl", "id": 77557, "text": "It mainly includes the following categories:", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77558, "text": "(1) When you apply for registration (anchor) for the publisher (anchor), Huya Live will collect your real name and identity document number in accordance with relevant laws and regulations, and perform identity consistency verification through your facial recognition information.Essence", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your real name and ID number for real -name authentication"}
{"task": "rw_129.jsonl", "id": 77559, "text": "If you choose to complete the real -name authentication method, we may collect your real name, ID information (including but not limited to identity documents, front and back pictures of the corresponding documents, and photos of your corresponding ID).", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect real names, identity documents (including but not limited to identity documents, positive and negative pictures of the corresponding documents, and photos of your corresponding ID)"}
{"task": "rw_129.jsonl", "id": 77560, "text": "After passing the real -name authentication, you can engage in live release activities on the platform.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77561, "text": "If you have an anchor commission withdrawal, you also need to provide bank card information consistent with your identity information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect bank card information consistent with your identity information"}
{"task": "rw_129.jsonl", "id": 77562, "text": "In order to accurately verify your identity, we will compare the above information.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77563, "text": "Your real name, ID information, facial recognition information, handheld ID photos and bank card information are personal sensitive information. We collect this type of information based on real -name authentication requirements. You can refuse to provide it, but you may not be able to use real -name users relatedServices (such as broadcasting, commission withdrawal), but do not affect your normal use of other functions or services.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect real names, identity documents, facial recognition information, handheld ID photos and bank card information, you can refuse to provide, but you may not be able to use real -name user -related services (such as broadcasting, commission withdrawal), but not affecting normal use of other servicesEssence"}
{"task": "rw_129.jsonl", "id": 77564, "text": "(2) When you participate in some withdrawal activities, in accordance with the requirements of relevant regulations and policies, we may need to collect information such as your real name, ID number, and other information to complete the real -name authentication. The specific information is based on the content of the event page.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect information such as your real name, ID number and other information to complete the real -name authentication"}
{"task": "rw_129.jsonl", "id": 77565, "text": "(3) Security", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77566, "text": "In order to maintain the safe and stable operation of products or services, identify an account abnormality, prevent malicious procedures, and anti -fraud, we will collect your following information:", "label": ["Important", "First Party Collection Information"], "rewrite": "Will collect your information:"}
{"task": "rw_129.jsonl", "id": 77567, "text": "(1) Network log information, including account login logs, operation time, operation records, network source address and target address, network source port, client hardware characteristics, interactive release records, running collapse logs;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect network log information, including account login logs, operation time, operating records, network source address and target address, network source port, client hardware characteristics, interactive release record, running collapse log"}
{"task": "rw_129.jsonl", "id": 77568, "text": "(2) Your device information, including: device model, operating system version, device logo (IMEI, Androidid, OAID, Openudid, Guid, SIM card, IMSI information, IDFA, IDFV), SIM integrated circuit card recognition code iccid,Geographical location information, installation application list, process information that is running, network equipment hardware address (MAC address), hardware serial number, IP address, software version number, access to network, type and status, network quality and data, WIFI, WIFI, WiFi, WiFiScan lists, WIFI names (SSID), WIFI, MAC address (BSSID), operator information, Bluetooth, device sensor (such as magnetic sensors, acceleration sensors) reflected in the equipment feature information.", "label": ["Important", "First Party Collection Information"], "rewrite": "The process information that has been installed, running process information, network equipment hardware addresses (MAC address), hardware serial number, IP address, software version number, access to network, type and status, network quality data, WIFI scan list, WIFI, WiFiName (SSID), WIFI MAC address (BSSID), operator information, Bluetooth, device sensor (such as magnetic sensor, acceleration sensor)"}
{"task": "rw_129.jsonl", "id": 77569, "text": "The above information will be used to comprehensively judge the security of accounts and transactions, conduct authentication, identify illegal behavior and content, and prevent security events, and take necessary records, audit, analysis and disposal measures.", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77570, "text": "(4) Browse or content production", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77571, "text": "When you browse the live room content, web page content, video player content, or dynamic release of photos and camera shooting, we will call the device's gravity and gyroscope sensor to identify your current horizontal and vertical screen status.", "label": ["Permission Acquisition", "Important"], "rewrite": "Call the gravity of the device and the gyroscope sensor to identify the current horizontal and vertical screen status of your device"}
{"task": "rw_129.jsonl", "id": 77572, "text": "When you browse AR content, we will call the rotating vector sensor and gyroscope sensor of the device to identify your device's current relative holding state and provide a better viewing experience.", "label": ["Permission Acquisition", "Important"], "rewrite": "Call the rotating vector sensor and gyroscope sensor of the device to identify your device in the current relative grip"}
{"task": "rw_129.jsonl", "id": 77573, "text": "Simple sensor data is only for identifying equipment performance and equipment status, so as to provide relevant content browsing or content production services without involving any personal sensitive information.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77574, "text": "(5) Personalized recommendation", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77575, "text": "To show you the live broadcast or audio and video content that you may be interested in, to provide functions or services that are more suitable for you. We will collect and use your relevant information, and use the algorithm model for features and preferences.Provide personalized recommendation services.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect and use relevant information, and analyze features and preferences through algorithm models to provide personalized recommendation services"}
{"task": "rw_129.jsonl", "id": 77576, "text": "We may collect and use your following information for this:", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77577, "text": "(1) You use the operating behavior information when using Huya live broadcast, including your clicks, attention, subscriptions, search, browsing, comments, release, sharing and reward transactions related records when you visit/use Huya live broadcast.And the gender, birthday, regional and other personal information and information you fill in;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your operating behavior information when using Huya live broadcast"}
{"task": "rw_129.jsonl", "id": 77578, "text": "(2) Your device information (including IDFA, OAID, IMSI, installation application list information, etc.) and location information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your device information (including IDFA, OAID, IMSI, installation application list information, etc.) and location information"}
{"task": "rw_129.jsonl", "id": 77579, "text": "When you turn on the device positioning function and use the relevant services provided by our position, we will obtain your geographical location information through the IP address, GPS, and WLAN access points, base stations, and Bluetooth sensor information that can provide location information in order to get your geographical location information in orderProvide you related recommendations (such as providing users in Hunan with live broadcast content and recommended live content of your nearby anchors).", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your geographical information in order to provide you with relevant recommendation services"}
{"task": "rw_129.jsonl", "id": 77580, "text": "Geographical location permissions are device sensitivity permissions, please open it carefully.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77581, "text": "We will constantly adjust and optimize the recommendation results according to your operating behavior during the use of Huya to better provide you with high -quality content.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77582, "text": "Please know that, in addition to obtaining your separation or laws and regulations, the personalized recommendation mechanism of Huya Live will not be combined with user identity information to ensure that you do not recognize the true identity of a specific natural person.", "label": ["Important", "Data Security", "Usage"], "rewrite": "In addition to obtaining separate authorization or laws and regulations, the personalized recommendation mechanism of Huya Live will not be combined with user identity information to ensure that it does not recognize the true identity of a specific natural person."}
{"task": "rw_129.jsonl", "id": 77583, "text": "We provide a convenient way for you to autonomously manage the personalized recommendation mechanism.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77584, "text": "If you are not interested in the personalized content of Huya push or want to reduce some personalized content recommendation, you can find the label button in the lower right corner of each static screen in the \"Recommended\" column, click the buttonManage your personalized push content: classification and \"not interested\".", "label": ["Edit/Control", "Usage", "Important"], "rewrite": "Manage your personalized push content through three ways: accurate shielding anchor, accurate shielding classification, and \"not interested\""}
{"task": "rw_129.jsonl", "id": 77585, "text": "You can also directly use Huya Live APP [Settings]-[Privacy Settings]-[Personalized Recommendation Settings], choose to close personalized recommendations.", "label": ["Important", "Edit/Control"], "rewrite": "You can directly via Huya Live APP [Settings]-[Privacy Settings]-[Personalized Recommendation Settings], select to close personalized recommendations"}
{"task": "rw_129.jsonl", "id": 77586, "text": "When you close your personalized content recommendation, we will no longer show you the \"recommendation\" column, but will only push you to you with universal content that has nothing to do with your preference.", "label": ["Edit/Control", "Important"], "rewrite": "After closing the personalized content recommendation, we will no longer show you the \"recommendation\" column"}
{"task": "rw_129.jsonl", "id": 77587, "text": "In order to recommend personalized advertisements with a higher level of correlation with you and reduce the invasion of unrelated advertisements, we will show you as much as possible according to your service.Essence", "label": ["Important", "Usage"], "rewrite": "According to the situation of the service, it will show as much as possible as much as possible and related to your advertisements that are more related to you"}
{"task": "rw_129.jsonl", "id": 77588, "text": "You can click here to learn and manage the content of personalized advertisements. You can also check and manage through Huya Live APP [Settings]-[Privacy Settings]-[Advertising Personalized Management].", "label": ["Edit/Control", "Usage", "Important"], "rewrite": "You can check and manage through Huya Live APP [Settings]-[Privacy Settings]-[Personalized Management of Advertising]"}
{"task": "rw_129.jsonl", "id": 77589, "text": "(6) Recharge consumption", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77590, "text": "When you use the recharge of Huya products or buy virtual items or physical products and services through Huya, we will collect your recharge records, consumption records, and order information in order to check your own transaction records and protect you to the greatest extent to protect you to the greatest extent.Property and virtual property safety.", "label": ["Important", "First Party Collection Information"], "rewrite": "Will collect recharge records, consumption records, and order information in order to query your transaction records"}
{"task": "rw_129.jsonl", "id": 77591, "text": "If you need to send a product, you also need to provide information such as the consignee's name, address, contact phone number.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect information such as the consignee's name, address, contact phone number and other information for delivery"}
{"task": "rw_129.jsonl", "id": 77592, "text": "Refusing to provide such information will make you unable to use the above related functions, but it does not affect your normal use of other functions or services.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Refusing to provide such information will make you unable to use the above related functions, but it does not affect your normal use of other functions"}
{"task": "rw_129.jsonl", "id": 77593, "text": "(7) Huya Mini Program", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77594, "text": "In order to better help you participate in the live broadcast room interaction, the Huya platform has opened a series of applet tools. These small programs will be used by the anchor for audience interaction in the live broadcast room.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77595, "text": "Huya prompts you here:", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77596, "text": "1. When you use the function of the tiger tooth mini -program, tiger teeth will not disclose to the small program developer and disclose your personal information.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77597, "text": "2. Some of the Huya applets of the Huya platform are provided by the external third -party subject. This type of applet may need to collect some of your information (such as avatars, nicknames, regional tags, real -time gift rewards, barrage data).", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect some of your information (such as avatars, nicknames, regional labels, real -time gift rewards, barrage data)"}
{"task": "rw_129.jsonl", "id": 77598, "text": "If you do not agree with it to collect this information, do not install or use a small program.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you do not agree with it to collect this information, do not install or use a small program."}
{"task": "rw_129.jsonl", "id": 77599, "text": "(8) Customer service and appeal", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77600, "text": "When you initiate an appeal or consultation or consultation with our customer service or through the product interaction page, in order to facilitate contact with you and help you solve the problem, to ensure your account security, we may need you to provide you to provide itFor some information or information, you can decide whether to provide us by yourself. These information may include your account real -name information and account usage information. The collection of information is to ensure that your account number is not stolen or unauthorized.Consultation to ensure your account and property security.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the information and account use information of the account number to ensure your account and property security"}
{"task": "rw_129.jsonl", "id": 77601, "text": "(9) Other business functions", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77602, "text": "9.1 Research and promotion marketing", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77603, "text": "When you choose to participate in the relevant parties such as the related parties or third parties organized by the related parties or third parties, you may need to fill in the name, communication address, contact information, etc. in the relevant forms, etc.personal information.", "label": ["Important", "First Party Collection Information"], "rewrite": "You need to collect personal information such as names, communication addresses, contact information, etc."}
{"task": "rw_129.jsonl", "id": 77604, "text": "If you refuse to provide relevant information, it may affect your participation in related activities, but it will not affect your other functions.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If you refuse to provide relevant information, it may affect your participation in related activities, but it will not affect your other functions."}
{"task": "rw_129.jsonl", "id": 77605, "text": "Only after your consent can we and third parties collect and process relevant information to ensure that you provide you with the corresponding product and services.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77606, "text": "Specific personal information processing is subject to the content of the activity page.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77607, "text": "9.2 News notice", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77608, "text": "You know and agree that we may send you one or more types of notifications at the same time through the contact information (mobile phone number) provided by you in the process of using the product and/or serviceAuthentication, security verification, user research;", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77609, "text": "In addition, we may also provide you with commercial information such as services, functions or activities that you may be interested in in a SMS.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77610, "text": "But please rest assured that if you do not want to accept this information, you can unsubscribe the booking method provided in the mobile phone SMS, or you can contact us directly to the withdrawal.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77611, "text": "In addition, based on platform operation management needs, we may use some platform anchor contact information to communicate business operations with it.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77612, "text": "Through the system notification of your device, we will push you your subscription reminder, subscriber dynamics, reservation activities reminders, message center reminders, fleet convening reminders, etc.Huya Live APP [Settings]-[Message reminder settings] Select the information you want to receive.", "label": ["Important", "Edit/Control"], "rewrite": "Select the notification function of the Huya in the device, or via Huya Live APP [Settings]-[Message Reminder settings] Select the information you want to receive"}
{"task": "rw_129.jsonl", "id": 77613, "text": "9.3 Invitation interaction, sharing interaction, welfare gift package interaction", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77614, "text": "When you invite or receive invitation information, share or receive information shared, participate in welfare or gift package activities, in the scenario of using the invitation button, using the sharing button, starting the Huya Live APP, and clicking on the welfare or gift package, Huya Live Client ClientYou need to visit your shear plates locally to write and read the invitation code, sharing code, password, link of the corresponding invitation code, to achieve invitation, sharing, welfare or gift packages, jump to user activity pages, activities, activities, activities, activitiesLinks and other functions or services.", "label": ["Permission Acquisition", "Important"], "rewrite": "Apply to access the shear plate, which is used to write and read the invitation code, sharing code, password, link"}
{"task": "rw_129.jsonl", "id": 77615, "text": "We upload it our server only when the content of the shear plate belongs to the above function or service -related instructions.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77616, "text": "In addition, Huya Live Clients will not upload other information about your shearing board to our server.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77617, "text": "In addition, we may need to obtain storage/album permissions in order to share or receive videos and pictures shared.", "label": ["Permission Acquisition", "Important"], "rewrite": "You need to obtain storage/album permissions in order to share or receive videos and pictures that have been shared"}
{"task": "rw_129.jsonl", "id": 77618, "text": "9.4 Live Room Interactive", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77619, "text": "You understand and know that Huya live broadcast is not a private space.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77620, "text": "When you interact in Huya Live Room, your nickname, avatar, interactive information (including but not limited to barrage, reviews, gifts and other information) will be publicly displayed in the live broadcast room. At the same timeStatistics (such as lists, rankings, etc.) are displayed and displayed publicly.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Your nickname, avatar, interactive information (including but not limited to barrage, comments, gifts and other information) will be publicly displayed in the live broadcast room"}
{"task": "rw_129.jsonl", "id": 77621, "text": "9.5 \"Shake and Shake\" interaction", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77622, "text": "When you do \"shake and shake\", such as interaction or activity depend on action development, we will collect the use of your acceleration sensor information (separate sensor data does not belong to personal information) to identify your movements and use it for interactive participation or itShow you the next content or scene.", "label": ["Important", "First Party Collection Information"], "rewrite": "Will collect and use your acceleration sensor information (separate sensor data does not belong to personal information) to identify your movements"}
{"task": "rw_129.jsonl", "id": 77623, "text": "9.6 shot screen", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77624, "text": "When you use the screen function, in order to achieve the interconnection of the device and improve the quality and experience of the screen, we will collect your terminal equipment model, terminal equipment version name, terminal manufacturer, system language, network type, Android system version, Android, ID, BSSID, WIFI name and IP address.", "label": ["Important", "First Party Collection Information"], "rewrite": "Will collect your terminal device model, terminal equipment version name, terminal manufacturer, system language, network type, Android system version, Android ID, BSSID, WIFI name and IP address"}
{"task": "rw_129.jsonl", "id": 77625, "text": "9.7 System permissions instructions", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77626, "text": "(1) Business function based on camera/camera.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77627, "text": "You can use Huya's scanning QR codes, live video and shooting functions after turning on the camera/camera permissions, as well as face recognition such as the face recognition authorized by your authorized person in specific scenarios.", "label": ["Permission Acquisition", "Important"], "rewrite": "Can open the camera/camera permissions"}
{"task": "rw_129.jsonl", "id": 77628, "text": "When you use this business function to perform face recognition, we will collect your facial features, and strictly use it within the scope of your authorization. In the future, as we want to use your facial information, you will provide you with other products and/or service functions.Yes, we will confirm with you again.", "label": ["Permission Acquisition", "Important"], "rewrite": "Collect your facial features and use it strictly within the scope of your authorization consent"}
{"task": "rw_129.jsonl", "id": 77629, "text": "When you use the launch component of Huya live broadcast through the iOS system, we may use the calculation results of the depth related information of the face image in ARKIT and TRUEDEPTH, API, for beauty, special effects filters, stickers, virtual images and other functions to use it to use the functions of the useTo achieve better face treatment effect;", "label": ["Important", "Usage"], "rewrite": "The calculation results of the deep related information in the face image in Arkit and TrueDepth API will be used to achieve better face processing effect"}
{"task": "rw_129.jsonl", "id": 77630, "text": "During this period, we will neither use these operation results for other purposes, nor upload or store to the server.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77631, "text": "(2) Picture/video access and uploaded additional services based on album (picture library/video library).", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77632, "text": "You can upload your photos/pictures/videos after opening permissions to achieve functions such as replacing avatars, release dynamics, uploading downloads.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77633, "text": "(3) Based on the additional services of microphone voice technology.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77634, "text": "When you use the voice -to -text function to send barrage comments, open live, and use voice dating functions, we will ask you to authorize Macing's rights and collect your voice content.", "label": ["Permission Acquisition", "Important"], "rewrite": "You will ask you to authorize Macing's rights and collect your voice content."}
{"task": "rw_129.jsonl", "id": 77635, "text": "(4) Expanded business functions based on calendar.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77636, "text": "When you use Huya Live events or live broadcast reservation functions and sign -in tasks, we will ask you to authorize the permissions of reading/writing to your calendar so that we can record and notify you the start time.", "label": ["Permission Acquisition", "Important"], "rewrite": "Ask you to authorize to read/write the permissions of your calendar so that we can record and notify you the start time of the event"}
{"task": "rw_129.jsonl", "id": 77637, "text": "We will not access and change the content that has nothing to do with Huya live broadcast in your calendar.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77638, "text": "(5) In addition, in the process of providing products or services, we may also need to apply for other equipment permissions. You can click here to view and understand the permissions of Huya Live Application.", "label": ["Permission Acquisition", "Important"], "rewrite": "You may need to apply for other equipment permissions, you can click here to view and learn about the permissions of Huya live broadcast applications"}
{"task": "rw_129.jsonl", "id": 77639, "text": "These permissions will not be opened by default. Only after your explicit authorization will be used when you implement specific functions or services. You can use Huya Live APP [Settings]-[Privacy Settings]-[Application Restrictions and Management], Management, Management] Management, Management, Management] ManagementYour authorization of related permissions.", "label": ["Important", "Edit/Control"], "rewrite": "You can authorize the authorization of relevant permissions through Huya Live APP [Settings]-[Privacy Settings]-[Application Restrictions and Management]"}
{"task": "rw_129.jsonl", "id": 77640, "text": "In particular, it is necessary to point out that even after your authorization, we have obtained these sensitive permissions, and we will not collect your information when related functions or services are not needed.", "label": ["Important", "First Party Collection Information", "Edit/Control"], "rewrite": "Even after authorization, these sensitive permissions are obtained, and your information will not be collected at the sometimes in related functions or services."}
{"task": "rw_129.jsonl", "id": 77641, "text": "(10) Information from third parties", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77642, "text": "When you choose to use the \"One -click Login\" function of the mobile phone, we will obtain the mobile phone number of your device from the communication operator as your registered login account and exempt from the password or dynamic verification code to verify it so that you can provide you with quickness.Register login service.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the mobile phone number of the device as your registered login account and avoid password or dynamic verification code verification"}
{"task": "rw_129.jsonl", "id": 77643, "text": "If you don't want to use the one -click login function, you can register and log in to Huya live broadcast in other ways.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77644, "text": "If you authorize the Huya account with related game accounts in the Huya Live Room or Huya cooperation game, we may get your game account, nickname, avatar, openid, and game log information. The above information will be used to recommend you moreInterested game live broadcast content, or help you complete welfare of game props.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the game account, nickname, avatar, openid, and game log information, for personalized recommendation"}
{"task": "rw_129.jsonl", "id": 77645, "text": "The specific personal information processing situation is subject to the content of the event page announcement.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77646, "text": "(11) Other legality causes", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77647, "text": "According to the provisions of laws and regulations, in the following situations, we may collect and use your personal information without asking your authorization consent:", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "In the following situation, we may collect and use your personal information without asking your authorization consent:"}
{"task": "rw_129.jsonl", "id": 77648, "text": "(1) It is necessary for the contract to establish and fulfill the person as a party as one party;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting and fulfilling the personal information necessary for the contract as a party as one party, no need to agree"}
{"task": "rw_129.jsonl", "id": 77649, "text": "(2) In order to fulfill the legal duties or legal obligations or legal obligations directly related to direct relevant responsibilities or legal obligations such as national security, national security, criminal investigation, prosecution, trial, and judgment implementation);", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting the personal information of the statutory duties or the required volunteers, no need to agree"}
{"task": "rw_129.jsonl", "id": 77650, "text": "(3) In order to deal with emergencies, or in urgent situations to protect the health and property safety of natural people;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect the personal information necessary for protecting the health and property security of natural persons in response to emergencies, or in urgent situations. There is no need to agree"}
{"task": "rw_129.jsonl", "id": 77651, "text": "(4) Implement news reports and public opinion supervision for public interests, and handle personal information within a reasonable range;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Implement news reports and supervision of public opinion for public interests, handle personal information within a reasonable range, and no need to agree"}
{"task": "rw_129.jsonl", "id": 77652, "text": "(5) Treatment your own personal information within a reasonable scope in accordance with the law, or other legal information (such as legal news reports, government information disclosure and other channels such as legal public information);", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Treatment your own personal information within a reasonable range, or other personal information that has been legal and disclosed, no need to agree"}
{"task": "rw_129.jsonl", "id": 77653, "text": "(6) Other circumstances stipulated in laws and regulations.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect information under other circumstances stipulated in laws and regulations, no need to agree"}
{"task": "rw_129.jsonl", "id": 77654, "text": "2. How do we use cookies equivalent technology", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77655, "text": "Similar technologies such as Cookie and Equipment Information Makes are commonly used in the Internet.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77656, "text": "When you use Huya and related services, we may use related technologies to send one or more cookie or anonymous identifiers to your device to collect and identify the information when you access and use this product.", "label": ["Important", "First Party Collection Information"], "rewrite": "Send one or more cookies or anonymous identifiers to your device to collect and identify the information when you access and use this product"}
{"task": "rw_129.jsonl", "id": 77657, "text": "We promise that cookies will not be used for any other purposes other than the purpose of this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77658, "text": "We use cookies and similar technologies to achieve the following functions or services:", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77659, "text": "1. Ensure the safety and efficient operation of products and services", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77660, "text": "We may set up Cookie or anonymous identifiers that guarantee security and ensure security, so that we can confirm whether you log in to the service safely, or whether you encounter stolen, fraud and other illegal acts.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77661, "text": "These technologies also help us improve service efficiency, improve login and response speed.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77662, "text": "2. Help you get a easier access experience", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77663, "text": "Using this kind of technology can help you save the steps and processes of your filling in information and enter search content.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77664, "text": "3. Recommend the live broadcast content that you may be interested in", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77665, "text": "We may use such technologies to learn about your preferences and use habits of tiger teeth services, and carry out data analysis to recommend the live broadcast content you may be interested in.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "You will use this technique to understand your preferences and habits of use, analyze data, and recommend live broadcast content that may be interested in"}
{"task": "rw_129.jsonl", "id": 77666, "text": "4. Cooking of cookies", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77667, "text": "Most browsers provide users with the function of removing browser cache data. You can perform the corresponding data clearance operation in the browser settings function;", "label": ["Important", "Edit/Control"], "rewrite": "The corresponding data clearance operation can be performed in the browser settings function"}
{"task": "rw_129.jsonl", "id": 77668, "text": "You can also manage and clear all Cookie (path: Log in the Huya Live APP (Path: Log in to \"Mine\" → (set button) → clear cache).", "label": ["Important", "Edit/Control"], "rewrite": "You can manage and clear all the cookies (path: log in to the Huya Live APP (Path: My \"→ (set the button) → clear the cache) → clear the cache)"}
{"task": "rw_129.jsonl", "id": 77669, "text": "If you are cleared, you may not be able to use personalized recommendation services and other corresponding functions that we depend on Cookie.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "If it is cleared, it may not be unable to use the personalized recommendation service and other corresponding functions that we depend on Cookie."}
{"task": "rw_129.jsonl", "id": 77670, "text": "3. How can we share, transfer, and publicly disclose personal information", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77671, "text": "(1) Sharing", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77672, "text": "In order to provide you with more complete and high -quality products and services, we may share some of your personal information with third -party partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "May share some of your personal information with third -party partners."}
{"task": "rw_129.jsonl", "id": 77673, "text": "We strictly follow the principles of legitimate legitimacy, minimum need, and ensuring security principles to share your personal information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Follow your personal information to follow the principles of legal and legitimacy, minimum necessaryness, and ensuring safety."}
{"task": "rw_129.jsonl", "id": 77674, "text": "For the partners of sharing information, we will set up a special data protection agreement with them to process personal information in accordance with our instructions, privacy policies, and any other related confidentiality and security measures.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "For the partner of shared information, we will set up a special data protection agreement with them to request them to handle personal information in accordance with security measures"}
{"task": "rw_129.jsonl", "id": 77675, "text": "You can use Huya Live APP [Settings]-[third-party data sharing list] to consult how we share your personal information with third parties.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Viaoar Live APP [Settings]-[Third-party Data Sharing List] Check how to share your personal information with a third party"}
{"task": "rw_129.jsonl", "id": 77676, "text": "Usually we share personal information in the following scene:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "I will share personal information in the following scene"}
{"task": "rw_129.jsonl", "id": 77677, "text": "1. Sharing with third -party SDK: In order to ensure the realization of the function or service of Huya Live APP, we have access to third -party SDK services.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Access to a third -party SDK service"}
{"task": "rw_129.jsonl", "id": 77678, "text": "If you use such services provided by third parties on our platform, you agree that it will collect and process your information (such as embedded code, plug -in, etc.).", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "If you use the service provided by a third party, it will agree to collect and process your information by it (such as embedded code, plug -in, etc.)"}
{"task": "rw_129.jsonl", "id": 77679, "text": "The aforementioned service providers collect and handle personal information such as personal information to comply with their own privacy policies, not applicable to this policy.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77680, "text": "In order to ensure your information security to the greatest extent, we strongly recommend that you check your privacy policy before using any third -party SDK service.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77681, "text": "In order to protect your legitimate rights and interests, if you find that such SDKs or other similar applications are risky, it is recommended that you immediately terminate the relevant operations and contact us in a timely manner.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77682, "text": "You can view the third -party SDK directory connected by Huya Live, check and understand the process of processing your personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You can view the third -party SDK directory connected by Huya Live to see and understand the process of processing your personal information."}
{"task": "rw_129.jsonl", "id": 77683, "text": "2. Shared with affiliated companies: In order to facilitate us to provide you with consistent products and services based on the account of Huya or related companies, among the multiple products of Huya or Huya related companies (such as Huya Live, Huya Hi Play Edition, Huya Assistant Assistant, Huya Mobile Games, Little Deer E -sports, YOWA Cloud Games, etc.) It is convenient for you to register and log in with a unified account, recommend the content and information you may be interested in, protect the account and property of Huya or Huya associated company, your account numberInformation, real -name authentication information, equipment and log information may be shared with our affiliated companies.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Your account information, real -name authentication information, equipment and log information may be shared with our affiliated companies"}
{"task": "rw_129.jsonl", "id": 77684, "text": "We will only share the necessary personal information and be restricted by the purpose declared in this privacy policy. If we change the purpose of personal information use and processing, we will solicit your authorization consent again.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Only share the necessary personal information. If the purpose of the personal information is changed, the authorization consent will be solicited again"}
{"task": "rw_129.jsonl", "id": 77685, "text": "3. Shared with authorized partners:", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77686, "text": "(1) Basic service providers: Including partners with real -name authentication, payment, one -click login, message push, geographical location positioning, and anti -fraud. The information sharing of these service providers is mostly performed through the SDK method. For detailsPart of the part.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share with basic service providers through SDK methods"}
{"task": "rw_129.jsonl", "id": 77687, "text": "(2) Partners who entrust us to promote information promotion and advertising: You authorize us to have the right to share with the partners who entrust us to make information promotion and advertising.Analysis/statistical information after portrait information, device information, de -identification or anonymous processing to help them make advertising or decision -making suggestions without identifying your personal identity, increase the effective touch rate of advertising, measure advertising and related servicesEffectiveness.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Share relevant information with partners who entrust us to make information promotion and advertising, form a portrait portrait of indirect user"}
{"task": "rw_129.jsonl", "id": 77688, "text": "(3) Partners who provide data services (including online advertising monitoring, data statistics, and data analysis): In order to maintain/improve our products/services and provide you with better content, we may cooperate with the designated design of the servicePartners share your relevant information (including: equipment information, advertising display and click records, terminal models, geographical location), unless you get your consent, we will not share your personal identity information with them.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share your relevant information with the designated partners who provide the service"}
{"task": "rw_129.jsonl", "id": 77689, "text": "(4) Partners who provide e -commerce services: In order to help users realize purchasing and commodity delivery services, we may share your nicknames, avatars and other account information, order information, and receiving information (including the e -commerce partner or service providerThe consignee's name, address, contact phone call information).", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share account information, order information, and receipt information with e -commerce partners or service providers (including the name of the consignee, address, contact phone call information)"}
{"task": "rw_129.jsonl", "id": 77690, "text": "Related receiving information may also be shared with logistics service providers in order to complete the necessary commodity distribution services. We will do our best to ensure data security.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Related receipts information shared with logistics service providers in order to complete the necessary commodity distribution services"}
{"task": "rw_129.jsonl", "id": 77691, "text": "(5) Content safety monitoring service provider: We may cooperate with specific content security monitoring service providers to label and analyze illegal voice video, and may share live streaming information with these service providers.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share live stream information with content security monitoring service provider"}
{"task": "rw_129.jsonl", "id": 77692, "text": "(6) Partners who provide broadcasting or live push -flow services: When we cooperate with a third -party platform that provides broadcasting or live push services, we may share live broadcasts of user nicknames, barrage, reviews, rankings, gift information and other live broadcast informationPublic user data.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share user data that has been disclosed with the third -party platform that provides broadcasting or live push services"}
{"task": "rw_129.jsonl", "id": 77693, "text": "(7) Partners who provide content promotion services: When we cooperate with the game provider, we may share account information, device information and game order information of user nicknames, avatars, etc. to help users achieve game account binding, game props, game props, game propsReceive functions (only when the user actively chooses to participate in the event), you can also check the specific game partners' privacy policy to understand the collection and handling personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share user nickname, avatar and other account information, equipment information and game order information"}
{"task": "rw_129.jsonl", "id": 77694, "text": "(2) Transfer", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77695, "text": "We will not transfer your personal information to any company, organization and individual, except the following situations: except:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You will not transfer your personal information to any company, organization and individual, except the following situations: except:"}
{"task": "rw_129.jsonl", "id": 77696, "text": "1. You make your own request;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "1. If you make a request yourself, you will transfer personal information"}
{"task": "rw_129.jsonl", "id": 77697, "text": "2. Get your clear authorization consent in advance:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "2. You have obtained your clear authorization consent in advance, and you will transfer personal information"}
{"task": "rw_129.jsonl", "id": 77698, "text": "3. In the case of merging, acquisition or bankruptcy liquidation in Huya Company, or other cases involving mergers, acquisitions or bankruptcy liquidation, if you involve personal information transfer, we will ask new companies and organizations that hold your personal information to continue to be subject to this book.The policy constraints, otherwise we will ask the company, organization, and individuals to re -authorize your authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "3. Consolidation, acquisition or bankruptcy and liquidation. If it involves the transfer of personal information, the main body of your personal information will be required to be subject to this policy. Otherwise"}
{"task": "rw_129.jsonl", "id": 77699, "text": "(3) Public disclosure", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77700, "text": "Except for public disclosure or obtaining an accident in accordance with the provisions of laws and regulations, we will not disclose public information that you have not disclosed or unreasonably disclosed.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Except for laws and regulations or obtaining a separate consent, it will not disclose unreasonable personal information."}
{"task": "rw_129.jsonl", "id": 77701, "text": "We may disclose the necessary information such as the announcement of illegal punishment announcements, publicity of the information of the prize, and other scenarios. At the same time, we will carefully evaluate the legitimacy, legitimacy, and rationality of the public disclosure, and adopt safety protection measures such as desensitization and dehuminarization measures to protect the protection measures protection measures protection measures protection measures protection measureUser personal information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "It will disclose the necessary information such as the announcement of illegal punishment announcements and the publication information of the prize."}
{"task": "rw_129.jsonl", "id": 77702, "text": "(4) Other legality causes", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77703, "text": "According to the provisions of laws and regulations, in the following situations, we may share, transfer, and publicly disclose your personal information without soliciting your authorization consent:", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "In the following circumstances, sharing, transfer, and publicly disclose your personal information without asking your authorization consent:"}
{"task": "rw_129.jsonl", "id": 77704, "text": "1) It is necessary for the contract to establish and fulfill the person as a party as a party;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "The personal information of sharing as a contract for the contract as a party as a party is shared and fulfilled."}
{"task": "rw_129.jsonl", "id": 77705, "text": "2) To fulfill the statutory responsibilities or legal obligations of direct relevant responsibilities or legal obligations such as national security, defense security, criminal investigation, prosecution, trial, and judgment implementation);", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "2) Sharing is the personal information that fulfills the statutory duties or the required person necessary for the legal obligation, no need to agree"}
{"task": "rw_129.jsonl", "id": 77706, "text": "3) In order to deal with emergencies, or in urgent situations to protect the health and property safety of natural people;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "3) Sharing is the personal information necessary for protecting the lives and health of natural persons in response to public health incidents, or in emergency situations."}
{"task": "rw_129.jsonl", "id": 77707, "text": "4) In order to implement news reports and public opinion supervision, handle personal information within a reasonable scope;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "4) In order to implement news reports, public opinion supervision and other behaviors, handle personal information within a reasonable scope, no need to agree"}
{"task": "rw_129.jsonl", "id": 77708, "text": "5) Treatment your own personal information within a reasonable scope in accordance with the law, or other legal information (such as legal news reports, government information disclosure and other channels such as legal information);", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "5) Treatment of personal information that has been legal and disclosed within a reasonable scope in accordance with the law, no need to agree"}
{"task": "rw_129.jsonl", "id": 77709, "text": "6), other circumstances stipulated in laws and regulations.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "6) Sharing personal information under other circumstances stipulated in laws and regulations, no need to agree"}
{"task": "rw_129.jsonl", "id": 77710, "text": "4. How do we store personal information", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77711, "text": "The personal information collected and generated in the operation of the People's Republic of China is stored in China without transmission of cross -border transmission of your personal information.", "label": ["Data Retention", "Important"], "rewrite": "The personal information we collected and generated in the operation of the People's Republic of China is stored in China without transmission of cross -border."}
{"task": "rw_129.jsonl", "id": 77712, "text": "We only store your personal information during the necessary and shortest period of product or service purposes.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "Only the necessary and shortest period of time for providing products or service purposes to store your personal information"}
{"task": "rw_129.jsonl", "id": 77713, "text": "After the deadline, we will delete or processes personal information, except for other regulations.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "After exceeding the deadline, delete or treat personal information"}
{"task": "rw_129.jsonl", "id": 77714, "text": "For example:", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77715, "text": "1. Article 21 of the \"Cyber Security Law of the People's Republic of China\", paragraph 3, requires monitoring, recording network operation status, and technical measures for network security incidents.", "label": ["Data Retention", "Important"], "rewrite": "The network logs of monitoring, recording network operation status, and technical measures for network security incidents must not be reserved in less than six months"}
{"task": "rw_129.jsonl", "id": 77716, "text": "2. The \"Internet Live Service Management Regulations\" requires recording the content and log information of the Internet live broadcast service users to store it for 60 days;", "label": ["Data Retention", "Important"], "rewrite": "Record the content and log information of the Internet live service users, save 60 days"}
{"task": "rw_129.jsonl", "id": 77717, "text": "3. The \"E -commerce Law\" stipulates that the saving time of goods and service information and transaction information is not less than three years from the date of completion of the transaction;", "label": ["Data Retention", "Important"], "rewrite": "The \"E -commerce Law\" stipulates that the saving time of goods and service information and transaction information is not less than three years from the date of the transaction completion"}
{"task": "rw_129.jsonl", "id": 77718, "text": "4. In order to abide by the court's judgment, ruling or other legal procedures;", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77719, "text": "5. In order to safeguard the public interests of social public interests, protect the legitimate rights and interests of the company, related companies, other natural persons, and other natural persons.", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77720, "text": "5. How do we protect the security of personal information", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77721, "text": "In order to ensure your information security, we strive to take various security measures that meet industry standards, reasonable physical, electronics and management to protect your information, so that your information will not be leaked, damaged or lostDeploy hosting invasion detection systems, important sensitive information encryption storage, access control of data centers, and log record security audits.", "label": ["Important", "Data Security"], "rewrite": "Efforts to take various security measures that meet industry standards to protect your information, including but not limited to deploying hosting invasion detection systems, important sensitive information encryption storage, access control of data centers, logging security audit"}
{"task": "rw_129.jsonl", "id": 77722, "text": "We have also adopted strict management of employees or outsourcing personnel who may contact you, including but not limited to adopting different permissions control according to different jobs, signing confidentiality agreements with them, monitoring their operations.", "label": ["Important", "Data Security"], "rewrite": "Strict management has also been adopted to employees or outsourcing staff who may be exposed to information"}
{"task": "rw_129.jsonl", "id": 77723, "text": "We will provide corresponding security measures in accordance with existing technologies to protect your information and provide reasonable security guarantee. We will try our best to make your information from being leaked, damaged or lost.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77724, "text": "Your account has a security protection function, please keep your account and password information properly.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77725, "text": "We will ensure that your information is not lost and will not be abused and altered by backup security measures such as backup of other servers and encrypted user passwords.", "label": ["Important", "Data Security"], "rewrite": "Safety measures such as backup of other servers and encryption of user passwords ensure that your information is not lost, and it will not be abused and altered."}
{"task": "rw_129.jsonl", "id": 77726, "text": "Although there are aforementioned security measures, please also understand that there are no \"perfect security measures\" on the information network.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77727, "text": "If you find your personal information leakage, especially your account and password leak, please contact our customer service immediately so that we can take corresponding measures.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77728, "text": "6. Manage your personal information", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77729, "text": "Huya Live attaches great importance to the personal information rights and interests of users, and strives to ensure the legal rights you enjoyed for your personal information so that you have full ability to ensure your information security.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77730, "text": "Your rights include:", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77731, "text": "(1) Query, correct and delete personal information", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77732, "text": "You can query, correct or delete your information through the following ways:", "label": ["Important", "Edit/Control"], "rewrite": "You can query, correct or delete your information through the following ways:"}
{"task": "rw_129.jsonl", "id": 77733, "text": "1. Log in to the Huya Live APP, enter \"My\" → \"My Nickname\" → \"Edit Information\" to query, correct or delete the avatar, nickname, gender, birthday, region, signature and other personal information;", "label": ["Important", "Edit/Control"], "rewrite": "Enter \"My\" → \"My Nickname\" → \"Edit Information\" to query, correct or delete personal information"}
{"task": "rw_129.jsonl", "id": 77734, "text": "2. Log in to Huya Live APP, enter \"My\" → \"Settings\" → \"Account and Security\", check the Huya, mobile phone number, binding third -party account number, password, related account number and other information, and modify or lift the binding bindingSome of these information.", "label": ["Important", "Edit/Control"], "rewrite": "Enter \"My\" → \"Settings\" → \"Account and Security\", query information such as Huya, mobile phone number, binding third -party account, password, associated account number and other information, and modify or relieve certain information bound to it"}
{"task": "rw_129.jsonl", "id": 77735, "text": "3. Log in to Huya Live APP, enter \"My\" → \"Settings\" → \"Illegal Inquiry\" to query the status and violations of the account;", "label": ["Important", "Edit/Control"], "rewrite": "Log in to Huya Live APP, enter \"My\" → \"Settings\" → \"Illegal Inquiry\" to query the status and violation of the rules"}
{"task": "rw_129.jsonl", "id": 77736, "text": "4. Log in to Huya Live APP, enter \"My\" → \"Search Box\", query and delete historical search records.", "label": ["Important", "Edit/Control"], "rewrite": "Log in to Huya Live APP, enter \"My\" → \"Search Box\", query and delete historical search records"}
{"task": "rw_129.jsonl", "id": 77737, "text": "5. Log in to Huya Live APP, enter \"My\" → \"I have seen it\", query and delete browse records.", "label": ["Important", "Edit/Control"], "rewrite": "Log in to Huya Live APP, enter \"My\" → \"I have seen it\", query and delete browse records"}
{"task": "rw_129.jsonl", "id": 77738, "text": "6. Log in to Huya Live APP, enter \"My\" → \"My Wallet\", and check the golden beans, silver bean, golden bean coupons, Huya coins, revenue and expenditure details, my prizes, vouchers, redemption codes and automatic renewal management.", "label": ["Important", "Edit/Control"], "rewrite": "Log in to Huya Live APP, enter \"My\" → \"My Wallet\", check personal information"}
{"task": "rw_129.jsonl", "id": 77739, "text": "7. Log in to the Huya Live APP, enter \"My\" → \"Parcket Order\", and query related orders and order;", "label": ["Important", "Edit/Control"], "rewrite": "Log in to Huya Live APP, enter \"My\" → \"Traffic Order\", query related orders and order conditions"}
{"task": "rw_129.jsonl", "id": 77740, "text": "8. Log in to Huya Live APP, enter \"My\" → \"Shopping Order\", check all your shopping orders, pay orders, order orders, order orders and coupons;", "label": ["Important", "Edit/Control"], "rewrite": "Log in to Huya Live APP, enter \"My\" → \"Shopping Order\", and check your order information"}
{"task": "rw_129.jsonl", "id": 77741, "text": "9. Log in to Huya Live APP and enter \"My\" → \"My Subscribe\" to query, modify and cancel the focus of the subscription anchor.", "label": ["Important", "Edit/Control"], "rewrite": "Log in to Huya Live APP, enter \"My\" → \"My subscription\", query, modify and cancel the attention subscription anchor"}
{"task": "rw_129.jsonl", "id": 77742, "text": "10. Log in to the Huya Live APP, enter \"My\" → \"My identity\", check the fan badge, my guardians, Huya nobles, great god sparring, my mount, my image and other information.", "label": ["Important", "Edit/Control"], "rewrite": "Log in to Huya Live APP, enter \"My\" → \"My identity\", query fan badge, my guardian, Huya nobles, great god sparring, my mount, my image and other information"}
{"task": "rw_129.jsonl", "id": 77743, "text": "11. Log in to Huya Live APP and enter \"My\" → \"My Package\", query card packages, gifts, game props, coupons and sparring coupons.", "label": ["Important", "Edit/Control"], "rewrite": "Log in to Huya Live APP, enter \"My\" → \"My Package\", query card bags, gifts, game props, coupons and sparring coupons"}
{"task": "rw_129.jsonl", "id": 77744, "text": "12. Other information: If you encounter difficulties in the process of exercising the above rights, or other people who may not be able to provide you with your own inquiry/correction/delete service, you can contact us in the way provided by this privacy policy.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77745, "text": "When you find that we violate the provisions of laws and administrative regulations or the agreed storage of both parties to process your personal information, you can ask us to delete it.", "label": ["Important", "Edit/Control"], "rewrite": "When you find that we violate the provisions of laws and administrative regulations or storage to store personal information, we can ask us to delete"}
{"task": "rw_129.jsonl", "id": 77746, "text": "If you find that our personal information we collect and store is wrong, you can also ask us to correct or add.", "label": ["Important", "Edit/Control"], "rewrite": "If you find that the personal information we collect and store is wrong, we can also ask us to correct or add"}
{"task": "rw_129.jsonl", "id": 77747, "text": "(2) The scope of control information disclosure", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77748, "text": "You can enter \"My\" → \"Settings\" → \"Privacy Settings\" → \"Personal Homepage Display Settings\" by logging in to Huya Live APP.See the anchor, my dynamics, and my Huya.", "label": ["Important", "Edit/Control"], "rewrite": "You can enter \"My\" → \"Settings\" → \"Privacy Settings\" → \"Personal Homepage Display Settings\" by logging in to Huya Live APP."}
{"task": "rw_129.jsonl", "id": 77749, "text": "(3) Withdrawal authorization", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77750, "text": "As mentioned earlier, some functions provided by Huya Live need to obtain relevant permissions for your equipment (including: storage, location, camera, microphone and other system permissions. For details, see the first part of this policy).", "label": ["Permission Acquisition", "Important"], "rewrite": "Some functions of Huya Live need to obtain the relevant permissions of the equipment (including: storage, location, camera, microphone and other system permissions. For details, please refer to the first part of this policy)"}
{"task": "rw_129.jsonl", "id": 77751, "text": "After you update the APP version, without your clear consent, we will not change the authority you set before.", "label": ["Important", "Edit/Control"], "rewrite": "After you update the APP version, without your clear consent, we will not change the authority you set before."}
{"task": "rw_129.jsonl", "id": 77752, "text": "You can manage or withdraw your authorization of related permissions through Huya Live APP [Settings]-[Privacy Settings]-[Application Restrictions and Management]-[Application Restrictions and Management].", "label": ["Edit/Control", "Important"], "rewrite": "You can use Huya Live APP [Settings]-[Privacy Settings]-[Application rights explanation and management], management or withdrawal of your authorization of related authority"}
{"task": "rw_129.jsonl", "id": 77753, "text": "In addition, you can also use Huya Live APP [Settings]-[Privacy Settings]-[Personalized Recommendation Settings] to withdraw your authorization of personalized recommendations;", "label": ["Important", "Edit/Control"], "rewrite": "You can also use Huya Live APP [Settings]-[Privacy Settings]-[Personalized Recommendation Settings] to withdraw authorization of personalized recommendations"}
{"task": "rw_129.jsonl", "id": 77754, "text": "Or through [Settings]-[Privacy Settings]-[Advertising Personalized Management], withdraw your authorization of personalized advertisements, management shows advertisements based on your information or generate advertising identifiers according to your information.", "label": ["Important", "Edit/Control"], "rewrite": "Through [Settings]-[Privacy Settings]-[Advertising Personalized Management], withdraw your authorization of personalized advertising"}
{"task": "rw_129.jsonl", "id": 77755, "text": "You can also retreat us to continue to handle your personal information by canceling the account.", "label": ["Important", "Edit/Control"], "rewrite": "By canceling the account of the account, we can permanently withdraw from us to continue to handle your personal information."}
{"task": "rw_129.jsonl", "id": 77756, "text": "If you encounter difficulties in the process of exercising the above rights, or other those who may not be able to withdraw from your own withdrawal, you can contact us as provided by this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77757, "text": "Please know that when you withdraw authorization, we cannot continue to provide you with specific functions and/or services corresponding to the withdrawal authorization.", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "When you withdraw authorization, we cannot continue to provide you with specific functions and/or services corresponding to the withdrawal authorization"}
{"task": "rw_129.jsonl", "id": 77758, "text": "But your decision to withdraw authorization will not affect personal information processing based on your authorization.", "label": ["Permission Acquisition", "Edit/Control", "Risk", "Important"], "rewrite": "But your decision to withdraw authorization will not affect personal information processing based on your authorization."}
{"task": "rw_129.jsonl", "id": 77759, "text": "(4) Copy and transfer personal information", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77760, "text": "You can get your personal information copy through Huya Live APP [Settings]-[Privacy Settings]-[Personal Information Download], or send emails to dataprivacy@huya.com to contact us and explain your requirements.", "label": ["Important", "Contact Information", "Edit/Control"], "rewrite": "You can get your personal information copy through Huya Live APP [Settings]-[Privacy Settings]-[Personal Information Download] You can also send emails to dataprivacy@huya.com to contact us and explain your requirements"}
{"task": "rw_129.jsonl", "id": 77761, "text": "If you need to transfer our personal information, we will assist you to transfer according to the requirements of relevant laws and regulations.", "label": ["Important", "Edit/Control"], "rewrite": "If we need to transfer our personal information, we will assist in transfer according to the requirements of relevant laws and regulations."}
{"task": "rw_129.jsonl", "id": 77762, "text": "(5) Logging out the account", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77763, "text": "You can cancel your account in the following ways:", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77764, "text": "1. Log in to Huya Live APP and enter \"My\" → \"Settings\" → \"Account and Security\" → \"Logging out the account\";", "label": ["Important", "Edit/Control"], "rewrite": "Log in to Huya Live APP, enter \"My\" → \"Settings\" → \"Account and Security\" → \"Logging out\";"}
{"task": "rw_129.jsonl", "id": 77765, "text": "2. Learn the conditions of the account through the guidelines of the online customer service and complete the account of the account;", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77766, "text": "3. According to the public contact information listed at the end of this policy, contact us to assist you to cancel the account.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77767, "text": "After you actively cancel your account, we will deal with it within 15 working days.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77768, "text": "After the account of the account is canceled, we will stop providing you all the products and services associated with the Huya account, delete your personal information according to the requirements of the applicable laws or perform anonymous processing, except for the laws and regulations.", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "After canceling the account, all products and services associated with the Huya account will be stopped, delete your personal information or perform anonymous processing, except for other regulations."}
{"task": "rw_129.jsonl", "id": 77769, "text": "Please note that after the account cancellation, all the contents of your published content (including the audio and video, graphic and text information provided) will be converted to anonymous release. If you need to delete the content, please handle it yourself before applying for cancellation.", "label": ["Important", "Edit/Control"], "rewrite": "After the account is canceled, all the content you posted (including the audio and video, graphic and text information provided) will be converted to anonymous publishing. If you need to delete the content, please handle it yourself before applying for cancellation"}
{"task": "rw_129.jsonl", "id": 77770, "text": "(6) Visit and request the explanation of privacy policies", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77771, "text": "When you first open, register, and log in to the Huya Live APP, we will prompt you a privacy policy and make a decision on your choice.", "label": ["Policy Change", "Important"], "rewrite": "When you first open, register, and log in to the Huya Live APP, you will prompt you a privacy policy and make your own decision by your choice."}
{"task": "rw_129.jsonl", "id": 77772, "text": "In addition, you can check all the contents of this privacy policy at any time through \"setting\" → \"Privacy Settings\" → \"Privacy Agreement\" page.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77773, "text": "If you have any questions about our personal information processing rules, you can ask us to explain through contact information disclosed by this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77774, "text": "(7) I have the right to obtain a notice of stopping operations", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77775, "text": "If we stop operating products or services, we will stop collecting your personal information in time, and we will send you notice to stop operations in the form of announcement or delivery one by one, and delete or delete or operate related personal information after stopping the service or operation.Anonymous treatment, except for laws and regulations.", "label": ["Important", "Cessation of Operations"], "rewrite": "If you stop operating products or services, you will stop collecting personal information in a timely manner, and will send notifications to stop operations in the form of announcement or delivery one by one, and delete or processes relevant personal information. Except for other provisions of laws and regulations."}
{"task": "rw_129.jsonl", "id": 77776, "text": "(8) Other rights", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77777, "text": "Such as Huya users (only natural persons) died unfortunately, their close relatives can exercise the rights of inspection, replication, correction, deletion, etc. for their own legal and legitimate interests, but except for other arrangements for death users during their lifetimeEssence", "label": ["Specific Audiences", "Important"], "rewrite": "For example, Huya users (only natural persons) died unfortunately, and their close relatives can exercise the rights of personal information about the relevant personal information of the dead users to check, copy, correct, and delete the rights, except for other arrangements during their lifetime."}
{"task": "rw_129.jsonl", "id": 77778, "text": "Regarding the above rights, you can fill in the \"Huya Live Personal Information Protection Form\" and send an email to dataprivacy@huya.com to contact us and explain your requirements. We will conduct within 15 working days after receiving your contact.Identification and processing.", "label": ["Important", "Contact Information"], "rewrite": "Send mail to dataprivacy@huya.com and contact us and explain your requirements"}
{"task": "rw_129.jsonl", "id": 77779, "text": "7. Terms of minors", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77780, "text": "If you are a minor, we ask you to ask your parents or guardians to read the privacy policy carefully and use our service under the guidance of your parents or guardians.", "label": ["Specific Audiences", "Important"], "rewrite": "Minors use services under their guidance after their consent of their parents or guardians."}
{"task": "rw_129.jsonl", "id": 77781, "text": "For the case where parents or guardians agree to use our products or services to collect personal information of minors, we will only use, share, transfer, transfer, transfer, transfer, transfer, transfer, and transfer they are clearly agreed or protected by laws or guardians.Or disclose this information.", "label": ["Specific Audiences", "Important"], "rewrite": "We will only use, share, transfer or disclose this information will only be used if the laws and regulations are allowed, the parents or guardians clearly agree or protect the minors."}
{"task": "rw_129.jsonl", "id": 77782, "text": "If you think we may not hold information about minors, please contact us.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77783, "text": "If you are a guardian under the age of 14, you should read this policy carefully when you complete or help children complete the registration and use of products or services.\"Personal Information Protection Guide\" to decide whether children agree with the products or services we provide.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a guardian of children or children under the age of 14, you should read this policy carefully"}
{"task": "rw_129.jsonl", "id": 77784, "text": "In order to protect the personal information of children and minors, we have set up a specialized person in the protection of personal information protection for children. If you have relevant questions or rights requests for your personal information protection of your child, please pass the \"Tiger's Personal Information for Children in HuyaThe contact information disclosed in the Protection Guidelines \"contacted us.", "label": ["Specific Audiences", "Important"], "rewrite": "Established a full -time for children's personal information protection full -time institutions"}
{"task": "rw_129.jsonl", "id": 77785, "text": "We will deal with and reply to you within a reasonable time.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77786, "text": "8. Privacy policy update", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77787, "text": "1. In order to provide you with better services and with the development of Huya business, this privacy policy will be updated with it. These updates constitute a part of the privacy policy.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77788, "text": "But without your clear consent, we will not reduce the rights you should enjoy in accordance with the privacy policy.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77789, "text": "Before the updated privacy policy takes effect, we will be prompting or sending a push message to you or notifying you in other ways before the updated privacy policy. Please also visit Huya Live to understand the latest privacy policy in time.", "label": ["Policy Change", "Important"], "rewrite": "Before the updated privacy policy takes effect, it will be prompted by a significant position or send a push message to you or notify you in other ways"}
{"task": "rw_129.jsonl", "id": 77790, "text": "If such updates have caused the substantial reduction or major changes in your rights under this privacy policy, we will solicit your explicit consent again.", "label": ["Policy Change", "Important"], "rewrite": "If such updates have caused the substantial reduction or major changes in your rights under this privacy policy, we will solicit your consent again"}
{"task": "rw_129.jsonl", "id": 77791, "text": "You need to understand that only after you confirm and agree to the change of the change of the change, we will collect, use, process and store your personal information based on the change of privacy policy after the change;", "label": ["Policy Change", "Important"], "rewrite": "Only after you confirm and agree to the change of the \"Privacy Policy of Huya Live\", will we use the change of privacy policy collection, use, process and store your personal information"}
{"task": "rw_129.jsonl", "id": 77792, "text": "You have the right to refuse to agree to the privacy policy after the change, but please know that once you refuse to agree to the change of privacy policy, you may not be able to continue to use the relevant services and functions of Huya live broadcast, or to achieve what we intend to achieveService effect.", "label": ["Policy Change", "Important", "Risk"], "rewrite": "You have the right to refuse to agree to the privacy policy after the change, but once you refuse to agree to the privacy policy after the change, you may not be able to continue to use related services and functions in complete use, or to achieve the service effect."}
{"task": "rw_129.jsonl", "id": 77793, "text": "2. The major changes referred to in this privacy policy include, but not limited to:", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77794, "text": "(1) The processing purpose, processing method and processing of personal information are changed;", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77795, "text": "(2) We have undergone major changes in the aspects of ownership structure and organizational structure, such as changes in the owner caused by business adjustments, bankruptcy mergers and acquisitions, etc.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77796, "text": "(3) Major changes in your personal information rights and its exercise methods.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77797, "text": "3. You can check our latest privacy policy through the following ways: my → (set button) → \"About Huya Live\" → \"Privacy Policy\".", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77798, "text": "Nine, dispute resolution", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77799, "text": "This privacy policy applies to the laws of the People's Republic of China.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77800, "text": "Any controversy caused by our privacy policy and our handling of your personal information can first be solved friendly and negotiated;", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77801, "text": "If the negotiation is not possible, you agreed to seek a solution by the court with jurisdiction to the court with jurisdictions (Panyu District, Guangzhou City, Guangdong Province).", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77802, "text": "The title of this privacy policy is only for convenience and reading, and does not affect the meaning or explanation of any provisions of the text.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77803, "text": "Ten, how to contact us", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77804, "text": "If you have any complaints or questions about our privacy policy, contact us at any time.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77805, "text": "Company Name: Guangzhou Huya Information Technology Co., Ltd.", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77806, "text": "Registered address: No. 1301, Zexi Street, Zhongcun Street (Hanxi Commercial Center), Panyu District, Guangzhou", "label": ["Important", "Contact Information"], "rewrite": "Registered address: No. 1301, Zexi Street, Zhongcun Street (Hanxi Commercial Center), Panyu District, Guangzhou"}
{"task": "rw_129.jsonl", "id": 77807, "text": "online service", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77808, "text": "Contact email: dataprivacy@huya.com", "label": ["Important", "Contact Information"], "rewrite": "Contact email: dataprivacy@huya.com"}
{"task": "rw_129.jsonl", "id": 77809, "text": "Contact: Huya Legal Affairs Department", "label": [], "rewrite": []}
{"task": "rw_129.jsonl", "id": 77810, "text": "We will review the issues involved as soon as possible and reply within 15 working days after verifying your user identity.", "label": [], "rewrite": []}
