{"task": "rw_118.jsonl", "id": 74930, "text": "Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 74931, "text": "Update date: January 12, 2022", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_118.jsonl", "id": 74932, "text": "Effective date: January 12, 2022", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_118.jsonl", "id": 74933, "text": "Version update prompt:", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 74934, "text": "In order to better protect your rights and interests, we have recently updated the \"Duoyi Privacy Policy\".", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 74935, "text": "The content of this update mainly includes: the \"Personal Information Collection List\" and \"Third Party Sharing and SDK List\" are set up according to the regulatory requirements;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_118.jsonl", "id": 74936, "text": "Further classification and refine the collection of personal information;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_118.jsonl", "id": 74937, "text": "The sensitive personal information and the permissions we handle are marked with the oblique bodies to remind you to pay attention;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_118.jsonl", "id": 74938, "text": "The exception of the acquisition of personal information obtaining consent shall be updated according to the law;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_118.jsonl", "id": 74939, "text": "Refine personal information shared with partners;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_118.jsonl", "id": 74940, "text": "Refine your path to realize the right of personal information.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_118.jsonl", "id": 74941, "text": "Please read and fully understand the full text before using/continue to use the products and/or services of Duoyi Network, and use/continue to use after agreeing with all the content.", "label": ["Policy Change", "Important"], "rewrite": "After reading and fully understand the full text and agree with all the content, use/continue to use"}
{"task": "rw_118.jsonl", "id": 74942, "text": "preface", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 74943, "text": "Duoyi Network and its operating related units (hereinafter referred to as \"we\") clearly protect the personal information and privacy security of users (hereinafter collectively referred to as \"user\" or \"you\") we provided by us.", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 74944, "text": "When you use the products and services we provide, we will collect and use your relevant personal information.", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 74945, "text": "We hope to explain to you through the \"Duoyi Privacy Policy\" (hereinafter referred to as \"this policy\") to explain related matters such as collecting and using your relevant personal information to better protect your rights.", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 74946, "text": "Duoyi Network in this policy specifically refers to Guangzhou Duoyi Network Co., Ltd., the provider of Duoyi Games and its services, whose registered address is Room 301, Building 1, No. 90, Banhe Road, Luogang District, Guangzhou City.", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_118.jsonl", "id": 74947, "text": "This policy is applicable to the products and/or services provided by Duoyi Network (hereinafter referred to as \"product\", \"service\" or \"product and service\").", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 74948, "text": "If you are a minor under the age of 14, we will also help you and your guardian through the \"Duoyi Child Privacy Protection Policy\" to further understand the situation of our personal information we collect, store, use and share children's personal information, and you and you and you and youThe relevant rights of the guardian.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_118.jsonl", "id": 74949, "text": "Before using/continue to use the products and/or services provided by Duoyi Network, please be sure to read and thoroughly understand this policy, especially the black bold clauses (minors should read with their legal guardians), you shouldFocus on reading, start using it after confirming and consenting.", "label": ["Policy Change", "Important"], "rewrite": "After confirming and agreeing to fully understand and agree to the privacy policy"}
{"task": "rw_118.jsonl", "id": 74950, "text": "Please note that we will check and update our privacy policies from time to time, so related measures will change.", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 74951, "text": "We urge you to regularly patronize this page to ensure that you always understand the latest version of this policy.", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 74952, "text": "After reading this policy, if you have any objections or questions about this policy or matters related to this policy, you can contact us through the feedback channels listed in the \"How to Contact Us\" section of this policy, and we will answer you as soon as possible .", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 74953, "text": "This policy will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 74954, "text": "1. Our personal information collection and use rules", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 74955, "text": "2. How do we use cookies or similar technologies", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 74956, "text": "3. How can we share, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 74957, "text": "4. How do we protect your personal information", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 74958, "text": "5. How do we store your personal information", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 74959, "text": "6. Your rights", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 74960, "text": "7. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 74961, "text": "8. How to update this policy", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 74962, "text": "Nine, how to contact us", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 74963, "text": "10. Appendix", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 74964, "text": "1. Our personal information collection and use rules", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 74965, "text": "The Duoyi products and/or services we provide need to rely on some information to run.", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 74966, "text": "If you choose to use this service, you need to provide or allow us to collect relevant information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_118.jsonl", "id": 74967, "text": "In order to make you conveniently understand the main situation of our personal information collection and use, we have formulated the \"Personal Information Collection List\".", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_118.jsonl", "id": 74968, "text": "Click to view the \"Personal Information Collection List\".", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 74969, "text": "(1) We will collect your personal information through the following channels", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_118.jsonl", "id": 74970, "text": "1. The information you provide.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_118.jsonl", "id": 74971, "text": "For example:", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 74972, "text": "(1) When you register the account number of Duoyi Network or use the products or services provided by Duoyi Network, you provide information to us.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the information provided when you register your registered account or use the product or service"}
{"task": "rw_118.jsonl", "id": 74973, "text": "(2) The information you upload/published: When you use our virtual community sharing function, such as the League Alliance circle, the game good friend show, etc., the text, photos, reviews, likes and other information you upload will be stored in ourIn the server, storage is necessary for this function.", "label": ["Data Retention", "Important", "First Party Collection Information"], "rewrite": "Collect information when you use your virtual community sharing function and store on the server"}
{"task": "rw_118.jsonl", "id": 74974, "text": "We will store it in an encrypted manner, and you can also query, correct, and delete this information at any time.", "label": ["Data Retention", "Edit/Control", "Important"], "rewrite": "Store personal information in an encrypted manner, you can also inquire, correct, delete this information"}
{"task": "rw_118.jsonl", "id": 74975, "text": "2. Your information shared by a third party.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_118.jsonl", "id": 74976, "text": "That is, third parties provided shared information on your service.", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 74977, "text": "3. The information we get.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_118.jsonl", "id": 74978, "text": "When you use our products or services, we collect, aggregate, and record information, such as log information, location information, and device information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_118.jsonl", "id": 74979, "text": "(2) We will collect and use your personal information for the following goals", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 74980, "text": "1. Help you complete the registration and login", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 74981, "text": "(1) When you register and log in to Duoyi Network's account, you need to complete a series of registration or login procedures according to our guidance. In the process, you need to provide us with a mobile phone number or email. We will send a SMS verification code by sending a SMS verification codeOr email to verify whether the mobile phone number/mailbox account is valid.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When registering and logging in to Duoyi Network's account, collect the mobile phone number or email to verify whether the mobile phone number/mailbox account is valid"}
{"task": "rw_118.jsonl", "id": 74982, "text": "Only by providing true and accurate information above can you successfully register an account and use the core functions of TOEIC products;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_118.jsonl", "id": 74983, "text": "If you refuse to provide the information necessary for the above registration, it will cause you to be unable to register/log in, or be restricted by corresponding restrictions during the game.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide the information necessary for registration, it will cause it to be unable to register/log in, or be subject to corresponding restrictions during the game"}
{"task": "rw_118.jsonl", "id": 74984, "text": "(2) In order to meet the requirements of relevant laws, regulations, policies and relevant competent authorities, ensure the authenticity of user identities, realize risk control such as anti-fraud, and ensure system and service security, you need to perform real-name authentication.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "You need you to make real -name authentication to ensure the authenticity of your identity"}
{"task": "rw_118.jsonl", "id": 74985, "text": "We will collect your real -name identity information (including name and ID number) when you get your consent or proactively provided by you. The ID number is a sensitive personal information. Refusing to provide real -name identity information may cause you to be unable to log in to DuoyiThe game may be restricted in the process of using Duoyi games.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting your real -name identity information, refusal to provide provision will lead to being unable to log in to the game or use it to be limited"}
{"task": "rw_118.jsonl", "id": 74986, "text": "2. Provide basic functions of the game, maintain network and operation security", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 74987, "text": "(1) In order to identify the abnormal state of the account, understand the adaptability of the product, maintain the normal operation of the basic functions, and realize the investigation of the problem. When you download or use our client software, or access the mobile webpage to use our services, we will read it, we will read it, we will read it, we will read it, we will read it, we will read it.Take the information related to your mobile device, including device models, device recognition codes, operating systems, software versions, processes, software lists, unique device identifiers, resolution, telecommunications operator, equipment related information (such as IP IP (IPAddress, GPS position, MAC address, and WLAN access point, Bluetooth and base station sensor information that can provide relevant information).", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect the relevant information of your mobile device to identify the abnormal state of the account, understand product adaptability, maintain the normal operation of basic functions, and realize the investigation of the problem"}
{"task": "rw_118.jsonl", "id": 74988, "text": "(2) In order to enable you to view your game history records on the client, at the same time used for game operation statistical analysis, customer service complaint processing, and game security analysis. We will collect your game log information, such as logging in logs, items logs, games, gamesFor bureau information, purchase records, dating records, etc.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect game log information for viewing of game history, game operation statistical analysis, customer service complaint processing and game security analysis"}
{"task": "rw_118.jsonl", "id": 74989, "text": "After obtaining your consent, we may synchronize the aforementioned information to the subsequent version of the game or other Duoyi network services you are using.", "label": ["Important", "Usage"], "rewrite": "Synchronous game log information to subsequent version or other Duoyi network services"}
{"task": "rw_118.jsonl", "id": 74990, "text": "(3) In order to ensure account security, create a fair, healthy and safe game environment, we will collect information such as your game recognition information, hardware and operating system information, application lists, processes, and game collapse records to combat damage gamesFair environment or interference, destroying the normal behavior of game services (such as to detect piracy, scan plug -in, prevent cheating, etc.).", "label": ["Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "Collect your game recognition information, hardware and operating system information, application lists, processes and game crash records for game security"}
{"task": "rw_118.jsonl", "id": 74991, "text": "Please note that separate equipment information and log information are information that cannot recognize specific natural person status.", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 74992, "text": "If we use this type of information with other information to identify a specific natural person or use it with personal information, during the combination of use, this type of information will be regarded as personal information.", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 74993, "text": "We will anonymous and de -identify this type of personal information, except for other provisions of authorization or laws and regulations.", "label": ["Important", "Data Security"], "rewrite": "Personal information that can be used to identify the identity of a specific natural person will be anonymous and de -identified"}
{"task": "rw_118.jsonl", "id": 74994, "text": "During the use of this type of information, it will be handled and protected as your personal information in accordance with this policy.", "label": ["Important", "Data Security"], "rewrite": "Personal information that can be used to identify the identity of a specific natural person shall be handled and protected according to this policy during use"}
{"task": "rw_118.jsonl", "id": 74995, "text": "3. Maintain a healthy network environment", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 74996, "text": "When you interact with other players through text, pictures, voice, and video methods in the game, we may collect and save the content of the above information you sent to filter the improper content of pornography, violence, politics, abuse, and malicious advertisements.This purification game environment and maintain a healthy Internet environment.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect and save the content of the interactive information you sent to filter the improper content of pornography, violence, politics, abuse, and malicious advertisements"}
{"task": "rw_118.jsonl", "id": 74997, "text": "4. Help you complete the order, payment, recharge", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 74998, "text": "When you use the consumption function of Duoyou's game products, we will collect information such as your recharge records, consumption records in order to provide services and allow you to query your transaction records and protect your virtual items to the greatest extent.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect information such as your recharge records, consumption records, in order to provide services and allow the inquiry of transaction records"}
{"task": "rw_118.jsonl", "id": 74999, "text": "The recharge records and consumption records are sensitive information. Collecting the above information is necessary to achieve the consumption function of the Duoyou game products, otherwise the transaction will not be completed.", "label": ["Important", "Usage"], "rewrite": "Collecting recharge records and consumption record information is necessary to realize the consumption function of Duoyi game products"}
{"task": "rw_118.jsonl", "id": 75000, "text": "5. Provide you with customer service or other user response functions", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75001, "text": "If you contact our customer service, we may need you to provide the necessary personal information for authentication to ensure your account security.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When contacting customer service, you need to collect the necessary personal information for identity verification"}
{"task": "rw_118.jsonl", "id": 75002, "text": "In order to provide services in accordance with your demand, after your authorization, artificial customer service personnel need to inquire or verify your relevant information within the scope of your authorization. We will adopt technical and management measures as much as possible to ensure your information security and confidentiality.Use within the range.", "label": ["Important", "Usage"], "rewrite": "Artificial customer service staff need to check or verify your relevant information within your authorization range"}
{"task": "rw_118.jsonl", "id": 75003, "text": "We may also save your contact information (the mobile phone number you use or actively provided, or other contact information), your communication records and content with us, and other necessary information to provide you with and record customer service.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect and save your contact information communication records and content, and other necessary information to provide and record customer service"}
{"task": "rw_118.jsonl", "id": 75004, "text": "6. You understand and agree that when you use our service, you may need to open a specific access right in your device to achieve the collection and use of information involved in these permissions.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75005, "text": "Please note that when you start the right of power, it means that you authorize us to collect and use relevant information to provide you with corresponding services. Once you turn off the right of authority, it means that you cancel the authorization.Using relevant information, it is impossible to provide you with the service corresponding to the permissions.", "label": ["Important", "Risk"], "rewrite": "Opening one authority, which means authorized collection and use of relevant information to provide corresponding services, closing any authority representative cancels the authorization, and no longer continues to collect and use relevant information based on the corresponding permissions"}
{"task": "rw_118.jsonl", "id": 75006, "text": "However, your decision to close permissions will not affect the collection and use of information based on your authorization.", "label": ["Permission Acquisition", "Important"], "rewrite": "Closing authority will not affect the collection and use of information based on authorization before"}
{"task": "rw_118.jsonl", "id": 75007, "text": "Part of the authority that needs to be opened and collected and used as follows:", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75008, "text": "The authority that needs to be opened to collect the purpose", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75009, "text": "Provide position positioning, experience nearby players and other functions, location information", "label": ["Permission Acquisition", "Important"], "rewrite": "Provide position positioning, experience nearby players and other functions require location information authority"}
{"task": "rw_118.jsonl", "id": 75010, "text": "Normal identification equipment information, equipment information (including reading equipment call status and identification code)", "label": ["Permission Acquisition", "Important"], "rewrite": "Normal identification equipment information requires equipment information (including reading equipment call status and identification code) permissions"}
{"task": "rw_118.jsonl", "id": 75011, "text": "Provide features such as picture preservation function, experience wonderful content sharing and other functions, photos, media content and files", "label": ["Permission Acquisition", "Important"], "rewrite": "Provide pictures saving function, experience wonderful content sharing and other functions requires photos, media content and file permissions"}
{"task": "rw_118.jsonl", "id": 75012, "text": "Provide calendar writing function, experience activity calendar reminder function, calendar authority", "label": ["Permission Acquisition", "Important"], "rewrite": "Provide calendar writing functions, experience activity calendar reminder function requires calendar permissions"}
{"task": "rw_118.jsonl", "id": 75013, "text": "Guarantee security verification Normally receiving verification code SMS, telephone information authority", "label": ["Permission Acquisition", "Important"], "rewrite": "Guaranteed security verification To receive verification code SMS normally requires phone information permission"}
{"task": "rw_118.jsonl", "id": 75014, "text": "Provide audio entry function, experience voice input and other functions, microphone rights", "label": ["Permission Acquisition", "Important"], "rewrite": "Provide audio entry functions, experience voice input and other functions require microphone rights"}
{"task": "rw_118.jsonl", "id": 75015, "text": "Upload, shoot photos/pictures/videos, camera permissions", "label": ["Permission Acquisition", "Important"], "rewrite": "Uploading, shooting photos/pictures/videos requires camera permissions"}
{"task": "rw_118.jsonl", "id": 75016, "text": "Provide writing/read external storage functions, allow storage and download resource files, memory card writing/reading permissions", "label": ["Permission Acquisition", "Important"], "rewrite": "Provide writing/read external storage functions, allowing storage and downloading resource files to need memory card writing/read permissions"}
{"task": "rw_118.jsonl", "id": 75017, "text": "7. Tips about personal sensitive information", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75018, "text": "Sensitive personal information refers to personal information that can easily cause the personality dignity of natural people to be infringed or harmed by personal and property security once it is leaked or illegally used.", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75019, "text": "The above provided by you or we collect your information may include your personal sensitive information, such as identity documents, transactions and consumption records, property information, communication records and content, location information.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you provide or we collect your information, you may include your personal sensitive information"}
{"task": "rw_118.jsonl", "id": 75020, "text": "Please be careful and pay attention to personal sensitive information. You agree that we can process your sensitive personal information according to the purpose and method described in this policy.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75021, "text": "8. Other purposes", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75022, "text": "You understand and agree that after collecting your personal information, we may use technical means to identify the data to identify the information, and the information processed information will not be able to identify your identity. In this case, we have the right to use itThe information of the user's database is analyzed and used to commercialize the use without obtaining your consent.", "label": ["Important", "Usage"], "rewrite": "We have the right to use the information that has been identified, analyze and use the user database to use it without the need to obtain the consent separately"}
{"task": "rw_118.jsonl", "id": 75023, "text": "Please note that if we want to use your personal information in other uses that have not been stated in this policy or collect unreasonable other personal information, we will use page prompts, interactive processes, website announcements or other methods to recruit separately.Get your consent.", "label": ["Important", "Usage"], "rewrite": "Use your personal information for other unprepared uses in this policy or other personal information collected unprepared."}
{"task": "rw_118.jsonl", "id": 75024, "text": "Once you agree, these additional uses will be regarded as part of this policy, and these additional information will also apply this policy.", "label": ["Policy Change", "Important"], "rewrite": "The additional use of consent will be considered part of this policy"}
{"task": "rw_118.jsonl", "id": 75025, "text": "9. Exception of obtaining authorization consent", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75026, "text": "Please know that in the following situations, we do not need to obtain your authorization consent if we collect or use personal information:", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In the following circumstances, we do not need to obtain your authorization consent if we collect or use personal information:"}
{"task": "rw_118.jsonl", "id": 75027, "text": "(1) For the contract for the contract and fulfill your contract as a party, or to implement human resource management in accordance with the labor rules and regulations and collective contracts signed in accordance with the law in accordance with the law;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "(1) For the contract for the contract and fulfill your contract as a party, or to implement human resource management in accordance with the labor rules and regulations and collective contracts signed in accordance with the law in accordance with the law;"}
{"task": "rw_118.jsonl", "id": 75028, "text": "(2) To fulfill the statutory duties or the requirements of the statutory volunteer;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "(2) To fulfill the statutory duties or the requirements of the statutory volunteer;"}
{"task": "rw_118.jsonl", "id": 75029, "text": "(3) In order to deal with emergencies, or in urgent situations to protect the health and property safety of natural people;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "(3) In order to deal with emergencies, or in urgent situations to protect the health and property safety of natural people;"}
{"task": "rw_118.jsonl", "id": 75030, "text": "(4) Implement news reports and public opinion supervision for public interests, and deal with your personal information within a reasonable range;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "(4) Implement news reports and public opinion supervision for public interests, and deal with your personal information within a reasonable range;"}
{"task": "rw_118.jsonl", "id": 75031, "text": "(5) In accordance with the \"Personal Information Protection Law\", deal with your own personal information within a reasonable range or other legal disclosure;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "(5) In accordance with the \"Personal Information Protection Law\", deal with your own personal information within a reasonable range or other legal disclosure;"}
{"task": "rw_118.jsonl", "id": 75032, "text": "(6) Other circumstances stipulated in laws and administrative regulations.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "(6) Other circumstances stipulated in laws and administrative regulations."}
{"task": "rw_118.jsonl", "id": 75033, "text": "10. Basic function mode", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75034, "text": "We provide the basic functional model of the Dato League web page browsing and search, but in this mode, you cannot experience the high -quality services we provided by us provided by the Battle League community, the surrounding of Duoyi Games.", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75035, "text": "Under the basic functional mode, we will collect information related to your mobile device, including device MAC address, international mobile device recognition code (such as Android, ID) and unique device identifiers (such as: IDFA/OAID).", "label": ["Important", "First Party Collection Information"], "rewrite": "In the basic function mode, we will collect information related to your mobile device"}
{"task": "rw_118.jsonl", "id": 75036, "text": "We collect this kind of information only for statistical user activity. When using the above information, we will identify it, so that the relevant information cannot be directly related to your true identity.", "label": ["Important", "Usage"], "rewrite": "Collect information related to your mobile device for statistical user activity and de -identifiable processing processing"}
{"task": "rw_118.jsonl", "id": 75037, "text": "You can switch to all functional modes by logging in to the Battle League account at any time.", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75038, "text": "2. How do we use cookies or similar technologies", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75039, "text": "When you use our products and/or services, our or our partners may make Cookies and similar technologies collect some of your personal information, including: your habit of visiting the website, your browsing information, and your login information so thatProvide you with a better service experience.", "label": ["Important", "First Party Collection Information"], "rewrite": "It will make Cookies and similar technologies collect your personal information"}
{"task": "rw_118.jsonl", "id": 75040, "text": "We will strictly require third parties to use Cookies and similar technologies within the scope of the purposes stated in this policy.", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75041, "text": "If your browser allows, you can manage cookies and similar technologies through your browser settings.", "label": ["Important", "Edit/Control"], "rewrite": "You can manage cookies and similar technologies through the settings of your browser"}
{"task": "rw_118.jsonl", "id": 75042, "text": "You understand and know: some of our products and/or services can only be realized by using cookies or similar technologies. If you refuse to use or delete, you may not be able to get our products and/or services the best for the best service of our products and services.The service experience may also have a certain impact on your information protection and account security.", "label": ["Important", "Edit/Control"], "rewrite": "If you refuse to use or delete cookies or similar technologies, you may not be able to obtain the best service experience, or it may affect your information protection and account security"}
{"task": "rw_118.jsonl", "id": 75043, "text": "3. How can we share, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75044, "text": "(1) Entrusted processing", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75045, "text": "If we entrust a third party to handle your personal information, we will agreed with the trustee to agreed to the purpose, time limit, processing method, type of personal information, protection measures, and the rights and obligations of both parties, andInformation processing activities supervise.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "When entrusting a third party to process personal information, it will agree on all aspects of entrusted processing and supervise personal information processing activities"}
{"task": "rw_118.jsonl", "id": 75046, "text": "(2) Sharing", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75047, "text": "We share your personal information on the premise that we follow the premise of \"legitimate legitimacy, minimum necessity, and clear principle of purpose.\"", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We share your personal information on the premise that we follow the premise of \"legitimate legitimacy, minimum necessity, and clear principle of purpose.\""}
{"task": "rw_118.jsonl", "id": 75048, "text": "At the same time, we will evaluate the impact of personal information protection on personal information in advance, and take effective technical protection measures on the output form, circulation, use, etc.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "The sharing activity of personal information will be evaluated in advance of personal information protection, and technical protection measures are taken"}
{"task": "rw_118.jsonl", "id": 75049, "text": "At the level of cooperation agreements, the information protection obligations and responsibilities of partners are strictly required, and a data security protection agreement is signed with business partners before cooperation.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Business partners signed a protection agreement on data security before cooperation"}
{"task": "rw_118.jsonl", "id": 75050, "text": "We have developed the situation of \"Third -Party Sharing and SDK List\" clearly and simple to your main software tool development package (SDK) for your personal information sharing and access.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "\"Third Party Sharing and SDK List\""}
{"task": "rw_118.jsonl", "id": 75051, "text": "Click to view \"Third Party Sharing and SDK List\".", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75052, "text": "1. Share sharing to realize our service/function:", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75053, "text": "In some cases, we must share your personal information in order to fulfill our obligations as a party that concludes related to the contract or provide the services you need, which mainly includes the following situations:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In some cases, we must share your personal information in order to fulfill our contractual obligations or provide services"}
{"task": "rw_118.jsonl", "id": 75054, "text": "(1), product order, order management and delivery service: In order to realize the needs of your purchase of Duoyi Games (including commodity distribution and logistics query, enjoy after -sales service, etc.), we will make your order -related information, distribution related information informationAnd to deal with the necessary personal information (the \"minimum necessary\" scope of the purpose of achieving specific service purposes), it is provided to a third -party logistics service provider.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Your order -related information, distribution -related information and other necessary personal information sharing with third -party logistics service providers provider for product order, order management and delivery service"}
{"task": "rw_118.jsonl", "id": 75055, "text": "(2) When we receive due diligence or audit, we shared your relevant information with external supervision, professional consulting agencies (such as audit institutions).", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After receiving due diligence or auditing, share your relevant information with the external agency"}
{"task": "rw_118.jsonl", "id": 75056, "text": "(3) Other shared sharing to achieve our service/functions.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75057, "text": "2. Third -party SDK service provider:", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75058, "text": "In order to ensure the stable operation and functional implementation of our client, so that you can use and enjoy more services and functions. Our application will embed the software tool development package (SDK) or other similar applications of business partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Our application will embed the software tool development package (SDK) or other similar applications of business partners"}
{"task": "rw_118.jsonl", "id": 75059, "text": "We will strictly monitor the SDK and application interface (API) obtained by business partners to deal with security monitoring, so that they will handle personal information in accordance with this policy and any other related confidentiality and security measures to ensure data security.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "SDK and application interface (API) obtained by monitoring business partners, so that it follows this policy"}
{"task": "rw_118.jsonl", "id": 75060, "text": "Click to view \"Third Party Sharing and SDK List\".", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75061, "text": "(3) Transfer", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75062, "text": "Transfer refers to the process of transferring personal information control to other companies, organizations or individuals.", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75063, "text": "In principle, we will not transfer your personal information, except the following situations:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In principle, we will not transfer your personal information, except the following situations:"}
{"task": "rw_118.jsonl", "id": 75064, "text": "1. You make your own requirements and meet the relevant conditions of laws and regulations and regulations.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "1. You make your own requirements and meet the relevant conditions of laws and regulations and regulations."}
{"task": "rw_118.jsonl", "id": 75065, "text": "2. If we need to transfer personal information for the reasons for merging, separation, dissolution, and declaration of bankruptcy, we will inform you that the name or name and contact information of the receiver will be informed of the receiver, and the receiver will continue to be constrained by this policy.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If business mergers, acquisitions, asset transfer and other transactions will be informed of the relevant situation, and it will continue to protect your personal information in accordance with laws and regulations and not lower than the standards required by this guideline."}
{"task": "rw_118.jsonl", "id": 75066, "text": "If the receiving party changes the original purpose and method of processing, we will require the receiving party to obtain your consent again.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If the receiving party changes the original purpose and method of processing, we will require the receiving party to obtain your consent again."}
{"task": "rw_118.jsonl", "id": 75067, "text": "(4) Public disclosure", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75068, "text": "Except for public disclosure or obtaining an accident in accordance with the provisions of laws and regulations, we will not disclose public information that you have not disclosed or unreasonably disclosed.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Except for public disclosure or obtaining an accident in accordance with the provisions of laws and regulations, we will not disclose public information that you have not disclosed or unreasonably disclosed."}
{"task": "rw_118.jsonl", "id": 75069, "text": "And before we publicly disclose your personal information, we will conduct an impact assessment of personal information protection, and use security measures that meet the standards of the industry for treatment.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We publicly disclose the influence and evaluation before disclosing personal information and take security protection measures"}
{"task": "rw_118.jsonl", "id": 75070, "text": "(5) No need to authorize sharing, transfer, and disclosure", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75071, "text": "According to relevant laws and regulations and national standards, in the following circumstances, we may share, transfer, and publicly disclose personal information without obtaining your authorization consent in advance:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "According to relevant laws and regulations and national standards, in the following circumstances, we may share, transfer, and publicly disclose personal information without obtaining your authorization consent in advance:"}
{"task": "rw_118.jsonl", "id": 75072, "text": "1. Directly related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "1. Directly related to national security and national defense security;"}
{"task": "rw_118.jsonl", "id": 75073, "text": "2. Directly related to public safety, public health, and major public interests;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "2. Directly related to public safety, public health, and major public interests;"}
{"task": "rw_118.jsonl", "id": 75074, "text": "3. Directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "3. Directly related to criminal investigation, prosecution, trial, and judgment execution;"}
{"task": "rw_118.jsonl", "id": 75075, "text": "4. For the major legitimate rights and interests of the lives and property of the subject of personal information or other individuals, it is difficult to get my consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "4. For the major legitimate rights and interests of the lives and property of the subject of personal information or other individuals, it is difficult to get my consent;"}
{"task": "rw_118.jsonl", "id": 75076, "text": "5. The personal information subject discloses personal information to the public on its own;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "5. The personal information subject discloses personal information to the public on its own;"}
{"task": "rw_118.jsonl", "id": 75077, "text": "6. Collect personal information from legal public information, such as legal news reports and government information disclosure.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "6. Collect personal information from legal public information, such as legal news reports and government information disclosure."}
{"task": "rw_118.jsonl", "id": 75078, "text": "4. How do we protect your information", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75079, "text": "1. Safety protection measures", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75080, "text": "(1) We strive to provide guarantees for user information security to prevent information leakage, loss, improper use, unauthorized access and disclosure.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75081, "text": "We use multi -directional security protection measures to ensure that user personal information protection is at a reasonable level of security, including technological protection methods, management system control, and security system guarantee.", "label": ["Important", "Data Security"], "rewrite": "We use multi -directional security measures such as technical protection means, management system control, and security system guarantee to protect personal information security"}
{"task": "rw_118.jsonl", "id": 75082, "text": "In addition, the relevant system of our game has also passed the record and evaluation of national network security level protection (level three).", "label": ["Important", "Data Security"], "rewrite": "The system has passed the record and evaluation of the national network security level protection (level 3)"}
{"task": "rw_118.jsonl", "id": 75083, "text": "(2) We adopt industry -leading technical protection measures.", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75084, "text": "The technical means we use include but not limited to firewalls, encryption (such as SSL), de -identification or anonymous treatment, access control measures, etc.", "label": ["Important", "Data Security"], "rewrite": "The technical means we use include but not limited to firewalls, encryption (such as SSL), de -identification or anonymous treatment, access control measures, etc."}
{"task": "rw_118.jsonl", "id": 75085, "text": "In addition, we will continue to strengthen the security capabilities of software installed on your device.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75086, "text": "For example, we will complete some information encryption work locally to consolidate security transmission;", "label": ["Important", "Data Security"], "rewrite": "Complete some information encryption work locally"}
{"task": "rw_118.jsonl", "id": 75087, "text": "We will understand the application information and running process information installed by your device to prevent malicious programs such as viruses and Trojans.", "label": ["Important", "Data Security"], "rewrite": "Understand the application information and running process information of the device to prevent malicious procedures"}
{"task": "rw_118.jsonl", "id": 75088, "text": "(3) We will also adopt strict data access control and multiple identity authentication technologies to protect personal information and prevent data from being used in violation of regulations.", "label": ["Important", "Data Security"], "rewrite": "Use strict data access permissions control and multiple identity authentication technology to protect personal information"}
{"task": "rw_118.jsonl", "id": 75089, "text": "2. Safety event disposal measures", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75090, "text": "If personal information leaks and other security incidents occur, we will start emergency plans to prevent security incidents from expanding.", "label": ["Important", "Data Security"], "rewrite": "Start the emergency plan to deal with security incidents such as personal information leakage"}
{"task": "rw_118.jsonl", "id": 75091, "text": "After the security incident occurs, we will inform you the basic situation of the security incident in the form of announcement, push notification or email, we are about or already adopted, and our proposals for your response.", "label": ["Important", "Data Security"], "rewrite": "Inform the basic situation of security incidents, disposal measures and remedial measures in the form of announcement, push notification or email, and cope with suggestions"}
{"task": "rw_118.jsonl", "id": 75092, "text": "If it is difficult to achieve one by one, we will issue warnings through announcement and other methods.", "label": ["Important", "Data Security"], "rewrite": "If it is difficult to achieve one by one, we will issue a security event warning through announcement and other methods"}
{"task": "rw_118.jsonl", "id": 75093, "text": "3. Safety reminder", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75094, "text": "Please understand that due to the technical restrictions and the limitations of risk prevention, even if we have tried to strengthen security measures, we cannot always ensure that the information is 100 % security.", "label": ["Important", "Data Security"], "rewrite": "Although there are security measures, it is impossible to fully guarantee that there is no security problem."}
{"task": "rw_118.jsonl", "id": 75095, "text": "You need to understand that the system and communication network used in Duoyi Game services may occur due to the situation outside the control scope.", "label": ["Important", "Data Security"], "rewrite": "Systems and communication networks may have problems due to the situation outside our controlled range"}
{"task": "rw_118.jsonl", "id": 75096, "text": "Please keep your account, password and other identity elements properly.", "label": ["Important", "Data Security"], "rewrite": "Keep your account number, password and other identity elements!"}
{"task": "rw_118.jsonl", "id": 75097, "text": "When you use the Duoye game service, we will identify your identity through your account, password and other identity elements.", "label": ["Important", "Data Security"], "rewrite": "Identify your identity through your account, password and other identity elements"}
{"task": "rw_118.jsonl", "id": 75098, "text": "Once you leak the aforementioned information, you may suffer losses and may be unfavorable to you.", "label": ["Important", "Data Security"], "rewrite": "Once you disclose your account, password and other identity elements, it may have a adverse effect on you"}
{"task": "rw_118.jsonl", "id": 75099, "text": "If you find an account, password and/or other identity elements that may be leaked, please contact us immediately so that we can take corresponding measures in time to avoid or reduce related losses.", "label": ["Important", "Data Security"], "rewrite": "If the personal information discovered, please contact our customer service immediately."}
{"task": "rw_118.jsonl", "id": 75100, "text": "5. How do we store your information", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75101, "text": "1. The area where information is stored", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75102, "text": "The personal information we collected and generated in the operation of the People's Republic of China is stored in the territory of the People's Republic of China.", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in domestic operations is stored in the country"}
{"task": "rw_118.jsonl", "id": 75103, "text": "But except the following situations:", "label": ["Data Retention", "Important"], "rewrite": "In the following circumstances, personal information may be exported: (1) laws and regulations have clearly stipulated; (2) obtain your authorization consent separately; (3) the products and/or services you use involve cross -border, and you actively provide personal information to overseas."}
{"task": "rw_118.jsonl", "id": 75104, "text": "(1) The laws and regulations have clearly stipulated;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75105, "text": "(2) Get your authorization consent separately;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75106, "text": "(3) The product and/or service you use involve cross -border, and you take the initiative to provide personal information to overseas.", "label": ["Data Retention", "Important", "Risk"], "rewrite": "The products you use involved cross -border, or the personal information provided by overseas, will be stored abroad."}
{"task": "rw_118.jsonl", "id": 75107, "text": "In response to the above situations, we will implement it in accordance with the laws and regulations and the relevant provisions of the regulatory authorities, and strictly require the receiver to handle your personal information in accordance with the relevant requirements of this policy and laws and regulations.", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75108, "text": "2. The method and period of information storage", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75109, "text": "We will store your information in a safe way, including local storage (using APP for data cache), database and server logs.", "label": ["Data Retention", "Important"], "rewrite": "Use local storage (using APP for data cache), database and server logs to store information"}
{"task": "rw_118.jsonl", "id": 75110, "text": "We guarantee that you will only store your personal information within the time required for service purposes or the conditions and periods stipulated by laws and regulations.", "label": ["Data Retention", "Important"], "rewrite": "Slide personal information within the period of time or under legal conditions for the purpose of the purpose"}
{"task": "rw_118.jsonl", "id": 75111, "text": "After the above storage period is exceeded, we will delete or anonymize your personal information.", "label": ["Data Retention", "Important"], "rewrite": "After exceeding the necessary storage period, we will delete or processes your personal information"}
{"task": "rw_118.jsonl", "id": 75112, "text": "We judge the storage period of personal information. The following standards are mainly referred to the following standards and the elders are based on the elders:", "label": ["Data Retention", "Important"], "rewrite": "We judge the storage period of personal information. The following standards are mainly referred to and are based on the elders: (1) to complete the business functions you agree with; (2) to ensure that we provide you with the safety and quality of the service;The longer retention period; (4) whether there are other regulations for the retention period."}
{"task": "rw_118.jsonl", "id": 75113, "text": "(1) Complete the business functions you agree with;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75114, "text": "(2) Make sure we provide you with service security and quality;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75115, "text": "(3) The longer retention period you agree;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75116, "text": "(4) Whether there are other regulations of the reserved period.", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75117, "text": "3. The notice of the product or service stopping operation", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75118, "text": "When our products or services stop operation, we will announce notifications in accordance with relevant laws and regulations and protect your legitimate rights and interests in accordance with the law.", "label": ["Important", "Cessation of Operations"], "rewrite": "When the operation is stopped, the announcement will be made in accordance with relevant laws and regulations, and your legitimate rights and interests will be guaranteed in accordance with the law."}
{"task": "rw_118.jsonl", "id": 75119, "text": "6. Your rights", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75120, "text": "In accordance with China's relevant laws, regulations, standards, and the practice of other countries and regions, we guarantee that you exercise the following rights on your personal information:", "label": ["Important", "Edit/Control"], "rewrite": "We guarantee your right to exercise your personal information"}
{"task": "rw_118.jsonl", "id": 75121, "text": "1. Query, copy, or correct, and supplement your personal information", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75122, "text": "When you complete your account registration and conduct a reasonable and necessary authentication, you can log in to your account at any time to check, copy or modify the account settings and information.", "label": ["Important", "Edit/Control"], "rewrite": "You can check, copy or modify the account settings and information after account registration and authentication"}
{"task": "rw_118.jsonl", "id": 75123, "text": "If you find that the information is wrong, inaccurate or incomplete, you can log in to the Duoyou Game account, modify your account information in your account settings to make objections to correct, supplement or use the contact information listed in this policy and request requests and request requestsWe correct and supplement, unless laws and regulations have other provisions.", "label": ["Edit/Control", "Important"], "rewrite": "Modify your account information in your account settings to correct, supplement or contact us to correct, supplement"}
{"task": "rw_118.jsonl", "id": 75124, "text": "If you want to check, copy, or modify your other personal information, or encounter difficulties in exercising the above rights, you can contact us through the contact information of this policy. We will complete the verification and processing within 15 working days., Except for laws and regulations or other provisions of this policy statement.", "label": ["Important", "Edit/Control"], "rewrite": "If you encounter difficulties in exercising your rights, you can contact us. We will give a reply within 15 working days or the period stipulated by laws and regulations"}
{"task": "rw_118.jsonl", "id": 75125, "text": "2. Delete your personal information", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75126, "text": "In the following circumstances, you can make a request to delete personal information:", "label": ["Important", "Edit/Control"], "rewrite": "In the following circumstances, you can make a request to delete personal information: (1) If our behavior of handling personal information violates laws and regulations; (2) If we collect and use your personal information, it has not obtained your consent.; (3) If our behavior of handling personal information violates your agreement; (4) If you no longer use our products or services, or you cancel the account; (5) If we no longer provide you with a product orServe."}
{"task": "rw_118.jsonl", "id": 75127, "text": "(1) If our behavior of handling personal information violates laws and regulations;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75128, "text": "(2) If we collect and use your personal information, it has not obtained your consent;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75129, "text": "(3) If our behavior of handling personal information violates your agreement;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75130, "text": "(4) If you no longer use our products or services, or you cancel your account;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75131, "text": "(5) If we no longer provide products or services for you.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75132, "text": "If you want to delete other personal information or encounter difficulties in the process of exercising the above rights, you can contact us through the method of this policy. We will complete the verification and processing within 15 working days, but laws and regulations will be separately and regulated.Except for other provisions or this policy statement.", "label": ["Important", "Edit/Control"], "rewrite": "When you can contact us to exercise the right of deletion, we will give a reply within 15 working days or the period stipulated by laws and regulations"}
{"task": "rw_118.jsonl", "id": 75133, "text": "Please note that the preservation period stipulated in laws, administrative regulations or other normative documents has not yet expired, or it is difficult to achieve technically deleted personal information. We will stop processing except for storage and adopting necessary security protection measures until we can be deleted until it can be deletedOr achieve anonymity.", "label": ["Edit/Control", "Important"], "rewrite": "We stop processing personal information that has not yet expired or is technically difficult to delete, except for storing and taking necessary security protection measures until it can be deleted or anonymized"}
{"task": "rw_118.jsonl", "id": 75134, "text": "3. Log out your account", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75135, "text": "You can cancel the previously registered account at any time, but you should provide the corresponding registration information of the account to Duoyi Network. The specific process can be understood on this page (https://dygame.duoyi.com/help/?", "label": ["Important", "Edit/Control"], "rewrite": "After providing registration information, you can cancel this account at any time. The specific process can be understood on this page (https://dygame.duoyi.com/help/?Active=zh06)."}
{"task": "rw_118.jsonl", "id": 75136, "text": "active=zh06", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75137, "text": "After canceling the account, we will stop providing you with products or services, and process your personal information in accordance with the relevant requirements of laws and regulations, or delete personal information related to your account, but laws and regulations or regulatory agencies to users to users to usersExcept for information storage time.", "label": ["Important", "Edit/Control"], "rewrite": "After cancellation, personal information will be deleted or anonymous."}
{"task": "rw_118.jsonl", "id": 75138, "text": "4. Change the scope of your authorization consent or revoke your authorization consent", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75139, "text": "Please understand that each business function often needs to open part of the authority and collect the necessary personal information to achieve it, the collection, use and equipment authority of your personal information.", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75140, "text": "You can change the consent range or withdraw your authorization by deleting information in our specific products/services, changing privacy settings, and closing the equipment function in the browser or operating system.", "label": ["Important", "Edit/Control"], "rewrite": "Delete information in specific products/services, change privacy settings, and change the scope of consent or withdraw authorization in the browser or operating system."}
{"task": "rw_118.jsonl", "id": 75141, "text": "You can withdraw the device permissions through your mobile phone system permissions, and you can also open the relevant equipment permissions through this path.", "label": ["Important", "Edit/Control"], "rewrite": "Withdraw or open device permissions through your mobile phone system permissions"}
{"task": "rw_118.jsonl", "id": 75142, "text": "Please understand that when you perform the above operations, we will not be able to continue to provide you with the service corresponding to the withdrawal consent or authorization, but it will not affect personal information processing carried out based on your authorization.", "label": ["Important", "Edit/Control"], "rewrite": "The services corresponding to the permissions cannot be continued, but it will not affect the personal information processing previously carried out"}
{"task": "rw_118.jsonl", "id": 75143, "text": "If you want to change or withdrawn other consent you have already authorized, you can contact us through the withdrawal method provided by the actual interface of the product or the contact information of this policy.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75144, "text": "If such authorization consent is not necessary for the use of Duoyi services, you can contact us through our customer service to change or revoke your authorization consent to some personal information.", "label": ["Edit/Control", "Important"], "rewrite": "For non -essential authorization, you can revoke through contact customer service"}
{"task": "rw_118.jsonl", "id": 75145, "text": "We will answer your request within 15 working days.", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75146, "text": "When you revoke the authorization consent, we will no longer deal with the corresponding personal information.", "label": ["Edit/Control", "Important"], "rewrite": "After revoking the authorization consent, no longer process the corresponding personal information"}
{"task": "rw_118.jsonl", "id": 75147, "text": "But your decision to withdraw the authorization consent will not affect personal information processing based on your authorization.", "label": ["Important", "Edit/Control"], "rewrite": "The decision to revoke the consent of authorization will not affect the personal information processing that was previously authorized"}
{"task": "rw_118.jsonl", "id": 75148, "text": "5. respond to your above request", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75149, "text": "To ensure safety, you may need to provide a written request or prove your identity in other ways.", "label": ["Important", "Data Security"], "rewrite": "Need to provide a written request or other ways to prove the identity to respond to the right to respond to the right to personal information"}
{"task": "rw_118.jsonl", "id": 75150, "text": "We may ask you to verify your identity first, and then process your request.", "label": ["Important", "Data Security"], "rewrite": "First verify your identity before processing the right to personal information"}
{"task": "rw_118.jsonl", "id": 75151, "text": "For your reasonable requests, we do not charge fees in principle, but we will charge a certain cost fee as required for multiple repeated and more reasonable limit.", "label": ["Important", "Edit/Control"], "rewrite": "For reasonable requests, do not charge, and requests beyond a reasonable limit, they will charge"}
{"task": "rw_118.jsonl", "id": 75152, "text": "For those who have no repetition and need too much technical means (for example, need to develop new systems or fundamentally change the current practice), it brings risks to others' legitimate rights and interests or very unrealistic (for example, information involved in the backup tape)We may refuse.", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "Rejection for no repetition and need too much technical means to bring risks to others' legitimate rights or very unrealistic requests"}
{"task": "rw_118.jsonl", "id": 75153, "text": "7. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75154, "text": "If you are the parents or guardians of the minor, when you have any questions about the personal information and related information of the minors you monitor, please contact us through the contact information listed in this policy.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75155, "text": "We will protect relevant information about minors in accordance with the provisions of relevant national laws and regulations.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75156, "text": "At the same time, the specific content of the personal information protection of children in the products, websites and services in Duoyi Network should also refer to the \"Duoyi Children's Privacy Protection Policy\".", "label": ["Specific Audiences", "Important"], "rewrite": "The specific content of the personal information protection of children shall refer to the \"Duoyi Child Privacy Protection Policy\"."}
{"task": "rw_118.jsonl", "id": 75157, "text": "(1) Product policy", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75158, "text": "Our products, websites and services are mainly adults.", "label": ["Specific Audiences", "Important"], "rewrite": "Our products, websites and services are mainly adults."}
{"task": "rw_118.jsonl", "id": 75159, "text": "Without the consent of parents or guardians, children should not create their own user account.", "label": ["Specific Audiences", "Important"], "rewrite": "Children's user accounts to create their own user should be consent from their parents or guardians"}
{"task": "rw_118.jsonl", "id": 75160, "text": "Regarding the case of collecting children's personal information with the consent of parents, we will only use or disclose this information if they are allowed to be allowed, parents or guardians to clearly consent or protect children.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Important"], "rewrite": "It will only use, share, transfer, or disclose this information if the laws and regulations are allowed, parents or guardians to clearly agree or protect minors."}
{"task": "rw_118.jsonl", "id": 75161, "text": "Although the definition of children and customs in local laws is different, we will be dissatisfied, 14, and any year old are regarded as children.", "label": ["Specific Audiences", "Important"], "rewrite": "We regard anyone under the age of 14 as children."}
{"task": "rw_118.jsonl", "id": 75162, "text": "If we find that we collect children's personal information without the consent of our parents in advance, we will try to delete relevant data as soon as possible.", "label": ["Specific Audiences", "Important"], "rewrite": "If the personal information of minors was collected without the consent of the parents, he would try to delete relevant information as soon as possible."}
{"task": "rw_118.jsonl", "id": 75163, "text": "(2) We suggest", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75164, "text": "Any minor participation in online activities should obtain the consent of the parents or other guardians (hereinafter referred to as the \"guardian\") in advance.", "label": ["Specific Audiences", "Important"], "rewrite": "Any minor to participate in online activities should obtain the consent of the parent guardian in advance."}
{"task": "rw_118.jsonl", "id": 75165, "text": "8. How to update this policy", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75166, "text": "We reserve the right to update or modify this policy from time to time.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75167, "text": "We will post any changes to this policy on this page.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75168, "text": "But without your clear consent, we will not reduce the rights you should enjoy in accordance with this policy.", "label": ["Policy Change", "Important"], "rewrite": "After the privacy policy is updated, we will not reduce the rights you should enjoy in accordance with this policy without your consent"}
{"task": "rw_118.jsonl", "id": 75169, "text": "Please read the content of this policy carefully.", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75170, "text": "If you do not agree with the change of this policy, or have objections to the modified and updated content of this policy, you can choose to stop using or cancel the account.", "label": ["Policy Change", "Important"], "rewrite": "If you don't agree with the change of this policy or have objections, you can stop using or cancel your account."}
{"task": "rw_118.jsonl", "id": 75171, "text": "But please know that the behavior and activities before your account cancellation and stop using this service are still constrained by this policy.", "label": ["Policy Change", "Important"], "rewrite": "The behavior and activities before your account cancellation and before the use of this service are still constrained by this policy."}
{"task": "rw_118.jsonl", "id": 75172, "text": "For major changes, we will notify or send an email to you in a significant way or notify the changes made by this policy in other ways.", "label": ["Policy Change", "Important"], "rewrite": "For major changes, we will also provide a more significant notice."}
{"task": "rw_118.jsonl", "id": 75173, "text": "Nine, how to contact us", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75174, "text": "If you have any questions, opinions, or suggestions on this policy, you can send a letter to the following address through kf.duoyi.com, or write to the following address: No. 90, Shaohe Road, Huangpu District, Guangzhou, Duoyi Personal Information Protection Specialist (received)Essence", "label": ["Important", "Contact Information"], "rewrite": "Contact information: (1) Feedback through kf.duoyi.com; (2) Writing to the following address: Duoyi Personal Information Protection Commissioner, No. 90 Personal Road, No. 90, Shaohe Road, Huangpu District, Guangzhou (received)"}
{"task": "rw_118.jsonl", "id": 75175, "text": "Under normal circumstances, we will reply to your user's identity after receiving your questions, opinions or suggestions, and verify your user identity, and we will reply within 15 working days.", "label": ["Important", "Contact Information"], "rewrite": "We will reply within 15 working days after receiving your questions, opinions or suggestions, and verify your user identity"}
{"task": "rw_118.jsonl", "id": 75176, "text": "10. Appendix", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75177, "text": "If you are dissatisfied with our reply, or our handling of personal information infringe on your legitimate rights and interests, and after you feed us feedback, we cannot provide you with a satisfactory reply and refuse to improve.Complaints and reports.", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75178, "text": "The interpretation and dispute resolution of this policy shall apply laws of the People's Republic of China.", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75179, "text": "Any dispute related to this policy, the two parties should be resolved by friendly merchants;", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75180, "text": "If it cannot be resolved, there is a jurisdictional court with the jurisdiction of the jurisdiction of Guangzhou Duoyi Network Co., Ltd. as the jurisdiction.", "label": [], "rewrite": []}
{"task": "rw_118.jsonl", "id": 75181, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
