{"task": "rw_100.jsonl", "id": 70721, "text": "Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70722, "text": "Update date: February 22, 2022", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70723, "text": "Effective date: October 16, 2020", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70724, "text": "Release date: October 16, 2020", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70725, "text": "Dear users, thank you for trusting and using our products and services. Recently, we have updated the Privacy Policy. This update has been modified and optimized the personalized recommendation function and added the automatic decision -making of the information system.For rights, please read carefully and fully understand the relevant terms.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70726, "text": "[Foreword] Le Element Technology (Beijing) Co., Ltd. and its related parties (referred to as \"we\" or \"Le Element\") know the importance of personal information to you. We will protect your personal information in accordance with the provisions of laws and regulationsAnd privacy safety.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70727, "text": "We formulate this \"privacy policy\" and specifically remind: I hope you read and understand the privacy policy carefully before using related services to make appropriate choices.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70728, "text": "【Special Note】", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70729, "text": "• Users under the age of fourteen years old, at the same time, apply this policy and \"Personal Information Protection Statement and Guardian Notice\".", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70730, "text": "If the specific terms of specific terms and the terms of the policy have inconsistent agreement, the specific terms shall be subject to specific terms within the scope of the constraints.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70731, "text": "If a single service we provide is not applicable to this policy, the service will explicitly explicitly eliminate the applicable policy in an appropriate manner.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70732, "text": "• If you need to share your information to the third party in order to provide you, we will ask third parties to take protection measures for your information and strictly abide by relevant laws and regulations and regulatory requirements.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70733, "text": "It is necessary to specifically explain that this policy is not applicable to the services you provide in the third direction.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70734, "text": "If third parties on our platform rely on this platform to provide you, we will prompt you that the service is provided by independent third parties. The personal information you provided to the third party is not suitable for this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70735, "text": "• Before using our various products or services, please be sure to read and thoroughly understand this policy, especially the clauses that are identified by the lines under the body. You should focus on reading.Or service.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70736, "text": "Once you start using our products or services, it means that you have fully understood and agree with this policy.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70737, "text": "This privacy policy will help you understand:", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70738, "text": "• We will follow your information to collect and use your information, but we will not collect personal information in a package of compulsory binding because you agree with your consent of the privacy policy.", "label": ["Important", "First Party Collection Information"], "rewrite": "It will not collect personal information by adopting a compulsory binding method because you agree with your privacy policy."}
{"task": "rw_100.jsonl", "id": 70739, "text": "• When you use or start related functions or use services, we will collect and use relevant information for the implementation of functions and services.", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to achieve functions and services, we will collect and use relevant information."}
{"task": "rw_100.jsonl", "id": 70740, "text": "Unless it is necessary to realize basic business functions or the necessary information necessary in accordance with the requirements of laws and regulations, you can refuse to provide and not affect other functions or services.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can refuse to provide non -necessary information without affecting other functions or services."}
{"task": "rw_100.jsonl", "id": 70741, "text": "We will explain in the privacy policy which is the necessary information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70742, "text": "•, accurate geographical location, camera, album, and communication records will not be opened by default. Only by your explicit authorization can you use it when you implement specific functions or services, and you can also withdraw authorization.", "label": ["Permission Acquisition", "Important"], "rewrite": "Precise geographical location, camera, album, and communication records will not be opened by default. Only when it is authorized to be authorized, it can be used to withdraw authorization."}
{"task": "rw_100.jsonl", "id": 70743, "text": "In particular, it is necessary to point out that even after your authorization, we have obtained these sensitive permissions, and we will not collect your information when related functions or services are not needed.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "The sensitivity permissions obtained by authorization will not collect information sometimes in related functions or services."}
{"task": "rw_100.jsonl", "id": 70744, "text": "The following will help you understand how we collect, use, store, transmit, share, transfer and protect personal information;", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70745, "text": "Help you understand the way query, access, delete, correction, and withdrawn authorized personal information.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70746, "text": "Among them, the important part of the terms of your personal information rights and interests We have reminded in bold forms, please pay special attention.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70747, "text": "1. How do we collect and use personal information", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70748, "text": "2. How do we use cookie or similar technology", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70749, "text": "3. How do we share, transfer, and publicly disclose personal information", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70750, "text": "4. How do we store personal information", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70751, "text": "5. How can we protect the security of personal information", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70752, "text": "6. Manage your personal information", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70753, "text": "7. Minor protection", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70754, "text": "8. Amendment and Notice of Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70755, "text": "9. Dispute resolution", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70756, "text": "10. Contact us", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70757, "text": "1. How do we collect and use personal information", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70758, "text": "In the process of using our service, we will collect information you actively provide or because of the service when using the service as follows to provide you with your services and ensure your account security:", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70759, "text": "When you use our products and/or services, we need/may need to collect and use your personal information, including the following:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70760, "text": "1. In order to realize the basic functions of providing you with our products and/or services, you must authorize the necessary information we collect and use.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70761, "text": "If you refuse to provide the corresponding information, you will not be able to use our products and/or services normally.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70762, "text": "2. In order to provide you with additional functions to provide you and/or services, you can choose to authorize the information we collect and use.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70763, "text": "If you refuse to provide it, you will not be able to use related additional functions normally or to achieve the functional effects we intend to achieve, but it will not affect your basic functions that use our products and/or services.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70764, "text": "(1) Basic necessary function", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70765, "text": "1. Register and log in", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70766, "text": "(1) Mobile phone number registration and login: When you register and log in to related services, you can create an account number through your mobile phone number. The information is collected to help you complete the registration.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the mobile phone number to complete the registration."}
{"task": "rw_100.jsonl", "id": 70767, "text": "The mobile phone number belongs to personal sensitive information. If you refuse to provide the \"mobile phone number login\" method to register and log in, it does not affect your registration and login in other ways, nor does it affect the normal use of other functions.", "label": ["Important", "First Party Collection Information"], "rewrite": "Refusing to provide mobile phone numbers will not be able to register and log in in the \"mobile phone number login\" method, but it does not affect the normal use of registered login and other functions in other ways."}
{"task": "rw_100.jsonl", "id": 70768, "text": "(2) One -click login: Based on our cooperation with communication operators, when you use the \"one -click login of this machine number\" function, after your explicit consent, the operator will send us your mobile phone number toYou provide a quick login service.", "label": ["Important", "First Party Collection Information"], "rewrite": "When using the \"one -click login of this machine number\" function, after explicit consent, the operator will send us your mobile phone number to us."}
{"task": "rw_100.jsonl", "id": 70769, "text": "The mobile phone number belongs to personal sensitive information. If you refuse to provide the \"one -click login of this machine number\" to register and log in, but it does not affect your registration in other ways, nor does it affect the normal use of other functions.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide a mobile phone number, you will not be able to use the \"one -click login of this machine number\" to register and log in, but it does not affect the registration and login in other ways."}
{"task": "rw_100.jsonl", "id": 70770, "text": "(3) Third -party account login: You can use third -party account WeChat, QQ, and Weibo to log in to use. You will authorize us to obtain the public information (avatar, nickname, and other information you authorized) registered on the third -party platform.Binding with the product account, so that you can log in and use this product and related services directly.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "You will authorize us to obtain the public information (avatar, nickname, and other information you authorized) registered on a third -party platform for binding with product accounts."}
{"task": "rw_100.jsonl", "id": 70771, "text": "If you refuse to agree to obtain the information you authorized from the third party, you will not be able to register your account and log in through WeChat, QQ, and Weibo, nor can you use the third -party account to achieve game data synchronization.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "If we refuse to agree to obtain the information you authorized from third parties, you will not be able to register your account and log in through WeChat, QQ, and Weibo."}
{"task": "rw_100.jsonl", "id": 70772, "text": "2. Real -name authentication", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70773, "text": "When you need to use your authentication function or related services, according to relevant laws and regulations, you need to provide your real identity information (real name, ID number) to complete the real -name verification.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect real identity information (real name, ID number) to complete the real -name verification."}
{"task": "rw_100.jsonl", "id": 70774, "text": "(2) Additional business functions", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70775, "text": "When you use the product's additional business functions, in order to satisfy you the purpose of providing the product and service, in addition to the registration information, you also need to provide us with your personal identity information, location information, and other services to youInformation, if you do not use specific products and services, you do not need to provide relevant information (the following will be clarified in detail).", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your personal identity information, location information and other information for you."}
{"task": "rw_100.jsonl", "id": 70776, "text": "1. Based on the additional function of the camera/camera.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70777, "text": "You can use this function to take photos, videos, and upload avatars after turning on the camera/camera permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "After turning on the camera/camera permissions, this function is used to take photos, videos, and upload avatars."}
{"task": "rw_100.jsonl", "id": 70778, "text": "Camera/camera information is sensitive information. Rejecting to provide this information will only make you unable to take photos, videos and upload photos, but it does not affect other functions of your products normally.", "label": ["Permission Acquisition", "Important"], "rewrite": "Refusing to provide camera/camera information, it will only be impossible to take photos, videos and upload photos, but it does not affect other functions of your products normally."}
{"task": "rw_100.jsonl", "id": 70779, "text": "2. Function based on positioning information.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70780, "text": "In order to quickly identify/add/invite your friends around your location, you can choose to authorize music elements to call the location permissions in your device.", "label": ["Permission Acquisition", "Important"], "rewrite": "You can choose to call the location permissions in the device you use."}
{"task": "rw_100.jsonl", "id": 70781, "text": "When you turn on the device positioning function and use the relevant services provided by our position, we will obtain your general location information through the network, or obtain your precise location information through the IP address, GPS, and WLAN or base station routes that can provide relevant information.Essence", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "Obtain general location information through the network, or obtain your accurate location information through IP addresses, GPS, and WLAN or base stations."}
{"task": "rw_100.jsonl", "id": 70782, "text": "Precision location information is a sensitive information. Rejecting to provide this information only makes you unable to use location information, but it does not affect other functions of your product normally.", "label": ["Important", "First Party Collection Information"], "rewrite": "Refusing to provide accurate location information, it will not be able to use functions related to location information, but does not affect other functions."}
{"task": "rw_100.jsonl", "id": 70783, "text": "3. Friends function.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70784, "text": "In order to quickly identify/add/invite your telephone and email communication friends, you can choose to authorize the music element to call the communication recording authority and mailbox permissions in your device.", "label": ["Permission Acquisition", "Important"], "rewrite": "You can choose the authorization of the communication records and mailbox permissions in the device you use."}
{"task": "rw_100.jsonl", "id": 70785, "text": "The address book information is a sensitive information. Rejection of the information will only make you unable to use the function of the address book information, but it does not affect other functions of your product normally.", "label": ["Important", "First Party Collection Information"], "rewrite": "Refusing to provide address book information will not be able to use functions related to the address book information, but does not affect the normal use of other functions."}
{"task": "rw_100.jsonl", "id": 70786, "text": "4. Business card function.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70787, "text": "You can modify or supplement your avatar, nickname, gender, birthday, and regional information in my business card. This information belongs to your account information.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can modify or supplement your avatar, nickname, gender, birthday, regional information."}
{"task": "rw_100.jsonl", "id": 70788, "text": "You do not provide the above information that will not affect your online games.", "label": ["Important", "First Party Collection Information"], "rewrite": "You do not provide the above information that will not affect your online games."}
{"task": "rw_100.jsonl", "id": 70789, "text": "For personal information involved in this type of account information, the element will be strictly protected.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70790, "text": "5. Information release function.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70791, "text": "After you have registered as an elemental user, you can publish community topics in the community and comment on other user community content.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70792, "text": "In the process, we will collect your equipment information, browser types, and log information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Will collect your equipment information, browser type, log information."}
{"task": "rw_100.jsonl", "id": 70793, "text": "6. Payment function.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70794, "text": "You can obtain music element products and/or service -related virtual products, including game coins and game props by paying for music elements.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70795, "text": "Please note that the payment function will be provided to you by a third -party payment institution that cooperates with us.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70796, "text": "Third -party payment institutions may need to collect your name, bank card type and card number, validity period and mobile phone number.", "label": ["Important", "First Party Collection Information"], "rewrite": "You need to collect your name, bank card type and card number, validity period and mobile phone number."}
{"task": "rw_100.jsonl", "id": 70797, "text": "The bank card number, validity period, and mobile phone number are personal sensitive information. This information is an information necessary for payment functions. It refuses to provide normal use that will cause you to unable to use this function, but does not affect other functions.", "label": ["Important", "First Party Collection Information"], "rewrite": "Refusing to provide bank card numbers, validity periods and mobile phone numbers will cause you to be unable to use the payment function, but does not affect other functions."}
{"task": "rw_100.jsonl", "id": 70798, "text": "Le Element does not obtain payment accounts and password information related to your payment.", "label": ["Important", "First Party Collection Information"], "rewrite": "Do not obtain payment accounts and password information related to you."}
{"task": "rw_100.jsonl", "id": 70799, "text": "After your successful payment, the Element Element will only obtain the verification information of the results you have completed the payment from the third -party payment service provider, and then provide you with the corresponding virtual products.", "label": ["Important", "First Party Collection Information"], "rewrite": "Will obtain the verification information of the results you have completed the payment from the third -party payment service provider."}
{"task": "rw_100.jsonl", "id": 70800, "text": "If you want to understand the specific rules of third -party service providers to collect personal information, please refer to the privacy policy of the third -party payment service provider you choose.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70801, "text": "To show you the transaction information of the account and ensure the security of the transaction, we will collect the information you generate in the process of using our service (including the goods or service information, specific order number, order creation time, transaction amount) for your purchases forShow you and facilitate your management of orders.", "label": ["Important", "First Party Collection Information"], "rewrite": "The information generated during the service process (including the goods or service information you purchased, the specific order number, the order of order creation, and the transaction amount) are used to display and manage orders."}
{"task": "rw_100.jsonl", "id": 70802, "text": "7. Personality services based on telephone management.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70803, "text": "When you turn on the power management authority of the device, we may check and read the number of your device that is dialing and suspend the call information, so that you can determine whether you need to mute the audio in the client to ensure the call function.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "When you turn on the device phone management authority, you will view and read the number of your device being dial and the information about the call."}
{"task": "rw_100.jsonl", "id": 70804, "text": "Please know that even if you have agreed to start the management phone authority, we will only read your number information when you actively use the client's inner voice function.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "Even if you have agreed to start the management phone authority, you will only read your number information when you actively use the client's internal voice function."}
{"task": "rw_100.jsonl", "id": 70805, "text": "This information is a sensitive information, and refusal to provide this information will only make you unable to use audio in the client for mute processing related functions.", "label": ["Important", "First Party Collection Information"], "rewrite": "Refusing to provide this information will only make the audio in the client for mute processing related functions."}
{"task": "rw_100.jsonl", "id": 70806, "text": "8. Suspension window function.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70807, "text": "To help you use our products and services at the same time when using other applications, we will obtain the authority of suspended windows so that our products are displayed above other applications.", "label": ["Permission Acquisition", "Important"], "rewrite": "The authority of the suspension window will be obtained so that our products are displayed above other applications."}
{"task": "rw_100.jsonl", "id": 70808, "text": "9. Safety guarantee function.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70809, "text": "In order to improve the security of your services to provide services with our affiliated companies and partners, protect the security of personal property of you or other users or the public, and better prevent fishing websites, fraud, network vulnerabilities, computer viruses, and cyber attacks, Internet intrusion risks, we will collect the necessary information to achieve security guarantee functions.", "label": ["Important", "First Party Collection Information"], "rewrite": "It will collect the necessary information to realize the security guarantee function."}
{"task": "rw_100.jsonl", "id": 70810, "text": "We may use or integrate your account information, transaction information, equipment information, service log information, and our related companies and partners to obtain information on your authorization or sharing according to law to comprehensively judge your account transaction risk, identity verification, testing, and testing and testing and testingPrevent safety events and take necessary records, audit, analysis, and disposal measures.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "It may use or integrate account information, transaction information, equipment information, service log information, and related companies and partners to obtain authorization or information shared according to law."}
{"task": "rw_100.jsonl", "id": 70811, "text": "(1) In order to ensure the safe operation of software and services, we will collect the equipment attribute information of your end user [SDK version, device manufacturer, equipment model, equipment language, equipment name, application list information, hardware serial number, operating system system, operating system systemAnd application version and type, language settings, resolution, IP address, GPS location, system platform, system version, application package name and version, front and rear time for applicationEquipment information, battery usage], network access methods and types, status, network quality data, operation logs, including information.", "label": ["Important", "First Party Collection Information"], "rewrite": "GPS location, system platform, system version, application package name and version, application time before and after application, independent device logo, iOS advertising identifier (IDFA), network card (MAC) address, international mobile device recognition code (IMEI), anonymous device logoInformation including quality data and operation logs."}
{"task": "rw_100.jsonl", "id": 70812, "text": "Application source.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect application information or process information that is running, the overall operation of the application, the use of usage and frequency, the application collapse, the overall installation usage, performance data, and the source of application."}
{"task": "rw_100.jsonl", "id": 70813, "text": "(3) We may use your account information, transaction information, equipment information, service log information, as well as the information that our affiliated parties and partners are obtained or shared according to law to judge the security of the account, conduct authentication, test and test, andPrevent security incidents.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Use your account information, transaction information, equipment information, service log information, and information that our affiliates and partners are authorized or shared according to law to judge account security."}
{"task": "rw_100.jsonl", "id": 70814, "text": "10. Personalized recommendation function.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70815, "text": "We will analyze your preferences, habits, location or user portraits based on the collected information, or user portraits in order to provide you with more suitable customized services: (1) to show you, recommend or push a higher degree of correlation with youInformation;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We will analyze your preferences, habits, location or user portraits based on the collected information to provide more suitable customized services."}
{"task": "rw_100.jsonl", "id": 70816, "text": "(2) Recommend to you with a higher degree of programmatic advertisements with you.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Recommend to you with a higher degree of programmatic advertisements with you."}
{"task": "rw_100.jsonl", "id": 70817, "text": "Log information and personal location information (of which accurate positioning information is personal sensitive information).", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your device information (including hardware models, operating system versions, device settings, device MAC addresses, IMEI, IDFA, OAID, IMSI, necessary software lists, equipment environment software and hardware feature information), log information, personal location information (of whichAccurate positioning information is personal sensitive information)."}
{"task": "rw_100.jsonl", "id": 70818, "text": "Unless you obtain your authorization or laws and regulations, we will not combine the above information with any personal identity information you provided in the application to ensure that you do not recognize your individual.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70819, "text": "We may combine the above information with other non -identity information collected from our service, and use the program algorithm to analyze and prefer analysis, and use the characteristic label to perform indirect crowd portraits to use it to refer, display or push you may be interested in you may be interested in.Or more suitable for your specific functions or services.", "label": ["Important", "Usage"], "rewrite": "Combining the above information with other non -identity information, the characteristic and preference analysis through the program algorithm, and the indirect portrait portrait based on the characteristic label."}
{"task": "rw_100.jsonl", "id": 70820, "text": "Rejecting the above information will make you unable to use personalized recommendation functions, but it does not affect your normal experience.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Rejecting the above information will make you unable to use personalized recommendation functions, but it does not affect your normal experience."}
{"task": "rw_100.jsonl", "id": 70821, "text": "You can also turn off the personalized recommendation function at any time.", "label": ["Important", "Edit/Control"], "rewrite": "You can close the personalized recommendation function at any time."}
{"task": "rw_100.jsonl", "id": 70822, "text": "Management of personalized recommendations:", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70823, "text": "(1) You can choose to close or open a receiving personalized recommendation through [Settings → Personalized Recommendation].", "label": ["Important", "Edit/Control"], "rewrite": "You can choose to close or open the receiving personalized recommendation through [Settings → Personalized Recommendation]."}
{"task": "rw_100.jsonl", "id": 70824, "text": "When you turn off, we no longer show you, recommend or push to you a gift package and new game display that meets your personalized needs.", "label": ["Important", "Edit/Control"], "rewrite": "After closing personalized recommendations, we will no longer show you and recommended gift packages and new game display."}
{"task": "rw_100.jsonl", "id": 70825, "text": "(2) You can choose to close or open a personalized advertisement through [Settings → Smart Advertising].", "label": ["Edit/Control", "Important"], "rewrite": "You can choose to close or open a personalized advertisement through [Settings → Smart Advertising]."}
{"task": "rw_100.jsonl", "id": 70826, "text": "When you close, you no longer receive such personalized advertisements, but you will still see advertisements, the number of advertisements will not change, but the correlation of advertising will be reduced.", "label": ["Important", "Edit/Control"], "rewrite": "When you close smart advertisements, you will no longer receive such personalized advertisements, but you will still see advertisements. The number will not change but the correlation of advertising will be reduced."}
{"task": "rw_100.jsonl", "id": 70827, "text": "Le element may cooperate with third -party service providers to access third -party services (including advertising, links, or other forms of promotion content) in Le elemental products and/or services.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70828, "text": "You will not provide you with your personal information (such as mobile phone numbers, nicknames, avatars, and friends lists) collected to Lexin or Le Element.Personal information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Le Element will not share personal information with third -party service providers, nor will it collect personal information on behalf of third -party service providers."}
{"task": "rw_100.jsonl", "id": 70829, "text": "Third -party service providers through music element products and/or service access may have their own privacy policies, and they are not subject to the \"Privacy Policy\".", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70830, "text": "Third -party service providers may collect personal information required to provide you with their own privacy policy.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70831, "text": "Le Element will do everything in business and reasonable efforts to require third -party service providers to comply with relevant laws and regulations when dealing with your personal information, and try their best to take relevant confidentiality and security measures, but the music element cannot guarantee that it will definitely take according to our requirements to adopt our requirements.Corresponding measures.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70832, "text": "11. Step number of function.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70833, "text": "When you use our step -by -step function, we will also collect your fitness sports information to determine your step information and participate in the number of steps. This information is a personal sensitive information. You can close the function of fitness exercise authorityStop our collection of your step information at any time.", "label": ["Important", "First Party Collection Information"], "rewrite": "Will collect your fitness sports information, you can close the function of fitness exercise authority to stop our collection of fitness sports information."}
{"task": "rw_100.jsonl", "id": 70834, "text": "Please pay special attention, if you turn off this function or reject us to collect your step information, it will cause you to be unable to use the above features normally.", "label": ["Important", "First Party Collection Information"], "rewrite": "Closing the function of fitness exercise authority or refusing to collect your step information will cause you to be unable to use the above functions normally."}
{"task": "rw_100.jsonl", "id": 70835, "text": "12. Customer service.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70836, "text": "When you make a complaint, appeal or consult us, in order to contact you or help you solve the problem, we may need you to provide your name, mobile phone number, and email.", "label": ["Important", "First Party Collection Information"], "rewrite": "You may need to collect names, mobile phone numbers, and e -mail."}
{"task": "rw_100.jsonl", "id": 70837, "text": "If you refuse to provide the above information, we may not be able to feedback complaints, appeals or consult results in time.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide name, mobile phone number, and email, you may not be able to feedback the complaints, appeals or consultation results in time."}
{"task": "rw_100.jsonl", "id": 70838, "text": "13. Clipboard function.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70839, "text": "In the process of entering the product client, using the identification gift package code, sharing activity passwords, or copying and sharing the cricket number to add a friend, in order to ensure that you can quickly perform the corresponding operation, we will read your clipboard.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will read your clipboard."}
{"task": "rw_100.jsonl", "id": 70840, "text": "We will not collect your clipboard behavior and will not upload the aforementioned information to our server.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will not collect your clipboard behavior and will not upload the aforementioned information to our server."}
{"task": "rw_100.jsonl", "id": 70841, "text": "Please rest assured that we will not store other information about your clipboard, and the separate clipboard information cannot identify your specific identity.", "label": ["Data Retention", "Important"], "rewrite": "We will not store other information about your clipboard, and the separate clipboard information cannot identify your specific identity."}
{"task": "rw_100.jsonl", "id": 70842, "text": "14. You understand and agree that some single services may require you to open specific access rights in your device to achieve the collection and use of information involved in these permissions:", "label": ["Permission Acquisition", "Important"], "rewrite": "Some single services may need to open a specific access permissions to achieve the collection and use of information involved in these permissions."}
{"task": "rw_100.jsonl", "id": 70843, "text": "(1) After you turn on the communication record of the communication, we can get your telephone, mail communication records of friends, in order to provide you with a friend status query, invite your friends to use happy elements services, share content/product you know people you know, and share content/products you know.Function.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "Collect your telephone and mail communication information."}
{"task": "rw_100.jsonl", "id": 70844, "text": "To help your application add a associated account, we will obtain the account permissions created by the apps installed on the device.", "label": ["Permission Acquisition", "Important"], "rewrite": "We will obtain an account permissions created by the installed application on the device."}
{"task": "rw_100.jsonl", "id": 70845, "text": "Please rest assured that this permissions only obtain the application related information and cannot obtain your account password personal sensitive information.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "This permission only obtains the application related information and cannot obtain your account password."}
{"task": "rw_100.jsonl", "id": 70846, "text": "(2) After you install other application permissions in the application, you allow us to download other applications in our products.", "label": ["Permission Acquisition", "Important"], "rewrite": "After installing other application permissions, you allow us to download other applications in the product."}
{"task": "rw_100.jsonl", "id": 70847, "text": "(3) After you turn on the storage authority, you allow us to access, read, modify or delete your storage space so that you can download, save, modify, delete photos, media content and documents on the memory card, or pass through, or pass through, or pass throughCaches to achieve the corresponding service function.", "label": ["Permission Acquisition", "Important"], "rewrite": "After opening the storage authority, you allow us to access, read, modify or delete your storage space."}
{"task": "rw_100.jsonl", "id": 70848, "text": "(4) After you open the position permissions, we can get your location information so that you can interact with your information with nearby friends or push you personalized content to you.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "After opening the position permissions, we can get your location information."}
{"task": "rw_100.jsonl", "id": 70849, "text": "(5) After you turn on the album and/or camera (camera) permissions, you can upload and take photos/pictures/videos to realize upload information or communicate with customer service to provide proof functions.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "After opening the album and/or camera (camera) permissions, you can upload and take photos/pictures/videos."}
{"task": "rw_100.jsonl", "id": 70850, "text": "(6) After you turn on the phone permission, you allow us to view and read the number of your device being dialing and stop calling information in order to determine whether the audio in the client is mute processing to ensure the call function.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "After opening the phone permissions, allow us to view and read the number of your device being dial and the information about the call."}
{"task": "rw_100.jsonl", "id": 70851, "text": "(7) After you turn on the equipment information permissions, you allow us to obtain your device information as the unique identification of your device to provide you with pages to display and recommend personalized content in accordance with your needs, understand product adaptability, understand product adaptability, Identify the network and operation security of the abnormal state and ensure the network and operation of music element services.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "After opening the equipment information permissions, it allows us to obtain your device information as the unique identification of your device."}
{"task": "rw_100.jsonl", "id": 70852, "text": "(8) After you turn on the modification system settings, you allow our application to modify your system settings.", "label": ["Permission Acquisition", "Important"], "rewrite": "After turning on the modification system settings, you allow our application to modify your system settings."}
{"task": "rw_100.jsonl", "id": 70853, "text": "When you need to close these functional authority, most mobile devices will support your needs. For specific methods, please refer to or contact your mobile device service providers or manufacturers.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70854, "text": "Please note that when you start the right of power, it means that you authorize us to collect and use relevant information to provide you with corresponding services. Once you turn off the right of authority, it means that you cancel the authorization.Using relevant information, it is impossible to provide you with the service corresponding to the permissions.", "label": ["Edit/Control", "Important"], "rewrite": "Opening one authority means that the authorization can collect and use relevant information. Once you turn off the right, you can cancel the authorization."}
{"task": "rw_100.jsonl", "id": 70855, "text": "However, your decision to close permissions will not affect the collection and use of information based on your authorization.", "label": ["Important", "First Party Collection Information", "Edit/Control"], "rewrite": "Close authority will not affect the collection and use of information based on authorization."}
{"task": "rw_100.jsonl", "id": 70856, "text": "(3) Information from third parties", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70857, "text": "1. You can also log in to our platform with a third -party account (such as WeChat, QQ, Weibo).", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70858, "text": "At this time, you can choose to authorize us to read the public information (username, nickname, avatar) that you register, publish and record on the third -party platform on the premise of comply with relevant laws and regulations.", "label": ["Permission Acquisition", "Important", "Edit/Control"], "rewrite": "You can choose to authorize us to read the public information (user name, nickname, avatar) registered, published, and recorded on this third -party platform."}
{"task": "rw_100.jsonl", "id": 70859, "text": "We can still ask you to add for personal information that we ask but cannot provide third parties.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70860, "text": "We may obtain your above information from a third party to remember your login status as our user so that we can provide you with better product services.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70861, "text": "You can choose to authorize the scope of personal information we can get when logging in to our platform with a third -party account.", "label": ["Edit/Control", "Important"], "rewrite": "When logging in to our platform with a third -party account, you can choose to authorize the scope of the personal information we can get."}
{"task": "rw_100.jsonl", "id": 70862, "text": "But please note that if you stop certain permissions, you may not be able to enjoy the best service experience, and certain services may not be used normally.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "If certain permissions are stopped, certain services may not be used normally."}
{"task": "rw_100.jsonl", "id": 70863, "text": "Please read the user agreement or privacy policy of the third -party partner service.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70864, "text": "2. The information shared by other users contains your information.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70865, "text": "(4) Sensitive information", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70866, "text": "Before providing us with any personal information that belongs to sensitive information, please clearly consider that it is appropriate and agree that your personal sensitive information can be processed in accordance with the goals and methods described in this policy.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70867, "text": "We will collect and use your sensitive information after getting your consent to achieve functions related to our business, and allow you to make a choice that disagree with the collection and use of these sensitive information, but refusing to use this information will affect you will affect youUse related functions.", "label": ["Important", "First Party Collection Information", "Edit/Control"], "rewrite": "After getting your consent, collect and use your sensitive information to achieve functions related to our business.Refusing to use this information will affect your related functions."}
{"task": "rw_100.jsonl", "id": 70868, "text": "(5) Exception of obtaining authorization consent", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70869, "text": "In the following circumstances, we can collect and use some necessary personal information without signing your authorization consent:", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "In the following circumstances, you can collect and use some necessary personal information without signing your authorization consent:"}
{"task": "rw_100.jsonl", "id": 70870, "text": "1. Directly related to national security and national defense security;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting personal information directly related to national security and national defense security does not need to solicit consent."}
{"task": "rw_100.jsonl", "id": 70871, "text": "2. Directly related to public safety, public health, and major public interests;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect personal information directly related to public safety, public health, and major public interests without soliciting consent."}
{"task": "rw_100.jsonl", "id": 70872, "text": "3. It is directly related to the execution of criminal investigation, prosecution, trial and judgment;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect direct personal information with criminal investigation, prosecution, trial, and judgment."}
{"task": "rw_100.jsonl", "id": 70873, "text": "4. For the major legitimate rights and interests of the lives and property of you or other individuals, it is difficult to get my consent;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting and maintaining major legitimate rights and interests but difficult to get personal information that I agree, without asking for consent."}
{"task": "rw_100.jsonl", "id": 70874, "text": "5. The personal information you collected is publicly disclosed to the public by yourself;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "The collected personal information is made to the public by itself without asking for consent."}
{"task": "rw_100.jsonl", "id": 70875, "text": "6. Collect your personal information from the information disclosed by legal and publicly disclosed, such as from legal news reports, government information disclosure channels;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "The personal information collected from the legal disclosure information does not need to ask for consent."}
{"task": "rw_100.jsonl", "id": 70876, "text": "7. Signing and fulfilling the contract according to your requirements;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting the personal information necessary for the signing and performing the contract without soliciting consent."}
{"task": "rw_100.jsonl", "id": 70877, "text": "8. The necessary and stable operation for maintaining our products and/or services, including the failure of discovering and disposing of products or services;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting the personal information necessary for safe and stable operations used to maintain our products and/or services without soliciting consent."}
{"task": "rw_100.jsonl", "id": 70878, "text": "9. It is necessary for legal news reports;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting the personal information necessary for legal news reports does not need to solicit consent."}
{"task": "rw_100.jsonl", "id": 70879, "text": "10. Academic research institutions are necessary to carry out statistics or academic research in accordance with public interests, and to provide academic research or description results, identify the personal information contained in the results;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting academic research institutions to carry out statistics or academic research in the institute based on public interests, without asking for consent."}
{"task": "rw_100.jsonl", "id": 70880, "text": "11. Other circumstances stipulated in laws and regulations.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect personal information under other circumstances stipulated in the laws and regulations without asking for consent."}
{"task": "rw_100.jsonl", "id": 70881, "text": "If we stop operating our products or services, we will stop collecting your personal information activities in time. The notice of stopping operations will be notified in the form of one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one serviceRelated personal information is deleted or anonymous.", "label": ["Important", "Cessation of Operations"], "rewrite": "If the operation is stopped, it will stop collecting personal information in time and notify you, and delete or processes personal information."}
{"task": "rw_100.jsonl", "id": 70882, "text": "2. How do we use cookie or similar technology", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70883, "text": "When you use our services, we will store named small data files on your computer or mobile devices. These data files may be other local storage provided by Cookie, Flash, Cookie, your browser or related applications (collectively referred to as\"Cookie\").", "label": ["Important", "First Party Collection Information"], "rewrite": "We will store small data files on your computer or mobile device, which may be Cookie and Flash Cookie."}
{"task": "rw_100.jsonl", "id": 70884, "text": "Cookie usually contains identifiers, site names, and some numbers and characters.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70885, "text": "If you don't want personal information to be saved in, cookies, you can configure the browser, choose disable, cookie, function.", "label": ["Important", "Edit/Control"], "rewrite": "You can configure the browser and select the cookie function."}
{"task": "rw_100.jsonl", "id": 70886, "text": "After the disable, cookie, after the function, it may affect your access to our platform or not to fully obtain the services we provide.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "After disable the cookie function, it may affect access platforms or cannot fully obtain services."}
{"task": "rw_100.jsonl", "id": 70887, "text": "We will not use Cookie for any purpose outside the purpose of this policy.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70888, "text": "We use cookies and similar technologies to achieve the following functions or services:", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70889, "text": "1. Ensure the safety and efficient operation of products and services", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70890, "text": "We may set up Cookie or anonymous identifiers that guarantee security and ensure security, so that we can confirm whether you log in to the service safely, or whether you encounter stolen, fraud and other illegal acts.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70891, "text": "These technologies also help us improve service efficiency, improve login and response speed.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70892, "text": "2. Help you get a easier access experience", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70893, "text": "Using this kind of technology can determine whether you have logged in to help you save the steps and processes of your personal information.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70894, "text": "3. COOKIE clearing", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70895, "text": "Most browsers provide users with the function of removing browser cache data. You can perform the corresponding data clearance operation in the browser settings function.", "label": ["Edit/Control", "Important"], "rewrite": "The corresponding data clearance operation can be performed in the browser settings function."}
{"task": "rw_100.jsonl", "id": 70896, "text": "If you remove it, you may not be able to use the services or corresponding functions that we depend on Cookie.", "label": ["Important", "Edit/Control"], "rewrite": "If it is cleared, it may not be unable to use the service or corresponding functions that we depend on Cookie."}
{"task": "rw_100.jsonl", "id": 70897, "text": "3. How can we share, transfer, and publicly disclose personal information", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70898, "text": "(1) Sharing", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70899, "text": "We have a confidential obligation to your information and will not sell or sell any information about you, except the following situations: except:", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "We have a confidential obligation to your information and will not sell or sell any information about you, except the following situations: except:"}
{"task": "rw_100.jsonl", "id": 70900, "text": "1. Sharing in statutory situations: We may share your personal information to the outside world in accordance with the requirements of laws and regulations, litigation, and disputes, or in accordance with the requirements of administrative and judicial organs in accordance with the requirements of the law.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "We may resolve your personal information to the outside world in accordance with laws and regulations, litigation, and disputes."}
{"task": "rw_100.jsonl", "id": 70901, "text": "2. Shared with clear consent: After getting your clear consent, we will share your personal information with other parties.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "After getting your clear consent, we will share your personal information with other parties."}
{"task": "rw_100.jsonl", "id": 70902, "text": "3. In the scope of legal requirements or permits, it is necessary to provide your personal information to third parties in order to protect the interests of music elements and the interests of music elements or the public.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "It is necessary to provide your personal information to third parties to protect the interests of music elements or the public's interests, property or security."}
{"task": "rw_100.jsonl", "id": 70903, "text": "4. Sharing with affiliated companies: In order to facilitate us to provide you with products or services based on platform accounts, recommend information that you may be interested in, identify our account abnormal, your personal information may be with our affiliated company and/or its specified designated designated companySpecial service providers sharing.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Your personal information may be shared with our affiliated companies and/or its designated service providers."}
{"task": "rw_100.jsonl", "id": 70904, "text": "We will only share the necessary personal information and be restricted by the purpose declared in this privacy policy. If we share your personal sensitive information or related companies to change the purpose of personal information, we will solicit your authorization consent again.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "It will only share the necessary personal information. If we share your personal sensitive information or the purpose of changing personal information, we will solicit your authorization consent again."}
{"task": "rw_100.jsonl", "id": 70905, "text": "5. Shared with authorized partners: In order to provide you with more complete and high -quality products and services, we may entrust to authorize partners or use third -party SDK related technologies to provide you with services or represent us to perform functions.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may entrust our partners or use third -party SDK related technologies to provide you with services."}
{"task": "rw_100.jsonl", "id": 70906, "text": "We will only share your information for the legal, correct, necessary, specific, and clear goals of this privacy policy statement. Partners can only expose the information required by their duties, and this information must not be used for any other purposes.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will only share your information for the legal, correct, necessary, specific, and clear goals of this privacy policy statement."}
{"task": "rw_100.jsonl", "id": 70907, "text": "At present, our authorization information includes the following:", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70908, "text": "(1) Realize the sharing information of functions or services", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70909, "text": "A. The functions provided by our affiliated parties, third parties in our products or services, or when software service providers, smart device providers, system service providers are united with us to provide you with services with usThe information required by the business will be shared with these related parties and third parties. It is used for comprehensive statistics and analyzes the characteristics and preferences through algorithms to form a portrait of indirect crowds to recommend, display or push the information you may be interested in, Or push more suitable for your business advertisement.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "The information necessary for the realization of the business with related parties and third parties will be used for the analysis of characteristics and preferences to achieve personalized recommendations."}
{"task": "rw_100.jsonl", "id": 70910, "text": "WLAN access point and base station sensor information.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "When using geographical location -related services, we will share the location information with the location service provider through SDK or related technologies to reflect the location results."}
{"task": "rw_100.jsonl", "id": 70911, "text": "GPS information is a personal sensitive information. It refuses to provide normal use that will only affect geographical location service functions, but does not affect other functions.", "label": ["Important", "First Party Collection Information"], "rewrite": "Refusing to provide GPS information only affects geographical location service functions, but does not affect the use of other functions."}
{"task": "rw_100.jsonl", "id": 70912, "text": "c. Payment function: The payment function is provided to you by a third -party payment institution that cooperates with us.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70913, "text": "Third -party payment institutions may need to collect your name, bank card type and card number, validity period and mobile phone number.", "label": ["Important", "First Party Collection Information"], "rewrite": "Third -party payment institutions may need to collect your name, bank card type and card number, validity period and mobile phone number."}
{"task": "rw_100.jsonl", "id": 70914, "text": "The bank card number, validity period, and mobile phone number are personal sensitive information. This information is an information necessary for payment functions. It refuses to provide normal use that will cause you to unable to use this function, but does not affect other functions.", "label": ["Important", "First Party Collection Information"], "rewrite": "The refusal to provide the bank card number, validity period and mobile phone number will cause the payment function to be unavailable, but does not affect the use of other functions."}
{"task": "rw_100.jsonl", "id": 70915, "text": "d. In order to adapt the message push function with the terminal model you use, we may shared mobile phone models, versions and related device information through SDK technology and terminal equipment manufacturers (Meizu, Huawei, OPPO, vivo, Xiaomi, Samsung)Please refer to the privacy policy or related statement of the SDK operator.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "In order to adapt the message push function with the terminal model you use, you may share mobile phone models, versions and related equipment information through SDK technology and terminal equipment manufacturers."}
{"task": "rw_100.jsonl", "id": 70916, "text": "(2) Realizing advertising -related shared information", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70917, "text": "a. Advertising push: We may share with our partners who entrust us to promote and advertising.Improve the effective touch rate of advertising under the premise of identity.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "May share with partners to identify indirect portrait labels and device information and anonymous browsing records that can be identified by your personal identity."}
{"task": "rw_100.jsonl", "id": 70918, "text": "b. Advertising statistics: We may share the analysis of device information or statistical information with business service providers, suppliers and other partners. This information is difficult or unable to associate with your true identity.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "It may be shared with partners to share with the identified device information or statistical information, which is difficult or unable to associate with your true identity."}
{"task": "rw_100.jsonl", "id": 70919, "text": "This information will help us analyze and measure the effectiveness of advertising and related services.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70920, "text": "(3) Sharing information of safety and analysis statistics", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70921, "text": "a. Guarantee use of security: We attach great importance to accounts, services and content security. In order to ensure the security of your and other users' accounts and property security, so that you and our legitimate rights and interests are exempted from illegal infringement.It will share the necessary equipment information, the relevant information, log information, application information, or process information that is running, the overall operation of the application, the frequency of use, the application of the application, the overall installation of usage, the performance data, the source of application sourcesEssence", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share the necessary device information, the location of the device where the equipment is located, log information, application information or process information, the overall operation of the application, the frequency of application, the application crash, the overall location, the overall location, the overall information, the overall information, the overall information, the overall information, the overallInstall use, performance data, and application sources."}
{"task": "rw_100.jsonl", "id": 70922, "text": "b. Analysis of product usage: In order to analyze the usage of our services and enhance the experience of user use, the statistical data of the use of products (collapse, flashing) with related parties or third parties may beCombine your personal identity.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The statistical data of the use of the affiliated parts or third -party shared products (collapse and flashback) may be difficult to identify your personal identity with other information."}
{"task": "rw_100.jsonl", "id": 70923, "text": "c. Academic research and scientific research: In order to improve the scientific research capabilities in related fields and promote the level of scientific and technological development, we may share with scientific research institutes and university institutions on the premise of ensuring that data security and purpose are properly.Essence", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Under the premise of ensuring data security and purpose, we may share with scientific research institutes and universities institutions that identify or anonymous data."}
{"task": "rw_100.jsonl", "id": 70924, "text": "(4) Help you participate in marketing promotion activities", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70925, "text": "When you choose to participate in the relevant marketing activities organized by us and our affiliates or third parties, you may need to provide you with name, communication address, contact information, and bank account information.", "label": ["Important", "First Party Collection Information"], "rewrite": "It will collect your name, communication address, contact information, and bank account information."}
{"task": "rw_100.jsonl", "id": 70926, "text": "This information is personal sensitive information. It refuses to provide may affect your participation in related activities, but it will not affect other functions.", "label": ["Important", "First Party Collection Information"], "rewrite": "Refusing to provide relevant information may affect your participation in related activities, but it will not affect other functions."}
{"task": "rw_100.jsonl", "id": 70927, "text": "Only after your consent can we share this information with related parties or third parties to ensure that you get consistent services in the joint event, or entrust a third party to reward you in time.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Only after your consent can this information share with related parties or third parties."}
{"task": "rw_100.jsonl", "id": 70928, "text": "Please understand that we will strictly test the development packages of partners or software tools obtaining information to protect data security.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will strictly test the development packages of partners or software tools to obtain information to protect data security."}
{"task": "rw_100.jsonl", "id": 70929, "text": "If you use the services provided by a third party on our platform, you agree that it will directly collect and process your information (such as embedding code and plug -in).", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "When using the service provided by a third party, it will directly collect and process your information (such as embedded code and plug -in)."}
{"task": "rw_100.jsonl", "id": 70930, "text": "We will choose third -party and third -party services, urge relevant third parties to collect and use your personal information in accordance with this guideline or the agreement reached with you, and take appropriate security technology and management measures to ensure your personal information security.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Supervise the relevant third parties to collect and use personal information in accordance with this guideline or agreed, and take appropriate security technology and management measures to ensure your personal information security."}
{"task": "rw_100.jsonl", "id": 70931, "text": "For the specific situation of third -party information sharing, please refer to the \"Happy List of Third -Party Information Sharing\".", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For the specific situation of third -party information sharing, please refer to the \"Happy List of Third -Party Information Sharing\"."}
{"task": "rw_100.jsonl", "id": 70932, "text": "(2) Transfer", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70933, "text": "We will not transfer your personal information to any company, organization and individual, except the following situations: except:", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "We will not transfer your personal information to any company, organization and individual, except the following situations: except:"}
{"task": "rw_100.jsonl", "id": 70934, "text": "1. In the case of obtaining clear consent: After getting your clear consent, we will transfer your personal information to other parties;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "After getting your clear consent, we will transfer your personal information to other parties."}
{"task": "rw_100.jsonl", "id": 70935, "text": "2. When involving mergers, acquisitions or bankruptcy liquidation: If personal information is transferred, we will ask new companies that hold your personal information and organizations to continue to be subject to this privacy policy.Solving your authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "When involving mergers, acquisitions, or bankruptcy liquidation, if personal information transfer is involved, new companies and organizations will be required to continue to be subject to this privacy policy, otherwise the company and organization will be required to re -solicit authorization consent."}
{"task": "rw_100.jsonl", "id": 70936, "text": "(3) Public disclosure", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70937, "text": "We will only disclose your personal information only under the following circumstances and adopt the premise that the security protection measures that meet the laws and industry standards:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only disclose your personal information only under the following circumstances and adopt the premise that the security protection measures that meet the laws and industry standards:"}
{"task": "rw_100.jsonl", "id": 70938, "text": "1. Get your clear consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Get your clear consent and disclose personal information."}
{"task": "rw_100.jsonl", "id": 70939, "text": "2. Based on laws and regulations, legal procedures, lawsuits or mandatory requirements for government authorities, or seriously violate our relevant agreements and rules, or to protect the safety of personal property of users or the publicDiscover your personal information about your consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may disclose personal information about you in accordance with laws and regulations or obtaining your consent."}
{"task": "rw_100.jsonl", "id": 70940, "text": "But we guarantee that when we receive a request for the above disclosure information, we must request a corresponding legal document when we receive a request for the above disclosure information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When we receive a request for the above disclosure information, we ask we must issue corresponding legal documents."}
{"task": "rw_100.jsonl", "id": 70941, "text": "(4) Sharing, transfer, and public disclosure of disclosure of personal information.", "label": ["Third Party Sharing/ Disclosure", "Risk"], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70942, "text": "In the following circumstances, sharing, transfer, and publicly disclose your personal information without obtaining your authorization consent in advance:", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "In the following circumstances, sharing, transfer, and publicly disclose your personal information without obtaining your authorization consent in advance:"}
{"task": "rw_100.jsonl", "id": 70943, "text": "1. It is related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Personal information related to sharing, transfer, and disclosure of national security and national defense security does not need to solicit consent."}
{"task": "rw_100.jsonl", "id": 70944, "text": "2. Related to public safety, public health, and major public interests;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Personal information related to sharing, transfer, and disclosure related to public safety, public health, and major public interests does not need to solicit consent."}
{"task": "rw_100.jsonl", "id": 70945, "text": "3. It is related to criminal investigation, prosecution, trial, and judgment execution of justice or administrative law enforcement;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Sharing, transfer, disclosure of personal information related to judicial or administrative law enforcement related to judicial or administrative law enforcement, no consent is required."}
{"task": "rw_100.jsonl", "id": 70946, "text": "4. For the major legitimate rights and interests of the lives and property of you or other individuals, it is difficult to get my consent;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Sharing, transfer, and disclose major legitimate rights and interests, but it is difficult to get personal information that I agree, without asking for consent."}
{"task": "rw_100.jsonl", "id": 70947, "text": "5. Personal information that you disclose to the public by yourself;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "You do not need to solicit your own personal information to the public yourself."}
{"task": "rw_100.jsonl", "id": 70948, "text": "6. Collect personal information from the legal publicly disclosed information, such as legal news reports and government information disclosure channels;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "If you collect personal information from the legal disclosure information, you do not need to ask for consent."}
{"task": "rw_100.jsonl", "id": 70949, "text": "7. When academic research institutions need to carry out statistics or academic research based on public interests, and provide the results of academic research or description, the personal information contained in the results is identified by", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Sharing, transfer, and disclosure of academic research institutions to carry out statistics or personal information necessary for the institute based on public interests, and do not need to solicit consent."}
{"task": "rw_100.jsonl", "id": 70950, "text": "8. Other circumstances stipulated in laws and regulations.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "In other circumstances stipulated in laws and regulations, no consent is required."}
{"task": "rw_100.jsonl", "id": 70951, "text": "Please be informed that if we take technical measures and other necessary measures to process personal information, so that the data recipient cannot re-identify a specific individual and cannot recover, the sharing, transfer, and public disclosure of such processed data do not need to notify you separately and With your consent.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "If the data recipient cannot re-identify a specific individual and cannot restore it, the sharing, transfer, and public disclosure of such processed data does not require further notice and consent."}
{"task": "rw_100.jsonl", "id": 70952, "text": "4. How do we store personal information", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70953, "text": "The personal information we collect and generate within the territory of the People's Republic of China will be stored in the territory of the People's Republic of China, and your personal information will not be transferred across borders.", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in the people's Republic of China will be stored in the territory of the People's Republic of China without cross -border transmission of your personal information."}
{"task": "rw_100.jsonl", "id": 70954, "text": "If the transfer of personal information abroad is involved in the future, Le Elements will clearly inform you of the purpose, receiver, and security measures of the personal information, and obtain your consent separately.", "label": ["Data Retention", "Important"], "rewrite": "If the overseas transfer of personal information is involved in the future, we will clearly inform you of the purpose, receiver, and security measures of the personal information, and obtain consent separately."}
{"task": "rw_100.jsonl", "id": 70955, "text": "We will retain your personal information only during the period of providing us and service. We will retain relevant information during your not withdrawal, delete or cancel accounts.", "label": ["Data Retention", "Important"], "rewrite": "We only retain personal information during the necessary period, and when you have not withdrawn, delete or cancel accounts, we will retain relevant information."}
{"task": "rw_100.jsonl", "id": 70956, "text": "After the necessary period is exceeded, we will delete or anonymize your personal information, unless otherwise stipulated by laws and regulations.", "label": ["Data Retention", "Important"], "rewrite": "After exceeding the necessary period, you will delete or treat your personal information, except for other provisions of laws and regulations."}
{"task": "rw_100.jsonl", "id": 70957, "text": "But in the following circumstances, we may change the storage time of personal information due to the need to meet the legal requirements:", "label": ["Data Retention", "Important"], "rewrite": "However, in the following circumstances, the storage time of personal information may be changed due to legal requirements:"}
{"task": "rw_100.jsonl", "id": 70958, "text": "1. In order to comply with the applicable laws and regulations, including Article 21 of the \"Cyber Security Law of the People's Republic of China\", Article 21, paragraph 3, requires monitoring, recording the network operation status of the network, and technical measures for network security incidents.Six months;", "label": ["Data Retention", "Important"], "rewrite": "The surveillance and records of network operations of network operations and technical measures for network security incidents must not be reserved in less than six months."}
{"task": "rw_100.jsonl", "id": 70959, "text": "2. In order to comply with the court's judgment, ruling or other legal procedures;", "label": ["Data Retention", "Important"], "rewrite": "Storage times may be changed to comply with court judgments, orders or other legal proceedings."}
{"task": "rw_100.jsonl", "id": 70960, "text": "3. In order to comply with the requirements of government agencies or legal authorization organizations;", "label": ["Data Retention", "Important"], "rewrite": "The storage period is changed to comply with the requirements of government authorities or legally authorized organizations."}
{"task": "rw_100.jsonl", "id": 70961, "text": "4. In order to implement the platform agreement or this policy, and to safeguard the public interests of the society, and protect the personal safety or other legitimate rights and interests of our affiliated companies, other users or employees.", "label": ["Data Retention", "Important"], "rewrite": "In order to implement the platform agreement or this policy, safeguard the public interests of the society, and protect the reasonable and necessary purposes of personal safety or other legitimate rights and interests, it may change the storage time."}
{"task": "rw_100.jsonl", "id": 70962, "text": "After your personal information is exceeded, we will delete your personal information or make it anonymous processing.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "After the personal information exceeds the retention, we will delete your personal information or make it anonymous processing."}
{"task": "rw_100.jsonl", "id": 70963, "text": "5. How do we protect the security of personal information", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70964, "text": "1. Safety protection measures", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70965, "text": "In order to protect your information security, we have adopted various physical, electronic and management security measures that comply with industry standards and are reasonable and feasible to protect your information so that your information will not be leaked, damaged or lost, including but not Limited to SSL encryption protection when exchanging data between your mobile device and Leelement products and/or services;", "label": ["Important", "Data Security"], "rewrite": "SSL encryption protection is performed when you exchange data between your mobile device and the elemental product and/or service."}
{"task": "rw_100.jsonl", "id": 70966, "text": "Use encryption technology to ensure the confidentiality of data;", "label": ["Important", "Data Security"], "rewrite": "Use encryption technology to ensure the confidentiality of data."}
{"task": "rw_100.jsonl", "id": 70967, "text": "Using a trusted protection mechanism to prevent data from being maliciously attacked.", "label": ["Important", "Data Security"], "rewrite": "Using a trusted protection mechanism to prevent data from being maliciously attacked."}
{"task": "rw_100.jsonl", "id": 70968, "text": "We have adopted strict management of employees who may contact your information, including but not limited to adopting different permissions control according to different posts, signing confidentiality agreements with them to monitor their operational measures.", "label": ["Important", "Data Security"], "rewrite": "Take strict management of employees who may be exposed to information, and adopt different authority control according to the different posts, sign a confidentiality agreement with them to monitor their operational measures."}
{"task": "rw_100.jsonl", "id": 70969, "text": "We will provide corresponding security measures in accordance with existing technologies to protect your information and provide reasonable security guarantee. We will try our best to make your information from being leaked, damaged or lost.", "label": ["Important", "Data Security"], "rewrite": "Provide corresponding security measures according to existing technologies to protect information and provide reasonable security guarantees so that the information is not leaked, damaged or lost."}
{"task": "rw_100.jsonl", "id": 70970, "text": "Your account has a security protection function, please keep your account and password information properly.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70971, "text": "We will ensure that your information is not lost and not abused and altered by backup and encrypted security measures to other server passwords.", "label": ["Important", "Data Security"], "rewrite": "It will ensure that the information is not lost and the user password security measures will not be lost and the user password will not be abused and altered."}
{"task": "rw_100.jsonl", "id": 70972, "text": "The Internet is not an absolutely secure environment. Although there are aforementioned security measures, please also understand that there is no \"perfect security measures\" on the information network.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70973, "text": "2. Safety event disposal measures", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70974, "text": "If a personal information leaks a security incident, we will start an emergency plan to prevent the expansion of security incidents.", "label": ["Important", "Data Security"], "rewrite": "If a personal information leaks a security incident, we will start an emergency plan to prevent the expansion of security incidents."}
{"task": "rw_100.jsonl", "id": 70975, "text": "After the security incident occurs, we will inform you the basic situation and possible impact of the security incident in accordance with the requirements of the laws and regulations.Essence", "label": ["Important", "Data Security"], "rewrite": "After the security incident, we will inform the basic situation and possible impact, disposal measures, suggestions and remedy measures of the safety incident."}
{"task": "rw_100.jsonl", "id": 70976, "text": "When the incident is related to the event, we will inform you in the form of mail, letter, telephone, and push notification. It is difficult to inform personal information one by one, and we will publish an announcement in a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "When the incident is related to the incident, we will inform you that it is difficult to inform personal information one by one, and will publish a reasonable and effective way to issue announcements."}
{"task": "rw_100.jsonl", "id": 70977, "text": "At the same time, we will also report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "The disposal of personal information security incidents will be reported in accordance with the requirements of the regulatory authorities."}
{"task": "rw_100.jsonl", "id": 70978, "text": "6. Manage your personal information", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70979, "text": "1. Information management", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70980, "text": "You can access, modify and delete your registration information and other personal information in the process of using our services. You can also contact us according to the notice.", "label": ["Important", "Edit/Control"], "rewrite": "You can access, modify, and delete your registration information and other personal information in your service."}
{"task": "rw_100.jsonl", "id": 70981, "text": "The scope and way you visit, modify and delete personal information will depend on the specific services you use.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70982, "text": "We will do everything possible to take appropriate technical means to ensure the accuracy of your personal information and ensure timely updates.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70983, "text": "You can also access, correct and delete your personal information in accordance with our relevant policies and prompts:", "label": ["Important", "Edit/Control"], "rewrite": "You can access, correct and delete your personal information."}
{"task": "rw_100.jsonl", "id": 70984, "text": "(1) Visit your personal information", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70985, "text": "You can access and modify your avatar, nickname, gender, birthday, regional information through [My Business Card → View Details]", "label": ["Edit/Control", "Important"], "rewrite": "You can access and modify your avatar, nickname, gender, birthday, regional information through [my business card → view details]."}
{"task": "rw_100.jsonl", "id": 70986, "text": "You can access your mobile phone number, WeChat, QQ, Weibo binding information through [setting → binding information]", "label": ["Important", "Edit/Control"], "rewrite": "You can access your mobile phone number, WeChat, QQ, and Weibo binding information through [Settings → Binding Information]."}
{"task": "rw_100.jsonl", "id": 70987, "text": "You can access and delete friends' information through [Little Friends]", "label": ["Important", "Edit/Control"], "rewrite": "You can access and delete your friends information through [Little Friends]."}
{"task": "rw_100.jsonl", "id": 70988, "text": "(2) Correct your personal information", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70989, "text": "Due to the consideration of security and identity, you may not be able to modify some initial registration information submitted during the registration (after the real -name authentication information);", "label": ["Edit/Control", "Important"], "rewrite": "You may not be able to modify some initial registration information submitted at the time of registration (after the real -name authentication information)."}
{"task": "rw_100.jsonl", "id": 70990, "text": "If you really need to modify this type of information, please contact us by email (service@happyelements.com). We will review the problems involved as soon as possible and reply to your user identity in a timely manner.", "label": ["Important", "Contact Information"], "rewrite": "Contact us through the email@happyelements.com."}
{"task": "rw_100.jsonl", "id": 70991, "text": "When you find that we are wrong with your information, you have the right to ask us to make corrections or supplements.", "label": ["Important", "Edit/Control"], "rewrite": "When we find that we have an error in handling the information, we have the right to ask us to make corrections or supplements."}
{"task": "rw_100.jsonl", "id": 70992, "text": "In the process of providing services, you may need to open some equipment permissions, including albums, cameras, mobile phone address books, positioning access permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "You may need to open some equipment permissions, including albums, cameras, mobile phone address books, and positioning access permissions."}
{"task": "rw_100.jsonl", "id": 70993, "text": "You can choose to close the part or all permissions at any time in the [Settings] function of the device, thereby rejecting our personal information.", "label": ["Important", "First Party Collection Information", "Edit/Control"], "rewrite": "You can choose to close the part or all permissions at any time in the [Settings] function of the device, so as to reject us to collect your personal information."}
{"task": "rw_100.jsonl", "id": 70994, "text": "Among different devices, the power display method and closing method may be different, and the specific reference equipment and system developer description or guidance.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70995, "text": "We may also verify your identity and account security status.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70996, "text": "We will support your reasonable request.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70997, "text": "But under the situation of our personal information storage scope, exceeding the reasonable limit, or response to your request, we may not be able to respond to your application in the case of serious damage to your or other third -party legitimate rights and interests.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "We may not be able to respond to your application for the storage range of our personal information storage, exceeding the reasonable limit, or response requests that lead to serious damage to legitimate rights and interests."}
{"task": "rw_100.jsonl", "id": 70998, "text": "(3) Delete your personal information", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 70999, "text": "If you find that we violate laws and administrative regulations, or the agreed collection and use your personal information between the two parties, you can contact us to delete it by email (Service@happyements.com).", "label": ["Edit/Control", "Contact Information", "Important"], "rewrite": "You can contact us by email (service@happyelements.com)."}
{"task": "rw_100.jsonl", "id": 71000, "text": "2. Change the scope of your authorization consent", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 71001, "text": "You can change the scope of authorization you have agreed through the following channels:", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 71002, "text": "(1) Click [Customer Service] to contact our official online customer service;", "label": ["Important", "Edit/Control"], "rewrite": "Click [Customer Service] to contact our official online customer service to change the scope of authorization."}
{"task": "rw_100.jsonl", "id": 71003, "text": "(2) Dial customer service hotline: +86 (10) 52817668;", "label": ["Important", "Contact Information"], "rewrite": "Dial customer service hotline: +86 (10) 52817668 to change the scope of authorization."}
{"task": "rw_100.jsonl", "id": 71004, "text": "(3) Send mail to service@happyelements.com.", "label": ["Important", "Contact Information"], "rewrite": "Send mail to service@happyelements.com to change the scope of authorization."}
{"task": "rw_100.jsonl", "id": 71005, "text": "After you apply for authorization, we will no longer process the corresponding personal information.", "label": ["Important", "Edit/Control"], "rewrite": "After you apply for authorization, we will no longer process the corresponding personal information."}
{"task": "rw_100.jsonl", "id": 71006, "text": "Please understand that because of your authorization withdrawal, we cannot continue to provide you with a specific function or/and service corresponding to the withdrawal consent or authorization.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "If you withdraw authorization, we will not be able to continue to provide you with the corresponding functions or/and services."}
{"task": "rw_100.jsonl", "id": 71007, "text": "But your decision to withdraw consent will not affect personal information processing based on your authorization.", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "Withdrawal of consent will not affect the previous personal information processing behavior."}
{"task": "rw_100.jsonl", "id": 71008, "text": "3. Receive personal information copy", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 71009, "text": "You can obtain a copy of your personal information through the following channels:", "label": ["Edit/Control", "Important"], "rewrite": "You can obtain a copy of personal information through the following channels:"}
{"task": "rw_100.jsonl", "id": 71010, "text": "(1) Click [Customer Service] to contact our official online customer service;", "label": ["Important", "Edit/Control"], "rewrite": "Click [Customer Service] to contact our official online customer service to get a copy of personal information."}
{"task": "rw_100.jsonl", "id": 71011, "text": "(2) Dial customer service hotline: +86 (10) 52817668;", "label": ["Important", "Contact Information", "Edit/Control"], "rewrite": "Dial customer service hotline: +86 (10) 52817668, get a copy of personal information."}
{"task": "rw_100.jsonl", "id": 71012, "text": "(3) Send mail to service@happyelements.com.", "label": ["Important", "Contact Information", "Edit/Control"], "rewrite": "Send the mail to service@haappyelements.com to get a copy of personal information."}
{"task": "rw_100.jsonl", "id": 71013, "text": "We will provide you with a copy of personal information within 15 working days.", "label": ["Important", "Edit/Control"], "rewrite": "We will provide you with a copy of personal information within 15 working days."}
{"task": "rw_100.jsonl", "id": 71014, "text": "4. Account cancellation", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 71015, "text": "You can submit your account to cancel your application yourself.", "label": ["Important", "Edit/Control"], "rewrite": "You can submit your account to cancel your application yourself."}
{"task": "rw_100.jsonl", "id": 71016, "text": "(1) Click [Customer Service] to contact our official online customer service;", "label": ["Important", "Edit/Control"], "rewrite": "Click [Customer Service] to contact our official online customer service and submit a cancellation application."}
{"task": "rw_100.jsonl", "id": 71017, "text": "(2) Dial customer service hotline: +86 (10) 52817668;", "label": ["Edit/Control", "Contact Information", "Important"], "rewrite": "Dial the customer service hotline: +86 (10) 52817668, submit the application for cancellation."}
{"task": "rw_100.jsonl", "id": 71018, "text": "(3) Send mail to service@happyelements.com.", "label": ["Edit/Control", "Contact Information", "Important"], "rewrite": "Send the mail to service@haappyelements.com and submit the application for cancellation."}
{"task": "rw_100.jsonl", "id": 71019, "text": "After you take the initiative to cancel your account, we will stop providing you with products or services, delete your personal information as soon as possible, or do anonymous processing.", "label": ["Edit/Control", "Important"], "rewrite": "After actively canceling the account, you will stop providing you with products or services, delete your personal information as soon as possible, or make anonymous processing."}
{"task": "rw_100.jsonl", "id": 71020, "text": "5. Constraine information system automation decision -making", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 71021, "text": "In certain business functions, we may make decisions only based on the non -artificial automatic decision -making mechanism, including information systems, algorithms, etc.", "label": ["Important", "Usage"], "rewrite": "It may be decided based on non -artificial automatic decision -making mechanisms, including information systems, algorithms, etc.."}
{"task": "rw_100.jsonl", "id": 71022, "text": "If these decisions significantly affect your legitimate rights and interests, you have the right to ask us to explain, and we will also provide appropriate relief methods.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 71023, "text": "6. The right to close relatives of the deceased", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 71024, "text": "If our game users died unfortunately, their close relatives can contact us through the following contact information to exercise their legal rights to the relevant personal information of the deceased in accordance with the law.", "label": ["Specific Audiences", "Important"], "rewrite": "If the game users died unfortunately, their close relatives can contact us through the following contact information to exercise their legal rights to the relevant personal information of the deceased in accordance with the law."}
{"task": "rw_100.jsonl", "id": 71025, "text": "(1) Click [Customer Service] to contact our official online customer service;", "label": ["Specific Audiences", "Important"], "rewrite": "Click [Customer Service] to contact our official online customer service to exercise the right of the deceased's personal information."}
{"task": "rw_100.jsonl", "id": 71026, "text": "(2) Dial customer service hotline: +86 (10) 52817668;", "label": ["Specific Audiences", "Contact Information", "Important"], "rewrite": "Dial customer service hotline: +86 (10) 52817668, exercise the right to the personal information of the deceased."}
{"task": "rw_100.jsonl", "id": 71027, "text": "(3) Send mail to service@happyelements.com.", "label": ["Specific Audiences", "Contact Information", "Important"], "rewrite": "Send the email to service@haappyelements.com to exercise the right of the deceased's personal information."}
{"task": "rw_100.jsonl", "id": 71028, "text": "7. Complaint report", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 71029, "text": "You can complain or report in accordance with our publicity system.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 71030, "text": "If you think your personal information rights may be violated, or you find a clue to infringe the right to personal information, you can click [customer service] to contact our official online customer service;", "label": ["Important", "Edit/Control"], "rewrite": "If you think that the right to personal information may be violated or the clues to the right to infringe personal information, you can click [Customer Service] to contact our official online customer service."}
{"task": "rw_100.jsonl", "id": 71031, "text": "Dial customer service hotline: +86 (10) 52817668;", "label": ["Edit/Control", "Contact Information", "Important"], "rewrite": "Dial customer service hotline: +86 (10) 52817668."}
{"task": "rw_100.jsonl", "id": 71032, "text": "Or send emails to Service@happyements.com to contact us.", "label": ["Edit/Control", "Contact Information", "Important"], "rewrite": "Send the mail to service@haappyelements.com."}
{"task": "rw_100.jsonl", "id": 71033, "text": "We will report your complaints and reports within 15 days after the verification.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 71034, "text": "8. Visit privacy policy", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 71035, "text": "You can check all the contents of this privacy policy on your personal account [Settings]-[Privacy Policy].", "label": ["Important", "Edit/Control"], "rewrite": "You can check all the contents of this privacy policy in your personal account [Settings]-[Privacy Policy]."}
{"task": "rw_100.jsonl", "id": 71036, "text": "9. Stop operation notification", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 71037, "text": "If we stop operations, we will stop collecting your personal information in time, notify you in the form of notification of operation in the form of one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one service, and delete or processes your personal information.", "label": ["Data Retention", "Important", "Cessation of Operations"], "rewrite": "If the operation is stopped, you will stop collecting your personal information and inform you in time, and delete or processes your personal information."}
{"task": "rw_100.jsonl", "id": 71038, "text": "10. In the following circumstances, we may not be able to respond to your request:", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "In the following circumstances, we may not be able to respond to your request:"}
{"task": "rw_100.jsonl", "id": 71039, "text": "(1) Related to national security and national defense security;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Requesting the request with national security and national defense security cannot be responded."}
{"task": "rw_100.jsonl", "id": 71040, "text": "(2) Related to public safety, public health, and major public interests;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "If it is related to public safety, public health, and major public interests, the request cannot be responded."}
{"task": "rw_100.jsonl", "id": 71041, "text": "(3) Crime investigation, prosecution, and trial;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Those related to criminal investigation, prosecution, and trial cannot respond to requests."}
{"task": "rw_100.jsonl", "id": 71042, "text": "(4) There is sufficient evidence that you have subjective malice or abuse of rights;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "If there is sufficient evidence that you have subjective malicious or abuse of rights, you cannot respond to the request."}
{"task": "rw_100.jsonl", "id": 71043, "text": "(5) In response to your request, the legitimate rights and interests of other individuals and organizations will be severely damaged;", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "In response to your request, if the legitimate rights and interests of other individuals and organizations are severely damaged, the request cannot be responded."}
{"task": "rw_100.jsonl", "id": 71044, "text": "(6) Involved in business secrets.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Those who involve business secrets cannot respond to requests."}
{"task": "rw_100.jsonl", "id": 71045, "text": "7. Terms of minors", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 71046, "text": "1. General clauses of minors", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 71047, "text": "(1) If you are a minor under the age of 18, before using our related services, you should read and agree to the privacy policy together under your parents or other guardians.", "label": ["Specific Audiences", "Important"], "rewrite": "Minors under the age of 18 should read and agree to the privacy policy together under the supervision and guidance of the guardian."}
{"task": "rw_100.jsonl", "id": 71048, "text": "(2) In accordance with the relevant national laws and regulations, we protect the personal information of minors, and will only collect, use, share, or disclose minors to collect, use, share or disclose minors when legal permits, parents or other guardians need to protect or protect minors.Personal information;", "label": ["Specific Audiences", "Important"], "rewrite": "It will only collect, use, share, or disclose personal information of minors without legal permission, parents or other guardians who clearly agree or protect minors."}
{"task": "rw_100.jsonl", "id": 71049, "text": "If we find that the personal information of minors is collected without the consent of parents or other guardians who can be proven in advance, we will try to delete relevant information as soon as possible.", "label": ["Specific Audiences", "Data Security", "Important"], "rewrite": "If the personal information of the minor or other guardians is collected without the consent of the parents or other guardians in advance, they will try to delete relevant information as soon as possible."}
{"task": "rw_100.jsonl", "id": 71050, "text": "(3) If you are the guardian of minors, when you use our service to use our service or the user information you provide to us, please contact us in time.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_100.jsonl", "id": 71051, "text": "2. Special protection of minors", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 71052, "text": "We attach great importance to the protection of personal information of minors.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 71053, "text": "We will actively protect the legitimate rights and interests of minors by enabling the anti -addiction system in accordance with the requirements of national defense addiction policies.", "label": ["Specific Audiences", "Important"], "rewrite": "Actively in accordance with the requirements of national defense addiction policies, and protect the legitimate rights and interests of minors by enabling the anti -addiction system."}
{"task": "rw_100.jsonl", "id": 71054, "text": "We will determine whether the real -name information of the relevant account is a minor through the real -name information verification, and then decide whether to incorporate this account into the anti -addiction system.", "label": ["Specific Audiences", "Important"], "rewrite": "The real -name information of the relevant account will be judged by the real -name information verification whether the real -name information of the relevant account is a minor, and then decide whether the account is included in the anti -addiction system."}
{"task": "rw_100.jsonl", "id": 71055, "text": "In addition, we will collect your login time and game duration information. By automatic intervention and restricting minors game time from the system level, and enable the compulsory offline function, we will guide the rational game of minors.Try to contact the guardian for reminders, confirmation and processing to help minors surf the Internet healthy.", "label": ["Specific Audiences", "First Party Collection Information", "Important"], "rewrite": "It will collect the login time and gamepage information. By automatic intervention and restricting minors' game time, and enable compulsory offline functions to guide minors to make reasonable games."}
{"task": "rw_100.jsonl", "id": 71056, "text": "In particular, if you are a minor under the age of 14, you also apply this policy and the \"Personal Information Protection Statement and Guardian Instructions\" at the same time.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a minor under the age of 14, you also apply this policy and the \"Personal Information Protection Statement and Guardian Notice\" at the same time."}
{"task": "rw_100.jsonl", "id": 71057, "text": "You can use our game service only after obtaining the guardian's consent of the \"Personal Information Protection Statement and Guardian\".", "label": ["Specific Audiences", "Important"], "rewrite": "Only after obtaining the consent of the guardian's \"Personal Information Protection Statement and Guardian Instructions\", you can use the game service."}
{"task": "rw_100.jsonl", "id": 71058, "text": "8. Amendment and notice of privacy policy", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 71059, "text": "1. In order to provide you with better services, the product -related services will be updated and changed from time to time. We will revise the privacy policy in a timely manner. These amendments to the composition of privacy policies have the effect of the privacy policy.Clear consent, we will not cut the rights you should enjoy based on the current privacy policy that takes effect.", "label": ["Policy Change", "Important"], "rewrite": "Without clear consent, you will not reduce the rights you should enjoy in accordance with the current privacy policy that take effect."}
{"task": "rw_100.jsonl", "id": 71060, "text": "2. After the privacy policy is updated, we will issue a updated version in the product, and notify you through the website announcement, push notification, pop -up window prompts or other methods before the updated terms.The latest version of.", "label": ["Policy Change", "Important"], "rewrite": "After the privacy policy is updated, the update version will be issued in the product and notified you."}
{"task": "rw_100.jsonl", "id": 71061, "text": "Nine, dispute resolution", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 71062, "text": "The place of signing this privacy policy is Haidian District, Beijing, Beijing.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 71063, "text": "The establishment of this privacy policy is established, effective, fulfilled, interpreted, and dispute resolution, and the laws of the People's Republic of China are applicable.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 71064, "text": "If you and us have any disputes or disputes due to this privacy policy, you should first be friendly and resolved;", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 71065, "text": "If the negotiation fails, you agree to submit disputes or disputes to the jurisdiction of the People's Court of Haidian District, Beijing.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 71066, "text": "10. Contact us", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 71067, "text": "You can contact us in the following way:", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 71068, "text": "1. If you have any questions, opinions or suggestions on the content of this policy, you can click [customer service] to contact our official online customer service;", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 71069, "text": "Dial customer service hotline: +86 (10) 52817668;", "label": ["Important", "Contact Information"], "rewrite": "Dial customer service hotline: +86 (10) 52817668."}
{"task": "rw_100.jsonl", "id": 71070, "text": "Send the mail to service@haappyelements.com.", "label": ["Important", "Contact Information"], "rewrite": "Send the mail to service@haappyelements.com."}
{"task": "rw_100.jsonl", "id": 71071, "text": "We will review the issues involved as soon as possible and reply within 15 working days after verifying your user identity.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 71072, "text": "2. We also set up a full -time department for personal information protection, and you can send emails to contact us.", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 71073, "text": "Email: Service@happyements.com", "label": ["Important", "Contact Information"], "rewrite": "Email: Service@happyements.com."}
{"task": "rw_100.jsonl", "id": 71074, "text": "Contact address: 21F, Building, Building, No. 18, No. 18, Division, Suzhou Street, Haidian District, Beijing", "label": ["Important", "Contact Information"], "rewrite": "Contact address: 21F, Building, Building, Building, No. 18, No. 29, Suzhou Street, Haidian District, Beijing."}
{"task": "rw_100.jsonl", "id": 71075, "text": "Postcode: 100000", "label": ["Important", "Contact Information"], "rewrite": "Zip code: 100000."}
{"task": "rw_100.jsonl", "id": 71076, "text": "Legalogy Legal Ministry of Legal Affairs", "label": [], "rewrite": []}
{"task": "rw_100.jsonl", "id": 71077, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
