{"task": "rw_124.jsonl", "id": 76396, "text": "Personal information and privacy protection policies for self -conscious network", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76397, "text": "Updated: [August 4, 2022]", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76398, "text": "Effective time: [August 4, 2022]", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76399, "text": "The self -confidence network has always promised to protect the personal information and privacy of users who use the products or services provided by the self -conscious network.", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76400, "text": "In order to better protect your legitimate rights and interests, we have specially formulated this \"Self -Online Personal Information and Privacy Protection Policy\" to explain to you that when you are using our products or services (including your interaction with your own network andWhen you register as a user and/or the product that uses the self -conscious network, when you are collectively referred to as the \"service\"), we will correspondEarth guarantees your rights and interests.", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76401, "text": "\"Personal Information and Privacy Protection Policy for Self -conscious Networks\" (hereinafter referred to as \"Privacy Policy\" \") and you (hereinafter referred toThe Internet \"or\" us \", our registered address is: Room 1501G-3, Guobin Road, Yangpu District, Shanghai). This\" Privacy Policy \"has a contract effect.", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76402, "text": "Catalog of \"Personal Information and Privacy Protection Policy of Freedom\"", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76403, "text": "introduction", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76404, "text": "1. How do we collect and use your information", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76405, "text": "2. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76406, "text": "3. We may share, transfer or disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76407, "text": "4. How do we store and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76408, "text": "5. The right to manage personal information", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76409, "text": "6. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76410, "text": "7. Amendment to \"Privacy Policy\"", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76411, "text": "Eight, contact us", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76412, "text": "Nine, others", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76413, "text": "introduction", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76414, "text": "Before you use the service provided by your own network, please be sure to read and thoroughly understand this policy, especially the clauses of the line identification under the body/thick body. You should focus on reading.Essence", "label": ["Policy Change", "Important"], "rewrite": "Confirm the full understanding of the privacy policy and agree to use this service before starting to use this service"}
{"task": "rw_124.jsonl", "id": 76415, "text": "If you do not agree with the content of this policy, it may cause our services to be unable to run normally or to achieve the service effect we are going to achieve, you should immediately stop access/use our services.", "label": ["Policy Change", "Important"], "rewrite": "If you do not agree with this policy, you should stop visiting/use our service immediately."}
{"task": "rw_124.jsonl", "id": 76416, "text": "We need to remind you in particular: Because there are many types of game products and services, the contents of the services you provide are different, so core business functions (including the types of your personal information) will also be different.The actual product or service is prevailing.", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76417, "text": "After reading the \"Privacy Policy\", if you have any questions about this \"Privacy Policy\" or related matters, you can contact us through the feedback channel listed in the chapter of \"Confucian Policy\" in this \"Privacy Policy\".Make you answer as soon as possible.", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76418, "text": "1. How do we collect and use your information", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76419, "text": "1. The information you actively provide", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76420, "text": "(1) In order to facilitate us to provide you with continuous and stable services and ensure the security of your service, you provide us with basic registration or login information (including mobile phone numbers, email address), and create your account number, and your account, and your account, and your account, and your account number, and your account, and your account number, and your account, and your account number, and your account number, and your account number, and your account, and your account number, and your account, and your account number, and your account, and your account number, and your account number, and your account number, and your account number, and your account number, and your account number, and your account number, and your account number, and your account, and your account number, and your account number, and your account,user name and password.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect basic registration or login information (including mobile phone numbers, email address), for creating accounts, user names and passwords"}
{"task": "rw_124.jsonl", "id": 76421, "text": "According to the provisions and regulatory requirements of relevant laws and regulations, when you register the game account, the real name, ID information and mobile phone number you provide will be used for real -name authentication.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect real names, ID information and mobile phone numbers for real -name authentication."}
{"task": "rw_124.jsonl", "id": 76422, "text": "If you do not provide the above true identity information or provide false information, you will not be able to log in to our products, enjoy related services or be subject to corresponding restrictions in the process of using services.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If the above true identity information is not provided or provided with false information, it will not be able to log in to the product, enjoy related services or be subject to corresponding restrictions."}
{"task": "rw_124.jsonl", "id": 76423, "text": "In order to achieve the purpose of real -name certification, you agreed and authorized us to provide, inquire, and check your aforementioned identity information to relevant real -name authentication agencies (national online game competent departments, public security departments or other agencies entrusted/cooperated).", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "Provide, inquire, and check the aforementioned identity information to the relevant real -name authentication agencies"}
{"task": "rw_124.jsonl", "id": 76424, "text": "You agree that we may collect your network identity identification information (including system accounts, passwords, IP addresses, personal digital certificates) and personal common equipment information (including hardware sequence numbers, hardware models, equipment MAC addresses, operating system types, operating systems, operating systems, operating systemsVersion, software list, equipment unique device recognition code, equipment name, network status, operator) are used to mark you as users who are self -intended.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect network identity identification information (including system accounts, passwords, IP addresses, personal digital certificates) and personal common equipment information (including hardware serial number, hardware model, device MAC address, operating system type, operating system version, software list, equipment unique equipment, the unique equipment, the unique equipment, the unique device, the unique device, the unique equipment, the unique device, the unique equipment, the unique device, the unique device, the unique equipment, the unique device,Equipment identification code, equipment name, network status, operator)"}
{"task": "rw_124.jsonl", "id": 76425, "text": "If you use a third -party account to log in to the self -registered self -registered network, we may collect the unique logos, account names, nicknames, personal avatars, personalized signatures, and friend relationships for your relevant account.Essence", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the unique logo, account name, nickname, personal avatars, personalized signatures, friends relationships, and friendly relationships, which are used to save login information"}
{"task": "rw_124.jsonl", "id": 76426, "text": "If you do not agree to authorize such information, you will not be able to log in to our product/service with a third -party account.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Risk"], "rewrite": "If you do not agree with authorization, you will not be able to log in to the product/service with a third -party account."}
{"task": "rw_124.jsonl", "id": 76427, "text": "(2) The information submitted during the activity/questionnaire survey organized by us, or the information submitted through our customer service, that is, your name, gender, telephone, address, cultural level, occupation, personal income.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collection of information submitted during the event/questionnaire survey: name, gender, telephone, address, cultural level, occupation, personal income."}
{"task": "rw_124.jsonl", "id": 76428, "text": "You do not participate in the above -mentioned activities/questionnaires or provide the above information to customer service, and will not affect your enjoyment of other services.", "label": ["Important", "First Party Collection Information"], "rewrite": "Do not participate in the above activities/questionnaire surveys or do not provide the above information to customer service, does not affect enjoying other services"}
{"task": "rw_124.jsonl", "id": 76429, "text": "2. Your information with third -party legitimate sharing", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76430, "text": "3. The information we can get legal in the process of providing you in the process of providing you", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76431, "text": "(1) In the process of using our online game service, to provide you with basic functions of the game, identify the abnormal state of the account, understand and improve the product adaptability, ensure the security of the network and operate, to maintain the normal operation of the service functionProtect your or other users or the public's personal and property security for avoiding violations, and better prevent security risks such as fishing websites, fraud, network vulnerabilities, computer viruses, cyber attacks, and network invasion.We may collect and store devices or software information about your services and use methods, including your mobile device, web browser or the configuration information, IP address, IP address, IP address, and IP address,, IP address,, IP address, IP address, IP address,The models and operating system versions, device recognition codes, MAC addresses, device unique identifiers, shear information, battery, signal intensity, network type, and operator are used for mobile device.", "label": ["Important", "First Party Collection Information"], "rewrite": "The equipment or software information of services or use methods of use and use methods, including mobile devices, web browsers or other programs provided by products or services provided by products or services, the models and models and models and models used in mobile devicesThe operating system version, device recognition code, MAC address, unit unique identifier, shear information, battery, signal strength, network type, operator."}
{"task": "rw_124.jsonl", "id": 76432, "text": "(2) In the process of using our online game service, we may collect your game log information, including login logs, items logs, game -to -game information, purchase logs, activity logs, upgrade logs, chat logs, guild logs, guild logs2. Dating records, for game operation statistical analysis, customer complaint processing, game anti -cheating analysis, and other game experience optimization analysis, and in order to improve your game experience, we may synchronize the previous information to the subsequent version of the game or what you are using it.Other products we provide.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Will collect game log information, including login logs, items logs, game -to -game information, purchase logs, activity logs, upgrade logs, chat logs, guild logs, dating records, for game experience optimization analysis"}
{"task": "rw_124.jsonl", "id": 76433, "text": "(3) When you use the consumption function of your own network, in order to help you complete the payment, recharge, display the transaction information of the account and ensure the security of the transaction, we will collect your recharge records and consumer record information so that you can check youTrading records, at the same time protect your virtual items to the greatest extent.", "label": ["Important", "First Party Collection Information"], "rewrite": "Will collect recharge records and consumer record information in order to query the transaction record"}
{"task": "rw_124.jsonl", "id": 76434, "text": "The recharge records and consumption records are personal sensitive information. Collecting the above information is necessary to achieve the consumption function of the self -conscious network, otherwise the transaction will not be completed.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "The recharge record and consumption record are personal sensitive information. Collecting the above information is necessary to achieve consumption functions, otherwise the transaction cannot be completed"}
{"task": "rw_124.jsonl", "id": 76435, "text": "(4) When you use our service upload and/or publish information, and related interactive behaviors (such as words, pictures, voice, videos, and other methods of speaking, following posts, comments, etc.), we will collect and save you send you sending youThe content of the above information is used to filter the improper content of pornography, violence, politics, abuse, and malicious advertisements to purify the game environment and maintain a healthy Internet environment.", "label": ["Important", "First Party Collection Information"], "rewrite": "Upload and/or publish information and related interactive behaviors (such as text, pictures, voice, videos, and other methods when using the service and/or publishing information when using the service, and use"}
{"task": "rw_124.jsonl", "id": 76436, "text": "Please note that the information you posted publicly may include your personal information or personal sensitive information. These information may be collected and used by others. Please consider it carefully before the release.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Publicly published information may include personal information or personal sensitive information. These information may be collected and used by others. Please consider it carefully before release"}
{"task": "rw_124.jsonl", "id": 76437, "text": "Even if you delete the aforementioned information, the relevant information may be cached, replicated or stored independently by other users or the third party that is not controlled by us, or is preserved by other users or such third parties in the public domain.", "label": ["Data Retention", "Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Even if the aforementioned information is deleted, the relevant information may be independently stored by other users or unprepared third parties, or it is stored in the public domain"}
{"task": "rw_124.jsonl", "id": 76438, "text": "In particular, if the information you posted involves the personal information of others, you should obtain the consent of others before the release.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If the published information involves the personal information of others, it should be obtained by the consent of others before the release"}
{"task": "rw_124.jsonl", "id": 76439, "text": "When you find that others collect or use your information, you can contact us through the feedback method listed in the chapter of \"contact us\" in this policy.", "label": ["Important", "First Party Collection Information", "Edit/Control"], "rewrite": "When discovering that others are not collectively collected or using information, you can contact us through the feedback method listed in the chapter of the \"contact us\" chapter through this policy."}
{"task": "rw_124.jsonl", "id": 76440, "text": "(5) In order to complete the order payment, delivery of goods or services, confirm the transaction status, and provide you with after -sales and dispute solutions, we will collect and transaction progress through the transaction objects, payment institutions, logistics companies, etc. based on your exchange.Related personal identity information, names, delivery address, postal code, contact phone number, payment status, logistics information, or share your transaction information with the above -mentioned service providers.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Collect personal identity information, names, delivery address, postal code, postal code, contact number, payment status, logistics information, and share transaction information related to the transaction progress."}
{"task": "rw_124.jsonl", "id": 76441, "text": "If you do not provide such information, we will not be able to complete the relevant delivery service, but it will not affect other functions of your normal network services.", "label": ["Important", "First Party Collection Information"], "rewrite": "If this kind of information is not provided, it will not be able to complete the relevant delivery service, but it will not affect the normal use of other functions"}
{"task": "rw_124.jsonl", "id": 76442, "text": "(6) When you contact us, we may collect your communication/call records and content or the contact information you left in order to contact you or help you solve the problem, or record the related issues, the results and results of the results related to the related issuesEssence", "label": ["Important", "First Party Collection Information"], "rewrite": "Will collect communication/call records and content or contact information in order to contact or help solve the problem"}
{"task": "rw_124.jsonl", "id": 76443, "text": "(7) Equipment permissions: In the process of using the services we provided, we will apply for access to your system permissions when necessary to achieve the collection and use of information involved in these permissions.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "Apply to the system permissions when necessary to achieve the collection and use of information involved in these permissions"}
{"task": "rw_124.jsonl", "id": 76444, "text": "We will inform you of the purpose of opening permissions and asking your consent before opening the permissions. If you disagree, we will not open the relevant permissions, and we cannot provide you with the service corresponding to the permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "Before opening the permissions, the purpose of opening permissions will be notified and soliciting consent."}
{"task": "rw_124.jsonl", "id": 76445, "text": "After your authorization consent, we will access your camera and album. At the same time, we need to access your application list permissions and write external storage permissions to complete the storage and cache of the corresponding results to achieve the involved in the services we provide.Postering, screenshots, sharing, and providing pictures/video information to customer service and the functions of game security anti -plug -in.", "label": ["Data Retention", "Permission Acquisition", "Important"], "rewrite": "Access the camera and album, at the same time you need to access the application list permissions, write the external storage permission to complete the storage and cache of the corresponding results"}
{"task": "rw_124.jsonl", "id": 76446, "text": "If you refuse to provide the aforementioned permission and content, you will not be able to use these functions/services, but it will not affect your other services using your own network.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "If you refuse to provide the aforementioned permission and content, you will not be able to use these functions/services, but it will not affect the use of other services"}
{"task": "rw_124.jsonl", "id": 76447, "text": "You can open/cancel the aforementioned permissions at the device system permissions management interface at any time.", "label": ["Important", "Edit/Control"], "rewrite": "You can open/cancel the aforementioned permissions at any time in the device system authority management interface at any time"}
{"task": "rw_124.jsonl", "id": 76448, "text": "Please note: You open the right of power means that you authorize us to collect and use relevant information to provide you with corresponding services. Once you turn off the right of power, it means that you cancel the authorization. We will no longer continue to collect and use based on the corresponding authority.Related information cannot provide you with the services corresponding to the permissions.", "label": ["Edit/Control", "Important"], "rewrite": "Opening the right permissions means authorization. Closing the one -permissions means canceling the authorization. It will no longer continue to collect and use relevant information based on the corresponding permissions."}
{"task": "rw_124.jsonl", "id": 76449, "text": "However, your decision to close permissions will not affect the collection and use of information based on your authorization.", "label": ["Permission Acquisition", "Edit/Control", "Risk", "Important"], "rewrite": "The decision to close permissions will not affect the information collection and use of information based on authorization"}
{"task": "rw_124.jsonl", "id": 76450, "text": "(8) To ensure your game account security, create a fair, healthy and safe game environment, we will collect your game application information, equipment information (device ID, device serial number, equipment manufacturer, equipment name, equipment type and equipment type and equipment type and equipment type and equipment type and equipment type and equipment type and equipment type and equipment type and equipment type and equipment type and equipment type and equipment type and equipment types and equipment types.Version, device model, equipment style), network identity identification information, hardware and operating system information, process and game crash records, network types, operator information, to combat the behavior of damaging the fair environment or interference of the game(Such as it is used to detect piracy, scanned plug -in, and prevent cheating).", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect game application information, equipment information (device ID, device serial number, equipment manufacturer, equipment name, equipment type and version, equipment model, equipment style), network identity information, hardware and operating system information, processes and game crash records, Network type, operator information, to maintain game fairness"}
{"task": "rw_124.jsonl", "id": 76451, "text": "4. We may send you information", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76452, "text": "(1) When you use our service, we may contact you or send text messages or push notifications with you.", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76453, "text": "You can choose to cancel the subscription on the device according to our relevant tips.", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76454, "text": "(2) We may issue an announcement related to the service -related announcement when necessary (for example, when the system maintenance is suspended due to system maintenance).", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76455, "text": "You may not be able to cancel these announcements related to services and nature.", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76456, "text": "5. Exception of authorization consent", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76457, "text": "According to relevant laws and regulations and national standards, in the following circumstances, we may collect and use your relevant personal information without asking your authorization consent:", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "In the following circumstances, collecting or using relevant personal information does not need to solicit authorization consent:"}
{"task": "rw_124.jsonl", "id": 76458, "text": "(1) Directly related to national interests such as national security and national defense security;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Those who are directly related to national interests such as national security, national defense security, no need to authorize"}
{"task": "rw_124.jsonl", "id": 76459, "text": "Directly related to the major public interests such as public safety, public health, and public knowledge;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If it is directly related to the public interests such as public safety, public health, and public knowledge, there is no need to authorize"}
{"task": "rw_124.jsonl", "id": 76460, "text": "(2) Directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Directly related to criminal investigation, prosecution, trial and judgment execution, no authorization is required"}
{"task": "rw_124.jsonl", "id": 76461, "text": "(3) For the maintenance of major legitimate rights and interests such as life, property, and reputation of your or other individuals, it is difficult to get my consent;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Out of maintaining major legitimate rights and interests such as life, property, and reputation of you or other individuals, it is difficult to obtain it."}
{"task": "rw_124.jsonl", "id": 76462, "text": "(4) The personal information collected is publicly disclosed to the public by itself;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "The collected personal information is publicly disclosed to the public by itself without authorization"}
{"task": "rw_124.jsonl", "id": 76463, "text": "(5) Collect personal information from the information disclosed by legal and publicly disclosed, such as legal news reports, government information disclosure and other channels;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If you collect personal information from the information disclosed by legal and publicly disclosure, no need to authorize"}
{"task": "rw_124.jsonl", "id": 76464, "text": "(6) Signing and fulfilling the contract according to your requirements;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "According to your request to sign and fulfill the required contract, no need to authorize"}
{"task": "rw_124.jsonl", "id": 76465, "text": "(7) The necessary and stable operation of the products or services provided by the maintenance of the products provided, such as the failure of discovering and disposing of products or services;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "It is necessary to maintain the safe and stable operation of the products or services provided by maintenance, no need to authorize"}
{"task": "rw_124.jsonl", "id": 76466, "text": "(8) It is necessary to carry out legal news reports;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "It is necessary to carry out legal news reports, no need to authorize"}
{"task": "rw_124.jsonl", "id": 76467, "text": "(9) When the statistical or academic research institute is needed for public interest, and the results of academic research or descriptions are provided, the personal information contained in the results is identified;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "For public interests to carry out statistics or academic research, there is no need to authorize"}
{"task": "rw_124.jsonl", "id": 76468, "text": "(10) Other circumstances stipulated in laws and regulations.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Other circumstances stipulated in laws and regulations do not need to be authorized"}
{"task": "rw_124.jsonl", "id": 76469, "text": "2. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76470, "text": "We or our third -party partners may collect and use your information through similar technologies such as Cookies and Web, Beacon, and store these information.", "label": ["Data Retention", "Important", "First Party Collection Information"], "rewrite": "Collect, use and store information through Cookies and Web Beacon and other similar technologies"}
{"task": "rw_124.jsonl", "id": 76471, "text": "And may be used for the following uses:", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76472, "text": "1. Remember your identity.", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76473, "text": "For example, Cookies and Web Beacon help us recognize your identity as our registered user, or save other information about your information provided to us.", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76474, "text": "2. Analyze your use of our products or services.", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76475, "text": "We can use Cookies and Web Beacon to learn what activities you use to use.", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76476, "text": "3. In our products and services, there may be similar technologies such as cookies and WebBeacon placed by our third -party partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "There will be similar technologies such as Cookies and WebBeacon placed by third -party partners"}
{"task": "rw_124.jsonl", "id": 76477, "text": "These cookies and similar technologies may collect non -personal identity information related to you to analyze how users use such services or to evaluate advertising services.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Cookies and similar technologies will collect non -personal identity information to analyze and evaluate"}
{"task": "rw_124.jsonl", "id": 76478, "text": "These third -party cookies or similar technologies are collected and used by such information that are not bound by this policy, but are subject to their own information protection statements. We are not responsible for third -party Cookies or similar technologies.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Risk"], "rewrite": "The collection and use of third -party cookies or similar technologies are not bound by this policy."}
{"task": "rw_124.jsonl", "id": 76479, "text": "You can set up refusal or management of Cookies or Web, Beacon, etc. through your browser settings.", "label": ["Important", "Edit/Control"], "rewrite": "You can set up rejection or management of cookies or web beacon through browser settings"}
{"task": "rw_124.jsonl", "id": 76480, "text": "But please note that if you stop using cookies or web, beacon, etc., you may not be able to enjoy the corresponding service experience, and certain services may not be used normally.", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "If you stop using similar technologies such as Cookies or Web Beacon, certain services may not be able to use normally"}
{"task": "rw_124.jsonl", "id": 76481, "text": "3. We may share, transfer or disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76482, "text": "(1) Sharing", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76483, "text": "1. We attach great importance to protecting your personal information, and we will only share your personal information with the purpose of legal, correct, necessary, specific, and clearly.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "It will only share your personal information with the purpose of legal, correct, necessary, specific, and clearly with third parties"}
{"task": "rw_124.jsonl", "id": 76484, "text": "When we receive our personal information, we will sign a strict confidentiality agreement with them, asking them to handle information in accordance with our instructions, this policy, and any other related confidentiality and security measures.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Companies, organizations and individuals who receive personal information, we will sign a strict confidentiality agreement with them"}
{"task": "rw_124.jsonl", "id": 76485, "text": "2. In order to achieve the purpose of the statement in this policy, we may access the SDK or other similar applications provided by the third -party service provider (such as embedded code, plug -in, H5 and other forms) to cooperate with third -partyProvide better customer service and user experience.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Will access the SDK or other similar applications provided by third -party service providers (such as embedded code, plug -in, H5 and other forms) to cooperate with third -party to provide better customer service to provide better customer service"}
{"task": "rw_124.jsonl", "id": 76486, "text": "If you use brand mobile phones such as Xiaomi, Meizu, Huawei, vivo, OPPO, SDKs or other similar applications of the above -mentioned mobile phone manufacturers connected by the Internet may need to collect information to achieve information push functions.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "For example, brand mobile phones such as Xiaomi, Meizu, Huawei, vivo, OPPO, SDKs or other similar applications of the above -mentioned mobile phone manufacturers need to collect information to achieve information push functions."}
{"task": "rw_124.jsonl", "id": 76487, "text": "In order to provide the above -mentioned services, third -party SDK or other similar applications may collect your personal information, such as real names, ID information, network identity identification information (including system accounts, passwords, IP addresses, personal digital certificates), Personal commonly used equipment information (including hardware serial number, hardware model, equipment MAC address, operating system type, operating system version, software list, device unique device recognition code, OAID, network status, operator, etc.), IMSI), system and software -related configuration information, WIFI and cellular network information (WIFI network card MAC address, WIFI hot spot MAC address, WIFI name, peripheral WIFI information list, network connection method), national code, etc.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Third -party SDK or other similar applications may collect personal information, such as real names, ID information, network identity identification information (including system accounts, passwords, IP addresses, personal digital certificates), personal common equipment information (including hardware sequencesNumber, hardware model, equipment MAC address, operating system type, operating system version, software list, device unique device identification code, OAID, network status, operator, etc.), SIM card information (ICCID, IMSI), system and software related configuration configurationInformation, WIFI and Honeycomb Network Information (WIFI network card MAC address, WIFI hotspot MAC address, WIFI name, peripheral WIFI information list, network connection method), national code, etc., national code, etc."}
{"task": "rw_124.jsonl", "id": 76488, "text": "Third -party SDK or other similar applications collect and process information such as the privacy terms or related statements such as the processing and processing information. We recommend that you check your privacy clauses before using any third -party service.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Third -party SDK or other similar applications collect and process information such as the privacy terms or related statements such as the processing and processing information, and it is recommended to check its privacy clauses before use."}
{"task": "rw_124.jsonl", "id": 76489, "text": "In order to protect your legitimate rights and interests, if you find a risk of related third -party services, it is recommended that you immediately terminate the relevant operations and contact us in time.", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76490, "text": "At present, please refer to the [Self -Online Third Party Information Sharing List].", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For the current information sharing situation, please refer to [Self -Internet Third Party Third Party Information Sharing List]"}
{"task": "rw_124.jsonl", "id": 76491, "text": "3. Without your consent, we and our affiliated companies will not share your personal information with any third party, except the following situations:", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Without consent, we and our affiliated companies will not share your personal information with any third party, except the following situations:"}
{"task": "rw_124.jsonl", "id": 76492, "text": "(1) Provide you with our products or services;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Provide you with our products or services and share it from third parties, no need to agree"}
{"task": "rw_124.jsonl", "id": 76493, "text": "(2) Realize the purpose of the \"how do we collect and use your information\" part;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Realize the purpose of \"how do we collect and use your information\" and share it from third parties, no need to agree"}
{"task": "rw_124.jsonl", "id": 76494, "text": "(3) Perform our obligations and the right to exercise our rights in this \"Privacy Policy\" or the self -confidence network;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "If you fulfill your obligations in this \"Privacy Policy\" or other agreements, sharing information, you don’t need to agree"}
{"task": "rw_124.jsonl", "id": 76495, "text": "(4) Understand, maintain and improve our products or services;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "If you understand, maintain and improve our products or services, you do not need to agree"}
{"task": "rw_124.jsonl", "id": 76496, "text": "(5) Provided based on the legal requirements of your or your guardian;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "If you share information based on the legal requirements of your or guardian, you don’t need to agree"}
{"task": "rw_124.jsonl", "id": 76497, "text": "(6) Provide in accordance with the provisions of laws and regulations or the requirements of the competent department.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "If you shared information in accordance with the provisions of laws and regulations or the requirements of the competent department, you don’t need to agree"}
{"task": "rw_124.jsonl", "id": 76498, "text": "(2) Transfer", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76499, "text": "We will only transfer your personal information in the following situation:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only transfer your personal information in the following situation:"}
{"task": "rw_124.jsonl", "id": 76500, "text": "1., after getting your clear consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After getting a clear consent, you will transfer personal information"}
{"task": "rw_124.jsonl", "id": 76501, "text": "2., transfer according to the provisions of laws and regulations or the requirements of the competent department.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Transfer personal information in accordance with the provisions of laws and regulations or the requirements of the competent department"}
{"task": "rw_124.jsonl", "id": 76502, "text": "3. With the continuous development of our business, we and our affiliated companies may be able to merge, acquisition, asset transfer or similar transactions. Your personal information may be transferred as part of such transactions.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Consolidation, acquisition, asset transfer or similar transactions will transfer personal information"}
{"task": "rw_124.jsonl", "id": 76503, "text": "We will inform you the relevant situations by pushing notifications and announcements, and continue to protect or request new managers to continue to protect your personal information in accordance with laws and regulations and the standards that are not lower than this policy.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "It will be notified by pushing notifications, announcements, etc., and will continue to protect or request new managers to continue to protect your personal information"}
{"task": "rw_124.jsonl", "id": 76504, "text": "(3) Public public", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76505, "text": "We will only disclose your personal information in the following situations:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only disclose your personal information in the following situations:"}
{"task": "rw_124.jsonl", "id": 76506, "text": "1., after getting your clear consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After getting your clear consent, you will disclose personal information"}
{"task": "rw_124.jsonl", "id": 76507, "text": "2. Public disclosure in accordance with the provisions of laws and regulations or the requirements of the competent department.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Public personal information is made in accordance with the provisions of laws and regulations or the requirements of the competent department"}
{"task": "rw_124.jsonl", "id": 76508, "text": "(4) No need to obtain the situation you agree in advance", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "No need to obtain the situation you agree in advance"}
{"task": "rw_124.jsonl", "id": 76509, "text": "According to relevant laws and regulations and national standards, in the following circumstances, we may share, transfer, and disclose your personal information in accordance with the law without obtaining your consent:", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "In the following circumstances, you may share, transfer, and disclose your personal information in accordance with the law without obtaining your consent:"}
{"task": "rw_124.jsonl", "id": 76510, "text": "1., directly related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Sharing personal information directly related to national security and national defense security, no need to agree"}
{"task": "rw_124.jsonl", "id": 76511, "text": "2. It is directly related to public safety, public health, and major public interests;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Personal information directly related to public safety, public health, and major public interests."}
{"task": "rw_124.jsonl", "id": 76512, "text": "3. Directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Direct related personal information such as sharing directly related to crime investigation, prosecution, trial, and judgment execution, no need to agree"}
{"task": "rw_124.jsonl", "id": 76513, "text": "4. Out of maintaining major legitimate rights and interests such as life and property of you or other individuals, it is difficult to get your consent;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Share major legitimate rights and interests such as maintaining life and property, but it is difficult to get personal information that I agree."}
{"task": "rw_124.jsonl", "id": 76514, "text": "5. Personal information that you disclose to the public by yourself;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Share personal information that you disclose to the public by yourself, no need to agree"}
{"task": "rw_124.jsonl", "id": 76515, "text": "6. Personal information collected from the legal publicly disclosed information, such as legal news reports, government information disclosure and other channels.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Personal information collected from the information disclosed by legal publicly, no need to agree"}
{"task": "rw_124.jsonl", "id": 76516, "text": "You know and agree: We will use the collected information to identify it for big data analysis.", "label": ["Important", "Usage"], "rewrite": "The collected information will be used for de -identification processing for big data analysis"}
{"task": "rw_124.jsonl", "id": 76517, "text": "We may disclose and share information with our partners with information that does not include identity recognition content after statistical processing. It is used to understand how users use our products or services or let the public understand the overall use trend of our products or services.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "It may be disclosed to the outside world and shares information with partners who do not include identity recognition content after statistical processing."}
{"task": "rw_124.jsonl", "id": 76518, "text": "According to the provisions of relevant laws and regulations, sharing and transferred information that has been identified by the identification processing, and ensure that the data receiver cannot restore and re -identifies the information of the information, which is not an information sharing, transfer, and public behavior.And processing will not need to notify you separately and obtain your consent.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "If sharing and transfer of information for identification processing, and ensure that it is impossible to restore and re -identify the information of the information, no other notice is required and consent."}
{"task": "rw_124.jsonl", "id": 76519, "text": "4. How do we store and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76520, "text": "1. Storage of personal information", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76521, "text": "(1) In addition to laws and regulations or regulatory authorities, there are other regulations, as wellIn addition, we only store your personal information in the purpose of this policy's purpose and shortest time limit.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "Store your personal information only in the purpose of the purpose of this policy and the shortest time limit"}
{"task": "rw_124.jsonl", "id": 76522, "text": "(2) If we terminate the service or operation, we will stop collecting your personal information in time. At the same time, we will comply with relevant laws and regulations to inform you in advance, and delete or anonymous your personal information after the termination of the service or operationExcept for the treatment, except for laws and regulations or regulators.", "label": ["Important", "Data Security", "Cessation of Operations"], "rewrite": "If the service or operation is terminated, it will stop collecting personal information in time. At the same time, it will be notified in advance, and the personal information will be deleted or anonymized after terminating the service"}
{"task": "rw_124.jsonl", "id": 76523, "text": "(3) If you apply for cancellation account, actively delete personal information, or exceed the necessary period, we will delete or processes your personal information, except that the laws and regulations stipulate that the reserved period is stipulated.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "If you apply for a cancellation account, actively delete personal information, or exceed the necessary period, you will delete or processes personal information, except that the laws and regulations stipulate that"}
{"task": "rw_124.jsonl", "id": 76524, "text": "(4) The personal information collected in the territory of the People's Republic of China is stored in China. If we need to transmit cross -border transmission, we will request it alone to obtain your authorization consent and ensure thatProvide sufficient protection for your personal information.", "label": ["Data Retention", "Important", "Risk"], "rewrite": "Personal information collected in the People's Republic of China is stored in China. If you need to transmit cross -border transmission, you will request the authorization consent alone"}
{"task": "rw_124.jsonl", "id": 76525, "text": "2. Protection of personal information", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76526, "text": "We will adopt security measures that meet industry standards, including establishing reasonable institutional norms and security technology to prevent your personal information from being accessed, using, modifying, and avoiding data damage or loss.", "label": ["Important", "Data Security"], "rewrite": "Safety protection measures will be adopted, including the establishment of reasonable institutional specifications, security technology to prevent personal information from being unauthorized access, use, modification, and avoid data damage or loss"}
{"task": "rw_124.jsonl", "id": 76527, "text": "Our services adopt de -identification and multiple encryption technologies. We will use the above technology (such as SSL) to encrypt your personal information and isolate through isolation technology to protect your personal information.", "label": ["Important", "Data Security"], "rewrite": "Adopt de -identification and multiple encryption technologies, use the above technology (such as SSL) to encrypt personal information, and isolate through isolation technology"}
{"task": "rw_124.jsonl", "id": 76528, "text": "3. Safety event disposal", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76529, "text": "When an information security incident may occur or unfortunately, we will immediately take remedial measures in accordance with the requirements of laws and regulations, and inform you in a timely manner: the basic situation and possible impact of the security incident, the disposal measures we have adopted or we are going to take, and the disposal measures we have or to be adopted, and the disposal measures we have or will take, and we have taken or we will take, the disposal measures we have or will take, and the disposal measures we have or to be adopted, and the disposal measures we have adopted or we are going to take, and the disposal measures that we have or to be adopted, and the disposal measures that we have or to be adopted.You can independently prevent and reduce risk suggestions, remedy measures, etc.", "label": ["Important", "Data Security"], "rewrite": "When an information security incident occurs, remedies and inform them in a timely manner in accordance with the requirements of laws and regulations."}
{"task": "rw_124.jsonl", "id": 76530, "text": "At the same time, we will inform you that the incident -related situation is in the form of mail, letter, telephone, push notification, etc. When it is difficult to inform the information subject one by one, we will publish an announcement in a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "Inform you in a timely manner of email, letter, telephone, push notification, etc."}
{"task": "rw_124.jsonl", "id": 76531, "text": "At the same time, we will also actively report the disposal of information security incidents in accordance with the requirements of the regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "According to the requirements of the regulatory authorities, the disposal of information security incidents will be proactively reported"}
{"task": "rw_124.jsonl", "id": 76532, "text": "4. Safety reminder", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76533, "text": "(1) Please understand that due to the technical restrictions and the various malicious means that may exist, even if we have tried to strengthen security measures, we cannot always ensure that the information is 100 % security.", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76534, "text": "You need to understand that the systems and communication networks you use to access our services may be due to factors outside of our controllable scope.", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76535, "text": "(2) Please be sure to keep your account, password and other identity elements properly.", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76536, "text": "When you use the services we provide, we will identify your identity through your account, password and other identity elements.", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76537, "text": "Once you leak the aforementioned information, you may suffer losses and may be unfavorable to you.", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76538, "text": "If you find that accounts, passwords and/or other identity elements may be leaked, please contact us immediately so that we can take corresponding measures in time to avoid or reduce related losses.", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76539, "text": "5. The right to manage personal information", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76540, "text": "1. The right to check", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76541, "text": "You can check in accordance with the relevant instructions (or settings) of the products and services we provided to check the relevant personal information you have provided to us (including: avatar, nickname, player number, guild basic information, personality signatures, rankings, etc., etc.If so), if you encounter problems during the access process, you need to get other personal information content that you cannot know, and you can contact us through the contact information provided by this privacy policy.", "label": ["Important", "Edit/Control"], "rewrite": "You can check the relevant personal information provided in accordance with the relevant instructions. You need to obtain other personal information content that cannot be known."}
{"task": "rw_124.jsonl", "id": 76542, "text": "2. Correction/modification rights", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76543, "text": "(1) When you find that there is an error, incomplete or updated registration error, incomplete or updated for our personal information, you can correct/modify your personal information in our products and/or services.", "label": ["Important", "Edit/Control"], "rewrite": "When the personal information is incorrect, incomplete or updated, you can correct/modify personal information in products and/or services"}
{"task": "rw_124.jsonl", "id": 76544, "text": "For some of your personal information, we provide you with an operation settings on the related functional page of the product. You can directly correct the correction/modification, such as: \"avatar/nickname/personality signature\" in the game client: Click the avatar-click Edit button/The corresponding area of the content is intended to modify the content.", "label": ["Edit/Control", "Important"], "rewrite": "You can directly correct/modify some personal information"}
{"task": "rw_124.jsonl", "id": 76545, "text": "(2) For the difficulties you encountered in the process of exercising the above rights, or other people who may not be able to provide you with online correction/modification services at present, after verification of your identity, correction/modification does not affect the objectiveness and the objectiveness of the informationIn the case of accuracy, you have the right to correct or modify the error or incomplete information, or in specific cases, especially when the data error is wrong, you can correct you through the feedback/error/contact customer service and other measures./Modify the application submitted to us, asking us to correct or modify your data, except for other provisions of laws and regulations.", "label": ["Edit/Control", "Important"], "rewrite": "You have the right to correct or modify the error or incomplete information. Under certain circumstances, you can submit the application to require us to correct or modify the data."}
{"task": "rw_124.jsonl", "id": 76546, "text": "But for the consideration of security and identification, you may not be able to modify some initial registration information submitted during registration.", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76547, "text": "3. The right to delete", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76548, "text": "When the following situation occurs, you can directly ask us to delete your personal information, but it has been anonymous or laws and regulations", "label": ["Edit/Control", "Important"], "rewrite": "You can ask us to delete your personal information, but except for anonymous processing or other regulations."}
{"task": "rw_124.jsonl", "id": 76549, "text": "Except for the other regulations:", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76550, "text": "(1) When our behavior of handling personal information violates laws and regulations;", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76551, "text": "(2) When we collect and use your personal information, but not obtained your consent;", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76552, "text": "(3) When our behavior of handling personal information is violated with your agreed;", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76553, "text": "(4) When you cancel the game account;", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76554, "text": "(5) When we terminate our services and operations.", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76555, "text": "If we decide to respond to your deletion request, unless the laws and regulations have other regulations, or these entities have obtained your independent authorization, we will also notify the entities that obtain your personal information from our personal information and ask them to delete them in time.", "label": ["Important", "Edit/Control"], "rewrite": "If you decide to respond to deletion requests, unless the laws and regulations have other provisions, or these entities are authorized by independent authorization, the entities that obtain your personal information will be deleted in time at the same time."}
{"task": "rw_124.jsonl", "id": 76556, "text": "When you delete the information from our services, we may not immediately delete the corresponding information in the backup system, but will delete these information when the backup is updated.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "When you delete information from our services, you may not immediately delete the corresponding information in the backup system, but you will delete these information when the backup update."}
{"task": "rw_124.jsonl", "id": 76557, "text": "4. Rights of the scope of the consent of the revision", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76558, "text": "You can withdraw (or stop) your authorization (such as device permissions, etc.) at any time after authorization.", "label": ["Edit/Control", "Important"], "rewrite": "You can withdraw at any time after authorization (or stop) to authorize you (such as equipment permissions, etc.)"}
{"task": "rw_124.jsonl", "id": 76559, "text": "When you update the application version, without your clear consent, we will not change the permissions status you set up before.", "label": ["Important", "Edit/Control"], "rewrite": "After updating the application version, without clear consent, the authority state set up before"}
{"task": "rw_124.jsonl", "id": 76560, "text": "You can also cancel our personal information through the way to cancel the account.", "label": ["Edit/Control", "Important"], "rewrite": "By canceling the account, we can permanently withdraw from us to continue collecting all your personal information"}
{"task": "rw_124.jsonl", "id": 76561, "text": "After the withdrawal authorization, we cannot continue to provide you with the service corresponding to the withdrawal authorization, and we will not process your corresponding information.", "label": ["Important", "Edit/Control"], "rewrite": "When the authorization is withdrawn, the service corresponding to the withdrawal authorization cannot be provided, and the corresponding information will not be processed."}
{"task": "rw_124.jsonl", "id": 76562, "text": "But your decision to withdraw authorization will not affect information processing based on your authorization.", "label": ["Permission Acquisition", "Important", "Edit/Control"], "rewrite": "However, the decision to withdraw authorization will not affect the information processing that was previously authorized"}
{"task": "rw_124.jsonl", "id": 76563, "text": "5. The right to cancel", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76564, "text": "You can apply for a cancellation of your account through the functions or customer service in the service or other publicity methods.", "label": ["Important", "Edit/Control"], "rewrite": "You can apply for a cancellation of the account through the functions or customer service or other publicity methods"}
{"task": "rw_124.jsonl", "id": 76565, "text": "When you cancel your account, you will no longer log in and use our products and services with this account;", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "After canceling the account, it will no longer log in to and use our products and services with this account;"}
{"task": "rw_124.jsonl", "id": 76566, "text": "And all the rights and interests that have been generated during the use of all products and services in this account will be removed;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "All rights and interests that have been generated but not consumed and all overdue interests in the future will be cleared"}
{"task": "rw_124.jsonl", "id": 76567, "text": "The content, information, data, records, etc. under this account will be deleted or anonymous (but the laws and regulations are otherwise stipulated or otherwise required by the regulatory authorities);", "label": ["Data Retention", "Important", "Edit/Control"], "rewrite": "The content, information, data, records, etc. under the account will be deleted or anonymous."}
{"task": "rw_124.jsonl", "id": 76568, "text": "After the cancellation of the game account is completed, it will not be recovered.", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76569, "text": "For more things about the cancellation of self -web accounts, please refer to the \"Game Account Logging up\" or contact our customer service to understand.", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76570, "text": "6. Copy the right to copy a copy", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76571, "text": "You have the right to get your personal information copy, you can contact us at any time through the way of privacy policy, we will reply to your request within 15 working days.", "label": ["Important", "Edit/Control"], "rewrite": "Have the right to obtain a copy of personal information"}
{"task": "rw_124.jsonl", "id": 76572, "text": "7. The right to restrict information system automation decision -making", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76573, "text": "In certain business functions, we may make decisions only based on the non -artificial automatic decision mechanism, including information systems, algorithms, etc..", "label": ["Important", "Usage"], "rewrite": "It will make decisions based on non -artificial automatic decision -making mechanisms including information systems, algorithms, etc."}
{"task": "rw_124.jsonl", "id": 76574, "text": "If these decisions significantly affect your legitimate rights and interests, you have the right to ask us to explain, and we will also provide appropriate relief methods.", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76575, "text": "8. The right to close relatives of the deceased", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76576, "text": "If our users died unfortunately, their close relatives can contact us through the contact information in the chapter of the \"How to contact us\" through this policy to exercise their legal rights to the relevant personal information of the deceased.", "label": ["Important", "Edit/Control"], "rewrite": "The close relatives of the dead users can exercise the legal rights of the personal information of the deceased in accordance with the law"}
{"task": "rw_124.jsonl", "id": 76577, "text": "9. How do we respond to your above right request", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76578, "text": "We will reply to you within 15 working days after receiving your request and verifying your user identity.", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76579, "text": "If you have any questions when dealing with your personal information, you can communicate with us through the contact information of \"contact us\" through Article 8 of the Privacy Policy.", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76580, "text": "But in the following circumstances, we will not be able to respond to your request:", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "But in the following circumstances, we will not be able to respond to your request:"}
{"task": "rw_124.jsonl", "id": 76581, "text": "(1) What is related to the obligations stipulated in the performance of personal information controller;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "If it is related to the obligation stipulated by the personal information controller to fulfill the law and regulations, the request cannot be responded to the request"}
{"task": "rw_124.jsonl", "id": 76582, "text": "(2) Directly related to national security and national defense security;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Those who are directly related to national security and national defense security cannot respond to requests"}
{"task": "rw_124.jsonl", "id": 76583, "text": "(3) Directly related to public safety, public health, and major public interests;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Those who are directly related to public safety, public health, and major public interests cannot respond to requests"}
{"task": "rw_124.jsonl", "id": 76584, "text": "(4) Directly related to criminal investigation, prosecution, trial, and execution judgment;", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "Those who are directly related to criminal investigation, prosecution, trial, and execution judgments cannot respond to request"}
{"task": "rw_124.jsonl", "id": 76585, "text": "(5) Personal information controller has sufficient evidence to indicate that the subject of personal information has subjective malicious or abuse of rights;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Personal information controller has sufficient evidence to indicate that the subject of personal information has subjective malice or abuse of rights, and cannot respond to the request"}
{"task": "rw_124.jsonl", "id": 76586, "text": "(6) For major legitimate rights and interests such as the life and property of the subject or other individuals, it is difficult to get my consent;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "For major legitimate rights and interests such as maintaining life and property, it is difficult to get my consent."}
{"task": "rw_124.jsonl", "id": 76587, "text": "(7) In response to the request of the subject of personal information, the legitimate rights and interests of the personal information subject or other individuals and organizations will be severely damaged;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "In response to the request of the subject of the personal information, if the legitimate rights and interests are severely damaged, the request cannot be responding to"}
{"task": "rw_124.jsonl", "id": 76588, "text": "(8) Involved in business secrets.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Those who involve business secrets cannot respond to requests"}
{"task": "rw_124.jsonl", "id": 76589, "text": "6. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76590, "text": "1. We suggest: Any minor participating in online activities should obtain the consent of the parents or other legal guardians (hereinafter referred to as \"guardian\").", "label": ["Specific Audiences", "Important"], "rewrite": "Any minor participating in online activities should obtain the consent of the parents or other legal guardians (hereinafter referred to as the \"guardian\")"}
{"task": "rw_124.jsonl", "id": 76591, "text": "We will protect relevant information about minors in accordance with the provisions of relevant national laws and regulations.", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76592, "text": "2. We encourage guardians to guide minors to use self -conscious network services.", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76593, "text": "If you are a minor under the age of fourteen, please notify your guardian to read our \"Privacy Protection Rules of Children in the Internet\", and seeking your consent and seeking personal information before you use our services and submit personal informationguide.", "label": ["Specific Audiences", "Important"], "rewrite": "Minors under the age of fourteen years old need to read the \"Privacy Conservation of Children's Privacy for Children of the Internet\" together, and seek their consent and guidance"}
{"task": "rw_124.jsonl", "id": 76594, "text": "If you are the guardian of minors, before you register and use your own network services to help minors, you should carefully read this policy and the \"Privacy Protection Rules for Children of the Internet\", and decide whether to agree with this policy and \"self -consciousness and self -consciousness\"Online Children's Privacy Protection Rules\" and help minors register and use.", "label": ["Specific Audiences", "Important"], "rewrite": "The guardians of minors should read this policy and the \"Privacy of Children's Privacy for Children of the Internet\", and decide whether to agree and help the minor register and use"}
{"task": "rw_124.jsonl", "id": 76595, "text": "For the acquisition of your information by the consent of the guardian, we will only use or disclose this information if they are allowed to be allowed, the guardian to clearly agree with or protect your rights and interests.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Important"], "rewrite": "It will only be used or disclosed publicly if it is permitted by law, the guardian clearly agrees or protects rights and interests."}
{"task": "rw_124.jsonl", "id": 76596, "text": "If your guardian does not agree that you use our services or provide information to us in accordance with this policy or the \"Privacy Protection Rules of the Self -Service Online Children\". Please immediately terminate our services and inform us in time so that we can take corresponding measures.", "label": ["Specific Audiences", "Important"], "rewrite": "If the guardian does not agree with this policy, please immediately terminate the service and notify us"}
{"task": "rw_124.jsonl", "id": 76597, "text": "3. According to the requirements of the national defense addiction policy, we will determine whether the real -name information of the relevant account is minor through information such as real -name identity and other information may be initially identified by collecting the game behavior data you generated during the game.Minors and decided to incorporate this account into the anti -addiction system.", "label": ["Specific Audiences", "Important"], "rewrite": "It will judge whether it is minor through real -name identity information and collection of game behavior data, and determine whether this account is included in the anti -addiction system."}
{"task": "rw_124.jsonl", "id": 76598, "text": "In addition, we will collect information such as your login time and game duration. By automatic intervention from the system level and restricting minors' game time and enabled offline functions, we will guide the rational game of minors.After consumption, try to contact the guardian to remind, confirm and deal with it to help minors to access the Internet.", "label": ["Specific Audiences", "First Party Collection Information", "Important"], "rewrite": "It will collect information such as login time, game duration, and use automatic intervention at the system level and restricting game time, enabling forced offline functions, etc. to guide minors to reasonable games"}
{"task": "rw_124.jsonl", "id": 76599, "text": "7. Amendment to \"Privacy Policy\"", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76600, "text": "We may amend the terms of this \"Privacy Policy\" in a timely manner, and these amendments constitute a part of the \"Privacy Policy\".", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76601, "text": "When the terms of this \"Privacy Policy\" have changed, we will prompt you to prompt you to remind you of the content of the change through page prompts, pop -ups, announcements, etc. After the version is updated.", "label": ["Policy Change", "Important"], "rewrite": "When the terms of this \"Privacy Policy\" change, the content of the change will be prompted after the version is updated."}
{"task": "rw_124.jsonl", "id": 76602, "text": "If you use or continue to use our products or services, that is, you agree that we will process your relevant information in accordance with the \"Privacy Policy\" after this or updated.", "label": ["Policy Change", "Important"], "rewrite": "Use or continue to use products or services, that is, it means that we agree to process relevant information in accordance with this policy or updated \"Privacy Policy\""}
{"task": "rw_124.jsonl", "id": 76603, "text": "Eight, contact us", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76604, "text": "1. We have set up a full -time department for personal information insured to protect your personal information in accordance with this policy.", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76605, "text": "You have any questions, opinions or suggestions on this policy, our privacy measures, and your information related matters. You can get in contact with us in any way to send emails, info@ziyitech.net or write to the following to the followingAddress: Room 1501G-3, No. 18, Guobin Road, Yangpu District, Shanghai.", "label": ["Important", "Contact Information"], "rewrite": "You can send an email to info@ziyitech.net or write to the following address: Room 1501G-3, No. 18, Guobin Road, Yangpu District, Shanghai"}
{"task": "rw_124.jsonl", "id": 76606, "text": "2. Under normal circumstances, we will reply within 15 working days after receiving your questions, opinions or suggestions, and verify your user identity.", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76607, "text": "If you are not satisfied with our response, especially our personal information processing behavior harms your legitimate rights and interests, you can also complain or report to regulatory authorities such as online information, telecommunications, public security and market supervision and management.", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76608, "text": "In addition, you understand and know that in the following situations related to personal information, we will not be able to reply to your request:", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "In the following situations related to personal information, we will not be able to reply to your request:"}
{"task": "rw_124.jsonl", "id": 76609, "text": "(1), related to national security and national defense security;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "It is related to national security and national defense security."}
{"task": "rw_124.jsonl", "id": 76610, "text": "(2), related to public safety, public health, and major public interests;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "If it is related to public safety, public health, and major public interests, the request cannot be repaid"}
{"task": "rw_124.jsonl", "id": 76611, "text": "(3), related to criminal investigation, prosecution, and trial;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "If it is related to criminal investigation, prosecution, and trial, you cannot reply to the request"}
{"task": "rw_124.jsonl", "id": 76612, "text": "(4) If there is sufficient evidence that you have subjective malice or abuse of rights;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "If there is sufficient evidence that you have subjective malice or abuse of rights, you cannot reply to the request"}
{"task": "rw_124.jsonl", "id": 76613, "text": "(5) In response to your request, the legitimate rights and interests of you or other individuals and organizations are severely damaged;", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "If the response request will cause the legitimate rights and interests to be severely damaged, the request cannot be replied"}
{"task": "rw_124.jsonl", "id": 76614, "text": "(6), involved business secrets;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Those who involve business secrets cannot be replied to the request"}
{"task": "rw_124.jsonl", "id": 76615, "text": "(7) Other situations stipulated in laws and regulations.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Other circumstances stipulated in laws and regulations, cannot reply to the request"}
{"task": "rw_124.jsonl", "id": 76616, "text": "Nine, others", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76617, "text": "1. All our services are applicable to this \"Privacy Policy\".", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76618, "text": "If we have a personal information protection statement or rules related to specific services are inconsistent with this \"Privacy Policy\", the personal information protection statement or rules of the specific service are applicable.", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76619, "text": "2. In addition to this \"Privacy Policies\", the words used in the \"Privacy Terms\" will have the same meaning as the words defined by other open clauses formulated by the self -we network.", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76620, "text": "3. The title of this \"Privacy Policy\" is only for convenience and reading, and does not affect the meaning or explanation of any provisions of the text.", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76621, "text": "4. If any clause in this \"Privacy Policy\" is completely or partially invalid or not executive, the remaining terms of this \"Privacy Policy\" should still be valid and binding and executive.", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76622, "text": "5. The establishment, performance, interpretation, and disputed resolution of this \"Privacy Policy\" all apply to the law of the People's Republic of China and exclude all his conflict law. This agreement is established in Yangpu District, Shanghai.", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76623, "text": "If any disputes occurred in the content and implementation of this \"Privacy Policy\", the parties of the dispute should be friendly and negotiated. If the negotiation cannot be, the parties to the dispute are agreed to be submitted to the Shanghai Yangpu District People's Court to jurisdiction and handling it.", "label": [], "rewrite": []}
{"task": "rw_124.jsonl", "id": 76624, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
