{"task": "rw_17.jsonl", "id": 43020, "text": "\"Douyin\" privacy policy", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43021, "text": "Update date: July 06, 2022", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43022, "text": "Effective date: July 07, 2022", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43023, "text": "\"Douyin\" refers to Beijing Micro Broadcasting Vision Technology Co., Ltd. and its related parties (hereinafter referred to as \"we\").The client application, official website, and software development tool package (SDK) and application programming interfaces used by third-party websites and applications (SDK) and application programming interfaces (SDK) and application programming interfaces (SD) and application programming interfacesAPI).", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43024, "text": "As the operator of Douyin, we know the importance of personal information to you. We will protect your personal information and privacy security in accordance with the provisions of laws and regulations.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43025, "text": "We formulate this privacy policy and special reminders: I hope you can read and understand the privacy policy carefully before using Douyin and related services to make appropriate choices.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43026, "text": "overview", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43027, "text": "We will introduce you how we handle personal information in different scenarios through this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43028, "text": "When you open or use Douyin, we will handle relevant information to achieve the functions, services you choose to use, or to comply with laws and regulations.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43029, "text": "Except for the basic functions of Douyin, the information required by the service and the required information required by laws and regulations, you can refuse us to deal with other information, but this may cause us to not provide corresponding functions and services.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43030, "text": "We will explain the relevant situation in the privacy policy. The important terms of your personal information rights and interests have been prompted in a bold form. Please pay special attention.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43031, "text": "The actual functions between Douyin and Douyin's associated versions may be slightly different, but if there is no independent privacy policy, we will follow this privacy policy collection and handle your personal information.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43032, "text": "If the associated version of Douyin has an independent privacy policy, the affiliated version of the privacy policy is applicable at the same time.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43033, "text": "If the privacy policy and the privacy policy of this associated version are inconsistent, the affiliated version of the privacy policy is applicable.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43034, "text": "In addition to this privacy policy, in specific scenarios, we will also explain the corresponding information collection purposes, scope and usage methods through instant notifications (including pop -up windows, page prompts, etc.), functional update instructions, etc. These instant notifications will be notified in real time.And functional renewal instructions, such as part of the composition privacy policy, have the same effect as this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43035, "text": "The following will help you understand how we collect, use, store, transmit, open and protect personal information;", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43036, "text": "Help you understand the way query, correct, supplement, delete, copy, and transfer personal information.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43037, "text": "Among them, the important content of your personal information rights has been prompted in a thick form, please pay special attention.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43038, "text": "1. How do we collect and use personal information", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43039, "text": "2. Partners involved in the data use process, transfer, and disclose personal information", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43040, "text": "3. Manage your personal information", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43041, "text": "4. How do we protect the security of personal information", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43042, "text": "5. How do we store personal information", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43043, "text": "6. How do we protect minors", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43044, "text": "7. Consultation and revision of privacy policies", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43045, "text": "8. Contact us", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43046, "text": "1 How do we collect and use personal information", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43047, "text": "1.1 account service", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43048, "text": "1.1.1 Registration, login", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43049, "text": "When you register, log in to Douyin and use related services, you can create an account through your mobile phone number, and you can improve the relevant network identification information (Douyin, avatar, nickname, password).You complete the registration.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you register, log in to Douyin and use related services, collect your mobile phone number and your perfect network identification information."}
{"task": "rw_17.jsonl", "id": 43050, "text": "Collecting the mobile phone number is a necessary information about the requirements of national laws and regulations on the requirements of online real -name system (real identity information certification). If you refuse to provide mobile phone numbers for registration and login, we may not be able to provide you with information release (including video, reviews, etc.)Function.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collecting mobile phone numbers is a necessary information about the requirements of national laws and regulations on the requirements of online real -name systems."}
{"task": "rw_17.jsonl", "id": 43051, "text": "Based on our cooperation with communication operators, when you use the \"one -click login\" function, after your consent, we will use the functions provided by the operator to use the mobile phone number in your device as your registration, login account and exempt from it to avoidCheck the password or dynamic verification code to provide you with fast registration and login service.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the \"one -click login\" function, after your consent, we use your mobile phone number of your device to register and log in."}
{"task": "rw_17.jsonl", "id": 43052, "text": "If you don't want to use the \"one -click login\" function, you can register and log in to Douyin in other ways.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43053, "text": "You can register and log in to Douyin with a third -party account, but you need to authorize us to obtain your information on the third -party platform (avatar, nickname and other public information and other information you authorize) to generateDouyin account allows you to register, log in and use Douyin and related services.", "label": ["Important", "First Party Collection Information"], "rewrite": "When registering and logging in with a third -party account, visit and collect your personal information after your authorization."}
{"task": "rw_17.jsonl", "id": 43054, "text": "In some cases, we need to re -verify and bind your mobile phone number to confirm the authenticity and correlation of the third -party account.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43055, "text": "If you forget the login method of your Douyin, you can use the password function.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43056, "text": "In order to ensure your account security, we may need to fill in the relevant information for verification. If necessary, you may verify your identity through real identity information verification.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "You need to fill in the relevant information for authentication."}
{"task": "rw_17.jsonl", "id": 43057, "text": "1.1.2 Real -name certification", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43058, "text": "When you open a live broadcast, apply for withdrawal, or use other real -name authentication functions or services, in order to meet the relevant requirements of laws and regulations, ensure the security of you or other users, or maintain the security and stability of the function/serviceThe real name, ID number, or face information may be different according to the actual situation) to complete the real -name authentication.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you open a live broadcast, apply for withdrawal, or use other real -name authentication functions or services, you need to provide real identity information to complete the real -name authentication."}
{"task": "rw_17.jsonl", "id": 43059, "text": "In the process of real -name authentication, a third -party certification agency that provides certification services may verify your true identity information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "A third -party certification agency that provides certification services provides real -name authentication for you."}
{"task": "rw_17.jsonl", "id": 43060, "text": "This information is for the purpose of completing the real -name authentication, or the use stipulated in other laws and regulations, and it will not be used as other purposes without the authorization of you.", "label": ["Important", "Data Security"], "rewrite": "Real -name authentication information will not be used as other purposes without your authorization."}
{"task": "rw_17.jsonl", "id": 43061, "text": "You can refuse to provide it, but you may not be able to use functions or related services that must be authenticated in order to use.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43062, "text": "Do not use such functions or services, and do not affect your use of other functions and services.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43063, "text": "Based on the relevant requirements of laws and regulations, your real -name authentication information may also be used by us for adolescent/children's protection and anti -addiction related products or services.", "label": ["Important", "Usage"], "rewrite": "Your real -name authentication information may be used for adolescent/children's protection and anti -addiction related products or services."}
{"task": "rw_17.jsonl", "id": 43064, "text": "1.1.3 Account Public Information", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43065, "text": "We will generate a jitter for your account when you register with Douyin, and the Douyin is a public identification symbol of your account.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43066, "text": "You can choose to set the jitter number according to your own needs (the number of independent settings is limited).", "label": ["Important", "Edit/Control"], "rewrite": "You can choose to set the jitter number according to your own needs."}
{"task": "rw_17.jsonl", "id": 43067, "text": "You can fill in gender, birthday, regional and personal introduction to improve your information.", "label": ["Important", "Edit/Control"], "rewrite": "You can fill in gender, birthday, regional and personal introduction to improve your information."}
{"task": "rw_17.jsonl", "id": 43068, "text": "Not filling in the information will not affect your use of Douyin account and service.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43069, "text": "Your praise, the number of attention and the list, the number of fans and the list of fans, the works you publish publicly, the vibrato video you like (like), the product you recommend, the music you collect will be in the account of the account numberPublic display on the homepage.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Your praise, the number of attention and the list of attention, the number of fans and the list of fans, the publicly released works, the favorite Douyin video, the recommended products, and the collection of music will be displayed on the personal homepage of the account."}
{"task": "rw_17.jsonl", "id": 43070, "text": "You can choose not to allow visitors to view your attention list, fan list, and Douyin videos that like (like).", "label": ["Important", "Edit/Control"], "rewrite": "You can choose not to allow visitors to view your attention list, fan list, and favorite vibrato videos."}
{"task": "rw_17.jsonl", "id": 43071, "text": "You can apply for the official certification of Douyin. After we review the certification materials you provide, you will complete your interest certification, occupational certification or other identity you choose.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43072, "text": "Certification marks and certification information will be displayed publicly in your account.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Certification marks and certification information will be displayed publicly in your account."}
{"task": "rw_17.jsonl", "id": 43073, "text": "When we issue an announcement of illegal punishment, we will announce information such as the nickname of illegal accounts.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When we issue an announcement of illegal punishment, we will announce information such as the nickname of illegal accounts."}
{"task": "rw_17.jsonl", "id": 43074, "text": "1.1.4 Douyin unified account and related version", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43075, "text": "If there is no special explanation, the associated versions of Douyin use a unified Douyin account service. The related version includes but not limited to Douyin Speed Edition, Flash, Douyin's Living Community-Ke Song, Douyin Music Edition-Soda MusicAnd other Douyin versions we launched.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The associated versions of Douyin use a unified Douyin account service."}
{"task": "rw_17.jsonl", "id": 43076, "text": "You can use the Douyin account to log in and use the associated version of Douyin to use the corresponding version of the service or function.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43077, "text": "In order to provide a consistent service experience in the associated versions of Douyin, we use SDK or related technologies to synchronize the accounts and contents in the associated version, which may include: sharing nicknames, avatars, regions, gender, etc. You set it to openAccount information;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Use SDK or related technologies to synchronize the account and content in the associated version to provide a consistent service experience."}
{"task": "rw_17.jsonl", "id": 43078, "text": "Simultaneous attention, fans and other user relationships;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Simultaneous attention and fans and other user relationships between related accounts."}
{"task": "rw_17.jsonl", "id": 43079, "text": "Synchronize the content published by this account;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Synchronize the content of the account published between the associated account."}
{"task": "rw_17.jsonl", "id": 43080, "text": "Synchronize other information you authorize.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Synchronize other information you authorized between related accounts."}
{"task": "rw_17.jsonl", "id": 43081, "text": "Please know that when using the 9.9.0 and above versions of Douyin (the version information can be click on \"I\" to enter the personal homepage and view it at the bottom of the \"Settings\" page), your registered Douyin account can log in to the Douyin volcano at the same timeEdition, except for some registered use of third -party accounts.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43082, "text": "For specific situations, please refer to the \"Account and Information Synchronization Authorization Agreement\".", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43083, "text": "1.2 Content browsing and search", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43084, "text": "In your process of browse the content of Douyin, we will record your usage.", "label": ["Important", "First Party Collection Information"], "rewrite": "In your process of browse the content of Douyin, we will record your usage."}
{"task": "rw_17.jsonl", "id": 43085, "text": "If you do not log in to the account, we will record your [click, browse, sharing information] by the corresponding identifier information of the device.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you do not log in to your account, we will record your [click, browse, share information]."}
{"task": "rw_17.jsonl", "id": 43086, "text": "If you have logged in to your account, we will record your [click, browse, sharing, attention, collection, feedback, release, praise (like), comment, etc.] through your Douyin account].", "label": ["Important", "First Party Collection Information"], "rewrite": "If you have logged in to your account, we will record your [click, browse, share, follow, collect, feedback, release, like (like), comment, etc.]."}
{"task": "rw_17.jsonl", "id": 43087, "text": "Sensor information) to ensure the quality of content or service and recommend content or services that may be interested in.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "After your authorization, we will use geographical information related to this service to ensure the quality of content or service."}
{"task": "rw_17.jsonl", "id": 43088, "text": "Among them, accurate positioning information is personal sensitive information. If you refuse to authorize position permissions, it will affect the accuracy of the positioning, but it will not affect the normal use of other functions and services. We will only be based on the cities and//////Or the district and county show you possible related content or services.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43089, "text": "In the same city channel, you can also set your own city by yourself, and we will provide the geographical location related content or services according to your settings.", "label": ["Important", "Usage"], "rewrite": "We will provide the geographical location related content or services according to your city."}
{"task": "rw_17.jsonl", "id": 43090, "text": "When you use search, we will collect your search keyword information and log records.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use search, we will collect your search keyword information and log records."}
{"task": "rw_17.jsonl", "id": 43091, "text": "Search keyword information will be temporarily stored in your device, so when you use the vibrato search function on the same device, we will show you your search history.", "label": ["Data Retention", "Important", "Usage"], "rewrite": "Search for keyword information will be temporarily stored in your device. When you use it again at the same device, you will show you."}
{"task": "rw_17.jsonl", "id": 43092, "text": "Short video browsing and search are the basic functions of Douyin. In basic functions, we will provide you with non -personalized high -quality content and search results.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43093, "text": "How to use basic functions and related personal information, please see Article 3.1.1 of this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43094, "text": "When you play videos and other content, in order to adapt to your device status, we will call the device's gravity, acceleration and other sensors to identify your device horizontal and vertical screen status.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you play videos and other content, we will call the device's gravity, acceleration and other sensors to identify your device horizontal and vertical screen status."}
{"task": "rw_17.jsonl", "id": 43095, "text": "1.3 Information release", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43096, "text": "1.3.1 audio and video, graphic, live broadcast", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43097, "text": "When you shoot or release audio, video, pictures, or release live broadcasts, we will ask you to authorize the camera, album, and microphone rights according to the function types you use.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you shoot or publish audio, video, pictures, or release live broadcasts, ask you to authorize the camera, album, and microphone rights according to the function types you use."}
{"task": "rw_17.jsonl", "id": 43098, "text": "If you refuse to authorize, you will not be able to use the shooting, release, or live broadcast function, but it does not affect other functions of your use of Douyin.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43099, "text": "We attach great importance to the user's experience. In order to improve the speed of uploading, enriching the release function and optimization experience of audio and video, when you shoot and publish audio and video, before the shooting, but click \"Publish\" to confirm upload, we will make the audio and video the audio and video.Temporary loaded to the server.", "label": ["Data Retention", "Important"], "rewrite": "When you shoot and publish audio and video, before the shooting, but click \"Publish\" to confirm upload, we will temporarily load the audio and video to the server."}
{"task": "rw_17.jsonl", "id": 43100, "text": "If you cancel or upload it for other reasons, we will immediately delete related audio and videos.", "label": ["Data Retention", "Important"], "rewrite": "If you cancel or upload the shooting for other reasons, we will immediately delete related audio and videos."}
{"task": "rw_17.jsonl", "id": 43101, "text": "We respect your right to choose. If you want to close the pre -loading function, you can close this function according to the path provided in Article 3.1.4 of this privacy policy.", "label": ["Important", "Edit/Control"], "rewrite": "You can turn off the pre -loading function."}
{"task": "rw_17.jsonl", "id": 43102, "text": "The content you posted will show your avatar, nickname, Douyin and other information. You can set the visible range of the content provided by the path provided by Article 3.1.4 of this privacy policy.", "label": ["Important", "Edit/Control"], "rewrite": "The content you posted will show your avatar, nickname, Douyin and other information, you can set the scope of the content of the content."}
{"task": "rw_17.jsonl", "id": 43103, "text": "When you release a live broadcast, you can set the visible range of the live broadcast room.", "label": ["Important", "Edit/Control"], "rewrite": "When you release a live broadcast, you can set the visible range of the live broadcast room."}
{"task": "rw_17.jsonl", "id": 43104, "text": "1.3.2 Tools", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43105, "text": "When you use the props, special effects, filters, stickers and other tools you provided in Douyin, we will use sensor information based on your operation and tool types to adapt to the tools you choose.", "label": ["Important", "Usage"], "rewrite": "When you use the props, special effects, filters, stickers and other tools you provide in Douyin, we will use your sensor information."}
{"task": "rw_17.jsonl", "id": 43106, "text": "Some tools need to process your personal information:", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43107, "text": "(1) If you choose a tool that needs to be fitted with the face of the person in the image when shooting the content, we need to identify your facial feature value information to provide better visual effects.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you choose a tool that needs to be fitted with the face of the person in the image when shooting the content, we need to identify your facial feature value information."}
{"task": "rw_17.jsonl", "id": 43108, "text": "In the process, unless there is another clear explanation and obtaining your individual consent, we will not return, store or provide the above information to third parties. This information will only be processed locally in your device (such as mobile phones).", "label": ["Important", "Data Security"], "rewrite": "We will not return, store, or provide your facial recognition information to a third party, unless there is another clear explanation and obtain your alone consent."}
{"task": "rw_17.jsonl", "id": 43109, "text": "If you refuse to authorize, you will not be able to use this function, but it will not affect your other functions of using Douyin.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43110, "text": "(2) If you choose to use geographical stickers when you shoot or edit the content, we will use your geographical location information to generate stickers.", "label": ["Important", "Usage"], "rewrite": "If you choose geographical stickers when you shoot or edit content, we will use your geographical location information to generate stickers with authorization."}
{"task": "rw_17.jsonl", "id": 43111, "text": "The stickers will be publicly displayed in the content.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The stickers will be publicly displayed in the content."}
{"task": "rw_17.jsonl", "id": 43112, "text": "If you refuse to authorize, you will not be able to use this function, but it will not affect your other functions of using Douyin.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43113, "text": "(3), if you add a geographical location link (referred to as the \"anchor point\") when you are published, we will use your geographical location information to display the corresponding anchor point in the content.", "label": ["Important", "Usage"], "rewrite": "If you add a geographical link when you are published, we will use your geographical location information by authorization."}
{"task": "rw_17.jsonl", "id": 43114, "text": "If you refuse to authorize, you can also search or use the cities or districts we recommend to you by yourself.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43115, "text": "(4), if you add applets and games provided by third -party developers when you release, third -party developers will collect and process the information required to implement functions.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you add a small program and mini -game provided by third -party developers when you release, third -party developers will collect and process the information required to implement functions."}
{"task": "rw_17.jsonl", "id": 43116, "text": "Unless otherwise explained, we do not directly handle your personal information collected by the third party developer.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43117, "text": "1.4 Interactive communication", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43118, "text": "1.4.1 Add friends", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43119, "text": "You can add friends by scanning the two -dimensional code.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43120, "text": "You can also add friends by searching for nicknames, Douyin, etc.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43121, "text": "When you add or delete your friends in Douyin, we will create/adjust friends list, attention and fan relationship.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43122, "text": "1.4.2 Friend recommendation", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43123, "text": "We may recommend the relationship between mobile numbers, address books, attention, fans, etc. authorized by you and other users, or recommend information on your own information on your personal homepage, and the interaction behavior of you and other users to recommend to you.", "label": ["Important", "Usage"], "rewrite": "We may recommend friends to you to recommend friends based on the authorized mobile phone numbers, address book, attention, fans, etc., or information and interactive behaviors displayed from the outside."}
{"task": "rw_17.jsonl", "id": 43124, "text": "We will request a communication records to process the information in the communication record for high -intensity encryption algorithms, and use it to recommend friends in the communication recording to users.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "We will request a communication records. After encrypted the information in the communication recording, we will use the friends in the user to recommend the communication recording to the user."}
{"task": "rw_17.jsonl", "id": 43125, "text": "Please know that if other users uploaded in the address book contain your contact information and other information, the system may also recommend friends or recommend you to the corresponding users based on the information.", "label": ["Important", "Usage"], "rewrite": "If the address book uploaded by other users contains your contact information and other information, the system may also recommend friends or recommend you to the corresponding users based on the information."}
{"task": "rw_17.jsonl", "id": 43126, "text": "We will recommend nearby people to users based on user -authorized geographical information. Therefore, after you authorize to open the geographical location authority, we will receive friends we recommend to you and recommend you as nearby friends.", "label": ["Important", "Usage"], "rewrite": "We will recommend users nearby people based on the geographical information authorized by users."}
{"task": "rw_17.jsonl", "id": 43127, "text": "When you use \"shaking\" and \"shaking\", when you need to match the functions of other users through geographical location, after your authorization, we will use geographical location information related to function (such as accurate positioning information, WLAN access points, Bluetooth and base station) to complete matching and recommendation.", "label": ["Important", "Usage"], "rewrite": "After your authorization, we will use functional location information related to function to achieve functions such as \"shaking\" and \"shaking\"."}
{"task": "rw_17.jsonl", "id": 43128, "text": "The precise positioning information is personal sensitive information. If you refuse to authorize the location authority, you will not be able to use this matching function, but it will not affect other functions in the use of Douyin.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43129, "text": "1.4.3 Friends Interaction", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43130, "text": "When you interact between Douyin friends, in order to maintain the stability of the service, we may collect your interactive information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you interact between Douyin friends, we may collect your interactive information."}
{"task": "rw_17.jsonl", "id": 43131, "text": "When you use group functions for interactive exchanges, we will collect information related to groups and group members and form group lists.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use group functions for interactive exchanges, we will collect information related to groups and group members and form group lists."}
{"task": "rw_17.jsonl", "id": 43132, "text": "Douyin users (referred to as \"mutual friends\") can see each other's active/online state in Douyin.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The vibrato users who follow each other can see the active/online state of the other party in Douyin."}
{"task": "rw_17.jsonl", "id": 43133, "text": "Active/online state refers to whether the account is online or once online.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43134, "text": "You can turn off this function. After the closure, you and your friends cannot see the active/online state of the other party.", "label": ["Edit/Control", "Important"], "rewrite": "You can close the function of the opponent's status. After the closure, neither you and the friends of the interoperability cannot see the active/online state of the other party."}
{"task": "rw_17.jsonl", "id": 43135, "text": "For example, when you publish content and comments@Other users, browse, forward, and share the content of other users, visit the personal homepage of other users, and shoot videos with other users, we will record the interaction between you.", "label": ["Important", "First Party Collection Information"], "rewrite": "For example, when you publish content and comments@Other users, browse, forward, and share the content of other users, visit the personal homepage of other users, and shoot videos with other users, we will record the interaction between you."}
{"task": "rw_17.jsonl", "id": 43136, "text": "Among them, you can choose not to show your personal homepage and browse content.", "label": ["Important", "Edit/Control"], "rewrite": "You can choose not to show your visit to your personal homepage and browsing content."}
{"task": "rw_17.jsonl", "id": 43137, "text": "1.4.4 Live interactive interaction", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43138, "text": "If you are the anchor of the live broadcast, you will show your vibrato nickname and avatar in the live broadcast room.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you are the anchor of the live broadcast, you will show your vibrato nickname and avatar in the live broadcast room."}
{"task": "rw_17.jsonl", "id": 43139, "text": "At the same time, information you received in the live broadcast room, the number of online people online, the live broadcast period, the live broadcast period, etc. will also be displayed publicly.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The comments, gifts, likes, the number of online lives, live broadcasts, and live broadcasts will also be displayed publicly."}
{"task": "rw_17.jsonl", "id": 43140, "text": "If you are a user watching live broadcast, your Douyin nickname, avatar, and interactive information in the live broadcast room (interactive information includes but not limited to reviews, rewards, gifts, live broadcasts online status, etc.) will be publicly displayed in the live broadcast room, and at the same timeWe will form statistics in the live broadcast room based on your interaction and active situation (such as lists, heat, etc.) and display publicly.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you are a user watching the live broadcast, your Douyin nickname, avatar, and live broadcast interactive information will be publicly displayed in the live broadcast room, and statistical data is formed according to your active situation."}
{"task": "rw_17.jsonl", "id": 43141, "text": "1.4.5 \"Shaking\" and \"shake\" and other interactions that depend on the development of action", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43142, "text": "When you do \"shake\" and \"shake\", such as interaction or activities that depend on the development of action, we will use your sensor information (pure sensor data does not belong to personal information) to identify your movements and use your movements.Participate in the event or show you the next interactive scene.", "label": ["Important", "Usage"], "rewrite": "We use your sensor information when you do \"shake one shake\" and \"shake\", such as \"shaking\" and \"shaking\"."}
{"task": "rw_17.jsonl", "id": 43143, "text": "1.5 Personalized recommendation", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43144, "text": "Function description: In order to show you and recommend more information, provide services that meet your requirements. Douyin will collect, use your personal information, and automatically calculate and predict your preferences through computer algorithm models to match youMay be interested in information or services. The following we will explain to you in detail the operating mechanism of this personalized recommendation service and the way you implement control.", "label": ["Important", "Usage"], "rewrite": "Collect, use your personal information, and automatically calculate and predict your preferences through the computer algorithm model for personalized recommendations."}
{"task": "rw_17.jsonl", "id": 43145, "text": "a) The scope of our personalized recommendation services includes but is not limited to display graphic or video/live content, provides search results, recommended products, services or advertising.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43146, "text": "b), in order to predict your preference, we may collect and use your equipment information, location information, and behavior information when using Douyin. Behavioral information includes your content browsing, information release, interactive communication when using Douyin, interactive communication, Search, click, follow, collect, browse, download, share, and trading the corresponding information, including the gender, birthday, regional and other account information in the account you filled in.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "To predict your preferences, we may collect and use your device information, location information, and behavior information when using Douyin."}
{"task": "rw_17.jsonl", "id": 43147, "text": "We will automatically analyze and calculate the above information, and the machine (or system) will automatically screen and push the content you may be more interested in according to the calculation results.", "label": ["Important", "Usage"], "rewrite": "The machine will automatically screen and push the content that you may be more interested in according to the calculation results."}
{"task": "rw_17.jsonl", "id": 43148, "text": "c), we will give real -time feedback on the recommendation model based on the content of your content in the process of using the vibrato, and constantly adjust the optimization results to better provide you with high -quality content.", "label": ["Important", "Usage"], "rewrite": "We will give real -time feedback on the recommendation model based on the content of your content in the process of using the vibrato."}
{"task": "rw_17.jsonl", "id": 43149, "text": "Please know that the personalized recommendation algorithm in Douyin does not identify the true identity of a specific natural person, just to provide higher and richer information based on user behavior and characteristics.", "label": ["Important", "Usage"], "rewrite": "The personalized recommendation algorithm in Douyin does not identify the true identity of a specific natural person."}
{"task": "rw_17.jsonl", "id": 43150, "text": "You can close personalized push according to the introduction of Article 3.1.5 of this privacy policy, or to close personalized or programmatic advertising push according to the introduction of Article 3.1.5 of this privacy policy. When you close it, we will not be based on it based on it.The purpose of personalized push will handle your personal information, and will only push you to you with universal content or advertisements that have nothing to do with your preference.", "label": ["Important", "Usage"], "rewrite": "When you close personalized recommendations, we will not process your personal information based on the purpose of personalized push, and only push universal content or advertisements."}
{"task": "rw_17.jsonl", "id": 43151, "text": "1.6 Other functions", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43152, "text": "1.6.1 message notice", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43153, "text": "You know and agree, we may send you one or more types of notifications at the same time through the contact information (eg:: phone number) provided by you in the process of using the product and/or serviceInform, authentication, security verification, user experience research;", "label": ["Important", "Usage"], "rewrite": "You know and agree that we may notify you to send notifications to you through the contact information provided by you."}
{"task": "rw_17.jsonl", "id": 43154, "text": "In addition, we may also provide you with commercial information such as services, functions, or activities that you may be interested in by text messages and telephones.", "label": ["Important", "Usage"], "rewrite": "We may also provide you with commercial information in a SMS and phone call."}
{"task": "rw_17.jsonl", "id": 43155, "text": "But please rest assured that if you do not want to accept this information, you can unsubscribe the booking method provided in the mobile phone SMS, or you can contact us directly to the withdrawal.", "label": ["Important", "Edit/Control"], "rewrite": "You can use the withdrawal method provided in the mobile phone SMS, or you can contact us directly with us."}
{"task": "rw_17.jsonl", "id": 43156, "text": "We will push you your account dynamics, the user or content dynamic, hot content, recommendation content, etc. to you through the system notification of your device.The notification settings you want to select the information you want to receive.", "label": ["Important", "Usage", "Edit/Control"], "rewrite": "We will push you your account dynamics, the user or content dynamics, hot content, recommendation content, etc. to you through the system notification of your device, you can choose to close."}
{"task": "rw_17.jsonl", "id": 43157, "text": "1.6.2 Share and interact", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43158, "text": "In the case of sharing or receiving information, participating in activities, the Douyin client needs to visit your shear plate locally, read the passwords, sharing code, and links contained in it to achieve jumping, sharing, and activitiesLinks and other functions or services.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "In the case you share or receive information, participate in activities, etc., the Douyin client needs to visit your scissors locally to read the content."}
{"task": "rw_17.jsonl", "id": 43159, "text": "Douyin client only uploads our server only when the contents of the shear plates belong to the instructions of Douyin jumping, sharing, and activity linkage.", "label": ["Data Retention", "Important", "Usage"], "rewrite": "Only instructions such as Douyin Jumping, Sharing, and Lienity of Activity linkage are uploaded only in the local identification of instructions."}
{"task": "rw_17.jsonl", "id": 43160, "text": "In addition, the Douyin client will not upload other information of your cut plate to our server.", "label": ["Data Retention", "Important"], "rewrite": "The Douyin client will not upload other information of your cut plate to our server."}
{"task": "rw_17.jsonl", "id": 43161, "text": "In addition, we may need to read your mobile album for you to share or receive videos and pictures shared.", "label": ["Permission Acquisition", "Important"], "rewrite": "We may need to read your mobile phone album so that you can share or receive videos and pictures shared."}
{"task": "rw_17.jsonl", "id": 43162, "text": "The system of some mobile phone equipment prompts the application (APP) to read the shear or album, but the system prompts that it cannot be distinguished or uploaded by local processing or uploading, and due to the differences in statistical methods, the possibility of misunderstanding is not ruled out.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43163, "text": "Therefore, if you find similar prompts and have questions, please contact us so that we can locate the problem.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43164, "text": "1.6.3 Calendar appointment", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43165, "text": "When you use videos, live broadcasts, activities, etc., we will apply for your device calendar authority.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use videos, live broadcasts, activities, etc., we will apply for your device calendar authority."}
{"task": "rw_17.jsonl", "id": 43166, "text": "After you start the relevant permissions, we will access your calendar to help you make an appointment or adjust the time, live broadcast, and event time, and remind you through the calendar function at the time you make appointments.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "After you start the relevant permissions, we will visit your calendar to help you make an appointment or adjust the appointment."}
{"task": "rw_17.jsonl", "id": 43167, "text": "Rejecting authorization will not be able to use the appointment service, but it will not affect the normal use of other functions of Douyin.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43168, "text": "1.6.4 Order Center", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43169, "text": "When you buy goods or services, we may provide a third -party to collect your order information.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "When you buy goods or services, we may provide a third -party to collect your order information."}
{"task": "rw_17.jsonl", "id": 43170, "text": "At the same time, we will summarize your order information collected by the above third parties. You can check and manage the order in [I]-[â‰¡]-[My Order]. You can also select in the [Settings] of the Order Center.Reject all or in the third direction of our synchronous order information.", "label": ["Important", "Edit/Control"], "rewrite": "You can query and manage the order in [I]-[-]-[My Order], or you can choose to refuse all or part of the third direction in the [Settings] of the Order Center."}
{"task": "rw_17.jsonl", "id": 43171, "text": "1.7 operation and safe operation", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43172, "text": "We are committed to providing you with a safe, credible product and use environment, and providing high -quality and reliable services and information is our core goal.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43173, "text": "In order to maintain the normal and stable operation of related products or services and protect the security and legitimate interests of you or other users or the public, we will collect the following necessary information:", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to maintain the normal and stable operation of related products or services and protect the security and legitimate interests of you or other users or the public, we will collect your use information, equipment information, etc."}
{"task": "rw_17.jsonl", "id": 43174, "text": "(1) In order to ensure the quality and efficiency of the safe operation and operation of software and services, we will collect your hardware model, operating system version number, equipment identifier (Android, Androidid, OAID, IMSI, ICCID, GAID, Meid, IOS such as IDFV, IDFA;", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to ensure the quality and efficiency of software and services, we will collect your hardware model, operating system version number, and equipment identifier."}
{"task": "rw_17.jsonl", "id": 43175, "text": "Different identifiers will be different in the validity period, whether the user can be reset, and the method of acquisition), the hardware address (MAC address) of the network equipment (MAC), the hardware serial number, the IP address, the WLAN access point (such as SSID, BSSID), Bluetooth Bluetooth, Bluetooth(BlueTooth), base stations, software versions, network access methods, types, status, network quality data, operation, use, service log, sensor information and other data.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43176, "text": "(2) In order to prevent malicious procedures and ensure the quality and efficiency of operating, we will collect the application information or the process information of the processing, the overall operation of the application, the frequency of usage and frequency, the application of the application, the overall installation, and the performance data, Application source.", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to prevent malicious procedures and ensure the quality and efficiency of operations, we will collect and install the application information or the process information that is being running."}
{"task": "rw_17.jsonl", "id": 43177, "text": "(3) We may use your account information, equipment information, service log information, and our related parties and partners to obtain information you authorized or provided to us in accordance with the law to judge account security, transaction security, identity verification, verify identity verification, Identify illegal and illegal conditions, test and prevent safety incidents, and take necessary records, analysis, and disposal measures in accordance with the law.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may use your account information, equipment information, service log information, and information provided by the third parties to judge account security and transaction security."}
{"task": "rw_17.jsonl", "id": 43178, "text": "1.8 use of cookies equal similar technologies", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43179, "text": "Similar technologies such as Cookie and Equipment Information Makes are commonly used in the Internet.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43180, "text": "When you use Douyin and related services, we may use related technologies to send one or more cookies to your device, or anonymous identifier to collect and identify the information when you access and use this product.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use Douyin and related services, you may use cookie or anonymous identifiers to collect and identify the information when you access and use the product."}
{"task": "rw_17.jsonl", "id": 43181, "text": "We promise that cookies will not be used for any other purposes other than the purpose of this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43182, "text": "We use cookies and similar technologies to achieve the following functions or services:", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43183, "text": "Guarantee the safety and efficient operation of products and services: We may set COOKIE, or anonymous identifiers that certify and guarantee security, so that we can confirm whether you log in to the service safely, or whether you encounter stolen, fraud and other illegal acts.", "label": ["Important", "Data Security", "Usage"], "rewrite": "We may set up Cookie or anonymous identifier that guarantees security and ensure security, so that we can confirm whether you are safely logging in to the service."}
{"task": "rw_17.jsonl", "id": 43184, "text": "These technologies also help us improve service efficiency, improve login and response speed.", "label": ["Important", "Usage"], "rewrite": "Cookie technology helps us improve service efficiency, improve login and response speed."}
{"task": "rw_17.jsonl", "id": 43185, "text": "Help you get a easier access experience: using such technologies can help you save the steps and processes of personal information and enter search content (example: record search, form filling).", "label": ["Important", "Usage"], "rewrite": "Cookie technology helps you get a easier access experience."}
{"task": "rw_17.jsonl", "id": 43186, "text": "Recommend, display, and push the content or account you may be interested in: We may use such technologies to understand your preferences and use habits, analyze data to improve information or functions that users are interested in.Optimize your choice of advertising or content.", "label": ["Important", "Usage"], "rewrite": "We may use cookie technology to understand your preferences and use habits, and analyze data to improve product services."}
{"task": "rw_17.jsonl", "id": 43187, "text": "In the sharing page of Douyin, we may use Cookie to record the browsing activities to recommend information to you and check collapse, delayed related conditions, and explore better service methods.", "label": ["Important", "Usage"], "rewrite": "In the sharing page of Douyin, we may use Cookie to record the browsing activities."}
{"task": "rw_17.jsonl", "id": 43188, "text": "Cookie's removal,: If you use the Douyin web version, most browsers provide users with the function of removing the browser cache data. You can operate the Cookie data in the browser settings, but it may not be able to use us after clearing us.Provided, relying on Cookie's features or services.", "label": ["Important", "Edit/Control"], "rewrite": "You can operate Cookie data in the browser settings."}
{"task": "rw_17.jsonl", "id": 43189, "text": "1.9 Change of the service content", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43190, "text": "Please understand that with the development of our business, the products or services provided by Douyin may be adjusted.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43191, "text": "If the purpose, method, and scope of the personal information after adjustment of the change of the change will change, we will tell you again and obtain your consent in accordance with the relevant requirements of the laws and regulations.", "label": ["Important", "Data Security"], "rewrite": "If the purpose, method, and scope of the personal information after adjusting the change of the change will change, we will tell you again and obtain your consent."}
{"task": "rw_17.jsonl", "id": 43192, "text": "1.10 Exemption to obtain consent to handle personal information according to law", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43193, "text": "Please understand that in the following situations, according to laws and regulations, we handle your personal information without obtain your authorization consent.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In the following situations, according to laws and regulations, we do not need to obtain your authorization consent."}
{"task": "rw_17.jsonl", "id": 43194, "text": "a), required to be established or fulfilled according to your requirements;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "According to your requirements, the collection and usage information necessary for the contract is required without authorization consent."}
{"task": "rw_17.jsonl", "id": 43195, "text": "b) In order to fulfill the statutory responsibility or statutory obligations such as national security, defense security, criminal investigation, prosecution, trial and judgment implementation with national security, defense security, criminal investigation, prosecution, trial and judgment implementation;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to fulfill the statutory duties or the collection and usage information necessary for the statutory volunteer, there is no need to solicit authorization consent."}
{"task": "rw_17.jsonl", "id": 43196, "text": "c), to deal with emergencies, or in urgent situations to protect the health and property safety of natural people;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to cope with emergencies, or in urgent cases to protect the life and health of natural persons and the necessary collection and use information, no need to solicit authorization."}
{"task": "rw_17.jsonl", "id": 43197, "text": "d), implement news reports, public opinion supervision and other behaviors for public interests, and handle personal information within a reasonable scope;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to implement news reports and public opinion supervision, deal with personal information within a reasonable scope without soliciting authorization consent."}
{"task": "rw_17.jsonl", "id": 43198, "text": "e), deal with your own personal information within a reasonable range, or other legal information that has been legal (such as legal news reports, government information disclosure and other channels to legal public information); legal information and disclosure of government information); legal information and disclosure of government information;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Treatment your own personal information within a reasonable range, or other legal information that has been legal and disclosed without soliciting authorization consent."}
{"task": "rw_17.jsonl", "id": 43199, "text": "f), other circumstances stipulated in laws and regulations.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Other collection and use information stipulated in laws and regulations does not need to solicit authorization."}
{"task": "rw_17.jsonl", "id": 43200, "text": "Special explanation: According to the law, if the information cannot be separated or combined with other information to identify specific individuals, it does not belong to personal information.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43201, "text": "When your information can be identified alone or in conjunction with other information, or we use the combination of data that is not connected with any specific individuals with your personal information, we will use it as your personal information and according to this privacy policyTreatment and protection.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43202, "text": "2 The partners involved in the data use and transfer and disclose personal information", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43203, "text": "2.1 The partner involved in the data use process", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43204, "text": "2.1.1 Basic Principles", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43205, "text": "In the process of cooperating with the partners, we will comply with the following principles:", "label": ["Third Party Sharing/ Disclosure", "Data Security"], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43206, "text": "a) Legal principles: Those who involve data processing activities shall abide by the legal principles.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43207, "text": "b) Principles and minimum necessary principles: Data use must have a legitimate purpose, and it should be limited to the purpose of achievement.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43208, "text": "c) Principles of security and prudential: We will carefully evaluate the purpose of the partners' use of data, comprehensively evaluate the security guarantee capabilities of these partners, and ask them to follow the legal agreement of cooperation.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43209, "text": "We will strictly monitor the software tool development package (SDK) and application interface (API) that the partners obtain information to protect data security.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will strictly monitor the SDK and APIs of the partner to protect data security."}
{"task": "rw_17.jsonl", "id": 43210, "text": "Access to cooperative SDK directory", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43211, "text": "2.1.2 Entrusted processing", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43212, "text": "For the scene of commissioning to handle personal information, we will sign the relevant processing agreement with the trustee and cooperation in accordance with the law and supervise the personal information usage activities.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For the scene of commissioning personal information, we will sign a related processing agreement with the trustee and supervise their personal information use activities."}
{"task": "rw_17.jsonl", "id": 43213, "text": "2.1.3 Common processing", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43214, "text": "For the scenario of jointly handling personal information, we will sign relevant agreements with the partners in accordance with the law and agreed that their rights and obligations to ensure that in the process of using relevant personal information and protect the security of data and protect data security.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For the scene of jointly handling personal information, we will sign relevant agreements with the partners and agreed to their respective rights and obligations in accordance with the law."}
{"task": "rw_17.jsonl", "id": 43215, "text": "2.1.4 The scope of the partner", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43216, "text": "If the specific functions and scenarios are provided by our affiliates and third parties, the scope of the partner includes our affiliates and third parties.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43217, "text": "2.2 Scenes of cooperation", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43218, "text": "2.2.1 To achieve the business function of Douyin", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43219, "text": "a), geographic location service: When you use geographical related services, location service providers (such as Gaode Map) may use your GPS information and equipment information through SDK or related technologies so that you can return to you.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When you use geographical location -related services, the location service provider may use your GPS information and equipment information to return to you to return to you."}
{"task": "rw_17.jsonl", "id": 43220, "text": "Rejecting the above use only affects the function of geographical location, but does not affect the normal use of other functions.", "label": ["Usage"], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43221, "text": "b), message notification: In order to adapt the message push function with the terminal model you used, terminal equipment manufacturers (Huawei, Xiaomi, OPPO, vivo, etc.) may use your mobile phone model, version and related device information through SDK and other technologiesEssence", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to adapt the message push function with the terminal model you use, terminal equipment manufacturers may use your mobile phone model, version and related equipment information."}
{"task": "rw_17.jsonl", "id": 43222, "text": "c), log in and bind other third -party accounts: When you log in to other third -party products or services with Douyin account, or bind the Douyin account with other third -party accounts, after your consentThe products or services will use your nickname, avatar and other information you authorize.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When you log in to other third -party products or services with Douyin account, or bind the Douyin account with other third -party accounts, after your consent, the above -mentioned third -party products or services will use your nickname and avatar.And other information you authorize."}
{"task": "rw_17.jsonl", "id": 43223, "text": "d), buy goods or services: The shopping function in the Douyin is provided to you by the e -commerce platform that cooperates with us.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The shopping function in Douyin is provided by the e -commerce platform that cooperates with us."}
{"task": "rw_17.jsonl", "id": 43224, "text": "E -commerce platforms may need to collect information about your browsing products and purchase products.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "E -commerce platforms may need to collect information about your browsing products and purchase products."}
{"task": "rw_17.jsonl", "id": 43225, "text": "If you need to learn more, you can consult the corresponding privacy policy of the partner.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43226, "text": "e), mini -game, applet: When you use small programs, mini -games and other applications provided by third parties in Douyin, such as small programs and mini games need to use your personal information, you will apply for your authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "When you use small programs, mini -games and other applications provided by third parties in Douyin, such as small programs and mini -games need to use your personal information, you will apply for your authorization consent."}
{"task": "rw_17.jsonl", "id": 43227, "text": "Without your consent, we will not provide your personal information to these developers (or operators).", "label": ["Important", "Data Security"], "rewrite": "Without your consent, we will not provide your personal information to the developer (or operator) of the applet."}
{"task": "rw_17.jsonl", "id": 43228, "text": "Some small programs may apply to you to use system permissions such as geographical location, microphone, and camera, and you can withdraw authorization in the applet.", "label": ["Permission Acquisition", "Important", "Edit/Control"], "rewrite": "Some small programs may apply to you to use system permissions such as geographical location, microphone, and camera, and you can withdraw authorization in the applet."}
{"task": "rw_17.jsonl", "id": 43229, "text": "f), activity participation: When you choose to participate in the marketing activities we organized, after your consent, we and partners may need to use your name, communication address, contact information, bank account and other information in order to fulfill your event in the event.award.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "When you choose to participate in marketing activities, after your consent, you may need to use your name, communication address, contact information, bank account and other information in order to achieve your reward in the cooperation direction."}
{"task": "rw_17.jsonl", "id": 43230, "text": "When you participate in the marketing activities co -organized by the related parties, you may synchronize your account (including identifier), participating achievements, progress, schedule, schedule, schedule, schedule, and schedule between multiple mobile applications of mobile applications (referred to as \"activity platform\")., Income and other information to ensure that you get a complete service experience in the event.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When you participate in marketing activities co -organized by related parties, you may synchronize information about your participation in the event account, participation results, progress, income and other information between multiple event platforms."}
{"task": "rw_17.jsonl", "id": 43231, "text": "g) Customer service: In order to deal with your complaints, suggestions, and other demands in a timely manner, customer service providers need to use your account and related information, and understand, process and respond to your needs in a timely manner.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "In order to deal with your complaints, suggestions, and other demands in time, customer service providers need to use your account and related information."}
{"task": "rw_17.jsonl", "id": 43232, "text": "If necessary, you may need to use your mobile phone number or to get in touch with you through other communication methods.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "If necessary, you may need to use your mobile phone number or to get in touch with you through other communication methods."}
{"task": "rw_17.jsonl", "id": 43233, "text": "h), wallet function: various services in the wallet function are provided by our affiliates and partners. When you use wallet -related functions, our related parties and partners will collect information within the necessary limit according to the function or service necessary., Specifically, the authorization of the corresponding wallet function shall prevail.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When you use wallet -related functions, our partners will collect information within the necessary limit according to their functions or services."}
{"task": "rw_17.jsonl", "id": 43234, "text": "i), payment service: The payment function will provide you with a third -party payment institution in cooperation with us.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The payment function will provide you with a third -party payment institution that cooperates with us."}
{"task": "rw_17.jsonl", "id": 43235, "text": "Third -party payment institutions may need to collect your name, ID number, bank card type and card number, validity period and mobile phone number.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Third -party payment institutions may need to collect your name, ID number, bank card type and card number, validity period and mobile phone number."}
{"task": "rw_17.jsonl", "id": 43236, "text": "The identity card number and bank card related information are personal sensitive information. This information is an information necessary for payment functions. It refuses to provide normal use that will cause you to use this function, but does not affect other functions.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43237, "text": "Douyin payment function is provided by Wuhan Hezhong Yibao Technology Co., Ltd. (referred to as \"Hezhong Yibao\") to you.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43238, "text": "When you pay with Douyin, Hezhong Yibao will collect your relevant information in accordance with laws and regulations and regulatory regulations to think that you provide payment services.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "When you pay with Douyin, Hezhong Yibao will collect your relevant information for your payment service."}
{"task": "rw_17.jsonl", "id": 43239, "text": "If you need to learn more about the privacy policy of the Douyin payment function, you can further review the related privacy policies of Hezhong Yibao.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43240, "text": "2.2.2 Advertising", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43241, "text": "We may share and analyze the identified device information or statistical information with advertising service providers, suppliers and other partners (collectively referred to as \"advertising partners\"). This information is difficult or unable to associate with your true identity.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share and analyze device information or statistical information with advertising partners."}
{"task": "rw_17.jsonl", "id": 43242, "text": "This information will help us analyze and measure the effectiveness of advertising and related services.", "label": ["Important", "Usage"], "rewrite": "Equipment information and statistical information will help us analyze and measure the effectiveness of advertising and related services."}
{"task": "rw_17.jsonl", "id": 43243, "text": "a), advertising push and launch: Advertising partners for push/promotion and advertising or provide related services may need to use device, network, channel information and label information after delaid or anonymousization;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Advertising partners may need to use device, network, channel information, and label information that are identified or anonymous."}
{"task": "rw_17.jsonl", "id": 43244, "text": "Advertising partners in advertising push/promotion and release/analysis services that cooperate with advertisers may need to use the aforementioned information to achieve the effective touch rate of advertising, optimization and enhancement of advertising.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Advertising partners may need to use equipment, networks, channel information, and label information to achieve the effective reach of advertising, optimization and enhancement of advertising."}
{"task": "rw_17.jsonl", "id": 43245, "text": "b), Advertising Statistical Analysis: Advertising partners providing advertising statistical analysis services may need to use information such as your equipment, network, advertising clicks, browsing, display, and advertising transformation data to analyze, measure, improve the effectiveness of advertising and related services.sex.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Advertising partners may need to use information such as your device, network, advertising clicks, browsing, displaying, and advertising transformation data to analyze, measure, and improve the effectiveness of advertising and related services."}
{"task": "rw_17.jsonl", "id": 43246, "text": "c), the use of advertising partners on information: Advertising partners may combine the above information with other legal obtained data to optimize the effect of advertising.The user's legal rights are not violated.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Advertising partners may combine the above information with other legally obtained data to optimize the effect of advertising."}
{"task": "rw_17.jsonl", "id": 43247, "text": "d), advertising information: You actively fill in and submit contact information, addresses and other related information in the advertisement may be collected and used by advertisers or entrusted partners.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "The contact information, addresses and other related information that you actively fill in and submitted in the advertisement may be collected and used by advertisers or entrusted partners."}
{"task": "rw_17.jsonl", "id": 43248, "text": "2.2.3 Realize safety and statistical analysis", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43249, "text": "a), ensure the safety of use: We attach great importance to the safety of products and services. In order to ensure the legitimate rights and interests of Douyin users from illegal infringement, our partners may use necessary equipment, accounts and log information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "In order to ensure the legitimate rights and interests of Douyin users from illegal infringement, our partners may use the necessary equipment, accounts and log information."}
{"task": "rw_17.jsonl", "id": 43250, "text": "b) Analysis of product conditions: In order to analyze the stability of Douyin's products and services, partners who provide analysis services may need to use the service situation (collapse, flashback record), equipment identification information, and overall installation and use status.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "In order to analyze the stability of products and services, partners who provide analyzing services may need to use services such as services, equipment identification information, and overall installation and use conditions."}
{"task": "rw_17.jsonl", "id": 43251, "text": "c), academic research: In order to improve the scientific research capabilities in related fields and promote the level of scientific and technological development, we may use de -identification or anonymous agencies to ensure that data security and purpose are properly used in the premise of legitimate data security and purpose.The data.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "In order to enhance the scientific research capabilities in related fields, we may use de -identified or anonymous data with cooperative scientific research institutes, universities and other institutions on the premise of ensuring that data security and purpose are legitimate."}
{"task": "rw_17.jsonl", "id": 43252, "text": "2.3 Operation subject change", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43253, "text": "With the continuous development of business, we will be likely to be merged, acquired, and transfer, and your personal information may be transferred as a result.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Your personal information may be transferred due to merging, acquisition, and asset transfer."}
{"task": "rw_17.jsonl", "id": 43254, "text": "When the previous description changes, we will require the recipient to protect your personal information in accordance with the laws and regulations and the security standards stated by the privacy policy.Fang Fang has re -obtained your authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "When involving mergers and acquisitions involving personal information transfer, the recipient will continue to be constrained by this policy, otherwise it will request that it will re -solicit with the authorization consent."}
{"task": "rw_17.jsonl", "id": 43255, "text": "2.4 Stop operation", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43256, "text": "If we stop operating products or services, we will stop collecting your personal information in time.", "label": ["Important", "Cessation of Operations"], "rewrite": "If we stop operating products or services, we will stop collecting your personal information in time."}
{"task": "rw_17.jsonl", "id": 43257, "text": "We will deliver notifications one by one or send you a notification of stopping operations in the form of an announcement, and delete or processes the personal information related to the shutdown products or services that have been closed.", "label": ["Important", "Cessation of Operations"], "rewrite": "When stopping operations, we will inform and delete or processes your personal information."}
{"task": "rw_17.jsonl", "id": 43258, "text": "2.5 public", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43259, "text": "We will not take the initiative to disclose your information that has not been disclosed by yourself, unless it follows the provisions of national laws and regulations or obtains your consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not take the initiative to disclose your information that has not been disclosed by yourself, unless it follows the provisions of national laws and regulations or obtains your consent."}
{"task": "rw_17.jsonl", "id": 43260, "text": "2.6 Removal of your authorization consent in accordance with the law", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43261, "text": "Please understand that in the following circumstances, according to laws and regulations and national standards, partners use, or we transfer or disclose your personal information without obtain your authorization consent:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the following circumstances, according to laws and regulations and national standards, partners use, or we transfer or disclose your personal information without obtain your authorization consent:"}
{"task": "rw_17.jsonl", "id": 43262, "text": "a), required to be established or fulfilled according to your requirements;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you order, transfer, or disclose the sharing, transfer or disclosure of the contract according to your requirements, no authorization is required."}
{"task": "rw_17.jsonl", "id": 43263, "text": "b) In order to fulfill the statutory responsibility or statutory obligations such as national security, defense security, criminal investigation, prosecution, trial and judgment implementation with national security, defense security, criminal investigation, prosecution, trial and judgment implementation;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to fulfill the shared, transferred or disclosed by the statutory duties or the necessary sharing, transfer, or disclosure necessary for the statutory duty, no authorization is required."}
{"task": "rw_17.jsonl", "id": 43264, "text": "c), to deal with emergencies, or in urgent situations to protect the health and property safety of natural people;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to cope with emergencies, or in urgent situations to protect the health of natural people and the must -sharing, transfer or disclosure of property security, no authorization is required."}
{"task": "rw_17.jsonl", "id": 43265, "text": "d), implement news reports, public opinion supervision and other behaviors for public interests, and handle personal information within a reasonable scope;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to implement news reports and supervision of public opinion, deal with personal information within a reasonable scope without authorization."}
{"task": "rw_17.jsonl", "id": 43266, "text": "e), deal with your own personal information within a reasonable range, or other legal information that has been legal (such as legal news reports, government information disclosure and other channels to legal public information); legal information and disclosure of government information); legal information and disclosure of government information;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Treatment your own personal information within a reasonable range, or other legal information that has been legal and disclosed without soliciting authorization."}
{"task": "rw_17.jsonl", "id": 43267, "text": "f), other circumstances stipulated in laws and regulations.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The sharing or disclosure of other laws and regulations and other regulations does not need to be authorized."}
{"task": "rw_17.jsonl", "id": 43268, "text": "3 Manage your personal information", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43269, "text": "We attach great importance to your management of personal information, and do our best to protect your personal information's right to check, copy, correct, supplement, delete, withdraw, cancel account number, complaint reporting and other rights to make you have the ability to understand and protectYour personal information is safe.", "label": ["Important", "Edit/Control"], "rewrite": "You have the right to check, copy, correct, replenish, delete, delete, withdraw, cancel accounts, and report complaints."}
{"task": "rw_17.jsonl", "id": 43270, "text": "But please understand that specific business functions and services will need your information to be completed. When you withdraw your consent or authorization, we cannot continue to provide you with the corresponding functions and services, and we will no longer deal with your corresponding personal information.", "label": ["Important"], "rewrite": "When you withdraw consent or authorization, we cannot continue to provide you with corresponding functions and services, and no longer process your corresponding personal information."}
{"task": "rw_17.jsonl", "id": 43271, "text": "But your decision to withdraw consent or authorization will not affect the personal information processing we carried out based on your authorization.", "label": ["Important"], "rewrite": "The decision to withdraw consent or authorization will not affect personal information processing based on your authorization."}
{"task": "rw_17.jsonl", "id": 43272, "text": "There may be differences in the way we provide in different versions or operating systems, please refer to it.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43273, "text": "3.1 Setting management", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43274, "text": "3.1.1 Basic function mode", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43275, "text": "Short video browsing and search are the basic functions of Douyin, so if you only allow us to process the personal information necessary for implementing basic functions, you can choose to open the basic function mode.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43276, "text": "In this mode, we will only process your personal information based on the needs of providing basic functions and protecting system security, that is, you can browse videos, but you cannot publish any content including comments, likes, and collection. What you seeThe video and other information will also be pushed randomly from the selected content;", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43277, "text": "You can use the search function. We will only provide search results based on your search keywords, and we will not optimize the search results.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43278, "text": "3.1.2 System permissions settings", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43279, "text": "a), you can open or close the geographical location, address book, camera, camera, microphone, album, calendar and other permissions in the setting function of the device to change the scope of authorization or withdraw your authorization.", "label": ["Important", "Edit/Control"], "rewrite": "You can open or close the geographical location, address book, camera, camera, microphone, album, calendar and other permissions in the setting function of the device to change the scope of authorization or withdraw your authorization."}
{"task": "rw_17.jsonl", "id": 43280, "text": "After the withdrawal authorization, we will no longer collect information related to these permissions, but it will not affect our personal information processing based on your previous authorization.", "label": ["Important", "Edit/Control"], "rewrite": "After the withdrawal authorization, no information related to these permissions is collected, but it will not affect personal information processing based on your authorization."}
{"task": "rw_17.jsonl", "id": 43281, "text": "You can read the explanation of Douyin permissions applications and usage to understand the situation of Douyin's application and use system permissions.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43282, "text": "b), you can choose whether to receive the system notification sent by Douyin in the device settings, or set the form of the system notification you want to receive.", "label": ["Important", "Edit/Control"], "rewrite": "You can choose whether to receive the system notification sent by Douyin in the device settings, or set the system notification form that you want to receive."}
{"task": "rw_17.jsonl", "id": 43283, "text": "At the same time, you can also select whether to receive the function notification in the application sent by Douyin in [I]-[â‰¡]-[Settings]-[Notice Settings], or set the scope of function notification in the application you want to receive.", "label": ["Important", "Edit/Control"], "rewrite": "You can select whether to receive the function notification in the application sent by Douyin in [I]-[-]-[Settings]-[Notification Settings], or the scope of function notification in the application hoping to receive."}
{"task": "rw_17.jsonl", "id": 43284, "text": "c), when you use mini -games and applets, you can manage the appliances obtained by the applet and mini -games in the mini -game, mini -program interface, or to withdraw the authorization of mini programs and mini games.", "label": ["Important", "Edit/Control"], "rewrite": "When you use mini -games and mini -programs, you can manage the appliances obtained by small programs and mini -games in the small game, mini -program interface, or to withdraw the authorization of mini programs and mini games."}
{"task": "rw_17.jsonl", "id": 43285, "text": "d) If you don't want to add friends by shaking, you can close the \"shake and shake\" function in [I]-[â‰¡]-[Settings]-[General Settings]-[Shake with Friends]You will not trigger the function of matching friends with your jitter.", "label": ["Important", "Edit/Control"], "rewrite": "You can turn off the \"shake and shake\" function in [I]-[-]-[Settings]-[General Settings]-[Shake with Friends]."}
{"task": "rw_17.jsonl", "id": 43286, "text": "3.1.3 Account Management", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43287, "text": "You can manage your vibrato account or apply for related services in [I]-[Settings]-[Account and Security]:", "label": ["Important", "Edit/Control"], "rewrite": "You can manage your vibrato account or apply for related services in [I]-[-]-[Settings]-[Account and Security]."}
{"task": "rw_17.jsonl", "id": 43288, "text": "[Save login information] You can choose whether we need to record your historical login information.", "label": ["Important", "Edit/Control"], "rewrite": "[Save login information] You can choose whether we need to record your historical login information."}
{"task": "rw_17.jsonl", "id": 43289, "text": "[Authorization Management] You can manage your authorization of other third -party products or services.", "label": ["Important", "Edit/Control"], "rewrite": "[Authorization Management] You can manage your authorization of other third -party products or services."}
{"task": "rw_17.jsonl", "id": 43290, "text": "Please note that after you cancel the authorization of other third -party products or services, you cannot use the Douyin account to log in to the third -party product or service again.", "label": ["Important", "Edit/Control"], "rewrite": "After you cancel the authorization of other third -party products or services, you cannot use the Douyin account to log in to the third -party product or service again."}
{"task": "rw_17.jsonl", "id": 43291, "text": "[Third -party account binding] You can manage the third -party account bound to your Douyin account.", "label": ["Important", "Edit/Control"], "rewrite": "[Third -party account binding] You can manage the third -party account bound to your Douyin account."}
{"task": "rw_17.jsonl", "id": 43292, "text": "[Login Equipment Management] You can manage your Douyin account recently logged in the equipment, login method and product.", "label": ["Edit/Control", "Important"], "rewrite": "[Login device management] You can manage the recently logged in the equipment, login method and product that the Douyin account is managed."}
{"task": "rw_17.jsonl", "id": 43293, "text": "You can choose [offline] to exit the login.", "label": ["Important", "Edit/Control"], "rewrite": "You can choose [offline] to exit the login."}
{"task": "rw_17.jsonl", "id": 43294, "text": "[Real -name certification] You can apply for an account real -name authentication.", "label": ["Important", "Edit/Control"], "rewrite": "[Real -name certification] You can apply for an account real -name authentication."}
{"task": "rw_17.jsonl", "id": 43295, "text": "[Application for official certification] You can apply for personal interest certification and occupational certification.", "label": ["Important", "Edit/Control"], "rewrite": "[Application for official certification] You can apply for personal interest certification and occupational certification."}
{"task": "rw_17.jsonl", "id": 43296, "text": "If you are a musician, you can also complete the musician identity authentication through this function.", "label": ["Important", "Edit/Control"], "rewrite": "If you are a musician, you can also pass the [Application Official Certification] to complete the musician identity certification."}
{"task": "rw_17.jsonl", "id": 43297, "text": "3.1.4 Storage/open range of control information", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43298, "text": "(1) You can control the storage/public scope of information through the following methods in [I]-[â‰¡]-[Settings]-[Privacy Settings]:", "label": ["Important", "Edit/Control"], "rewrite": "You can control the storage/open range of control information in [I]-[-]-[Settings]-[Privacy Settings]."}
{"task": "rw_17.jsonl", "id": 43299, "text": "[Exhibition of the same city] You can control whether your works and live broadcast are displayed on the same city channel.", "label": ["Important", "Edit/Control"], "rewrite": "[Exhibition of the same city] You can control whether the works and live broadcast are displayed on the same city channel."}
{"task": "rw_17.jsonl", "id": 43300, "text": "After closing, your comments, attention, praise, submission, etc. will not show the current location.", "label": ["Important", "Edit/Control"], "rewrite": "After closing the [City Display], your comments, attention, likes, submission, etc. will not show the current location."}
{"task": "rw_17.jsonl", "id": 43301, "text": "[Active/Online Status] can control whether your active/online status will show your friends.", "label": ["Edit/Control", "Important"], "rewrite": "[Active/Online Status] can control whether your active/online status will show your friends."}
{"task": "rw_17.jsonl", "id": 43302, "text": "After closing, you can't view the active/online situation of other friends.", "label": ["Important", "Edit/Control"], "rewrite": "After closing [Active/Online Status], you cannot view the active/online situation of other friends."}
{"task": "rw_17.jsonl", "id": 43303, "text": "[Browse and visitors]-[Works Browse record] You can control whether your browsing of a certain content will be seen by the author of the content.", "label": ["Edit/Control", "Important"], "rewrite": "[Browse and visitors]-[Works Browse record] You can control whether your browsing of a certain content will be seen by the author of the content."}
{"task": "rw_17.jsonl", "id": 43304, "text": "After closing, you can't see the browsing record of your content.", "label": ["Important", "Edit/Control"], "rewrite": "Close [Browse and Visitors]-[Works Browse record], you can't see the browsing record of your content being viewed."}
{"task": "rw_17.jsonl", "id": 43305, "text": "If you choose \"Daily\" when you publish the content, this setting may not take effect on the content of this type.", "label": ["Important", "Edit/Control"], "rewrite": "If you choose \"Daily\" when you publish the content, this setting may not take effect on the content of this type."}
{"task": "rw_17.jsonl", "id": 43306, "text": "[Browse and visitors]-[Homepage Visit Records] You can control you to see if you will leave the visitor record when you view the personal homepage of others.", "label": ["Important", "Edit/Control"], "rewrite": "[Browse and visitors]-[Homepage Visit Records] You can control you to see if you will leave the visitor record when you view the personal homepage of others."}
{"task": "rw_17.jsonl", "id": 43307, "text": "After closing, you can't see the visitors of your personal homepage.", "label": ["Important", "Edit/Control"], "rewrite": "After closing [Browse and Visitors]-[Homepage Visit Records], you can't see the visitors of your personal homepage."}
{"task": "rw_17.jsonl", "id": 43308, "text": "[Like] You can control whether the list of your personal homepage can be publicly visible, or you can also control the scope of the praise list and the visible information of your likes.", "label": ["Important", "Edit/Control"], "rewrite": "[Like] You can control whether the list of your personal homepage can be publicly visible, or you can also control the scope of the praise list and the visible information of your likes."}
{"task": "rw_17.jsonl", "id": 43309, "text": "[Who can send me in private] You can control the scope of the user that can send you a private message.", "label": ["Important", "Edit/Control"], "rewrite": "[Who can send me in private] You can control the scope of the user that can send you a private message."}
{"task": "rw_17.jsonl", "id": 43310, "text": "[Live] You can control the recommended scope of the live broadcast room you connected.", "label": ["Edit/Control", "Important"], "rewrite": "[Live] You can control the recommended scope of the live broadcast room you connected."}
{"task": "rw_17.jsonl", "id": 43311, "text": "[Recommend to someone you may know] can control whether you recommend you to the person you may know.", "label": ["Important", "Edit/Control"], "rewrite": "[Recommend to someone you may know] can control whether you recommend you to the person you may know."}
{"task": "rw_17.jsonl", "id": 43312, "text": "After closing, we will not store your mobile phone number based on the possible connection between you and other users, or other user address book, but recommend you to TA.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43313, "text": "[Follow and Fan List] can control whether others can see your attention and fan list.", "label": ["Edit/Control", "Important"], "rewrite": "[Follow and Fan List] can control whether others can see your attention and fan list."}
{"task": "rw_17.jsonl", "id": 43314, "text": "[Don't look at TA] can control whether the content of the specific user is on the \"recommendation\" page to you;", "label": ["Important", "Edit/Control"], "rewrite": "[Don't look at TA] can control whether the content of the specific user can be displayed on the \"recommendation\" page to you."}
{"task": "rw_17.jsonl", "id": 43315, "text": "But after setting, you can still enter TA's personal homepage to view the content released by TA.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43316, "text": "[Do not let TA look at] You can control whether your content is displayed on a specific user.", "label": ["Edit/Control", "Important"], "rewrite": "[Do not let TA look at] You can control whether your content is displayed on a specific user."}
{"task": "rw_17.jsonl", "id": 43317, "text": "If you only want to set a specific content to display a specific user, select the corresponding content in [I]-[Works], click [Permanent Settings] to set in [Do not see anyone].", "label": ["Important", "Edit/Control"], "rewrite": "If you just want to set a specific content to not display the specific user, you can select the corresponding content in [I]-[Works]. Click [Permanent Settings] to set it in [Do not see anyone]."}
{"task": "rw_17.jsonl", "id": 43318, "text": "[Blacklist] You can view your blacklist in the blacklist, or you can remove the black.", "label": ["Important", "Edit/Control"], "rewrite": "[Blacklist] You can view your blacklist in the blacklist, or you can remove the black."}
{"task": "rw_17.jsonl", "id": 43319, "text": "[Private Account] can control the overall visibility of your account and content.", "label": ["Edit/Control", "Important"], "rewrite": "[Private Account] can control the overall visibility of your account and content."}
{"task": "rw_17.jsonl", "id": 43320, "text": "After opening, the content you posted only your fans can be visible;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43321, "text": "Other users need to be able to become your fan after you agree.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43322, "text": "(2) You can manage your content in the following path:", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43323, "text": "[I]-ã€ã€ã€‘-ã€Settingsã€‘-ã€General Settingsã€‘-ã€Upload the work in advance, reduce waiting timeã€‘ You can close the pre-loading function described in the article [1.3.1].", "label": ["Edit/Control", "Important"], "rewrite": "[I]-ã€ã€ã€‘-ã€Settingsã€‘-ã€General Settingsã€‘-ã€Upload the works in advance, reduce waiting timeã€‘ You can close the pre-loading function."}
{"task": "rw_17.jsonl", "id": 43324, "text": "[I]-, select arbitrary content,-[permissions settings]-[Advanced settings] The range of users that can be co -ied with the content can be controlled, which can be reposted to the scope of the content to daily users, and whether the content is allowed to download the contentEssence", "label": ["Important", "Edit/Control"], "rewrite": "[I] -Se select arbitrary content- [permissions settings]-[Advanced settings] The range of users that can be combined with this content can be controlled, which can be reposted from the scope of the content to the daily user, and whether it allows to download the content."}
{"task": "rw_17.jsonl", "id": 43325, "text": "3.1.5 Autonomous subscription and personalized content", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43326, "text": "a), if you don't want to be recommended to be personalized content, you can use [I]-[â‰¡]-[Settings]-[General Settings]-[Management of personalized content recommendation] Close \"personalized content recommendation\".", "label": ["Important", "Edit/Control"], "rewrite": "You can use [Me]-[ã€]-[Settings]-[General Settings]-[Management of personalized content recommendation] Close \"personalized content recommendation\"."}
{"task": "rw_17.jsonl", "id": 43327, "text": "When you choose to close the recommendation of personalized content, you will no longer show you content related to your personal information or interest.", "label": ["Important", "Edit/Control"], "rewrite": "When you choose to close the recommendation of personalized content, you will no longer show you content related to personal information or interest."}
{"task": "rw_17.jsonl", "id": 43328, "text": "b), when you are not interested in specific content or desire to reduce a certain type of content, you can press the content and select \"Not interested\", and we will adjust the strategy based on your feedback.", "label": ["Important", "Edit/Control"], "rewrite": "When you are not interested in the specific content or want to reduce the recommendation of a certain type of content, you can press the content and choose \"not interested\"."}
{"task": "rw_17.jsonl", "id": 43329, "text": "At the same time, we also provide the entrance to the \"Feedback of Opinions\" to listen to your opinions and suggestions.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43330, "text": "c), will show the content published by the account you pay attention to in the follow -up channel.", "label": ["Edit/Control", "Important"], "rewrite": "Following the channel will show the content published by the account you follow."}
{"task": "rw_17.jsonl", "id": 43331, "text": "d) When there is no content you are interested in, you can also enter the keywords interested in the search bar, click and read the search results.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43332, "text": "3.1.6 Management Advertising Push", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43333, "text": "a), independently decide to receive programmatic advertising information: You can select whether to receive programmatic ads in [I]-[â‰¡]-[Settings]-[Understand and Management Advertising Push].", "label": ["Edit/Control", "Important"], "rewrite": "You can select whether to receive programmatic advertisements in [I]-[-]-[Settings]-[Understand and manage advertising push]."}
{"task": "rw_17.jsonl", "id": 43334, "text": "After closing, this type of advertisement will no longer be received. The number of ads you see will not change but the correlation of advertising will be reduced.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43335, "text": "b), independently decide to receive personalized advertising information: Personalized advertising is one of the advertising display technology, and the advertisers are intelligent recommendation based on your preferences in its application.", "label": ["Important", "Edit/Control"], "rewrite": "Advertisers have personalized advertising intelligent recommendations based on your preferences in their applications."}
{"task": "rw_17.jsonl", "id": 43336, "text": "If you don't want to be recommended for personalized advertisements, you can choose whether to receive personalized advertisements in [I]-[â‰¡]-[Settings]-[Understand and Management Advertising Push].", "label": ["Important", "Edit/Control"], "rewrite": "You can select whether to receive personalized advertising recommendations in [I]-[ã€]-[Settings]-[Understand and Management Advertising Push]."}
{"task": "rw_17.jsonl", "id": 43337, "text": "After closing, the correlation of the advertisement you see will be reduced.", "label": ["Edit/Control", "Important"], "rewrite": "After closing a personalized advertisement, the correlation of the advertisement you see will be reduced."}
{"task": "rw_17.jsonl", "id": 43338, "text": "c) Interest management of advertising: In order to help you manage advertising interest, you can press the advertisement and choose \"not interested\". We will adjust the strategy based on your feedback.", "label": ["Important", "Edit/Control"], "rewrite": "In order to help you manage advertising interest, you can press the advertisement and choose \"not interested\"."}
{"task": "rw_17.jsonl", "id": 43339, "text": "At the same time, we also provide the entrance to the \"Feedback of Opinions\" to listen to your opinions and suggestions.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43340, "text": "3.2 Check, correct, supplement, and delete your personal information", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43341, "text": "a), [Me]-[-]-[Personal Information Review and Manage, APP information, etc.", "label": ["Edit/Control", "Important"], "rewrite": "[I]-ã€ã€ã€‘-ã€Personal Information Review and Managementã€‘/ã€Personal Information Collection Listã€‘ You can query your account information, basic information, live broadcast dynamics, wallets and transaction records, social and relationshipswait."}
{"task": "rw_17.jsonl", "id": 43342, "text": "(The inquiry path may be inconsistent in Douyin and the related versions of each related version, which is subject to actual situation).", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43343, "text": "d) [Follow] You can access and query the account information you follow, and click the \"Follow\" button (if.) After clicking on the corresponding account, you can choose to cancel the account number.", "label": ["Important", "Edit/Control"], "rewrite": "[Follow] You can access and query the account information you follow, and click the \"Follow\" button (if.) After clicking on the corresponding account, you can choose to cancel the account number."}
{"task": "rw_17.jsonl", "id": 43344, "text": "b), [I]-[Works] You can access and delete the audio and video information you posted.", "label": ["Important", "Edit/Control"], "rewrite": "[I]-[Works] You can access and delete the audio and video information you posted."}
{"task": "rw_17.jsonl", "id": 43345, "text": "c), [I]-[Like] can access and delete the information you like (like).", "label": ["Edit/Control", "Important"], "rewrite": "[I]-[Like] You can access and delete your likes (like) information."}
{"task": "rw_17.jsonl", "id": 43346, "text": "d), [I]-[-]-[Personal information review and management]/[Personal information collection list] can consult the summary of our collection of information.", "label": ["Important", "Edit/Control"], "rewrite": "[I]-[ã€]-[Personal Information Review and Management]/[Personal Information Collection List] You can check the summary of our information about our information."}
{"task": "rw_17.jsonl", "id": 43347, "text": "Due to the consideration of security and identification, you may not be able to modify some initial registration information submitted during the registration (after the real -name authentication information);", "label": ["Important", "Edit/Control"], "rewrite": "You may not be able to modify some initial registration information submitted during the registration."}
{"task": "rw_17.jsonl", "id": 43348, "text": "If you really need to modify this type of information, please contact us by email (Feedback@douyin.com). We will review the issues involved as soon as possible and reply to your user identity in a timely manner.", "label": ["Important", "Edit/Control"], "rewrite": "If you need to modify the initial registration information, please contact us."}
{"task": "rw_17.jsonl", "id": 43349, "text": "3.3 Copy and transfer your personal information", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43350, "text": "If you need to copy the personal information we collect and store, you can contact us through the contact information listed in 8.1.", "label": ["Edit/Control", "Important"], "rewrite": "If you need to copy the personal information we collect and store, you can contact us."}
{"task": "rw_17.jsonl", "id": 43351, "text": "If you need to transfer our personal information to collect storage, we will provide you with a transfer path according to the requirements of laws and regulations.", "label": ["Important", "Edit/Control"], "rewrite": "If you need to transfer our personal information to collect storage, we will provide you with a transfer path according to the requirements of laws and regulations."}
{"task": "rw_17.jsonl", "id": 43352, "text": "3.4 Account Logging", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43353, "text": "You can go to [I]-[-]-[Settings]-[Account and Security]-[Logging out account], or enter [Douyin Security Center] to cancel the account.", "label": ["Edit/Control", "Important"], "rewrite": "You can go to [I]-[-]-[Settings]-[Account and Security]-[Logging out account], or enter [Douyin Security Center] to cancel the account."}
{"task": "rw_17.jsonl", "id": 43354, "text": "Before you cancel your account, we will verify your personal identity, security status, equipment information, etc. you have authorized us.", "label": ["Edit/Control", "Important"], "rewrite": "Before you cancel your account, we will verify your personal identity, security status, equipment information, etc. you have authorized us."}
{"task": "rw_17.jsonl", "id": 43355, "text": "For the process and content of the injection, see the \"Douyin Logging out\".", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43356, "text": "You know and understand that the behavior of canceling the account is irreversible. When you log out the account, we will delete relevant information about you. If you delete personal information, it is difficult to achieve technically, we will perform anonymous processing, or stop removing removing removalIn addition to the storage and necessary safety protection measures, the laws and regulations are otherwise stipulated.", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "After the account of the account is canceled, we will delete personal information. If it is difficult to achieve technically, your personal information will be anonymous to process or stop the treatment other than storage and take necessary security measures. HoweverEssence"}
{"task": "rw_17.jsonl", "id": 43357, "text": "In addition to the above, if you or other rights have the exercise of personal information rights given by relevant laws and regulations, you can have any claims, requirements or questions, you can] When entering the user feedback interface, we will contact us. We will review the issues involved as soon as possible and reply within the fifteen working days after verifying your user identity.", "label": ["Important", "Edit/Control"], "rewrite": "You can contact us in [I]-[-]-[Settings]-[Feedback and help]."}
{"task": "rw_17.jsonl", "id": 43358, "text": "4 How do we protect the security of personal information", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43359, "text": "We attach great importance to your personal information security, and we will strive to take reasonable security measures to protect your personal information, ensure that our personal information processing activities meet the requirements of laws, administrative regulations or other systems that can be applied in accordance with the law, and prevent unauthorized unauthorizedVisits and personal information leakage, tampering, and loss.", "label": ["Important", "Data Security"], "rewrite": "We will strive to take reasonable security measures to protect your personal information and prevent unauthorized access and personal information leakage, tampering, and loss."}
{"task": "rw_17.jsonl", "id": 43360, "text": "4.1 Security technical measures", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43361, "text": "We will use the encryption, de -identification technology, anonymous processing, and related reasonable and feasible methods that are not lower than the general level of the industry to protect your personal information, and use a security protection mechanism to prevent your personal information from being maliciously attacked.", "label": ["Important", "Data Security"], "rewrite": "We will use encryption, de -identification technology, anonymous treatment, and related reasonable and feasible means to protect your personal information, and use a security protection mechanism to prevent your personal information from being maliciously attacked."}
{"task": "rw_17.jsonl", "id": 43362, "text": "4.2 Management System", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43363, "text": "We will establish a special security department, security management system, and data security process to ensure your personal information security.", "label": ["Important", "Data Security"], "rewrite": "We will establish a special security department, security management system, and data security process to ensure your personal information security."}
{"task": "rw_17.jsonl", "id": 43364, "text": "We adopt strict data use and access system to ensure that only authorized personnel can access your personal information.", "label": ["Important", "Data Security"], "rewrite": "We adopt strict data use and access system to ensure that only authorized personnel can access your personal information."}
{"task": "rw_17.jsonl", "id": 43365, "text": "We will regularly conduct security education and training on personnel, and conduct security audit on data and technology in a timely manner.", "label": ["Important", "Data Security"], "rewrite": "We will regularly conduct security education and training on personnel, and conduct security audit on data and technology in a timely manner."}
{"task": "rw_17.jsonl", "id": 43366, "text": "We will formulate and organize the implementation of the emergency plan of personal information security incidents, and immediately start the emergency plan when the personal information security incident occurs, strive to control the impact of these security events, and prevent adverse consequences from expanding.", "label": ["Important", "Data Security"], "rewrite": "Formulate and organize the implementation of an emergency plan for personal information security incidents and start immediately when the personal information security incident occurs."}
{"task": "rw_17.jsonl", "id": 43367, "text": "Once a personal information security incident (leak, tampering, and loss) may occur or may occur, we will tell you the following situations in a timely manner in accordance with the requirements of laws and regulations: the types, reasons, and possible personal information, reasons and possibilities that may occur, may be tampered, and lost.The harm caused, the remedial measures we have taken, you can take the measures that reduce the harm and the way of contacting us.", "label": ["Important", "Data Security"], "rewrite": "If a personal information security incident occurs, we will inform your basic situation, possible impact, disposal measures, independent prevention suggestions, etc."}
{"task": "rw_17.jsonl", "id": 43368, "text": "We will promptly inform you of the incident -related situation with push notifications, emails, letters, text messages, and related forms. When it is difficult to inform them one by one, we will publish a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "It is difficult to inform personal information by mail, letter, telephone, and push notification one by one, and will be announced in a reasonable and effective way."}
{"task": "rw_17.jsonl", "id": 43369, "text": "At the same time, we will also report to the disposal of personal information security incidents in accordance with the requirements of the relevant regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "Report the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities."}
{"task": "rw_17.jsonl", "id": 43370, "text": "4.3 Security certification", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43371, "text": "At present, Douyin has passed the evaluation and filing of the National Information Security Level Protection (Level 3), and has passed the ISO27001 information security certification and ISO27701 privacy information management certification.", "label": ["Important", "Data Security"], "rewrite": "The national information security level protection (third level) evaluation and filing, and the international authoritative ISO27001 information security certification and ISO27701 privacy information management certification."}
{"task": "rw_17.jsonl", "id": 43372, "text": "4.4 Security reminder", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43373, "text": "Although the above -mentioned reasonable and effective measures have been taken, and the standards of relevant laws and regulations have been adopted, please understand that due to the technical restrictions and various malicious means that may exist, in the Internet industry, even if you can do your best to strengthen your security measures, you can strengthen your security measures, and you can strengthen your security measures.It is also impossible to ensure that the information is 100 % security, and we will try our best to ensure the security of our personal information you provide.", "label": ["Important", "Data Security"], "rewrite": "Although there are security measures, it is impossible to fully guarantee that there is no security problem."}
{"task": "rw_17.jsonl", "id": 43374, "text": "You know and understand that the system and communication network you use to access our services may be due to factors outside the control scope.", "label": ["Important", "Data Security"], "rewrite": "Systems and communication networks may have problems due to unprepared factors."}
{"task": "rw_17.jsonl", "id": 43375, "text": "Therefore, we strongly recommend that you take positive measures to protect the security of personal information, including but not limited to the use of complex passwords, regularly modify the password, do not disclose your account password and related personal information to others.", "label": ["Important", "Data Security"], "rewrite": "Protecting your personal information properly, it is provided to others only under the necessary situation."}
{"task": "rw_17.jsonl", "id": 43376, "text": "Once you leave the vibrato, browse or use other products or services provided by a third party, we will not be able to protect any personal information submitted to the third party, whether you log in, browse or use the above products or services based on shaking based on shakingLinks or guidance of sound.", "label": ["Important", "Data Security", "Risk"], "rewrite": "Regardless of whether you log in, browse or use the third -party product or service based on the link or guidance of Douyin, we will not be able to protect any personal information submitted to the third party."}
{"task": "rw_17.jsonl", "id": 43377, "text": "But we will prompt you to pay attention to entering third -party products or services so that you can better protect your personal information.", "label": ["Important", "Data Security"], "rewrite": "We will prompt you to pay attention to entering third -party products or services."}
{"task": "rw_17.jsonl", "id": 43378, "text": "5 How do we store personal information", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43379, "text": "5.1 Storage location", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43380, "text": "In accordance with the provisions of laws and regulations, we will store your personal information collected and generated during the operation of the People's Republic of China.", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in domestic operations will be stored in China."}
{"task": "rw_17.jsonl", "id": 43381, "text": "We will not transmit the above information abroad. If we transmit to overseas, we will follow relevant state regulations or seek your consent.", "label": ["Data Retention", "Important"], "rewrite": "If we transmit personal information to overseas, we will follow relevant national regulations or seek your consent."}
{"task": "rw_17.jsonl", "id": 43382, "text": "5.2 Storage period", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43383, "text": "a), we will only retain your personal information during the period for providing you with Douyin products or services, such as:", "label": ["Data Retention", "Important"], "rewrite": "You generally retain your personal information within the time limit for service purposes."}
{"task": "rw_17.jsonl", "id": 43384, "text": "Mobile phone number: When you register and log in with your mobile phone number, we need to keep your mobile phone number in order to provide you with normal services, cope with your possible inquiries, and prosecute your account and system security.", "label": ["Data Retention", "Important"], "rewrite": "When you register with your mobile phone number, we need to keep your mobile phone number."}
{"task": "rw_17.jsonl", "id": 43385, "text": "The content and related information you posted, before you retreat, delete or log out the account, we will retain it to provide you with continuous business functions.", "label": ["Data Retention", "Important"], "rewrite": "The content and related information you posted, we will retain before you withdraw, delete or log out your account."}
{"task": "rw_17.jsonl", "id": 43386, "text": "b), if you cancel your account, take the initiative to delete your personal information or the information exceeding the necessary storage period, we will delete or processes your personal information, except for the following situations:", "label": ["Data Retention", "Important"], "rewrite": "If you cancel your account, take the initiative to delete your personal information or information exceeding the necessary deposit period, your personal information will be deleted or anonymous, unless laws and regulations have other requirements."}
{"task": "rw_17.jsonl", "id": 43387, "text": "Comply with the requirements of information retention of laws and regulations (for example: the E -commerce Law stipulates that the saving time of goods and service information and transaction information is not less than three years from the date of the transaction).", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43388, "text": "For the purpose of finance, auditing, and dispute resolution, the period needs to be reasonably extended.", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43389, "text": "6 How do we protect minors", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43390, "text": "6.1 General Terms of Minor", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43391, "text": "a), if you are a minor under the age of 18, before using Douyin and related services, you should read and agree with your parents or other guardians under guidance and guidance.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a minor under the age of 18, please use the service under the guidance of the guardian under the guidance of the guardian after reading the policy carefully."}
{"task": "rw_17.jsonl", "id": 43392, "text": "b), if you are a guardian of minors under the age of 14, you should read and agree to your privacy policy for your guardian before using Douyin and related services.", "label": ["Specific Audiences", "Important"], "rewrite": "The guardian should help children complete the use of products or services after reading and agreeing to the policy."}
{"task": "rw_17.jsonl", "id": 43393, "text": "c), in accordance with the provisions of relevant national laws and regulations to protect the personal information of minors, we will only collect, use, share, or disclose minors under the circumstances of legal permission, parents or other guardians to protect minors.Personal information.", "label": ["Specific Audiences", "Important"], "rewrite": "We will only collect, use, share, or disclose personal information of minors when legal permission, parents or other guardians need to collect or protect minors."}
{"task": "rw_17.jsonl", "id": 43394, "text": "If we find that the personal information of minors is collected without the consent of parents or other guardians who can be proven in advance, we will try to delete relevant information as soon as possible.", "label": ["Specific Audiences", "Important"], "rewrite": "If the personal information of minors was collected without the consent of the legal guardian, he would try to delete relevant information as soon as possible."}
{"task": "rw_17.jsonl", "id": 43395, "text": "At the same time, we have established rules for collection and use of minors to protect children (under 14 years of age) and personal information security of children (under 14 years of age) and adolescents (who are 14 years old but under 18 years old).Notice \"to learn more information.", "label": ["Specific Audiences", "Important"], "rewrite": "We have established rules for collection and use of minor information to protect personal information security of children and adolescents."}
{"task": "rw_17.jsonl", "id": 43396, "text": "d) If you are the guardian of a minor, when you have any questions about the personal information of the minors you guard, please contact us through the contact information of this privacy policy.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43397, "text": "6.2 Related functions related to the protection of minors", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43398, "text": "6.2.1 Child/adolescent mode", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43399, "text": "When you first enter Douyin every day, we remind you to open the child/adolescent mode.", "label": ["Specific Audiences", "Important"], "rewrite": "When you first enter Douyin every day, we remind you to open the child/adolescent mode."}
{"task": "rw_17.jsonl", "id": 43400, "text": "You can also take the initiative to open the child/adolescent mode in the upper right corner of the [I] or [I]-[â‰¡]-[Youth Guardians].", "label": ["Edit/Control", "Specific Audiences", "Important"], "rewrite": "You can take the initiative to open the child/adolescent mode in the upper right corner of the [I] or [I]-[â‰¡]-[Youth Guardian Tool]."}
{"task": "rw_17.jsonl", "id": 43401, "text": "After the children/adolescent mode is turned on, the account can only use the vibrato in specific periods and duration.", "label": ["Specific Audiences", "Important"], "rewrite": "After the children/adolescent mode is turned on, the account can only use the vibrato in specific periods and duration."}
{"task": "rw_17.jsonl", "id": 43402, "text": "When exceeding a specific length or not in a certain period, you need to enter the correct password to continue to use.", "label": ["Specific Audiences", "Important"], "rewrite": "When exceeding a specific length or not in a certain period, you need to enter the correct password to continue to use."}
{"task": "rw_17.jsonl", "id": 43403, "text": "If you are a minor that has passed the real -name authentication, we will set up your Douyin to only use the corresponding mode applied to minors.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a minor who has passed the real -name authentication, it will only use the corresponding mode of applicable to minors."}
{"task": "rw_17.jsonl", "id": 43404, "text": "6.2.2 time lock", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43405, "text": "[I]-[ã€]-[Youth Guardian Tool] You can set the time lock to limit the daily use time of the account.", "label": ["Edit/Control", "Specific Audiences", "Important"], "rewrite": "[I]-[ã€]-[Youth Guardian Tool] You can set the time lock to limit the daily use time of the account."}
{"task": "rw_17.jsonl", "id": 43406, "text": "After the time is available, you need to enter a password to continue to use.", "label": ["Specific Audiences", "Important"], "rewrite": "After the time is available, you need to enter a password to continue to use."}
{"task": "rw_17.jsonl", "id": 43407, "text": "6.2.3 Parent -child platform", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43408, "text": "[I]-[,]-, [Youth Guardian Tool] can open the parent-child platform function, which can bind the child's vibrato account to achieve remote management.", "label": ["Specific Audiences", "Important"], "rewrite": "[I]- [ã€]- [Youth Guardian Tool] The parent-child platform function can be opened in the childhood, which can bind the child's vibrato account to achieve remote management."}
{"task": "rw_17.jsonl", "id": 43409, "text": "When you apply for the function of opening a parent -child platform, we may ask you to provide personal information such as identity proof, guardian certificate, contact information, to verify your identity and parent -child relationship, and to conduct necessary verifications of the identity of the user of an account.", "label": ["Specific Audiences", "First Party Collection Information", "Data Security", "Important"], "rewrite": "When you apply for opening the parent -child platform function, we may ask you to provide personal information such as identity proof, guardian certificate, contact information."}
{"task": "rw_17.jsonl", "id": 43410, "text": "After the function is turned on, Douyin will set restrictions on the use time of the minor account of your binding to the minor account of you.", "label": ["Specific Audiences", "Important"], "rewrite": "After the parent -child platform function is turned on, Douyin will restrict the use time of the minor account of the minor account you binding according to your application."}
{"task": "rw_17.jsonl", "id": 43411, "text": "For relevant instructions for parent -child platforms, please refer to the Parent -Child Guardian Service Agreement.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43412, "text": "7 Checking and revising privacy policy", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43413, "text": "7.1 Review", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43414, "text": "a. You can check the privacy policy on the login page or log in after logging in to [I]-[â‰¡]-[Settings]-[Privacy Policy] page.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43415, "text": "b. Please understand that in order to meet the needs of the operation, we may develop different versions based on factors such as the mobile phone model, system version, and mobile clients you use. ThereforePrivacy policy description is different, but it does not affect the purpose, method and scope of data processing. The specific available functions are based on your actual use.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43416, "text": "7.2 Update and notice", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43417, "text": "a. In order to provide you with better services, Douyin products and services will be updated and changed from time to time, and we will revise this Privacy Policy in due course.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43418, "text": "Without your clear consent, we will not reduce the rights you should enjoy based on the current effective privacy policy.", "label": ["Policy Change", "Important"], "rewrite": "Without your clear consent, we will not reduce the rights you should enjoy based on the current effective privacy policy."}
{"task": "rw_17.jsonl", "id": 43419, "text": "b. After this privacy policy is updated, we will issue a updated version in Douyin, and remind you of the updated content through the letter or other appropriate ways to understand the latest version of the privacy policy in time.", "label": ["Policy Change", "Important"], "rewrite": "After the privacy policy is updated, we will issue a updated version in Douyin and remind you of the updated content."}
{"task": "rw_17.jsonl", "id": 43420, "text": "c. We may also help you manage your personal information better through functional updates. Please pay attention to the relevant function description.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43421, "text": "8 Contact us", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43422, "text": "8.1 Complaints and reports", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43423, "text": "If you think your personal information rights may be infringed, or you can find a clue to infringe the right to personal information, you can enter the user feedback interface to contact us in [I]-[â‰¡]-[Settings]-[Feedback and help].", "label": ["Important", "Contact Information"], "rewrite": "You can contact us in [I]-[-]-[Settings]-[Feedback and help], and contact us in the user feedback interface."}
{"task": "rw_17.jsonl", "id": 43424, "text": "After we verify our complaints and reports within 15 working days.", "label": ["Important"], "rewrite": "After we verify our complaints and reports within 15 working days."}
{"task": "rw_17.jsonl", "id": 43425, "text": "8.2 Other problems", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43426, "text": "If you have questions or suggestions on personal information protection, you can choose to contact us through the following ways:", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43427, "text": "a), send mail to dataprivacy@bytedance.com", "label": ["Important", "Contact Information"], "rewrite": "Email: dataprivacy@bytedance.com"}
{"task": "rw_17.jsonl", "id": 43428, "text": "b), mail to the China Satellite Communications Building, Ministry of Legal Affairs, Data Security and Privacy Protection Center", "label": ["Important", "Contact Information"], "rewrite": "Address: Data Security and Privacy Protection Center, China Satellite Communications Building, China Satellite Communications Building, Haidian District, Beijing"}
{"task": "rw_17.jsonl", "id": 43429, "text": "We will review your questions or suggestions as soon as possible and reply within 15 working days after verifying your user identity.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43430, "text": "<it is delimiter>", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43431, "text": "\"Account and Information Synchronization Authorization Agreement\"", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43432, "text": "Account and information synchronization authorization agreement", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43433, "text": "You are welcome to use Douyin and Douyin volcanic version of the account upgrade service and related services!", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43434, "text": "You agree that this \"Account and Information Synchronization Authorization Agreement\" (hereinafter referred to as \"this agreement\") can be upgraded, and the account and information are synchronized with Douyin volcanic version and Douyin.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43435, "text": "If you authorize the synchronous Douyin volcanic version account and information to Douyin, you can use the Douyin volcanic version account to log in, use Douyin and related services;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you authorize the synchronous Douyin volcanic version account and information to Douyin, you can use the Douyin volcanic version account to log in, use Douyin and related services with the Douyin volcanic version account."}
{"task": "rw_17.jsonl", "id": 43436, "text": "If you authorize the synchronization of Douyin account and information to Douyin Volcano, you can use your Douyin account to log in and use Douyin Volcano and related services after authorization.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you authorize the synchronization of Douyin account and information to Douyin Volcano, you can use your Douyin account to log in and use Douyin Volcano and related services after authorization."}
{"task": "rw_17.jsonl", "id": 43437, "text": "After the account is upgraded, you can query and change the information in your account in the Douyin and Douyin volcanic version (except for the exceptions agreed in this agreement).", "label": ["Important", "Edit/Control"], "rewrite": "After the account is upgraded, you can check and change the information in your account at the same time in Douyin and Douyin Volcano."}
{"task": "rw_17.jsonl", "id": 43438, "text": "For the convenience of expressions, the following applications and services before your account synchronization are called \"authorization applications\". Another application and service that can be used after synchronization is called \"authorized application\".", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43439, "text": "To this end, we request you to authorize us to synchronize your account and information in accordance with this agreement.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43440, "text": "Please read and fully understand this agreement;", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43441, "text": "If you are under the age of 18, please read carefully and fully understand it with the legal guardian, and perform the next operation after obtaining the consent of the legal guardian.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are under the age of 18, please do the next operation after obtaining the consent of the legal guardian."}
{"task": "rw_17.jsonl", "id": 43442, "text": "If you do not agree with this agreement, it will not affect you to continue using this account, but we cannot provide you with the above services.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43443, "text": "If you choose to agree and authorize us to synchronize your account and information in accordance with this agreement, you are deemed that you have fully understood this agreement and agree to accept this agreement as one party of this agreement, the vibrato volcanic version and the vibrato user service agreement, privacy privacy, privacy, privacy, privacyRestrictions on policies and other related agreement clauses.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "If you choose to agree and authorize us to synchronize your account and information in accordance with this agreement, it is deemed that you have fully understood and accept this agreement."}
{"task": "rw_17.jsonl", "id": 43444, "text": "Douyin volcanic version and Douyin user service agreement and privacy policy link are as follows:", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43445, "text": "Douyin user service agreement", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43446, "text": "Douyin Privacy Agreement", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43447, "text": "Douyin volcanic version user service agreement", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43448, "text": "Douyin volcanic version privacy agreement", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43449, "text": "1. Account upgrade", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43450, "text": "You agree that the authorization application account login and use the authorized application (the account after authorization can also be called \"upgraded account\").", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43451, "text": "After the upgrade, the account must follow the user service agreement, privacy policy and other agreement terms of Douyin and Douyin volcanic version.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43452, "text": "If you have the same account number with the same login method as the account after upgrading (like the one -mobile phone number, the same third -party platform account authorization login), you can have the authorized application after logging in.\"-\" Settings \"-\" Account and Security \"-\" Account Management \"(Douyin) or\" Avatar \"-\" Settings \"-\" Account Switch \"(Douyin Volcanic Edition) log in to the upgraded account number through account switching.", "label": ["Important", "Edit/Control"], "rewrite": "After logging in to the existing account, you are authorized \"I\"-\"Settings\"-\"Account and Security\"-\"Account Management\" (Douyin) or \"Avatar\"-\"Settings\"-\"Account Switch\" (Douyin Volcanic Edition) Log in to upgrade accounts through account switching."}
{"task": "rw_17.jsonl", "id": 43453, "text": "For this purpose, we will use and display your relevant login information in the authorized application before your login upgrade to guide you to complete the login.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43454, "text": "2. Information synchronization", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43455, "text": "You agree to authorize the following information and content that you formed in the authorization application, synchronize the account after upgrading to the authorized application to be displayed and used, and help you use the authorized application related functions and services and complete account numbers through this account.Upgrade service:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You agree to authorize the following information and content that you formed in the authorization application, and synchronize the account after upgrading to the authorized application to be displayed and used."}
{"task": "rw_17.jsonl", "id": 43456, "text": "1. Register, log in, certification", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43457, "text": "1.1, you agree that we will synchronize the relevant information you provided during the registration and login authorization application, including avatars, nicknames, mobile phone numbers, network identification information (account numbers, passwords) for logging in to be authoritative applications;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You agree that the relevant information you provided during the registration and login authorization application are used to log in to the authorized application."}
{"task": "rw_17.jsonl", "id": 43458, "text": "If you provide information about gender, birthday, region and personal introduction according to your own needs, we will simultaneously synchronize the aforementioned relevant information for you.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you provide information with gender, birthday, region and personal introduction, we will simultaneously synchronize the aforementioned relevant information for you."}
{"task": "rw_17.jsonl", "id": 43459, "text": "1.2, you agree that we synchronize the real -name authentication information you provided in the authorization application (real name, ID number, phone number, identity verification information) or other certification information (corporate certification, vocational certification information, institutional certification, etc.), in orderHelp you complete your identity authentication in the authorized application, and directly use the corresponding functions or services that require identity authentication provided by the authorized application.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You agree that we will synchronize the real -name authentication information or other certification information you provide in the authorized application until the authorized application."}
{"task": "rw_17.jsonl", "id": 43460, "text": "2. Publish and interact", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43461, "text": "2.1, you agree that we will synchronize the content and information you posted in the authorized application (including audio and video, graphic, live broadcast, etc.).", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You agree with the content and information you posted in the authorization application."}
{"task": "rw_17.jsonl", "id": 43462, "text": "After authorization, if you increase, delete or change the relevant content or information in any application, you will publish and display it in another application.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43463, "text": "2.2, you agree that we synchronize your interactive information in the process of using the authorized application service, including reviews, collection, likes, etc.;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You agree with us to synchronize your interactive information in the process of using the authorization application service."}
{"task": "rw_17.jsonl", "id": 43464, "text": "However, your interactive information is authorized by other users who are limited to your interaction in the applied application.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43465, "text": "2.3, we protect your privacy, your historical and private information will not be synchronized, but can only be viewed in authorized applications.", "label": ["Important", "Data Security"], "rewrite": "Your historical private message information will not be synchronized, but can only be viewed in authorized applications."}
{"task": "rw_17.jsonl", "id": 43466, "text": "However, the private message information sent and received in any application after authorization will be synchronized to another application based on the authorization status of you and the other users.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After authorization, the private message information sent and received in any application will be synchronized to another application based on the authorization status of you and the other party."}
{"task": "rw_17.jsonl", "id": 43467, "text": "3. Equity, assets, transactions", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43468, "text": "3.1, you agree that we will synchronize the equity information (such as firepower, sound waves, etc.) formed in the use of authorized application services, asset information (such as virtual assets, live broadcast and product information sharing income amount, etc.), transaction information (such as product information sharingFunctional service -related transactions and settlement information, live broadcast -related recharge and transaction information, etc.).", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You agree that we will synchronize the equity information, asset information, and transaction information formed in the use of authorized application services."}
{"task": "rw_17.jsonl", "id": 43469, "text": "After authorization, the amount of virtual assets and withdrawals obtained by recharge in the authorization application can be displayed, used and withdrawn in the authorized application. The same equity, income and recharge in each application will be combinedexhibit.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43470, "text": "For example, the \"firepower\" you obtained in the Douyin volcano version and the \"sound waves\" obtained in Douyin are the same rights and interests. Its value will be combined to calculate and display, but in the Douyin volcanic version\", Is still called\" sound waves \"in Douyin.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43471, "text": "3.2 The \"Diamond\" that users recharge and purchased in the vibrato volcano version are renamed \"Diamond (Diamond Coin)\".", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43472, "text": "After you authorize your account to synchronize, the \"Diamond (Diamond)\" you buy in the Douyin volcano version and the \"shaking coin\" that you recharge in Douyin will be combined and displayed, and it is called in the Douyin volcanic version.\"Diamond (shaking coin)\", called \"shaking coin\" in the vibrato short video;", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43473, "text": "The \"diamond (shaking coins)\" and \"shaking coins\" purchased in your account can be used at the same time to purchase all virtual props and value -added services provided by the two at the same time.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43474, "text": "4. Recommended friends", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43475, "text": "After you explicitly explicitly agree, the authorized application will get your friend relationship (including attention, etc.) in the authorized application to help you find more friends in the authorized application and use the functions and services related to your friends.Essence", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After you explicitly explicitly agree, the authorized application will get your friend relationship in the authorized application."}
{"task": "rw_17.jsonl", "id": 43476, "text": "You can choose not to authorize your friend relationship, which may affect your services or functions related to your friends in the authorized application, but it does not affect your use of other services or functions.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43477, "text": "5. In order to provide you with a complete account upgrade service, you agree that we will provide other information and content in your authorized application to the authorized application to achieve this purpose.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "You agree that we are provided by the authorized application to provide other information and content in the authorized application for account upgrades."}
{"task": "rw_17.jsonl", "id": 43478, "text": "Third, the exception of information synchronization", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43479, "text": "1. You understand and agree that some functions or services authorized applications (such as flame gifts, fast up, DOU+, etc.) are still provided only in the authorized application, so only your information related to this function will not be synchronized to synchronization to the same to synchronization to synchronization to synchronization to synchronization to synchronization to synchronization to synchronization to synchronization to synchronization to synchronization to synchronization to synchronization to synchronization to synchronization to synchronization to synchronization to synchronization to synchronization to synchronization to synchronization to synchronization to synchronization to synchronization to synchronization to synchronization to synchronization to synchronization to synchronization to synchronization to synchronization to synchronization to synchronization to synchronization to synchronization to synchronization to sync toThe authorized application, you cannot inquire or use this information in the authorized application.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You still only provide your information or service related information in the authorized application, and will not be synchronized to the authorized application."}
{"task": "rw_17.jsonl", "id": 43480, "text": "For specific content related to these functions or services, you can view the relevant product page or service protocol in each application.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43481, "text": "2. You understand and agree, based on technical restrictions, differences in application function, restrictions on the scope of copyright authorization, and differences in operating strategies. Even if you are authorized in accordance with this agreement, you will publish, select publicly or formed some information in the authorization application, select, select publicly or formed some information,It may still be unable to be fully displayed or used after being authorized to be applied to the applied application or after synchronization to the authorized application.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43482, "text": "We will continue to work hard to improve your related experience.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43483, "text": "Fourth, public display and control", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43484, "text": "Various privacy settings (such as private account settings, etc.) in the authorized application will be synchronized to the authorized application, so that your privacy will continue to be protected by the same degree;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Various privacy settings in your authorized application will be synchronized to the authorized application."}
{"task": "rw_17.jsonl", "id": 43485, "text": "After authorization, the privacy settings you will be performed in any application will also be synchronized to another application.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After authorization, the privacy settings you will be performed in any application will also be synchronized to another application."}
{"task": "rw_17.jsonl", "id": 43486, "text": "The video you like will be displayed on the personal homepage of Douyin and Douyin Volcano. You can choose to close the display in each application \"Settings\".", "label": ["Third Party Sharing/ Disclosure", "Important", "Edit/Control"], "rewrite": "You can choose to close the likes in each application \"Settings\"."}
{"task": "rw_17.jsonl", "id": 43487, "text": "You can go to each application \"I\"-\"Settings\"-\"Privacy Settings\" (Douyin) or \"Avatar\"-\"Settings\"-\"Privacy\" (Douyin Volcano).", "label": ["Edit/Control", "Important"], "rewrite": "You can go to each application \"I\"-\"Settings\"-\"Privacy Settings\" (Douyin) or \"Avatar\"-\"Settings\"-\"Privacy\" (Douyin Volcano)."}
{"task": "rw_17.jsonl", "id": 43488, "text": "After you have authorized this agreement, we will still use, protect, and share your personal information according to each application of privacy policies.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43489, "text": "If you have any questions about this agreement, you can contact us through the \"feedback and help\" in each application client.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43490, "text": "<it is delimiter>", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43491, "text": "Instructions for children/adolescents", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43492, "text": "You are welcome to choose from [Beijing Micro Broadcasting Vision Technology Co., Ltd.] (hereinafter referred to as \"We\" or \"Platform\") to develop, operate and provide related products and services in mainland China!", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43493, "text": "We attach great importance to the protection of minors.", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43494, "text": "In order to protect the security of the personal information of minors and provide richer and more diversified high -quality content, we have developed the \"Child/Youth Model\".", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43495, "text": "This \"Instructions for Children/Adolescents\" aims to explain the way of running the mode to the legal guardian or the parents of the legal guardian or the minor (hereinafter referred to as the \"guardian\" or \"parent\") and the minor (hereinafter referred to as the \"guardian\").We will excavate more high -quality content suitable for minors to watch, provide richer management methods for guardians to ensure that children's information collection and use are used under the supervision of the guardian.", "label": ["Specific Audiences", "Important"], "rewrite": "This \"Instructions for Children/Adolescents\" aims to explain the way the mode is explained to the legal guardian or parents of the minor."}
{"task": "rw_17.jsonl", "id": 43496, "text": "1. Work with you to protect children and adolescents with you", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43497, "text": "1.1 Children under 14 years of age", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43498, "text": "If your guardian is a child under the age of 14, he/she uses the general mode of Douyin, and you need to pass your clear consent;", "label": ["Specific Audiences", "Important"], "rewrite": "If your guardian is a child under the age of 14, he/she needs to use the general model of Douyin to pass your clear consent."}
{"task": "rw_17.jsonl", "id": 43499, "text": "If you do not agree with him/she uses the ordinary model of Douyin, please set up the \"Child/Youth Model\" for him/her.", "label": ["Specific Audiences", "Important"], "rewrite": "If you do not agree with him/she uses the ordinary model of Douyin, please set up the \"Child/Youth Model\" for him/her."}
{"task": "rw_17.jsonl", "id": 43500, "text": "At the same time, the platform can automatically enter the \"child/adolescent model\" function based on the information provided by you or the guardian of the guardian.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43501, "text": "During the real -name authentication stage, if your guardian needs to complete the real -name authentication and needs to be clearly consent through your alone, we will pass reasonable verification measures to verify the monitoring relationship between you and your guardian.Or the information of your guardian, please contact us in time through the contact information at the end of the article.", "label": ["Specific Audiences", "Important"], "rewrite": "During the real -name authentication stage, if your guardian needs to complete the real -name authentication, it needs to be clearly consent. If you think we have handled the guardian's information improperly, please contact us in time."}
{"task": "rw_17.jsonl", "id": 43502, "text": "1.2 teenagers who are less than 14 years old and less than 18", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43503, "text": "If your guardian is a teenager who is 14 years old and less than 18 years old, you and your guardian can choose whether to set the \"child/adolescent\" mode according to their own needs.", "label": ["Specific Audiences", "Important"], "rewrite": "If your guardian is a teenager who is 14 years old and less than 18 years old, you and your guardian can choose whether to set the \"child/adolescent\" mode according to their own needs."}
{"task": "rw_17.jsonl", "id": 43504, "text": "1.3 Assist the guardian to better guard the children and adolescents", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43505, "text": "In order to help the guardian manage the application time of minors, in this mode, Douyin cannot be used from 22 to 6 times the next day.", "label": ["Specific Audiences", "Important"], "rewrite": "Douyin cannot be used during the minor 22 to 6 times the morning the next day."}
{"task": "rw_17.jsonl", "id": 43506, "text": "After entering this mode, the system will automatically turn on the time lock, and the time lock is set to 40 minutes by default.", "label": ["Specific Audiences", "Important"], "rewrite": "Entering the \"Child/Adolescent\" mode, the system will automatically turn on the time lock, and the time lock is set to 40 minutes."}
{"task": "rw_17.jsonl", "id": 43507, "text": "The length of use in a single day exceeds the trigger time, and you need to enter the password to continue to use.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43508, "text": "The password is set and mastered by you to ensure that you can effectively guide minors to use vibrato health.", "label": ["Specific Audiences", "Important"], "rewrite": "The password is set and mastered by you to ensure that you can effectively guide minors to use vibrato health."}
{"task": "rw_17.jsonl", "id": 43509, "text": "You can also enter the \"parent -child platform\" and set a browsing time for your guardian according to actual needs.", "label": ["Specific Audiences", "Important"], "rewrite": "You can enter the \"parent -child platform\" and set a browsing time for your guardian according to actual needs."}
{"task": "rw_17.jsonl", "id": 43510, "text": "After you enter the \"parent -child platform\", you can choose to help your prisoner open through the binding of the guardian account and the guardian account (part of the functions and services provided by the platform, also known as the \"parent account\" and \"children's account\").Or turn off the youth mode to achieve remote management of the guardian's use of Douyin.", "label": ["Specific Audiences", "Important"], "rewrite": "After you enter the \"parent -child platform\", you can achieve remote management of the guardian's use of Douyin through the binding of the guardian account and the guardian account."}
{"task": "rw_17.jsonl", "id": 43511, "text": "After you enter the \"Parent -Child Platform\" and complete the binding of the guardian account and the guardian account, in the open youth mode, you can choose to help your guardian pay attention to the jitter according to your own needs.Browse Douyin's work that has been concerned.", "label": ["Specific Audiences", "Important"], "rewrite": "After you enter the \"Parent -Child Platform\" and complete the binding of the guardian account and the guardian account, you choose to help your guardian pay attention to the jitter in the youth mode."}
{"task": "rw_17.jsonl", "id": 43512, "text": "We will complete the weekly report of the guardian account and the use of the guardian account for completing the parent -child account to help the guardian better understand the situation of his guardian's use of vibrato.If we think that we have handled the information of you or your guardian, please contact us in time through the contact information at the end of the text.", "label": ["Specific Audiences", "Important"], "rewrite": "We will generate weekly reports in the use of the sub -account to help the guardian better understand the situation of his guardian's use of vibrato."}
{"task": "rw_17.jsonl", "id": 43513, "text": "2. Protect children and adolescent personal information security", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43514, "text": "2.1 Strictly limit the type of personal information of children and adolescents", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43515, "text": "a. We will only collect the information necessary for the most basic functions such as equipment information, the type, content, and playback completion of the equipment information, the type of video, and playback of the most basic functions based on the purpose of ensuring diversity and high -quality content.", "label": ["Specific Audiences", "First Party Collection Information", "Important"], "rewrite": "We will collect the information necessary for the most basic functions such as equipment information, the type, content, and playback completion of the equipment."}
{"task": "rw_17.jsonl", "id": 43516, "text": "b. In order to ensure the quality of the recommended content and recommend videos and related information that you may be interested in, Douyin may collect relevant necessary log information.", "label": ["Specific Audiences", "Important", "First Party Collection Information"], "rewrite": "To ensure the quality of the recommended content and recommend it, Douyin may collect relevant necessary log information."}
{"task": "rw_17.jsonl", "id": 43517, "text": "We will obtain your consent before collecting your information. Douyin will collect information such as praise, collection, and attention;", "label": ["Specific Audiences", "First Party Collection Information", "Important"], "rewrite": "We will obtain your consent before collecting your information, and Douyin will collect information such as praise, collection, and attention."}
{"task": "rw_17.jsonl", "id": 43518, "text": "We will not collect information without your authorization.", "label": ["Specific Audiences", "Important"], "rewrite": "We will not collect information without your authorization."}
{"task": "rw_17.jsonl", "id": 43519, "text": "2.2 Strictly limited the purpose of the personal information of children and adolescents", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43520, "text": "a. The collected information will not be used for any business purpose (including but not limited to: advertising, marketing), and will not be shared with third parties based on any business purpose.", "label": ["Specific Audiences", "Important"], "rewrite": "The collected information will not be used for any business purposes, and will not be shared with third parties based on any business purposes."}
{"task": "rw_17.jsonl", "id": 43521, "text": "b. Part of the equipment information and network information may be used for security and anti -cheating, but we will not use information collected for these purposes in other unrelated areas.", "label": ["Specific Audiences", "Usage", "Important"], "rewrite": "Part of the equipment information and network information may be used for security and anti -cheating."}
{"task": "rw_17.jsonl", "id": 43522, "text": "2.3 Strict measures and systems to protect personal information security for children and adolescents", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43523, "text": "a. We have collected and generated personal information that we collected and generated during the domestic operations stored in the territory of the People's Republic of China, and will not be transmitted or stored abroad.", "label": ["Data Retention", "Specific Audiences", "Important"], "rewrite": "The personal information collected and generated in domestic operations will be stored in China."}
{"task": "rw_17.jsonl", "id": 43524, "text": "b. Storage log information collected by the storage is 6 months, except for laws and regulations.", "label": ["Data Retention", "Specific Audiences", "Important"], "rewrite": "The collection of children's browsing logs collected by the storage is 6 months, except for laws and regulations."}
{"task": "rw_17.jsonl", "id": 43525, "text": "c. We will use high -intensity encryption technology, anonymous processing, and related reasonable and feasible means to protect the information of minors and use a security protection mechanism to prevent malicious attacks.", "label": ["Specific Audiences", "Important", "Data Security"], "rewrite": "Use high -intensity encryption technology, anonymous processing methods to protect the information of minors, and use a security protection mechanism to prevent malicious attacks."}
{"task": "rw_17.jsonl", "id": 43526, "text": "d. We will establish a special security department, the security management system for the information specifically for minors, and the data security process to ensure the security of the minors.", "label": ["Specific Audiences", "Data Security", "Important"], "rewrite": "Establish a special security department, a security management system for minors' information, and data security processes to ensure the security of minors."}
{"task": "rw_17.jsonl", "id": 43527, "text": "We adopt strict data use and access systems to ensure that only authorized personnel can access and conduct security audits of data and technology in a timely manner.", "label": ["Specific Audiences", "Data Security", "Important"], "rewrite": "Adopt strict data use and access system to ensure that only authorized personnel can access and conduct security audits on data and technology in a timely manner."}
{"task": "rw_17.jsonl", "id": 43528, "text": "3. Ensure the health of children and adolescents", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43529, "text": "We will provide high -quality works suitable for minors. The current content mainly covers multiple classifications such as calligraphy painting teaching, parent -child education, humanistic science popularization, traditional culture, handmade production, and natural science popularization.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43530, "text": "We will continue to optimize the algorithm recommended to the recommended content of minors, let minors see more high -quality content in different fields, and expand the vision of minors.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43531, "text": "4. Exit children and adolescent mode", "label": [], "rewrite": []}
{"task": "rw_17.jsonl", "id": 43532, "text": "If you are lifted or withdrawn from the \"children/adolescent model\" for your guardian, your guardian will be able to use all the functions of Douyin, and the collection of information type and use purpose will also follow the implementation of the \"Douyin Privacy Policy\".", "label": ["Specific Audiences", "Important"], "rewrite": "If you are lifted or withdrawn from the \"children/adolescent model\" for your guardian, your guardian will be able to use all the functions of Douyin."}
{"task": "rw_17.jsonl", "id": 43533, "text": "If you want to delete personal information under the age of 14, or make a complaint, please contact us through dataprivacy@bytedance.com. After verifying your identity, we will handle it in accordance with your requests and laws and regulations.", "label": ["Specific Audiences", "Contact Information", "Data Security", "Important"], "rewrite": "If you want to delete personal information under the age of 14, or make a complaint, please contact us through dataprivacy@bytedance.com."}
{"task": "rw_17.jsonl", "id": 43534, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
