{"task": "rw_108.jsonl", "id": 72572, "text": "\"Crossing the Fire on the Fire\" guidelines for privacy protection", "label": [], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72573, "text": "Update date: May 7, 2022", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72574, "text": "Effective date: May 7, 2022", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72575, "text": "overview", "label": [], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72576, "text": "You are welcome to choose from Shenzhen Tencent Computer System Co., Ltd. (hereinafter referred to as \"us\".", "label": [], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72577, "text": "Shenzhen Tencent Computer System Co., Ltd. in this guidelines specifically refers to Shenzhen Tencent Computer System Co., Ltd., a provider of crossing the fire and its services on the palm of the palm.35th floor) \"Crossing the Fire on the Fire\" (hereinafter referred to as \"Crossing the Fire\" or \"this product\") provided by!", "label": [], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72578, "text": "In addition to \"Tencent Privacy Policy\" and \"Tencent Palm Crossing the Fire Software License and Service Agreement\", we will also further refine it to you through the \"Guidelines for Privacy Protection Protection\" (\"Guidelines\").When we collect, use, store, and share personal information, as well as related rights you enjoy, this guidance is the integrity of the \"Tencent Palm Crossing Fire Software License and Service Agreement\". The main points are as follows:", "label": [], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72579, "text": "• In order to provide you with information such as information reading, friends chat, community interaction, record inquiry, etc., we need to collect your equipment information, account information, and the log information in the game products of the fire line game and the gun war king.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect equipment information, account information, game product log information to provide services such as information reading, friends chat, community interaction, and record inquiry."}
{"task": "rw_108.jsonl", "id": 72580, "text": "• You can manage your personal information and related authorization according to this guideline.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72581, "text": "• We use multi -directional security protection measures to ensure that your personal information protection is at a reasonable level of security.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72582, "text": "If you are under the age of 18, please read this agreement and other above agreements with the accompaniment of the legal guardian.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72583, "text": "In particular, if you are a child under the age of 14, you should carefully read the \"Child Privacy Protection Statement\" specially formulated by your parents or the legal guardian, and help you complete the product or service registration process in orderYou can use the products or services we provide.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72584, "text": "You can read the entire version of the \"Palm Crossing Fire> Guide to Privacy Protection\" to understand the more detailed personal information processing rules of personal information types and uses.", "label": [], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72585, "text": "1. The information we collect", "label": [], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72586, "text": "In the process of using this product service, we will collect the information that you actively provide or because of the service provided by the service as follows to provide you with your services and ensure your account security:", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72587, "text": "1.1, when you register or use this product service, we will collect your network identity identification information and personal common equipment information for users who are your products.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect network identity identification information and personal commonly used equipment information to mark product users."}
{"task": "rw_108.jsonl", "id": 72588, "text": "If you use WeChat, QQ, and (or) other account numbers (hereinafter referred to as \"third -party accounts\") as a handicap to log in to this product, we will collect your WeChat, QQ and third -party accounts, the unique logo,Avatar, nickname, used to save your login information so that you can log in at different devices.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When logging in with a third -party account, the unique logo, avatar, and nickname of collecting third -party accounts are collected to save your login information."}
{"task": "rw_108.jsonl", "id": 72589, "text": "If you use WeChat, QQ, and (or) third -party accounts as a palm cross -fire account to log in to this product, in order to provide you with services and improve the product experience, we will collect your QQ number, WeChat account, and third -party account number involvedThe only identification, nickname, avatar, and other information you authorized, as well as your related operation information in this product, and show it to you or other users or friends.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When logging in with a third -party account association, collect the relevant information related to the third -party account authorized by your authorization and the related operation information in this product to provide services, improve the product experience, and display."}
{"task": "rw_108.jsonl", "id": 72590, "text": "We may provide you with relevant permissions depending on the specific situation of the product so that you can set the relevant information about whether the relevant information described before.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72591, "text": "1.2, in order to help you better use our products or services with your clear authorization, we may collect relevant information, for example, when you register or use our product or service, you can fill in or get your mobile phone numberClear consent), gender, address book, SMS, equipment ID, equipment name, equipment type and version, system version, installation application list, software installation list, GPS signal, device SN (hardware sequence number), Androidid (only Android only Android only Android (only Android only Android)Duan), IMEI, IMSI, Cellid, nearby WIFI, MAC address, application ID, network type, light sensor information and other information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect mobile phone numbers, gender, address book, text message, device ID, device name, device type and version, system version, installation application list, software installation list, GPS signal, device SN, Androidid, IMEI, IMSI, CELLID, nearbyInformation such as WIFI, MAC address, application ID, network type, light sensor information is used to provide services."}
{"task": "rw_108.jsonl", "id": 72592, "text": "We will use your mobile phone number for authentication.", "label": ["Important", "Usage"], "rewrite": "The mobile phone number is used for authentication."}
{"task": "rw_108.jsonl", "id": 72593, "text": "1.3, when you use this product service, we will collect your log information, such as logging in logs, making dating records, collecting records, browsing history, praise records, review records, submission records, post records and other personal information subject operation records, etc.The corresponding information of the event so that you can check your use of history in this product, and at the same time used for product operation statistical analysis, customer service complaint processing, and other product safety analysis.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your log information so that you can view the use of historical records, product operation statistical analysis, customer service complaint processing, and other product security analysis."}
{"task": "rw_108.jsonl", "id": 72594, "text": "Message information and other information, so that you or your friends or other users can view the game history of you in this product through the game products and gun war king game products.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your log information on the line of fire and the king of the gun so that you can check the game history records of these two game products in this product."}
{"task": "rw_108.jsonl", "id": 72595, "text": "We may provide you with relevant permissions depending on the specific situation of the product so that you can set the relevant information about whether the relevant information described before.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72596, "text": "Regarding the collection and use of your information about the collection and use of your information through the fire line gaming products and the King of Gun War, please see the privacy guidelines or related instructions of the cross -fire game product and the gun war king game product.", "label": [], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72597, "text": ", Equipment screen size and other parameters are used to implement information such as this product and activities. For specific situations, please see the privacy policy or related statement of the SDK operator.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "This product needs to collect parameters such as mobile phone manufacturers Push SDK to collect mobile phone models, system types, system versions, device screen size and other parameters for message push."}
{"task": "rw_108.jsonl", "id": 72598, "text": "1.6, when you interact with other players through text, pictures, voice, videos and other methods in this product, we will access your camera, microphone, calendar, storage, location information, and may be collected and saved what you sendThe content of the above information is used to filter improper content such as pornography, violence, politics, abuse, and malicious advertisements to purify the network environment and maintain a healthy Internet environment.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you interact with other players, we will get cameras, microphones, calendars, storage, location permissions, collect and save the interactive messages you send to filter improper content such as pornography, violence, politics, abuse, and malicious advertisements."}
{"task": "rw_108.jsonl", "id": 72599, "text": "In addition, when you perform video shooting or playback in this product, we will collect your sensor information (linear accelerator) in order to identify and adapt your device horizontal screen status.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your sensor information to identify and adapt your device horizontal and vertical screen status."}
{"task": "rw_108.jsonl", "id": 72600, "text": "1.7, if you want to interact with nearby product users (for example: access and use \"nearby people\" and \"nearby dynamics\" section function), after you authorize consent, we will collect you, geographical location information (including GPS (including GPSInformation, your nearby Wi-Fi, nearby base station ID, that is, cellid), and are used to find nearby users and browse the dynamics released nearby so that you can communicate with nearby users.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect the geographical location information authorized by your authorization to find nearby users and browse the dynamics released nearby."}
{"task": "rw_108.jsonl", "id": 72601, "text": "When the positioning is lost, we will collect your sensor information (gyroscope sensor, acceleration sensor, rotating vector sensor, magnetic sensor, gravity sensor information) for auxiliary positioning.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When the positioning is lost, collect your sensor information for auxiliary positioning."}
{"task": "rw_108.jsonl", "id": 72602, "text": "Geographical location information is a sensitive information. Rejecting to provide this information can only cause you to be unable to interact with nearby users, but it does not affect other functions of your normal use of this product. You can also cancel your geographical location information authorization at any time.", "label": ["Important", "First Party Collection Information", "Edit/Control"], "rewrite": "Refusing geographical location information can only cause you to be unable to interact with nearby users, do not affect other functions, and cancel the authorization at any time."}
{"task": "rw_108.jsonl", "id": 72603, "text": "1.8 In order to ensure the safe and stable operation of this service and implement specific functions, some services in this service are provided by our affiliated parties or other third parties.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72604, "text": "We will chose a third party and third -party to serve, urge relevant third parties to collect and use your personal information in accordance with this guideline or the agreement reached with you, and take appropriate security technology and management measures to ensure your personal information security.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will prudently choose third -party and third -party services, urge them to abide by this guideline or the agreement reached separately, and take appropriate security technology and management measures."}
{"task": "rw_108.jsonl", "id": 72605, "text": "For the specific situation of the third -party information sharing of this service, please see, \"Third -Party Information Sharing List\", (including \"Third -Party SDK Catalog\").", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For the specific situation of the third -party information sharing of this service, please refer to the \"Third -Party Information Sharing List\"."}
{"task": "rw_108.jsonl", "id": 72606, "text": "1.9, according to relevant laws and regulations and national standards, in the following situations, we may collect and use your relevant personal information without soliciting your authorization consent:", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "According to relevant laws and regulations and national standards, in the following circumstances, we may collect and use your relevant personal information without asking your authorization consent:"}
{"task": "rw_108.jsonl", "id": 72607, "text": "1) Directly related to national interests such as national security and national defense security;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "1) Directly related to national interests such as national security and national defense security;"}
{"task": "rw_108.jsonl", "id": 72608, "text": "Directly related to the major public interests such as public safety, public health, and public knowledge;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Directly related to the major public interests such as public safety, public health, and public knowledge;"}
{"task": "rw_108.jsonl", "id": 72609, "text": "2) Directly related to criminal investigation, prosecution, trial and judgment execution;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "2) Directly related to criminal investigation, prosecution, trial and judgment execution;"}
{"task": "rw_108.jsonl", "id": 72610, "text": "3) For major legitimate rights and interests such as maintaining your life, property, and reputation of your or other individuals, but it is difficult to get my consent;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "3) For major legitimate rights and interests such as maintaining your life, property, and reputation of you or other individuals, it is difficult to get my consent;"}
{"task": "rw_108.jsonl", "id": 72611, "text": "4), the personal information you collected is publicly disclosed to the public by yourself;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "4) The collected personal information is made by your own public;"}
{"task": "rw_108.jsonl", "id": 72612, "text": "5) Collect personal information from legal public information, such as legal news reports and government information disclosure;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "5) Collect personal information from the legal publicly disclosed information, such as legal news reports, government information disclosure and other channels;"}
{"task": "rw_108.jsonl", "id": 72613, "text": "6), signing and fulfilling the contract according to your requirements;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "6) Signing and fulfilling the contract according to your requirements;"}
{"task": "rw_108.jsonl", "id": 72614, "text": "7), the safe and stable operation of the products or services provided by maintenance, such as discovering and disposing of products or services;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "7) The necessary and stable operation of the product or service provided by the product or service;"}
{"task": "rw_108.jsonl", "id": 72615, "text": "8) For the necessary news reports;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "8) It is necessary to carry out legal news reports;"}
{"task": "rw_108.jsonl", "id": 72616, "text": "9), when the public interest is necessary to carry out statistics or academic research, and when it provides academic research or description results, it is identified by the personal information contained in the results;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "9) When the statistics or academic research institutes are needed for public interests, and the results of academic research or descriptions are provided, the personal information contained in the result is identified by"}
{"task": "rw_108.jsonl", "id": 72617, "text": "10) Other circumstances stipulated in laws and regulations.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "10) Other circumstances stipulated in laws and regulations."}
{"task": "rw_108.jsonl", "id": 72618, "text": "1.10, please understand that the functions and services we provide to you are constantly updated and developed. If a function or service is not in the aforementioned instructions and collects your information, we will use page prompts, interactive processes, websites, websites, websites, websites, websites, websites, websites, websites, websites, websites, websitesAnnouncement and other methods to explain the content, scope and purpose of the collection of information to obtain your consent.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "Page prompts, interaction processes, website announcement, etc. Anyly explained the updated functions or information content, scope, and purpose required to collect your consent."}
{"task": "rw_108.jsonl", "id": 72619, "text": "At present, in addition to collecting product research information from a third -party research agency to help us improve our products and provide selective content services, and in Article 1.1 of this guideline, you will use a third -party account to log in to this product situation.Get your personal information third parties outside the group.", "label": ["Important", "First Party Collection Information"], "rewrite": "In addition to collecting product research information from a third -party research agency, we will not take the initiative to obtain your personal information from a third party outside Tencent Group."}
{"task": "rw_108.jsonl", "id": 72620, "text": "If the business development needs to obtain and process your personal information from a third party outside Tencent Group in the future, we will strictly abide by the provisions of relevant laws and regulations, ask the third party to obtain your consent and ensure that the information provided by the information it provides provided is legal.sex.", "label": ["Important", "First Party Collection Information"], "rewrite": "When we collect information outside the group, we will comply with the provisions of relevant laws and regulations, and ask the third party to obtain your consent and ensure the legitimacy of the information it provides."}
{"task": "rw_108.jsonl", "id": 72621, "text": "2. Storage of information", "label": [], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72622, "text": "2.1 Method and period of information storage", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72623, "text": "We will store your information in a safe way, including local storage (such as using APP for data cache), database and server logs.", "label": ["Data Retention", "Important"], "rewrite": "Store your information through local storage, database and server logs."}
{"task": "rw_108.jsonl", "id": 72624, "text": "Under normal circumstances, we will only store your personal information within the time necessary for the purpose of service to achieve service purposes or under the conditions of laws and regulations.", "label": ["Data Retention", "Important"], "rewrite": "We will only store your personal information within the time necessary for the purpose of service to achieve service purposes or under the conditions of laws and regulations."}
{"task": "rw_108.jsonl", "id": 72625, "text": "2.2 The area where information storage", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72626, "text": "We will store personal information collected in China in China in accordance with laws and regulations.", "label": ["Data Retention", "Important"], "rewrite": "Personal information collected in the country is stored in China."}
{"task": "rw_108.jsonl", "id": 72627, "text": "2.3 Notice of the product or service stopping operation", "label": ["Cessation of Operations"], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72628, "text": "When our products or services stop operation, we will announce notifications in accordance with relevant laws and regulations and protect your legitimate rights and interests in accordance with the law.", "label": ["Important", "Cessation of Operations"], "rewrite": "When the operation is stopped, the announcement will be made in accordance with relevant laws and regulations, and your legitimate rights and interests will be guaranteed in accordance with the law."}
{"task": "rw_108.jsonl", "id": 72629, "text": "3. Information security", "label": [], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72630, "text": "3.1 Safety protection measures", "label": [], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72631, "text": "We strive to provide protection for users' information security to prevent information leakage, loss, improper use, unauthorized access and disclosure.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72632, "text": "We use multi -directional security protection measures to ensure that user personal information protection is at a reasonable level of security, including technological protection methods, management system control, and security system guarantee.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72633, "text": "We use industry -leading technical protection measures.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72634, "text": "The technical means we use include but not limited to firewalls, encryption (such as SSL), de -identification or anonymous treatment, access control measures, etc.", "label": ["Important", "Data Security"], "rewrite": "Use technologies such as firewalls, encryption, de -identification or anonymous processing, access control measures, etc. to protect your information."}
{"task": "rw_108.jsonl", "id": 72635, "text": "In addition, we will continue to strengthen the security capabilities of software installed on your device.", "label": ["Important", "Data Security"], "rewrite": "Strengthen the security capabilities of software installed on the device side."}
{"task": "rw_108.jsonl", "id": 72636, "text": "For example, we will complete some information encryption work locally to consolidate security transmission;", "label": ["Important", "Data Security"], "rewrite": "Complete some information encryption work locally."}
{"task": "rw_108.jsonl", "id": 72637, "text": "We will understand the application information and running process information installed by your device to prevent malicious programs such as viruses and Trojans.", "label": ["Important", "Data Security"], "rewrite": "Understand the application information and running process information installed in the equipment to prevent malicious procedures such as viruses and Trojan."}
{"task": "rw_108.jsonl", "id": 72638, "text": "We have established a special management system, process and organization that guarantees personal information security.", "label": ["Important", "Data Security"], "rewrite": "Establish a special management system, processes and organizations that ensure personal information security."}
{"task": "rw_108.jsonl", "id": 72639, "text": "For example, we strictly restrict the scope of the personnel of the access information, require them to abide by the confidentiality obligations and audit, and those who violate the obligations will be punished in accordance with regulations.", "label": ["Important", "Data Security"], "rewrite": "Strictly restrict the scope of the personnel who access information, and sign a confidentiality agreement with them to punish those who violate the obligations of confidentiality."}
{"task": "rw_108.jsonl", "id": 72640, "text": "We will also review the management system, process and organization to prevent unauthorized access, use or disclosure of user information.", "label": ["Important", "Data Security"], "rewrite": "Examine the management system, process, and organizations to prevent unauthorized personnel from accessing, using or disclosing users' information on unauthorized personnel."}
{"task": "rw_108.jsonl", "id": 72641, "text": "We recommend that you pay full attention to the protection of personal information when using products and services, and we will also provide multiple security functions to help you protect your personal information security.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72642, "text": "3.2 Safety event disposal measures", "label": [], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72643, "text": "If personal information leaks and other security incidents occur, we will start emergency plans to prevent security incidents from expanding.", "label": ["Important", "Data Security"], "rewrite": "If personal information leaks and other security incidents occur, we will start emergency plans to prevent security incidents from expanding."}
{"task": "rw_108.jsonl", "id": 72644, "text": "After the security incident occurs, we will inform you the basic situation of the security incident in the form of announcement, push notification or email, we are about or already adopted, and our proposals for your response.", "label": ["Important", "Data Security"], "rewrite": "The relevant situation of security incidents will be informed by mail, letter, telephone, push notification, etc. When it is difficult to inform one by one, it will issue an announcement."}
{"task": "rw_108.jsonl", "id": 72645, "text": "If it is difficult to notify one by one, we will issue warnings through announcements and other means.", "label": ["Important", "Data Security"], "rewrite": "Publish warnings through announcement and other methods."}
{"task": "rw_108.jsonl", "id": 72646, "text": "4. How do we use information", "label": [], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72647, "text": "We strictly abide by the provisions of laws and regulations and the agreement with users, in accordance with this guideline and the use and collection information described in the \"Tencent Palm Crossing Fire Software License and Service Agreement\" and \"Tencent Privacy Policy\" to provide you with better service servicesEssence", "label": [], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72648, "text": "4.1 Information use rules", "label": [], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72649, "text": "We will use the collected information according to the following rules:", "label": ["Usage"], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72650, "text": "1), we will provide you with various functions and services according to the information we collect, including basic information reading, friends chat, community interaction, record query functions, etc.;", "label": ["Important", "Usage"], "rewrite": "The collected information is used to provide basic information reading, friends chat, community interaction, and record query functions."}
{"task": "rw_108.jsonl", "id": 72651, "text": "2), we will analyze the operation of our products based on the frequency and situation of this product, fault information, performance information, etc. to ensure the security of the service, optimize our products, and improve our service quality.", "label": ["Important", "Usage"], "rewrite": "The frequency and situation of the product, fault information, and performance information are used to analyze the operation of the product, ensure the safety of service, and optimize the product."}
{"task": "rw_108.jsonl", "id": 72652, "text": "We will not combine the information we store in the analysis software with the personal identity information you provide.", "label": ["Important", "Usage"], "rewrite": "We will not combine the information we store in the analysis software with the personal identity information you provide."}
{"task": "rw_108.jsonl", "id": 72653, "text": "4.2 The way to obtain consent after notifying the purpose of the change", "label": [], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72654, "text": "We will use the collected information in the purpose covered by this guideline.", "label": [], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72655, "text": "If we use your personal information beyond the stated purpose and scope of direct or reasonable connection with the collection, we will notify you again and obtain your express consent before using your personal information.", "label": ["Important", "Data Security"], "rewrite": "We will tell you again before using your personal information to use your personal information beyond the scope of collection purposes."}
{"task": "rw_108.jsonl", "id": 72656, "text": "5. Provide outside", "label": [], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72657, "text": "At present, except for this guideline and the \"Tencent Palm Crossing Fire Software License and Service Agreement\" stipulated, we will not actively share, provide or transfer your personal information to the third parties outside Tencent Group, such as other sharing and provisionOr when you transfer your personal information or you need us to share, provide or transfer your personal information to a third party situation outside Tencent Group, we will directly or confirm that the third party obtains your consent of the above behavior.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "If we take the initiative to share, provide or transfer your personal information to a third party outside Tencent Group, it will directly or confirm that the third party obtains your consent of your behavior."}
{"task": "rw_108.jsonl", "id": 72658, "text": "Except for this guideline and the \"Tencent Palm Crossing Fire Software License and Service Agreement\" and \"Tencent Privacy Policy\", we will not publicly disclose the collected personal information collected.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Except for this guideline and the \"Tencent Palm Crossing Fire Software License and Service Agreement\" and \"Tencent Privacy Policy\", we will not publicly disclose the collected personal information collected."}
{"task": "rw_108.jsonl", "id": 72659, "text": "If public disclosure is necessary, we will inform you of the purpose of the public disclosure, the type of information disclosed and the sensitive information that may be involved, and obtain your express consent.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72660, "text": "With the continuous development of our business, we may conduct merging, acquisition, asset transfer and other transactions. We will inform you that the relevant situation will continue to protect or request new controller to continue in accordance with laws and regulations and not lower than the standards required by this guideline.Protect your personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If business mergers, acquisitions, asset transfer and other transactions will be informed of the relevant situation, and it will continue to protect your personal information in accordance with laws and regulations and not lower than the standards required by this guideline."}
{"task": "rw_108.jsonl", "id": 72661, "text": "In addition, in accordance with relevant laws and regulations and national standards, in the following situations, we may share, transfer, and openly disclose personal information without obtaining your authorization consent in advance:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "According to relevant laws and regulations and national standards, in the following circumstances, we may share, transfer, and publicly disclose personal information without obtaining your authorization consent in advance:"}
{"task": "rw_108.jsonl", "id": 72662, "text": "1) Directly related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "1) Directly related to national security and national defense security;"}
{"task": "rw_108.jsonl", "id": 72663, "text": "2) Directly related to public safety, public health, and major public interests;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "2) Directly related to public safety, public health, and major public interests;"}
{"task": "rw_108.jsonl", "id": 72664, "text": "3), directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "3) Directly related to criminal investigation, prosecution, trial and judgment execution;"}
{"task": "rw_108.jsonl", "id": 72665, "text": "4) For major legitimate rights and interests such as the life and property of personal information subject or other individuals, it is difficult to get my consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "4) In order to protect the major legal rights and interests of the personal information subject or other individuals such as life and property, but it is difficult to obtain the consent of the individual;"}
{"task": "rw_108.jsonl", "id": 72666, "text": "5), the subject of personal information disclose personal information to the public by itself;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "5) The personal information subject discloses personal information to the public by itself;"}
{"task": "rw_108.jsonl", "id": 72667, "text": "6), collecting personal information from legally disclosed information, such as legal news reports, government information disclosure and other channels.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "6) Personal information is collected from legally disclosed information, such as legal news reports, government information disclosure and other channels."}
{"task": "rw_108.jsonl", "id": 72668, "text": "6. Your rights", "label": [], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72669, "text": "During your use of this product service, we may provide you with the corresponding operation settings according to the specific situation of this product, so that you can inquire, delete, correct or remove your relevant personal information. You can refer to the specific guidance of the product for operation.", "label": ["Edit/Control", "Important"], "rewrite": "You can query, delete, more correct or withdraw your relevant personal information through the corresponding operation settings."}
{"task": "rw_108.jsonl", "id": 72670, "text": "In addition, we have set up a complaint report channel, and your opinions will be dealt with in a timely manner.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72671, "text": "7. Changes", "label": [], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72672, "text": "We may revise this guidelines in a timely manner.", "label": [], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72673, "text": "When the terms of this guideline change, we will prompt you the guidance after the version is updated in an appropriate manner.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72674, "text": "Please read the content of the privacy protection or guidelines carefully after the change. You continue to use this product to indicate that you agree to collect, process or use your personal information according to the updated privacy protection guidelines.", "label": ["Policy Change", "Important", "Risk"], "rewrite": "If you continue to use the service, you will be deemed to agree to accept the revised privacy policy."}
{"task": "rw_108.jsonl", "id": 72675, "text": "8. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72676, "text": "We attach great importance to the protection of personal information of minors and continue to explore the updated personal information protection methods of minors.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72677, "text": "According to the relevant laws and regulations, if you are a minor under the age of 18, you should obtain the consent of your parents or legal guardians before using Tencent's service.", "label": ["Specific Audiences", "Important"], "rewrite": "Minors under the age of 18 should obtain the consent of their guardians before using."}
{"task": "rw_108.jsonl", "id": 72678, "text": "In particular, if you are a child under the age of 14, you should help you complete the product or service registration process by your parents or the legal guardian so that you can use the products or services we provide.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a child under the age of 14, your parents or legal guardians should help you complete the product or service registration process."}
{"task": "rw_108.jsonl", "id": 72679, "text": "If you are the guardian of minors, when you help children complete the registration and use of products or services, you should carefully read this guideline and the \"Child Privacy Protection Statement\", decide whether to agree with this guideline and the \"Child Privacy Protection Statement\".Help minors register and use so that they can use the products or services we provide.", "label": ["Policy Change", "Specific Audiences", "Important"], "rewrite": "The guardian should read and use the policy carefully before helping children complete the registration and use of products or services."}
{"task": "rw_108.jsonl", "id": 72680, "text": "If you have any questions or requests about the protection of the personal information of the minors under your guardianship, please contact us through the contact information disclosed in Part VII of the \"Children's Privacy Protection Statement\".", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72681, "text": "We will deal with and reply to you within a reasonable time.", "label": [], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72682, "text": "9. Other", "label": [], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72683, "text": "\"Tencent Privacy Policy\" is a general privacy clause for Tencent's unified applicable. The content stipulated in it includes but not limited to user rights and information security measures.", "label": [], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72684, "text": "For example, the \"Tencent Privacy Policy\" is inconsistent or contradictory with this guideline, please refer to this guideline.", "label": [], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72685, "text": "\"Child Privacy Protection Statement\" is a personal information protection rule for children under 14 years of age.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72686, "text": "Within the scope of the \"Child Privacy Protection Statement\", such as the \"Tencent Privacy Policy\" and this guideline are inconsistent or contradictory, please refer to the \"Child Privacy Protection Statement\".", "label": [], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72687, "text": "10. Contact us", "label": [], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72688, "text": "When you have any other complaints, suggestions, and personal information related to minors, please contact us through https://kf.qq.com/.", "label": ["Important", "Contact Information"], "rewrite": "For complaints and suggestions about personal information of minors, please contact us through https://kf.qq.com/."}
{"task": "rw_108.jsonl", "id": 72689, "text": "You can also send your question to dataprivacy@tencent.com or send it to the following address:", "label": ["Important", "Contact Information"], "rewrite": "E-mail: Dataprivacy@tencent.com"}
{"task": "rw_108.jsonl", "id": 72690, "text": "Tencent Binhai Building, No. 33 Haitian Second Road, Nanshan District, Guangdong Province, China, Data and Privacy Protection Center of the Ministry of Legal Affairs (receipt)", "label": ["Important", "Contact Information"], "rewrite": "Address: Data and Privacy Protection Center, Legal Department, Tencent Binhai Building, No. 33 Haitian 2nd Road, Nanshan District, Shenzhen, Guangdong Province, China (closed)"}
{"task": "rw_108.jsonl", "id": 72691, "text": "Zip code: 518054", "label": ["Important", "Contact Information"], "rewrite": "Zip code: 518054"}
{"task": "rw_108.jsonl", "id": 72692, "text": "<it is delimiter>", "label": [], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72693, "text": "Child Privacy Protection Statement", "label": [], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72694, "text": "Tencent is committed to protecting the personal information of children using our products or services.", "label": [], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72695, "text": "\"Children's Privacy Protection Statement\" (hereinafter referred to as \"this statement\") and \"Tencent Privacy Policy\" are intended to explain to guardians (hereinafter referred to as \"you\") and children how we collect, use, store and process children's personal information, and how we Ways for you and your children to access, correct, delete and protect this information.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72696, "text": "Unless otherwise agreed, the terms and acronyms used in this statement have the same meanings as those in the Tencent Service Agreement and Tencent Privacy Policy.", "label": [], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72697, "text": "Special description of children's guardians:", "label": [], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72698, "text": "If you are the guardian of a child user, please read carefully and choose whether to agree to this statement.", "label": ["Policy Change", "Specific Audiences", "Important"], "rewrite": "Please read and choose whether the guardian of children's users should read and choose to agree with this statement."}
{"task": "rw_108.jsonl", "id": 72699, "text": "We hope that you should jointly protect the personal information of children with us, educate and guide children to enhance personal information protection awareness and ability, guide, remind and ask them to provide any online products and service providers without providing any online products and service providers.personal information.", "label": ["Data Security", "Specific Audiences"], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72700, "text": "Children's special description:", "label": [], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72701, "text": "If you are a minor under the age of 14, you need to read this statement carefully with your guardian, and use our products and services or provide us with information after obtaining the consent of your guardian.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a child under the age of 14, please and your guardian to read the statement carefully and use the product, service or information after the guardian consent."}
{"task": "rw_108.jsonl", "id": 72702, "text": "Please read and fully understand the \", Tencent Privacy Policy, Tencent Privacy Policy,\", the guidelines for privacy protection (if.), And this statement, choose whether to agree with the relevant privacy policies and whether the children you and your guardian use our products to use our products to use our products.Or service.", "label": ["Policy Change", "Specific Audiences", "Important"], "rewrite": "Guardians are asked to choose whether to agree to the relevant privacy policy and whether to agree to use our products or services by you and the children under your guardianship."}
{"task": "rw_108.jsonl", "id": 72703, "text": "If you do not agree with the relevant privacy policies and the content of this statement, or the information necessary for providing services, it may cause our products or services to be unable to run normally, or to achieve the service effects we intend to achieve.It may not be able to use our products, services or related specific business functions normally.", "label": ["Specific Audiences", "Important", "First Party Collection Information"], "rewrite": "If you do not agree with the relevant privacy policies and the content of this statement, or the information necessary for providing services, it may cause your children and your children to be able to use our products, services or related specific business functions normally."}
{"task": "rw_108.jsonl", "id": 72704, "text": "If you click \"Agree\" means that you agree that we are in accordance with the information of \", Tencent Privacy Policy,\", the guidelines for privacy protection (if.), And the agreed collection, use, and processing the information of your children's guardianship.", "label": ["Policy Change", "Specific Audiences", "Important"], "rewrite": "By clicking \"Agree\", you agree to collect, use and process the information of you and the children under your guardianship in accordance with the \"Tencent Privacy Policy\", the privacy protection guidelines for specific products and this statement."}
{"task": "rw_108.jsonl", "id": 72705, "text": "Please understand that this statement is only applicable to our products or services for children under 14 years of age, products or services with functional segments that are dedicated to children under 14 years of age, or users need to enter birthdays and age information.Products or services.", "label": ["Specific Audiences", "Important"], "rewrite": "This statement is only applicable to the products or services of children under the age of 14, and has a functional sector that is dedicated to children under the age of 14."}
{"task": "rw_108.jsonl", "id": 72706, "text": "For products or services that cannot identify or do not actively identify users' ages, the \"Tencent Privacy Policy\" and specific product privacy protection guidelines (if any) apply.", "label": [], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72707, "text": "The products and services we provide may include the products or services provided by a third party, and you may also log in and use third -party products and services through our products (such as QQ or WeChat).", "label": [], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72708, "text": "Please note that the third party may collect, use, or process children's relevant information, and you need to obtain your consent separately by these third parties.", "label": ["Specific Audiences", "Important"], "rewrite": "Third -party collection, use or processing information about children in the products and services we provide, you need to obtain you separately from these third parties."}
{"task": "rw_108.jsonl", "id": 72709, "text": "We suggest that you let your children ask for your consent before authorizing a third party to collect and handle any personal information.", "label": ["Specific Audiences", "Important"], "rewrite": "It is recommended that children solicit your consent before authorizing a third party to collect and handle any personal information."}
{"task": "rw_108.jsonl", "id": 72710, "text": "We remind you that in this statement, the important terms (possibly) of the rights and interests of you and your children's guardianship are closely related to the bold fonts to remind you that you should focus on it.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72711, "text": "If you have any questions or personal information related to personal information in the process of reading this statement, we provide you with special feedback channels. For details, please refer to the chapter of \"Contact Us\" in this statement. We will answer you as soon as possible.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72712, "text": "What information we collect", "label": [], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72713, "text": "Tencent strictly abides by the provisions of laws and regulations and the agreement with the user, and collects the following personal information of the children you and your children's guardianship according to the specific situation of the user's selection of products or services.", "label": ["First Party Collection Information", "Specific Audiences"], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72714, "text": "For some functional segments of products and services or products and services for children under the age of 14, we need to enter products or services that can identify users' age such as birthdays and age information, such as registered or using such products or services.We will ask users to fill in personal birthday information to identify children under the age of 14, and in accordance with the provisions of laws and regulations, they allow children to continue to use related products or services after obtaining the consent of the guardian.", "label": ["Specific Audiences", "First Party Collection Information", "Usage", "Important"], "rewrite": "When registering or using products or services for children under the age of 14, we will collect personal birthday information and obtain the consent of the guardian to allow children to continue to use related products or services."}
{"task": "rw_108.jsonl", "id": 72715, "text": "When we identify children under 14 years of age based on the above information provided by the user, we will collect your contact information, including mobile phone numbers, e -mail, and use this information to contact youCare relationship.", "label": ["Specific Audiences", "First Party Collection Information", "Usage", "Important"], "rewrite": "If you identify children under the age of 14, we will collect contact information of the guardian, including mobile phone numbers and e -mails for contact and verifying monitoring relationships."}
{"task": "rw_108.jsonl", "id": 72716, "text": "According to the product or service verification monitoring relationship and obtain the specific plan you agree, we may also associate your account with the child account to protect the personal information rights and interests of your child's care.", "label": ["Specific Audiences", "Usage", "Important"], "rewrite": "We may associate the guardian's account with the child account."}
{"task": "rw_108.jsonl", "id": 72717, "text": "In some products or services involved in transactions, we may require collecting and binding your bank card -related information in order to know and manage the transaction behavior of children's users.", "label": ["Specific Audiences", "First Party Collection Information", "Usage", "Important"], "rewrite": "We may collect and bind the relevant information of the guardian's bank card in order to know and manage the trading behavior of children's users."}
{"task": "rw_108.jsonl", "id": 72718, "text": "For example, products or services involve uploading avatars and other functions, we strongly recommend that you guide children not to upload information such as real portrait photos in the process of using our product or service.", "label": ["Specific Audiences", "Important"], "rewrite": "It is recommended that children do not upload information such as real portrait photos in the process of using our products or services."}
{"task": "rw_108.jsonl", "id": 72719, "text": "In the process of using products or services for children, we will collect relevant information. For details, please refer to the section of \"We collected the information we collected\" in \"Tencent Privacy Policy\" to learn more about the personal information of other children we collected.", "label": ["Specific Audiences", "First Party Collection Information", "Important"], "rewrite": "In the process of using products or services for children, we will collect relevant information. For details, please refer to the section of \"We collected the information we collected\" in \"Tencent Privacy Policy\" to learn more about the personal information of other children we collected."}
{"task": "rw_108.jsonl", "id": 72720, "text": "If we need to exceed the personal information of the children or your child's guardianship, we will tell you again and obtain your consent.", "label": ["Specific Audiences", "First Party Collection Information", "Data Security", "Important"], "rewrite": "If we collect information over the range, we will tell you again and obtain your consent."}
{"task": "rw_108.jsonl", "id": 72721, "text": "Please understand, you can choose whether to fill in or provide specific information to us, but if you do not fill in or provide some specific information, it may cause our products or servicesThe effect, the children you and your monitoring may not be able to use our products, services or related specific business functions normally.", "label": ["Specific Audiences", "First Party Collection Information", "Important"], "rewrite": "If you do not fill in or provide some specific information, your child and your child may not be able to use our products, services or related specific business functions normally."}
{"task": "rw_108.jsonl", "id": 72722, "text": "How do we use this information", "label": [], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72723, "text": "We strictly abide by the provisions of laws and regulations and the agreement with the user, and use the information of the collected children you and the children you monitored for the following purposes:", "label": ["Specific Audiences", "Usage", "Important"], "rewrite": "The information of you and your child will be used in the following purposes: verify the identity of children and guardians, and provide specific functions of necessary products or services, products or services to optimize the purpose of products or services, security guarantee, and service survey."}
{"task": "rw_108.jsonl", "id": 72724, "text": "Verify the identity of children and guardians", "label": ["Usage", "Specific Audiences"], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72725, "text": "Provide specific functions of the necessary products or services, products or services", "label": ["Usage", "Specific Audiences"], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72726, "text": "The purpose of optimizing products or services, security, and service survey", "label": ["Usage", "Specific Audiences"], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72727, "text": "If we need to exceed the personal information of the children you or your or your guardian, we will tell you again and obtain your consent", "label": ["Specific Audiences", "Usage", "Important"], "rewrite": "If we use children's personal information beyond the range of children, it will get your consent again."}
{"task": "rw_108.jsonl", "id": 72728, "text": "The situation of sharing, transfer, and disclosure of children's personal information", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72729, "text": "In accordance with the provisions of laws and regulations, we strictly restrict the situation of sharing, transfer, and disclosure of children's personal information.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Important"], "rewrite": "In accordance with the provisions of laws and regulations, we strictly restrict the situation of sharing, transfer, and disclosure of children's personal information."}
{"task": "rw_108.jsonl", "id": 72730, "text": "Under normal circumstances, Tencent will not share children's personal information from third parties.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences"], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72731, "text": "Only when the guardian agrees in advance, can we share the personal information of children with third parties.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Important"], "rewrite": "Only when the guardian agrees in advance, can we share the personal information of children with third parties."}
{"task": "rw_108.jsonl", "id": 72732, "text": "Share with the guardian", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences"], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72733, "text": "We will share some children's personal information (such as children's username, account number, password, and transaction content of the children's users in some of our products and services, etc.). The guardian can access and manage related personal information.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Important"], "rewrite": "We will share some children's personal information with the guardian so that they can access and manage related personal information."}
{"task": "rw_108.jsonl", "id": 72734, "text": "In order to achieve external processing, we may be with third -party partners (third -party service providers, contractors, agents, application developers, etc., for example, on behalf of us to send an email or push notification of communication service providers, as for the notification, as a communication service provider, as a push notification, as a communication service provider, for us to send a notice, as a communication service provider, to as for the notification, as a push notification, as a communication service provider, as a push notification, as a communication service provider.We provide a map service supplier for location services) (they may not be located in your land) to share children's personal information, allowing them to handle the above information for us according to our instructions, privacy policies, and related confidentiality and security policies.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Important"], "rewrite": "We may share children's personal information with third -party partners and let them handle children's information for us according to our instructions, privacy policies, and related confidentiality and security policies."}
{"task": "rw_108.jsonl", "id": 72735, "text": "If we entrust a third -party processing of personal information, we will conduct a security assessment of the commissioner and commission behavior, sign the commission agreement, and ask the entrusting party to handle the scope of our authorization.Information is mainly used in the following purposes:", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Important", "Data Security", "Usage"], "rewrite": "We conducted a security assessment of the entrusted party and commissioned behavior, signed a commission agreement, and entrusted third -party processing for children's personal information.Performing obligations and exercise of rights; understanding, maintaining and improving our services."}
{"task": "rw_108.jsonl", "id": 72736, "text": "· Provide our services to children;", "label": ["Usage", "Third Party Sharing/ Disclosure", "Specific Audiences"], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72737, "text": "· Implement the purpose of the \"How to use this information\" part;", "label": ["Usage", "Third Party Sharing/ Disclosure", "Specific Audiences"], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72738, "text": "· Perform our obligations and the right to exercise our rights in the \"Tencent Privacy Policy\" and this statement;", "label": ["Usage", "Third Party Sharing/ Disclosure", "Specific Audiences"], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72739, "text": "· Understand, maintain and improve our services.", "label": ["Usage", "Third Party Sharing/ Disclosure", "Specific Audiences"], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72740, "text": "If we share information about you and children with the above third parties, we will conduct security assessments and use encryption, anonymous, de -identification processing and other means to ensure the security of your and children.", "label": ["Specific Audiences", "Important", "Data Security"], "rewrite": "We conduct security assessments for shared meetings and use encryption, anonymous, de -identification processing and other means to ensure information security."}
{"task": "rw_108.jsonl", "id": 72741, "text": "With the sustainable development of our business, when transactions such as mergers, acquisitions, asset transfers have led to share your personal information from third parties, we will inform you of the relevant situations by pushing notifications and announcements, in accordance with laws and regulations and not or not.The standards required by this statement will continue to protect or require new managers to continue to protect your personal information of you and children.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Data Security", "Important"], "rewrite": "If business merger, acquisition, asset transfer and other transactions will be informed of the relevant situation, and the personal information of you and children will continue to protect your and children in accordance with laws and regulations and not lower than the standards required by this guideline."}
{"task": "rw_108.jsonl", "id": 72742, "text": "We may use the collected children's information after anonymous processing for big data analysis, such as the heating diagram and insight report that does not contain any personal information.", "label": ["Specific Audiences", "Usage", "Important"], "rewrite": "We may use the collected children's information after anonymous processing for big data analysis."}
{"task": "rw_108.jsonl", "id": 72743, "text": "We may disclose and share information with our partners with information that does not include identity recognition content after statistical processing, to understand how users use our service or let the public understand the overall trend of our service.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Usage", "Important"], "rewrite": "We may disclose and share information that does not include identity recognition after statistics."}
{"task": "rw_108.jsonl", "id": 72744, "text": "Under normal circumstances, we prohibit the disclosure of children's personal information, but we may disclose the personal information of children based on the following goals:", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Important"], "rewrite": "Under normal circumstances, we prohibit the disclosure of children's personal information, but we may disclose the personal information of children based on the following goals:"}
{"task": "rw_108.jsonl", "id": 72745, "text": "·, Comply with relevant regulations such as applicable laws and regulations, etc.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Important"], "rewrite": "Comply with relevant regulations such as applicable laws and regulations;"}
{"task": "rw_108.jsonl", "id": 72746, "text": "·, Abide by the court's judgment, ruling or other legal procedures;", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Important"], "rewrite": "Comply with the court's judgment, ruling or other legal procedures;"}
{"task": "rw_108.jsonl", "id": 72747, "text": "·, Abide by the requirements of relevant government agencies or other legal authorization organizations;", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Important"], "rewrite": "Comply with the requirements of relevant government agencies or other legal authorization organizations;"}
{"task": "rw_108.jsonl", "id": 72748, "text": "· We have reason to be convinced that we need to comply with relevant regulations such as laws and regulations;", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Important"], "rewrite": "We have reason to be convinced that we need to comply with relevant regulations such as laws and regulations;"}
{"task": "rw_108.jsonl", "id": 72749, "text": "· In order to implement related service agreements or this statement, to protect the public interest of the society, and to protect the personal property of our customers, or our affiliated companies, other users or employees, or other legitimate rights and interests, it is reasonable and necessary.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Important"], "rewrite": "In order to implement related service agreements or this statement, to protect the public interest of the society, and to protect the personal property of our customers, or our affiliated companies, other users or employees, the safety or other legitimate rights and interests of the personal property of our customers, or other users, or employees."}
{"task": "rw_108.jsonl", "id": 72750, "text": "Personal information for children", "label": ["Data Retention", "Specific Audiences"], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72751, "text": "Tencent will take technical measures such as encryption to store personal information of children to ensure information security.", "label": ["Specific Audiences", "Data Security", "Important"], "rewrite": "Use technical measures such as encryption to store personal information."}
{"task": "rw_108.jsonl", "id": 72752, "text": "Tencent stores personal information for children, and will not exceed the time limit for its collection and use purpose.", "label": ["Data Retention", "Specific Audiences", "Important"], "rewrite": "Store children's personal information will not exceed the time limit for its collection and use."}
{"task": "rw_108.jsonl", "id": 72753, "text": "Please check the \"Location and Details of the Storage Information\" and \"Information Security\" chapters of \"Tencent Privacy Policy\", and learn more about how we store and protect personal information of children.", "label": ["Data Retention", "Specific Audiences"], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72754, "text": "When our products or services stop operation or your personal information storage period for your and children, we will take the form of notifying you and children in the form of push notification, announcement, etc.Personal information of you and children.", "label": ["Data Retention", "Specific Audiences", "Important"], "rewrite": "When the operation or storage period expires, the announcement will be announced in accordance with relevant laws and regulations, and personal information will be deleted or anonymous."}
{"task": "rw_108.jsonl", "id": 72755, "text": "Personal information about children", "label": [], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72756, "text": "During the use of Tencent products or services for children, in order to more conveniently access, correct, and delete relevant personal information in the product design, we can provide you with corresponding operation settings in the product design., Feed and consult relevant information.", "label": ["Edit/Control", "Specific Audiences", "Important"], "rewrite": "You can access, correct, and delete relevant personal information through the corresponding operation settings or contact us."}
{"task": "rw_108.jsonl", "id": 72757, "text": "We will contact you in time after verifying your feedback.", "label": ["Edit/Control", "Specific Audiences"], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72758, "text": "Please understand that in the process of verification, we may need you to provide personal information such as children's accounts, children's birth date, contact information, etc., so as to continue to respond to your needs after completing identity verification and problem verification.", "label": ["Specific Audiences", "First Party Collection Information", "Data Security", "Important"], "rewrite": "We may need to collect personal information such as children's accounts, children's birth date, contact information, in order to respond to your needs."}
{"task": "rw_108.jsonl", "id": 72759, "text": "Personal information for children", "label": [], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72760, "text": "Children you and your monitoring can view personal information provided or generated by children's users in our products or services, including but not limited to user names, passwords, avatars, nicknames, gender, and active release.", "label": ["Edit/Control", "Specific Audiences", "Important"], "rewrite": "You and your children's career can view personal information such as usernames, passwords, avatars, nicknames, gender, and active content."}
{"task": "rw_108.jsonl", "id": 72761, "text": "Correct children's personal information", "label": [], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72762, "text": "When you and your children's personal information are found, the children's personal information we collect, use, and processed can be corrected.", "label": ["Edit/Control", "Specific Audiences", "Important"], "rewrite": "You can contact us to correct the personal information of children who collect, use and deal with errors."}
{"task": "rw_108.jsonl", "id": 72763, "text": "We will take timely measures after completing the problems of identity verification and verification.", "label": ["Edit/Control", "Specific Audiences"], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72764, "text": "Delete personal information", "label": [], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72765, "text": "If there is the following situations, the children you and your guardians can ask us to delete the personal information of children who collect, use and process.", "label": ["Edit/Control", "Specific Audiences", "Important"], "rewrite": "You and your children's care can ask us to delete the personal information of children who collect, use and process."}
{"task": "rw_108.jsonl", "id": 72766, "text": "We will take measures in time after completing the identity verification and verification problem.", "label": ["Data Security", "Edit/Control", "Specific Audiences"], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72767, "text": "· If we violate the provisions of laws and administrative regulations or the agreed collection, storage, use, transfer, and disclosure of the personal information of children's personal information;", "label": ["Edit/Control", "Specific Audiences"], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72768, "text": "· If we are exceeded the scope of the purpose or the necessary period of collection, storage, use, transfer, and disclose the personal information of children;", "label": ["Edit/Control", "Specific Audiences"], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72769, "text": "· You withdraw consent;", "label": ["Edit/Control", "Specific Audiences"], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72770, "text": "· You or your children's guardianship termination of products or services by canceling and other methods.", "label": ["Edit/Control", "Specific Audiences"], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72771, "text": "However, please note that if you and the guardian child ask us to delete specific children's personal information, it may lead to some specific business functions in our children's users to continue to use our products and services or products and services.", "label": ["Edit/Control", "Specific Audiences", "Important"], "rewrite": "Deleting personal information of specific children may cause the child to unable to continue to use our products and services or some specific business functions."}
{"task": "rw_108.jsonl", "id": 72772, "text": "If you find that your child's personal information is collected without advance obtaining your consent, please contact us in time, and we will try to delete relevant data as soon as possible.", "label": ["Edit/Control", "Specific Audiences", "Important"], "rewrite": "If the personal information of minors was collected without the consent of the parents, he would try to delete relevant information as soon as possible."}
{"task": "rw_108.jsonl", "id": 72773, "text": "When can children manage their accounts by themselves", "label": [], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72774, "text": "After being guarded by the age of 14, he has the right to manage his account by himself.", "label": ["Edit/Control", "Specific Audiences", "Important"], "rewrite": "After being guarded by the age of 14, he has the right to manage his account by himself."}
{"task": "rw_108.jsonl", "id": 72775, "text": "If children's users choose to manage their Tencent account by themselves, you will not be able to continue accessing or controlling its account.", "label": ["Edit/Control", "Specific Audiences", "Important"], "rewrite": "If children's users choose to manage their Tencent account by themselves, you will not be able to continue accessing or controlling its account."}
{"task": "rw_108.jsonl", "id": 72776, "text": "When the guardian children have the right to manage Tencent account by themselves, we will notify you and the child guarding children.", "label": ["Edit/Control", "Specific Audiences", "Important"], "rewrite": "When the guardian children have the right to manage Tencent account by themselves, we will notify you and the child guarding children."}
{"task": "rw_108.jsonl", "id": 72777, "text": "Application of this statement", "label": [], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72778, "text": "This statement is only applicable to products or services for children under 14 years of age, products or services with functional sectors dedicated to children under 14 years of age, or users need to enter birthdays, age information, etc.For products or services that cannot be recognized or do not actively identify the age of users, only the \"Tencent Privacy Policy\" and the guidance of privacy protection for specific products (if any).", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72779, "text": "Please understand that if the statement is not stipulated, refer to the guidance of the \"Tencent Privacy Policy\" or the privacy protection guidance of specific products (if any).", "label": [], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72780, "text": "In the case of applying this statement, such as the provisions of this statement and the provisions of the \"Tencent Privacy Policy\" and the guidelines of the privacy protection (if.), This statement shall prevail.", "label": [], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72781, "text": "contact us", "label": [], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72782, "text": "We have set up a special person in personal information protection team and personal information protection person. If you have any questions or complaints or suggestions on the privacy policy or personal information protection related matters, you can contact us in the following ways:", "label": ["Important", "Contact Information"], "rewrite": "You can contact us in the following way:"}
{"task": "rw_108.jsonl", "id": 72783, "text": "1. You can fill in, feedback questionnaires for personal information protection and privacy issues, contact us;", "label": ["Important", "Contact Information"], "rewrite": "1. You can fill in personal information protection and privacy issues to contact us;"}
{"task": "rw_108.jsonl", "id": 72784, "text": "2. Send the problem to dataprivacy@tencent.com;", "label": ["Important", "Contact Information"], "rewrite": "2. Send the problem to dataprivacy@tencent.com;"}
{"task": "rw_108.jsonl", "id": 72785, "text": "3., contact us through https://kf.qq.com/;", "label": ["Important", "Contact Information"], "rewrite": "3. Contact us through https://kf.qq.com/;"}
{"task": "rw_108.jsonl", "id": 72786, "text": "4. Mail your question to the following address:", "label": ["Important", "Contact Information"], "rewrite": "4. Mail your question to the following address: Data Privacy Protection Department, Tencent Binhai Building, No. 33 Haitian Second Road, Nanshan District, Shenzhen, Guangdong Province, China"}
{"task": "rw_108.jsonl", "id": 72787, "text": "Tencent Binhai Building, No. 33 Haitian Er Road, Nanshan District, Guangdong Province, China, China, China, China Binhai Building data privacy protection department (closed)", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72788, "text": "Zip code: 518054", "label": ["Important", "Contact Information"], "rewrite": "Zip code: 518054"}
{"task": "rw_108.jsonl", "id": 72789, "text": "We will review the issues involved as soon as possible and give feedback within the period of 15 working days or laws and regulations.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_108.jsonl", "id": 72790, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
