{"task": "rw_119.jsonl", "id": 75182, "text": "Personal information and privacy protection policies for stacking paper games", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75183, "text": "Updated date: November 26, 2021", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75184, "text": "Effective date: November 26, 2021", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75185, "text": "\"Personal Information and Privacy Protection Policy\" (hereinafter referred to as \"Privacy Policy\") by you (also known as \"user\") and [Wuhu Diery Paper Network Technology Co., Ltd.]Paper games \",\" stacking paper \"or\" us \", our registered address is: [Room 803, 803, Cultural Creative Comprehensive Building 803, Cultural and Creative Building, No. 77, Kujiang North Road, Kujiang District, Wuhu City, Anhui Province] CommonConcluded, this \"Privacy Policy\" has a contract effect.", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75186, "text": "You are welcome to use the services provided by stacked paper games, including your interaction behavior with stacked paper games and products or services that you register and use stacking games (hereinafter collectively referred to as \"service\").", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75187, "text": "Paper game attaches great importance to the personal information and privacy protection of users. This \"Privacy Policy\" has been formulated to you that when you use our products or services, how can we collect, use, store and share, and transfer these information.And the way we provide access, update, control and protect these information.", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75188, "text": "We recommend that you read this \"Privacy Policy\" carefully, especially the clauses that are marked with rough characters, and make a proper choice in accordance with the guidance of this \"Privacy Policy\".", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75189, "text": "If you do not agree with any content of this \"Privacy Policy\", we will not be able to provide you with services or to achieve the service effect we are going to achieve.", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75190, "text": "We need to remind you in particular: Because there are many types of game products and services, the contents of the services you provide are different, so core business functions (including the types of your personal information) will also be different.The actual product or service is prevailing.", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75191, "text": "You understand and agree that we want to provide you with a perfect product or service, so we may revise this \"Privacy Policy\" from the situation of relevant laws and regulations or business adjustments from time to time. When the terms of this \"Privacy Policy\" occurAt the time of changes, we will prompt you to prompt you to remind you of the content of the change through the page prompts, pop -ups, announcements, etc. After the version is updated.", "label": ["Policy Change", "Important"], "rewrite": "After the version is updated, we will prompt the content of the terms of the \"Privacy Policy\" through page prompts, pop -ups, announcements, etc."}
{"task": "rw_119.jsonl", "id": 75192, "text": "If you use or continue to use our products or services, that is, you agree that we will process your relevant information in accordance with the \"Privacy Policy\" after this or updated.", "label": ["Policy Change", "Important", "Risk"], "rewrite": "Continue to use services is deemed to agree to accept the content of the privacy policy after the revision."}
{"task": "rw_119.jsonl", "id": 75193, "text": "After reading the \"Privacy Policy\", if you have any questions about this \"Privacy Policy\" or related matters, you can contact us through the channel listed in the chapter of \"Confucian Policy\" in this \"Privacy Policy\".You make a answer.", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75194, "text": "This \"Privacy Policy\" will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75195, "text": "1. How do we collect and use your information", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75196, "text": "2. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75197, "text": "3. How can we entrust your personal information to deal with, share, transfer, and disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75198, "text": "4. How do we store and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75199, "text": "5. The right to manage personal information", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75200, "text": "6. Protection of Minors' Information", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75201, "text": "Seven, policy changes", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75202, "text": "Eight, others", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75203, "text": "Nine, contact us", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75204, "text": "1. How do we collect and use your information", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75205, "text": "In accordance with the requirements of relevant laws and regulations or the needs of specific functions and services, we will collect, store and use the following information related to you when providing products or services.", "label": ["Important", "First Party Collection Information"], "rewrite": "When providing products or services, it will collect, store and use information related to you"}
{"task": "rw_119.jsonl", "id": 75206, "text": "The collection, storage and use of information in the following information are to provide or optimize related products, services or good experiences to us, and ensure that your account security needs.", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75207, "text": "You understand and agree: Some single services may require you to turn on specific access permissions in your device to achieve the collection and use of information involved in these permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "Some single services may obtain specific access rights"}
{"task": "rw_119.jsonl", "id": 75208, "text": "You understand and agree: If you do not provide relevant information, you may not be able to register as our users or enjoy certain products / services we provide, or it cannot achieve the effect of using related services.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you do not provide relevant information, you may not be registered as a user or you cannot enjoy certain products / services, or you cannot achieve the effect of being intended"}
{"task": "rw_119.jsonl", "id": 75209, "text": "If we use your information below, we will explain to you again and obtain your consent.", "label": ["Important", "First Party Collection Information"], "rewrite": "Using information beyond use, it will once again explain and obtain consent"}
{"task": "rw_119.jsonl", "id": 75210, "text": "1. The information you provide", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75211, "text": "(1) When you register, log in, and identity authentication, you provide us with your real name, ID information, and basic registration or login information (including mobile phone numbers, email address), and create your account, user name and passwordAccording to relevant laws and regulations and regulatory requirements, the real names, ID information and mobile phone numbers you provide will be used for real -name authentication.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect real name, ID information and mobile phone numbers for real -name authentication"}
{"task": "rw_119.jsonl", "id": 75212, "text": "We may collect your network identity information (including system account number, password, IP address, personal digital certificate) and personal common equipment information (including hardware serial number, hardware model, device name, device MAC address, operating system type, operation System version, software list, unique device identification code of the device, network status, operator) are used to mark you as a user of the stack game.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect network identity identification information, personal commonly used equipment information is used to mark users who are stacking paper games"}
{"task": "rw_119.jsonl", "id": 75213, "text": "If you use a third -party account to associate login paper game, we may collect the unique logo, account name, and personal avatar of your related account. Friends relationship is used to save your login information so that you can log in at different devices.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When logging in with a third -party account number, the unique logo, account name, and personal avatar of the account are collected. Friends relationship is used to save login information"}
{"task": "rw_119.jsonl", "id": 75214, "text": "If you do not agree to authorize such information, you will not be able to log in to our product/service with an account on a third -party platform.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you do not authorize the third -party account information, you cannot use the account of the third -party platform to log in to the product/service"}
{"task": "rw_119.jsonl", "id": 75215, "text": "We need to remind you that you can only register as our user and obtain our services if you provide the above-mentioned real and accurate information. If you do not provide the above-mentioned information, you will not be able to log in or use all or some products or services.", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75216, "text": "(2) The information submitted during our customer service or participating in the activity/questionnaire survey we organized, that is, your name, gender, telephone, address, cultural level, occupation, personal income.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the information submitted by your customer service or participating in the event/questionnaire survey"}
{"task": "rw_119.jsonl", "id": 75217, "text": "You do not participate in the above -mentioned activities/questionnaire surveys or do not provide the above information to customer service, which will not affect your other services.", "label": ["Important", "First Party Collection Information"], "rewrite": "You do not participate in the above -mentioned activities/questionnaire surveys or do not provide the above information to customer service, which will not affect your other services."}
{"task": "rw_119.jsonl", "id": 75218, "text": "(3) The shared information provided by our products or services to other parties, and the information stored when you use our products or services.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the shared information provided by the other party through the product or service, and the information stored when you use it"}
{"task": "rw_119.jsonl", "id": 75219, "text": "2. Your information shared by other parties", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75220, "text": "(1) Other parties provide your sharing information when using our products or services.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting other parties when using products or services provided on your sharing information"}
{"task": "rw_119.jsonl", "id": 75221, "text": "(2) We may obtain information generated or shared when you use the products or services of third-party partners.", "label": ["Important", "First Party Collection Information"], "rewrite": "The information generated or shared when you use the product or service you use a third -party partner when you use a third -party partner"}
{"task": "rw_119.jsonl", "id": 75222, "text": "Please read the user agreement or privacy policy for third -party partners products or services.", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75223, "text": "3. Your information we get", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75224, "text": "When you use the products or services of stacking paper games, we may collect the following information based on the following ways:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75225, "text": "(1) In order to ensure your normal use of our service, maintain the normal operation of the basic functions of the game, optimize product performance, improve your game experience and ensure your account security, we may collect your device or software information, that isThe configuration information provided by mobile devices, web browsers, or other programs used to access our products or services, your IP address, model and operating system version of the mobile device, Shear information, battery, signal strength, network type, operator.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect equipment or software information to ensure normal service services, optimize products, and ensure security"}
{"task": "rw_119.jsonl", "id": 75226, "text": "(2) When you interact with other players in the game through text, pictures, voice, video and other means, we will collect and save the above information you send to filter pornography, violence, politics, abuse, malicious Inappropriate content such as advertisements, so as to purify the game environment and maintain a healthy online environment.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect and save interactive information to filter inappropriate content such as pornography, violence, politics, abuse, malicious advertisements, etc."}
{"task": "rw_119.jsonl", "id": 75227, "text": "Dating records so that you can view your game history records on the client, and at the same time used for game operation statistical analysis, customer service complaint processing, game anti -cheating analysis, and other game experience optimization analysis, and in order to improve your game experience, we may take your game experience.The aforementioned information is synchronized to the subsequent version of the game or the other products you are providing by us.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your game log information in order to view game historical records, statistical analysis of game operation, customer service complaint processing, game anti -cheating analysis, and synchronize the information to the subsequent version or other products"}
{"task": "rw_119.jsonl", "id": 75228, "text": "(4) When you use the consumption function of stacked paper games, we will collect your recharge records and consumer record information in order to check your transaction records while protecting your virtual items to the greatest extent.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect recharge records and consumer record information in order to query the transaction record"}
{"task": "rw_119.jsonl", "id": 75229, "text": "The recharge records and consumption records are sensitive information. Collecting the above information is necessary to achieve the consumption function of stacking paper games, otherwise the transaction will not be completed.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collecting recharge records and consumer record information is necessary to achieve the consumption function of stacking paper games"}
{"task": "rw_119.jsonl", "id": 75230, "text": "(5) In some services, in order to facilitate the delivery of goods or services to you, you need to provide the consignee's personal identity information, names, receipt addresses, postal codes, consignee, contact phone number, and payment status information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect the consignee's personal identity information, name, receipt address, postal code, consignor, contact number, payment status information for delivery of goods or services"}
{"task": "rw_119.jsonl", "id": 75231, "text": "In particular, in order to deliver the goods or services to you safely, smoothly, and accurately, we may share some of your information with third -party logistics/delivery parties in the delivery and delivery link.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Share some of your information with third -party logistics/delivery parties"}
{"task": "rw_119.jsonl", "id": 75232, "text": "If you do not provide such information, we will not be able to complete the relevant delivery service, but it will not affect other functions of your normally use paper game services.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you do not provide the information required for the receipt, we will not be able to complete the relevant delivery service, but it will not affect other functions"}
{"task": "rw_119.jsonl", "id": 75233, "text": "(6) If you want to interact with nearby gamers or use other related services and functions provided by location -based, after you have authorized consent, we will collect your geographical location information to find nearby gamers, with nearby ones nearby, and nearby ones.Players match, team, etc., or provide position -based related services.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your geographical location information to provide position -based related services"}
{"task": "rw_119.jsonl", "id": 75234, "text": "Geographical location information is a sensitive information. Refusing to provide this information will only cause you to be unable to use the relevant services or functions provided by the location, but it does not affect other functions of your normal use of paper games.", "label": ["Important", "First Party Collection Information"], "rewrite": "Refusing to provide geographical information can only cause the relevant services or functions that cannot be available for use."}
{"task": "rw_119.jsonl", "id": 75235, "text": "(7) When you contact us, we may collect your communication/call records and content or the contact information you left in order to contact you or help you solve the problem, or record the processing scheme and results of related issues related issues, results and results.Essence", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your communication/call records and content or contact information information in order"}
{"task": "rw_119.jsonl", "id": 75236, "text": "Recording the function of the video scene. After you authorize the consent, we will visit your microphone, camera, album, and albums. At the same time, we need to visit you to write external storage permissions to complete the storage and cache of the corresponding results.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "Access microphone, camera, album, write external storage permission to complete voice/video interaction, storage and cache of corresponding results"}
{"task": "rw_119.jsonl", "id": 75237, "text": "If you refuse to provide the aforementioned permissions and content, you will not be able to use these functions/participation in these activities, but it will not affect other services that you use with stacked paper games.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "Those who refuse the microphone, camera, photo album, and write external storage permission will not be able to use these functions/participate in such activities, but will not affect other services"}
{"task": "rw_119.jsonl", "id": 75238, "text": "At the same time, you can open/cancel the aforementioned permissions at the device system permissions management interface at any time.", "label": ["Important", "Edit/Control"], "rewrite": "Open/cancel the microphone, camera, album, write external storage permissions in the device system permissions management interface"}
{"task": "rw_119.jsonl", "id": 75239, "text": "Please note: You open the right of power means that you authorize us to collect and use relevant information to provide you with corresponding services. Once you turn off the right of power, it means that you cancel the authorization. We will no longer continue to collect and use based on the corresponding authority.Related information cannot provide you with the services corresponding to the permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "Opening one authority, which means authorized collection and use of relevant information to provide corresponding services, closing any authority representative cancels the authorization, and no longer continues to collect and use relevant information based on the corresponding permissions"}
{"task": "rw_119.jsonl", "id": 75240, "text": "However, your decision to close permissions will not affect the collection and use of information based on your authorization.", "label": ["Permission Acquisition", "Important"], "rewrite": "Closing authority will not affect the collection and use of information based on authorization before"}
{"task": "rw_119.jsonl", "id": 75241, "text": "(9) To ensure your game account security, create a fair, healthy and safe game environment, we will collect your game application information, device information (device ID, device sequence number, equipment manufacturer, equipment name, equipment type and equipment type and equipment type and equipment type and equipment type and equipment type and equipment type and equipment type and equipment type and equipment type and equipment type and equipment type and equipment types and equipment types.Version, device model, equipment style), network identity identification information, hardware and operating system information, process and game crash records, network types, operator information, to combat the behavior of damaging the fair environment or interference of the game(Such as it is used to detect piracy, scanned plug -in, and prevent cheating).", "label": ["Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "Collect game application information, equipment information, network identity identification information, hardware and operating system information, processes and game crash records, network types, operator information, to create a fair, healthy and safe gaming environment"}
{"task": "rw_119.jsonl", "id": 75242, "text": "When you use the products or services provided by stacking paper games, you will also use the third -party SDK that provides us with some other services.The push and SDK of the above -mentioned mobile phone manufacturers may need to collect information to achieve information push function.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Products or services involve third -party SDK, third -party SDK may need to collect information"}
{"task": "rw_119.jsonl", "id": 75243, "text": "In order to provide the above -mentioned service purposes, third -party SDK may collect your personal information, such as real names, ID information, network identity identification information (including system accounts, passwords, IP addresses, personal digital certificates) and commonly used equipment information (Including hardware serial numbers, hardware models, device MAC address, operating system type, operating system version, software list, device unique device identification code, network status, operator, etc.Terms or related statements, we recommend that you check its privacy clauses before using any third -party service.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Third -party SDK may collect your personal information, such as real names, ID information, network identity identification information and personal common equipment information"}
{"task": "rw_119.jsonl", "id": 75244, "text": "In order to protect your legitimate rights and interests, if you find a risk of related third -party services, it is recommended that you immediately terminate the relevant operations and contact us in time.", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75245, "text": "See [https://www.papegames.com/privacy_sdk.html]", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "See [https://www.papegames.com/privacy_sdk.html]"}
{"task": "rw_119.jsonl", "id": 75246, "text": "5. We may send information to you", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75247, "text": "(1) When you use our service, we may contact you or send emails, SMS, information or push notifications to you.", "label": ["Important", "Usage"], "rewrite": "We may contact you to contact you or send emails, SMS, information or push notifications"}
{"task": "rw_119.jsonl", "id": 75248, "text": "You can choose to cancel the subscription on the device according to our relevant tips.", "label": ["Important", "Edit/Control"], "rewrite": "You can choose to cancel the subscription on the device"}
{"task": "rw_119.jsonl", "id": 75249, "text": "(2) We may issue an announcement related to the service -related announcement when necessary (for example, when the system maintenance is suspended due to system maintenance).", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75250, "text": "You may not be able to cancel these announcements related to services and nature.", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75251, "text": "6. According to relevant laws and regulations and national standards, in the following circumstances, we may collect or use your relevant personal information without soliciting your authorization consent:", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In the following situations, we may collect and use your relevant personal information without asking for your authorization and consent:"}
{"task": "rw_119.jsonl", "id": 75252, "text": "(1) Directly related to national interests such as national security and national defense security;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "(1) Directly related to national interests such as national security and national defense security;"}
{"task": "rw_119.jsonl", "id": 75253, "text": "Directly related to the major public interests such as public safety, public health, and public knowledge;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Directly related to the major public interests such as public safety, public health, and public knowledge;"}
{"task": "rw_119.jsonl", "id": 75254, "text": "(2) Directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "(2) Directly related to criminal investigation, prosecution, trial, and execution of judgment"}
{"task": "rw_119.jsonl", "id": 75255, "text": "(3) For the maintenance of major legitimate rights and interests such as life, property, and reputation of your or other individuals, it is difficult to get my consent;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "(3) For the maintenance of major legitimate rights and interests such as life, property, and reputation of your or other individuals, it is difficult to get my consent;"}
{"task": "rw_119.jsonl", "id": 75256, "text": "(4) The personal information collected is publicly disclosed to the public by itself;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "(4) The personal information collected is publicly disclosed to the public by itself;"}
{"task": "rw_119.jsonl", "id": 75257, "text": "(5) Collect personal information from the information disclosed by legal and publicly disclosed, such as legal news reports, government information disclosure and other channels;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "(5) Collect personal information from the information disclosed by legal and publicly disclosed, such as legal news reports, government information disclosure and other channels;"}
{"task": "rw_119.jsonl", "id": 75258, "text": "(6) Signing and fulfilling the contract according to your requirements;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "(6) Signing and fulfilling the contract according to your requirements;"}
{"task": "rw_119.jsonl", "id": 75259, "text": "(7) The necessary and stable operation of the products or services provided by the maintenance of the products provided, such as the failure of discovering and disposing of products or services;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "(7) The necessary and stable operation of the products or services provided by the maintenance of the products provided, such as the failure of discovering and disposing of products or services;"}
{"task": "rw_119.jsonl", "id": 75260, "text": "(8) It is necessary to carry out legal news reports;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "(8) It is necessary to carry out legal news reports;"}
{"task": "rw_119.jsonl", "id": 75261, "text": "(9) When the statistical or academic research institute is needed for public interest, and the results of academic research or descriptions are provided, the personal information contained in the results is identified;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "(9) When the statistical or academic research institute is needed for public interest, and the results of academic research or descriptions are provided, the personal information contained in the results is identified;"}
{"task": "rw_119.jsonl", "id": 75262, "text": "(10) Other circumstances stipulated in laws and regulations.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "(10) Other circumstances stipulated in laws and regulations."}
{"task": "rw_119.jsonl", "id": 75263, "text": "7. Reminder about your public and sharing information", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75264, "text": "Our multiple services allow you to publicize/share your relevant information with all users using the service, for example, the information you uploaded or published in our service (including your publicPersonal information, the list you created), the response made by the information you uploaded or published by others, and the location data and log information related to this information (suchOther users may also share information related to you (including location data and log information).", "label": ["Third Party Sharing/ Disclosure", "Important", "Edit/Control"], "rewrite": "You can open/share your relevant information with your online game and all users who use the service. Other users who use the service may also share the information related to you"}
{"task": "rw_119.jsonl", "id": 75265, "text": "In particular, our social media services are designed to enable you to share information with users around the world, and you can make the shared information real-time and widely transmitted.", "label": ["Third Party Sharing/ Disclosure", "Important", "Edit/Control"], "rewrite": "Social media services are designed for users to share information"}
{"task": "rw_119.jsonl", "id": 75266, "text": "As long as you do not delete the shared information, the relevant information will always leave the public domain;", "label": ["Important", "Edit/Control"], "rewrite": "As long as the shared information is not deleted, the relevant information will always stay in the public domain;"}
{"task": "rw_119.jsonl", "id": 75267, "text": "Even if you delete sharing information, the information may still be cached, replicated, or stored by other users or third parties that are not controlled by us, or is preserved by other users or such third parties in the public domain.", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "After deleting the information you shared, it may still be stored independently by other users or the third parties that are not controlled by us"}
{"task": "rw_119.jsonl", "id": 75268, "text": "Therefore, please consider the information content of disclosure, uploading, publishing and communicating through our services.", "label": ["Important", "Edit/Control"], "rewrite": "Care carefully!Whether to share or even share relevant information"}
{"task": "rw_119.jsonl", "id": 75269, "text": "In some cases, you can control the privacy settings of some of our services to control the scope of user scope of your shared information.", "label": ["Important", "Edit/Control"], "rewrite": "You can control the privacy settings of certain services to control the scope of the user with information that you share information"}
{"task": "rw_119.jsonl", "id": 75270, "text": "If you want to delete your relevant information from our service, please confirm the operation by contacting us, and any delete information operation needs to verify your identity.", "label": ["Important", "Edit/Control"], "rewrite": "Contact us to delete your relevant information from the service, and the information operation requires identity verification"}
{"task": "rw_119.jsonl", "id": 75271, "text": "2. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75272, "text": "We or our third -party partners may collect and use your information through cookies and web, beacon, etc., and store these information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect and use and store information through Cookies and Web Beacon and other similar technologies"}
{"task": "rw_119.jsonl", "id": 75273, "text": "We use our own cookies and Web Beacon.", "label": ["Usage"], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75274, "text": "1. Remember your identity.", "label": ["Usage"], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75275, "text": "For example, Cookies and Web, Beacon helps us recognize your identity as our registered user, or save other information about your information provided to us.", "label": ["Important", "Usage"], "rewrite": "Cookies and Web Beacon help recognize your identity, or save the information you provided"}
{"task": "rw_119.jsonl", "id": 75276, "text": "2. Analyze your use of our products or services.", "label": ["Usage"], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75277, "text": "We can use cookies and webs, beacon to learn what activities you use our services.", "label": ["Important", "Usage"], "rewrite": "Use Cookies and Web Beacon to learn about your activities when using your service"}
{"task": "rw_119.jsonl", "id": 75278, "text": "3. Our products and services may have similar technologies such as Cookies and Web Beacon placed by our third -party partners.", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75279, "text": "These cookies and webs, beacon, etc. may collect non -personal identity information related to you to analyze the effects of how users use such services or evaluate advertising services.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Similar technologies such as Cookies and Web Beacon in third -party may collect non -personal identity information to analyze and evaluate"}
{"task": "rw_119.jsonl", "id": 75280, "text": "We will strictly require third -party partners to abide by the relevant provisions of this policy.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75281, "text": "You can set up refusal or management of Cookies or Web, Beacon, etc. through your browser settings.", "label": ["Important", "Edit/Control"], "rewrite": "You can set up rejection or management of cookies or web beacon through browser settings"}
{"task": "rw_119.jsonl", "id": 75282, "text": "But please note that if you stop using cookies or web, beacon, etc., you may not be able to enjoy the corresponding service experience, and certain services may not be used normally.", "label": ["Edit/Control", "Important"], "rewrite": "Similar technologies such as Cookies or Web Beacon may cause you to be unable to enjoy the corresponding service experience"}
{"task": "rw_119.jsonl", "id": 75283, "text": "3. How can we share, transfer, and disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75284, "text": "1. Share.", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75285, "text": "Except for the following situations, without your consent, we and our affiliate will not share your personal information with any third party:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Except for the following circumstances, without your consent, we and our affiliated companies will not share your personal information with any third party: (1) to provide you with our products or services; (2) \"how do we collect and useThe purpose described in the part of your information; (3) fulfill our obligations and exercise of our rights in this \"Privacy Policy\" or other agreements reached by you; (4) understanding, maintaining and improving our productsOr service; (5) provided based on the legitimate requirements of your or your guardian; (6) provided in accordance with the provisions of laws and regulations or the requirements of the competent authority;"}
{"task": "rw_119.jsonl", "id": 75286, "text": "(1) To provide you with our products or services;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75287, "text": "(2) Realize the purpose of the \"how do we collect and use your information\" part;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75288, "text": "(3) Perform our obligations and exercise of our rights in this \"Privacy Policy\" or other agreements reached by you;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75289, "text": "(4) Understand, maintain and improve our products or services;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75290, "text": "(5) Provided based on the legal requirements of your or your guardian;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75291, "text": "(6) Provide in accordance with the provisions of laws and regulations or the requirements of the competent department;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75292, "text": "In particular, we will only share your information for legal, correct, necessary, specific, and clear purposes.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only share your information for legal, correct, necessary, specific, and clear purposes."}
{"task": "rw_119.jsonl", "id": 75293, "text": "If we or our affiliates share your personal information with any of the above -mentioned third parties, we will strive to ensure that these third parties comply with the \"Privacy Policy\" and other appropriate confidentiality and security we ask them to followMeasures, otherwise we will ask these third parties to re -solicit authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We strive to ensure that third -party uses your information to comply with this \"Privacy Policy\" and take appropriate security and confidential measures, otherwise we will re -solicit consent"}
{"task": "rw_119.jsonl", "id": 75294, "text": "2. Transfer.", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75295, "text": "We will only transfer your personal information in the following situation:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only transfer your personal information in the following situation: (1) After obtaining a clear consent; (2) transfer in accordance with the provisions of laws and regulations or the requirements of the competent authority;A similar transaction is transferred."}
{"task": "rw_119.jsonl", "id": 75296, "text": "(1) After getting your clear consent;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75297, "text": "(2) Transfer in accordance with the provisions of laws and regulations or the requirements of the competent department;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75298, "text": "(3) With the continuous development of our business, we and our affiliated companies are likely to conduct mergers, acquisitions, asset transfer or similar transactions. Your personal information may be transferred as part of such transactions.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Your personal information may be transferred as part of mergers, acquisitions, asset transfer or similar transactions."}
{"task": "rw_119.jsonl", "id": 75299, "text": "We will inform you the relevant situations by pushing notifications and announcements, and continue to protect or request new managers to continue to protect your personal information in accordance with laws and regulations and the standards that are not lower than this policy.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75300, "text": "3. show.", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75301, "text": "We will only disclose your personal information in the following situation:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only disclose your personal information in the following situation: (1) After obtaining your clear consent; (2) disclose publicly in accordance with the provisions of laws and regulations or the requirements of the competent department;"}
{"task": "rw_119.jsonl", "id": 75302, "text": "(1) After getting your clear consent;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75303, "text": "(2) Public disclosure in accordance with the provisions of laws and regulations or the requirements of the competent department;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75304, "text": "4. No need to get the situation you agree in advance", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75305, "text": "According to relevant laws and regulations and national standards, in the following circumstances, we may share, transfer, and openly disclose your personal information in accordance with the law without obtaining your consent:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "According to relevant laws and regulations and national standards, in the following circumstances, we may share, transfer, and publicly disclose your personal information in accordance with the law without obtaining your consent: (1) directly related to national security and national defense security; (2)Directly related to public safety, public health, and major public interests; (3) directly related to criminal investigation, prosecution, trial and judgment implementation;But it is difficult to get your consent; (5) personal information you disclosed to the public by yourself; (6) personal information collected from the information disclosed by legal publicly, such as legal news reports, government information disclosure and other channelsEssence"}
{"task": "rw_119.jsonl", "id": 75306, "text": "(1) Directly related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75307, "text": "(2) Directly related to public safety, public health, and major public interests;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75308, "text": "(3) Directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75309, "text": "(4) Out of maintaining major legitimate rights and interests such as life and property of you or other individuals, it is difficult to get your consent;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75310, "text": "(5) Personal information that you disclose to the public by yourself;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75311, "text": "(6) Personal information collected from legal publicly disclosed information, such as legal news reports, government information disclosure and other channels.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75312, "text": "You know and agree: We will use the collected information to identify it for big data analysis.", "label": ["Important", "Usage"], "rewrite": "We will use the collected information to identify it for big data analysis"}
{"task": "rw_119.jsonl", "id": 75313, "text": "We may disclose and share information with our partners with information that does not include identity recognition content after statistical processing. It is used to understand how users use our products or services or let the public understand the overall use trend of our products or services.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We may disclose and share information that does not include identification content after statistics after statistics."}
{"task": "rw_119.jsonl", "id": 75314, "text": "In accordance with the relevant laws and regulations, sharing and transferred information that has been identified by the identification processing, and ensure that the data receiver cannot restore and re -identify the subject of the information, which does not belong to the information sharing, transfer, and public disclosure of information.Save and processing will not be notified to you separately and obtain your consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Personal information that shared and transferred to the identification processing does not need to notify you separately and obtain your consent."}
{"task": "rw_119.jsonl", "id": 75315, "text": "4. How do we store and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75316, "text": "1. We comply with the provisions of laws and regulations to store personal information collected in the country to the country.", "label": ["Data Retention", "Important"], "rewrite": "Personal information collected in the country is stored in the country."}
{"task": "rw_119.jsonl", "id": 75317, "text": "We only retain your personal information in the shortest time and time limit required by the \"Privacy Policy\".", "label": ["Data Retention", "Important"], "rewrite": "Reserved personal information only in the shortest time and time limit required by the \"Privacy Policy\" and the time limit required by laws and regulations"}
{"task": "rw_119.jsonl", "id": 75318, "text": "But in the following circumstances, we may change the storage time of personal information when they meet the requirements of legal requirements:", "label": ["Data Retention", "Important"], "rewrite": "In the following circumstances, we may change the storage time of personal information: (1) to abide by the applicable laws and regulations; (2) the provisions of the court's order or other legal procedures; (3) comply with the requirements of relevant government agencies; (4)In order to safeguard the public interests of the society, or to protect our customers, our or our group companies, other users or employees' personal and property security or legitimate rights and interests."}
{"task": "rw_119.jsonl", "id": 75319, "text": "(1) Comply with applicable laws and regulations;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75320, "text": "(2) Comply with the provisions of the court's order or other legal procedures;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75321, "text": "(3) Comply with the requirements of relevant government agencies;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75322, "text": "(4) In order to protect the public interests of the society, or protect the personal and property security or legitimate rights and interests of our customers, our or our group companies, other users or employees.", "label": ["Data Retention", "Risk"], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75323, "text": "2. We will take reasonable and necessary security protection measures in accordance with the mature safety standards of the industry to reduce the risk of information loss, improper use, unauthorized reading or disclosure.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75324, "text": "For example, in certain products or services, we will use encryption technology (such as SSL) to protect your personal information.", "label": ["Important", "Data Security"], "rewrite": "Use encryption technology (such as SSL) to protect personal information"}
{"task": "rw_119.jsonl", "id": 75325, "text": "But please understand that due to the technical restrictions and various malicious means, even if we have tried to strengthen security measures, we cannot always ensure that the information is 100 % security.", "label": ["Important", "Data Security"], "rewrite": "Try to strengthen security measures, but it cannot be fully guaranteed that there is no security problem."}
{"task": "rw_119.jsonl", "id": 75326, "text": "You need to understand that the systems and communication networks you use to access our services may be due to factors outside of our controllable scope.", "label": ["Important", "Data Security"], "rewrite": "The system and communication network used in access services may have problems due to factors outside of our controllable range"}
{"task": "rw_119.jsonl", "id": 75327, "text": "3. On the occasion where personal information security incidents occur, we will inform you in a timely manner in accordance with the requirements of laws and regulations: the basic situation and possible impact of security incidents, the disposal measures we have taken or we will take, you can take it alone and you can take it autonomously and to prevent and prevent and prevent it.Suggestions for reducing risk, remedial measures, etc.", "label": ["Important", "Data Security"], "rewrite": "Inform you the basic situation and possible impact of the safety incident in time, the disposal measures that have been taken or will take, suggestions that can prevent and reduce risks, and remedy measures"}
{"task": "rw_119.jsonl", "id": 75328, "text": "We will promptly inform you that the incident -related situation is informing the email, letter, telephone, push notification, etc. When it is difficult to inform the subject of personal information one by one, we will publish an announcement in a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "It is difficult to inform personal information by mail, letter, telephone, and push notification one by one, and will publish an announcement in a reasonable and effective way"}
{"task": "rw_119.jsonl", "id": 75329, "text": "At the same time, we will also actively report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "In accordance with the requirements of the regulatory authorities, actively report to the disposal of personal information security incidents"}
{"task": "rw_119.jsonl", "id": 75330, "text": "5. The right to manage personal information", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75331, "text": "We understand your concern about personal information, and we will do our best to ensure your rights to access, correct, delete and withdraw authorization of your personal information, so that you have sufficient ability to protect your privacy and security.", "label": ["Important", "Edit/Control"], "rewrite": "You have the right to access, correct, delete, and withdraw authorization of your personal information"}
{"task": "rw_119.jsonl", "id": 75332, "text": "Your rights include:", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75333, "text": "1., you have the right to access your personal information", "label": ["Important", "Edit/Control"], "rewrite": "You have the right to visit your personal information"}
{"task": "rw_119.jsonl", "id": 75334, "text": "You can check in accordance with the relevant instructions (or settings) of the products and services we provide to check the relevant personal information you have provided to us.", "label": ["Edit/Control", "Important"], "rewrite": "You can check the relevant personal information you provided in accordance with the instructions of the product and service"}
{"task": "rw_119.jsonl", "id": 75335, "text": "Including: avatar, nickname, player number, basic information of the alliance, personality signatures, rankings, etc., if you have), if you encounter problems in the interview, you need to get other personal information content that you cannot know.Contact us in the way you provide.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75336, "text": "2., you have the right to correct/modify your personal information", "label": ["Important", "Edit/Control"], "rewrite": "You have the right to correct/modify your personal information"}
{"task": "rw_119.jsonl", "id": 75337, "text": "When you find that the personal information you provided to us is incorrectly registered, incomplete or updated, you can correct/modify your personal information in our products and/or services.", "label": ["Important", "Edit/Control"], "rewrite": "You can correct/modify your personal information in products and/or services"}
{"task": "rw_119.jsonl", "id": 75338, "text": "(1) For some of your personal information, we provide you with an operation settings on the related functional page of the product. You can directly correct/modify, such as: \"avatar/nickname/personality signature\" in the game client/Modify the path: click the avatar-click Edit button/I want to modify the corresponding area.", "label": ["Edit/Control", "Important"], "rewrite": "On the related functional page of the product, it provides you with some personal information operation settings"}
{"task": "rw_119.jsonl", "id": 75339, "text": "(2) For the difficulties you encountered in the process of exercising the above rights, or other people who may not be able to provide you with online correction/modification services at present, after verification of your identity, correction/modification does not affect the objectiveness and the objectiveness of the informationIn the case of accuracy, you have the right to correct or modify the error or incomplete information, or in specific cases, especially when the data error is wrong, you can correct you through the feedback/error/contact customer service and other measures./Modify the application submitted to us, asking us to correct or modify your data, except for other provisions of laws and regulations.", "label": ["Important", "Edit/Control"], "rewrite": "You can submit your correction/modification application to us through our published feedback/error report/contact customer service and other measures, and ask us to correct or modify your data"}
{"task": "rw_119.jsonl", "id": 75340, "text": "But for the consideration of security and identification, you may not be able to modify some initial registration information submitted during registration.", "label": ["Edit/Control", "Important"], "rewrite": "Some initial registration information submitted during registration may not be modified"}
{"task": "rw_119.jsonl", "id": 75341, "text": "3., you have the right to delete your personal information", "label": ["Important", "Edit/Control"], "rewrite": "You have the right to delete your personal information"}
{"task": "rw_119.jsonl", "id": 75342, "text": "When the following situations occur, you can directly ask us to delete your personal information, but except for anonymous treatment or other regulations: except:", "label": ["Edit/Control", "Important"], "rewrite": "When the following situations occur, you can directly ask us to delete your personal information, but except for anonymous treatment or other provisions: (1) When our handling of personal information violates laws and regulations; (2)When we collect and use your personal information, but not obtained your consent; (3) When our behavior of handling personal information is violated with your agreement; (4) When you cancel the game account; (5) When we terminate our services and operations."}
{"task": "rw_119.jsonl", "id": 75343, "text": "(1) When our behavior of handling personal information violates laws and regulations;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75344, "text": "(2) When we collect and use your personal information, but not obtained your consent;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75345, "text": "(3) When our behavior of handling personal information is violated with your agreed;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75346, "text": "(4) When you cancel the game account;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75347, "text": "(5) When we terminate our services and operations.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75348, "text": "If we decide to respond to your deletion request, we will also also notify the entities that obtain your personal information from our personal information and ask them to delete them in time, unless laws and regulations have other regulations, or these entities have obtained your independent authorization.", "label": ["Important", "Edit/Control"], "rewrite": "When deleting, you will also notify the entities that obtain your personal information at the same time, asking them to delete it in time"}
{"task": "rw_119.jsonl", "id": 75349, "text": "After you delete information from our service, we may not delete the corresponding information in the backup system immediately, but will delete the information when the backup is updated.", "label": ["Important", "Edit/Control"], "rewrite": "Delete the information you required to delete in the backup system when the backup update"}
{"task": "rw_119.jsonl", "id": 75350, "text": "4. You have the right to withdraw all or part of your personal information", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75351, "text": "As mentioned earlier, some of the functions and services we provide need to obtain the relevant authority of your equipment (including: camera, microphone, etc., which are subject to the first privacy policy).", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75352, "text": "You can continue to authorize the permissions at any time after authorization.", "label": ["Edit/Control", "Important"], "rewrite": "You can continue to authorize permissions at any time after authorization."}
{"task": "rw_119.jsonl", "id": 75353, "text": "After you update the APP version, without your clear consent, we will not change the authority you set before.", "label": ["Edit/Control", "Important"], "rewrite": "We will not change your authority status you set in the previous version without consent"}
{"task": "rw_119.jsonl", "id": 75354, "text": "You can also permanently withdraw all authorization for us to continue collecting your personal information by logging off your account.", "label": ["Edit/Control", "Important"], "rewrite": "By canceling the account of the account, you can permanently withdraw all authorization"}
{"task": "rw_119.jsonl", "id": 75355, "text": "You need to understand that when you withdraw authorization, we cannot continue to provide you with specific functions and/or services corresponding to the withdrawal authorization.", "label": ["Important", "Edit/Control"], "rewrite": "Unable to continue to provide you with the specific functions and/or services corresponding to the withdrawal of authorization"}
{"task": "rw_119.jsonl", "id": 75356, "text": "But your decision to withdraw authorization will not affect personal information processing based on your authorization.", "label": ["Important", "Edit/Control"], "rewrite": "The decision to withdraw authorization will not affect the personal information processing that previously developed based on authorization"}
{"task": "rw_119.jsonl", "id": 75357, "text": "5. You have the right to cancel your account", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75358, "text": "You can apply for a cancellation of your account through customer service or other publicity methods.", "label": ["Important", "Edit/Control"], "rewrite": "You can apply for a cancellation of your account through customer service or other publicity methods"}
{"task": "rw_119.jsonl", "id": 75359, "text": "When you log out the account, you will no longer log in and use our products and services with this account;", "label": ["Important", "Edit/Control"], "rewrite": "Can no longer log in and use our products and services with the cancellation account"}
{"task": "rw_119.jsonl", "id": 75360, "text": "And all the rights that have been generated during the use of all products and services of the stacking paper game will be cleared by all rights and interests that have not been consumed and the future overdue interests;", "label": ["Important", "Edit/Control"], "rewrite": "All rights and interests that have been generated but not consumed and all overdue interests in the future will be cleared after the account is canceled"}
{"task": "rw_119.jsonl", "id": 75361, "text": "The content, information, data, records, etc. under this account will be deleted or anonymous (but the laws and regulations have other regulations or other requirements, such as the \"Cyber Security Law of the People's Republic of China\", youThe network operation log will be kept at least six months);", "label": ["Data Retention", "Important", "Edit/Control"], "rewrite": "The content, information, data, records, etc. under the cancellation account will be deleted or anonymous"}
{"task": "rw_119.jsonl", "id": 75362, "text": "After the cancellation of the game account is completed, it will not be recovered.", "label": ["Important", "Edit/Control"], "rewrite": "After the cancellation of the game account is completed, it will not be recovered."}
{"task": "rw_119.jsonl", "id": 75363, "text": "More about the procedures, conditions and other matters about the cancellation of paper game accounts can be contacted to our customer service.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75364, "text": "6. You have the right to get your personal information copy", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75365, "text": "You have the right to get your personal information copy, you can contact us at any time through the way of privacy policy, we will reply to your request within 15 working days.", "label": ["Important", "Edit/Control"], "rewrite": "Have the right to obtain your personal information copy"}
{"task": "rw_119.jsonl", "id": 75366, "text": "7. Automatic decision -making information system automatic decision", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75367, "text": "In certain business functions, we may make decisions only based on the non -artificial automatic decision -making mechanism, including information systems, algorithms, etc.", "label": ["Important", "Usage"], "rewrite": "Some business functions may make decisions based on non -artificial automatic decision -making mechanisms"}
{"task": "rw_119.jsonl", "id": 75368, "text": "If these decisions significantly affect your legitimate rights and interests, you have the right to ask us to explain, and we will also provide appropriate relief methods.", "label": ["Important", "Edit/Control"], "rewrite": "If the manual automatic decision -making significantly affects your legitimate rights and interests, we will explain and provide relief"}
{"task": "rw_119.jsonl", "id": 75369, "text": "8. How can we respond to your above right request", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75370, "text": "We will reply to you within 15 working days after receiving your request and verifying your user identity.", "label": ["Edit/Control", "Important"], "rewrite": "A response to 15 working days"}
{"task": "rw_119.jsonl", "id": 75371, "text": "If you have any questions when dealing with your personal information, you can communicate with us through the contact information of \"Contact Us\" through Article 9 of the Privacy Policy.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75372, "text": "In the following circumstances, we will not be able to respond to your request:", "label": ["Important", "Edit/Control"], "rewrite": "In the following circumstances, we will not be able to respond to your request:"}
{"task": "rw_119.jsonl", "id": 75373, "text": "(1) What is related to the obligations stipulated in the performance of personal information controller;", "label": ["Important", "Edit/Control"], "rewrite": "(1) What is related to the obligations stipulated in the performance of personal information controller;"}
{"task": "rw_119.jsonl", "id": 75374, "text": "(2) Directly related to national security and national defense security;", "label": ["Important", "Edit/Control"], "rewrite": "(2) Directly related to national security and national defense security;"}
{"task": "rw_119.jsonl", "id": 75375, "text": "(3) Directly related to public safety, public health, and major public interests;", "label": ["Important", "Edit/Control"], "rewrite": "(3) Directly related to public safety, public health, and major public interests;"}
{"task": "rw_119.jsonl", "id": 75376, "text": "(4) Directly related to criminal investigation, prosecution, trial, and execution judgment;", "label": ["Important", "Edit/Control"], "rewrite": "(4) Directly related to criminal investigation, prosecution, trial, and execution judgment;"}
{"task": "rw_119.jsonl", "id": 75377, "text": "(5) Personal information controller has sufficient evidence to indicate that the subject of personal information has subjective malicious or abuse of rights;", "label": ["Important", "Edit/Control"], "rewrite": "(5) Personal information controller has sufficient evidence to indicate that the subject of personal information has subjective malicious or abuse of rights;"}
{"task": "rw_119.jsonl", "id": 75378, "text": "(6) For major legitimate rights and interests such as the life and property of the subject or other individuals, it is difficult to get my consent;", "label": ["Important", "Edit/Control"], "rewrite": "(6) For major legitimate rights and interests such as the life and property of the subject or other individuals, it is difficult to get my consent;"}
{"task": "rw_119.jsonl", "id": 75379, "text": "(7) In response to the request of the subject of personal information, the legitimate rights and interests of the personal information subject or other individuals and organizations will be severely damaged;", "label": ["Important", "Edit/Control"], "rewrite": "(7) In response to the request of the subject of personal information, the legitimate rights and interests of the personal information subject or other individuals and organizations will be severely damaged;"}
{"task": "rw_119.jsonl", "id": 75380, "text": "(8) Involved in business secrets.", "label": ["Important", "Edit/Control"], "rewrite": "(8) Involved in business secrets."}
{"task": "rw_119.jsonl", "id": 75381, "text": "6. Protection of Minors' Information", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75382, "text": "Any minor participation in online activities shall obtain the consent of the parents or its legal guardians (hereinafter referred to as the \"guardian\") in advance.", "label": ["Specific Audiences", "Important"], "rewrite": "Any minor participation in online activities shall obtain the consent of the parents or its legal guardians (hereinafter referred to as the \"guardian\") in advance."}
{"task": "rw_119.jsonl", "id": 75383, "text": "Paper games will protect the relevant information of minors in accordance with the provisions of relevant national laws and regulations.", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75384, "text": "The guardians should guide minors under the age of 18 to use our services.", "label": ["Specific Audiences", "Important"], "rewrite": "The guardians should guide minors under the age of 18 to use our services."}
{"task": "rw_119.jsonl", "id": 75385, "text": "We recommend minors to encourage their guardians to read the \"Privacy Policy\" and recommend that minors seek the consent and guidance of the guardian before submitting personal information.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75386, "text": "If you are a child under the age of 14, please notify your guardian to read this policy and our \"Child Privacy Protection Rules\" together, and seek the consent and guidance of the guardian before using our service and submit personal information to seeks personal informationEssence", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a child under the age of 14, please notify your guardian to read this policy and our \"Child Privacy Protection Rules\" together, and seek the consent and guidance of the guardian before using our service and submit personal information to seeks personal informationEssence"}
{"task": "rw_119.jsonl", "id": 75387, "text": "For the acquisition of your information by the consent of the guardian, we will only use or disclose this information if they are allowed to be allowed, the guardian to clearly agree with or protect your rights and interests.", "label": ["Specific Audiences", "Important"], "rewrite": "Use or disclose information only when it is permitted by law, the guardian clearly agrees or protects the rights of minors"}
{"task": "rw_119.jsonl", "id": 75388, "text": "If your guardian does not agree that you use our services or provide information to us in accordance with this policy or \"Child Privacy Protection Rules\". Please immediately terminate our services and inform us in time so that we can take corresponding measures.", "label": ["Specific Audiences", "Important"], "rewrite": "Minors under the age of 18 should use our services or provide information to us under the premise of obtaining the consent of the guardian."}
{"task": "rw_119.jsonl", "id": 75389, "text": "If you are a child's guardian, you should carefully read this policy and our \"Child Privacy Protection Rules\" before helping children complete the registration and service of products or services.\"And help children register and use so that children can use the products or services we provide.", "label": ["Policy Change", "Specific Audiences", "Important"], "rewrite": "The guardian should read and use the policy or service after careful reading and agreeing to the policy."}
{"task": "rw_119.jsonl", "id": 75390, "text": "7. Amendment to \"Privacy Policy\"", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75391, "text": "We may amend the terms of this \"Privacy Policy\" in a timely manner, and these amendments constitute a part of the \"Privacy Policy\".", "label": ["Policy Change", "Important"], "rewrite": "The amendment of the \"Privacy Policy\" clause constituge the cost of the \"Privacy Policy\""}
{"task": "rw_119.jsonl", "id": 75392, "text": "If such revisions have reduced the substantial reduction of rights under this \"Privacy Policy\", we will prompt a prominent position on the homepage or send an email to you or notify you in other ways before revising.", "label": ["Policy Change", "Important"], "rewrite": "For example"}
{"task": "rw_119.jsonl", "id": 75393, "text": "In this case, if you continue to use our services, it is the constraint of the \"Privacy Policy\" agreed to be revised.", "label": ["Policy Change", "Important", "Risk"], "rewrite": "Continue to use services is deemed to agree to accept the content of the privacy policy after the revision."}
{"task": "rw_119.jsonl", "id": 75394, "text": "Eight, others", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75395, "text": "1. Except for certain explicit services, all our services are applicable to this \"Privacy Policy\".", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75396, "text": "These specific services will apply specific personal information protection statements or rules.", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75397, "text": "For specific personal information protection declarations or rules for certain services, we will more specifically explain how we use your information in these services.", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75398, "text": "The personal information protection statement or rule of this specific service constitutes part of the \"Privacy Policy\".", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75399, "text": "If the personal information protection statement or rules of related specific services are inconsistent with this \"Privacy Policy\", the personal information protection statement or rule for the specific service is applicable.", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75400, "text": "2. In addition to this \"Privacy Policy\", the words used in the \"Privacy Terms\" will have the same meaning as the words defined by other public clauses formulated by the stacked paper game.", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75401, "text": "3. The title of this \"Privacy Policy\" is only for convenience and reading, and does not affect the meaning or explanation of any provisions of the text.", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75402, "text": "4. The establishment, performance, interpretation, and disputes of this \"Privacy Policy\" are applicable to the laws of the People's Republic of China (excluding conflict law specifications). This agreement is set in Yangpu District, Shanghai.", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75403, "text": "If any disputes occurred in the content and implementation of this \"Privacy Policy\", the parties of the dispute should be friendly and negotiated. If the negotiation cannot be, the parties to the dispute are agreed to be submitted to the Shanghai Yangpu District People's Court to jurisdiction and handling it.", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75404, "text": "Nine, contact us", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75405, "text": "1. If you have any questions related to privacy protection related to privacy protection when you use our service or use our service or ask for inquiries or complaints or reports, you can get in contact with us in any way:", "label": ["Important", "Contact Information"], "rewrite": "In the following ways, contact us:"}
{"task": "rw_119.jsonl", "id": 75406, "text": "(1), contact the mailbox: dzkf@papegames.net", "label": ["Important", "Contact Information"], "rewrite": "Contact email: dzkf@papegames.net"}
{"task": "rw_119.jsonl", "id": 75407, "text": "(2) Contact address: Building B, Chuangzhi International Plaza, No. 38 Zhenggao Road, Xinjiang Bay City, Yangpu District, Shanghai.", "label": ["Important", "Contact Information"], "rewrite": "Contact address: Building B, Chuangzhi International Plaza, No. 38 Zhenggao Road, Xinjiang Bay City, Yangpu District, Yangpu District, Shanghai"}
{"task": "rw_119.jsonl", "id": 75408, "text": "2. Under normal circumstances, we will reply within 15 working days after receiving your questions, opinions or suggestions, and verify your user identity.", "label": ["Important", "Contact Information"], "rewrite": "Give a reply within 15 working days after verifying your user identity"}
{"task": "rw_119.jsonl", "id": 75409, "text": "If you are not satisfied with our response, especially our personal information processing behavior harms your legitimate rights and interests, you can also complain or report to regulatory authorities such as online information, telecommunications, public security and market supervision and management.", "label": ["Important", "Edit/Control"], "rewrite": "If you are not satisfied with the reply, you can complain or report to the regulatory authorities of the Internet information, telecommunications, public security and market supervision and management"}
{"task": "rw_119.jsonl", "id": 75410, "text": "In addition, you understand and know that in the following situations related to personal information, we will not be able to reply to your request:", "label": ["Edit/Control", "Important"], "rewrite": "In the following situations related to personal information, we will not be able to reply to your request:"}
{"task": "rw_119.jsonl", "id": 75411, "text": "(1), related to national security and national defense security;", "label": ["Important", "Edit/Control"], "rewrite": "(1) Related to national security and national defense security;"}
{"task": "rw_119.jsonl", "id": 75412, "text": "(2), related to public safety, public health, and major public interests;", "label": ["Important", "Edit/Control"], "rewrite": "(2) Related to public safety, public health, and major public interests;"}
{"task": "rw_119.jsonl", "id": 75413, "text": "(3), related to criminal investigation, prosecution, and trial;", "label": ["Important", "Edit/Control"], "rewrite": "(3) Crime investigation, prosecution, and trial;"}
{"task": "rw_119.jsonl", "id": 75414, "text": "(4) If there is sufficient evidence that you have subjective malice or abuse of rights;", "label": ["Important", "Edit/Control"], "rewrite": "(4) There is sufficient evidence that you have subjective malice or abuse of rights;"}
{"task": "rw_119.jsonl", "id": 75415, "text": "(5) In response to your request, the legitimate rights and interests of you or other individuals and organizations are severely damaged;", "label": ["Important", "Edit/Control"], "rewrite": "(5) Response your request will cause the legitimate rights and interests of you or other individuals and organizations to be seriously damaged;"}
{"task": "rw_119.jsonl", "id": 75416, "text": "(6), involved business secrets;", "label": ["Important", "Edit/Control"], "rewrite": "(6) Involved in business secrets;"}
{"task": "rw_119.jsonl", "id": 75417, "text": "(7) Other situations stipulated in laws and regulations.", "label": ["Important", "Edit/Control"], "rewrite": "(7) Other circumstances stipulated in laws and regulations."}
{"task": "rw_119.jsonl", "id": 75418, "text": "COPYRIGHT  2013- 2022 PAPERGAMES. ALL RIGHTS RESERVED.", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75419, "text": "Copyright", "label": [], "rewrite": []}
{"task": "rw_119.jsonl", "id": 75420, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
