{"task": "rw_128.jsonl", "id": 77299, "text": "Update prompts and summary", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77300, "text": "Update prompt", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77301, "text": "The main changes in this update are as follows:", "label": ["Policy Change", "Important"], "rewrite": "The main changes in this update are as follows:"}
{"task": "rw_128.jsonl", "id": 77302, "text": "1. Explain the collection and processing of personal information in the new alliance voice chat function scene;", "label": ["Policy Change", "Important"], "rewrite": "1. Explain the collection and processing of personal information in the new alliance voice chat function scene;"}
{"task": "rw_128.jsonl", "id": 77303, "text": "2. Further replenishment of personal information processing in the protection of minors.", "label": ["Policy Change", "Important"], "rewrite": "2. Further replenishment of personal information processing in the protection of minors."}
{"task": "rw_128.jsonl", "id": 77304, "text": "overview", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77305, "text": "You are welcome to choose Tencent games provided by Tencent!", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77306, "text": "In addition to the \"Guidelines for Game Privacy Protection\" and \"Game License and Service Agreement\", we will also further refine it to you through the \"Return to the Empire\" (\"Big Guide\") to explain that you are using the \"Return to the Empire\"(\" Game Products \"or\" Products \") When we collect, use, store, and share personal information, as well as related rights you enjoy, this guidance is part of the\" Game License and Service Agreement \".", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77307, "text": "If there is no special explanation, Shenzhen Tencent Computer Systems Co., Ltd. (\"Tencent Computer Company\") and Shenzhen Tencent Tianyou Technology Co., Ltd. (\"Tencent Tianyou Company\") are collectively referred to as Tencent (or us) in this guidance.", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77308, "text": "Among them, Tencent Computer Company's registration place is the 35th floor of Tencent Building, Tencent Building, Magna Community, Yuehai Street, Nanshan District, Shenzhen;", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77309, "text": "Tencent Tianyou Company's registration place is 523 rooms for Block A, Block A, Block A, No. 6, Baoxing Road, Haiwang District, Xin'an Street, Baoan District, Shenzhen.", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77310, "text": "The points are as follows:", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77311, "text": "• In order to provide you with basic services such as gaming entertainment and interactive and consumption related to this player, we need to collect your account and login information, game log information, equipment information, consumption information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your account number and login information, game log information, equipment information, consumer information."}
{"task": "rw_128.jsonl", "id": 77312, "text": "To provide you with other game extensions, we also need to collect contact information you actively provided to us.", "label": ["Important", "First Party Collection Information"], "rewrite": "You need to collect the contact information information you provide to us"}
{"task": "rw_128.jsonl", "id": 77313, "text": "For details, please check the first part of this guideline.", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77314, "text": "• In order to collect the above information, we need to apply for some system permissions from you. You can manage your personal information and related authorization according to the guidance.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "In order to collect the above information, you need to apply for some system permissions, you can manage your personal information and related authorization"}
{"task": "rw_128.jsonl", "id": 77315, "text": "• In order to better protect the physical and mental health of minors and promote the healthy access of minors, we may implement more stringent anti -addiction measures on the basis of the state's relevant national online game anti -addiction policy regulations.", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77316, "text": "At the same time, we also continue to study and test new technologies that protect minors.", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77317, "text": "For example, in order to further improve the accuracy of real -name authentication and to maximize the minors from using the identity information of others, we may use the face recognition verification identity in some games or for some users (based on specific game strategies), and use face face recognitionAt this time, we will use the identity verification ability provided by Tencent Health System to verify the WeChat or QQ platform (depending on the account you log in) to check. Tencent Health System needs to collect your true identity information for authentication.", "label": ["Important", "First Party Collection Information"], "rewrite": "Tencent Health System needs to collect your real identity information for identity testing."}
{"task": "rw_128.jsonl", "id": 77318, "text": "When using the face recognition function, Tencent Health System will apply for your device camera/camera permissions through WeChat or QQ to complete the face recognition.", "label": ["Permission Acquisition", "Important"], "rewrite": "Will apply for your device camera/camera permissions through WeChat or QQ to complete face recognition"}
{"task": "rw_128.jsonl", "id": 77319, "text": "• The above -mentioned face recognition verification mainly compares the user's real facial information with the data source of the Public Security's authoritative data platform.", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77320, "text": "If the result is inconsistent or the user refuses to verify, we will uniformly regard them as a 12 -year -old and below minor and include the corresponding anti -addiction supervision.", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77321, "text": "Related verification data for face recognition is only used to compare with the authoritative data platform of public security after encryption, and we will not keep it.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "Related verification data for face recognition is only used to compare with the authoritative data platform of public security after encryption, and it will not leave it."}
{"task": "rw_128.jsonl", "id": 77322, "text": "• We use multi -directional security protection measures to ensure that your personal information protection is at a reasonable level of security.", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77323, "text": "You can read the full version of \"Return to the Empires> Privacy Protection Guidelines\" to understand more detailed personal information processing rules such as the corresponding relationship between the type and use of personal information.", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77324, "text": "1 The personal information we collect and use", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77325, "text": "In the process of using this game product service, we will collect the information that you actively provide or due to the service when using the service as follows, to provide you with your services and ensure your account securityThe", "label": ["Important", "First Party Collection Information"], "rewrite": "The information will be collected in the following way to ensure your account security:"}
{"task": "rw_128.jsonl", "id": 77326, "text": "1.1, when you register, log in, and use this game product service, we will collect your account number and login information as the network identity information information to mark your users as Tencent games.", "label": ["Important", "First Party Collection Information"], "rewrite": "It will collect your account number and login information as the network identity information information for the user of the Tencent game."}
{"task": "rw_128.jsonl", "id": 77327, "text": "You can register and log in to this game product with WeChat, QQ or other accounts (hereinafter referred to as \"third -party accounts\").", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77328, "text": "If you use WeChat, QQ and (or) third -party accounts as a game account associated with Tencent games, we will collect the unique logo, nickname, and avatar involved in the WeChat, QQ or third -party accounts you use to help you complete registration and register andLogin, and friends or other information authorized by your authorized friends in order to associate your friends in your WeChat, QQ or third -party accounts in the game to achieve a better social experience.", "label": ["Important", "First Party Collection Information"], "rewrite": "Will collect the unique logos, nicknames, and avatars involved in the WeChat, QQ or third -party accounts you use to help you complete registration and login"}
{"task": "rw_128.jsonl", "id": 77329, "text": "You can check and manage the above information authorization in WeChat, QQ or third -party platforms.", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77330, "text": "1.2, in order to meet the requirements of relevant laws, regulations and policies and the requirements of relevant competent authorities, you should provide real identity information for account registration and login and use. We will verify your true identity information through Tencent Health System.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect real identity information for account registration and login, and will verify your true identity information through Tencent Health System."}
{"task": "rw_128.jsonl", "id": 77331, "text": "In order to achieve the previous description, you agree that we will verify the real -name authentication of the WeChat or QQ account used by your current registration and login to Tencent Health System.We disclosed the age information to confirm whether the account is included in the anti -induction system and what kind of anti -addiction measures are taken. At the same time, you agree that we will submit your name and ID number to the national unified minor online game electronic identity through the Tencent health systemThe authentication system is verified by authenticity.", "label": ["Specific Audiences", "Important"], "rewrite": "Should provide real identity information for account registration and login and use, Tencent Health System discloses the age information to us to confirm whether the account is included in the anti -induction system and what kind of anti -addiction measures are taken, and the name and ID number are submitted through the Tencent Health System.To the national unified minor online game electronic identity authentication system, real authenticity verification."}
{"task": "rw_128.jsonl", "id": 77332, "text": "If the account does not complete the real -name authentication in the Tencent Health System, we cannot provide you with services. If you still want to use our products and services, you should be on the WeChat or QQ used by you in the Tencent Health System.The account completes the real -name authentication. In the process of real -name authentication, Tencent Health System will collect your real -name identity information (including name and ID number).", "label": ["Important", "First Party Collection Information"], "rewrite": "In the process of real -name authentication, Tencent Health System will collect your real -name identity information (including name and ID number)"}
{"task": "rw_128.jsonl", "id": 77333, "text": "At the same time, in order to verify the purpose of authenticity, the Tencent Health System may be based on the protection strategy of minors, when you conduct real -name authentication of the WeChat or QQ account you are currently registered and logged in, or you use the real -name certification of WeChat or you have completed the real -name certification orDuring the QQ account login game and use the game service process, from time to time, you are required to further provide other sensitive personal information (including mobile phone numbers, photos, or face recognition information, etc.) and will use the real -name information records and telecommunications operators with you in Tencent's health systemPut the real -name information records or the data source of the Public Security authoritative data platform for comparison. If you refuse to provide the aforementioned information or fail to pass the comparison, you may not be able to continue to use our products and services or be restricted.", "label": ["Specific Audiences", "First Party Collection Information", "Important"], "rewrite": "Collect other sensitive personal information (including mobile phone numbers, photos, or face recognition information, etc.) and compare it. If you refuse to provide the aforementioned information or fail to pass the comparison, you may not be able to continue using services or restricted."}
{"task": "rw_128.jsonl", "id": 77334, "text": "Face recognition related verification data is only used to compare with the data source of the authoritative data platform of Public Security after encryption, and we will not keep it.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "Face recognition related verification data is only used to compare with the data source of the authoritative data platform of Public Security after encryption, and we will not keep it."}
{"task": "rw_128.jsonl", "id": 77335, "text": "1.3, you can also choose to fill in the gender and other information of this game product to improve your game account information. Such account information will be displayed on your role page to achieve a better social experience. You can choose yourself to choose from yourself.Whether to fill in and display, we will not associate such information with your personal identity and process it.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Account information will be displayed on your role page to achieve a better social experience"}
{"task": "rw_128.jsonl", "id": 77336, "text": "1.4, when you use this game product service, we will collect your game log information, such as login logs, items logs, operating information, game -to -game information, dating information, etc.Functions and scenes, while also used for customer service complaint processing and game security and vulnerability processing analysis.", "label": ["Important", "First Party Collection Information"], "rewrite": "Will collect game log information, such as logging in logs, items, operation information, game -to -game information, dating information, etc."}
{"task": "rw_128.jsonl", "id": 77337, "text": "To ensure the consistency and stability of your game experience, we may synchronize the aforementioned information to the subsequent version of the game.", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77338, "text": "1.5, in order to ensure your normal use of our services and maintain the normal operation of the basic functions of the game, optimize the performance of this game product according to your device terminal and network status, improve your game experience and ensure your account security. We will collect your accountEquipment names, equipment types, equipment models and versions, operating systems, system attributes, IP address, operator information, Wi-Fi status/parameters, device recognition symbols (such as IMEI, IMSI, MAC address, Android, ID, hardware sequence number), Apps such as ID, network type and other information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Will collect your device name, equipment type, equipment model and version, operating system, system attributes, IP address, operator information, Wi-Fi status/parameter, device recognition symbols (such as IMEI, IMSI, MAC address, Android ID,, Android ID,, Android ID,, Android ID,, Android ID,,, Android ID,,, Android ID,,, Android ID,,, Android ID,,Hardware serial number), application ID, network type and other information."}
{"task": "rw_128.jsonl", "id": 77339, "text": "1.6, when you use the consumption function, we will collect information such as your recharge records, consumption records in order to provide services and allow you to query your transaction records, and at the same time protect your virtual items to the greatest extent.", "label": ["Important", "First Party Collection Information"], "rewrite": "Will collect information such as your recharge records, consumption records in order to provide services and inquire about transaction records"}
{"task": "rw_128.jsonl", "id": 77340, "text": "The recharge records and consumption records are sensitive personal information. Collecting the above information is necessary to achieve consumption functions, otherwise the transaction will not be completed.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "The recharge record and consumption record are sensitive personal information. Collecting the above information is necessary to achieve consumption functions, otherwise the transaction will not be completed"}
{"task": "rw_128.jsonl", "id": 77341, "text": "1.7, in order to ensure your game environment and equipment security, create a fair, healthy and safe game environment, we will collect your device and game recognition information, such as device logo, hardware and operating system information, installed application lists, processes, processes, processes, processes, processesAnd information such as game crash records, overall use of the game, and source of game channels to use to combat the behavior of destroying the fair environment or interference of the game or the normal conduct of game services (such as scanning plug -in, preventing cheating, etc.).", "label": ["Important", "First Party Collection Information"], "rewrite": "Will collect your device and game recognition information, such as device identifiers, hardware and operating system information, installation application lists, processes and game collapse records, overall use of the game, game channel source and other information"}
{"task": "rw_128.jsonl", "id": 77342, "text": "In particular, when you start the game, or when there is an abnormal installation behavior, we will use the application list to install the feature -to -the -specific installation package.", "label": ["Important", "Data Security"], "rewrite": "When starting the game pair or abnormal installation behavior, the characteristic hash extraction and encrypted cloud inspection of the suspicious application installation package you installed through the application list will be used for plug -in or cheating software detection"}
{"task": "rw_128.jsonl", "id": 77343, "text": "1.8, when you interact with other players through text, voice, voice and other methods in the game, we may collect and save the above information content you sent to filter the improper content of pornography, violence, politics, abuse, malicious advertisements, etc., so as to useThis purification game environment and maintain a healthy Internet environment.", "label": ["Important", "First Party Collection Information"], "rewrite": "Will collect and save the interactive information you sent to purify the game environment"}
{"task": "rw_128.jsonl", "id": 77344, "text": "1.9, if you want to interact with other game players through voice, after you authorize your consent, the game will access your microphone to provide you with voice chat function.", "label": ["Permission Acquisition", "Important"], "rewrite": "Apply for your microphone rights"}
{"task": "rw_128.jsonl", "id": 77345, "text": "If you refuse to authorize, you will not be able to use the corresponding function, but it does not affect your normally use other functions, you can also cancel the relevant authorization at any time.", "label": ["Permission Acquisition", "Important", "Edit/Control"], "rewrite": "Rejecting authorization will not be able to use the corresponding function, but it does not affect other functions of the game normally, and the relevant authorization permissions can be canceled at any time."}
{"task": "rw_128.jsonl", "id": 77346, "text": "1.10, we may collect your mobile phone number when you take the initiative to notify the results of the results you participate in, the report of the game failure, and the feedback and communication of your consultation, or you will give you a separate consent to youPush information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your mobile phone number for notifying related matters, or push you information with you separately"}
{"task": "rw_128.jsonl", "id": 77347, "text": "1.11 If you contact our customer service, we may need you to provide the necessary personal information for authentication to ensure your account security.", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77348, "text": "In order to provide services in accordance with your demand, after your authorization, artificial customer service personnel need to inquire or verify your relevant information within the scope of your authorization. We will adopt technical and management measures as much as possible to ensure your information security and confidentiality.Use within the range.", "label": ["Important", "Data Security"], "rewrite": "You need to inquire or verify the relevant information within the scope of the authorization, take technical and management measures as much as possible to ensure information security and confidentiality, and use it within the necessary range"}
{"task": "rw_128.jsonl", "id": 77349, "text": "We may also save your contact information (the mobile phone number, WeChat, QQ number or other contact information you use or actively provided), your communication records and content with us, and other necessary information to provide youRecord customer service, specifically the information you actually authorize and provide.", "label": ["Data Retention", "Important"], "rewrite": "Save your contact information (the mobile phone number, WeChat, QQ number or other contact information you use), your communication records and content with us, and other necessary information to provide services to provide services"}
{"task": "rw_128.jsonl", "id": 77350, "text": "1.12, when you participate in the product marketing and promotion survey activities we organize, we may collect your name, communication address, contact information, or other information you filled in by questionnaires or inviting you to fill in in order to fulfill you in order to fulfill youAnd distribution activity rewards.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your name, communication address, contact information, or other information you are filled in in order to reward and distribute activity rewards to you."}
{"task": "rw_128.jsonl", "id": 77351, "text": "When we are held by us and our affiliates, we may synchronize related information in products or services operated by multiple related parties and related parties to ensure that you get a complete event experience.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Simultaneous information in products or services operated by multiple related parties and related parties to ensure that you get a complete event experience."}
{"task": "rw_128.jsonl", "id": 77352, "text": "For details, please refer to the separate explanation of the activity page.", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77353, "text": "1.13, in order to collect the above information to achieve the corresponding game functions and business scenarios, we may apply for some system permissions to you in specific business scenarios. You can choose whether to authorize.", "label": ["Permission Acquisition", "Important"], "rewrite": "May apply for some system permissions in specific business scenarios, and you can choose whether to authorize."}
{"task": "rw_128.jsonl", "id": 77354, "text": "These system permissions include:", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77355, "text": "Android-telephone (only device for Android, below 10): Get the equipment identifier (IMEI/IMSI) for account security risk control and fault investigation.", "label": ["Permission Acquisition", "Important"], "rewrite": "Get the equipment identifier (IMEI/IMSI) for account security risk control and fault investigation."}
{"task": "rw_128.jsonl", "id": 77356, "text": "Android-storage/, iOS- photo: provides picture storage, upload, download function.", "label": ["Permission Acquisition", "Important"], "rewrite": "Android-storage/ iOS-photo: provides picture storage, uploading, downloading functions."}
{"task": "rw_128.jsonl", "id": 77357, "text": "Android-microphone/iOS-microphone: Provides in-game voice communication.", "label": ["Permission Acquisition", "Important"], "rewrite": "Get the microphone permission and provide in -game voice exchange"}
{"task": "rw_128.jsonl", "id": 77358, "text": "iOS-Local Network: Inspection of local network environmental security, local network connection status, and network speed measurement.", "label": ["Permission Acquisition", "Important"], "rewrite": "Get local network permissions"}
{"task": "rw_128.jsonl", "id": 77359, "text": "The above permissions will not be opened by default, and we will only apply for the above permissions in specific business scenarios.", "label": ["Permission Acquisition", "Important"], "rewrite": "The above permissions will not be opened by default, and we will only apply for the above permissions in specific business scenarios."}
{"task": "rw_128.jsonl", "id": 77360, "text": "Rejecting the above permissions will only affect the specific game functions and business scenarios associated with it, and will not affect your use of other game functions.", "label": ["Permission Acquisition", "Important"], "rewrite": "Rejecting the above permissions will only affect the specific game functions and business scenarios associated with it, and will not affect the use of other game functions."}
{"task": "rw_128.jsonl", "id": 77361, "text": "Please understand that due to the reasons of different terminal equipment operating systems, the permissions names on different terminals will be different.", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77362, "text": "You can manage system permissions through the terminal device [Settings-account and privacy] page.", "label": ["Important", "Edit/Control"], "rewrite": "You can manage system permissions through the terminal device [Settings-account number and privacy] page."}
{"task": "rw_128.jsonl", "id": 77363, "text": "1.14 For the HTML5 or Flash pages in this game product, in order to achieve statistical access, optimize web effects, record login and operation, it is convenient for you to complete the repeated login and access.", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77364, "text": "We will use COOKIE or labels and scripts to collect similar technologies including Internet protocols, (IP), address, browser type, Internet service providers, reference/exit page, operating system, date/time stamp, and/or click flow data.We will not associate the automatic collection log data with other information we collected. You can remove the information by clearing the cache method of the browser/game.", "label": ["Important", "First Party Collection Information", "Edit/Control"], "rewrite": "Collect the Internet protocol (IP) address, browser type, Internet service provider, reference/exit page, operating system, date/time stamp, and/or click stream data.You can remove this information by clearing the cache of the browser/game"}
{"task": "rw_128.jsonl", "id": 77365, "text": "1.15, according to relevant laws and regulations and national standards, in the following situations, we may collect or use your relevant personal information without soliciting your authorization consent:", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "In the following situations, we may collect and use your relevant personal information without asking your authorization consent:"}
{"task": "rw_128.jsonl", "id": 77366, "text": "1) To fulfill the statutory duties or the requirements of the statutory volunteer;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect information to fulfill the statutory duties or the need for legal databases, no need to agree"}
{"task": "rw_128.jsonl", "id": 77367, "text": "2) In order to deal with emergencies, or in urgent situations, it is necessary to protect the health and property safety of natural people;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect information to cope with emergencies, no need to agree"}
{"task": "rw_128.jsonl", "id": 77368, "text": "3) Treatment of personal information on personal or other legal disclosure in accordance with the laws and regulations within a reasonable range;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "According to laws and regulations, legal personal information is processed within a reasonable range, no need to agree"}
{"task": "rw_128.jsonl", "id": 77369, "text": "4) It is necessary for the contract to establish and fulfill your contract as a party;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting and fulfilling the personal information necessary for your contract as a party as one party, no need to agree"}
{"task": "rw_128.jsonl", "id": 77370, "text": "5) Other circumstances stipulated in laws and regulations.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect personal information under other circumstances stipulated in laws and regulations, no need to agree"}
{"task": "rw_128.jsonl", "id": 77371, "text": "1.16, please understand that the functions and services we provide to you are constantly updated and developed. If a function or service is not in the aforementioned instructions and collects your information, we will use page prompts, interactive processes, website announcements, website announcementsTo explain the content, scope and purpose of information collection to you to obtain your consent.", "label": ["Important", "First Party Collection Information"], "rewrite": "It will explain the content, scope and purpose of information collection through page prompts, interaction processes, website announcements, etc. to obtain consent."}
{"task": "rw_128.jsonl", "id": 77372, "text": "1.17, currently, in addition to collecting game research information from a third -party research agency to help us improve the game products and provide services that are suitable for you, and the situation that this guidelines have clearly explained, we will not take the initiative to obtain your personal information from a third party from a third party.Essence", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "We will not take the initiative to get your personal information from a third party"}
{"task": "rw_128.jsonl", "id": 77373, "text": "If the business development needs to obtain and process your personal information from a third party in the future, we will strictly abide by the provisions of relevant laws and regulations, asking the third party to obtain your consent and ensure the legitimacy of the information it provides.", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77374, "text": "2 Personal information sharing, transfer and public disclosure", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77375, "text": "2.1 Personal information sharing", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77376, "text": "Except for this guideline and the situation stipulated in the \"Game License and Service Agreement\", without your consent, we will not actively share your personal information to third parties.", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77377, "text": "If you have other personal information that shared your personal information or you need us to share your personal information into a third party to surpass the original authorization purpose, we will directly or indirectly obtain your consent of your behavior through this third party.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you need to share it, you will directly or indirectly obtain your consent of your explicit in the above behavior."}
{"task": "rw_128.jsonl", "id": 77378, "text": "In order to achieve specific purposes, the scene of sharing information with third parties is as follows:", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77379, "text": "1) Minor protection", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77380, "text": "In order to better protect the physical and mental health of minors and promote the healthy Internet access of minors, we will inform their guardians after discovering suspected minors consumption or receiving legal guardians' requests, Reminder, confirmation and processing.", "label": ["Specific Audiences", "Important"], "rewrite": "After discovering the suspected minor consumption, or receiving the request of the legal guardian, inform the guardian of the game -related consumption records and usage,"}
{"task": "rw_128.jsonl", "id": 77381, "text": "For the collection of personal information of minors, please refer to Article 7 of this guideline.", "label": ["Specific Audiences", "First Party Collection Information", "Important"], "rewrite": "For the collection of personal information of minors, please refer to Article 7 of this guideline."}
{"task": "rw_128.jsonl", "id": 77382, "text": "2) Related product services", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77383, "text": "When you use other products or services operated by Tencent (\"related products\"), after you are clearly authorized, we will bind the account number you choose this game product with related products andThe avatar, record, or other information you authorize are shared with related products to show you or other users in the affiliated product, so that you can participate in game welfare activities in related products, and receive corresponding benefits.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After clear authorization, the nickname, avatar, record or other authorized information of the game product account will be shared with related products"}
{"task": "rw_128.jsonl", "id": 77384, "text": "Specific personal information collection and use rules will synchronize with you when you bind your account, and complete your account binding and information sharing after obtaining your authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Specific personal information collection and use rules will synchronize with you when binding accounts, and complete account binding and information sharing after obtaining the consent of the authorization"}
{"task": "rw_128.jsonl", "id": 77385, "text": "You can check and manage your game historical information authorization based on the prompts, or choose whether to show your game historical information to other users.", "label": ["Important", "Edit/Control"], "rewrite": "You can view and manage game history information authorization on the related product [Settings] page, or choose whether to show your game history information to other users"}
{"task": "rw_128.jsonl", "id": 77386, "text": "Refusaling does not affect your functions of using this product and related products.", "label": ["Important", "Edit/Control"], "rewrite": "Refusaling does not affect your functions of using this product and related products."}
{"task": "rw_128.jsonl", "id": 77387, "text": "3) Third -party service", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77388, "text": "In order to ensure the safe and stable operation of the game and achieve specific functions, some services in Tencent Games are provided by our affiliates or other third parties.", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77389, "text": "We will choose third -party and third -party services, urge relevant third parties to collect and use your personal information in accordance with this guideline or the agreement reached with you, and take appropriate security technology and management measures to ensure your personal information security.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Will choose third -party and third -party services, urge relevant third parties to collect and use personal information in accordance with this guideline or agreed, and adopt appropriate security technology and management measures to ensure personal information security."}
{"task": "rw_128.jsonl", "id": 77390, "text": "For the specific situation of the third -party information sharing of this product, please refer to the \"Third -Party Information Sharing List\" (including \"Third -Party SDK Catalog\").", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For the specific situation of the third -party information sharing of this product, please refer to the \"Third -Party Information Sharing List\" (including \"Third -Party SDK Catalog\")"}
{"task": "rw_128.jsonl", "id": 77391, "text": "4) Statistical analysis and research", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77392, "text": "In order to improve our capabilities and technical scientific research capabilities, promote service security and technical level in order to provide users with higher quality services, we will ensure that the purpose is legitimate and data security within a reasonable and necessary scope.Scientific research institutes, universities and other institutions shared data after de -identification or anonymous processing.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Within a reasonable and necessary scope, it will ensure that the purpose of the purpose is legitimate and data security, sharing data with research institutions, scientific research institutes, universities and other institutions after de -identification or anonymous processing."}
{"task": "rw_128.jsonl", "id": 77393, "text": "Without your clear authorization, we will not share with the above agencies that can be used to identify your personal identity information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Without clear authorization, it will not share information from the above institutions to identify your personal identity."}
{"task": "rw_128.jsonl", "id": 77394, "text": "2.2 Public information disclosure", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77395, "text": "In addition to this guideline and the \"Game License and Service Agreement\" and \"Guidelines for the Privacy Property Protection\", we will not disclose the personal information collected publicly.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Except for this guideline and the \"Game License and Service Agreement\" and \"Guidelines for the Privacy Property Protection\", they will not disclose the collected personal information collected publicly."}
{"task": "rw_128.jsonl", "id": 77396, "text": "If we must disclose publicly, we will inform you that the purpose of the public disclosure, the type of disclosure information, and the sensitive personal information that may be involved, and obtain your explicit consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you must disclose it publicly, the purpose of the public disclosure, the type of disclosure information, and the sensitive personal information that may be involved will be exposed, and the consent is explicit."}
{"task": "rw_128.jsonl", "id": 77397, "text": "Please note that if you are dealt with in violation of the \"Game License and Service Agreement\" or any illegal acts in the process of using Tencent's game, we may announce the results and disclose relevant account information in the announcement.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you are dealt with during use, we may announce the results and disclose relevant account information in the announcement."}
{"task": "rw_128.jsonl", "id": 77398, "text": "2.3 Personal information transfer", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77399, "text": "Without your authorization, we will not transfer your personal information to a third party.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Without your authorization, we will not transfer your personal information to a third party."}
{"task": "rw_128.jsonl", "id": 77400, "text": "With the continuous development of our business, we may conduct merging, acquisition, asset transfer and other transactions. We will inform you that the relevant situation will continue to protect or request new processors to continue in accordance with the laws and regulations and not lower than the standards required by this guideline.Protect your personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the merger, acquisition, asset transfer and other transactions, you will inform you that the relevant situation will continue to protect your personal information in accordance with laws and regulations and not lower than the standards required by this guideline"}
{"task": "rw_128.jsonl", "id": 77401, "text": "3 Storage of personal information", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77402, "text": "3.1 The method and period of information storage", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77403, "text": "We will store your information in a safe way, including local storage (such as using APP for data cache), database and server logs.", "label": ["Data Retention", "Important"], "rewrite": "You will store your information in a safe way, including local storage (such as using APP for data cache), database and server logs."}
{"task": "rw_128.jsonl", "id": 77404, "text": "Generally, we will only store your personal information for the time necessary to achieve the service purpose or under the conditions stipulated by laws and regulations.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "Under normal circumstances, your personal information will only be stored within the time necessary for the service purpose or under the conditions stipulated by laws and regulations."}
{"task": "rw_128.jsonl", "id": 77405, "text": "After the previous period expires, we will delete or treat your personal information.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "After the previous period expires, we will delete or treat your personal information."}
{"task": "rw_128.jsonl", "id": 77406, "text": "We judge the storage period of personal information. The following standards are mainly referred to the following standards and the elders are based on the elders:", "label": ["Data Retention", "Important"], "rewrite": "The storage period for judging personal information is mainly referred to the following standards and the elders are based on the elders:"}
{"task": "rw_128.jsonl", "id": 77407, "text": "1) Complete the business function you agree with;", "label": ["Data Retention", "Important"], "rewrite": "1) The storage period is based on the business functions you agree with;"}
{"task": "rw_128.jsonl", "id": 77408, "text": "2) Ensure that we provide you with service safety and quality;", "label": ["Data Retention", "Important"], "rewrite": "2) The storage period is based on ensuring the safety and quality of our services for you"}
{"task": "rw_128.jsonl", "id": 77409, "text": "3) The longer retention period you agree;", "label": ["Data Retention", "Important"], "rewrite": "3) The storage period is based on the longer retention period you agree"}
{"task": "rw_128.jsonl", "id": 77410, "text": "4) Whether there are other regulations in the retention period;", "label": ["Data Retention", "Important"], "rewrite": "4) The determination of the storage period needs to see if there are other regulations for the reserved period;"}
{"task": "rw_128.jsonl", "id": 77411, "text": "5) Laws and regulations require information to be stored within a certain period of time.", "label": ["Data Retention", "Important"], "rewrite": "5) The determination of the storage period must also see if the laws and regulations are stipulated to be stored within a certain period of time."}
{"task": "rw_128.jsonl", "id": 77412, "text": "3.2 The area of information storage", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77413, "text": "We will store the personal information of users collected in China in China in accordance with laws and regulations.", "label": ["Data Retention", "Important"], "rewrite": "We will store the personal information of users collected in China in China in accordance with laws and regulations."}
{"task": "rw_128.jsonl", "id": 77414, "text": "3.3 Notice of the product or service stopping operation", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77415, "text": "When our products or services stop operation, we will announce notifications in accordance with relevant laws and regulations and protect your legitimate rights and interests in accordance with the law.", "label": ["Important", "Cessation of Operations"], "rewrite": "When the operation is stopped, the announcement will be announced in accordance with relevant laws and regulations, and legitimate rights and interests will be protected in accordance with the law."}
{"task": "rw_128.jsonl", "id": 77416, "text": "4 information security", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77417, "text": "4.1 Safety protection measures", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77418, "text": "We strive to provide protection for users' information security to prevent information leakage, loss, improper use, unauthorized access and disclosure.", "label": ["Important", "Data Security"], "rewrite": "Provide users' information security to prevent information leakage, loss, improper use, unauthorized access and disclosure, etc."}
{"task": "rw_128.jsonl", "id": 77419, "text": "We use multi -directional security protection measures to ensure that user personal information protection is at a reasonable level of security, including technological protection methods, management system control, and security system guarantee.", "label": ["Important", "Data Security"], "rewrite": "Using multi -position safety protection measures, including technical protection methods, management system control, security system guarantee and many other aspects, etc."}
{"task": "rw_128.jsonl", "id": 77420, "text": "In addition, the relevant system of our game has also passed the record and evaluation of national network security level protection (level three).", "label": ["Important", "Data Security"], "rewrite": "The relevant system of our game also passed the filing and evaluation of national network security level protection (level 3)"}
{"task": "rw_128.jsonl", "id": 77421, "text": "We use industry -leading technical protection measures.", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77422, "text": "The technical means we use include but not limited to firewalls, encryption (such as SSL), de -identification or anonymous treatment, access control measures, etc.", "label": ["Important", "Data Security"], "rewrite": "The technical means used include but not limited to firewalls, encryption (such as SSL), de -identification or anonymous treatment, access control measures, etc."}
{"task": "rw_128.jsonl", "id": 77423, "text": "In addition, we will continue to strengthen the security capabilities of software installed on your device.", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77424, "text": "For example, we will complete some information encryption work locally to consolidate security transmission;", "label": ["Important", "Data Security"], "rewrite": "Will complete some information encryption work locally to consolidate security transmission"}
{"task": "rw_128.jsonl", "id": 77425, "text": "We will understand the application information and running process information installed by your device to prevent malicious programs such as viruses and Trojans.", "label": ["Important", "Data Security"], "rewrite": "You will understand the application information and running process information installed by your device to prevent malicious programs such as viruses and Trojans"}
{"task": "rw_128.jsonl", "id": 77426, "text": "We have established a special management system, process and organization that guarantees personal information security.", "label": ["Important", "Data Security"], "rewrite": "Established a special management system, process and organization that guarantees personal information security"}
{"task": "rw_128.jsonl", "id": 77427, "text": "For example, we strictly restrict the scope of the personnel of the access information, require them to abide by the confidentiality obligations and audit, and those who violate the obligations will be punished in accordance with regulations.", "label": ["Important", "Data Security"], "rewrite": "Strictly restrict the scope of the personnel of access information, require obligations to obey confidentiality and audit, and personnel who violate obligations will be punished in accordance with regulations."}
{"task": "rw_128.jsonl", "id": 77428, "text": "We will also review the management system, process and organization to prevent unauthorized personnel from accessing, using or disclosing users' information.", "label": ["Important", "Data Security"], "rewrite": "The management system, process and organization will be reviewed to prevent unauthorized personnel from accessing, using or disclosing users' information without authorization"}
{"task": "rw_128.jsonl", "id": 77429, "text": "We recommend that you pay full attention to the protection of personal information when using products and services, and we will also provide multiple security functions to help you protect your personal information security.", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77430, "text": "4.2 Safety event disposal measures", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77431, "text": "If personal information leaks and other security incidents occur, we will start emergency plans to prevent security incidents from expanding.", "label": ["Important", "Data Security"], "rewrite": "If personal information leaks such as personal information, emergency plans will be initiated to prevent security incidents from expanding."}
{"task": "rw_128.jsonl", "id": 77432, "text": "After the security incident occurs, we will inform you the basic situation of the security incident in the form of announcement, push notification or email, we are about or already adopted, and our proposals for your response.", "label": ["Important", "Data Security"], "rewrite": "After the security incident occurs, we will inform them in the form of announcement, push notification or email"}
{"task": "rw_128.jsonl", "id": 77433, "text": "If it is difficult to achieve one by one, we will issue warnings through announcement and other methods.", "label": ["Important", "Data Security"], "rewrite": "If it is difficult to achieve one by one, we will issue warnings through announcement and other methods."}
{"task": "rw_128.jsonl", "id": 77434, "text": "5 Your rights", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77435, "text": "During your use of this game product service, we may provide you with corresponding operation settings depending on the specific situation of the game product so that you can inquire, copy, correct, supplement, delete, or withdraw or withdraw your relevant personal information.", "label": ["Important", "Edit/Control"], "rewrite": "The corresponding operation settings will be provided depending on the specific situation of the game product to query, copy, correct, supplement, delete or withdraw relevant personal information."}
{"task": "rw_128.jsonl", "id": 77436, "text": "In addition, we have set up a complaint report channel, and your opinions will be dealt with in a timely manner.", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77437, "text": "5.1 Personal information collection and use rules query", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77438, "text": "You can check the product collection and use rules at any time in the [Settings-Account and Privacy] interface in this product, including but not limited to this guideline, \"Third-Party Information Sharing List\", and the use of product sensitivity authority and authorization.", "label": ["Edit/Control", "Important"], "rewrite": "You can check the product collection and use rules at any time in the [Settings-Account and Privacy] interface in this product, including but not limited to this guideline, \"Third-Party Information Sharing List\", and the rules of use of product sensitivity and authorization."}
{"task": "rw_128.jsonl", "id": 77439, "text": "Please know and understand that the service and corresponding personal information collection and usage in this guideline may be different because of the specific services you choose to use, as well as factors such as the equipment models and system versions you use.", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77440, "text": "5.2 Personal information query, correction", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77441, "text": "1), you can query and access your account basic information (account avatar, nickname, and other personal information you choose) in the [Avatar-Monarch Information]Box] Inquire about game historical information (such as character level, achievement, record, and product specific game information).", "label": ["Important", "Edit/Control"], "rewrite": "Inquiry and access your account basic information in the [Avatar-Monarch Information] in this product, you can check the game historical information in [Chat-Knowing Du-Toolbox]."}
{"task": "rw_128.jsonl", "id": 77442, "text": "2), you can check through the WeChat Mini Program Tencent Health System to query your real -name information (name, ID number) corresponding to the WeChat account of Tencent Games or QQ account.", "label": ["Important", "Edit/Control"], "rewrite": "Inquire through the WeChat Mini Program Tencent Health System to log in to the WeChat account number (name, ID number) corresponding to the WeChat account or QQ account of Tencent Games."}
{"task": "rw_128.jsonl", "id": 77443, "text": "If you find that the real -name information of the query is wrong, you can apply for modification and certification in Tencent's health system.", "label": ["Edit/Control", "Important"], "rewrite": "If the real -name information of the query is found, you can apply for modification and certification in the Tencent Health System."}
{"task": "rw_128.jsonl", "id": 77444, "text": "But please note that in order to ensure the stability and security of the account, prevent illegal theft and transfer account, the frequency of real -name authentication modification will be limited. For specific rules, please see the Tencent Health System page description.", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77445, "text": "3), you can query more information about your use of this game product and service according to the actual situation according to the actual situation. For details, please refer to the interface description of the [Settings-Account and Privacy] interface.", "label": ["Important", "Edit/Control"], "rewrite": "In this product, you can query the information according to the actual situation according to the actual situation. For details, please refer to the interface description of the [Settings-Account and Privacy] interface."}
{"task": "rw_128.jsonl", "id": 77446, "text": "4) If you have other needs for personal information inquiry, replication, correction, and supplementation, you can also contact us through the contact information described in Article 9 of this guideline.", "label": ["Edit/Control", "Important"], "rewrite": "If there are other needs for personal information inquiry, replication, correction, and supplementation, you can contact us through the contact information described in Article 9 of this guideline."}
{"task": "rw_128.jsonl", "id": 77447, "text": "But please note that when you contact us to apply for personal information rights response, in order to ensure account number and personal information security, we may verify your identity and account security status.", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77448, "text": "We will support your reasonable request.", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77449, "text": "But under the situation of our personal information storage scope, exceeding the reasonable limit, or response to your request, we may not be able to respond to your application in the case of serious damage to your or other third -party legitimate rights and interests.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "In the case of the scope of personal information storage, exceeding the reasonable limit, or severe damage to legitimate rights and interests, it may not be able to respond to the application"}
{"task": "rw_128.jsonl", "id": 77450, "text": "5.3 Personal information display and sharing", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77451, "text": "1), your game account basic information (avatar, nickname, character level) will be displayed on your personal homepage, the ranking or related functions you participate in.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The basic information of your game account (avatar, nickname, character level) will be displayed"}
{"task": "rw_128.jsonl", "id": 77452, "text": "2), your game pair and historical information (specifically include but not limited to your rankings) will show you or other users or friends according to your choice.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Your game pair and historical information (specifically include but not limited to your rankings) will be displayed according to your choice"}
{"task": "rw_128.jsonl", "id": 77453, "text": "The game product provides you with a closing display path so that you can set the relevant information about whether you can publicly display the relevant information before. For details, please refer to [Settings-Account and Privacy].", "label": ["Important", "Edit/Control"], "rewrite": "The game products provide you with the path of closed display. For details, please refer to [Settings-Account and Privacy]."}
{"task": "rw_128.jsonl", "id": 77454, "text": "3), the information you uploaded or published in this game product, or the information you actively shared, will display the users within the scope of the publishing or shared.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The information uploaded or published in this game product, or the information you actively shared, will be displayed to users within the scope of the publishing or shared."}
{"task": "rw_128.jsonl", "id": 77455, "text": "4) When you authorize third parties to obtain your information in the game, the third party will disclose your relevant information to you or other users of the third party within your authorization range.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When you authorize the third party to get your information in the game, the third party will disclose your relevant information within the scope of the authorization"}
{"task": "rw_128.jsonl", "id": 77456, "text": "For specific display rules and public scope settings, please pay attention to the rules of the third -party platform.", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77457, "text": "5.4 Personal information collection and use of authorization changes", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77458, "text": "You can change the equipment permissions obtained by deleting information, closing or opening specific product functions, closing or opening a specific product acquisition (the specific permissions are different due to the different equipment models and system versions used by the user).Scope of authorization.", "label": ["Edit/Control", "Important"], "rewrite": "You can change the scope of authorization by deleting information, closing or turning on specific product functions, closing or opening a specific product acquisition, and change the scope of authorization"}
{"task": "rw_128.jsonl", "id": 77459, "text": "After withdrawing authorization, you may not be able to use the authorized product function, but do not affect the use of other functions.", "label": ["Important", "Edit/Control"], "rewrite": "After withdrawal authorization, the corresponding product function may not be used, but it does not affect the use of other functions."}
{"task": "rw_128.jsonl", "id": 77460, "text": "You withdraw authorization will not affect the effectiveness of personal information processing activities based on your authorization before withdrawal.", "label": ["Permission Acquisition", "Edit/Control", "Risk", "Important"], "rewrite": "The withdrawal authorization does not affect the effectiveness of the personal information processing activity that has been performed before the withdrawal"}
{"task": "rw_128.jsonl", "id": 77461, "text": "Some personal information collection and use of the basic functions corresponding to our services. If you want to withdraw the authorization of relevant personal information collection and use may cause us to be unable to provide you with services. In this case, if you still want to withdraw the relevant authorization, you can pass it throughApply for account cancellation to achieve the demand.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "If you want to withdraw authorization may cause us to be unable to provide you, in this case, if you still want to withdraw relevant authorization, you can apply for an account to cancel the demand."}
{"task": "rw_128.jsonl", "id": 77462, "text": "For example, based on laws and regulations, real -name authentication must be performed using game services. If you want to withdraw the authorization of our collection of real -name authentication information, we require us to delete your real -name authentication information. We may not be able to continue to provide you with basic service products.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "If you want to withdraw the authorization of the collection of real -name authentication information, you may not continue to provide basic services for game products."}
{"task": "rw_128.jsonl", "id": 77463, "text": "5.5 Account Logging out", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77464, "text": "You can apply for account cancellation in [Settings-Account and Privacy-Account].", "label": ["Important", "Edit/Control"], "rewrite": "Application for account cancellation"}
{"task": "rw_128.jsonl", "id": 77465, "text": "When you apply for account cancellation, we will verify your identity, account security status, and cancellation conditions. For details, please read the instructions in the product cancellation process carefully and the \"Game Account Logging out\".", "label": ["Important", "Edit/Control"], "rewrite": "When applying for account cancellation, you will verify your identity, account security status, and cancellation conditions"}
{"task": "rw_128.jsonl", "id": 77466, "text": "After completing the cancellation of the game account, in addition to the laws and regulations or this agreement, your personal information under the game will delete or anonymous processing, and the related products and services that have previously related to the game account will no longer be associated.Essence", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "After completing the cancellation of the game account, the personal information under the game account will be deleted or anonymous, and the related products and services that have been associated with the game account will no longer be related."}
{"task": "rw_128.jsonl", "id": 77467, "text": "Once the game account is canceled, it will not be recovered, please do it carefully.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Once the game account is canceled, it will not be recovered, please do it carefully."}
{"task": "rw_128.jsonl", "id": 77468, "text": "6 Change", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77469, "text": "We may revise this guidelines in a timely manner.", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77470, "text": "When the personal information collection and use rules and other laws and regulations are changed, we will prompt you the guidance after the version is updated in an appropriate manner.", "label": ["Policy Change", "Important"], "rewrite": "When personal information collection and use rules and other laws and regulations are changed, the guidelines after the version update will be prompting the guidelines in appropriately when the version is updated."}
{"task": "rw_128.jsonl", "id": 77471, "text": "Please read the change of privacy protection or guidelines after the change. You continue to use Tencent Games to indicate that you agree to collect, process or use your personal information according to the updated privacy protection guidelines.", "label": ["Policy Change", "Important"], "rewrite": "Continue to use Tencent Games to agree to collect, process or use your personal information according to the updated privacy protection guidelines."}
{"task": "rw_128.jsonl", "id": 77472, "text": "7 minor protection", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77473, "text": "We attach great importance to the protection of personal information of minors and continue to explore better personal information protection methods for minors.", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77474, "text": "If you are the legal guardians of the minor, please pay attention to whether the minors you monitor use your authorized consent to use the service of Tencent games or provide personal information.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are the legal guardian of minors, please pay attention to whether minors use services or provide personal information after obtaining authorization."}
{"task": "rw_128.jsonl", "id": 77475, "text": "If you have doubts about the personal information of the minors you monitor, please contact us through the contact information in Article 9.", "label": ["Specific Audiences", "Important"], "rewrite": "If you have doubts about the personal information of the minors you monitor, please contact us through the contact information in Article 9."}
{"task": "rw_128.jsonl", "id": 77476, "text": "In particular, if you are a child under the age of 14, in order to protect the personal information of children, we have also released the Guidelines for Child Privacy Protection.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a child under the age of 14, in order to protect the personal information of children, we have also released the Guidelines for Child Privacy Protection"}
{"task": "rw_128.jsonl", "id": 77477, "text": "Children and their guardians should also read the \"Guidelines for Child Privacy Protection\" carefully before using Tencent game services.", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77478, "text": "You can use Tencent game services only after obtaining the guardian's guidelines and the \"Guidelines for Child Privacy Protection\".", "label": ["Specific Audiences", "Important"], "rewrite": "Only after obtaining the consent of the guardian's guidelines and the \"Guidelines for Children's Privacy Protection\", can you use Tencent game service"}
{"task": "rw_128.jsonl", "id": 77479, "text": "We will actively protect the legitimate rights and interests of minors by enabling the anti -addiction system in accordance with the requirements of national defense addiction policies.", "label": ["Specific Audiences", "Important"], "rewrite": "It will actively protect the legitimate rights and interests of minors by enabling the anti -addiction system in accordance with the requirements of national defense addiction."}
{"task": "rw_128.jsonl", "id": 77480, "text": "We will determine whether the real -name information of the relevant account is minor through information verification such as real -name identity, and then decide whether to incorporate this account into the anti -addiction system.", "label": ["Specific Audiences", "Important"], "rewrite": "It will determine whether the relevant account is minor through information verification such as real -name identity, and then decide whether this account is incorporated into the anti -addiction system."}
{"task": "rw_128.jsonl", "id": 77481, "text": "In addition, we will collect information such as your login time and game duration. By automatic intervention from the system level and restricting minors' game time and enabled offline functions, we will guide the rational game of minors.After consumption, try to contact the guardian to remind, confirm and deal with it to help minors to access the Internet.", "label": ["Specific Audiences", "First Party Collection Information", "Important"], "rewrite": "Will collect information such as your login time, game duration, and guide the rational game of minors through automatic intervention and restricting minor game time, enabled forced offline functions"}
{"task": "rw_128.jsonl", "id": 77482, "text": "In order to better protect the physical and mental health of minors and promote the healthy access of minors, we may implement more stringent anti -addiction measures on the basis of the state's relevant national online game anti -addiction policy regulations.", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77483, "text": "At the same time, we also continue to study and test new technologies that protect minors.", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77484, "text": "In order to further improve the accuracy of real -name authentication and to maximize the prevention of minors from using the identity information of others, we may be targeted at some users (based on specific game strategies) in specific scenarios (such as when you log in to the game, or or or orIn the game, including the recharge, consumption or transaction), the face recognition verification identity is enabled. When the face recognition is used, we will use WeChat or QQ platform (depending on your login account).Tencent Health System needs to collect your real identity information for identity testing.", "label": ["Specific Audiences", "Important"], "rewrite": "Tencent Health System needs to collect your real identity information for identity testing"}
{"task": "rw_128.jsonl", "id": 77485, "text": "When opening the face recognition function, the Tencent Health System will apply for your device camera/camera authority through WeChat or QQ platform to complete face recognition.", "label": ["Permission Acquisition", "Important"], "rewrite": "Tencent Health System will apply for the call camera/camera authority through WeChat or QQ platform to complete face recognition."}
{"task": "rw_128.jsonl", "id": 77486, "text": "The above -mentioned face recognition verification mainly compares the user's real facial information with the data source of the authoritative data platform of the Public Security. If the two comparison results are consistent, that is, successfully pass the certification, and match the corresponding game time limit according to the actual age group of the user.", "label": ["Specific Audiences", "Important"], "rewrite": "The user's true facial information is compared with the data source of the authoritative data platform of the public security."}
{"task": "rw_128.jsonl", "id": 77487, "text": "If the result is inconsistent or the user refuses to verify, we will uniformly regard them as a 12 -year -old and below minor and include the corresponding anti -addiction supervision.", "label": ["Specific Audiences", "Important"], "rewrite": "If the resulting result is inconsistent or the user refuses to verify, we will uniformly regard them as a 12 -year -old and below minor and include the corresponding anti -addiction supervision"}
{"task": "rw_128.jsonl", "id": 77488, "text": "Related verification data for face recognition is only used to compare with the authoritative data platform of public security after encryption, and we will not keep it.", "label": ["Important", "Data Security"], "rewrite": "Related verification data for face recognition is only used to compare with the authoritative data platform of public security after encryption, and we will not keep it."}
{"task": "rw_128.jsonl", "id": 77489, "text": "In addition, we may also collect the device sensor information you generated during the game through the Tencent Health System (such as collecting acceleration sensors, gyroscopes sensor and gravity sensor informationRelative position, acceleration direction, gravity direction and other data), and your voice data generated by other players through online voice in the game to build an algorithm model and preliminary judgment based on real -time behavior.Data, the system is just randomly judged whether it is children's or adult voice through your online voice).", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the sensor information of the device and the voice data generated in the game to build an algorithm model and preliminate whether you are minors based on real -time behavior"}
{"task": "rw_128.jsonl", "id": 77490, "text": "If you preliminate your behavior characteristics and the age of real -name information, Tencent Health System may be verified in accordance with the aforementioned regulations.", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77491, "text": "We will only collect and use this information for the purpose of minors' defense.", "label": ["Specific Audiences", "Important", "First Party Collection Information"], "rewrite": "We will only collect and use this information for the purpose of minors' defense."}
{"task": "rw_128.jsonl", "id": 77492, "text": "We have also established a growth guard platform.", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77493, "text": "The growth guardian platform can help parents or guardians understand the child's game situation at any time, set up the consumption limit and daily game duration and period, and assist parents or guardians of the minors to protect the harm of bad game habits.", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77494, "text": "You can click here to learn more about the Tencent game anti -addiction system and growth guardianship platform.", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77495, "text": "At the same time, we have also established a minor active service platform that tried to contact the guardian to remind, confirm and deal with after the suspected minor consumption. You can contact us through the minor education consultation line, 0755-83761852.", "label": ["Specific Audiences", "Important", "Contact Information"], "rewrite": "You can contact us through the minor education consultation line 0755-83761852."}
{"task": "rw_128.jsonl", "id": 77496, "text": "8 others", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77497, "text": "The \"Guidelines for Game Privacy Protection\" is a general privacy clause for Tencent Games uniformly. The content stipulated in it includes but not limited to user rights and information security measures. It is suitable for Tencent game users.", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77498, "text": "For example, the \"Guidelines for Game Privacy Protection\" is inconsistent or contradictory with this guideline, please refer to this guideline.", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77499, "text": "\"Guidelines for Child Privacy Protection\" is a personal information protection rule for children under 14 years of age.", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77500, "text": "In the scope of the \"Guidelines for Children's Privacy Protection\", if it is inconsistent or contradictory with the \"Guidelines for Game Privacy Protection\" and this guideline, please refer to the \"Guidelines for Child Privacy Protection\".", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77501, "text": "9 contact us", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77502, "text": "We have set up a special person in personal information protection team and personal information protection person. If you have any questions or complaints or suggestions on the privacy policy or personal information protection related matters, you can contact us in the following ways:", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77503, "text": "1) You can fill in personal information and privacy issues and contact us;", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77504, "text": "2) Send the problem to dataprivacy@tencent.com;", "label": ["Important", "Contact Information"], "rewrite": "Send the problem to dataprivacy@tencent.com;"}
{"task": "rw_128.jsonl", "id": 77505, "text": "3), contact us through https://kf.qq.com/;", "label": ["Important", "Contact Information"], "rewrite": "Contact us through https://kf.qq.com/"}
{"task": "rw_128.jsonl", "id": 77506, "text": "4) Mail your question to the following address:", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77507, "text": "Tencent Binhai Building, No. 33 Haitian Er Road, Nanshan District, Guangdong Province, China, China, China, China Binhai Building data privacy protection department (closed)", "label": ["Important", "Contact Information"], "rewrite": "Tencent Binhai Building, No. 33 Haitian Er Road, Nanshan District, Guangdong Province, China, China, China, China Binhai Building data privacy protection department (closed)"}
{"task": "rw_128.jsonl", "id": 77508, "text": "Postcode: 518054", "label": ["Important", "Contact Information"], "rewrite": "Postcode: 518054"}
{"task": "rw_128.jsonl", "id": 77509, "text": "We will review the issues involved as soon as possible and answer your request within 15 working days or laws and regulations.", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77510, "text": "Shenzhen Tencent Computer System Co., Ltd.", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77511, "text": "Shenzhen Tencent Tianyou Technology Co., Ltd.", "label": [], "rewrite": []}
{"task": "rw_128.jsonl", "id": 77512, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
