{"task": "rw_103.jsonl", "id": 71548, "text": "Lingxi Mutual Entertainment Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71549, "text": "Update date: July 25, 2022", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71550, "text": "Effective date: July 25, 2022", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71551, "text": "introduction", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71552, "text": "You are welcome to use our products and services!", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71553, "text": "We know the importance of personal information to you. Your trust is very important to us. We will strictly abide by laws and regulations to take corresponding security protection measures to protect your personal information security and controlling.", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71554, "text": "Based on this, the service provider Guangzhou Lingxi Interactive Entertainment Co., Ltd. (referred to as \"Ling Rhino Interoperability\" or \"We\") formulates this \"Ling Rhino Mutual Entertainment Privacy Policy\" (hereinafter referred to as \"this policy\"/\"privacy policy\") to help youFully understand how we use our products and services, how we will collect, use, share, store, and protect your personal information, as well as how you can manage your personal information so that you can make better choices.", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71555, "text": "Before you start using our products and services, please read and understand this policy carefully. In particular, we should focus on reading the clauses we logging in the threatening of the body/coarse body to ensure that you fully understand and agree to use it before starting to use.", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71556, "text": "The professional vocabulary involved in this policy, we try to explain to you in a concise and popular expression in order to facilitate your understanding.", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71557, "text": "If you have any questions, opinions or suggestions on the content of this policy, you can contact us through the contact information at the end of this policy.", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71558, "text": "You agree that the privacy policy said that you have understood the functions provided by the application, and the necessary personal information required for functional operation, and give corresponding collection and use authorization, but it does not mean that you have agreed to open up additional functions and handle non -necessary personal information.The opening, processing non -necessary personal information and processing sensitive personal information, we will solicit your consent separately according to your actual usage.", "label": ["Important", "First Party Collection Information"], "rewrite": "Agree with the privacy policy to indicate the authorization of the necessary personal information to collect and use it accordingly. The opening, processing unnecessary personal information of related additional functions, and processing sensitive personal information will be solicited separately according to the actual usage."}
{"task": "rw_103.jsonl", "id": 71559, "text": "This privacy policy will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71560, "text": "1. Scope of application", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71561, "text": "2. Information collection and use", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71562, "text": "3. Provide information to the outside world", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71563, "text": "Fourth, your rights", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71564, "text": "5. Storage of information", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71565, "text": "6. Policy update", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71566, "text": "7. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71567, "text": "Eight, contact us", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71568, "text": "Appendix: Related Definition", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71569, "text": "1. Scope of application", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71570, "text": "This policy is applicable to the various products and services provided by the new forms provided by the Lingxi Mutual Entertainment Service Providers with new forms that appeared with technology development with the development of technology.", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71571, "text": "If we and related companies have a privacy policy for the products or services it provide to you, the corresponding privacy policies are applicable to the corresponding products or services.", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71572, "text": "2. Information collection and use", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71573, "text": "When you use our products/services, the personal information we need/may need to collect and use includes the following:", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71574, "text": "1. In order to realize the basic functions of providing you with our products and/or services, you must authorize us to collect and use the necessary information.", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71575, "text": "If you refuse to provide the corresponding information, you will not be able to use our products and/or services normally;", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71576, "text": "2. In order to provide you with additional functions to our products and/or services, you can choose to agree or disagree with the information we collected and used alone.", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71577, "text": "If you refuse to provide it, you will not be able to use related additional functions normally or cannot achieve the functional effects we intend to achieve, which will not affect your basic functions.", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71578, "text": "We are here to remind you that we are committed to creating a variety of products and services to meet your needs.", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71579, "text": "Because there are many types and services we provide to you, and there are differences in the scope of the specific product/service selected by different users, the basic/additional functions and the personal information types and scope of personal information and use will be different. Please use specific ones.Product/service function shall prevail.", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71580, "text": "The specific feature scenarios we will provide you include::", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71581, "text": "(1) Help you become our user", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71582, "text": "1. Basic account service", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71583, "text": "We provide you with a service based on the Lingxi Mutual Entertainment account.", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71584, "text": "In order to create a Lingxi Mutual Entertainment account, you need to provide us with at least your mobile phone number and mobile phone verification code/password.", "label": ["Important", "First Party Collection Information"], "rewrite": "Creating Lingxi Mutual Entertainment account requires collecting your mobile phone number and mobile phone verification code/password."}
{"task": "rw_103.jsonl", "id": 71585, "text": "If you refuse to provide the above information, you may not be able to register the Lingxi Mutual Entertainment account.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If you refuse to provide the above information, you may not be able to register the Lingxi Mutual Entertainment account."}
{"task": "rw_103.jsonl", "id": 71586, "text": "If you use Alipay, Taobao, and (or) third -party accounts as associated with the game account login game, we will collect the unique logo, nickname, avatar, and mobile phone number involved in the third -party account number you use to help you complete the registration and login loginAnd realizing a better social experience.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the unique logo, nickname, avatar, and mobile phone number involved in the third -party account you used to complete registration and login."}
{"task": "rw_103.jsonl", "id": 71587, "text": "You can check and manage the above information authorization in a third -party platform.", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71588, "text": "You can choose to fill in gender, region and other information to improve your game account information.", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71589, "text": "2. Real -name authentication", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71590, "text": "In order to meet the requirements of relevant laws, regulations and policies and the requirements of relevant competent authorities, users need to provide real -name certification to continue to use and enjoy game services.", "label": ["Important", "First Party Collection Information"], "rewrite": "Users need to perform real -name authentication to continue to use and enjoy game services."}
{"task": "rw_103.jsonl", "id": 71591, "text": "We will collect your real -name identity information (including name, ID number and other information) when obtaining your consent or active provision. This information is a sensitive personal information. Refusing to provide real -name identity information may cause you to be unable to log in to the game orCorresponding restrictions during the use of the game.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting real -name identity information, refusing to provide real -name identity information may cause unable to log in to the game or be restricted during the use of the game."}
{"task": "rw_103.jsonl", "id": 71592, "text": "(2) Provide you with specific products or services", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71593, "text": "1. In order to ensure that you can use our services normally, the information we need to collect", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71594, "text": "(1) Log information: For example, login log, item log, operating information, game -to -game information, friends list, game process and game collapse record, etc., so that you can view your game history records on the client, and at the same time for customer serviceComplaint processing and other game security analysis (such as testing piracy, plug -in, cheating and other improper behaviors).", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect login logs, item logs, operation information, game -to -game information, friends list, game process and game crash records."}
{"task": "rw_103.jsonl", "id": 71595, "text": "To enhance your game experience, we may synchronize the aforementioned information to the subsequent version of the game.", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71596, "text": "(2) Equipment and network information: device name, equipment type and version, system version, IP address, device recognition symbols (such as IMEI, IMSI, MAC address), application ID, network type and other information to ensure that you use us normally usServing the normal operation of the basic functions of the game.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the equipment name, device type and version, system version, IP address, device recognition symbols (such as IMEI, IMSI, MAC address), application ID, network type and other information."}
{"task": "rw_103.jsonl", "id": 71597, "text": "(3) Payment information: When you use the consumption and recharge function, you can choose Alipay, Huayan, WeChat wallet, QQ wallet, Apple payment for payment (specifically based on the payment channel provided by each game product).", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect payment information."}
{"task": "rw_103.jsonl", "id": 71598, "text": "We will share your game account name, corresponding payment institution account name, order payment related information, order security related equipment information and payment information service provider.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The game account name, corresponding payment institution account name, order payment related information, order security related equipment information and payment information service provider shared."}
{"task": "rw_103.jsonl", "id": 71599, "text": "At the same time, in order to allow us to learn and confirm your payment progress and status in a timely manner, and provide you with customer service and dispute solutions, you agree that we can collect and pay the progress related information from the above payment information services provider.", "label": ["Important", "First Party Collection Information"], "rewrite": "Since the above payment information service provider collects information related to payment progress."}
{"task": "rw_103.jsonl", "id": 71600, "text": "2. To experience more services or functions, you may take the initiative to provide us information", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71601, "text": "(1), we may collect your mobile phone number and email address when you take the initiative to notify the results of the results you participateYou agree to send you game information to you (you can directly withdraw a linked in the mail and SMS).", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your mobile phone number and email."}
{"task": "rw_103.jsonl", "id": 71602, "text": "After you authorize our geographical authority, we will collect your geographical location information to match the most suitable game server so that you can match with nearby players, chat and interact.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "After authorization to agree to use geographical location permissions, collect your geographical location information to match the most suitable game server."}
{"task": "rw_103.jsonl", "id": 71603, "text": "Geographical location information is a sensitive personal information. Rejecting to provide this information will only cause you to be unable to interact with nearby gamers, but it does not affect other functions of your product normally. You can also cancel your geographical location information at any time.", "label": ["Important", "First Party Collection Information", "Edit/Control"], "rewrite": "Refusing to provide geographical location information can only cause the unable to realize the interaction with nearby gamers, but does not affect the normal use of other functions, and you can cancel your geographical location information at any time."}
{"task": "rw_103.jsonl", "id": 71604, "text": "(2) If you want to interact with other game players through text, pictures, voice (if.), After you authorize, the game will access your photos or storage files, microphones, and provide you with it to provide you withScreenshot saving, picture upload, voice chat and other functions.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "After the authorization consent, the game will access your photos or storage files, microphones, and provide screenshots saving, picture uploading, voice chat and other functions."}
{"task": "rw_103.jsonl", "id": 71605, "text": "If you refuse to authorize, you will not be able to use the corresponding function, but it does not affect your normal use of other functions, you can also cancel the relevant authority authorization at any time.", "label": ["Permission Acquisition", "Important", "Edit/Control"], "rewrite": "If the correspondence is rejected, it will not be able to use the corresponding function, but it does not affect the normal use of other functions, and the relevant authority authorization can be canceled at any time."}
{"task": "rw_103.jsonl", "id": 71606, "text": "We may collect the above information in order to preserve and assist you sent the above information. In addition, in order to meet the requirements of relevant laws and regulations and policies, we need to filter improper content such as pornography, violence, politics, abuse, and malicious advertisements to maintain healthy green colorThe game environment.", "label": ["Important", "First Party Collection Information"], "rewrite": "The above information may be collected to save and assist you sent the above information."}
{"task": "rw_103.jsonl", "id": 71607, "text": "(3) Customer service and dispute handling", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71608, "text": "When you contact us or propose the application for sale, after -sales, and dispute dispute handling, in order to ensure your account and system security, we need you to provide the necessary personal information to verify your identity.", "label": ["Important", "First Party Collection Information"], "rewrite": "You need to provide the necessary personal information to verify your identity."}
{"task": "rw_103.jsonl", "id": 71609, "text": "In order to facilitate the processing plan and results of helping you solve the problem or record related issues as soon as possible, we may save your communication, communication/call records and related content (including account information, game process information, to prove to prove to prove it to proveOther information provided by related facts, or contact information you leave).", "label": ["Data Retention", "Important"], "rewrite": "Will collect your communication, communication/call records and related content."}
{"task": "rw_103.jsonl", "id": 71610, "text": "If you consult, complain or provide suggestions for specific payment and recharge, we will use your account information and payment information.", "label": ["Important", "Usage"], "rewrite": "We will use your account information and payment information."}
{"task": "rw_103.jsonl", "id": 71611, "text": "In order to provide reasonable needs for services and improve service quality, we may also use your other information, including the relevant information you provided when you contact the customer service, and the questionnaire reply information sent us when you participate in the questionnaire survey.", "label": ["Important", "Usage"], "rewrite": "Maybe you can use your other information, including the relevant information you provided when you contact the customer service, and you participate in the questionnaire reply information sent during the questionnaire."}
{"task": "rw_103.jsonl", "id": 71612, "text": "(4) Provide you with security guarantee", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71613, "text": "In order to improve the security of your service, protect the safety of personal property of your or other users or the public, and better prevent the risk of fishing websites, fraud, network vulnerabilities, computer viruses, network attacks, network invasion risks, and more accuratelyIdentify the cases and rules that violate laws and regulations or related agreements and rules, and we embed the application security SDK developed by our affiliate company in the application to collect your equipment information and log information, and may use or integrate your membership information and transaction information, Equipment information, log information, and our affiliates and partners obtain information that you authorize or shared according to law (of which, we may collect MAC addresses, IMEI and other device identifiers during the application background operation.Determine your account risk, verify, test and prevent security incidents, and take necessary records, audit, analysis, and disposal measures in accordance with the law.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "In the application, the application security SDK collects device information and log information, and may use or integrate your member information, transaction information, equipment information, log information, and information that our related companies and partners are authorized or shared according to law."}
{"task": "rw_103.jsonl", "id": 71614, "text": "(5) Other additional services provided for you", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71615, "text": "1. Additional services based on system permissions", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71616, "text": "In order to provide you with more convenient and better products and/or services, and strive to improve your experience, we may collect and use your personal information by opening system permissions in the additional service provided to you.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "In additional services, system authority may be enabled to collect and use your personal information."}
{"task": "rw_103.jsonl", "id": 71617, "text": "If you do not agree to start related permissions, it will not affect your basic services to use Lingxi Mutual Entertainment, but you may not be able to obtain the user experience brought by these additional services to you.", "label": ["Permission Acquisition", "Important", "Risk"], "rewrite": "If you do not agree to open the relevant authority, it will not affect the basic services of using Lingxi Mutual Entertainment, but you may not be able to obtain the user experience brought by these additional services."}
{"task": "rw_103.jsonl", "id": 71618, "text": "You can decide these permissions to open or close at any time.", "label": ["Important", "Edit/Control"], "rewrite": "You can decide these permissions to open or close at any time."}
{"task": "rw_103.jsonl", "id": 71619, "text": "Please note that when you start the right of power, it means that you authorize us to collect and use relevant personal information to provide you with corresponding services. Once you turn off the right of power, it means that you cancel the authorization.With relevant personal information, you cannot continue to provide you with the service corresponding to the permissions.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "The opening of one authority means that the authorization can collect and use relevant personal information. Once you turn off the right of permissions, it means that the authorization is canceled, and it will no longer continue to collect and use relevant personal information based on the corresponding permissions."}
{"task": "rw_103.jsonl", "id": 71620, "text": "The decision of your closure authority will not affect the collection and use of information based on your authorization.", "label": ["Permission Acquisition", "Edit/Control", "Risk", "Important"], "rewrite": "The decision to close permissions will not affect the collection and use of information based on authorization."}
{"task": "rw_103.jsonl", "id": 71621, "text": "You can click here to view the application and usage of the application authority of the gaming products of Lingmei Mutual Entertainment.", "label": ["Permission Acquisition", "Important"], "rewrite": "You can click here to view the application and usage of the application authority of the gaming products of Lingmei Mutual Entertainment."}
{"task": "rw_103.jsonl", "id": 71622, "text": "2. Cookie and services of similar technologies", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71623, "text": "Cookie and similar device information identification technology are commonly used in the Internet.", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71624, "text": "When you use our service, we may use related technologies to send one or more, cookie, or anonymous identifiers (hereinafter referred to as \"Cookie\") to collect, identify and store your access, use this product, use this productInformation about time.", "label": ["Data Retention", "Important", "First Party Collection Information"], "rewrite": "May send one or more cookie or anonymous identifiers (hereinafter referred to as \"Cookie\") to collect, identify and store information when you access and use this product."}
{"task": "rw_103.jsonl", "id": 71625, "text": "We promise that cookies will not be used for any other purposes other than the purpose of this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71626, "text": "We use Cookie to ensure the safety and efficient operation of products and services. It can make us confirm the security status of your account and transaction, check the related abnormal conditions of collapse and delay, and help you save the steps of filling in your form and entering search content.And process.", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71627, "text": "3. Provide information to the outside world", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71628, "text": "(1) Sharing", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71629, "text": "We will not share your personal information with companies, organizations, and individuals other than Lingxi Mutual Entertainment, except the following situations:", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Your personal information will not be shared with companies, organizations and individuals other than Lingxi Huyu, except in the following cases:"}
{"task": "rw_103.jsonl", "id": 71630, "text": "1. The sharing necessary for fulfilling the law office: we may share your personal information in accordance with the requirements of laws and regulations, lawsuits, and disputes in accordance with the requirements of administrative and judicial organs in accordance with the requirements of administrative, judicial organs, and other legal obligations.Essence", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Due to the need to fulfill the performers of the legal obligation, share your personal information."}
{"task": "rw_103.jsonl", "id": 71631, "text": "2. Share sharing when you get your consent: After getting your clear consent, we will share your personal information with other parties.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "After getting a clear consent, we will share your personal information with other parties."}
{"task": "rw_103.jsonl", "id": 71632, "text": "3. In order to establish and fulfill your contract as a party as a party: In order to ensure the operation of the game and achieve specific functions, some services in the game are provided by our affiliated parties or other third parties.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "In order to ensure the operation of the game and realize specific functions, some services in the game are provided by our affiliates or other third parties."}
{"task": "rw_103.jsonl", "id": 71633, "text": "We will carefully select third parties and third-party services, and urge relevant third parties to collect and use your personal information in accordance with this Privacy Policy or other agreements with you, and take appropriate security technology and management measures to protect your personal information security .", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Choose third -party and third -party services carefully, and urge relevant third parties to collect and use your personal information in accordance with privacy policies or agreed, and take appropriate security technology and management measures to ensure personal information security."}
{"task": "rw_103.jsonl", "id": 71634, "text": "4. Sharing with affiliated companies: In order to facilitate us to provide some services with you, it provides you with products and services based on the spiritual rhino -entertainment account, and protects the personal property of Lingxi Mutual Entertainment Company or other users or the public.If you are infringed, your personal information may be shared with our affiliated company and/or its designated service providers.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Your personal information may be shared with our affiliated companies and/or its designated service providers."}
{"task": "rw_103.jsonl", "id": 71635, "text": "We will only share necessary personal information and be bound by the purposes stated in this policy. If we share your sensitive personal information or affiliated companies change the use and processing purpose of personal information, we will ask for your authorization again.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Only share the necessary personal information. If the sensitive personal information or related companies we share will change the purpose of use and processing, we will solicit your authorization consent again."}
{"task": "rw_103.jsonl", "id": 71636, "text": "5. Agent product: Our business includes game products issued by agent. We may share your logs and related information (such as logging in logs, etc.) with the development subject or related third parties.Game services to further optimize the user's game experience.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "The logs and related information generated in the shared game with the development subject or related third -party sharing games (such as login logs, etc.) are used for game security analysis."}
{"task": "rw_103.jsonl", "id": 71637, "text": "If we share the aforementioned information, we will take corresponding compliance measures in accordance with relevant laws and regulations to ensure that personal information sharing meets the corresponding laws.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "If the aforementioned information is shared, corresponding compliance measures will be taken in strict accordance with the relevant laws and regulations to ensure that the sharing of personal information complies with the corresponding laws and regulations."}
{"task": "rw_103.jsonl", "id": 71638, "text": "The preceding of the preceding compliance measures include but not limited to the request for the development subject or related third parties to strictly abide by the promise to collect and use your personal information reached by you, and urge the development of the subject or related third parties to adopt appropriate security technology and management measures to ensure youPersonal information security, etc.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "The preceding of the pretends to include but not limited to the required development subject or related third parties to strictly abide by the agreed collection and use your personal information reached with you, and urge the development of the subject or related third parties to adopt appropriate security technology and management measures to ensure personal information security."}
{"task": "rw_103.jsonl", "id": 71639, "text": "6. Advertising push: Some of our game products will provide advertising push services.", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71640, "text": "In order to evaluate and optimize the effect of advertising, we need to share some of your data from third -party partners such as advertisers and agents, and require them to strictly abide by our measures and requirements on data privacy protection, including but not limited to data based on dataProtection agreement, commitment letters and related data processing policies are treated to avoid identifying personal identity and ensuring privacy security.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Share some of your data from third -party partners such as advertisers and agents, asking them to strictly abide by our measures and requirements on data privacy protection."}
{"task": "rw_103.jsonl", "id": 71641, "text": "How to share data with advertisers such as advertisers, please refer to the content disclosed in the SDK details of the product access to each game product of Ling Rhino.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "How to share data with advertisers with third parties such as advertisers, please refer to the content disclosed in the SDK details of the game products connected by the product."}
{"task": "rw_103.jsonl", "id": 71642, "text": "Please note that when you use our service, you voluntarily share or even publicly share information, which may involve your or other people's personal information and even sensitive personal information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "When you use your service, you voluntarily share or even publicly share information, which may involve personal information of you or others and even sensitive personal information."}
{"task": "rw_103.jsonl", "id": 71643, "text": "Please consider and make a decision more cautiously.", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71644, "text": "(2) Entrusted processing", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71645, "text": "We may entrust a partner to handle your personal information in order to authorize partners to represent you to provide you with certain services or fulfilling functions.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "It may be entrusted to authorize partners to handle your personal information so that we can authorize partners to provide you with certain services or performance functions on behalf of us."}
{"task": "rw_103.jsonl", "id": 71646, "text": "We will only entrust their information for the legal, correct, necessary, specific, and clear goals of this policy statement. We can authorize partners to only contact the information required by their duties, and we will ask for the agreement to request that it must not be requiredThis information is used for any other purpose beyond the scope of commission.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Only the legal, correct, necessary, specific, and clear purpose of this policy will commission to process your information."}
{"task": "rw_103.jsonl", "id": 71647, "text": "If the authorized partner will use your information for our unreasonable purpose, it will obtain your consent alone.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If the authorized partner uses the information for our unreasonable use, it will obtain your consent alone."}
{"task": "rw_103.jsonl", "id": 71648, "text": "At present, our authorized partners include the following types:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "At present, our authorized partners include the following types:"}
{"task": "rw_103.jsonl", "id": 71649, "text": "1. Obressive partners of advertising and analysis of service categories.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Advertising and analyzing service partners."}
{"task": "rw_103.jsonl", "id": 71650, "text": "Under the premise of using industry -universal security technology, we will entrust these partners to handle information about advertising, coverage, and effectiveness related to advertising.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Under the premise of using industry -universal security technology, they will commission these partners to handle information about advertising, coverage, and effectiveness related to advertising."}
{"task": "rw_103.jsonl", "id": 71651, "text": "We will not commission your personal identity information to commission partners.", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71652, "text": "2. Suppliers, service providers and other partners.", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71653, "text": "We entrust the information to the suppliers, service providers and other partners who support our business to handle it. These support for the technical infrastructure services that we are entrusted to provide, analyze the usage methods of our services, provide customer service, pay conveniently, or perform academic academic academicsResearch and investigation.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Entrust information to suppliers, service providers and other partners who support our business."}
{"task": "rw_103.jsonl", "id": 71654, "text": "In order to ensure the stable operation and functional implementation of our client, so that you can use and enjoy more services and functions. Our application will embed the SDK or other similar applications of authorized partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Our applications are embedded in SDK or other similar applications of authorized partners."}
{"task": "rw_103.jsonl", "id": 71655, "text": "We will strictly test the application interface (API) and software tool development package (SDK) of the authorized partners to obtain relevant information, and strict data protection measures with the authorized partners, so that it will be in accordance with this policy and any other any otherRelated confidentiality and security measures to handle personal information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "The application interface (API) and software tool development package (SDK) of authorized partners to obtain relevant information will be obtained, and strict data protection measures are provided with authorized partners."}
{"task": "rw_103.jsonl", "id": 71656, "text": "Except for the authorized partners to obtain your consent alone.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Authorized partners obtain your consent alone and no longer agreed with data protection measures."}
{"task": "rw_103.jsonl", "id": 71657, "text": "You can click here to view the SDK details of each game product connection of Lingxi Interactive Entertainment.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You can click here to view the SDK details of each game product connection of Lingxi Interactive Entertainment."}
{"task": "rw_103.jsonl", "id": 71658, "text": "(3) Transfer", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71659, "text": "If we need to transfer personal information for the reasons for merging, separation, dissolution, and declaration of bankruptcy, we will inform you the name or name and contact information of the receiver.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you need to transfer personal information due to merging, separation, dissolution, and declaration of bankruptcy, we will inform the receiver's name or name and contact information."}
{"task": "rw_103.jsonl", "id": 71660, "text": "The receiver will continue to fulfill this policy and other legal obligations.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The receiver will continue to fulfill this policy and other legal obligations."}
{"task": "rw_103.jsonl", "id": 71661, "text": "If the receiver changes the original treatment purpose and method of processing, you will re -obtain your consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If the receiver changes the original treatment purpose and method of processing, you will re -obtain your consent."}
{"task": "rw_103.jsonl", "id": 71662, "text": "(4) Public disclosure", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71663, "text": "We will only publicly disclose your personal information in the following circumstances:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the following circumstances, you will publicly disclose your personal information:"}
{"task": "rw_103.jsonl", "id": 71664, "text": "1. Based on your active choice and other individual consent, we may publicly disclose your personal information;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Based on your active choice and other individual consent, we may publicly disclose your personal information."}
{"task": "rw_103.jsonl", "id": 71665, "text": "2., if we are sure that you have violated laws and regulations or serious violations of related agreements and rules of Lingxi Mutual Entertainment, or to protect the security of the personal property of the human or public or the public, we may disclose your personal information,Including related violations and the measures that Ling Rhino Entertainment have taken you.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may disclose measures about your personal information, including related violations and the measures that Lingxi Mutual Entertainment have taken."}
{"task": "rw_103.jsonl", "id": 71666, "text": "Fourth, your rights", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71667, "text": "You can check and manage your information through the following ways, and we will respond to your request in the case of compliance with laws and regulations:", "label": ["Important", "Edit/Control"], "rewrite": "You can check and manage your information through the following ways, and you will respond to your request in the case of compliance with laws and regulations:"}
{"task": "rw_103.jsonl", "id": 71668, "text": "(1) Review, copy, correct and supplement", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71669, "text": "You have the right to check, copy, correct and supplement your information through the following ways:", "label": ["Important", "Edit/Control"], "rewrite": "You have the right to check, copy, correct and supplement your information through the following ways:"}
{"task": "rw_103.jsonl", "id": 71670, "text": "1., you can query and access your account basic information (avatar, nickname, and personal information you choose to fill in), game historical information (such as character level, achievement, record, and other personal information (avatar, nickname, nickname, nickname, nickname, nickname, nickname, nickname, nickname, nickname, nickname, nickname, nickname, nickname, nickname, nickname, nickname, nickname, nicknames, nicknames, and other personal information you choose.Each product specific game information).", "label": ["Important", "Edit/Control"], "rewrite": "You can query and access your account basic information and game historical information in the Lingxi Mutual Entertainment products you use."}
{"task": "rw_103.jsonl", "id": 71671, "text": "2. You can inquire about the information of the products and services that you use the \"user center\" or \"user\" interface in detail according to the prompts in the actual situation of the product. For details, please see the \"user center\" or \"user\" interface.", "label": ["Edit/Control", "Important"], "rewrite": "In the prompts, please refer to the \"user center\" or \"user\" interface description according to the prompts in the prompts."}
{"task": "rw_103.jsonl", "id": 71672, "text": "3. If you have other doubts or difficulties in the process of checking, replication, correction, and supplementation in the process of using the product, you can also contact us through the contact information described in Article 8.You handle it.", "label": ["Important", "Edit/Control"], "rewrite": "If you have other needs to check, copy, correct, and supplement, contact us through the contact information mentioned in Article 8."}
{"task": "rw_103.jsonl", "id": 71673, "text": "But in order to ensure accounts and personal information security, we may verify your identity and account security status.", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71674, "text": "We will support your reasonable request.", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71675, "text": "We may not be able to respond to your requests that exceed our personal information storage scope, exceed the reasonable limit, or respond to your request that will cause you or other third -party legitimate rights and interests.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Beyond our personal information storage scope, exceeds reasonable limit, or responding to your request will cause your request to respond to the serious damage to other third -party legitimate rights and interests."}
{"task": "rw_103.jsonl", "id": 71676, "text": "(2) Delete and cancel the account", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71677, "text": "You can adjust your information through \"(1) to check, copy, correct, and supplement your information\" columns, or apply for cancellation account to delete all your information.", "label": ["Important", "Edit/Control"], "rewrite": "Adjust part of the information listed by \"(1) to check, copy, correct, and supplement your information\", or apply for a cancellation account to delete all your information."}
{"task": "rw_103.jsonl", "id": 71678, "text": "Because some personal information collection and use of the basic functions corresponding to our services, if you want part to delete, it may cause us to be unable to provide you with services. In this case, if you still want to delete, you can cancel your needs by applying for an account.", "label": ["Important", "Edit/Control"], "rewrite": "If you want part to delete, it may cause us to be unable to provide you with a service. If you still want to delete, you can cancel your needs by applying for an account."}
{"task": "rw_103.jsonl", "id": 71679, "text": "You can apply for a cancellation of your account in the following ways:", "label": ["Edit/Control", "Important"], "rewrite": "You can apply for a cancellation of your account in the following way:"}
{"task": "rw_103.jsonl", "id": 71680, "text": "You can apply for account cancellation at the \"user center\" or \"user\"-\"account cancellation\" or other channels that are notified in the product.", "label": ["Important", "Edit/Control"], "rewrite": "You can apply for account cancellation at the \"user center\" or \"user\"-\"account cancellation\" or other channels that are notified in the product."}
{"task": "rw_103.jsonl", "id": 71681, "text": "You can click on your own address https://appeal.lingxigames.com/aq, and submit the account to cancel the account for the account number in the \"Account Activity Center-Please select the Cause of the Appeal-Logging up the Account\" page according to the instruction.", "label": ["Important", "Edit/Control"], "rewrite": "You can click on your own address https://appeal.lingxigames.com/aq, and submit an account for cancellation application in the \"Account Activity Center-Please select the Reason for Calculating the Account\" page in accordance with the instructions."}
{"task": "rw_103.jsonl", "id": 71682, "text": "You can also apply through customer service to apply for a cancellation of your account.", "label": ["Important", "Edit/Control"], "rewrite": "You can also apply through customer service to apply for a cancellation of your account."}
{"task": "rw_103.jsonl", "id": 71683, "text": "After you take the initiative to cancel your account, we will stop providing you with products or services and delete or process your personal information according to the requirements of applicable laws.", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "After actively canceling the account, it will stop providing you with products or services and delete or processes your personal information."}
{"task": "rw_103.jsonl", "id": 71684, "text": "(3) Change the scope of authorization", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71685, "text": "You can change or withdraw the scope of your personal information in the following ways or withdrawn or process your personal information:", "label": ["Important", "Edit/Control"], "rewrite": "You can change or withdraw the scope of the scope of your personal information in the following ways or withdrawn:"}
{"task": "rw_103.jsonl", "id": 71686, "text": "1., you can use the internal functions of the account, close or open the internal functions of the spiritual rhino -entertainment product, close or open the equipment permissions obtained by specific spiritual rhino -entertainment products (specific permissions are different due to the different equipment models and system versions used by the user, such as:, for example:The iOS system can manage the corresponding device authorization through \"Settings-Privacy\";", "label": ["Important", "Edit/Control"], "rewrite": "You can change the scope of collection and use of personal information by canceling the account of the account, closing or opening the internal function of the product, closing or opening the obtained equipment permissions."}
{"task": "rw_103.jsonl", "id": 71687, "text": "The game in the game through \"more-system-privacy\" to manage the corresponding equipment permissions) to change the scope of authorization to collect and use your personal information.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71688, "text": "2., for the authorization that you cannot directly set in the above method, you can modify it through customer service contact.", "label": ["Edit/Control", "Important"], "rewrite": "For the authorization that you cannot directly set through the above method, you can modify it through customer service contact."}
{"task": "rw_103.jsonl", "id": 71689, "text": "But please note that for some types of personal information, such as the information necessary for the basic functions of the spiritual rhino -entertainment products, or the information required by the obligation stipulated in the law and regulations, we may not be able to respond to your request to change the scope of authorization.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "For some types of personal information, such as the information necessary to implement basic functions, or the information required by the obligations stipulated in the law and regulations, we may not be able to respond to requests that change the scope of authorization."}
{"task": "rw_103.jsonl", "id": 71690, "text": "In this case, if you still want to withdraw relevant authorization, you can cancel the demand through applying for an account.", "label": ["Edit/Control", "Important"], "rewrite": "In this case, if you still want to withdraw relevant authorization, you can cancel the demand through applying for an account."}
{"task": "rw_103.jsonl", "id": 71691, "text": "When you withdraw authorization, we will no longer process the corresponding personal information.", "label": ["Important", "Edit/Control"], "rewrite": "When you withdraw authorization, we will no longer process the corresponding personal information."}
{"task": "rw_103.jsonl", "id": 71692, "text": "But your decision to withdraw authorization will not affect our personal information processing based on your previous authorization.", "label": ["Permission Acquisition", "Edit/Control", "Risk", "Important"], "rewrite": "Your decision to withdraw authorization will not affect our personal information processing we have previously carried out."}
{"task": "rw_103.jsonl", "id": 71693, "text": "(4) respond to your above request", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71694, "text": "For your or your guardians, close relatives, and other authority to make the above requests to us, and your relevant personal information rights stipulated in the laws of the People's Republic of China and other applicable laws, you can contact us through customer service or directly to us to usPersonal information protection full -time departments initiated complaints.", "label": ["Important", "Edit/Control"], "rewrite": "For you, the guardian, close relatives and other subjects with the right to make the above requests to us, and the relevant personal information rights stipulated by the law, you can contact us or directly to protect the full -time department of personal information to protect the full -time department."}
{"task": "rw_103.jsonl", "id": 71695, "text": "We will make a reply within 15 days.", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71696, "text": "To ensure your account security and your personal information security, when you make a request to us, we may verify your identity (such as adding account verification, requesting you to provide written requests or other reasonable ways), and then process youRequest.", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71697, "text": "For your reasonable request, we do not charge fees in principle, but we will charge a certain fee as appropriate for requests that repeat and beyond the reasonable limit.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "For reasonable requests, in principle, no fees are charged, but requests that are repeated and exceeded multiple times will be charged a certain fee as appropriate."}
{"task": "rw_103.jsonl", "id": 71698, "text": "For information that is not directly associated with your identity, the information that is repeatedly applied without reasonable reasons, or you need too many technical means (if you need to develop a new system or change the current convention fundamentally), bring risks to others' legitimate rights or notIn actual requests, we may refuse.", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "For information that is not directly associated with your identity, the information that is repeatedly applied without reasonable reasons, or if you need too much technical means, bring risks or unrealistic requests to others' legitimate rights and interests, you may refuse."}
{"task": "rw_103.jsonl", "id": 71699, "text": "5. Storage of information", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71700, "text": "(1) Storage period", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71701, "text": "We will only retain your personal information within the time limit of the cost of reaching the cost of the cost, unless the law has compulsory retention requirements.", "label": ["Data Retention", "Important"], "rewrite": "It will only retain personal information within the period required for the purpose of the cost of reaching the cost of the cost, unless the law has a compulsory retention requirement."}
{"task": "rw_103.jsonl", "id": 71702, "text": "If we terminate our services or operations, we will stop collecting your personal information activities in time, and at the same time, we will comply with relevant laws and regulations to inform you in advance.", "label": ["Important", "First Party Collection Information", "Cessation of Operations"], "rewrite": "If you terminate services or operations, you will stop collecting your personal information in a timely manner, and you will notify you in advance."}
{"task": "rw_103.jsonl", "id": 71703, "text": "We judge the storage period of personal information mainly based on the following standards:", "label": ["Data Retention", "Important"], "rewrite": "The storage period for judging personal information is mainly based on the following standards:"}
{"task": "rw_103.jsonl", "id": 71704, "text": "1. Complete your related transaction purpose, maintain the corresponding transactions and business records to cope with your possible queries or complaints;", "label": ["Data Retention", "Important"], "rewrite": "Determine the storage period based on the completion of the transaction purpose, maintaining the corresponding transactions and business records."}
{"task": "rw_103.jsonl", "id": 71705, "text": "2. Make sure we provide you with service safety and quality;", "label": ["Data Retention", "Important"], "rewrite": "To ensure the safety and quality of services for you, we can judge the storage period as a standard."}
{"task": "rw_103.jsonl", "id": 71706, "text": "3. Do you agree to a longer retention period;", "label": ["Data Retention", "Important"], "rewrite": "Do you agree to a longer retention period and judge the storage period as a standard."}
{"task": "rw_103.jsonl", "id": 71707, "text": "4. Whether there are other special agreement or laws and regulations on the retention period (such as: the provisions of the timeliness of litigation in the Civil Code).", "label": ["Data Retention", "Important"], "rewrite": "Whether there are other special agreements or laws and regulations on the retention period, as a standard judge the storage period."}
{"task": "rw_103.jsonl", "id": 71708, "text": "After exceeding the reservation or termination service/operation, we will delete or proces your personal information according to the requirements of applicable laws.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "After exceeding the reservation or termination service/operation, delete or anonymous processing your personal information."}
{"task": "rw_103.jsonl", "id": 71709, "text": "(2) Storage location", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71710, "text": "The personal information we collected and generated in the operation of the People's Republic of China will be stored in China.", "label": ["Data Retention", "Important"], "rewrite": "The personal information we collected and generated in the operation of the People's Republic of China will be stored in China."}
{"task": "rw_103.jsonl", "id": 71711, "text": "In the following circumstances, we will provide your personal information to possible overseas entities after fulfilling the obligations stipulated in the law:", "label": ["Data Retention", "Important", "Risk"], "rewrite": "In the following circumstances, after fulfilling the obligations stipulated in the law, you will provide your personal information to possible overseas entities:"}
{"task": "rw_103.jsonl", "id": 71712, "text": "1. The applicable laws have clear regulations;", "label": ["Data Retention", "Important", "Risk"], "rewrite": "Applicable laws have clearly stipulated and provided personal information to overseas."}
{"task": "rw_103.jsonl", "id": 71713, "text": "2. Get your alone consent;", "label": ["Data Retention", "Important", "Risk"], "rewrite": "Get your individual consent and provide personal information to overseas."}
{"task": "rw_103.jsonl", "id": 71714, "text": "3., you are necessary for cross -border e -commerce transactions and other types of contracts for one party.", "label": ["Data Retention", "Important", "Risk"], "rewrite": "As a partner, you are necessary for cross -border e -commerce transactions and other types of contracts for the establishment and other types of contracts, and provide personal information to overseas."}
{"task": "rw_103.jsonl", "id": 71715, "text": "In response to the above situations, we will protect your personal information security in accordance with this policy.", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71716, "text": "(3) Storage safety", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71717, "text": "1. Data protection technical measures", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71718, "text": "We have adopted our information that meets industry standards, reasonable and feasible security measures to protect your information, and prevent personal information from being disclosed, used, modified, damaged or lost by unauthorized access, publicly disclosed, used, modified, damaged, or lost.", "label": ["Important", "Data Security"], "rewrite": "It has adopted the industry's standards, reasonable and feasible security measures to protect your information, and prevent personal information from being disclosed, publicized, modified, damaged or lost by unauthorized access, publicly disclosing, use, modification, damage or loss."}
{"task": "rw_103.jsonl", "id": 71719, "text": "For example, the technical means we use include, but not limited to firewalls, encryption (such as SSL), de -identification or anonymous treatment, etc.;", "label": ["Important", "Data Security"], "rewrite": "The technical means we use include but not limited to firewalls, encryption (such as SSL), de -identification or anonymous treatment."}
{"task": "rw_103.jsonl", "id": 71720, "text": "We will use a trusted protection mechanism to prevent personal information from being maliciously attacked;", "label": ["Important", "Data Security"], "rewrite": "We will use a trusted protection mechanism to prevent personal information from being maliciously attacked."}
{"task": "rw_103.jsonl", "id": 71721, "text": "We will deploy the access control mechanism to make every effort to ensure that only authorized personnel can access personal information.", "label": ["Important", "Data Security"], "rewrite": "We will deploy the access control mechanism to make every effort to ensure that only authorized personnel can access personal information."}
{"task": "rw_103.jsonl", "id": 71722, "text": "2. Measures for data protection management organization", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71723, "text": "We have established a data security management system that is advanced in the industry with data as the core and the data security management system around the data life cycle, and improves the security of personal information from organizational construction, institutional design, personnel management and product technology.", "label": ["Important", "Data Security"], "rewrite": "Establish a data security management system that is advanced in the industry with data as the core and data life cycle."}
{"task": "rw_103.jsonl", "id": 71724, "text": "We have set up a full -time department for personal information protection.", "label": ["Important", "Data Security"], "rewrite": "We have set up a full -time department for personal information protection."}
{"task": "rw_103.jsonl", "id": 71725, "text": "Through training courses and examinations, we have continuously strengthened employees' awareness of protecting the importance of personal information.", "label": ["Important", "Data Security"], "rewrite": "Through training courses and examinations, we have continuously strengthened employees' awareness of protecting the importance of personal information."}
{"task": "rw_103.jsonl", "id": 71726, "text": "3. Response of personal information security incident", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71727, "text": "If our physical, technical, or management protection facilities are damaged, and the information is caused by unauthorized access, public disclosure, tampering or destruction, and damage to your legitimate rights and interests, we will launch an emergency plan in time and take reasonable and necessary measures.In order to reduce the impact on your personal.", "label": ["Important", "Data Security"], "rewrite": "If your legitimate rights and interests are damaged, the emergency plan will be initiated in a timely manner, and reasonable and necessary measures will be taken to minimize the impact on your personal."}
{"task": "rw_103.jsonl", "id": 71728, "text": "If a personal information security incident occurs, we will also inform you the basic situation and possible impact of the security incident in accordance with the requirements of the laws and regulations.Remedy.", "label": ["Important", "Data Security"], "rewrite": "If a personal information security incident occurs, we will also inform you in accordance with the requirements of laws and regulations."}
{"task": "rw_103.jsonl", "id": 71729, "text": "We will inform you in SMS, telephone, push notification, and other reasonable channels that it is difficult to inform one by one. We will publish an announcement in a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "We will inform you in a reasonable channel that it is difficult to inform them one by one, and we will publish an announcement in a reasonable and effective way."}
{"task": "rw_103.jsonl", "id": 71730, "text": "At the same time, we will also report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "We will also report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities."}
{"task": "rw_103.jsonl", "id": 71731, "text": "4. Prevention of account security risk", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71732, "text": "When using and enjoying game interactive services, you inevitably disclose your account and game information to other players or friends (account avatars, character names, levels, achievements, records).", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When using and enjoying game interactive services, it is inevitable to disclose his account and game information to other players or friends."}
{"task": "rw_103.jsonl", "id": 71733, "text": "In addition, you can also establish communication, exchange information or analysis content with our services.", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71734, "text": "Please protect your personal information properly, provides others only under the necessary circumstances, and do not trust the transaction through other trading tools to avoid the stolen information or even encounter telecommunications network fraud.", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71735, "text": "If you are worried about your personal information, especially your account or password, please contact our customer service immediately so that we can take corresponding measures based on your application.", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71736, "text": "6. Policy update", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71737, "text": "In order to bring you a better product and service experience, we continue to strive to improve our products, services and technology.", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71738, "text": "When the new service and business processes change, we may update our privacy policy to inform you of specific changes.", "label": ["Policy Change", "Important"], "rewrite": "When the new service and business processes are changed, our privacy policy may be updated to inform you of specific changes."}
{"task": "rw_103.jsonl", "id": 71739, "text": "But without your clear consent, we will not limit your rights you enjoy in accordance with this policy.", "label": ["Policy Change", "Important"], "rewrite": "But without your clear consent, we will not limit your rights you enjoy in accordance with this policy."}
{"task": "rw_103.jsonl", "id": 71740, "text": "We will release any changes to this policy on the special page.", "label": ["Policy Change", "Important"], "rewrite": "We will release any changes to this policy on the special page."}
{"task": "rw_103.jsonl", "id": 71741, "text": "For major changes, we will also provide more significant notifications (including we will notify the official website and the game or provide you with pop -up window prompts).", "label": ["Policy Change", "Important"], "rewrite": "For major changes, we will also provide more significant notifications (including we will notify the official website and the game or provide you with pop -up window prompts)."}
{"task": "rw_103.jsonl", "id": 71742, "text": "The major changes in this policy include, but not limited to:", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71743, "text": "1. The business model of the product has changed significantly.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71744, "text": "Such as the purpose of handling personal information, the type of personal information, and the use of personal information;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71745, "text": "2. The main body of the privacy policy caused by business adjustment and transaction mergers and acquisitions, and the new subject receiving party changes the original processing purpose and method of treatment;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71746, "text": "3. The main object of personal information sharing or public disclosure changes;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71747, "text": "4. User personal information rights and their exercise methods have changed significantly;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71748, "text": "5. When dealing with the person in charge of the person in charge of the personal information protection and the change of complaint channels;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71749, "text": "6. Personal information protection assessment report shows that the existence of products has a significant impact on personal rights.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71750, "text": "7. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71751, "text": "In gaming entertainment activities, we preferably you have the corresponding civil behavior capabilities.", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71752, "text": "If you are a minor, we ask you to ask your parents or other guardians to read this policy carefully, and use our services or provide information to us under the consent of your parents or other guardians.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a minor, we ask the guardian to read this policy carefully and use our services or provide information to us under the premise of obtaining the consent of the guardian."}
{"task": "rw_103.jsonl", "id": 71753, "text": "If you are under 14 years of age, before you use our service, you and your guardian should read our \"Personal Information Protection Rules\" that we specially formulates to ensure that the guardian's guardian's personal information protection rules are obtained.After agreeing, you can use our services under the guidance of the guardian to ensure that you are safe when using our services and trading.", "label": ["Important", "Edit/Control"], "rewrite": "You and the guardian should read the \"Personal Information Protection Rules\" carefully before using services under the age of 14 to ensure that you can use services under the guidance of the guardian after obtaining the consent of the guardian."}
{"task": "rw_103.jsonl", "id": 71754, "text": "If you are a child's parents or other guardians, please pay attention to whether the child uses our service after obtaining your authorization consent.", "label": ["Important", "Edit/Control"], "rewrite": "If you are a child's parents or other guardians, please pay attention to whether the child uses our service after obtaining your authorization consent."}
{"task": "rw_103.jsonl", "id": 71755, "text": "If you have any questions about your child's personal information, please contact our personal information protection department.", "label": ["Important", "Edit/Control"], "rewrite": "If you have any questions about your child's personal information, please contact our personal information protection department."}
{"task": "rw_103.jsonl", "id": 71756, "text": "Eight, contact us", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71757, "text": "You can contact us in the following ways. We will reply to your request within 15 days:", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71758, "text": "1. If you have any questions, opinions or suggestions on the content of this policy, you can pass the online customer service in the game, call our customer service phone (0571-26884478) or send an email to kfzx@lingxigames.com, and at any timeconnect;", "label": ["Important", "Contact Information"], "rewrite": "You can pass online customer service in the game, call our customer service phone (0571-26884478) or send emails to kfzx@lingxigames.com."}
{"task": "rw_103.jsonl", "id": 71759, "text": "2. We have also set up a full -time information protection department for personal information. You can contact us through privacy_lx@lingxigames.com (please indicate specific game products and explain the specific facts).Room 621, No. 38 Pu Road.", "label": ["Important", "Contact Information"], "rewrite": "You can contact us through privacy_lx@lingxigames.com, office address: Room 621, No. 38 Gaopu Road, Gaopu Road, Tianhe District, Guangzhou."}
{"task": "rw_103.jsonl", "id": 71760, "text": "It should be noted that we may not reply to the issue that has nothing to do with the right to this policy or your personal information.", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71761, "text": "If you are not satisfied with our reply, especially if you think our personal information processing behavior has harm your legitimate rights and interests, you can also seek solutions by filed a lawsuit to a court with jurisdiction in the place of residence in the defendant.", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71762, "text": "Appendix: Related Definition", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71763, "text": "Related company: It refers to the legal heirs, legal institutions, or the above -mentioned companies and legal institutions that are controlled, controlled or controlled by one party in the future.", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71764, "text": "Control refers to (1) directly or indirectly holding more than half of the voting rights;", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71765, "text": "Or (2) directly or indirectly enjoy more than half of the distribution profits;", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71766, "text": "Or (3) the composition of more than half of the members of the board of directors directly or indirectly;", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71767, "text": "Or (4) Half of the registered capital directly or indirectly.", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71768, "text": "Personal information: Various information related to the recognized or recognized natural persons recorded in electronics or other ways, excluding information after anonymous processing.", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71769, "text": "Sensitive personal information: Once sensitive personal information is leaked or illegally, it is easy to lead to personal information that is harmful to natural person's personality dignity or personality and property security.Track information, and personal information of minors under the age of 14.", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71770, "text": "Child: Refers to minors under the age of 14.", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71771, "text": "Equipment information: Including device identifier (IMEI, IDFA, Android ID, Mac, OAID, IMSI, BSSID, SSID, MEID, SIM card serial number), application information (application crash information, notification switch status, application installation list, other applications, other applications, other applications, other applications, other applications, other applications, other applications, other applications, other applications, other applications, other applications, other applications, other applications, and other applications.Related information), device parameters and system information (device type, equipment model, operating system and hardware -related information), device network environment information (IP address, WIFI information, base station information and other network -related information).", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71772, "text": "The actual collection of the product shall prevail.", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71773, "text": "Log information: Including login logs, items logs, operating information, game -to -game information, dating records, browsing records, click to view records, search query records, follow sharing information, publish information, and IP address, device type, telecommunications operator,Use language, visit date and time.", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71774, "text": "Decoration: Refers to the process of personal information processing, so that it cannot recognize specific natural persons without using additional information.", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71775, "text": "Anonymous: Refers to the process that personal information cannot identify specific natural persons and cannot recover.", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71776, "text": "<it is delimiter>", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71777, "text": "Taobao children's personal information protection rules and guardian notes", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71778, "text": "Latest version Effective Date: August 12, 2020", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71779, "text": "Taobao service provider (or \"we\") knows the importance of personal information security and privacy for the protection of children (referring to minors under the age of 14).", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71780, "text": "On the basis of \"Privacy Policy\", we hope that through the \"Taobao Children's Personal Information Protection Rules and Guardian Notes\" (hereinafter referred to as \"this policy\"), we show that we correspond to related matters such as collecting and using the personal information of children.Essence", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71781, "text": "As your child's parents or other guardians (hereinafter referred to as \"guardian\"), please or your child to use Taobao's products and services (define the \"Privacy Policy\", hereby collectively referred to \"Our products and services\") Be sure to read carefully and thoroughly understand this policy, especially the terms of the definition logo logo under the thick body/bodies should be read. After confirming and agreeing to fully understand and agree to all the terms, you should start using or allow your child to use.", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71782, "text": "Special description of the guardian:", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71783, "text": "Your understanding and cooperation is very necessary for our children's personal information and privacy security. In order to protect your child's legitimate rights and interests, we hope that you can help us to ensure that your child uses our products and under your consent and guidanceService and submit personal information to us.", "label": ["First Party Collection Information", "Specific Audiences"], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71784, "text": "We will take special measures based on this policy to protect the personal information of your child.", "label": ["Specific Audiences", "Important"], "rewrite": "We will take special measures based on this policy to protect the personal information of your child."}
{"task": "rw_103.jsonl", "id": 71785, "text": "If you do not agree with the content of this policy, please ask your children to stop access/use our products and services immediately.", "label": ["Specific Audiences", "Important"], "rewrite": "If you do not agree with the content of this policy, please ask your children to stop access/use our products and services immediately."}
{"task": "rw_103.jsonl", "id": 71786, "text": "Children's special description:", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71787, "text": "Any child should obtain the consent of the guardian in advance.", "label": ["Specific Audiences", "Important"], "rewrite": "Any child should obtain the consent of the guardian in advance."}
{"task": "rw_103.jsonl", "id": 71788, "text": "If you are a child, be sure to notify your guardian to read this policy together, and seek the consent and guidance of your guardian before you use our products and services and submit personal information.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a child, be sure to notify the guardian to read this policy together. Before you use the products and services and submit personal information, seek the consent and guidance of your guardian."}
{"task": "rw_103.jsonl", "id": 71789, "text": "This policy applies to our collection, storage, use, transfer, sharing and disclosure of children's personal information through the Internet within the territory of the People's Republic of China.", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71790, "text": "This policy is a special rules formulated on the basis of the Privacy Policy, and it is not consistent with the \"Privacy Policy\", which is subject to this policy;", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71791, "text": "Where this policy is not stated, refer to the \"Privacy Policy\".", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71792, "text": "After you read this policy, if you have any problems with this policy or related matters related to this policy, you can contact us through the feedback channels listed in the chapter listed in the chapter of this policy, and we will answer it for you as soon as possible.", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71793, "text": "This policy will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71794, "text": "1. How do we collect and use personal information", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71795, "text": "2. How can we share, transfer, and publicly disclose children's personal information", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71796, "text": "3. How do we store personal information of children", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71797, "text": "4. How do we protect personal information of children", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71798, "text": "5. How to manage children's personal information", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71799, "text": "6. The revision of this policy", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71800, "text": "Seven, how to contact us", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71801, "text": "1. How do we collect and use personal information", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71802, "text": "(1) We will strictly fulfill the obligations and responsibilities of children's personal information protection stipulated in laws and regulations, and follow the principles of legitimate necessity, knowledge consent, clear purpose, security, and use according to law.Essence", "label": ["Specific Audiences", "Data Security", "Important"], "rewrite": "We will strictly fulfill the obligations and responsibilities of personal information protection, follow the principles of legitimate necessity, consent of knowledge, clear purpose, security, and use according to law."}
{"task": "rw_103.jsonl", "id": 71803, "text": "You take the initiative to provide us your children's personal information in using our products or services. For exampleWe have agreed to collect and use your child's personal information according to the content of this policy.", "label": ["Policy Change", "Specific Audiences", "Important"], "rewrite": "When you actively provide us with your child's personal information when using products or services, it means that you have agreed to our collection and use of your child's personal information."}
{"task": "rw_103.jsonl", "id": 71804, "text": "(2) When you or your children are using our products and services, we will provide you or your children with our products and services (such as providing personalized display or recommendation and providing security for your account, etc.) We may also collect and use other childrens personal information. For the specific purpose of use, the scope of collecting personal information, and the consequences of refusing to provide the corresponding information, please refer to the \"Privacy Policy\", \"How We Collect and Use Your Personal Information Information\" section for details.", "label": ["Specific Audiences", "First Party Collection Information", "Important"], "rewrite": "We will also collect and use personal information of other children, about the specific purpose of use, the scope of collecting personal information, and the consequences of refusing to provide corresponding information. Please check the \"Privacy Policy\"."}
{"task": "rw_103.jsonl", "id": 71805, "text": "In addition, we will automatically collect your personal information through Cookies, SDK and other similar technologies. For details, please check the \"Privacy Policy\", \"How can we use cookies and similar technologies\" to learn more about it.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will also automatically collect your or your child's personal information through cookies, SDK, etc."}
{"task": "rw_103.jsonl", "id": 71806, "text": "If we need to collect and use the personal information of the children, we will once again obtain the consent of the guardian.", "label": ["Specific Audiences", "Important", "First Party Collection Information"], "rewrite": "If we need to collect and use the personal information of the children, we will once again obtain the consent of the guardian."}
{"task": "rw_103.jsonl", "id": 71807, "text": "Please note that in most cases, we cannot recognize whether the personal information that is collected and processed is a personal information of children. We will collect and process user personal information according to the Privacy Policy.", "label": ["Important", "First Party Collection Information"], "rewrite": "In most cases, we cannot identify and do not judge whether personal information is a personal information of children, and will collect and process user personal information in accordance with the \"Privacy Policy\"."}
{"task": "rw_103.jsonl", "id": 71808, "text": "(3) Exceptions to obtaining authorization and consent", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71809, "text": "According to relevant laws and regulations, the information collected in the following situations does not need to obtain the authorization consent of the child's guardian:", "label": ["Specific Audiences", "First Party Collection Information", "Risk", "Important"], "rewrite": "In the following circumstances, the information of children's information is not required to obtain the consent of the child guardian:"}
{"task": "rw_103.jsonl", "id": 71810, "text": "1. Related to the obligations stipulated in the performance of our laws and regulations;", "label": ["Specific Audiences", "First Party Collection Information", "Risk", "Important"], "rewrite": "Collection of children's information related to our obligations stipulated in our laws and regulations does not need to agree."}
{"task": "rw_103.jsonl", "id": 71811, "text": "2. It is related to national security, national defense safety, public safety, public health, and major public interests;", "label": ["Risk", "Specific Audiences", "First Party Collection Information", "Important"], "rewrite": "Collection of children's information related to national security, national defense security, public safety, public health, and major public interests does not require consent."}
{"task": "rw_103.jsonl", "id": 71812, "text": "3. It is related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Risk", "Specific Audiences", "First Party Collection Information", "Important"], "rewrite": "Collection of children's information related to criminal investigation, prosecution, trial, and execution of judgments does not need to agree."}
{"task": "rw_103.jsonl", "id": 71813, "text": "4. For major legitimate rights and interests such as maintaining children's life, property, etc., it is difficult to obtain the consent of the guardian;", "label": ["Specific Audiences", "First Party Collection Information", "Risk", "Important"], "rewrite": "Collecting major legitimate rights and interests such as maintaining children's lives, property, etc., but it is difficult to obtain the consent of the guardian, no consent is required."}
{"task": "rw_103.jsonl", "id": 71814, "text": "5. The collected information is made to the public by children or guardians;", "label": ["Specific Audiences", "First Party Collection Information", "Risk", "Important"], "rewrite": "The collected information is disclosed to the public by children or guardians without consent."}
{"task": "rw_103.jsonl", "id": 71815, "text": "6. Collecting information from legally disclosed information, such as legal news reports, government information disclosure and other channels;", "label": ["Specific Audiences", "First Party Collection Information", "Risk", "Important"], "rewrite": "Children's information is collected from the legal disclosure information, no consent is required."}
{"task": "rw_103.jsonl", "id": 71816, "text": "7. Conside the signing and fulfilling related agreements or other written documents with you or your child;", "label": ["Specific Audiences", "First Party Collection Information", "Risk", "Important"], "rewrite": "Collecting the children's information necessary for signing and fulfilling written documents with you or children, there is no need to agree."}
{"task": "rw_103.jsonl", "id": 71817, "text": "8. It is necessary to maintain the safe and stable operation of our products and services, such as discovering and handling failures of our products and services;", "label": ["Specific Audiences", "First Party Collection Information", "Risk", "Important"], "rewrite": "Collecting children's information necessary to maintain the safe and stable operation of products and services does not require consent."}
{"task": "rw_103.jsonl", "id": 71818, "text": "9. When academic research institutions need to carry out statistics or academic research based on public interests, and provide academic research or description results, the information contained in the result is identified by", "label": ["Specific Audiences", "First Party Collection Information", "Risk", "Important"], "rewrite": "Collection of children's information necessary for academic research institutions to conduct statistical or academic research based on public interests does not require consent."}
{"task": "rw_103.jsonl", "id": 71819, "text": "10. Other circumstances stipulated by laws and regulations.", "label": ["Specific Audiences", "First Party Collection Information", "Risk", "Important"], "rewrite": "Collecting children's information under other circumstances stipulated by laws and regulations does not require consent."}
{"task": "rw_103.jsonl", "id": 71820, "text": "2. How can we share, transfer, and publicly disclose children's personal information", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71821, "text": "We promise to keep children's personal information strictly confidential, and only share children's personal information externally in accordance with this policy and your explicit authorization and consent.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Important"], "rewrite": "It is promised to strictly confidential children's personal information, and sharing personal information from the outside world only in accordance with the explanation of this policy and clearly authorized consent."}
{"task": "rw_103.jsonl", "id": 71822, "text": "In order to improve the efficiency of information processing, reduce the cost of information processing, or improve the accuracy of information processing, we may entrust competent our affiliated companies or other professional institutions to process children's personal information on our behalf. For details, please refer to the \"Privacy Policy\", \"How We Share, Transfer, and Publicly Disclose Your Information\" section.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Important"], "rewrite": "We may entrust a capable affiliate or other professional institutions on behalf of us to handle personal information of children."}
{"task": "rw_103.jsonl", "id": 71823, "text": "In addition to the content described in the \"How We Share, Transfer, and Publicly Disclose Your Information\" section of the \"Privacy Policy\", for children's personal information, we will also take the following measures to protect children's personal information during sharing, transfer, and public disclosure. Safety in process:", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Data Security", "Important"], "rewrite": "For children's personal information, the following measures will be taken to protect the safety of children's personal information during sharing, transfer and public disclosure:"}
{"task": "rw_103.jsonl", "id": 71824, "text": "1. If it is necessary to share children's personal information with a third party for the purposes described in this policy, we will evaluate the legality, legitimacy, and necessity of the third party's collection of children's personal information.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Data Security", "Important"], "rewrite": "We will evaluate the legality, legitimacy, and necessity of the third party's collection of children's personal information."}
{"task": "rw_103.jsonl", "id": 71825, "text": "2. We will require third parties to take protective measures for children's personal information and strictly abide by relevant laws, regulations and regulatory requirements.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Data Security", "Important"], "rewrite": "We will require third parties to take protective measures for children's personal information and strictly abide by relevant laws, regulations and regulatory requirements."}
{"task": "rw_103.jsonl", "id": 71826, "text": "We will require third parties receiving children's personal information to abide by strict confidentiality obligations and take effective confidentiality measures, prohibit them from using such children's personal information for purposes not authorized by children and their guardians, and require the entrusted company to perform the following obligations in accordance with the law:", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Data Security", "Important"], "rewrite": "We will require the third party to abide by strict confidentiality obligations and take confidentiality measures, prohibit them from using the children's personal information for unauthorized purposes, and require the entrusted company to fulfill the following obligations in accordance with the law:"}
{"task": "rw_103.jsonl", "id": 71827, "text": "(1) Process children's personal information in accordance with laws, administrative regulations and our requirements;", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Data Security", "Important"], "rewrite": "The entrusted company is required to process children's personal information in accordance with laws, administrative regulations and our requirements."}
{"task": "rw_103.jsonl", "id": 71828, "text": "(2) To assist us in responding to applications from guardians of children;", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Data Security", "Important"], "rewrite": "The entrustment company is required to assist us in response to the application made by the child's guardian."}
{"task": "rw_103.jsonl", "id": 71829, "text": "(3) Take measures to ensure information security, and report to us in a timely manner in the event of a childs personal information leakage security incident;", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Data Security", "Important"], "rewrite": "The trustees are required to take measures to ensure information security and timely feedback to us when the child personal information leakage is leaked."}
{"task": "rw_103.jsonl", "id": 71830, "text": "(4) Remove the child's personal information in time when the commission relationship is lifted;", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Data Security", "Important"], "rewrite": "The entrusted company is required to delete the child's personal information in a timely manner when the entrusted relationship is terminated."}
{"task": "rw_103.jsonl", "id": 71831, "text": "(5) Do not transfer to commission;", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Data Security", "Important"], "rewrite": "The entrusted company is required not to transfer the entrustment."}
{"task": "rw_103.jsonl", "id": 71832, "text": "(6) Other personal information protection obligations that should be fulfilled in accordance with the law.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Data Security", "Important"], "rewrite": "The entrusted company is required to fulfill the personal information protection obligations that should be fulfilled in accordance with the law."}
{"task": "rw_103.jsonl", "id": 71833, "text": "3. In addition, we will obtain your consent in accordance with the requirements of laws and regulations, or confirm that the third party has obtained your consent.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Data Security", "Important"], "rewrite": "We will obtain your consent in accordance with the requirements of laws and regulations, or confirm that the third party has obtained your consent."}
{"task": "rw_103.jsonl", "id": 71834, "text": "3. How do we store personal information of children", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71835, "text": "(1) The personal information of the child collected and generated in the operation of the People's Republic of China will be stored in China.", "label": ["Data Retention", "Specific Audiences", "Important"], "rewrite": "The personal information of children collected and generated in the operation of the People's Republic of China will be stored in China."}
{"task": "rw_103.jsonl", "id": 71836, "text": "In the following circumstances, after fulfilling the obligations stipulated in the law, we will provide personal information of children to overseas organizations or individuals:", "label": ["Data Retention", "Specific Audiences", "Risk", "Important"], "rewrite": "Under the following circumstances, children's personal information will be provided to overseas organizations or individuals after fulfilling the obligations stipulated by law:"}
{"task": "rw_103.jsonl", "id": 71837, "text": "1. Applicable laws have clear regulations;", "label": ["Data Retention", "Specific Audiences", "Risk", "Important"], "rewrite": "Applicable laws have clearly stipulated and provided personal information to overseas."}
{"task": "rw_103.jsonl", "id": 71838, "text": "2. Get your clear authorization;", "label": ["Data Retention", "Specific Audiences", "Risk", "Important"], "rewrite": "Obtain your explicit authorization to provide children's personal information overseas."}
{"task": "rw_103.jsonl", "id": 71839, "text": "3. You or your children actively actively conduct cross -border transactions through the Internet.", "label": ["Data Retention", "Specific Audiences", "Risk", "Important"], "rewrite": "You or children conduct personal active behaviors such as cross -border transactions through the Internet and provide personal information to children overseas."}
{"task": "rw_103.jsonl", "id": 71840, "text": "In response to the above situations, we will ensure that personal information that protects children at a degree of less than the degree specified in this policy.", "label": ["Specific Audiences", "Data Security", "Important"], "rewrite": "In view of the above situations, we will ensure the protection of children's personal information to a degree not lower than that stipulated in this policy through contracts and other forms."}
{"task": "rw_103.jsonl", "id": 71841, "text": "(2) We will take reasonable and feasible measures to avoid collecting and handling personal information of children with irrelevant children.", "label": ["Specific Audiences", "Data Security", "Important"], "rewrite": "We will take measures to avoid collecting and processing irrelevant children's personal information."}
{"task": "rw_103.jsonl", "id": 71842, "text": "We will only retain children's personal information for the period necessary to achieve the purposes stated in this policy, unless there is a mandatory retention requirement by law.", "label": ["Data Retention", "Specific Audiences", "Important"], "rewrite": "We will only retain children's personal information for the period necessary to achieve the purposes stated in this policy, unless there is a mandatory retention requirement by law."}
{"task": "rw_103.jsonl", "id": 71843, "text": "For how we determine the storage period of children's personal information, please refer to the \"Privacy Policy\" \"How do we protect your information\".", "label": ["Data Retention", "Specific Audiences", "Important"], "rewrite": "For how to determine the storage period of children's personal information, see the \"Privacy Policy\" \"How do we protect your information\"."}
{"task": "rw_103.jsonl", "id": 71844, "text": "If we terminate our services or operations, we will stop the activities of children's personal information in a timely manner. At the same time, we will comply with relevant laws and regulations to notify the guardian in advance, and delete or processes children's personal information after termination of the service or operation.However, except for laws and regulations or regulatory departments.", "label": ["Specific Audiences", "Cessation of Operations", "Important"], "rewrite": "If you terminate services or operations, you will stop collecting children's personal information in a timely manner. At the same time, it will notify the guardian in advance, and delete or anonymous treatment after terminating services or operations, except for laws and regulations or regulators."}
{"task": "rw_103.jsonl", "id": 71845, "text": "4. How do we protect personal information of children", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71846, "text": "We attach great importance to children's privacy and safety, and take all reasonable and feasible measures to protect children's personal information:", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71847, "text": "(1) We will strictly control the access authority of children's personal information, and take the minimum of sufficient authorization principles to the staff who may contact the personal information of the child, and take technical measures to record and control the behavior of the staff to handle the personal information of children to avoid the staff to avoid the child's personal information.Copy and download personal information of children.", "label": ["Specific Audiences", "Data Security", "Important"], "rewrite": "It will strictly control the access authority of children's personal information, take the minimum principle of authorization, and use technical measures to record and control to avoid illegal replication and download children's personal information."}
{"task": "rw_103.jsonl", "id": 71848, "text": "(2) We have developed emergency plans for children's personal information security incidents. We will regularly organize internal personnel to conduct emergency response training and emergency drills to master their job responsibilities and emergency disposal strategies and regulations.", "label": ["Specific Audiences", "Data Security", "Important"], "rewrite": "We have developed an emergency plan for children's personal information security incidents, and regularly organize internal personnel to conduct emergency response training and emergency drills, so that they can master job duties and emergency disposal strategies and procedures."}
{"task": "rw_103.jsonl", "id": 71849, "text": "After unfortunately a child personal information security incident, we will inform the children and their guardians in a timely manner in accordance with the requirements of laws and regulations: the basic situation and possible impact of safety events, we have taken or or will take treatment measures, children and their guardiansSuggestions that can prevent and reduce risks, remedial measures for children and their guardians.", "label": ["Specific Audiences", "Data Security", "Important"], "rewrite": "After unfortunately a child's personal information security incident, we will inform the children and the guardian in a timely manner in accordance with the requirements of laws and regulations."}
{"task": "rw_103.jsonl", "id": 71850, "text": "We will inform children and the guardians in time to inform children and their guardians in time with APP pushing notifications, sending email/short messages, etc.", "label": ["Specific Audiences", "Important"], "rewrite": "We will inform children and the guardians in time to inform children and their guardians in time with APP pushing notifications, sending email/short messages, etc."}
{"task": "rw_103.jsonl", "id": 71851, "text": "When it is difficult to inform one by one, we will publish relevant warning information in a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "When it is difficult to inform one by one, we will publish relevant warning information in a reasonable and effective way."}
{"task": "rw_103.jsonl", "id": 71852, "text": "At the same time, we will also actively report the disposal of the child's personal information security incident in accordance with the requirements of the regulatory authorities.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "We will also actively report the disposal of the child's personal information security incident in accordance with the requirements of the regulatory authorities."}
{"task": "rw_103.jsonl", "id": 71853, "text": "If the legitimate rights and interests of children and their guardians are damaged, we will bear the corresponding legal responsibility.", "label": ["Specific Audiences", "Data Security", "Important"], "rewrite": "If the legitimate rights and interests of children and their guardians are damaged, we will bear the corresponding legal responsibility."}
{"task": "rw_103.jsonl", "id": 71854, "text": "(3) If you want to learn more, please check the chapter of \"How Do We Protect your Information\" and learn more about how we take to protect the personal information of children.", "label": ["Data Security", "Specific Audiences"], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71855, "text": "5. How to manage children's personal information", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71856, "text": "(1) For you or your children can access and manage your child's personal information more conveniently during our products and services, while ensuring the right to cancel the account. We provide you and your child in the client.According to the corresponding operation settings, you and your children can operate in accordance with the chapter guidance of the \"How Do You Manage your Information\" in the Privacy Policy.", "label": ["Edit/Control", "Specific Audiences", "Important"], "rewrite": "In order to more conveniently access and manage children's personal information and ensure the right to cancel the account, we provide the corresponding operation settings on the client."}
{"task": "rw_103.jsonl", "id": 71857, "text": "(2) In the following circumstances, you or your children can contact us through the channels listed by \"how to contact us\" through the Privacy Policy, asking for deletion of the corresponding child personal information:", "label": ["Edit/Control", "Specific Audiences", "Important"], "rewrite": "In the following situations, you or your children can contact us through the channels listed in the \"Privacy Policies\" to \"how to contact us\" and ask us to delete the corresponding child personal information."}
{"task": "rw_103.jsonl", "id": 71858, "text": "1. We violated the provisions of laws and administrative regulations or provided personal information of children's personal information for the collection, storage, use, and external agreed by both parties;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71859, "text": "2. Collecting, storing, using, and providing externally children's personal information beyond the scope of the purpose or the necessary period;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71860, "text": "3. You withdraw your consent;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71861, "text": "4. You or your child terminate the use of products or services by canceling and other methods.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71862, "text": "6. The revision of this policy", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71863, "text": "We may modify the terms of this policy in a timely manner in time according to the updates of our products and services and the relevant requirements of laws and regulations. These modifications constitute a part of the policy policy. We will display the latest modified version on the special page.", "label": ["Policy Change", "Important"], "rewrite": "According to the update of products and services and the relevant requirements of laws and regulations, the terms of this policy will be modified in a timely manner. Some of these amendments to make up the newly modified version on the special page will be displayed on the special page."}
{"task": "rw_103.jsonl", "id": 71864, "text": "Due to the large number of our users, for major changes, we will also provide more significant notifications (including notifications through publicity by website or client's homepage, and even provide you with pop -ups). For details, please refer to the \"Privacy Policy Policy Policy Policy \"Article 9 of the\" How to update this policy \".", "label": ["Policy Change", "Important"], "rewrite": "For major changes, we will also provide a more significant notice."}
{"task": "rw_103.jsonl", "id": 71865, "text": "Seven, how to contact us", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71866, "text": "If you and your child have any questions about this policy or have any complaints or opinions on the processing of personal information of children, please contact us through the following channels. We will receive questions, opinions or suggestions, and verify the guardian and/or child statusReply to your request within fifteen days:", "label": ["Specific Audiences", "Edit/Control", "Important"], "rewrite": "There are any complaints or opinions on the processing of personal information of children. Please contact us through the following channels. We will receive the problem and verify the request within 15 days after the guardian and/or children's identity."}
{"task": "rw_103.jsonl", "id": 71867, "text": "1. You can contact us through Taobao customer service and Taobao service center online customer service;", "label": ["Specific Audiences", "Important"], "rewrite": "You can contact us through Taobao customer service and Taobao service center online customer service."}
{"task": "rw_103.jsonl", "id": 71868, "text": "2. If you find that your personal information may be leaked, you can pass the Ali 110 complaint and report;", "label": ["Specific Audiences", "Contact Information", "Important"], "rewrite": "If you find that your personal information may be leaked, you can report it through Ali 110 complaints."}
{"task": "rw_103.jsonl", "id": 71869, "text": "3. You can contact our personal information protection full -time department through pipwg@service.alibaba.com. Office address: No. 4, Building 4, Building 4, Wenyi West Road, Yuhang District, Hangzhou, Hangzhou.", "label": ["Specific Audiences", "Contact Information", "Important"], "rewrite": "You can contact the full -time department of personal information protection through pipwg@service.alibaba.com. Office address: First floor of the first floor of Building 1, Building 4, No. 969, Wenyi Road, Yuhang District, Hangzhou City."}
{"task": "rw_103.jsonl", "id": 71870, "text": "It should be noted that we may not reply to issues that have nothing to do with the protection of this policy or personal information.", "label": [], "rewrite": []}
{"task": "rw_103.jsonl", "id": 71871, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
