{"task": "rw_123.jsonl", "id": 76143, "text": "Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76144, "text": "Update date: August 1, 2022", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76145, "text": "Effective date: August 1, 2022", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76146, "text": "Tuyou Games and its affiliated companies (hereinafter collectively referred to as \"Tuyou\" or \"We\") (the company name is: Late Tour (Beijing) Technology Co., Ltd., the registered address is: 3 House No. 30, Shixing Street, Shijingshan District, BeijingRoom A-0860, Building No. 2), is committed to protecting the personal information and privacy of its online users (hereinafter collectively referred to as \"user\" or \"you\").", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76147, "text": "In order to provide you with more accurate and more personalized services, we will use and disclose your relevant information in accordance with the provisions of this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76148, "text": "This privacy policy describes that when you use any game or application and other services (hereinafter referred to as \"service\" or \"game\"), we will collect, use and disclose the data (including your personal data) and other practicesEssence", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76149, "text": "Before using the journey service, please be sure to read and thoroughly understand this policy, especially the clauses that are identified by the lines/thick body. You should focus on reading and start using it after confirming and consent.", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76150, "text": "If you are a child, please notify your guardian to read this policy together and seek the consent and guidance of your guardian before you use your journey service and submit personal information.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76151, "text": "You clicks on this policy online, or you use/continue to use the journey service, and submit personal information, all indicate that you have obtained the permission of your guardian.Use, store, share, transfer, and disclose your personal information.", "label": ["Policy Change", "Important"], "rewrite": "Online clicks agree to this policy, or continue to use and submit personal information, indicating that the guardian has authorized to agree to the privacy policy."}
{"task": "rw_123.jsonl", "id": 76152, "text": "If you do not agree with the content of this policy, you may cause the journey service to be unable to run normally or to achieve the service effect we are going to achieve, and you should immediately stop the access/use tourism service.", "label": ["Policy Change", "Important", "Risk"], "rewrite": "Do not agree with this policy, the service may not be able to run normally, or it cannot achieve the expected service effect"}
{"task": "rw_123.jsonl", "id": 76153, "text": "If you use or continue to use the journey service, you agree that you agree that we collect, use, store, share, transfer, and disclose your personal information in accordance with this policy (including updated versions).", "label": ["Policy Change", "Important"], "rewrite": "Continue to use the journey service, indicating that you have authorized to agree to this privacy policy."}
{"task": "rw_123.jsonl", "id": 76154, "text": "After reading this policy, if you have any problems with this policy or related matters related to this policy, you can contact us through Customersupport@tuyoogame.com, and we will answer you as soon as possible.", "label": ["Important", "Contact Information"], "rewrite": "You can contact us through Customersupport@tuyoogame.com"}
{"task": "rw_123.jsonl", "id": 76155, "text": "Table of contents", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76156, "text": "1. The way we collect and use personal information", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76157, "text": "Second, our possible personal information disclosure, sharing or transfer", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76158, "text": "Third, third -party service", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76159, "text": "Fourth, access account and configuration file", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76160, "text": "5. How do we store and protect personal information", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76161, "text": "6. Your choice", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76162, "text": "Seven, your rights", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76163, "text": "8. Non -adult protection", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76164, "text": "Nine, change", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76165, "text": "10. Cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76166, "text": "Eleven, how to contact us", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76167, "text": "1. The way we collect and use personal information", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76168, "text": "(1) We will collect and obtain your personal information through the following ways:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76169, "text": "1. The information you provide.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76170, "text": "(1) When you are registered for the account number or use the journey service, you provide the information provided to us;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76171, "text": "(2) The shared information provided by the tourism service to other parties, and the information stored when you use the journey service.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76172, "text": "Please note that if you upload or publish the information that you can upload or publish in the open area where you can see in the Tuyou service, you can disclose your information in a response to the information you uploaded or published by others. These information may be collected and added by others to othersuse.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Public information uploaded or published in the open area may be collected and used by others."}
{"task": "rw_123.jsonl", "id": 76173, "text": "When you find that others collect or use your information, you can contact us through the feedback channels listed in the chapter of the \"How to contact us\" in this policy.", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76174, "text": "2. The information we get.", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76175, "text": "When you use your use to travel services, we collect, summarize, and record information, such as log information, location information, and equipment information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Will collect, summarize, record log information, location information, equipment information"}
{"task": "rw_123.jsonl", "id": 76176, "text": "3. Information obtained from third parties.", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76177, "text": "(1) We may obtain the account information (including user name, avatar, nickname, nickname) you authorized shared from a third party and bind your third -party account with your journey service account after you agree to this policy so that you can you canLog in through a third -party account and use it to travel.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "The account information of the authorized sharing will be obtained from a third party (including user name, avatar, nickname)"}
{"task": "rw_123.jsonl", "id": 76178, "text": "(2) Publicized information: such as public resources such as government databases.", "label": ["Important", "First Party Collection Information"], "rewrite": "It will collect open information, such as public resources such as disclosed government databases"}
{"task": "rw_123.jsonl", "id": 76179, "text": "(3) In order to improve the registration and login interface user experience, our products integrated third -party SDK one -click login service: flash check SDK to help to achieve one -click acting behavior of users.", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76180, "text": "System versions, network environment, gateway number pick -up reporting logs, etc. to provide statistical analysis service capabilities, and can provide anti -fraud functions.", "label": ["Important", "First Party Collection Information"], "rewrite": "Flash test SDK needs to obtain IP address, network card (MAC) address, international mobile device recognition code (IMEI), OAID (replacement IMEI), SIM card information, and collect mobile phone models, system types, system versions, network environment, gateway gatewayNumber to report an error log"}
{"task": "rw_123.jsonl", "id": 76181, "text": "(2) We will collect and use your personal information for the following goals:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76182, "text": "1. Help you complete the registration and login", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76183, "text": "In order to create your account, username and password, you need to provide basic registration or login information, including personal phone numbers, email address, application account information, and third -party account authorization information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect basic registration or login information, including personal phone number, email address, application account information, third -party account authorization information, to create accounts, usernames and passwords"}
{"task": "rw_123.jsonl", "id": 76184, "text": "Personal phone numbers are sensitive information, and we will use strictly in accordance with the provisions of this policy.", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76185, "text": "You can also fill in or supplement your other additional information (such as your nickname, avatar, gender, date of birth) during the registration, login or subsequent use process, which will help us provide you with personalized recommendations and moreExcellent service experience, but if you do not provide this information, it will not affect the basic functions of your travel service service.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect additional information such as nicknames, avatars, gender, date of birth to provide personalized recommendations"}
{"task": "rw_123.jsonl", "id": 76186, "text": "2. Implement identity authentication", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76187, "text": "In accordance with relevant laws and regulations and regulatory requirements, or in order to meet the needs of user identity, guarantee system and service security, and other specific service functions, we may need you to provide real identity information, equipment information (such as name and ID number) to use it)Complete identity certification.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect real identity information, equipment information (such as name and ID number) to complete identity authentication."}
{"task": "rw_123.jsonl", "id": 76188, "text": "If you do not provide the above information, we will not be able to provide you with related functions and services.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If you do not provide the above information, you will not provide related functions and services."}
{"task": "rw_123.jsonl", "id": 76189, "text": "In order to achieve the purpose of identity certification, you agree and authorize that we can provide, inquire, and check your aforementioned identity information on our own or entrusted to the third direction of the relevant identity authentication agency (such as personal credit reporting agencies, government departments, etc.).", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "Provide, inquire, and check your aforementioned identity information on your own or entrusted to the third direction of identity certification agencies for identity certification"}
{"task": "rw_123.jsonl", "id": 76190, "text": "Real identity is sensitive information, and we will use strictly in accordance with the provisions of this policy.", "label": ["Important", "Data Security"], "rewrite": "I will use identity information strictly in accordance with the form of this policy"}
{"task": "rw_123.jsonl", "id": 76191, "text": "If you use other products or services of Tuyou games at the same time, you authorize Tuyou to use your identity information to perform real -name authentication for other products or services.", "label": ["Important", "First Party Collection Information"], "rewrite": "It will collect and use your identity information for real -name authentication for products or services."}
{"task": "rw_123.jsonl", "id": 76192, "text": "Real identity is sensitive information, and we will use strictly in accordance with the provisions of this policy.", "label": ["Usage", "Data Security"], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76193, "text": "3. Normal operation of maintaining the basic functions of the game", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76194, "text": "In the process of using our service, in order to identify the abnormal state of the account, understand the product adaptability, maintain the normal operation of basic functions, protect your personal virtual property, and cooperate with the review of the relevant government departments, we may automatically collect and store you about youThe service and the information of the use method are associated with this information. This information and purpose include:", "label": ["Data Retention", "Important", "First Party Collection Information"], "rewrite": "It will automatically collect and store information about your use and use the information and associate this information to maintain the normal operation of basic functions"}
{"task": "rw_123.jsonl", "id": 76195, "text": "(1) Services (or communication) log information: When you use our service, we may automatically collect your detailed usage situation of our services as related online logs.", "label": ["Data Retention", "Important", "First Party Collection Information"], "rewrite": "It will automatically collect your detailed usage of our services and save it as a network log."}
{"task": "rw_123.jsonl", "id": 76196, "text": "Such as: game log information, such as logging in logs, items logs, game -to -game information, dating records, etc., so that you can view your game history records on the client, and at the same time used for game operation statistical analysis, game rankings, customer service complaintsTreatment and other game security analysis, and in order to improve your game experience, we may synchronize the aforementioned information to the follow -up version of the game or the other products you are provided by us.", "label": ["Data Retention", "Important", "First Party Collection Information"], "rewrite": "It will synchronize the game log information, such as logging in logs, items logs, game -to -game information, and dating records to the follow -up version of the game or the other products you are using the other products you are using"}
{"task": "rw_123.jsonl", "id": 76197, "text": "(2) Equipment information: We may receive and record the equipment related information you use, and read the status of the phone.", "label": ["Important", "First Party Collection Information"], "rewrite": "Will collect the equipment related information you use and read the status of the phone."}
{"task": "rw_123.jsonl", "id": 76198, "text": ", Equipment resolution, package name, device settings, process and software list (application list), unique device identifier, software and hardware feature information, the relevant information of the device is locatedAccess point, Bluetooth and base station sensor information).", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect IMEI, ICCID, Mac, SIM cards, IMSI, Android ID, OAID, VAID, AAID, GAID (only GMS service), device serial number, network type information equipment model, operating system and version, client version, device resolution, device resolutionBluetooth and base station sensor information)."}
{"task": "rw_123.jsonl", "id": 76199, "text": "We collect this information to provide you with basic services and basic functions.", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76200, "text": "Please note that separate equipment information and log information are information that cannot recognize specific natural person status.", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76201, "text": "If we use this type of non -personal information with other information to identify a specific natural person or use it with personal information, during the combination of use, such non -personal information will be regarded as personal information.In addition to the other provisions of your authorization or laws and regulations, we will anonymous and de -identifiable processing of this type of personal information.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "Personal information will be anonymized and de -identified."}
{"task": "rw_123.jsonl", "id": 76202, "text": "This information will be handled and protected as your personal information in accordance with this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76203, "text": "4. Help you complete the order, pay and deliver the goods or services to you", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76204, "text": "(1) When you order specific products and/or services in Tuyou services, we will use the system to generate orders for you to purchase the product and/or service.", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76205, "text": "In the process of placement, you may need to provide personal identity information, names, contact calls, and payment status information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect personal identity information, name, contact phone number, payment status information to complete the order"}
{"task": "rw_123.jsonl", "id": 76206, "text": "In special cases, your harvest address and postal code may be needed.", "label": ["Important", "First Party Collection Information"], "rewrite": "Under special circumstances, it is necessary to collect the receiving address and postal code"}
{"task": "rw_123.jsonl", "id": 76207, "text": "If you refuse to provide such information, we will not be able to complete the relevant delivery service.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Under special circumstances, the collection address and postal code need to be collected.If you refuse to provide it, the relevant delivery service will not be completed."}
{"task": "rw_123.jsonl", "id": 76208, "text": "(2) In order to show the order information of your account, we will collect the order information generated by you during the use of the service travel service (such as the product or service information, specific order number, order creation time, transaction amount) for your purchases.Show you and make it easy for you to manage the order;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect order information such as the purchase of goods or service information, specific order number, order creation time, transaction amount, etc. to display and facilitate your management of orders."}
{"task": "rw_123.jsonl", "id": 76209, "text": "(3) In order to complete the order payment, delivery of goods or services, confirm the transaction status, and provide you with after -sales and dispute solutions, we will use the transaction objects, payment institutions, and collecting and transaction progress related to the transaction.Accounts, orders, transactions, payment, or share your transaction information with the above -mentioned service providers.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Collect account numbers, orders, transactions, payments related to transaction progress, or share transaction information with the above -mentioned service providers to complete product transactions"}
{"task": "rw_123.jsonl", "id": 76210, "text": "(4) When you use the consumption function of the game product, we will collect information such as your recharge records, consumption records, etc., so that you can check your transaction records and protect your virtual items to the greatest extent.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect information such as recharge records, consumption records, to query transaction records and ensure transaction security"}
{"task": "rw_123.jsonl", "id": 76211, "text": "The recharge record and consumption record are sensitive information. Collecting the above information is necessary to achieve the consumption function of the game products, otherwise the transaction will not be completed.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect recharge records and consumer records to complete transactions."}
{"task": "rw_123.jsonl", "id": 76212, "text": "5. Game interactive function.", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76213, "text": "When you interact with other players through text, pictures, voice, videos, and other methods in the game, we may collect and save the content content of the above information you send to filter the improper content of pornography, violence, politics, abuse, malicious advertisements and other improper contentsIn order to purify the game environment and maintain a healthy Internet environment.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect and save the text, pictures, voice, video information content you sent, and use it to filter the improper content of pornography, violence, politics, abuse, malicious advertisements, etc."}
{"task": "rw_123.jsonl", "id": 76214, "text": "Your above information and your avatar and nickname information will access third -party SDK for verification.", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76215, "text": "6. Provide you with customer service or other user response functions", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76216, "text": "When you contact our customer service or use other users to respond to functions (such as selling after -sale after sale, personal information protection complaints or suggestions, other customer complaints and needs), we may need you to provide the necessary personal informationUser identity to ensure your account and system security.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the necessary personal information to verify the user identity"}
{"task": "rw_123.jsonl", "id": 76217, "text": "We may also save your contact information (you use us when you contact us or other contact information you provide to us), you have the communication/call records and content with our communication, and other necessary information associated with your needs.In order to contact you or help you solve the problem, or record the processing schemes and results of related issues.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your contact information, communication/call records and content, and other necessary information related to your needs to contact you or help you solve the problem"}
{"task": "rw_123.jsonl", "id": 76218, "text": "7. Import not to you", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76219, "text": "We may send you notifications related to service -related notifications (for example when we suspend a single service, change, and termination of a single service when we suspend a single service, change, and terminate a certain single service.", "label": ["Important", "Cessation of Operations"], "rewrite": "When the necessary time (for example, when we suspend a single service, change, and terminate a single service for system maintenance), I will issue a notice to you."}
{"task": "rw_123.jsonl", "id": 76220, "text": "Therefore, we may collect your personal phone numbers, email, and device information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the use of personal phone numbers, email, and device information."}
{"task": "rw_123.jsonl", "id": 76221, "text": "If you do not want to continue the message we push, you can ask us to stop pushing. For example, according to the SMS withdrawal guidelines, we need to stop sending promotion SMS, or settings in mobile devices, and no news of our push.", "label": ["Edit/Control", "Important"], "rewrite": "If you don't want to continue receiving the message we push, you can ask us to stop pushing"}
{"task": "rw_123.jsonl", "id": 76222, "text": "If the above channels do not solve your problem, you can also notify me through the custorsupport@tuyoogame.com to stop sending the notification/close directional notification.", "label": ["Important", "Contact Information"], "rewrite": "You can notify me through cuscomersupport@tuyoogame.com"}
{"task": "rw_123.jsonl", "id": 76223, "text": "8. Provide you with personalized needs: In order to provide you with localized content or to provide you with the customization and personalized viewing recommendation of games, advertisements, movies and TV programs that we think you will be interested,", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect the use of your geographical location information for personalized recommendations"}
{"task": "rw_123.jsonl", "id": 76224, "text": "We may collect and use your geographical location, and the geographical location is sensitive information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the use of your geographical location information for personalized recommendations"}
{"task": "rw_123.jsonl", "id": 76225, "text": "Your Internet service provider.", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76226, "text": "Your advertising information: advertising identifier, such as mobile devices, tablets, and streaming media equipment containing such identifiers with such identifiers;", "label": ["Important", "First Party Collection Information"], "rewrite": "Will collect your advertising information: advertising identifiers, such as mobile devices, tablets, and streaming equipment containing such identifiers with such identifiers;"}
{"task": "rw_123.jsonl", "id": 76227, "text": "Information collected through Cookies and network beacons, including advertising data (such as advertising availability and release situation, website URL, date and time and other information).", "label": ["Important", "First Party Collection Information"], "rewrite": "It may be collected by technologies such as cookies and network beacons, including advertising data."}
{"task": "rw_123.jsonl", "id": 76228, "text": "Your software information: such as software features (including software types and configurations), connection information, page viewing statistics, reference sources (such as reference URL), IP addresses (may tell us your general position), browser, etc.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect software information: such as software features (including software types and configurations), connection information, page viewing statistics, reference sources (such as reference URL), IP addresses (may tell us your general position), browser, etc."}
{"task": "rw_123.jsonl", "id": 76229, "text": "You purchase records in our service/game.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the purchase record information in the service/game"}
{"task": "rw_123.jsonl", "id": 76230, "text": "According to your above information to determine personalized recommendations you are interested in, if you don't like this service, you can close this service through the relevant settings in our service/game.", "label": ["Important", "Edit/Control"], "rewrite": "You can use the relevant settings in our service/game to close the content personalized recommendation service"}
{"task": "rw_123.jsonl", "id": 76231, "text": "If the above settings fail to meet your requirements, you can also contact us to cancel the directional push via the mailbox customersupport@tuyoogame.com, and we will provide you with non -fixed push.", "label": ["Edit/Control", "Contact Information", "Important"], "rewrite": "You can contact us to cancel the directional push by contacting us through the mailbox Customersupport@tuyoogame.com, and we will provide you with a non -fixed push."}
{"task": "rw_123.jsonl", "id": 76232, "text": "Please note that we only provide personalized recommendations in some services/games. You turn off personalized recommendations and will not reduce the recommended content, but this service/game will no longer recommend personalized content to you.", "label": ["Important", "Edit/Control"], "rewrite": "Close personalized recommendation, it will not reduce the recommended content, but this service/game will no longer recommend personalized content to you"}
{"task": "rw_123.jsonl", "id": 76233, "text": "9. Provide you with security: In order to improve the security of your service to provide services with our partners, protect the safety of your or other users or the public's personal property, and better prevent fishing websites, fraud, network vulnerabilities, computersSecurity risks such as viruses, network attacks, and network invasion, preventing, discovery and investigating potential prohibitions or illegal activities, including fraud and execution of our terms (such as determining the qualifications for free trials);", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76234, "text": "We may collect, use, or integrate your account information, transaction information, equipment information, log information, and our affiliate companies and partners to obtain information that you authorize or shared in accordance with the law to comprehensively judge your account and transaction risks, conduct authentication of authentication, Test and prevent safety incidents, and take necessary records, audits, analysis, and disposal measures in accordance with the law.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "It will collect, use or integrate account information, transaction information, equipment information, log information, and information that related companies and partners are authorized or shared in accordance with the law to comprehensively judge accounts and transaction risks"}
{"task": "rw_123.jsonl", "id": 76235, "text": "10. Service optimization:", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76236, "text": "(1) In order to analyze and understand our users, improve our services (including our user interface experience), optimize content selection, recommendation algorithm and delivery;", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76237, "text": "You agree that we may share your personal information with a third party for data analysis. At the same time, we will sign a rigorous confidentiality agreement with the third party, asking third parties to take technical measures and other means to ensure that the data shared with third parties will not be leaked.Or use it for other purposes.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "It will share personal information with a third party for data analysis, and at the same time, it will sign a strict confidentiality agreement, requiring third parties to take technical measures and other means to ensure that the data will not be leaked or used as other purposes"}
{"task": "rw_123.jsonl", "id": 76238, "text": "(2) In order to better provide you with game services and improve the gaming experience, we can make information on your game accounts, nicknames, avatars, and related operation information, game information in the game (hereinafter referred to as \"these information\"\" \".", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "It will use the nicknames, avatars in the game account, and relevant operation information, game information in the game (these information include but not limited to your login status, battle information/status, achievement information, etc.)exhibit"}
{"task": "rw_123.jsonl", "id": 76239, "text": "These information include but not limited to your login status, battle information/status, achievement information, etc.), and can display these information to you or other users or friends.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "It will use the nicknames, avatars in the game account, and relevant operation information, game information in the game (these information include but not limited to your login status, battle information/status, achievement information, etc.)exhibit"}
{"task": "rw_123.jsonl", "id": 76240, "text": "We may provide you with relevant authority depending on the specific situation of the game product so that you can set the relevant information about the previous relevant information and set it.", "label": ["Permission Acquisition", "Important"], "rewrite": "It will provide relevant permissions depending on the specific situation of the game product so that the relevant information described before is displayed."}
{"task": "rw_123.jsonl", "id": 76241, "text": "You agree that we may provide attribution analysis to third parties.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "These information may be provided to third parties for attractive analysis"}
{"task": "rw_123.jsonl", "id": 76242, "text": "Android, ID, OAID, VAID, AAID, GAID (only GMS service)), device serial number, network type information.", "label": ["Important", "First Party Collection Information"], "rewrite": "The following information will be collected: device ID, device name, device type and version, system version, IP address, device logo information (such as IMEI, ICCID, IMSI, Mac, Android ID, OAID, VAID, AAID, GAID (only GMS service)), Device serial number, network type information.Used to perform game data statistics, advertising attribution"}
{"task": "rw_123.jsonl", "id": 76243, "text": "11. Evaluate and improve our services: Communicate with you about us (for example, email, push notification SMS, online news transmission channels), so that we can send you news about the journey of Tuyou games, detailed new features, detailed functions of new featuresInformation, special offers, promotion announcements and consumer investigations help you complete the operating request, such as password reset requests.", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76244, "text": "12. You understand and agree that some single services may require you to open specific access rights in your device to achieve the collection and use of information involved in these permissions.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "Some single services need to open specific access rights to achieve the collection and use of information involved in these permissions"}
{"task": "rw_123.jsonl", "id": 76245, "text": "We will not ask you to open the ownership at one time. Only when you use some of the functions we provide, we ask for the use of corresponding permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use some of the functions provided, you will request the use of corresponding permissions"}
{"task": "rw_123.jsonl", "id": 76246, "text": "We may apply for the following permissions: For example::", "label": ["Permission Acquisition", "Important"], "rewrite": "May apply for the following permissions:"}
{"task": "rw_123.jsonl", "id": 76247, "text": "(1) After you turn on the album and/or camera (camera) permissions, you can upload and take photos/pictures/videos to realize functions such as publishing information and comments, screenshots or communication with customer service.", "label": ["Permission Acquisition", "Important"], "rewrite": "Apply for the authority of the album and/or camera (camera)"}
{"task": "rw_123.jsonl", "id": 76248, "text": "(2) After you start the communication record of the communication, we can get your communication information information, invite your friends to use the use of service to service, share content/product and other functions;", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "Apply for the use of communication recording permissions"}
{"task": "rw_123.jsonl", "id": 76249, "text": "(3) After you turn on the microphone, recording and related voice rights, you can use voice functions to interact with our products, others, or contact customer service;", "label": ["Permission Acquisition", "Important"], "rewrite": "Apply to use microphone, recording and related voice permissions"}
{"task": "rw_123.jsonl", "id": 76250, "text": "(4) After you open the position permissions, we can get your location information (may include accurate locations and rough locations, and location information is sensitive information) so that you can interact with friends with nearby friends or push you personalized content to youItems", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "Application position permissions"}
{"task": "rw_123.jsonl", "id": 76251, "text": "Distinguish users in different regions and carry out data statistics and refined operations;", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76252, "text": "Open the ranking function.", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76253, "text": "(5) After you open the permissions that we can read/write to your calendar, we can obtain your schedule to provide you with functions such as records, reminders.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "Apply for the permissions of the calendar"}
{"task": "rw_123.jsonl", "id": 76254, "text": "(6) After you start reading, modify, write SD permissions or storage permissions, we will download game resources and store on SD cards or mobile phone storage space.", "label": ["Data Retention", "Permission Acquisition", "Important"], "rewrite": "Apply to use SD permissions or storage permissions"}
{"task": "rw_123.jsonl", "id": 76255, "text": "(7) After you turn on the status and identity information of your mobile phone, we will make user recharge restrictions according to the device;", "label": ["Permission Acquisition", "Important"], "rewrite": "Apply for the use of mobile phone status and identity information authority"}
{"task": "rw_123.jsonl", "id": 76256, "text": "Differential users are distinguished according to equipment information to prevent batch registration of fake users from brushing game assets.", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76257, "text": "(8) Get your SMS permissions, including sending, receiving, reading. We use SMS permissions to send you, receive, and read the verification code to send you specific notifications and marketing information.", "label": ["Permission Acquisition", "Important"], "rewrite": "Apply for using SMS permissions"}
{"task": "rw_123.jsonl", "id": 76258, "text": "When you need to close these functional permissions, most mobile devices will support your needs. For specific methods, please refer to or contact your mobile device service providers or manufacturers.", "label": ["Important", "Edit/Control"], "rewrite": "Most mobile devices support the closing permissions requests."}
{"task": "rw_123.jsonl", "id": 76259, "text": "Please note that you can open the right of power means that you authorize us to collect and use relevant information to provide you with the corresponding service. Once you close the term, the authority means that you cancel the authorization.With the relevant information, it is impossible to provide you with the service corresponding to the permissions.", "label": ["Important", "Edit/Control"], "rewrite": "Opening the right permissions means that the authorization can collect and use relevant information. Closing any authority means that the authority cancels the authorization"}
{"task": "rw_123.jsonl", "id": 76260, "text": "However, your decision to close permissions will not affect the collection and use of information based on your authorization, but you can contact us to delete your personal information.", "label": ["Permission Acquisition", "Edit/Control", "Risk", "Important"], "rewrite": "The decision to close permissions will not affect the information collection and use of information based on authorization, but you can contact us to delete personal information."}
{"task": "rw_123.jsonl", "id": 76261, "text": "13. Exception of obtaining authorization consent", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76262, "text": "According to relevant laws and regulations, collecting your information in the following situations does not need to obtain your authorization consent:", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "In the following circumstances, the collection information does not need to be authorized:"}
{"task": "rw_123.jsonl", "id": 76263, "text": "(1) Related to national security and national defense security;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Related to national security and national defense security, no authorization is required"}
{"task": "rw_123.jsonl", "id": 76264, "text": "(2) Related to public safety, public health, and major public interests;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If it is related to public safety, public health, and major public interests, no authorization is required"}
{"task": "rw_123.jsonl", "id": 76265, "text": "(3) Related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If it is related to criminal investigation, prosecution, trial, and judgment execution, no authority is required"}
{"task": "rw_123.jsonl", "id": 76266, "text": "(4) For the major legitimate rights and interests of the life and property of the main body or other individuals, it is difficult to get your consent;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "For the major legitimate rights and interests of the life, property of the main body or other individuals, it is difficult to get your consent. There is no need to authorize"}
{"task": "rw_123.jsonl", "id": 76267, "text": "(5) The collected information is made by your own public;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "The collected information is publicly disclosed to the public by itself without authorization."}
{"task": "rw_123.jsonl", "id": 76268, "text": "(6) Collecting information from the information disclosed by legal and publicly disclosed, such as legal news reports, government information disclosure and other channels;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting information from the legal public disclosure information, such as legal news reports, government information disclosure and other channels, no need to authorize"}
{"task": "rw_123.jsonl", "id": 76269, "text": "(7) Signing the contract according to your requirements;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Signing the contract according to your requirements, no need to authorize"}
{"task": "rw_123.jsonl", "id": 76270, "text": "(8) It is necessary to maintain the safe and stable operation of the journey service, such as discovering and disposing of products or services;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "It is necessary to maintain the safe and stable operation of Tuyou services."}
{"task": "rw_123.jsonl", "id": 76271, "text": "(9) It is necessary for legal news reports;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "It is necessary for legal news reports, no need to authorize"}
{"task": "rw_123.jsonl", "id": 76272, "text": "(10) Academic research institutions are necessary to carry out statistics or academic research based on public interests, and when providing results of academic research or description, the information contained in the results is identified by", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "When academic research institutions are necessary to carry out statistics or academic research based on public interests, and to provide academic research or description results, the information contained in the results is identified as required"}
{"task": "rw_123.jsonl", "id": 76273, "text": "(11) Other circumstances stipulated in laws and regulations.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Other circumstances stipulated in laws and regulations do not need to be authorized"}
{"task": "rw_123.jsonl", "id": 76274, "text": "Second, our possible personal information disclosure, sharing or transfer", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76275, "text": "We will only disclose, share, and transfer your personal information only under the following circumstances and adopt the premise that the industry standards that meet the industry standards ::", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Only on the premise of meeting safety protection measures, it will disclose, share, and transfer personal information."}
{"task": "rw_123.jsonl", "id": 76276, "text": "(1) Service provider:", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76277, "text": "We use other companies, agents or contractors (\"service suppliers\") to provide services on behalf of us to provide services.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Use other companies, agents or contractors (\"service providers\") on behalf of us to provide services or assist us with services."}
{"task": "rw_123.jsonl", "id": 76278, "text": "For example, in order to provide you with better services, we need to serve the supplier to carry out marketing, advertising, personalization and optimization services for us, handle credit card transactions or other payment methods, provide customer service to collect debts, analyze and improve data (Including the interaction of data users and our services), handling and managing consumer investigations.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76279, "text": "(2) Promotional activities:", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76280, "text": "We may provide joint promotions. In order to better participate, we may share your information with third parties.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to jointly promote your information with a third party."}
{"task": "rw_123.jsonl", "id": 76281, "text": "When completing these types of promotional activities, we may share your name and other information related to completing rewards.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When completing the promotion, you may share your name and other relevant information."}
{"task": "rw_123.jsonl", "id": 76282, "text": "Please note that these third parties are responsible for their own privacy policies.", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76283, "text": "(3) Information security:", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76284, "text": "We and its service providers may disclose or use your personal and other information. We and its services can reasonably believe in such a disclosure: (a) need to meet any applicable legal, regulatory, legal procedures, or government requests, (or government requests, ((b) Perform the applicable use terms, including investigating potential violations, (C) testing, pre -pre -pre -testing, prevention, or other address illegal or suspicious illegal activities (including payment fraud), security or technical issues, or (d) protect us and you and you and youOr the public's rights, property, or security exempt damage within the scope permitted by law.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We and its service providers may disclose or use your personal and other information"}
{"task": "rw_123.jsonl", "id": 76285, "text": "(4) Business transfer:", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76286, "text": "For any of our reorganization, merger, sale, or other asset transfer, we will transfer the account information including personal information through push notifications and announcements in advance, and the receiver will follow the corresponding legalRegulations and the standards that are not lower than this privacy policy continue to protect your personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When reorganization, merger, sale, or other asset transfer, personal information will be transferred"}
{"task": "rw_123.jsonl", "id": 76287, "text": "(5) Game ranking", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76288, "text": "You agree that we will use your game data (including your nickname, honor title, paragraph, avatar, title, etc.) to display the ranking functions and display it to players participating in the rankings.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Use the game data for the ranking function, display it to players participating in the rankings"}
{"task": "rw_123.jsonl", "id": 76289, "text": "(6) Basic information View", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76290, "text": "You agree to see your game information (including your nickname, honorary title, paragraph, avatar, title, win rate, etc.) in the game friends in the game, or in the game.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Friends in the game or game in the game may see your game information (including your nickname, honor title, paragraph, avatar, title, win rate, etc.)"}
{"task": "rw_123.jsonl", "id": 76291, "text": "Third, third -party service", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76292, "text": "Our services can be provided by/or websites (such as voice control) or third -party websites through the third -party platform operation. These third -party information processing policies may be different from our policies.", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76293, "text": "Tourism services may access or link to social media or other services provided by third parties (including websites or other services).", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "May access or link to social media or other services provided by third parties (including websites or other services)"}
{"task": "rw_123.jsonl", "id": 76294, "text": "include:", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76295, "text": "1. You can use the \"Share\" key to share certain ways of travel services to third -party services, or you share third -party service content into Tourism services.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76296, "text": "These functions may collect your information (including your log information) and may run the above functions normally at your computer device;", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Will collect information (including log information), and may install cookies for normal operating functions"}
{"task": "rw_123.jsonl", "id": 76297, "text": "2. We provide you through advertising or other ways of service, so that you can link to the service or website of a third party;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76298, "text": "and", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76299, "text": "3. Other conditions to access third -party services.", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76300, "text": "For example, in order to achieve the purpose of this policy, we may access the SDK or other similar applications provided by a third -party service provider, and share some of the information we collected in accordance with this policy withThree -party service providers to provide better customer service and use, household experience.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Will access the SDK provided by a third -party service provider, and share the collected information with these third -party service providers in order to provide better customer service and user experience"}
{"task": "rw_123.jsonl", "id": 76301, "text": "At present, the third -party service providers we connect mainly include the following types:", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76302, "text": "(1) For advertising -related services, including advertising display, advertising data monitoring/statistics, etc.;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76303, "text": "(2) For message push functions, including mobile phone manufacturer Push push, specific event reminder, personalized content recommendation, etc.;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76304, "text": "(3) Used to pay related services, including order payment, transaction behavior verification, income settlement, payment information remittance president, etc.;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76305, "text": "(4) Use the location permissions of the device with your consent, collect equipment information and log information, etc.;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76306, "text": "(5) Used for third -party authorization services, including login of third -party accounts, sharing relevant content to third -party products, etc.;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76307, "text": "(6) Used to support product function modules (if any), including online live broadcast, video playback, voice recognition, AR, smart customer service, barrage playback, content storage, etc.;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76308, "text": "(7) Used to optimize product performance, including improving hardware distribution capacity, reducing server costs, function heat repair, etc.;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76309, "text": "(8) It is used for account security and product reinforcement related services, including network monitoring, domain name analysis (HTTPDNS), anti -hijacking, anti -junk anti -cheating, and deprivation services.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76310, "text": "We will only share your information for legitimate, necessary, and specific purposes.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "It will only share your information for legitimate, necessary, and specific purposes."}
{"task": "rw_123.jsonl", "id": 76311, "text": "For a third -party service provider who shared information with us, we will ask them to fulfill relevant confidentiality obligations and take corresponding security measures.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "For third -party service providers with sharing information, they will ask them to fulfill relevant confidentiality obligations and take corresponding security measures"}
{"task": "rw_123.jsonl", "id": 76312, "text": "These third -party social media or other services are operated by related third parties.", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76313, "text": "You use these third -party social media services or other services (including any information you provided to these third parties), which must be restricted by the third party's own service terms and information protection statements (not this policy).Read its clauses.", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76314, "text": "This policy is only applicable to the personal information we collected, and it does not apply to the service provided by any third party or the rules of information use of third -party information.", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76315, "text": "If you find that these third -party social media or other services are risky, it is recommended that you terminate related operations to protect your legitimate rights and interests.", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76316, "text": "According to different partners, the SDK list detailed attachment \"SDK and Similar Listed List\".", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "According to different partners, please refer to the attachment \"SDK and similar program lists\" according to different partners."}
{"task": "rw_123.jsonl", "id": 76317, "text": "Fourth, access account and configuration file", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76318, "text": "To facilitate your access account, when you use the game game service, you can use the function of \"Remembering me on this device\".", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76319, "text": "The technology used by this function enables us to provide direct account access and help manage the game service service without entering any password or other user logos when you access the service again.", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76320, "text": "You can choose to delete your account on the device according to our relevant tips.", "label": ["Important", "Edit/Control"], "rewrite": "You can choose to delete your account on the device according to our relevant tips."}
{"task": "rw_123.jsonl", "id": 76321, "text": "Public or shared users should quit at the end of each visit.", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76322, "text": "If you sell or return a computer, you should cancel and disable the device before that.", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76323, "text": "If you do not maintain the security of your password or device, or fail to note, sell or delay your device, subsequent users may be able to access your account, including your personal information.", "label": ["Important", "Risk"], "rewrite": "If there is no security of the password or device, or failure to cancel or discontinue the device, subsequent users may access accounts, including personal information."}
{"task": "rw_123.jsonl", "id": 76324, "text": "If you share or allow others to access your account, they will be able to see your information (such as your browsing history, rating, comment and account information.", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76325, "text": "5. How do we store and protect personal information", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76326, "text": "We only store your personal information within the shortest time limit during the purpose of this policy and the shortest time limit required by laws and regulations.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "Save personal information within the shortest time limit during the purpose of the purpose of this policy and the shortest time limit required by laws and regulations."}
{"task": "rw_123.jsonl", "id": 76327, "text": "If we terminate our services or operations, we will stop collecting your personal information in time. At the same time, we will comply with relevant laws and regulations to inform you in advance, and delete or processes your personal information after termination of the service or operation.However, except for laws and regulations or regulatory departments.", "label": ["Important", "Data Security", "Cessation of Operations"], "rewrite": "If you terminate services or operations, you will stop collecting personal information in a timely manner. At the same time, you will notify it in advance, and delete or anonymous processing of personal information after termination of the service or operation"}
{"task": "rw_123.jsonl", "id": 76328, "text": "The personal information we collected and generated in the operation of the People's Republic of China is stored in China, except for the following situations:", "label": ["Data Retention", "Important", "Risk"], "rewrite": "The personal information collected and generated in the operation of the People's Republic of China is stored in China, except for the following situations:"}
{"task": "rw_123.jsonl", "id": 76329, "text": "1. The laws and regulations have clear stipulation;", "label": ["Data Retention", "Important", "Risk"], "rewrite": "Laws and regulations have clearly stipulated that storage and overseas are stored abroad"}
{"task": "rw_123.jsonl", "id": 76330, "text": "2. Get your authorization consent;", "label": ["Data Retention", "Important", "Risk"], "rewrite": "Obtaining the authorization consent to store overseas, storage and overseas"}
{"task": "rw_123.jsonl", "id": 76331, "text": "3. The Tourism service you use involves cross -border, and Tuyou needs to provide your personal information to your overseas.", "label": ["Data Retention", "Important", "Risk"], "rewrite": "The service used involves cross -border and requires personal information to be provided abroad."}
{"task": "rw_123.jsonl", "id": 76332, "text": "In response to the above situations, we will ensure that your personal information is provided with sufficient protection in accordance with the requirements of this policy and national laws and regulations.", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76333, "text": "We attach great importance to information security, set up a special security team, and take all reasonable and feasible measures to protect your personal information:", "label": ["Important", "Data Security"], "rewrite": "Establish a special security team and take all measures to protect personal information"}
{"task": "rw_123.jsonl", "id": 76334, "text": "(1) Data security technical measures", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76335, "text": "We will adopt security measures that meet industry standards, including establishing reasonable institutional specifications and security technology to prevent your personal information from being accessed and modified by unauthorized access to avoid data damage or loss.", "label": ["Important", "Data Security"], "rewrite": "Adopt security measures that meet the industry standards, including establishing reasonable institutional specifications and security technology to prevent personal information from being used by unauthorized access and modification, avoiding data damage or loss of data"}
{"task": "rw_123.jsonl", "id": 76336, "text": "Our services have adopted a variety of encryption technologies. For example, in some road travel services, we will use encrypted technology to protect your personal information, use encrypted technology to encrypt your personal information, and isolate through isolation technology.", "label": ["Important", "Data Security"], "rewrite": "Adopt a variety of encryption technologies, encrypt your personal information, and isolate through isolation technology"}
{"task": "rw_123.jsonl", "id": 76337, "text": "When the personal information is used, such as information display and information association calculation, we will use multiple data desensitization technology to enhance the security of information in use.", "label": ["Important", "Data Security"], "rewrite": "When the personal information is used, such as information display and information association calculation, a variety of data desensitization technology enhances the security of information in use"}
{"task": "rw_123.jsonl", "id": 76338, "text": "We will also use strict data access permissions control and multiple identity authentication technology to protect personal information to avoid data from illegal use.", "label": ["Important", "Data Security"], "rewrite": "It will use strict data access permissions control and multiple identity authentication technology to protect personal information to avoid data from illegal use"}
{"task": "rw_123.jsonl", "id": 76339, "text": "(2) Other security measures we have taken to protect personal information", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76340, "text": "We manages the storage and use of personal information by establishing a data classification classification system, data security management specifications, and data security development specifications.", "label": ["Important", "Data Security"], "rewrite": "Manage the storage and use of personal information by establishing data classification classification systems, data security management specifications, and data security development specifications."}
{"task": "rw_123.jsonl", "id": 76341, "text": "We control the data through the confidentiality agreement, monitoring and audit mechanism through information contactors.", "label": ["Important", "Data Security"], "rewrite": "Through information contacts confidentiality agreements, monitoring and auditing mechanisms to make comprehensive security control of data"}
{"task": "rw_123.jsonl", "id": 76342, "text": "We will also organize safety and privacy protection training courses to strengthen employees' awareness of safety and understand the importance of protection.", "label": ["Important", "Data Security"], "rewrite": "The safety and privacy protection training courses will be held to strengthen the safety awareness of employees and awareness of the importance of information."}
{"task": "rw_123.jsonl", "id": 76343, "text": "(3) We only allow the need to know these information employees and partners to visit your personal information and set up strict access to control and monitoring mechanisms for this.", "label": ["Important", "Data Security"], "rewrite": "Established a strict access to control and monitoring mechanism, and only allowed employees and partners to know the need to know about this information."}
{"task": "rw_123.jsonl", "id": 76344, "text": "We also require all personnel who may be exposed to your personal information to fulfill the corresponding confidentiality obligations.", "label": ["Important", "Data Security"], "rewrite": "All personnel who require contact with personal information to fulfill their obligations of confidentiality"}
{"task": "rw_123.jsonl", "id": 76345, "text": "If these obligations fail to fulfill these obligations, they may be held legal or suspended from Tuyou.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76346, "text": "(4) We will take all reasonable and feasible measures to ensure unrelated personal information.", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76347, "text": "(5) The Internet is not an absolutely secure environment, and the communication method of email, instant messaging, social software or other service software cannot be determined whether it is completely encrypted. We recommend that you use complex passwords when using this kindPay attention to protect your information security.", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76348, "text": "(6) The Internet environment is not 100 % security. We will try our best to ensure or guarantee the security of your personal information you send to our personal information.", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76349, "text": "If our physics, technology, or management protection facilities are damaged, personal information is caused by non -authorized access, public disclosure, tampering, or destruction, resulting in damage to your legitimate rights and interests, we will bear the corresponding legal responsibility.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76350, "text": "6. Your choice", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76351, "text": "Email and text messages.", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76352, "text": "If you no longer want to receive some of our communication through emails or text messages, you can choose to cancel the subscription on the device according to our relevant tips.", "label": ["Important", "Edit/Control"], "rewrite": "If you don't want to receive emails or text messages, you can choose to cancel the subscription on the device"}
{"task": "rw_123.jsonl", "id": 76353, "text": "Push notification.", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76354, "text": "You can choose to receive a mobile push notification from our mobile push.", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76355, "text": "You can also choose to push or close the directional push. If you then decide not to accept these notices, you can use the setting function of the mobile device to close them.", "label": ["Important", "Edit/Control"], "rewrite": "You can choose to push or close the directional push"}
{"task": "rw_123.jsonl", "id": 76356, "text": "Interest advertisement: Interest advertisements are online advertisements tailored based on the various applications and websites you use on the Internet, and based on your possible interest.", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76357, "text": "If you are using a website or application, you can use Cookies and Web, Beacon to collect information to help determine your possible interest.", "label": ["Important", "First Party Collection Information"], "rewrite": "Will use cookies and web beacon to collect information"}
{"task": "rw_123.jsonl", "id": 76358, "text": "If you are using mobile devices, tablets, or streaming devices including advertising identifiers, then this identifier can be used to help determine your possible interest", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76359, "text": "The above choices can be changed through the relevant settings on your device. If you do not find the relevant settings, you can also contact us to change your choice by contacting us via email Customersupport@tuyoogame.com.", "label": ["Important", "Contact Information"], "rewrite": "You can contact us to change the choice via the mailbox Customersupport@tuyoogame.com."}
{"task": "rw_123.jsonl", "id": 76360, "text": "Seven, your rights", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76361, "text": "You can visit at any time and ask your personal information, including but not limited to your account information, contact information, passenger payment information, and other related information, or update our personal information about your outdated or inaccurate personal information.", "label": ["Edit/Control", "Important"], "rewrite": "You can access or update personal information at any time, such as your account information, contact information, journey payment information, and other related information."}
{"task": "rw_123.jsonl", "id": 76362, "text": "If you find that we violate, the provisions of anti -laws, administrative regulations, or the agreed collection and use your personal information of both parties, you can ask us to delete it.", "label": ["Edit/Control", "Important"], "rewrite": "If we find that we violate laws and administrative regulations, or the agreed collection and personal information of both parties, we can ask us to delete it."}
{"task": "rw_123.jsonl", "id": 76363, "text": "When you visit, modify and delete related information, we may ask you to verify your identity to ensure the security of the account.", "label": ["Edit/Control", "Important"], "rewrite": "When accessing, modifying and deleting related information, identity verification will be required."}
{"task": "rw_123.jsonl", "id": 76364, "text": "You can contact us to access, correct, delete your personal information or cancel your account through cuscomersupport@tuyoogame.com at any time, or we will complete within 7 working days.", "label": ["Important", "Contact Information", "Edit/Control"], "rewrite": "Contact us to visit, correct, delete personal information or cancel the account number"}
{"task": "rw_123.jsonl", "id": 76365, "text": "You can also click this link to cancel", "label": ["Important", "Edit/Control"], "rewrite": "You can click this link to complete the cancellation"}
{"task": "rw_123.jsonl", "id": 76366, "text": "You can choose whether to disclose the information.", "label": ["Edit/Control", "Important"], "rewrite": "Can choose to disclose information"}
{"task": "rw_123.jsonl", "id": 76367, "text": "Some information is necessary for the service travel service, but most of the other information is determined by you.", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76368, "text": "You can change your authorization of the scope of the collection, use of information or withdraw your authorization by deleting information, closing the device function, and mailing.", "label": ["Edit/Control", "Important"], "rewrite": "You can change the scope of authorization or withdraw authorization by deleting information, closing the device function, email contact, etc."}
{"task": "rw_123.jsonl", "id": 76369, "text": "When you withdraw authorization, we cannot continue to provide you with the service corresponding to the withdrawal authorization and no longer process your corresponding information.", "label": ["Important", "Edit/Control"], "rewrite": "When the authorization is withdrawn, it cannot continue to provide the corresponding service, and no longer process the corresponding information"}
{"task": "rw_123.jsonl", "id": 76370, "text": "But your decision to withdraw authorization will not affect the information processing based on your authorization.", "label": ["Permission Acquisition", "Edit/Control", "Risk", "Important"], "rewrite": "The decision to withdraw authorization will not affect information processing carried out based on authorization."}
{"task": "rw_123.jsonl", "id": 76371, "text": "8. Non -adult protection", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76372, "text": "In order to protect the healthy growth of minors, our games will access the anti -induction system of minors. You must be 18 years old to subscribe to all of our services. Individuals under the age of 18 can use our services, but we must get parents or legal legal or legal.The participation, supervision and approval of the guardian.", "label": ["Specific Audiences", "Important"], "rewrite": "It will access minors' anti -induction systems, and individuals under the age of 18 must be involved, supervised and approved by their parents or legal guardians."}
{"task": "rw_123.jsonl", "id": 76373, "text": "Nine, change", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76374, "text": "In order to provide you with better services, we may modify the terms of this policy in a timely manner according to the update situation and legal requirements of Tuyou services.", "label": ["Policy Change", "Important"], "rewrite": "We may modify the terms of this policy in a timely manner according to the relevant requirements of the update and the relevant requirements of the legal and regulations"}
{"task": "rw_123.jsonl", "id": 76375, "text": "If there are any changes (including when the change will take effect), we will notify you through the website announcement, push notification, pop -up window prompts or other methods before this policy. If you do not agree with such changes, you can choose to stop using it.Tuyou service;", "label": ["Policy Change", "Important"], "rewrite": "It will be notified through the website announcement, push notification, pop -up window prompts, or other methods before this policy. If you do not agree, you can choose to stop using"}
{"task": "rw_123.jsonl", "id": 76376, "text": "If you continue to use the journey service, it means that you have fully read, understand, and agree to the constraints of the policy revised.", "label": ["Policy Change", "Important"], "rewrite": "If you continue to use it, it means the constraint of the policy that has been fully read, understands and agree to the revised by the policy"}
{"task": "rw_123.jsonl", "id": 76377, "text": "10. Cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76378, "text": "We hope you understand our use of these technologies, so this section will explain the technical types, their purpose, and the choices you use in this section.", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76379, "text": "1. What is Cookies and advertising logo?", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76380, "text": "Cookies is a small data file that is stored on your device when you browse, using websites and online services.", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76381, "text": "They are widely used to make the website more effective and provide report information and assistance services or advertising.", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76382, "text": "The advertising identifier is similar to Cookies, which can be found on many mobile devices and tablets and some streaming media devices.", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76383, "text": "Like cookies, the advertising identifier is also used to improve the correlation of online advertising.", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76384, "text": "2. Why use cookies and advertising logo?", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76385, "text": "Using cookies and advertising identifies can allow us to provide you with more convenient services when surfing the Internet.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect cookies and advertising logo to provide convenient access to the Internet."}
{"task": "rw_123.jsonl", "id": 76386, "text": "3. How to choose cookies and advertising logo?", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76387, "text": "More information about Cookies will follow our website, applications, and other types of online tracking (including the online activity time collected by a third party or an advertisement you are interested in), and instruct you to selectively click on clickEssence", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76388, "text": "Eleven, how to contact us", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76389, "text": "If we have any questions and complaints about this privacy policy or we use your personal information, cookies, or similar technologies;", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76390, "text": "Or have any changes to your authorization and choice;", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76391, "text": "You can all ask for the protection of our data through the email Customersupport@tuyoogame.com, the center/privacy office, usually we will reply to you within 7 working days.", "label": ["Important", "Contact Information"], "rewrite": "You can contact our data protection center/privacy office through email Customersupport@tuyoogame.com"}
{"task": "rw_123.jsonl", "id": 76392, "text": "The controller of your profile is Tuyou Games.", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76393, "text": "Please note that if you contact us to assist you, for your safety, we may need to verify your identity before meeting your requirements.", "label": ["Important", "Data Security"], "rewrite": "You need to verify your identity before meeting your request."}
{"task": "rw_123.jsonl", "id": 76394, "text": "Line Tour (Beijing) Technology Co., Ltd.", "label": [], "rewrite": []}
{"task": "rw_123.jsonl", "id": 76395, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
