{"task": "rw_116.jsonl", "id": 74415, "text": "Perfect World Game Personal Information Protection Policy", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74416, "text": "Perfect World Group (hereinafter referred to as \"Perfect World\" or \"We\") respects and protects the personal information of the perfect world application.", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74417, "text": "We will be handled in accordance with the \"Perfect World Game Personal Information Protection Policy\" (hereinafter referred to as \"this policy\") (including activities including collecting, storage, use, processing, transmission, provision, and openness) (hereinafter referred to as \"you\")Personal information in world applications.", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74418, "text": "\"Perfect World Group\" refers to Perfect World (Beijing) Software Technology Development Co., Ltd. (Registration address: 7th floor 701-14, Building, No. 5, No. 1, No. 1, Shangdi East Road, Haidian District, Beijing, contact address: Wang Jingdong, Chaoyang District, BeijingLuo No. 1 Perfect World Building A) and its subordinates and its affiliated branches and their affiliated companies or joint ventures.", "label": ["Important", "Contact Information"], "rewrite": "Registered address: Room 701-14, Floor 7, Building 5, Yard 1, Shangdi East Road, Haidian District, Beijing, Contact Address: Block A, Perfect World Building, No. 1 Wangjing East Road, Chaoyang District, Beijing"}
{"task": "rw_116.jsonl", "id": 74419, "text": "For the definition of \"affiliated companies\", please refer to the definition of keywords.", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74420, "text": "\"Perfect World Application\" refers to the Perfect World Group's supporting Perfect Permit Account, Perfect World Mobile Game Account (formerly Tiger account) or other third -party account registration, login, login, computer client game, mobile terminal game, and other forms of other formsGames (\"Perfect World Games\") and related websites (including but not limited to Wanmei.com, Laohu.com and its subsequent websites and other websites that may be opened), as well asOther terminal applications, the aforementioned websites and terminals can be called or \"perfect world applications.\"", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74421, "text": "In accordance with relevant laws and regulations, we formulate this policy and committed to protecting your personal information security.", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74422, "text": "This policy contains our clauses to handle and protect your personal information. We recommend that you read this policy completely. When needed, you make a proper choice in accordance with the guidance of this policy.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74423, "text": "In order to make you fully understand the content of this policy, the terms of the existence of or may have a significant relationship with your rights in this policy, we have adopted a rough body to indicate that you pay attention.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74424, "text": "If you do not agree with any content of this policy, we will not be able to provide you with services for perfect world applications (hereinafter referred to as \"service\"), you should immediately stop using our services.", "label": ["Policy Change", "Important"], "rewrite": "If you do not agree with any content of this policy, we will not be able to provide you."}
{"task": "rw_116.jsonl", "id": 74425, "text": "When you agree with this policy, you have agreed that we have agreed to process your relevant information in accordance with this policy.", "label": ["Policy Change", "Important"], "rewrite": "When you agree with this policy, you have agreed that we have agreed to process your relevant information in accordance with this policy."}
{"task": "rw_116.jsonl", "id": 74426, "text": "This policy includes the following:", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74427, "text": "1. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74428, "text": "2. How do we use cookie and related technologies", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74429, "text": "3. How do we save your personal information", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74430, "text": "4. How do we entrust the processing, provide, transfer, and disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74431, "text": "5. Your rights", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74432, "text": "6. Information security", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74433, "text": "7. Minor protection", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74434, "text": "8. Special instructions on the Scenes of Lianyun Channel", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74435, "text": "9. Scope of application of this policy", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74436, "text": "10. Change of this policy", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74437, "text": "11. How to contact us", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74438, "text": "12. Appendix", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74439, "text": "13. Keywords definition", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74440, "text": "1. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74441, "text": "According to the principles of legal, correctness, necessary, and integrity, we only collect the information necessary for the realization of product/service functions to achieve clear and reasonable processing purposes.", "label": ["Important", "First Party Collection Information"], "rewrite": "According to the principles of legal, correctness, necessary, and integrity, we only collect the necessary information to achieve clear and reasonable processing purposes."}
{"task": "rw_116.jsonl", "id": 74442, "text": "When we provide the following functions and services, we may process the following information related to you.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74443, "text": "If you do not provide relevant information, you may not be able to register as our user or enjoy some of the products/services we provide, or you may not be able to achieve the intended effect of using related services.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you do not provide relevant information, you may not be able to register or use certain products/services or to achieve the expected results."}
{"task": "rw_116.jsonl", "id": 74444, "text": "1.1 User registration/login and real -name authentication function", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74445, "text": "You first need to register a perfect world game account (perfect pass account or perfect world mobile game account, excluding third -party accounts) to become a user of Perfect World Games.", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74446, "text": "When you register, you need to provide us with your own mobile phone number or email address. We will verify your identity by sending a SMS verification code or mail.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you register, collect your mobile phone number or email address for authentication"}
{"task": "rw_116.jsonl", "id": 74447, "text": "In order to meet the requirements of laws and regulations and regulators (such as the requirements for real -name authentication for game users), we also need to collect your name and ID number.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your name and ID number to meet the requirements of real -name authentication"}
{"task": "rw_116.jsonl", "id": 74448, "text": "You can also use our products/services (app stores or channels, WeChat, etc., but excluding real-name authentication information) by logging in to the relevant account of the third-party platform that we cooperate with. We will obtain your authorization from such third-party Account name, nickname, open, ID and other information under the account item.", "label": ["Important", "First Party Collection Information"], "rewrite": "When registering and logging in with a third -party account, get your personal information after your authorization"}
{"task": "rw_116.jsonl", "id": 74449, "text": "Regarding the information we provided in the third direction, please carefully read the special prompts of the relevant login interface when logging in, or check the SDK with the login function through the \"third -party SDK collection information list\".", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74450, "text": "When the application is provided in the application, and you use this function to register/log in, we will pass by your authorization from the corresponding mobile, Unicom or telecommunications operator (collectively known as \"operator\") (or authorized by the operator to authorizeService provider) Get your mobile phone number.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you provide a one -click login function in the application and you use this function to register/log in, collect the mobile phone number authorized by the operator"}
{"task": "rw_116.jsonl", "id": 74451, "text": "Getting the above information is to make you no longer need to manually enter the mobile phone number and password, and it can be directly recorded.", "label": ["Important", "Usage"], "rewrite": "Collect the collection number for you can directly and conveniently log in"}
{"task": "rw_116.jsonl", "id": 74452, "text": "Only after you agree with the \"Certification Service Agreement\" and this policy, will we obtain such information and we only provide you with convenient login, accounting and follow -up services within the scope of your consent.", "label": ["Important", "First Party Collection Information"], "rewrite": "We collect your number after you agree with the \"Certification Service Agreement\" and this policy, and use it within the scope of consent"}
{"task": "rw_116.jsonl", "id": 74453, "text": "In order to meet the requirements of laws and regulations and regulatory agencies (such as the requirements for real -name authentication for game users), we need to collect your name and ID number.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your name and ID number for real -name authentication"}
{"task": "rw_116.jsonl", "id": 74454, "text": "1.2 Information display and search function", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74455, "text": "In order to allow you to quickly find the product/service you need, in the process of using our product/service, we may collect the relevant information you generated during our product/service process:", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the relevant information you generated during the use of our product/service"}
{"task": "rw_116.jsonl", "id": 74456, "text": "Equipment information: including hardware models, equipment manufacturers, equipment types, operating system types, device serial numbers, and unique device identifiers (Android, ID/IMEI (if you are authorized)/IMSI (if you are authorized)/IDFA (if you are authorized)/Openudid/GUID/IDFV/, MAC Address/Meid/ESN, etc.), SD card data, processes during operation, device application installation list, and provide you with the best way to display product information display through the above equipment informationEssence", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect equipment information and provide you with the optimal way to provide you with product information display."}
{"task": "rw_116.jsonl", "id": 74457, "text": "Apps your device information when running or silently.", "label": ["Important", "First Party Collection Information"], "rewrite": "Apps your device information when running or silently."}
{"task": "rw_116.jsonl", "id": 74458, "text": "We collect the above information to strengthen your account security, check and ensure the operating status of the game, facilitate adaptation of the terminal or let you quickly find the product/services you need.Use your above personal information.", "label": ["Important", "Usage"], "rewrite": "Collect equipment information to ensure account security, view and ensure game operation status, convenient use of products, and continue to optimize product functions"}
{"task": "rw_116.jsonl", "id": 74459, "text": "Service log information: When you use the products/services we provide, we will obtain the details of your product/service, and save it as a related network log, including your IP address, the type of the browser, the language used, the language used in use, The version of the operating system, the date and time of access, and the web record information you requested.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect service log information"}
{"task": "rw_116.jsonl", "id": 74460, "text": "You can also accurately find the product/service you need by searching.", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74461, "text": "We will keep your search content to facilitate you to enter.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will keep your search content to facilitate you to enter."}
{"task": "rw_116.jsonl", "id": 74462, "text": "Please note that your search keyword information cannot identify your identity alone, not your personal information;", "label": ["Important"], "rewrite": "Your search keyword information cannot identify your identity alone, not your personal information"}
{"task": "rw_116.jsonl", "id": 74463, "text": "Only when your search keyword information is combined with your other information and can identify your identity, during the combination of use, we will use your search keyword information as your personal information, and your search history with your search historyThe records are handled and protected in accordance with this policy.", "label": ["Important", "First Party Collection Information"], "rewrite": "When searching for keywords and other information, it is possible to process and protect personal information when it can identify personal identity."}
{"task": "rw_116.jsonl", "id": 74464, "text": "1.3 Online shopping function", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74465, "text": "When you are going to settle the products/services in your online shopping cart in our online mall, our website system will generate orders you buy the product/service.", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74466, "text": "You need to fill in at least your consignee name, receiving address, mobile phone number and email address in the order (e -mail is selected to send electronic invoices to you). At the same timeThe product/service information you purchase, the amount and payment method you pay for.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your consignee's name, delivery address, mobile phone number and email address for purchasing services or products"}
{"task": "rw_116.jsonl", "id": 74467, "text": "All the above information constitutes your \"order information\". Based on the need to fulfill the shopping contract, we will use your order information to determine transactions, strengthen transaction security, payment settlement, complete distribution, inquire for you, provide customer service consultation and provide customer service consultation and provide customer service consultation and customer service consultation and consultation and consultation and consultation and consultation with you.After -sales service and determine whether the transaction is abnormal.", "label": ["Important", "Usage"], "rewrite": "Use your order information to determine transactions, strengthen transaction security, pay settlement, complete distribution, query your order, provide customer service consultation and after -sales service, and judge whether the transaction is abnormal"}
{"task": "rw_116.jsonl", "id": 74468, "text": "When you use the consumption function in our products/services, based on the need to perform the contract, we will collect your consumption amount, recharge record information, so that you can check your transaction records and protect your virtual items and transactions.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect the information of your consumption amount and recharge record in order to query and protect transaction security for transaction records"}
{"task": "rw_116.jsonl", "id": 74469, "text": "If you place an order for other people through our website shopping system and provide information about the actual product/service receiver, please make sure you have obtained the authorization of the actual product/service receiver about our personal information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you place an order for others to provide information on others, make sure that the consent of the information subject has obtained"}
{"task": "rw_116.jsonl", "id": 74470, "text": "1.4 Payment function", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74471, "text": "When you use the consumption function and choose to pay, you can choose the affiliated parties of the perfect world or the third -party payment institution that cooperates with the perfect world (including Alipay, WeChat Pay and UnionPay, and Netlinage payment channels. The following is called the \"payment institution\" below) Payment services provided.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When you use the consumption function and choose to pay, you can choose the payment service provided by the payment institution"}
{"task": "rw_116.jsonl", "id": 74472, "text": "The payment function itself does not collect your personal information. After obtaining your effective consent, we will share your transaction account number, order number and transaction amount information with these payment institutions to achieve your payment instructions and complete the payment.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After obtaining your consent, share your transaction account, order number and transaction amount information with the payment institution to complete the payment"}
{"task": "rw_116.jsonl", "id": 74473, "text": "For the situation of sharing your personal information with third -party payment institutions, please refer to the \"List of Third -Party SDK Collection Personal Information\" for details.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For the situation of sharing your personal information with third -party payment institutions, please refer"}
{"task": "rw_116.jsonl", "id": 74474, "text": "1.5 Delivery product/service function", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74475, "text": "When you complete the payment, our related parties or the third -party distribution companies (including SF, Zhongtong, etc., which are part of our cooperative third -party distribution company, hereinafter referred to as the \"distribution company\") will complete the delivery of products/services.", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74476, "text": "Based on the need to fulfill the contract, we will provide your order information to our affiliated companies or the third -party distribution company that cooperates with us to ensure that the products you order can be delivered safely.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We shared your order information with related companies or cooperative third parties to complete product delivery or service provision"}
{"task": "rw_116.jsonl", "id": 74477, "text": "1.6 Customer Service and Invoice Function", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74478, "text": "When you communicate with our online customer service/telephone customer service, in order to communicate with you in time, our online customer service/telephone customer service function will use your account information (including mobile phone numbers, emailboxes) and order information.", "label": ["Important", "Usage"], "rewrite": "Our online customer service/telephone customer service function will use your account information and order information to provide customer service services"}
{"task": "rw_116.jsonl", "id": 74479, "text": "In order to ensure the security of your account, under the customer service function, we will ask you to provide your account information, name, game, product and server, game character name and ID and other information to verify your identity.", "label": ["Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "Under the customer service function, we collect your personal information to verify your identity and ensure account security"}
{"task": "rw_116.jsonl", "id": 74480, "text": "Some of our customer service functions (such as account dispute solution, account recharge abnormality, etc., such as customer service functions that have a heavy impact on your account equity) also requires you to provide your ID number, (handheld) ID photo, bank account and////////Or payment information (involved in payment) to verify your identity to prevent your identity from being used.", "label": ["Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "The customer service function that has a heavy influence on your account equity needs to collect your ID number, ID photo, bank account number and/or payment information to verify your identity"}
{"task": "rw_116.jsonl", "id": 74481, "text": "When you use the corresponding customer service function, if we need you to provide the above -mentioned sensitive personal information, we will tell you the \"Account and identity verification personal information protection rules\" through pop -ups. We will handle it after obtaining your consent.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will inform the \"Account and identity verification personal information protection rules\" and obtain your consent before collecting the pop -up window"}
{"task": "rw_116.jsonl", "id": 74482, "text": "When you need us to provide customer service and after -sales service related to your order information, we will check your order information.", "label": ["Important", "Usage"], "rewrite": "We will check your order information to provide you with order -related services"}
{"task": "rw_116.jsonl", "id": 74483, "text": "You may provide other information outside of the above information when communicating with our customer service staff, such as when you ask us to change the delivery address, contact or contact number.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you communicate with customer service, we may collect information other than the order information according to your requirements"}
{"task": "rw_116.jsonl", "id": 74484, "text": "If you ask us to issue a paper invoice, we will collect your order information, user name (individual / unit name), tax number (individual do not need), address and contact information to respond to your requirements.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If you ask for a invoice, we will collect order information, user names (individual / unit name), tax number (individual do not need), address and contact information"}
{"task": "rw_116.jsonl", "id": 74485, "text": "Personal information protection during the invoice mail follows Article 1.5 of this policy.", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74486, "text": "1.7 Marketing promotion or special activity", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74487, "text": "You may need to submit your personal information through our customer service or participating in our activities and investigations. According to the content of the research activities you participate in, we may need to fill in your name, telephone or other survey when filling in the questionnaireActivities related information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you participate in the event or research, we may collect information related to your questionnaire, phone or other information related to research activities"}
{"task": "rw_116.jsonl", "id": 74488, "text": "After you participate in our lottery and win a prize, in order for us to contact you and send you gifts, you need to provide us with your name, address and phone number.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "After you participate in the lottery and win the prize, we will collect your name, address, and telephone number to contact and mail"}
{"task": "rw_116.jsonl", "id": 74489, "text": "When you apply products in Perfect World and receive products through offline activities and corresponding after -sales refund, you need to provide us with your account number and order information to confirm your identity.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your account number and order information to confirm your identity for offline products that receive or order or correspond to after -sales refund"}
{"task": "rw_116.jsonl", "id": 74490, "text": "1.8 Review, sharing, and interactive functions", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74491, "text": "You can upload photos in Perfect World to achieve photo shopping functions, sun -order and evaluation functions. We will use the photos you uploaded to identify the evaluation of the products you need to buy or use the picture you uploaded.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We will use the photos you upload to identify the products you need to buy or use the evaluation of your uploading pictures"}
{"task": "rw_116.jsonl", "id": 74492, "text": "Our products/services can allow you not only to share your relevant information with other users using the product/service, for example, the information uploaded or published in our products/services (includingYour public information), your response to the information uploaded or published by others.", "label": ["Important", "Edit/Control"], "rewrite": "Share your relevant information with other users in our products / services"}
{"task": "rw_116.jsonl", "id": 74493, "text": "The information (including the information (including the information (including the information (including the information (including the text, text, voice, videos, and other players in the game in the game) contains the information (metadata data) and other users using us in the game, text, voice, videos, and other methods.The information shared when the product/service has the user's personal information may also contain your or other people's personal information and even sensitive personal information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "You may contain your personal information or even sensitive personal information in the information you share or other users."}
{"task": "rw_116.jsonl", "id": 74494, "text": "Please consider whether to share relevant information when using our products/services.", "label": ["Third Party Sharing/ Disclosure", "Important", "Edit/Control"], "rewrite": "Care carefully!Whether to share or even share relevant information."}
{"task": "rw_116.jsonl", "id": 74495, "text": "If you involve the personal information of others in your public release, you need to obtain the consent of others before the release.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74496, "text": "When you interact with other users in our games and other applications, in order to filter pornography, superstition, gambling, horror, violence, malicious advertisements and other improper content, we may collect the text, pictures, voice, videos of your sending, think that we thinkYou provide a healthy online game environment.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect interactive information such as text, pictures, voice, videos and other interactive information you sent to filter the improper content of pornography, superstition, gambling, horror, violence, malicious advertisements and other improper content"}
{"task": "rw_116.jsonl", "id": 74497, "text": "You can delete the information you shared through the setting of the product/service or the guidance we provided.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74498, "text": "But please note that this information may still be cached, replicated or stored independently by other users or non -associated third parties that are not controlled by us, or preserved by other users or third parties in the public field.", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "After deleting the information you shared, it may still be stored independently by other users or the third parties that are not controlled by us"}
{"task": "rw_116.jsonl", "id": 74499, "text": "1.9 Notice and Announcement", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74500, "text": "When you use our products/services, we use the mobile phone number or mailbox you provided when you register to provide you with emails, SMS, information or notifications about our products or services (collectively referred to as \"notifications\").", "label": ["Important", "Usage"], "rewrite": "We use the mobile phone number or mailbox provided when you register to provide you with a notice of products or services"}
{"task": "rw_116.jsonl", "id": 74501, "text": "If you do not want to receive these notices, you can choose to cancel the subscription through the corresponding settings sent by us, or ask us to stop processing your personal information based on the above use.", "label": ["Important", "Edit/Control"], "rewrite": "You can choose to cancel the notification subscription through the corresponding settings sent by the attachment, or ask us to stop processing your personal information"}
{"task": "rw_116.jsonl", "id": 74502, "text": "We may issue an announcement related to the service -related announcement when necessary (for example, when the system maintenance is suspended due to system maintenance).", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74503, "text": "You cannot cancel these announcements related to services and nature.", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74504, "text": "1.10 Advertising", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74505, "text": "We may use your advertising logo to send you marketing information to you through our product/services, emails, or other methods to provide or promote our products/services, our affiliate companies and partners' products/services.", "label": ["Important", "Usage"], "rewrite": "We may use your advertising logo to send marketing messages, provide or promote products or services"}
{"task": "rw_116.jsonl", "id": 74506, "text": "At present, the advertising logo we use is an Internet advertising logo. The generation of this logo and its related services are provided by the China -Guangzhou Association Advertising Information Cultural Communication Co., Ltd.", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74507, "text": "We may collect and use advertising identification information that meets national or industry group standards. This logo is based on non -privacy information such as equipment models and system configuration to ensure your privacy and service security.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect and use advertising identification information that meets national or industry group standards for advertising attribution analysis"}
{"task": "rw_116.jsonl", "id": 74508, "text": "If you don't want us to use the advertising logo information for the above, we can notify us to close in accordance with the contact information in this policy.", "label": ["Important", "Edit/Control"], "rewrite": "You can contact us to close the collection of advertising identification information"}
{"task": "rw_116.jsonl", "id": 74509, "text": "After closing, we will no longer obtain and handle the Internet advertising logo.", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74510, "text": "1.11 View and maintain game operation status", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74511, "text": "In order to facilitate you to view the equipment and records of the account, maintain the normal operation and account security of the product/service, and improve the game experience, we will collect and use your related operation information and game information in our games, (including login status, battle information information, confrontation information information, battle information information/Status, achievement information, etc.), and can be displayed to you or other users or friends.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect and use your related operation information and game information in our games, and you can show it to you or other users or friends"}
{"task": "rw_116.jsonl", "id": 74512, "text": "But we will provide you with relevant authority depending on the specific situation of the game product so that you can set the relevant information about whether the relevant information described before.", "label": ["Important", "Edit/Control"], "rewrite": "You can set the corresponding information on whether to display the relevant information before"}
{"task": "rw_116.jsonl", "id": 74513, "text": "When you use our game service, we will collect your game logs, including login logs, items logs, game -match information, and dating record information, so that you can view your game history and use it for game operation analysis and securityAnalyze and improve your gaming experience.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your game log for viewing of game history, game operation analysis and security analysis, enhance the game experience"}
{"task": "rw_116.jsonl", "id": 74514, "text": "1.12 Guarantee account and service security", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74515, "text": "In order to improve the security of the services you provide, and to prevent fraud and Trojan viruses more accurately, we may judge your account risk by understanding your network usage habits and software information you often use, and mayWill record some links that we think are risky (\"url\").", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Improving the security of the service by understanding your network usage habits, your commonly used software information and other means"}
{"task": "rw_116.jsonl", "id": 74516, "text": "In order to ensure your game account security and create a fair, healthy and safe game environment, we will collect your IP address, application and installation list, hardware and operating system information, process and game crash data, performance data, other diagnostic data information, and other diagnostic data information.To combat the normal environment or interference to destroy game fair environment or interference, and destroy the normal conduct of game services (such as to detect piracy, scan plug -in, prevent cheating, etc.).", "label": ["Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "Collect your IP address, application installation list, hardware and operating system information, process and game crash data, performance data, and other diagnostic data information to ensure game fairness"}
{"task": "rw_116.jsonl", "id": 74517, "text": "1.13 Equipment rights adjustment", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74518, "text": "In the process of providing services, the specific scenarios and functions of the service may require you to turn on some equipment access rights.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74519, "text": "You can choose whether to authorize us to use the relevant authority of your device.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74520, "text": "If you do not authorize us to use relevant permissions, it may cause some products/services to be unavailable, but it does not affect the basic functions and other functions of your corresponding product/service.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74521, "text": "After obtaining your consent, we will access the camera (camera), album (picture library), microphone/recording, geographical location, etc. of your device to realize shooting, scanning code, uploading pictures, voice calls, location -based providing location provisionInformation collection and use involved in related services and other functions.", "label": ["Permission Acquisition", "Important"], "rewrite": "After obtaining your consent, we will access the camera (camera), album (picture library), microphone/recording, geographical location of your device to achieve information collection and use"}
{"task": "rw_116.jsonl", "id": 74522, "text": "For example, when you want to interact with other game players through pictures, voice, videos, and participate in live broadcasts. After you have authorized consent, we will access your photos or storage files, microphones, cameras, and geographical location to provide you with screenshots saving, pictures, picturesUpload, voice chat, find nearby gamers to interact with them.", "label": ["Permission Acquisition", "Important"], "rewrite": "We will access photos or storage files, microphones, cameras, and geographic locations authorized by you to provide you with interactive functions"}
{"task": "rw_116.jsonl", "id": 74523, "text": "Please note that when you turn on these permissions, it means that you authorize us to collect and use these personal information to achieve the above functions. If you turn off the authority, it means that you cancel these authorization, and we will no longer continue to collect and use your individuals.Information cannot provide you with the functions corresponding to these authorization.", "label": ["Permission Acquisition", "Important"], "rewrite": "Opening one authority, which means authorized collection and use of relevant information to provide corresponding services, closing any authority representative cancels the authorization, and no longer continues to collect and use relevant information based on the corresponding permissions"}
{"task": "rw_116.jsonl", "id": 74524, "text": "The decision to close permissions will not affect the processing of personal information based on your authorization.", "label": ["Permission Acquisition", "Important"], "rewrite": "Closing authority will not affect the collection and use of information based on authorization before"}
{"task": "rw_116.jsonl", "id": 74525, "text": "You can also choose to close part or all permissions at any time in the setting function of the device, thereby withdrawing your consent to grant us a certain permissions.", "label": ["Edit/Control", "Important"], "rewrite": "Select the closing part or all permissions in the setting function of the device, so as to withdraw the consent of the permissions"}
{"task": "rw_116.jsonl", "id": 74526, "text": "In different devices, the right display method and closing method may be different. For details, please refer to the device and system developer instructions or guidance.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74527, "text": "For users using the Android system and IOS system, please refer to the \"System Permission List\" for the use of our permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "For our authority usage, see the \"System permissions List\""}
{"task": "rw_116.jsonl", "id": 74528, "text": "Note: When you use device with deep camera functions (such as iPhone, X mobile phones, some Android phones) and you can get the AR (enhanced reality) experience in our product/service, such as usThrough TrueDepth and API, you can get a small amount of emoticon feature value and map it into the game character, which can achieve the effect of synchronization and makeup of the character.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "When you use a device with a deep camera function and agree to open the camera, you can get AR (augmented reality) experience"}
{"task": "rw_116.jsonl", "id": 74529, "text": "In the process of using our AR experience,", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74530, "text": "· We cannot get your personal information (including your face, ID) through the deep camera you comes with your device.", "label": ["Permission Acquisition", "Important"], "rewrite": "In AR experience, we cannot get your personal information through a deep camera"}
{"task": "rw_116.jsonl", "id": 74531, "text": "We cannot recognize anyone through the value obtained by TrueDepth, API.", "label": ["Important"], "rewrite": "The value obtained by our TrueDepth API cannot recognize anyone"}
{"task": "rw_116.jsonl", "id": 74532, "text": "·, All data obtained by your device's own deep camera (such as through TrueDepth, API) will instantly delete and do not store any storage (including data records such as cache, cloud storage)Any third party.", "label": ["Data Retention", "Important", "First Party Collection Information"], "rewrite": "All data obtained by the deep camera function that we comes with your device do not make any storage, provide or shared"}
{"task": "rw_116.jsonl", "id": 74533, "text": "·, You can use the switch in the settings to terminate the camera in your device at any time.", "label": ["Important", "Edit/Control"], "rewrite": "You can terminate the camera by the switch in the settings"}
{"task": "rw_116.jsonl", "id": 74534, "text": "In order to avoid doubt, when you project the character image and virtual scene in the real scene that you can shoot in your camera, you don't need to click the shooting button, and we will not collect any personal information in this process.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you project the character image and virtual scene in the real scene, we will not collect any personal information of your"}
{"task": "rw_116.jsonl", "id": 74535, "text": "1.14 The legitimacy foundation except consent", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74536, "text": "According to the relevant laws and regulations, in the following circumstances, we can process your personal information without obtaining your consent:", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "According to the relevant laws and regulations, in the following circumstances, we can process your personal information without obtaining your consent:"}
{"task": "rw_116.jsonl", "id": 74537, "text": "(1) It is necessary for the contract to establish and fulfill your contract as one party;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "It is necessary to set up and fulfill your contract as a party as a party"}
{"task": "rw_116.jsonl", "id": 74538, "text": "(2) It is necessary for fulfilling legal duties or legal obligations (such as collecting and processing your player's real -name authentication information);", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "It is necessary to fulfill the legal duties or legal obligations (such as collecting and processing your player's real -name authentication information)"}
{"task": "rw_116.jsonl", "id": 74539, "text": "(3) In order to deal with emergencies, or in urgent situations to protect the health and property safety of natural people;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to deal with emergencies, or in urgent situations, it is necessary to protect the health and property security of natural persons"}
{"task": "rw_116.jsonl", "id": 74540, "text": "(4) Implement news reports and public opinion supervision for public interests, and handle personal information within a reasonable range;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Implement news reports and public opinion supervision for public interests, and handle personal information within a reasonable range"}
{"task": "rw_116.jsonl", "id": 74541, "text": "(5) Process personal information on your own or other legal disclosure within a reasonable range;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Treatment of individuals' own disclosure or other legal information within a reasonable range"}
{"task": "rw_116.jsonl", "id": 74542, "text": "(6) Other circumstances stipulated in laws and administrative regulations.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Other circumstances stipulated in laws and administrative regulations"}
{"task": "rw_116.jsonl", "id": 74543, "text": "In order to cooperate with judicial work such as investigation, prosecution, trial, and judgment execution, we may provide public security or judicial organs with information -related materials, which may include information such as your account, mobile phone number, recharge records, and service usage.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may provide public security or judicial organs with complaint materials containing your personal information to cooperate with judicial work"}
{"task": "rw_116.jsonl", "id": 74544, "text": "If the above -mentioned legitimacy foundation is not applicable, you know and agree to provide our personal information to relevant public security or judicial organs based on the above goals.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If the above legitimacy is not applicable, you know and agree to provide our personal information to relevant public security or judicial organs based on the above goals"}
{"task": "rw_116.jsonl", "id": 74545, "text": "2. How do we use cookie and related technologies", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74546, "text": "When you use our product/service, we will store small data files named Cookie on your computer or mobile device.", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74547, "text": "Cookie usually contains identifiers, site names, and some numbers and characters.", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74548, "text": "We use these information to determine whether the registered users have logged in to improve service/product quality and optimize user experience.", "label": ["Important", "Usage"], "rewrite": "We use judgment whether the registered user has logged in to improve service/product quality and optimize user experience cookies"}
{"task": "rw_116.jsonl", "id": 74549, "text": "2.1, the log storage function embedded in each game may collect the behavior information (including game character information) of the game user, and store these information as a log text and use it to improve our game.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The log storage function may collect and store the behavior information of the game users used to improve the game"}
{"task": "rw_116.jsonl", "id": 74550, "text": "2.2, we or our third -party partners may collect and use your information through cookies and online beacon, and store these information as log information.", "label": ["Important", "First Party Collection Information"], "rewrite": "It may be collected and used by cookies and online Beacon and stored it as a log message."}
{"task": "rw_116.jsonl", "id": 74551, "text": "We use our own cookies and online beacon to collect your information for the following uses:", "label": ["Important", "Usage"], "rewrite": "We use our own cookies and online beacon to collect your information to remember your identity and analyze the service usage."}
{"task": "rw_116.jsonl", "id": 74552, "text": "2.2.1 Remember your identity.", "label": ["Usage"], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74553, "text": "For example: Cookie helps us recognize your identity as our registered user, or save the preferences you use to use our service;", "label": ["Usage"], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74554, "text": "2.2.2, using the Internet Beacon can help the website to calculate the user on the webpage or visit some cookies. We will collect information about your browsing web activities through the network beacon, such as the page address you visit, the address you previously visited the page you visited the pageThe time you stay on the page, your browsing environment, display settings, etc.;", "label": ["Important", "First Party Collection Information"], "rewrite": "Using the Internet Beacon can help collect information about web activities or access some cookies"}
{"task": "rw_116.jsonl", "id": 74555, "text": "2.2.3 Analyze the situation of your service.", "label": ["Usage"], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74556, "text": "For example, we can use cookie to understand what activities you use our services, or which web pages or services are most popular.", "label": ["Important", "Usage"], "rewrite": "Use cookie to understand the relevant information of your service service"}
{"task": "rw_116.jsonl", "id": 74557, "text": "We will not use Cookie for any purpose outside the purpose of this policy.", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74558, "text": "You can modify the degree of acceptance of Cookie through the browser settings or reject our cookies. For more information, see the help menu or device attached document in the Internet browser.", "label": ["Important", "Edit/Control"], "rewrite": "You can modify the acceptance of Cookie through the browser settings or reject our cookies"}
{"task": "rw_116.jsonl", "id": 74559, "text": "But please note that if Cookie is discontinued, you may not be able to enjoy the best service experience, and certain services may not be used normally.", "label": ["Important", "Edit/Control"], "rewrite": "If Cookie is discontinued, you may not be able to enjoy the best service experience, or you may not be able to use certain services normally"}
{"task": "rw_116.jsonl", "id": 74560, "text": "Our products / services may have Cookie or online Beacon placed by advertisers or other partners, which may collect non -personal identity information related to you to understand how you use these services or evaluate service effects.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "There may be any non -personal identity information related to you or other partners placed by advertisers or other partners to collect non -personal identity information related to you"}
{"task": "rw_116.jsonl", "id": 74561, "text": "These third -party cookies or online beacon collection and use of these information are not subject to this policy, but are subject to the personal information protection policy of related third parties. We do not bear responsibility for third -party information collection behavior.", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74562, "text": "For more, see our \"Cookie Policy\".", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74563, "text": "3. How do we save your personal information", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74564, "text": "3.1, we will only retain your personal information within the shortest period of the purpose of the cost of reaching the cost of reaching the cost of reaching the cost, that is, when a game provided by us as a data processor, we will get off, stop service or you follow the 7th of this policy.When exercising the right to cancel the account, the data in the game (including account information, behavioral data, role data and other data) will be deleted or anonymous.", "label": ["Data Retention", "Important"], "rewrite": "Keep your personal information within the required period of the purpose of the cost of reaching the cost of the cost"}
{"task": "rw_116.jsonl", "id": 74565, "text": "After exceeding the storage period, we will delete or processes your personal information, but national laws, regulations, regulations, standardized documents, or government policies and orders have other requirements or to fulfill our compliance obligationsExcept for your personal information.", "label": ["Data Retention", "Important"], "rewrite": "After exceeding the storage period, you will delete your personal information or perform anonymous processing, except for other provisions of laws and regulations."}
{"task": "rw_116.jsonl", "id": 74566, "text": "For example: \"E -Commerce Law\" requires that the preservation time of goods and service information and transaction information is not less than three years from the date of completion of the transaction;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74567, "text": "The \"Cyber Security Law\" requires technical measures to monitor, record the operating status of the network, and network security incidents, and keep the relevant network logs in accordance with the regulations of no less than six months.", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74568, "text": "3.2, the personal information we collected and generated in the territory of the People's Republic of China will be stored in the territory of the People's Republic of China.", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in the domestic operations will be stored in China"}
{"task": "rw_116.jsonl", "id": 74569, "text": "3.3, when our product/service stops operation, we will stop collecting your personal information in time, and will notify you in the form of push notification or announcement, and will delete or anonymous your personal information.It is dealt with, but the national laws, regulations, regulations, standardized documents, or government policies and orders have other requirements or reserve your personal information to fulfill our personal information to fulfill our compliance obligations.", "label": ["Important", "Cessation of Operations"], "rewrite": "When stopping operation, an announcement will be announced in accordance with relevant laws and regulations, and your personal information will be deleted or anonymous."}
{"task": "rw_116.jsonl", "id": 74570, "text": "In order to avoid doubt, when the product/service stops operation, our deletion or anonymous processing of your personal information does not affect our affiliated company to continue processing your personal information provided in other products/services based on your consentThen use other products/services provided by these related companies accordingly.", "label": ["Important", "Cessation of Operations"], "rewrite": "The deletion or anonymous processing of your personal information when the product/service stops operation does not affect the processing of your information based on your consent"}
{"task": "rw_116.jsonl", "id": 74571, "text": "4. How do we entrust the processing, provide, transfer, and disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74572, "text": "4.1 Entrusted processing", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74573, "text": "In order to provide you with more complete and high -quality products / services, some functions may be provided by our service partners (including our third -party service providers, contractors, agents), and we will entrust the service partnerSome personal information, such as third -party suppliers, send emails or push notifications on behalf of us, and send game survey invitations on behalf of us.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will entrust the service partner to handle some of your personal information to provide better services"}
{"task": "rw_116.jsonl", "id": 74574, "text": "For companies, organizations, and individuals that accept our personal information, we will sign a data processing agreement with them, clarify the responsibilities, processing matters and the purpose of handling, etc., and require themSafety measures to handle personal information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will sign a data processing agreement with the client, asking them to handle personal information in accordance with our requirements, this policy, and related confidentiality and security measures"}
{"task": "rw_116.jsonl", "id": 74575, "text": "Based on the consent to handle your personal information, such as such third parties to change the purpose of the processing of personal information, these third parties should once again obtain your consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The third party is based on the consent of personal information. If the purpose of changing personal information, you should get your consent again"}
{"task": "rw_116.jsonl", "id": 74576, "text": "If you refuse our service partners to collect personal information necessary for services when providing services, it may cause you to be unable to use our products / services to enjoy the services provided by the partner.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Reject our service partner collecting the necessary personal information may cause the service that the partner can not be used by the partner"}
{"task": "rw_116.jsonl", "id": 74577, "text": "Regarding our partner (entrusted processing) to handle personal information types and collection purposes, please refer to the \"List of Third -Party SDK Collection of Personal Information\" for details.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For details, please refer to \"List of Third -Party SDK Collection Personal Information\""}
{"task": "rw_116.jsonl", "id": 74578, "text": "4.2 Provide by other personal information processors", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74579, "text": "For your personal information, we are only within the purpose and scope described in this policy or are dealt with in accordance with the requirements of laws and regulations, and strictly keep confidential.", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74580, "text": "We will not provide your personal information to any company, organization and individual outside the perfect world, unless it is in accordance with legal legitimacy.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74581, "text": "If we provide your information to other personal information processors, we will follow the principles of legal, legitimate, and necessary, and provide third parties with the necessary personal information to achieve relevant purposes.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will follow the principles of legitimate, correct, and necessary, and provide the personal information necessary for third parties to achieve relevant purposes."}
{"task": "rw_116.jsonl", "id": 74582, "text": "We will inform you that the name or name, contact information, processing purpose, processing method, and personal information of the receiver will meet the types of legal legitimacy.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Those who meet the legal reason to provide information, we will inform you that the name or name, contact information, processing purpose, processing method, and personal information of the receiver will tell you"}
{"task": "rw_116.jsonl", "id": 74583, "text": "Based on your consent to handle personal information, we will get your separate consent).", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74584, "text": "At the same time, we will use encryption, de -identification and other means to ensure your information security.", "label": ["Important", "Data Security"], "rewrite": "We will use encryption, de -identification and other means to ensure your information security"}
{"task": "rw_116.jsonl", "id": 74585, "text": "For companies, organizations, and individuals that receive personal information we provide, we will sign a data processing agreement with them, clarify the responsibilities, processing matters, and the purpose of handling, etc., and require them to deal withpersonal information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will sign a data processing agreement with the information receiver, asking them to handle personal information in accordance with our requirements, this policy, and related security measures"}
{"task": "rw_116.jsonl", "id": 74586, "text": "If you refuse to provide personal information for services outside, it may cause you to be unable to use our products / services to enjoy the services provided by the partner.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you refuse the personal information necessary for us to provide services, it may cause some services that cannot be used"}
{"task": "rw_116.jsonl", "id": 74587, "text": "For details of our partner (provided to the outside) to handle personal information, the purpose of handling, the names or names of the partner's name, name, contact information, etc. For details, please refer to the \"List of Personal Information for Third -Party SDK\".", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For details, please refer to \"List of Third -Party SDK Processing Personal Information\""}
{"task": "rw_116.jsonl", "id": 74588, "text": "4.3 Transfer", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74589, "text": "In principle, we will not transfer your personal information to any company, organization and individual. When involving mergers, acquisitions or bankruptcy liquidation, if you involve personal information transfer, we will inform you that the name or name and contact information of the receiver will be informed of youAnd will require new companies and organizations holding your personal information to continue to be subject to this policy.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When the company occurs or involves merging, acquisition or bankruptcy liquidation, if personal information transfer is involved, companies that require your personal information and organizations will continue to be restricted by this policy or re -obtain your consent."}
{"task": "rw_116.jsonl", "id": 74590, "text": "If any changes in the processing of personal information stipulated in this policy, we will ask the company and organization to regain your consent.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74591, "text": "4.4 Public", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74592, "text": "Unless you obtain your effective consent or have other legitimacy foundations, we will not disclose your personal information to the society or unspecified people.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Unless you obtain your effective consent or have other legitimacy foundations, we will not disclose your personal information to the society or unspecified people"}
{"task": "rw_116.jsonl", "id": 74593, "text": "5. Your rights", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74594, "text": "5.1 Query, copy, or correct, supplement your personal information", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74595, "text": "When you complete your account registration and conduct a reasonable and necessary authentication, you can log in to your account at any time to check, copy or modify the account settings and information.", "label": ["Important", "Edit/Control"], "rewrite": "You can log in to the account to check, copy or modify the account settings and information after registration and authentication"}
{"task": "rw_116.jsonl", "id": 74596, "text": "If you find that the information is wrong, inaccurate or incomplete, you can log in to the perfect world game account (such as the perfect pass account, the perfect world mobile game account, but does not include a third -party account). Modify your account settings.Account information is correct, supplement, or make objections through contact information listed in this policy and request us to correct and supplement it, unless laws and regulations have other provisions.", "label": ["Important", "Edit/Control"], "rewrite": "You can correct, supplement your account information, or make objections in the account settings and ask us to correct and supplement"}
{"task": "rw_116.jsonl", "id": 74597, "text": "If you want to check, copy, or modify your other personal information, or encounter difficulties in the process of exercising the above rights, you can contact us through this policy.Other provisions or this policy statement, except as otherwise agreed.", "label": ["Important", "Edit/Control"], "rewrite": "You can contact us to exercise the right to check, copy or modify personal information. We will complete the verification and processing within 15 days"}
{"task": "rw_116.jsonl", "id": 74598, "text": "5.2 Delete your personal information", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74599, "text": "In the following situations, you can log in to your Perfect World account (such as Perfect Passport account, Perfect World mobile game account, but not including third-party accounts), delete your personal information in your account settings, or contact us through the contacts listed in this policy. To submit a request to us to delete your personal information, except that the personal information has been anonymized or otherwise stipulated by laws and regulations:", "label": ["Important", "Edit/Control"], "rewrite": "You can delete your personal information or contact us to delete in your account settings, but the personal information has been anonymous or except for the laws and regulations."}
{"task": "rw_116.jsonl", "id": 74600, "text": "1) The purpose of the processing purpose has been achieved, unable to achieve or for the purpose of processing;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74601, "text": "2) We have stopped providing product/services or preservation periods that have expired;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74602, "text": "3) You withdraw consent;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74603, "text": "4) We violate laws, administrative regulations, or deal with personal information agreed in this policy;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74604, "text": "5) Other circumstances stipulated in laws and administrative regulations.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74605, "text": "If you want to delete other personal information or encounter difficulties in the process of exercising the above rights, you can contact us through the way of this policy. We will complete the verification and processing within 15 days, but the laws and regulations have another provisions of the provisions of the laws and regulations.Or except for this policy statement.", "label": ["Important", "Edit/Control"], "rewrite": "You can contact us to exercise the right to delete personal information. We will complete the verification and processing within 15 days"}
{"task": "rw_116.jsonl", "id": 74606, "text": "Please note that the preservation period stipulated in laws, administrative regulations or other normative documents has not yet expired, or it is difficult to achieve technically deleted personal information. We will stop processing except for storage and adopting necessary security protection measures until we can be deleted until it can be deletedOr achieve anonymity.", "label": ["Edit/Control", "Important"], "rewrite": "We stop processing personal information that has not yet expired or is technically difficult to delete, except for storing and taking necessary security protection measures until it can be deleted or anonymized"}
{"task": "rw_116.jsonl", "id": 74607, "text": "5.3 Logging out your account", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74608, "text": "You can also cancel your account through the contact information of this policy or we contact us through our customer service.", "label": ["Edit/Control", "Important"], "rewrite": "You can contact us to ask for a cancellation of your account"}
{"task": "rw_116.jsonl", "id": 74609, "text": "After you voluntarily cancel your account, we will stop providing you with products/services, and your personal information will be deleted or anonymized. For information that is technically difficult to achieve, we will stop processing it except for storage and take necessary security protection measures until it can be deleted or anonymized.", "label": ["Important", "Edit/Control"], "rewrite": "Once you cancel your account, the platform will delete or anonymous information about your account, and we will stop the processing period of the specified preservation period or technically difficult to delete.It can be deleted or achieved anonymous"}
{"task": "rw_116.jsonl", "id": 74610, "text": "Although we will not set up unreasonable conditions or make additional requirements to increase your obligation to cancel the link, if the cancellation account number will affect the legitimate rights and interests of you or others, such as the goods you have to receive, the service that has been paid but not expired,Wait, we will judge and inform whether you support your cancellation requested in combination with your usage of perfect world application services.", "label": ["Important", "Edit/Control"], "rewrite": "If the cancellation of the account will affect the legitimate rights and interests of you or others, we will judge and inform you whether to support your cancellation request"}
{"task": "rw_116.jsonl", "id": 74611, "text": "For details, please refer to our notification in the cancellation link.", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74612, "text": "We are here to remind you that you should choose to cancel your account carefully, because the cancellation account will affect your normal use of perfect world applications or it will bring you many inconvenience to your subsequent use of perfect world applications. Once your account is canceledBack up all the information and data related to the account before the operation.", "label": ["Important", "Edit/Control"], "rewrite": "Once the account is canceled, it will not be recovered, please back up all the information and data related to the account before the operation"}
{"task": "rw_116.jsonl", "id": 74613, "text": "We are not responsible for the adverse effects of your application for cancellation accounts on you.", "label": ["Important"], "rewrite": "We do not assume any responsibility for any adverse effects on you caused by your application for canceling your account"}
{"task": "rw_116.jsonl", "id": 74614, "text": "If you log in quickly through a third -party account, you will need to contact the third -party processing and discipline.", "label": ["Important", "Edit/Control"], "rewrite": "When canceling, if you log in quickly through a third -party account, you will need to contact the third party to deal with the discipline."}
{"task": "rw_116.jsonl", "id": 74615, "text": "5.4 Change the scope of your authorization consent or withdraw authorization", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74616, "text": "Please understand that each business function often needs to open part of the authority and collect the necessary personal information to achieve it, the collection, use and equipment authority of your personal information.", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74617, "text": "You can change the consent range or withdraw your authorization by deleting information in our specific products/services, changing privacy settings, and closing the equipment function in the browser or operating system.", "label": ["Important", "Edit/Control"], "rewrite": "You can change the scope of consent or withdraw authorization by deleting information, changing privacy settings, and closing equipment functions"}
{"task": "rw_116.jsonl", "id": 74618, "text": "You can withdraw the device permissions through your mobile phone system permissions, and you can also open the relevant equipment permissions through this path.", "label": ["Important", "Edit/Control"], "rewrite": "You can withdraw device permissions through your mobile phone system permissions, and you can also enable related device permissions."}
{"task": "rw_116.jsonl", "id": 74619, "text": "Please understand that when you perform the above operations, we will not be able to continue to provide you with the service corresponding to the withdrawal consent or authorization, but it will not affect personal information processing carried out based on your authorization.", "label": ["Important", "Edit/Control"], "rewrite": "Withdrawal authorization will not affect personal information processing based on authorization before"}
{"task": "rw_116.jsonl", "id": 74620, "text": "If you want to change or withdrawn other consent you have already authorized, you can contact us through the withdrawal method provided by the actual interface of the product or the contact information of this policy.", "label": ["Important", "Edit/Control"], "rewrite": "You can contact us to change or withdraw the consent of the other you have authorized"}
{"task": "rw_116.jsonl", "id": 74621, "text": "5.5 Unsubscribe from commercial information", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74622, "text": "If you do not want to receive our promotional SMS or telephone return visits, you can withdraw bips through the corresponding withdrawal function in the information, or explicitly reject it during the telephone return visit.", "label": ["Important", "Edit/Control"], "rewrite": "You can use the corresponding withdrawal function in the information to make a copy of the commercial information, or it can be explicitly rejected during the telephone return visit."}
{"task": "rw_116.jsonl", "id": 74623, "text": "If you want to limit our processing of your personal information or do not want to receive commercial information from us, you can contact us through the contact information listed in this policy and exercise your relevant rights.", "label": ["Important", "Edit/Control"], "rewrite": "Contact us to exercise your rights, that is, limit our personal information processing or refuse to receive the business information we sent"}
{"task": "rw_116.jsonl", "id": 74624, "text": "5.6 Response your request", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74625, "text": "In order to realize the user rights under this policy, or if you have any questions, complaints, opinions, or suggestions for your data subject rights, you can contact us through contact information provided by this policy.", "label": ["Important", "Edit/Control"], "rewrite": "Contact us to achieve user rights, or complaints, opinions or suggestions under this policy"}
{"task": "rw_116.jsonl", "id": 74626, "text": "In order to ensure safety, we may need to provide the corresponding way to prove the legitimacy of your identity and request. We will complete the verification and processing within 15 days after receiving your feedback and verifying your identity.", "label": ["Edit/Control", "Data Security", "Important"], "rewrite": "We will complete the verification and processing within 15 days after receiving your feedback and verifying your identity"}
{"task": "rw_116.jsonl", "id": 74627, "text": "For your reasonable requests, we do not charge fees in principle, but we will charge a certain cost fee as required for multiple repeated and more reasonable limit.", "label": ["Important", "Edit/Control"], "rewrite": "Reasonable requests In principle, not charging and exceeding the reasonable limit of reasonable requests"}
{"task": "rw_116.jsonl", "id": 74628, "text": "For those unseen repetitive, too much technical means (for example, need to develop new systems or fundamentally change the existing industry practice), bring risks or very unrealistic requests to others' legitimate rights and interests, we may refuse.", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "We may refuse those requests that have no repetition, need too much technical means, bring risks or very unrealistic requests to others' legitimate rights and interests"}
{"task": "rw_116.jsonl", "id": 74629, "text": "6. Information security", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74630, "text": "6.1, in order to ensure your information security, we will strive to take reasonable and necessary physical, technical and administrative security measures under the level of technology to protect your information to prevent your information from being lost, misuse, non -use, non -use, non -use, non -use, non -use, non -use, nonAuthorized access, public disclosure and changes, including but not limited to SSL, information encryption storage, data center access control, dedicated network channels and agents.", "label": ["Important", "Data Security"], "rewrite": "Use SSL, information encryption storage, data center access control, dedicated network channels and agency technologies to protect your information."}
{"task": "rw_116.jsonl", "id": 74631, "text": "Please understand that the Internet environment is not 100 % security, and we will try our best to ensure the security of any information you send to us.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74632, "text": "If our physics, technology, or management protection facilities are damaged, the information is caused by unauthorized access, public disclosure, tampering or destruction, which will cause your legitimate rights and interests to be damaged, and we will bear the corresponding legal responsibility.", "label": ["Important", "Data Security"], "rewrite": "If our physical, technical or management protection facilities are damaged, resulting in unauthorized access, public disclosure, tampering or destruction of information, resulting in damage to your legitimate rights and interests, we will bear corresponding legal responsibilities."}
{"task": "rw_116.jsonl", "id": 74633, "text": "6.2, we establish a special management system, process, organization, and take corresponding measures to ensure information security.", "label": ["Important", "Data Security"], "rewrite": "Establish a special management system, process, organization, and take corresponding measures to ensure information security"}
{"task": "rw_116.jsonl", "id": 74634, "text": "For example, we strictly manage the employees or outsourcing staff who may contact you, including but not limited to adopting different permissions control according to the different positions, signed confidentiality agreements, monitoring their operations, etc.", "label": ["Important", "Data Security"], "rewrite": "Employees or outsourcing staff who may be exposed to you have also adopted strict management."}
{"task": "rw_116.jsonl", "id": 74635, "text": "Organize data security or compliance training for employees.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74636, "text": "6.3, if we confirm security incidents such as personal information leakage, we will start emergency plans to prevent the expansion of security incidents, and inform you in the form of push notifications and announcements. It is difficult to inform personal information one by one.Publish announcement.", "label": ["Important", "Data Security"], "rewrite": "Start the emergency plan in a timely manner to deal with safety events, and take reasonable and necessary measures to reduce the impact on your personal impact as much as possible"}
{"task": "rw_116.jsonl", "id": 74637, "text": "At the same time, we will also report to personal information security incidents and disposal in accordance with the requirements of the regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "The disposal of personal information security incidents will be reported in accordance with the requirements of the regulatory authorities."}
{"task": "rw_116.jsonl", "id": 74638, "text": "7. Minor protection", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74639, "text": "We attach great importance to the protection of personal information of minors.", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74640, "text": "We encourage parents of minors to read the policy and guide minors to use our products/services.", "label": ["Specific Audiences", "Important"], "rewrite": "We encourage parents of minors to read the policy and guide minors to use our products/services."}
{"task": "rw_116.jsonl", "id": 74641, "text": "We will actively protect the legitimate rights and interests of minors by enabling the anti -addiction system in accordance with the requirements of national defense addiction policies.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74642, "text": "Based on statutory requirements, we will determine whether the real -name information of the relevant account is minors through information verification such as real -name identity, and then decide whether this account is included in the anti -addiction system.", "label": ["Specific Audiences", "Important"], "rewrite": "Determine whether the real -name information of the relevant account through real -name identity and other information verification is a minor, and then decide whether to incorporate this account into the anti -addiction system"}
{"task": "rw_116.jsonl", "id": 74643, "text": "In addition, we will collect information such as your login time, game duration, and guide minors to make rational games by automatic intervention and restricting minors' game time and enabled offline functions.", "label": ["Specific Audiences", "First Party Collection Information", "Important"], "rewrite": "Collect information such as login time, game duration and other information, automatically intervention and restrict the game time of minors at the system level, and enable the forced offline function"}
{"task": "rw_116.jsonl", "id": 74644, "text": "If we identify you under the age of 14, your parents need to read and agree to this policy and complete the guardian certification, otherwise you will not be able to start the game.", "label": ["Specific Audiences", "Important"], "rewrite": "If we identify you as a child under the age of 14, before you start the game, your parents need to read and agree to this policy, and complete the guardian certification"}
{"task": "rw_116.jsonl", "id": 74645, "text": "For the protection of personal information under the age of 14, please refer to our \"Guidelines for the Protection of Personal Information Protection of Perfect World Game Children\".", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74646, "text": "If you are the parents or guardians of the minor, when you have any questions about the personal information and related information of the minors you monitor, please contact us through the contact information listed in this policy.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74647, "text": "8. Special instructions on the Scenes of Lianyun Channel", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74648, "text": "We will provide our services through third -party Android mobile game application distribution platforms and end -game operation platforms (hereinafter collectively referred to as \"Lianyou Channel\" or \"Channel Fang\").", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74649, "text": "In these channels, you can download and install our services through the channel party's mobile game application distribution platform and end -game operation platform.Services and real -name authentication (if we log in according to the regulatory requirements or based on the agreement with certain channel parties, we will inform you separately after you log in with such channel accounts).", "label": ["Important", "First Party Collection Information"], "rewrite": "The channel side provides you with account creation and management account -related services and payment function services to you in his own name, and conducts real -name authentication"}
{"task": "rw_116.jsonl", "id": 74650, "text": "8.1 Information collected by the channel party", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74651, "text": "If you get our services through the channel party, the channel party will collect your device information or information in our service by accessing SDK in our service or in other ways (including silent state).", "label": ["Important", "First Party Collection Information"], "rewrite": "If you get our services through the channel party, the channel party will collect your equipment information or the information you use in our service"}
{"task": "rw_116.jsonl", "id": 74652, "text": "When you download, install our services or use the corresponding functions through the channel party, please pay attention to applying for authorization of your device authority and application for collecting your personal information based on the needs of the channel party.", "label": ["First Party Collection Information", "Permission Acquisition"], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74653, "text": "For details, please refer to the \"List of Personal Information for Android Channels\".", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74654, "text": "The channel party is an independent personal information processing when collecting your personal information from our service, and is responsible for the information collected in the name of the channel itself.", "label": ["Important"], "rewrite": "Channel is an independent personal information processing person who is responsible for the information collected in his own name"}
{"task": "rw_116.jsonl", "id": 74655, "text": "We recommend you to see the personal information protection policy or personal information protection of this channel at the same time to understand its specific practice in data security and personal information protection.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74656, "text": "8.2 The information we obtained from the channel party", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74657, "text": "IP address, etc.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you are recording and using our services through the channel, we will collect your account information, payment information, IP address"}
{"task": "rw_116.jsonl", "id": 74658, "text": "The information collected from these channels may be different due to your privacy settings in such channels, and it is subject to the constraints of the personal information protection policy and service terms of these channels. ThereforeWhen logging in to our service, we carefully read the special prompts of the relevant login interface.", "label": ["Important", "First Party Collection Information"], "rewrite": "The information we collected from these channels may be different from your privacy settings in such channels"}
{"task": "rw_116.jsonl", "id": 74659, "text": "For information obtained from different channels, please refer to the \"List of Sharing Information Gained from the channel\".", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74660, "text": "8.3 Logging out channel party account", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74661, "text": "If you have recorded our service through the channel and you ask for cancellation your account, you need to apply to these channels to cancel the account number or cancel the authorization of logging in to our account.", "label": ["Edit/Control", "Important"], "rewrite": "If you record our services through the channel, you need to apply to the channel party to cancel the account or cancel the account authorization"}
{"task": "rw_116.jsonl", "id": 74662, "text": "Logging out on the account means that we will terminate services to you through this channel account account, and you log in to the channel party account used by our service once it is canceled, and you will not be able to restore all the relevant information and data before the operation.", "label": ["Important", "Edit/Control"], "rewrite": "Once the account is canceled, it will not be recovered, please back up all the relevant information and data before the operation"}
{"task": "rw_116.jsonl", "id": 74663, "text": "9. Scope of application of this policy", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74664, "text": "9.1 Except for certain specific services, all our services apply for this policy.", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74665, "text": "For specific personal information protection policies for certain services, we will more specifically explain how we use your personal information in these services.", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74666, "text": "The personal information protection policy of these specific services constitutes part of the cost.", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74667, "text": "If the personal information protection policy of related specific services is inconsistent with this policy, the personal information protection policy for the specific service is applicable.", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74668, "text": "9.2 Please note that this policy is only applicable to the situation of perfecting personal information, and the services provided by other companies or individuals are not applicable.", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74669, "text": "Specifically, this policy is not applicable to the following situations:", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74670, "text": "9.2.1 Information collected by a third -party service (including any third -party website and application) accessed through our services.", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74671, "text": "This policy is only applicable to the information we collected, and it does not apply to any third -party service or third -party information usage rules. We do not have any responsibility for these third -party collection and use of your personal information;", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74672, "text": "9.2.2 The information collected by other companies or institutions in our services in our services.", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74673, "text": "Please know: If you provide your personal information to the third party when you browse a third -party website or using a third -party product/service, your information should apply the personal information protection policy or similar policy of the third party, you need to read carefullyIts policy content.", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74674, "text": "We do not have any legal responsibilities for any third parties to be used or disclosed by you, whether you log in or browse the above websites, software, or whether your product/service is based on our link or guidance.", "label": ["Important", "Risk"], "rewrite": "We do not assume any legal responsibility for any third party's use or disclosure, whether you log in or browse the above websites, software, or use its product/service based on our link or guidance"}
{"task": "rw_116.jsonl", "id": 74675, "text": "10. Change of this policy", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74676, "text": "We reserve the right to update or modify this policy from time to time.", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74677, "text": "We will post any changes to this policy on this page.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74678, "text": "But without your clear consent, we will not reduce the rights you should enjoy in accordance with this policy.", "label": ["Policy Change", "Important"], "rewrite": "After the policy changes, we will not reduce your rights according to your consent."}
{"task": "rw_116.jsonl", "id": 74679, "text": "The historical version can be seen here.", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74680, "text": "Please read the content of this policy carefully.", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74681, "text": "If you do not agree with the change of this policy, or have objections to the modified and updated content of this policy, you can choose to stop using or cancel the account.", "label": ["Policy Change", "Important"], "rewrite": "If you do not agree with the change of this policy, or have objections to the revised and updated content of this policy, you can choose to stop using or cancel the account number"}
{"task": "rw_116.jsonl", "id": 74682, "text": "But please know that the behavior and activities before your account cancellation and stop using this service are still constrained by this policy.", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74683, "text": "For major changes, we will notify or send an email to you in a significant way or notify the changes made by this policy in other ways.", "label": ["Policy Change", "Important"], "rewrite": "For major changes, we will also provide a more significant notice."}
{"task": "rw_116.jsonl", "id": 74684, "text": "The situation of major and substantive changes includes the following situations:", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74685, "text": "(1) Our service model has changed significantly, so that the purpose of handling personal information, the type of personal information, and the use of personal information have changed significantly;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74686, "text": "(2) The right to participate in personal information processing and its exercise methods have undergone major changes.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74687, "text": "11. How to contact us", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74688, "text": "11.1, if you encounter any problems related to personal information protection (including questions, complaints, etc.) when you encounter or use our service, you can get in touch with us in the following ways: (i) send emails to Privacy@PWRD.com;", "label": ["Important", "Contact Information"], "rewrite": "You can get in touch with us in the following ways: (i) Send an email to privacy@pwrd.com;"}
{"task": "rw_116.jsonl", "id": 74689, "text": "(Ii) mailing letter to: No. 1 Perfect World Building, No. 1 Wangjing East Road, Chaoyang District, Beijing, Ministry of Legal Affairs.", "label": ["Important", "Contact Information"], "rewrite": "(Ii) mailing letter to: No. 1 Perfect World Building, No. 1, Wangjing East Road, Chaoyang District, Beijing"}
{"task": "rw_116.jsonl", "id": 74690, "text": "11.2 We will complete the verification and processing within 15 days after receiving your request and verify your identity.", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74691, "text": "If you cannot respond to your request, we will send you notifications and explain the reason within the time limit required by the law.", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74692, "text": "12. Appendix", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74693, "text": "If you are dissatisfied with our reply, or our handling of personal information infringe on your legitimate rights and interests, and after you feed us feedback, we cannot provide you with a satisfactory reply and refuse to improve.Complaints and reports.", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74694, "text": "The interpretation and dispute resolution of this policy shall apply laws of the People's Republic of China.", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74695, "text": "Any dispute related to this policy, the two parties should be resolved by friendly merchants;", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74696, "text": "If it cannot be resolved, there is a jurisdictional court where the Perfect World (Beijing) Software Technology Development Co., Ltd. is located.", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74697, "text": "13. Keywords definition", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74698, "text": "\"Related Company\" refers to the \"one party control, joint control of the other party or the other party, and the two or more parties to be controlled by one party and co -control.Or the relationship of significant influence \", and in the publicly released financial report, we combined statement with Perfect World (Beijing) Software Technology Development Co., Ltd., such as Perfect World (Chongqing) Interactive Technology Co., Ltd.Shanghai Perfect Space and Space Software Co., Ltd., Chengdu Perfect Tianzhiyou Technology Co., Ltd., Suzhou Magic Tower Network Technology Co., Ltd., Beijing Perfect Chijin Technology Co., Ltd., etc.", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74699, "text": "The mobile terminal games in \"Perfect World Application\" include, but not limited to but not limited to the \"Fantasy New Xianxian\" game app, \"Xinxiao Ao Jianghu\" game app, \"New God Mainland\" game app, \"Xianxian\" game app, \"God of War\"Game APP, \"Magic Tower\" game app, \"Perfect World: The Battle of the Gods\" game app, \"Yi Tian Tu Long Ji\" game app, \"Black Cat Strange News Society\" game app, \"Condor Heroes\" game app, \"Yunmengmeng\"Four -time song \"game app,\" very hero save the world \"game app,\" Heroes of the Condor Heroes 2 \"game app,\" Old Legend \"game app,\" Condor Heroes 2 \"game app,\" Dream Room Swan, SwanBlock \"game app,\" Dream Market \"game app,\" Torch Light \"game app,\" God Eagle Heroes 3D \"game app,\" Wulin Foreign Biography \"game app.", "label": [], "rewrite": []}
{"task": "rw_116.jsonl", "id": 74700, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
