{"task": "rw_104.jsonl", "id": 71872, "text": "Lilith Game Privacy Agreement", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 71873, "text": "introduction:", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 71874, "text": "This \"Lilith Game Privacy Agreement\" (hereinafter referred to as the \"Privacy Agreement\") is an inseparable part of the \"Lilith Game License and Service Agreement\" (hereinafter referred to as the \"User Agreement\").With Shanghai Lilith Network Technology Co., Ltd., the registered address is jointly concluded by Room 1116, Building 1, Building 1, No. 655, Yinxiang Road, Jiading District, Shanghai (hereinafter referred to as \"Lilith\" or \"We\").", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 71875, "text": "Unless the user has read and accepted all the content of this privacy agreement, the user has no right to use Lilith games and services. Users use Lilith Games and services to be deemed to have read and agree to sign the privacy agreement.", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 71876, "text": "Among them, \"Wake -up of the Kingdom\" mobile game software copyright owner is Chengdu Leh Dog Technology Co., Ltd., and our company has been authorized to provide users with the operating unit of the mobile game software of \"Wake -ups of the Thousands of Kingdoms\".", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 71877, "text": "If you are a minor under the age of 18, you need to read this privacy agreement accompanied by your guardian, please and your guardian must read it carefully;", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 71878, "text": "Please use the consent of your guardian to the entire terms of this privacy agreement to use the games and services provided by Lilith.", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 71879, "text": "Lilith absolutely respects users' privacy and information, and will strictly protect your privacy and information.", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 71880, "text": "When you use Lilith games and services, we may collect and use your personal information.", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 71881, "text": "We hope to explain to you through this privacy agreement that we correspond to related matters such as collecting and using your personal information to better protect your rights and interests.", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 71882, "text": "Here, the following explanations and explanations are made:", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 71883, "text": "I. explanation of noun", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 71884, "text": "Unless there is another agreement, the nouns used in this privacy agreement usually have the following definitions. If the privacy agreement is not specifically explained, the relevant term is consistent with the user agreement:", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 71885, "text": "1. Personal information (Reference GB/T 35273-2020 \"Information Security Technology Personal Information Security Specification\"): refersVarious information.", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 71886, "text": "Personal information example: Personal information (including personal name, birthday, gender, address, personal mobile phone number, email address, etc.), personal identity information (including identity documents), personal biometric information (including fingerprints, facial features),Network identity information (including system accounts, passwords, IP addresses, personal digital certificates, etc.), personal property information (including bank accounts, passwords, transactions and consumption records, virtual currency, virtual transactions, redemption codes and other virtual property information), communication), communication), communication), communication), communication), communication), communication), communication)The only device identification code, etc.), personal location information (including accurate positioning information, latitude and longitude, etc.).", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 71887, "text": "The types of personal information we actually collected are described by this privacy agreement.", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 71888, "text": "2. Personal sensitive information (refer to GB/T 35273-2020 \"Information Security Technology Personal Information Security Specification\"): It means that once leaked, illegally provided or abuses the security of people and property, it can easily lead to personal reputation and physical and mental health damage.Or personal information of discriminatory treatment.", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 71889, "text": "Example of personal sensitive information: your personal property information, personal identity information, personal biometric information, address book information, friends list, group list, accurate positioning information, personal information of children under 14 years of age (inclusive).", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 71890, "text": "The types of personal sensitive information we actually collect are based on the description of this privacy agreement.", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 71891, "text": "3. Device: refers to devices that can be used to access or use Lilith games and services, such as tablets or smartphones.", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 71892, "text": "4. The only device recognition code: refers to a string of characters edited into the device by the device manufacturer, which can be used to identify the corresponding device in a unique way (such as IMEI/Android ID/IDFA/Openudid/GUID/SIM card/IMSI informationwait).", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 71893, "text": "5. IP address: Each device on the Internet will specify a number, called the Internet protocol (IP) address.", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 71894, "text": "These numbers are usually specified according to geographical areas.", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 71895, "text": "6. Cookie: Cookie is a small file containing string. When you log in and use the website or other network content, you can send and store it in your computer, mobile device or other devices (usually encrypted).", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 71896, "text": "Similar cookies are other technologies that can be used as similar to cookies, such as: Web Beacon, Proxy, embedded script, etc.", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 71897, "text": "7. Lilith account: also known as \"account\" and \"user account\", which refers to the account number that users successfully registered in accordance with the user agreement and related regulations and policies in accordance with Lilith games and services.", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 71898, "text": "2. How do we collect and use personal information:, Lilith collects and uses your service process in accordance with laws and regulations and follow the principles of legitimate, legal, and necessary.personal information.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "Lilith collects and uses personal information in accordance with the principles of legitimate, legal, and necessary."}
{"task": "rw_104.jsonl", "id": 71899, "text": "If we want to use your personal information for other purposes that are not stated in this privacy agreement, or the information collected by specific purposes on other purposes, we will tell you in a reasonable way, and we will tell you in a reasonable way, andRebuild your consent again before use.", "label": ["Important", "Usage"], "rewrite": "The collected information collected for other purposes based on specific purposes, inform you in a timely manner, and obtain consent again before use."}
{"task": "rw_104.jsonl", "id": 71900, "text": "The types of personal information we collect and use include two types: the first: the information necessary for our products and/or services of our products: this typeWe must authorize us to collect.", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 71901, "text": "If you refuse to provide, you will not be able to use our products and/or services normally;", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 71902, "text": "The second: additional business functions may need to be collected: This information is the information required for non -core business functions. You can choose whether to authorize us to collect it.", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 71903, "text": "If you refuse and provide it, it will cause the additional business functions to be unable to achieve or to achieve the effect we intend to achieve, but it will not affect your normal use of core business and work function.", "label": ["Important", "First Party Collection Information"], "rewrite": "If it is refused to provide it, the additional business functions will not be achieved or effective, but it will not affect the normal use of core business functions."}
{"task": "rw_104.jsonl", "id": 71904, "text": "We need to remind you in particular: Because our game products and services are more and the content provided for you is different, the core business functions (including the types of your personal information) will also be due to the content of the game product/service contentDifferent differences are different, and the specific game products/services are actually provided.", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 71905, "text": "In addition, you understand and agree, and we hope that the game products and services that we hope to provide you are perfect, so we will continue to improve our game products and services, including technology, which means that we may often launch new businesses oftenFunctions may need to collect new personal information or change the purpose or method of using personal information.", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 71906, "text": "If a function or game product/service that needs to collect your personal information is not explained in this privacy agreement, we will explain to you by updating this policy, page prompts, pop -ups, website announcements, etc.Letter, the purpose, content, usage and scope of interest collection, and provide you with the way you choose independently, and collect you clearly and collect it.", "label": ["Important", "First Party Collection Information"], "rewrite": "Will explain to you the purpose, content, usage method, and scope of information collection, and provide you with the way you choose to consent, and collect it after obtaining your consent."}
{"task": "rw_104.jsonl", "id": 71907, "text": "In the process, if you have any doubts about related matters, you can contact us through the method of providing by Article 9 of the Privacy Agreement, and we will answer it as soon as possible.", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 71908, "text": "In the process of using Lilith games and services, we usually collect and use your personal information in the following scenes:", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 71909, "text": "1., account registration and identity authentication:, 1), when you register and log in to Lilith user account or use Lilith game products and services, you need to complete a series of registration procedures according to our finger.You need to provide us with the following information: account nickname, user head, portrait, mobile phone number, e -mail.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the following information: account nickname, user avatar, mobile phone number, e -mail."}
{"task": "rw_104.jsonl", "id": 71910, "text": "Collecting the above information is used to mark and identify your login information for Lilith users and save your login information.", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 71911, "text": "The above information is a must -have information for you register and log in to Lilith user account or use Lilith game product and service core. If you choose not to provide, you may not be able to use Lilith game products and services.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "The above information is an essential information for registered and logged in to Lilith user accounts or using core business. If it is not provided, Lilise game products and services may not be used."}
{"task": "rw_104.jsonl", "id": 71912, "text": "2), some of our game products and services support you to log in to the account (WeChat account number/QQ, account) of the third -party platform for login. If you log in with the account of the third -party platform, we will obtain the third party based on your authorization.Related letters under the account (including: third -party account number, user name, nickname, avatar, and other information you have authorized, specifically based on the third party, the account authorization page is displayed).", "label": ["Important", "First Party Collection Information"], "rewrite": "It will obtain the relevant information under the third -party account (including: third -party account, user name, nickname, avatar, and other information you authorize, which are specifically displayed by the third -party account authorization page)."}
{"task": "rw_104.jsonl", "id": 71913, "text": "Collecting the above information is used to provide you with account login service and ensure your account security and prevent security risks.", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 71914, "text": "If you refuse to authorize such information, you will not be able to use the account number of a third -party platform to record our platform, but it will not affect the normal use of other products and services we provide.", "label": ["Permission Acquisition", "Important", "Risk"], "rewrite": "If such information is rejected, it will not be able to log in to the platform with a third -party platform account, but it will not affect the normal use of other products and services."}
{"task": "rw_104.jsonl", "id": 71915, "text": "3), in accordance with the laws, regulations, policies and the requirements of relevant competent authorities, you need to register in real -name to use Lilith games and services.Including names, body, portal number number);", "label": ["Important", "First Party Collection Information"], "rewrite": "You will collect your personal identity information (including name and identity card number) when obtaining consent or active provision."}
{"task": "rw_104.jsonl", "id": 71916, "text": "If you use a third -party account number to log in to Lilith service, after you have authorized, we may obtain your personal identity information (including name and ID number) from the third party.Essence", "label": ["Important", "First Party Collection Information"], "rewrite": "After authorization, personal identity information (including name and ID number) may be obtained from a third party for real -name authentication."}
{"task": "rw_104.jsonl", "id": 71917, "text": "The real -name identity information you provide will be compared with the data source of the authoritative data platform. If the two compare the information, it will be consistent, that is, successfully pass the certification.", "label": ["Important", "First Party Collection Information"], "rewrite": "The real -name identity information provided will be compared with the data source of the authoritative data platform. If the two compare information, they will successfully pass the certification."}
{"task": "rw_104.jsonl", "id": 71918, "text": "The above information is a personal sensitive information. Rejecting to provide the aforementioned information may cause you, unable to log in to Lilith games, or be subject to corresponding restrictions during the use of Lilith games and services.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Rejecting to provide the aforementioned information may cause it to be unable to log in to Lilith game or be subject to corresponding restrictions during use."}
{"task": "rw_104.jsonl", "id": 71919, "text": "If you log in to use the Lilith game and service without passing the real -name authentication, we will provide you with a certain time limit service according to the tourist mode, and only some functions can be provided in the tourist mode. Users cannot conduct recharge operations, chatting, chatting, chattingAnd other functions that are not allowed to provide according to the requirements of the competent authority.", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 71920, "text": "In the tourist mode, Lilith needs to allocate the exclusive logo for the user information based on the equipment information used by the user. Therefore", "label": ["Permission Acquisition", "Important"], "rewrite": "May apply for access to your equipment information."}
{"task": "rw_104.jsonl", "id": 71921, "text": "Including the only device identification code, if you use Android devices, the permissions may be \"telephone\", \"read the status and body of the phone,\", \"read the state of call and the mobile network information\", the same below), should be the same).During the process, Lilith may apply for equipment storage and authority to easily record log information, cache and other local game log information.", "label": ["Permission Acquisition", "Important"], "rewrite": "It may be possible to apply for equipment storage permissions, which is convenient to record log information, cache and other local game log information."}
{"task": "rw_104.jsonl", "id": 71922, "text": "4), in order to meet the real verification of user identity, guarantee system and service security, and other specific service functions (such as account unbundling), etc., we may need you to provide real identity information (including name, identity document number) ,, biometric recognitionInformation, (static or dynamic facial features) to complete identity authentication.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect real identity information (including name, ID number), biometric information (static or dynamic facial features) to complete identity authentication."}
{"task": "rw_104.jsonl", "id": 71923, "text": "If you do not provide the above information, we will not be able to provide you with related functions and services.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If the above information is not provided, related functions and services will not be provided."}
{"task": "rw_104.jsonl", "id": 71924, "text": "In order to achieve the purpose of identity certification, you agree and authorize us to recognize, inquire, and check your aforementioned identity information with your own identity and entrust the third direction.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "It may be the third direction of the identity authentication agency (such as personal credit reporting agencies, government departments, etc.) to check your aforementioned identity information on your own."}
{"task": "rw_104.jsonl", "id": 71925, "text": "Please note that your identity information and biometric information are personal sensitive information. Please provide it with caution. If you refuse to provide you may not be able to obtain related services, but do not affect the normal use of other functions and services.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Refusing to provide personal sensitive information may not be able to obtain related services, but does not affect the normal use of other functions and services."}
{"task": "rw_104.jsonl", "id": 71926, "text": "2. In the process of using Lilith games and services: 1) Read/write to the external storage of the device.", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 71927, "text": "We need to obtain the permissions of reading/writing to the external storage of the device (if you use Android, device, the permissions that may involve \"read external storage permissions\", \"read/write, SD, card content permissions\", \"repair\", \"repair, Moisture/delete, SD, Card Content Permanent \", the same below), obtain the above permissions and information for the installation, storage and reading game archives and files of game products in the device (including the necessary game processes and cache, and reading, Write/download/save/repair, change the information such as pictures or albums, files, collapse logs, etc.) to ensure that you log in to use our services normally, maintain the normal and stable operation of basic functions.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "You need to obtain the permissions of reading/writing to the external storage of the device."}
{"task": "rw_104.jsonl", "id": 71928, "text": "If you refuse to provide the aforementioned permission, it may cause you to be unable to use our related, products and services.", "label": ["Permission Acquisition", "Important", "Risk"], "rewrite": "If you refuse to provide the aforementioned permissions, it may cause you to be unable to use our related products and services."}
{"task": "rw_104.jsonl", "id": 71929, "text": "2) Gaming log information, including login logs, item logs, shop purchase logs, activity logs, guild logs, upgrade, logs, chat logs, game dating records, game pairing information and other users using Lilith game products and servicesThe game log information generated during the process.", "label": ["Important", "First Party Collection Information"], "rewrite": "Will collect game log information."}
{"task": "rw_104.jsonl", "id": 71930, "text": "We collect the above information for game operation statistical analysis, customer service complaint processing, game anti -cheating analysis and other game experience optimization analysis, and at the same time facilitate your viewing your game history records in the game client;", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_104.jsonl", "id": 71931, "text": "If you refuse to provide the aforementioned permissions, it may cause you to be unable to use our related products and services.", "label": ["Permission Acquisition", "Important", "Risk"], "rewrite": "If you refuse to provide the aforementioned permissions, it may cause our related products and services."}
{"task": "rw_104.jsonl", "id": 71932, "text": "3) Interactive information.", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 71933, "text": "Wait for improper content to purify the game environment and maintain a healthy Internet environment.", "label": ["Important", "First Party Collection Information"], "rewrite": "It may be collected and saved the above information content you sent to purify the game environment."}
{"task": "rw_104.jsonl", "id": 71934, "text": "If you want to use voice and other uses, households interact or shoot, upload, and save pictures. After you have authorized consent, Lilith Games will visit your microphone, camera (camera), album, read/written device external storage outside storagePermissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "After authorization and consent, Lilise Games will access microphone, camera (camera), album, read/write external storage permissions."}
{"task": "rw_104.jsonl", "id": 71935, "text": "If you refuse to provide the aforementioned permissions, you will be guided, so you cannot use our related products and services, but it does not affect your normal use of Lilith games and services.You can turn off the aforementioned permissions in the system settings at any time.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "If it is refused to provide the aforementioned authority, it may cause the unable to use related products and services, but it does not affect the normal use of other functions. At the same time, it can also turn off the aforementioned permissions in the system settings at any time."}
{"task": "rw_104.jsonl", "id": 71936, "text": "4) Game application information, device information (sole device recognition code, device serial number, equipment manufacturer, equipment name, equipment type and version, equipment model, device style, equipment MAC address), network identity identification information (IP address), IP address), IP address), IP address), IP address), IP address), IP address), IP address), IP address), IP address)Operating system and process information, network environment information, and game crash records.", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 71937, "text": "We collect the above information for verification, account information, ensure your game account security and advertising data monitoring and verification. At the same time, in order to create a fair, healthy, and secure game environment, it will combat damage to the fair environment or interference of the game, destruction of game servicesNormal behavior (such as, used to detect piracy, scan plug -in, prevent cheating, etc.);", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "Collecting the above information is used to verify account information and create a safe game environment."}
{"task": "rw_104.jsonl", "id": 71938, "text": "We may use your, IP, address recognition device to connect to the location where the Internet is used to achieve specific activity content.", "label": ["Important", "First Party Collection Information"], "rewrite": "You may use your IP address recognition device to connect to the location of the Internet."}
{"task": "rw_104.jsonl", "id": 71939, "text": "5) Trading information, including recharge records, consumption records, and other necessary information related to transactions.", "label": ["Important", "First Party Collection Information"], "rewrite": "Trading information will be collected, including recharge records, consumption records, and other necessary information related to transactions."}
{"task": "rw_104.jsonl", "id": 71940, "text": "When you use some games and consumption functions, we will collect the aforementioned information so that you can check your transaction records and protect your virtual items at the same time.Support disputes.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use certain consumption functions, you will collect the aforementioned information in order to query the transaction record."}
{"task": "rw_104.jsonl", "id": 71941, "text": "The recharge records and consumption records are personal sensitive information. Collecting the above information to achieve the consumption function of Lilith service, it is necessary, otherwise the transaction will not be completed.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "The recharge records and consumption records are personal sensitive information. Collecting the above information is necessary to achieve consumption functions, otherwise the transaction will not be completed."}
{"task": "rw_104.jsonl", "id": 71942, "text": "3. Customer service: When you initiate a complaint, appeal or consult, apply for cancellation with Lilith, for your account number and system security, we may need you to provide account information first, and the individual you provided before with you before, and the individual you provided beforeInformation phase matching to verify your user identity.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect account information and match your previous personal information to verify your user identity."}
{"task": "rw_104.jsonl", "id": 71943, "text": "At the same time, in order to facilitate or solve the problem or send gifts with you, we may also need you to provide names, mobile phones, numbers, emails and other contact information and personal information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect name, mobile phone number, email and other contact information and personal information."}
{"task": "rw_104.jsonl", "id": 71944, "text": "In addition, we will collect your communication information (package, text/picture/audio and video/call record forms) and other necessary information associated with your needs.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your communication information (including text/picture/picture/audio and video/call records), and other necessary information associated with your needs."}
{"task": "rw_104.jsonl", "id": 71945, "text": "The aforementioned information is personal", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 71946, "text": "Sensitive information, we collect the aforementioned information to investigate the facts and help you solve the problem. If you refuse to provide the above information, we may not be able to report the complaints, appeals or consult results in a timely manner.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If you refuse to provide the above information, we may not be able to report the results of complaints, appeals or consultation in a timely manner."}
{"task": "rw_104.jsonl", "id": 71947, "text": "In order to better understand customer needs and optimize services, our customer service staff may contact you through the form of telephone, solve the product use, ask your opinions or conduct a return visit to certain types of activities.", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 71948, "text": "If you do not want to receive such calls, you can contact us through the methods provided in Article 9 of this Privacy Agreement, and we will no longer contact you by phone.", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 71949, "text": "4. Cookie, and similar technologies. To improve related services, Lilith may use, cookies, and similar technologies to store and track related information at some moment.", "label": ["Data Retention", "Important", "First Party Collection Information"], "rewrite": "Lilith may use cookies and similar technologies to store and track relevant information about users at some moment."}
{"task": "rw_104.jsonl", "id": 71950, "text": "The above use is limited to business, market analysis, or academic use in business, market analysis, or academic use of user preferences.", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 71951, "text": "Cookie and similar technologies are available for third parties. For example, advertising services require identifying data, data, etc. as evaluation indicators and data. These data are for analysis and use only to evaluate the advertisements and other promotion and promotion activities in our products or servicesEffect and improve.", "label": ["Usage"], "rewrite": []}
{"task": "rw_104.jsonl", "id": 71952, "text": "5. According to relevant laws, regulations and national standards, we may collect and use your relevant personal information without your authorization and consent in the following situations: 1) It is related to our fulfillment of obligations stipulated by laws and regulations;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "In the following circumstances, you may collect or use your relevant personal information without soliciting your authorization consent: what is related to the obligations stipulated in our laws and regulations;"}
{"task": "rw_104.jsonl", "id": 71953, "text": "2) Directly related to national interests such as national security, national defense security;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect personal information directly related to national interests such as national security and national defense security without agreeing."}
{"task": "rw_104.jsonl", "id": 71954, "text": "3), directly related to major public interests such as public safety, public health, public knowledge;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collection of personal information directly related to major public interests such as public safety, public health, and public awareness does not require consent."}
{"task": "rw_104.jsonl", "id": 71955, "text": "4) Directly related to criminal investigation, prosecution, trial and execution of judgments;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collection of personal information directly related to criminal investigations, prosecutions, trials, and enforcement of sentences, etc., without consent."}
{"task": "rw_104.jsonl", "id": 71956, "text": "5), for maintaining major legitimate rights and interests such as life, property, and reputation of you or other individuals, but it is difficult to get my consent;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting and maintaining major legitimate rights and interests, but it is difficult to get personal information that I agree, no need to agree."}
{"task": "rw_104.jsonl", "id": 71957, "text": "6), the personal information collected is publicly disclosed to the public by itself;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "The collected personal information is publicly disclosed to the public by itself and does not need to agree."}
{"task": "rw_104.jsonl", "id": 71958, "text": "7) Collect personal information from legal public information, such as legal news reports and government information disclosure;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If you collect personal information from the legal disclosure information, you don't need to agree."}
{"task": "rw_104.jsonl", "id": 71959, "text": "8), signing and fulfilling the contract according to your requirements;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting the personal information necessary for signing and performing the contract, there is no need to agree."}
{"task": "rw_104.jsonl", "id": 71960, "text": "9) Necessary to maintain the safe and stable operation of the products or services provided by Lilith, such as discovering and handling product or service failures;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting the personal information necessary for the safe and stable operation of the products or services provided by Lilith, no consent is required."}
{"task": "rw_104.jsonl", "id": 71961, "text": "10) It is necessary to carry out legal news reports;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect personal information necessary for legitimate journalism without consent."}
{"task": "rw_104.jsonl", "id": 71962, "text": "11) Due to the need to carry out statistics or academic research in public interests, and the results of academic research or descriptions are provided, the personal information contained in the result is to identify", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "It is not necessary to agree to the personal information of statistics or academic research in the institute of statistics or academic research."}
{"task": "rw_104.jsonl", "id": 71963, "text": "12) Other circumstances stipulated in laws and regulations.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect personal information under other circumstances stipulated in laws and regulations, no need to agree."}
{"task": "rw_104.jsonl", "id": 71964, "text": "Please understand that the functions and services we provide to you are constantly updated and developed. If a function or service is not there, in the aforementioned description and collecting your information, we will use page prompts, interactive processes, website announcements, etc.Methods to you to explain the content, scope and purpose of information collection to obtain your consent.", "label": ["Important", "First Party Collection Information"], "rewrite": "If a function or service is not included in the foregoing description and information is collected, the content, scope and purpose of the information collection will be explained to you separately to obtain your consent."}
{"task": "rw_104.jsonl", "id": 71965, "text": "3. How do we share, transfer, and publicly disclose your personal information 1. Share the protection of our personal information. Your personal information is an important basis and component of our products and/or services. For youPersonal information, we only collect and use within the purpose and scope of the privacy agreement or in accordance with the requirements of the laws and regulations, and strictly keep secret.", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 71966, "text": "Normally, we will not share your personal information with any company, organization or individual, except in the following cases:", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Under normal circumstances, we will not share your personal information with any company, organization and individual, except the following situations:"}
{"task": "rw_104.jsonl", "id": 71967, "text": "1), you have obtained your clear authorization or consent in advance;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "You have obtained your clear authorization or consent in advance, and you can share personal information."}
{"task": "rw_104.jsonl", "id": 71968, "text": "2), you need to share your personal information in accordance with the applicable laws and regulations, legal procedures, government's mandatory orders or judicial rulings;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "You need to share your personal information in accordance with the applicable laws and regulations, legal procedures, government forced orders or judicial rulings."}
{"task": "rw_104.jsonl", "id": 71969, "text": "3), in the scope of legal requirements or permits, in order to protect the interests, property or security of Lisi and its users or the public, it is necessary to provide your personal information to the third party;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "In the scope of legal requirements or permission, it is necessary to provide your personal information to a third party to protect the interests of users or the public from being damaged."}
{"task": "rw_104.jsonl", "id": 71970, "text": "4), your personal information may be shared between our affiliated companies.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Your personal information may be shared among our affiliates."}
{"task": "rw_104.jsonl", "id": 71971, "text": "We will only share the necessary personal information, and this sharing is also restricted by the purpose of the privacy agreement declaration.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only share the necessary personal information, and this sharing is also restricted by the purpose of this privacy agreement."}
{"task": "rw_104.jsonl", "id": 71972, "text": "If related companies want to change the purpose of the handling of personal information, they will ask your authorization consent again;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If related companies want to change the purpose of personal information, they will solicit your authorization consent again."}
{"task": "rw_104.jsonl", "id": 71973, "text": "5) In order to provide you with more complete and high -quality products and services, some of our services will be provided by authorized partners.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_104.jsonl", "id": 71974, "text": "We may share some of your personal information with your partners to provide better customer service and user experience.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share some of your personal information with our partners to provide better customer service and user experience."}
{"task": "rw_104.jsonl", "id": 71975, "text": "We will only share your personal information for legal, correct, necessary, specific, and clear purposes, and will only share the necessary personal information for services.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "It will only share personal information for legal, correct, necessary, specific, and clear purposes, and only share personal information necessary for providing services."}
{"task": "rw_104.jsonl", "id": 71976, "text": "At the same time, we will ask the partners to handle your personal information in accordance with our instructions, this privacy agreement, and any other related confidentiality and security measures.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will ask partners to process your personal information in accordance with our instructions, privacy agreements, and confidentiality and security measures."}
{"task": "rw_104.jsonl", "id": 71977, "text": "Our partners have no right to share them, and human information is used for any other purpose.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Our partners have no right to use the shared personal information for any other purpose."}
{"task": "rw_104.jsonl", "id": 71978, "text": "If you refuse our partners to collect services when providing services, the necessary personal information may cause you to be unable to use the third -party service on our platform.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "If you refuse your partner to collect the necessary personal information when providing services, it may cause you to be unable to use the third -party service on the platform."}
{"task": "rw_104.jsonl", "id": 71979, "text": "Our partners collect and handle information such as information such as their own privacy agreements or related statements, not applicable to this privacy agreement.", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 71980, "text": "In order to ensure your information security to the greatest extent, we recommend that you check its privacy agreement before using any third -party service.", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 71981, "text": "In order to protect your legitimate rights and interests, if you find a risk of related third -party services, it is recommended that you immediately terminate the relevant operations and contact us in time.", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 71982, "text": "At present, the permissions of the third-party partners we access are as follows:, third-party service name, partner name, specific functions, obtained permissions/information, partner website", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "At present, the rights of third -party partners we have connected are as follows: The authority/information partners website for third -party service name partners names for specific functions obtained."}
{"task": "rw_104.jsonl", "id": 71983, "text": "QQ login/Share Shenzhen Tencent Computer Department Co., Ltd.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition"], "rewrite": []}
{"task": "rw_104.jsonl", "id": 71984, "text": "Alipay Payment, Zhejiang Ant Xiaowei Financial Services, Affairs Group Co., Ltd., payment, access to the Internet, acquisition, network environment, acquisition equipment, MAC, address, acquisition equipment, IMEI, read/writing, storage, https, https, https, https: //render.alipay.c,om/p/c/k2cx0tg8", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "Alipay payment Zhejiang Ant Small and Micro Financial Services Group Co., Ltd. payment access network, obtain current network environment, obtain device mac address, obtain device IMEI number, read/write storage https://render.alipay.c om/p/ c/k2cx0tg8."}
{"task": "rw_104.jsonl", "id": 71985, "text": "WeChat Pay, Shenzhen Tencent Computer Department, Unification Co.,", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "WeChat Payment Shenzhen Tencent Computer Department Co., Ltd. pays no http://privacy.qq.com/ adjust."}
{"task": "rw_104.jsonl", "id": 71986, "text": "Advertising monitoring, adjust, inc., Advertising monitoring, network, network status, obtaining and obtaining equipment logo, symbol, advertising tracking permissions, https://www.adjust.co ,m/zh/terms/privacypolicy/", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "Advertising monitoring Adjust Inc. Advertising monitoring network, network status obtaining, obtaining equipment identifier, advertising tracking permissions https://www.adjust.com/zh/terms/privacyPolicy/."}
{"task": "rw_104.jsonl", "id": 71987, "text": "Guangdiantong Advertising, Shenzhen Tencent Computer System, System Co., Ltd., advertising and data monitoring, obtaining customer networking permissions, detecting the current network environment, 2g, 3g, 4g, wifi, obtaining equipment, mac, address, address ,, get device, IMEI, number, https://privacy.qq.com,/", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "Guangxian Tong advertising Shenzhen Tencent Computer System Co., Ltd. Advertising and data monitoring obtain customer networking permissions, detect the current network environment 2G, 3G, 4G, WIFI, acquisition equipment MAC address, acquisition equipment IMEI number https: //privacy.qq.com /."}
{"task": "rw_104.jsonl", "id": 71988, "text": "Headline advertisement, Beijing huge engine network technology, art Co., Ltd., advertising, data monitoring, obtaining customer network permissions, obtaining equipment, MAC, land, site, acquisition equipment, IMEI, https: //www.ocenengng, INE.COM/EXTRA/Legal", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "Toutiao Advertisement Beijing Juliang Engine Network Technology Co., Ltd. Advertisement placement and data monitoring Obtain the customer's network permission, obtain the mac address of the device, and obtain the IMEI number of the device https://www.oceanengine.com/extra/legal."}
{"task": "rw_104.jsonl", "id": 71989, "text": "Kuaishou Advertising, Beijing Kuaishou Advertising Co., Ltd., advertising placement and data monitoring, access to the Internet, obtain current network environment, obtain device, MAC address, obtain device, IMEI, number, https://www.kuaishou .,com/about/policy?tab,=privacy", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "Kuaishou advertising Beijing Kuaishou Advertising Co., Ltd. Advertising and data monitoring access to the Internet, obtaining the current network environment, obtaining equipment MAC address, obtaining the IMEI number https: //www.kuaishou. Com/About/Policy? Tab = privacy."}
{"task": "rw_104.jsonl", "id": 71990, "text": "China Broadcasting Association, CAID, China Advertising Association, identifying users, none, http://www.chinacaa.org/, http://www.cnaa123.c ,M/CAID/login", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "The China Broadcasting Association CAID China Advertising Association has no http://www.chinacaa.org/ http://www.cnaa123.c om/caid/login."}
{"task": "rw_104.jsonl", "id": 71991, "text": "Xintong Academy, OAID, China Information and Communication Research Institute, identifying users, none, http://www.caict.ac.cn ,/", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "The OAID China Information and Communication Research Institute of Xintong Institute has a logo user without http://www.caict.ac.cn/."}
{"task": "rw_104.jsonl", "id": 71992, "text": "Tencent, Bugly, Shenzhen Tencent Computer Department, Honor Co., Ltd., collects procedures, frequent information (report, wrong, flashback, etc.) and report on the phone status, access, network, acquisition network information, status, acquisition, wifi, wifi, wifi, wifi, wifi, Net, connected information status, reading system, unified bottom log, https://privacy.qq.com ,/document/priview/fb, D2C3F898DF4C1C86992,5dd49d57827", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "Tencent Bugly Shenzhen Tencent Computer System Co., Ltd. collects program abnormal information (report errors, flickering, etc.) and report to access to mobile phone status, access the network, obtain network information status, obtain WIFI network information status, read the underlying log of the system HTTPS: // Privacy.qq.com/document/privies/fb D2C3F898DF4C1C86992 5DD49D57827."}
{"task": "rw_104.jsonl", "id": 71993, "text": "Extreme test, Wuhan Jiyi Network Technology has, limited companies, human -machine partitions, certificates, access to the network, obtaining the network, information status, writing external deposit, storage, http://www.getest.co ,m/private", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "Polar test Wuhan Jiyi Network Technology limited company man -machine distinguishable test access to the network, obtain network information status, write external storage http://www.geetest.co m/private."}
{"task": "rw_104.jsonl", "id": 71994, "text": "Yi Dun, Hangzhou NetEase Yidun Technology You, limited company, content security inspection, check, anti -plug -in, allow applications to access mobile phones, state, access to the Internet, acquisition, network information status, acquisition, network information status, https://dun.163.com/cl ,auty/privacy", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "Yi Dun Hangzhou Netease Yidun Technology limited company content security inspection, anti -plug -in allows applications to access mobile phones, access the network, obtain network information status, obtain wifi network information status https://dun.163.com/Cl Ause/Privacy."}
{"task": "rw_104.jsonl", "id": 71995, "text": "Tencent's face nucleus, Shenzhen Tencent Computer Department, Honor Co., Ltd., the face of the person's face, collecting video photos, films, for living, physical detection and person, face comparison, verify whether it is, true person, name, name, Identity card number, surface, ministerial identification characteristics, obtaining photography, like head permissions, accessing associations, networks, obtaining the current network ring, realm, acquisition of network permissions, reading mobile phone status, device, IMEI, number, https://minIPROGRAMKYC.TENCLOUDAPI.C,s/s/h5/protocoltenc ,nt.html", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "Tencent's face nucleus Shenzhen Tencent Computer System Co., Ltd. shoots a face and collects video photos for living detection and face comparison to verify whether it is the real name, ID number, facial recognition characteristics, obtaining camera authority, permissions,, obtaining camera authority, obtaining camera authority, obtaining permissions of camera, and obtaining camera permissions, permissions of camera, and obtaining permissions of cameras, permissions, and permissions of camera,, permissions of cameras, permissions of cameras, permissions, and permissions of camera,, permissions of cameras, permissions, and permissions of camera,, permissions of cameras, permissions, and permissions of cameras, permissions, and permissions of cameras, permissions, and permission,Visit the network, obtain the current network environment, obtain network permissions, read mobile phone status, obtain the IMEI number https: //miniprogramkyc.tencentCloudapi.c OM/S/H5/Protocoltenc Entml."}
{"task": "rw_104.jsonl", "id": 71996, "text": "Huya Live, Guangzhou Huya Information Technology, limited company, provided by users, Huya live broadcast, watching functions, accessing the network, accessing the network, authority, reading mobile phone, attitude, obtaining equipment, IMEI, https: // hd.huya.com/h, uyadiyzt/6811/PC/Ind, ex.html#diysettab = 1", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "Huya Live Guangzhou Huya Information Technology Co., Ltd. provides users with the viewing function of Huya Live, accessing network permissions, reading mobile phone status, obtaining equipment IMEI https://hd.huya.com/h uyadiyzt/6811/pc/ind.ex.html#diysettab = 1."}
{"task": "rw_104.jsonl", "id": 71997, "text": "Aurora push, Shenzhen Hexunhua information, technology Co., Ltd., information push, determine whether the mobile phone is unlocked, accessing the network, allowing mobile phones, the screen is closed, and the application is allowed to access the hand, the machine status, reading/writing external,Storage and reading and writing systems, setting, vibration, mounting, and unloading, loading outside storage, acquisition of networks, linked information status, https://www.jiguang.c, N/license/privacy", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "Aurora push Shenzhen Hexuhua Information Technology Co., Ltd. information push judgment whether the mobile phone is unlocked, accessing the network, allowing the mobile phone screen to be closed, allowing the application to access the mobile phone status, reading/writing external storage, reading and writing system settings, vibration, mounting, mountingAnd uninstall external storage and obtain network information status https: //www.jiguang.c n/liveNse/Privacy."}
{"task": "rw_104.jsonl", "id": 71998, "text": "Huawei Push Huawei Software Technology Co., Ltd., for push messages on Huawei devices, applies information, messages, sends records, read/write, https://developer.hua ,wei.com/consumer/cn/, DOC/Development/HM, Scoreguides/PrivacyStatement", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "Huawei Push Huawei Software Technology Co., Ltd. is used to push message application identification information, message records, read/write storage https://developer.hua wei.com/consume/cn/coc/developopment/hm under the Huawei deviceScoreguides/PrivacyStatement."}
{"task": "rw_104.jsonl", "id": 71999, "text": "vivo, brand mobile phone, we connect to the third, SDK, Aurora push, whole, combined, describe mobile phones, manufacturers, push, sdk, for you, you push the message 0000001050042021", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "For vivo-branded mobile phones, the third-party SDK Jiguang Push that we access integrates the Push SDK of the above-mentioned mobile phone manufacturers to push messages for you."}
{"task": "rw_104.jsonl", "id": 72000, "text": "Meizu push, clan technology Co., Ltd., is used to push messages on Meizu, equipment, prepare information, location, information, network status letter, interest, operator information, read, take/write storage, TTPS: // Open.Flyme.cn/,Penweb/views/push.html", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "Meizu Pushing Family Technology Co., Ltd. is used to push message information, location information, network status information, operator information, read/write storage ttps: //open.cn/ OpenWeb/Push.html."}
{"task": "rw_104.jsonl", "id": 72001, "text": "Xiaomi Push, Mi Technology Co., Ltd., push messages on the equipment on Xiaomi, prepare information, equipment, set information, applies, information, write storage, obtain, get mobile phone call status, obtain, and register in this one in this oneOn the device, the mobile phone number, ttps://dev.mi.com/co,nsole/doc/detail? Pid =, 1822", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "Xiaomi Push Mi Technology Co., Ltd. pushes messaging information on Xiaomi equipment, information setting information, application information, application information, writing storage, obtaining mobile phone call status, obtaining mobile phone number TTPS: // dev registered on this device.mi.com/Co nsole/DOC/DETAIL? PID = 1822."}
{"task": "rw_104.jsonl", "id": 72002, "text": "OPPO, Push, Donghuan Tai Technology Co., Ltd., in, OPPO, device push message, prepare information, network, information, equipment status letter, interest, application information, ttps://open.oppomobile.com/wiki/doc#ID = 10288", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "OPPO Push Donghuan Tai Technology Co., Ltd. pushes messaging information on OPPO devices, information, network information, device status information, application information ttps://open.oppomobile.com/wiki/doc#id=10288."}
{"task": "rw_104.jsonl", "id": 72003, "text": "Vivo, push, Dongtianyu Network Co., Ltd., in, vivo, equipment push messages, label information, network, status information, ttps://dev.vivo.com.c,n/documentcenter/do, c/366", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "Vivo push Dongtianye Network Co., Ltd. pushes messaging information on the vivo device, network status information ttps: //dev.vivo.com.c n/documentcenter/Do C/366."}
{"task": "rw_104.jsonl", "id": 72004, "text": "2., transfer, we will not transfer your personal information to any company, organization, and individual, except the following situations: 1), transferred to clear consent: After obtaining your clear consent, we will go toOther parties transfer your personal letter, interest;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "We will not transfer your personal information to any company, organization, and individual, except the following situations: 1) transferred to clear consent."}
{"task": "rw_104.jsonl", "id": 72005, "text": "2) In accordance with the requirements of applicable laws and regulations, legal procedures, mandatory administrative or judicial requirements, the necessary situation must be provided for;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Transfer personal information according to the requirements of applicable laws and regulations, legal procedures, mandatory administrative or judicial requirements."}
{"task": "rw_104.jsonl", "id": 72006, "text": "3) When involving mergers, acquisitions, asset transfers, bankruptcy liquidation or similar transactions, if personal information transfer, we will require new companies and organizations that require new personal information to continue to be subject to this Privacy Agreement.The constraint, otherwise we will ask the company and the organization to reconcile your authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "When involving mergers, acquisitions, asset transfers, bankruptcy liquidation or similar transactions, if personal information transfer is required, new companies and organizations are required to continue to be subject to the \"Privacy Agreement\", otherwise they will be re -authorized."}
{"task": "rw_104.jsonl", "id": 72007, "text": "3. Public disclosure, we will only publicly disclose your personal information in the following circumstances:, 1), and get your clear consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the following circumstances, you will publicly disclose your personal information: 1) After getting your clear consent."}
{"task": "rw_104.jsonl", "id": 72008, "text": "2) Discovery based on law: In the case of compulsory requirements of legal, legal procedures, litigation or government authorities, we may disclose your personal information publicly.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the case of compulsory requirements of legal, legal procedures, litigation, or government authorities, personal information may be disclosed publicly."}
{"task": "rw_104.jsonl", "id": 72009, "text": "4. There is no need to obtain the situation of your pre -consent, according to relevant laws and regulations and national standards. In the following situations, we may share, transfer, and openly disclose personal faith.We fulfill the obligations stipulated in laws and regulations;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "In the following circumstances, sharing, transfer, and publicly disclose personal information without obtaining authorization consent in advance: 1) related to the obligations stipulated in the performance of our laws and regulations."}
{"task": "rw_104.jsonl", "id": 72010, "text": "2), directly related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Public, transfer, disclose personal information directly related to national security and national defense security, no need to agree."}
{"task": "rw_104.jsonl", "id": 72011, "text": "3) Directly related to public safety, public health, and major public interests;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Public, transfer, disclose personal information directly related to public safety, public health, and major public interests, and there is no need to agree."}
{"task": "rw_104.jsonl", "id": 72012, "text": "4) Directly related to criminal investigation, prosecution, trial and execution of judgments;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Public, transfer, disclose direct related personal information such as investigation, prosecution, trial, and judgment execution of crime, no consent."}
{"task": "rw_104.jsonl", "id": 72013, "text": "5), due to the major legitimate rights and interests such as the main body or other individuals, but it is difficult to get my consent,;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Public, transfer, and disclose major legitimate rights and interests, but it is difficult to obtain personal information that I agree, no need to agree."}
{"task": "rw_104.jsonl", "id": 72014, "text": "6) Personal information that the subject of personal information disclosure to the public by itself;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Personal information disclosed by the public information to the public does not need to agree."}
{"task": "rw_104.jsonl", "id": 72015, "text": "7) Calls personal information from legal public information, such as legal news reports, government information disclosure and other channels.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "If you collect personal information from the legal disclosure information, you don't need to agree."}
{"task": "rw_104.jsonl", "id": 72016, "text": "According to the law, sharing, transfer, and publicly disclose personal information that is identified by de -identified processing, and ensure that the data receiver cannot restore and re -identify the information of the information.The preservation and processing of the class data will not be notified to you separately and obtain your consent.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "There is no need to notify you and obtain your consent for the preservation and processing of the logo -identified processing data."}
{"task": "rw_104.jsonl", "id": 72017, "text": "4. How do we store and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 72018, "text": "1. Information storage", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 72019, "text": "1) Storage location: In accordance with the provisions of laws and regulations, we will only store the collected personal information in China and the People's Republic of China.", "label": ["Data Retention", "Important"], "rewrite": "It will only store the collected personal information in the territory of the People's Republic of China."}
{"task": "rw_104.jsonl", "id": 72020, "text": "At present, we do not have a scenario that stores your personal information or provide personal information overseas for the time being.", "label": ["Data Retention", "Important"], "rewrite": "At present, there is no scenario of cross-border storage of your personal information or provision of personal information overseas."}
{"task": "rw_104.jsonl", "id": 72021, "text": "If it is indeed necessary to perform cross -border transmission of data, we will clearly notify you (including data out, the purpose of the realm, the receiver, the method and scope of usage, the use of content, security measures, security risks, etc.), andWith your authorization consent, we will ensure that the data receiver has sufficient data protection capabilities to protect your personal information.", "label": ["Data Retention", "Important"], "rewrite": "If it is really necessary to conduct data cross -border transmission, you will clearly inform you alone and obtain your authorization consent."}
{"task": "rw_104.jsonl", "id": 72022, "text": "2) Storage period: We will keep your personal information within the shortest period necessary to provide you with products and services, for example: when you use our registration and membership functions, we need to collect your mobile phone number , and after you provide it and during your use of this function, we need to keep saving your mobile phone number in order to provide you with this function normally and protect your account and system security.", "label": ["Data Retention", "Important"], "rewrite": "We will retain your personal information for you to provide you with the necessary and shortest period of service purposes."}
{"task": "rw_104.jsonl", "id": 72023, "text": "In addition, we may preserve your relevant information to the relevant legal firm, and the required period of time (for example, the E -commerce Law stipulates that the time of preservation of goods and service information and transaction information is made.To.", "label": ["Data Retention", "Important"], "rewrite": "We will preserve your relevant information to the necessary period stipulated by relevant laws."}
{"task": "rw_104.jsonl", "id": 72024, "text": "3), after the above storage period is exceeded, we will delete or anonymize (de-identify) your personal information.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "After the above storage period has expired, personal information will be deleted or anonymized (de-identified)."}
{"task": "rw_104.jsonl", "id": 72025, "text": "2. Information Protection 1) The security of your personal information is very important to us.", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 72026, "text": "We will strictly abide by relevant laws and regulations and take reasonable and feasible measures recognized in the industry to protect your personal information.", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 72027, "text": "Prevent information from unauthorized access, disclosure, use, and modification to avoid damage or loss of information.", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 72028, "text": "2) When Lilith requires users to provide information related to their personal identity, they should disclose their privacy agreements to users in a clear and easy to see in advance and take necessary measures to protect user information.", "label": ["Important", "Data Security"], "rewrite": "It should disclose their privacy agreements to users in a clear and easy -to -see way in advance, and take necessary measures to protect user information."}
{"task": "rw_104.jsonl", "id": 72029, "text": "3), except as expressly stipulated in this privacy agreement, without the user's permission, Lilith shall not provide, disclose or share the name, personal valid ID number, contact information, home address and other personal information in the user's registration information to any third party. Identity, information, except for the following circumstances: the user or user guardian authorizes Lilith to disclose;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Without the user's permission, Lilith may not provide, disclose or share personal identity information to any third party, except for the following situations: user or user guardian authorizes Lilith to disclose."}
{"task": "rw_104.jsonl", "id": 72030, "text": "Regarding laws and regulations or forced, sexual regulations require Lilith to disclose;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Those who require Lilith to disclose laws and regulations or mandatory provisions that they can provide personal information to third parties."}
{"task": "rw_104.jsonl", "id": 72031, "text": "The judicial organs or administrative organs are provided by Lilith based on legal procedures;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "The judicial organs or administrative organs are provided by Lilith based on legal procedures and can provide third parties."}
{"task": "rw_104.jsonl", "id": 72032, "text": "Lith, when Lith filed a lawsuit or arbitration in order to safeguard her legitimate rights and interests;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Lilith foses a lawsuit or arbitration to users to protect her legitimate rights and interests, and can provide third parties."}
{"task": "rw_104.jsonl", "id": 72033, "text": "When the legitimate requirements of the application households provide personal identity information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "When the legitimate requirements of the application households are provided to the user's personal identity information, they can provide third parties."}
{"task": "rw_104.jsonl", "id": 72034, "text": "3. User account use and storage, 1) In order to ensure the security of the user account, Lilith has the right to review whether the identity information provided by the user registration is true and effective, and should actively take reasonable measures such as technology and management to ensure the user account numberSafe and effective;", "label": ["Important", "Data Security"], "rewrite": "Lilith has the right to review whether the identity information provided by the user's registration is true and effective, and should actively take reasonable measures to ensure the security and effectiveness of the user account."}
{"task": "rw_104.jsonl", "id": 72035, "text": "The user is obliged to keep its account and password properly, and use its account and password correctly and safely.", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 72036, "text": "If any party does not do its best to cause the account password loss and the stolen account to cause damage to the civil rights of users and others, it shall bear legal responsibility.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_104.jsonl", "id": 72037, "text": "2) The user has rights and responsibility for the behavior of the account after logging in in accordance with the law.", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 72038, "text": "3) If the user finds that its account or password is illegally used by others or has abnormalities, it should be notified to Lilith in time according to Lilith Gong, and the right to notify Lilith to take measures to suspend the login anduse.", "label": ["Third Party Sharing/ Disclosure", "Important", "Edit/Control"], "rewrite": "The user found that the account or password was illegally used or used by others, and Lilith should be notified in time, and the right to notify Lilith to take measures to suspend the login and use of the account."}
{"task": "rw_104.jsonl", "id": 72039, "text": "4), Lilith suspended the login and use of the user account based on the user's notification, and Lilith should ask the user to provide and verify the personal valid identity information of the individual consistent with its registered identity information.", "label": ["Important", "Data Security"], "rewrite": "If Lilith suspends the login and use of the user account based on the notice, it shall ask the user to provide and verify the personal effective identity information that is consistent with its registered identity information."}
{"task": "rw_104.jsonl", "id": 72040, "text": "5) If Lilith verify that the personal effective identity information provided by the user is consistent with the registered identity information, it should be timely to suspend the login and use of the user account.", "label": ["Important", "Data Security"], "rewrite": "If Lilith verify that the personal effective identity information provided by the user is consistent with the registered identity information, it shall take measures to suspend the login and use of the user account."}
{"task": "rw_104.jsonl", "id": 72041, "text": "6) The user does not provide his personal valid ID or the personal valid ID provided by the user. The information is inconsistent with the registered identity. Lilith has the right to refuse the user's request.", "label": ["Important", "Data Security"], "rewrite": "If the user does not provide his personal valid identity documents or is inconsistent with the registered identity information, Lilith has the right to refuse the user's request."}
{"task": "rw_104.jsonl", "id": 72042, "text": "7) In order to safeguard their legitimate rights and interests, users provide Lilith with a personal effective identity that is consistent with the registered identity information", "label": ["Important", "Data Security"], "rewrite": "Lilith should provide users with the necessary assistance and support for account registration, original registration information and other necessary assistance, and provide relevant evidence information information to relevant administrative organs and judicial organs."}
{"task": "rw_104.jsonl", "id": 72043, "text": "During the information, Lilith should provide users with the necessary assistance and support for account registration, original registration information, etc., and provide relevant evidence information to relevant administrative organs and judicial organs as needed.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_104.jsonl", "id": 72044, "text": "5. The right to manage personal information", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 72045, "text": "We understand your attention to personal information, and make every effort to ensure that you have the right to query, correct, delete, delete, and withdraw authorization of your personal information, so that you have sufficient ability to ensure your privacy and security.", "label": ["Edit/Control", "Important"], "rewrite": "Do your best to ensure the right to query, correct, delete, and withdraw authorization of your personal information to ensure your privacy and security."}
{"task": "rw_104.jsonl", "id": 72046, "text": "Your rights include:", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 72047, "text": "1. You have the right to query your personal information. You can query the relevant instructions (or settings) of the products and services we provided to inquire to us.", "label": ["Edit/Control", "Important"], "rewrite": "You can query relevant personal information according to the relevant instructions (or settings) of the products and services provided."}
{"task": "rw_104.jsonl", "id": 72048, "text": "include:", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 72049, "text": "1) Account information: You can log in to your personal information page at any time through the related game pages to access your personal information information in the corresponding, including avatars, nicknames, etc.;", "label": ["Important", "Edit/Control"], "rewrite": "You can log in to your personal information page at any time through the related game inner page to access personal data information, including avatars, nicknames, etc."}
{"task": "rw_104.jsonl", "id": 72050, "text": "2) Other information: If you encounter operating problems during the access process, you need to obtain other personal information content that cannot be known in the aforementioned foregoing, and you can contact us through the method provided by this privacy agreement.", "label": ["Important", "Edit/Control"], "rewrite": "You need to obtain other personal information content that cannot be known. You can contact us through the way of this privacy agreement."}
{"task": "rw_104.jsonl", "id": 72051, "text": "2. You have the right to correct your personal information. When you find that you have a registration error, incomplete or updated personal information that you provide, you can contact us and submit a correction application through the method of privacy and terms provided by this privacy.", "label": ["Important", "Edit/Control"], "rewrite": "If you find that the personal information you provided to us is wrong, incomplete or updated, you can contact us and submit a correction application."}
{"task": "rw_104.jsonl", "id": 72052, "text": "1) For some of your personal information such as avatars, nicknames, etc., we provide you with the functional page of the game with the operation settings. You can directly correct/modify.", "label": ["Important", "Edit/Control"], "rewrite": "The functional page of the game provides you with operation settings, you can directly correct/modify personal information."}
{"task": "rw_104.jsonl", "id": 72053, "text": "2) For the difficulties you encountered in the process of exercising the above rights, or other people who may not be able to provide you at your own online and modify services, you can contact us through the way of this privacy agreement and ask us to be correct or or ofModify your, data, after verification of your identity, and correct/modify the objectivity and accuracy of the information, we can make corrections or modifications on errors or incomplete information, but there are other laws and regulations.Except for regulations.", "label": ["Important", "Edit/Control"], "rewrite": "Correction/modification does not affect the objectivity and accuracy of the information, you can make corrections or modifications of errors or incomplete information, except for laws and regulations."}
{"task": "rw_104.jsonl", "id": 72054, "text": "But for the consideration of security and identity, you cannot modify the real -name registration information (name, identity document number) submitted during registration.", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 72055, "text": "3. You have the right to delete your personal information", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 72056, "text": "1) For some of your personal information, you can contact us through the method provided by this privacy agreement to submit an application for deletion.", "label": ["Important", "Edit/Control"], "rewrite": "For some of your personal information, you can submit an application for deletion."}
{"task": "rw_104.jsonl", "id": 72057, "text": "After the personal information deletion application is approved, we will delete or processes such information, unless laws and regulations, and other regulations.", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "After the personal information is deleted and approved, such information will be deleted or anonymous, unless laws and regulations are provided."}
{"task": "rw_104.jsonl", "id": 72058, "text": "2) When the following situation occurs, you can directly ask us to delete your personal information, but it has been anonymous or laws, except for other regulations: A), when we handle personal informationhour;", "label": ["Important", "Edit/Control"], "rewrite": "When the following situations occur, we can directly ask us to delete your personal information, but except for anonymous treatment or other provisions of laws and regulations: A) When we handle personal information violations of laws and regulations, we can delete personal information."}
{"task": "rw_104.jsonl", "id": 72059, "text": "b) When we collect and use your personal information, but not obtained your consent;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_104.jsonl", "id": 72060, "text": "c) When our behavior of handling personal information is violated with you;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_104.jsonl", "id": 72061, "text": "d) When you cancel the user account;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_104.jsonl", "id": 72062, "text": "e) When we terminate our services and operations.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_104.jsonl", "id": 72063, "text": "4. You have the right to withdraw your authorization of personal information, as mentioned earlier, some of the functions of the game products and services we provided need to obtain the relevant authority of your equipment, (including: album, camera, microphone, etc., specifically to specifically use it to specifically use it.The actual function of the product is subject to).", "label": ["Edit/Control", "Important"], "rewrite": "You have the right to withdraw your authorization of personal information."}
{"task": "rw_104.jsonl", "id": 72064, "text": "You can continue to authorize the permissions after the authorization, and then withdraw (or stop).", "label": ["Important", "Edit/Control"], "rewrite": "You can continue to authorize the permissions at any time after authorization."}
{"task": "rw_104.jsonl", "id": 72065, "text": "For example, you can close your authorization of mobile phone albums through \"Settings-Privacy-Photo\" in the device.", "label": ["Important", "Edit/Control"], "rewrite": "You can turn off your authorization of mobile phone albums through \"Settings-Privacy-Photo\" in iOS devices."}
{"task": "rw_104.jsonl", "id": 72066, "text": "You can also withdraw the consent of this privacy agreement through the corresponding functional page of the game, or through the way of canceling the account, we will permanently withdraw from us to continue to collect all your personal information.", "label": ["Important", "Edit/Control"], "rewrite": "You can withdraw consent through the corresponding function page in the game, or by cancel the account, permanently withdraw all authorization."}
{"task": "rw_104.jsonl", "id": 72067, "text": "You need to understand that when you withdraw and return authorization, we cannot continue to provide you with specific functions and/or services corresponding to the withdrawal of the withdrawal authorization.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "When you withdraw authorization, you cannot continue to provide you with specific functions and/or services corresponding to the withdrawal authorization."}
{"task": "rw_104.jsonl", "id": 72068, "text": "But you withdraw the authorization and decide will not affect personal information processing that previously carried out based on your authorization.", "label": ["Permission Acquisition", "Edit/Control", "Risk", "Important"], "rewrite": "The decision to withdraw authorization will not affect personal information processing based on your authorization."}
{"task": "rw_104.jsonl", "id": 72069, "text": "5. You have the right to cancel your account", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 72070, "text": "You can contact us to apply for a cancellation of your account through the method provided by this privacy agreement.", "label": ["Important", "Edit/Control"], "rewrite": "You can contact us to apply for a cancellation of your account through the method provided by this privacy agreement."}
{"task": "rw_104.jsonl", "id": 72071, "text": "When you log out the account, you will no longer log in and use the Lilith game product and service with this account;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "When you cancel your account, you will no longer log in and use Lilith game products and services with this account."}
{"task": "rw_104.jsonl", "id": 72072, "text": "And this account is used in Lilith's game products and services. During the period, all rights such as but not consumed and the future overdue interests that have been generated will be cleared;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "After canceling the account, the entire equity of the account will be cleared during use."}
{"task": "rw_104.jsonl", "id": 72073, "text": "In the within this account, tolerance, information, data, records, etc. will be deleted or anonymous (but the laws and regulations have other regulations or the regulatory authorities need to be required.It stipulates that your network operation log will be kept at least six, the time of the month);", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "The content, information, data, records, etc. under this account will be deleted or anonymous."}
{"task": "rw_104.jsonl", "id": 72074, "text": "After the cancellation of the user account is completed, it will not be able to recover.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "After the cancellation of the user account is completed, it will not be able to recover."}
{"task": "rw_104.jsonl", "id": 72075, "text": "6. The suspension and termination of services, 1., users have published illegal information, serious violations of social morality, and other acts that violate the laws of law. Lily, the right to terminate services to users immediately.", "label": ["Important", "Data Security"], "rewrite": "The user posted illegal information, and Lilith had the right to immediately terminate services to users."}
{"task": "rw_104.jsonl", "id": 72076, "text": "2.If the user performs improper behaviors when receiving Lilith services, Lilith has the right to terminate services to users.", "label": ["Important", "Data Security"], "rewrite": "If the user performs improper behavior when receiving Lilith service, Lilith has the right to terminate services to users."}
{"task": "rw_104.jsonl", "id": 72077, "text": "3., Users provide false registration identity information, or implement the behavior that violates this agreement, Lilith has the right to suspend the provision of the user, department or part of the service;", "label": ["Important", "Data Security"], "rewrite": "Users provide false registration identity information or implement violations of this agreement. Lilith has the right to suspend services to provide users."}
{"task": "rw_104.jsonl", "id": 72078, "text": "Lilith takes suspension measures to notify the user and notify the suspension period. During the suspension period, it should be in line, rational, and Lilith during the suspension period should resume the service of users in a timely manner.", "label": ["Important", "Data Security"], "rewrite": "Lilith takes suspension measures to notify the user and notify the suspension period. During the suspension period, Lilith should resume services to users in time."}
{"task": "rw_104.jsonl", "id": 72079, "text": "7. Update and access of this privacy agreement", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 72080, "text": "1. In order to provide you with better services, we will update the hidden and private terms of the product and the relevant requirements of the laws and regulations, which will constitute a part of the privacy agreement.", "label": ["Policy Change", "Important"], "rewrite": "We will update the terms of this privacy clause in accordance with the update of the product and the relevant requirements of laws and regulations, which constitute a part of the privacy agreement."}
{"task": "rw_104.jsonl", "id": 72081, "text": "Without your clear consent, we will not reduce the rights you should enjoy in accordance with this privacy agreement.", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 72082, "text": "If such updates have caused the substantial reduction of rights under this privacy agreement, or major changes, we will prompt or send you a message to you or notify you in other ways. It means that you fully read, understand and agree to the constraints of the privacy agreement revised.", "label": ["Policy Change", "Important"], "rewrite": "If such updates have caused the essence of your rights to reduce or change significantly, we will prompt or notify you in a significant position. If you continue to use your service, it means that you agree with the revised privacy agreement."}
{"task": "rw_104.jsonl", "id": 72083, "text": "2. Major changes include but not limited to: 1) Our service model has changed significantly.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_104.jsonl", "id": 72084, "text": "Such as the purpose of handling personal information, the type of personal information of the processing, the way of using personal information, etc.;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_104.jsonl", "id": 72085, "text": "2) We have changed significantly in the aspects of ownership structure and organizational structure.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_104.jsonl", "id": 72086, "text": "Such as changes caused by business adjustments, bankruptcy mergers and acquisitions, etc.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_104.jsonl", "id": 72087, "text": "3) The main objects of personal information sharing, transfer or public disclosure have changed;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_104.jsonl", "id": 72088, "text": "4) The right to participate in personal information processing and its exercise methods have changed significantly;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_104.jsonl", "id": 72089, "text": "5) We are responsible for handling the contact methods and complaint channels of personal information security related personnel;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_104.jsonl", "id": 72090, "text": "6) Evaluation report on personal information security impact indicates that there is a high risk.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_104.jsonl", "id": 72091, "text": "3. You can visit the privacy agreement through Lilith's game product related feature page and Lilith Game official website. If you have any questions about the aforementioned access function, you can contact us through the method provided by this privacy agreement.", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 72092, "text": "8. Law application and dispute resolution 1. This \"Lilith Game Privacy Agreement\" shall apply, fulfillment, interpretation, and dispute resolution.", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 72093, "text": "2. If the two parties have any controversy on the content or performance of the \"Lilith Game Privacy Agreement\", the two parties should be friendly and negotiated;", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 72094, "text": "When the negotiation is not achieved, either party shall file a lawsuit with the People's Court of Xuhui District, Shanghai.", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 72095, "text": "3. The title of all the terms of this agreement is only convenient to read. There is no practical meaning in itself, and it cannot be used as the basis for explaining the meaning of this agreement.", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 72096, "text": "4. Regardless of what reason for this agreement, the remaining terms are still valid and are binding on all parties.", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 72097, "text": "Nine, contact us 1. If you have any questions about personal information protection related to the protection of personal information when using our service or using our service or use our service.One -party formation contacts us:", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 72098, "text": "1) You can contact customer service or submit feedback online in the related functional page in Lilith game products;", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 72099, "text": "2), you can open it to us, server@lilithgames.com, customer service mailbox send emails to contact us;", "label": ["Important", "Contact Information"], "rewrite": "You can contact us to send emails to ERVICE@lilithGames.com customer service mailbox."}
{"task": "rw_104.jsonl", "id": 72100, "text": "2. We will reply to you within 15 working days after receiving your opinions and suggestions and verify your user identity. If you encounter special or complex situations, our feedback time may be extended accordingly.", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 72101, "text": "In addition, you understand and know that in the following situations related to personal information, we may not be able to reply to your request:", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 72102, "text": "1), related to national security and national defense security;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Personal information related to national security and national defense security cannot respond to requests."}
{"task": "rw_104.jsonl", "id": 72103, "text": "2), related to public safety, public health, major public interests;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Personal information related to public safety, public health, and major public interests cannot respond to requests."}
{"task": "rw_104.jsonl", "id": 72104, "text": "3), related to criminal investigation, prosecution, and trial;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Personal information related to criminal investigation, prosecution and trial cannot respond to the request."}
{"task": "rw_104.jsonl", "id": 72105, "text": "4) If there is sufficient evidence that you have subjective malice or abuse of rights;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "There are sufficient evidence that you have subjective malicious or abuse of rights and cannot respond to the request."}
{"task": "rw_104.jsonl", "id": 72106, "text": "5), responding to your request will cause the legitimate rights and interests of you or other individuals and organizations to be seriously damaged;", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "In response to your request, if the legitimate rights and interests of you or other individuals and organizations are seriously damaged, the request cannot be responded."}
{"task": "rw_104.jsonl", "id": 72107, "text": "6), involved in business secrets;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Those who involve business secrets cannot respond to requests."}
{"task": "rw_104.jsonl", "id": 72108, "text": "7), other circumstances stipulated in laws and regulations.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Other circumstances stipulated in laws and regulations cannot respond to requests."}
{"task": "rw_104.jsonl", "id": 72109, "text": "Shanghai Lilith Network Technology Co., Ltd.", "label": [], "rewrite": []}
{"task": "rw_104.jsonl", "id": 72110, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
