{"task": "rw_11.jsonl", "id": 40534, "text": "\"IQiyi Privacy Policy\"", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40535, "text": "Updated in this version: August 01, 2022", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40536, "text": "Effective time of this version: August 08, 2022", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40537, "text": "Version update prompt", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40538, "text": "The content of this update mainly includes:", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40539, "text": "1. Increase the instructions for the processing of sensor information;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40540, "text": "2. Increase the instructions for the management of the account of the content creator and the processing of identity certification;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40541, "text": "3. Optimize the content of the application authority;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40542, "text": "4. Optimize and streamline the content of the document to make the document more suitable for reading and understanding.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40543, "text": "Please read carefully before using/continue to use iQiyi products and/or service, fully understand the full text, and use/continue to use after agreeing with all the content.", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40544, "text": "preface", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40545, "text": "\"Iqiyi Products and/or Services\" (hereinafter referred to as \"our products and/or services\") refers to the Beijing iQiyi Technology Co., Ltd. and/or its related companies (hereinafter referred to as \"iQiyi\", \"The online audio -visual products and/or services provided by us mainly include the registered names of our legal ownership, managing and operating.(Including but not limited to all terminal clients such as the PC, mobile terminal, applet side, etc.), official website (https://www.iqiyi.com/) and the third -party client application and/or the official website usedWebpage, software development toolkit (SDK) and application programming interface (API).", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40546, "text": "This \"Iqiyi Privacy Policy\" (hereinafter referred to as \"this policy\") is suitable for iQiyi products and/or services, but some products and/or services (including but not limited to a certain product and/or serviceIf a certain type of terminal client), if a privacy clause/privacy agreement is set up separately, the separate privacy terms/privacy agreements are preferred, and the contents of separate privacy clauses/privacy agreements are not mentioned. This policy is applicable.", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40547, "text": "Please note that this policy is not applicable to the following situations: our products and/or services contain or link to the products and/or services provided by third parties (including any third -party client application, website and/or other productsWith/or services), these products and/or services are operated by third parties. You use the product to apply the personal information processing rules to you with a third party with/or service.", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40548, "text": "We know the importance of personal information to you, so we attach great importance to protecting your privacy and personal information.", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40549, "text": "We hope to clearly introduce you how to deal with your personal information and the way we provide for you when using our products and/or services.", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40550, "text": "Involving the terms of major relationships with your rights (possibilities) in this policy and the processing of sensitive personal information, we have reminded you to read in the font bold, down or other reasonable ways.", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40551, "text": "You agree that we will process your relevant personal information in accordance with the requirements of laws and regulations and/or to achieve product function and service needs.", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40552, "text": "But this does not mean that as long as you start using our products and/or services, we will process all the personal information involved in this policy.", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40553, "text": "Only when you use specific functions and/or to comply with laws and regulations, we will handle your relevant personal information in order to achieve a clear and reasonable purpose based on the \"minimum necessary\" principle.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will handle your relevant personal information in order to achieve a clear and reasonable purpose based on the \"minimum necessary\" principle."}
{"task": "rw_11.jsonl", "id": 40554, "text": "At the same time, in specific functional scenarios, you can refuse to provide our relevant personal information, but it may cause you to be unable to use specific functions. We will make relevant instructions in this policy so that you can better understand.", "label": ["Important", "First Party Collection Information"], "rewrite": "In specific functional scenarios, you can refuse to provide our relevant personal information."}
{"task": "rw_11.jsonl", "id": 40555, "text": "In addition to this policy, in specific scenarios, the way we will inform (including but not limited to updating this policy, re -signing documents, page prompts, pop -ups, in -site letters, emails, website announcements or other ways to facilitate your knowledge to know.) Explain in detail the rules of the processing purpose, method, scope of the corresponding information, and process it after obtaining your authorization consent (such as applicable).", "label": ["Important", "Usage"], "rewrite": "In specific scenarios, we will explain to you in detail the rules, methods, scope and other rules of the corresponding information, and process it after obtaining your authorization consent."}
{"task": "rw_11.jsonl", "id": 40556, "text": "about Us", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40557, "text": "The basic situation of our main operating companies is as follows: (1) Beijing iqiyi Technology Co., Ltd., established on March 27, 2007, registered address/common office address: 1101 1101, 11th floor 1101, No. 2, No. 2, Haidian North Street, Haidian District, Beijing,Contact number: 400-923-7171;", "label": ["Important", "Contact Information"], "rewrite": "(1) Beijing iqiyi Technology Co., Ltd., registered address/commonly used office address: 1101 1101, 11th floor, No. 2, No. 2, Haidian North Street, Haidian District, Beijing, contact number: 400-923-7171."}
{"task": "rw_11.jsonl", "id": 40558, "text": "(2) Shanghai Zhongyuan Network Co., Ltd., was established on November 21, 2005. The registered address/common office address: Room 501, No. 9, No. 365, Linhong Road, Mayor of Shanghai, contact number: 400-923-7171.", "label": ["Important", "Contact Information"], "rewrite": "(2) Shanghai Zhongyuan Network Co., Ltd., registered address/common office address: Room 501, 9, No. 365, Linhong Road, Mayor, Shanghai, contact number: 400-923-7171."}
{"task": "rw_11.jsonl", "id": 40559, "text": "If you want to learn more about our company and platform in detail, you can contact us through the contact information provided by this policy.", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40560, "text": "Refers to the company and institutions under the control of Beijing iQiyi Technology Co., Ltd., under the control of Beijing iQiyi Technology Co., Ltd., or under the control of Beijing iQiyi Technology Co., Ltd. under the control of Beijing iQiyi Technology Co., Ltd..", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40561, "text": "Control refers to the ability to directly or indirectly affected the controlled management/operation of the controlled objects directly or indirectly through ownership, contract, actual operation association, or other methods identified in accordance with the law.", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40562, "text": "This \"iQiyi Privacy Policy\" will help you understand the following", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40563, "text": "1. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40564, "text": "2. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40565, "text": "3. How can we share, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40566, "text": "4. The control of your personal information", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40567, "text": "5. How do we store and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40568, "text": "6. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40569, "text": "7. Update of this policy", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40570, "text": "8. How to contact us", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40571, "text": "Nine, others", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40572, "text": "1. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40573, "text": "In order to make you conveniently understand the main situation of our personal information collection and use, our products provide dynamic personal information lists, such as: inquiries in the iQiyi APP \"My - Privacy Center -Personal Information Collection List\"Essence", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "You can query the main situation of personal information collection and use in the iQiyi APP \"My -Privacy Center -Personal Information Collection List\"."}
{"task": "rw_11.jsonl", "id": 40574, "text": "Because our products are not the same as the content provided by/or services, the type of personal information collected will also be different from the content of the product and/or service.Make a prevailing.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40575, "text": "The authorization of the address book, location, camera, album (storage, the same below), microphone, calendar and other system permissions will not be opened by default. Only after you have a separate consent can you access when you realize specific services/functions.", "label": ["Permission Acquisition", "Important"], "rewrite": "The authorization of the address book, location, camera, album (storage, the same below), microphone, calendar and other system permissions will not be opened by default. Only after you have a separate consent can you access when you realize specific services/functions."}
{"task": "rw_11.jsonl", "id": 40576, "text": "Even after your authorization, you can access your corresponding permissions, we will only access within your authorization range and obtain the corresponding information (such as involved);", "label": ["Permission Acquisition", "Important"], "rewrite": "We will only access within the scope of your authorization and get the corresponding information."}
{"task": "rw_11.jsonl", "id": 40577, "text": "And you can withdraw authorization at any time. After you withdraw authorization, we will stop accessing the corresponding permissions, and we will no longer provide you with some services corresponding to it, but it will not affect the other services you provide.", "label": ["Policy Change", "Permission Acquisition", "Important"], "rewrite": "You can withdraw authorization at any time. After you withdraw authorization, we will stop accessing the corresponding permissions, and we will not be able to provide certain services corresponding to it."}
{"task": "rw_11.jsonl", "id": 40578, "text": "At the same time, please note that some permissions (such as: equipment permissions, location permissions) may be used for some third -party applications (including H5 pages, applets, etc.) services. These permissions are only passed when you use a third -party application specific function.Our products and/or service applications are obtained.", "label": ["Permission Acquisition", "Important"], "rewrite": "Partial permissions may be used for some third -party application services, and these permissions are obtained through our products and/or service applications only when you use it."}
{"task": "rw_11.jsonl", "id": 40579, "text": "For example: third -party old mobile phone recycling service providers recommend nearby recycling stores to you. In the carved app, apply for your geographical location permissions to obtain your geographical location information.", "label": ["Third Party Sharing/ Disclosure", "First Party Collection Information"], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40580, "text": "Check the \"Application and Instructions for Application permissions and use\".", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40581, "text": "We mainly collect the personal information you involved when using our products and/or services through the following channels:", "label": ["Important", "First Party Collection Information"], "rewrite": "We mainly collect personal information involved in your use of products and/or services through the following channels: (1) information that you actively provided according to business needs; (2) information we collect, record, and summarize;The three parties indirectly obtained your information."}
{"task": "rw_11.jsonl", "id": 40582, "text": "(1) According to business needs, the information provided by you actively provided, such as the mobile phone number provided when registered.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40583, "text": "(2) We collect, record, and summarize information, such as: your equipment information, personal Internet records.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40584, "text": "(3) Your information obtained from the third party, such as: the mobile phone number provided by the partner provided by the partner when the co -branded member is purchased.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40585, "text": "Under normal circumstances, we will collect and use your personal information or apply for relevant permissions for the realization of the following functions/scenarios:", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We will collect and use your personal information or apply for relevant permissions for the realization of the following functions/scenarios."}
{"task": "rw_11.jsonl", "id": 40586, "text": "(1) Account registration and login", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40587, "text": "Registration/login: When you register and log in to our products and/or services, in order to help you complete the registration/login process smoothly, you need to provide us with your mobile phone number and mobile login password information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you register and log in to our products and/or services, you need to provide us with your mobile phone number and mobile phone login password information."}
{"task": "rw_11.jsonl", "id": 40588, "text": "The collection of mobile phone numbers information is to meet the real -name system requirements of relevant laws and regulations. If you refuse to provide the mobile phone number for verification, it will cause the registration/login failure, but it will not affect your viewing, searching, and playback function of your video.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect mobile phone number information to meet the real -name system requirements of relevant laws and regulations."}
{"task": "rw_11.jsonl", "id": 40589, "text": "If you log in by mailbox, you need to provide us with your email and iQiyi account login password information.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you log in by mailbox, you need to provide your email and iQiyi account login password information."}
{"task": "rw_11.jsonl", "id": 40590, "text": "One -click login: Based on our cooperation with communication operators, when you use and \"one -click login\" function, after your consent, the operator will send us your mobile phone numberEssence", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the \"One -click login\" function, after your consent, the operator will send us your mobile phone number to us."}
{"task": "rw_11.jsonl", "id": 40591, "text": "Authorized login: When you use an account with a third -party platform (for example: QQ/WeChat/Weibo/Baidu, etc.), when you authorize the login, you authorize usThe scope of authorization is prevailing), which is used to bind it with iQiyi account and improve network data information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When registering and logging in with a third -party account, access and collect your personal information after your authorization, and bind it."}
{"task": "rw_11.jsonl", "id": 40592, "text": "If you are registered directly using an account on a third -party platform, in order to meet the real -name system requirements of relevant laws and regulations, we need you to bind your mobile phone number., But it does not affect your viewing, searching, and playback function of your video.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If you are registered directly with an account on a third -party platform, in order to meet the real -name system requirements of relevant laws and regulations, we need you to bind your mobile phone number."}
{"task": "rw_11.jsonl", "id": 40593, "text": "Mobile phone number binding dismissal: The \"code number public service platform\" provided by Xinong Institute provides one -click unbinding service for qualified mobile phone numbers. After receiving the instructions from Xintong InstituteThe binding relationship between the art account and delete or anonymously process the mobile phone number information.", "label": ["Important", "Edit/Control"], "rewrite": "After receiving the one -click unbinding service instruction of the Xintong Institute, we will directly lift the binding relationship and delete or anonymously process the mobile phone number information."}
{"task": "rw_11.jsonl", "id": 40594, "text": "Code login: When you use the scanning login function, we will ask you to authorize the camera permissions to complete the QR code scanning the code smoothly.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use the code scanning function, we will ask you to authorize the camera authority."}
{"task": "rw_11.jsonl", "id": 40595, "text": "Data Maintenance: You can choose to fill in your gender, nickname, avatar, birthday, location, personal signature information, which will help us provide you with a more personalized experience.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can choose to fill in your gender, nickname, avatar, birthday, location, personality signature information."}
{"task": "rw_11.jsonl", "id": 40596, "text": "If you do not fill in, it will not affect your use of our products and/or services.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40597, "text": "When you upload/change your avatar, we will ask your camera, album permissions, and collect the picture information you upload/replacement.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you upload/change your avatar, we will ask your camera, album permissions, and collect the picture information you upload/replacement."}
{"task": "rw_11.jsonl", "id": 40598, "text": "Account information disclosure: your personal information, your praise, fans, attention and bubble circle lists, your dynamics, collection and public release works, your badge and iQiyi IQ author, anchor identity, etc.Some or all are publicly displayed on your personal space page.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Your personal information, your praise, fans, attention, and bubble circles and other account information will be displayed in some or all on your personal space page."}
{"task": "rw_11.jsonl", "id": 40599, "text": "After your authorization consent, in our products and/or services, we will publicly show your movie viewing process and public your likes on your personal space page, but you can cancel the authorization at any time.Yiyi App-Personal Space-Settings-Open my movie viewing process/allow others to view my movie viewing process;", "label": ["Third Party Sharing/ Disclosure", "Edit/Control", "Important"], "rewrite": "We will publicly show your movie viewing process and public your likes on your personal space page, but you can cancel authorization at any time, path: iQiyi APP-Personal Space-SettingsOthers look at my movie viewing process; follow the app-my-Privacy Center-Privacy Management-Other Settings-Open the work I like."}
{"task": "rw_11.jsonl", "id": 40600, "text": "Cousin APP-Mine-Privacy Center-Privacy Management-Other Settings-Open the work I like.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40601, "text": "Account equity and assets: We will collect your equity and asset information under iQiyi account (including member identity and type, membership time period, membership level, member rights and interests, Qi Dou/Qi Dian asset information, related equity and asset use useCondition).", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect your rights and asset information under the iQiyi account."}
{"task": "rw_11.jsonl", "id": 40602, "text": "At the same time, we will show you part or all the aforementioned information to you in the application.", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40603, "text": "(2) Real -name authentication and settlement", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40604, "text": "1. Real -name authentication and authentication", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40605, "text": "In order to meet relevant laws and regulations and regulatory requirements, ensure the authenticity of the user's identity, and achieve anti -fraud and other risk control, ensure system and service security, you may need to perform real -name authentication before using specific services/functions.", "label": ["Important", "Data Security", "Usage"], "rewrite": "You may require real -name authentication before using specific services/functions."}
{"task": "rw_11.jsonl", "id": 40606, "text": "We need to collect your real -name authentication information (may include names, mobile phone numbers, ID card -related information, face information (static or dynamic), bank card -related information, different from the actual situation)The scene may include: when applying for the use of iQiyi IQ number service, when applying for a live broadcast service, when the real name of the online game user is registered, the purchase of related financial products or services, when the student members are purchased, the \"youth model\" account password to appeal or resetTime and other scenarios that require real -name authentication.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We need to collect your real -name authentication information to complete the real -name authentication."}
{"task": "rw_11.jsonl", "id": 40607, "text": "Please note that the iQiyi Broadcasting Machine Platform is the launching tool for iQiyi and iQiyi to follow the platform. To fulfill the requirements of relevant laws and regulations and regulatory regulations, we will use the iQiyi Broadcasting Machine Platform.Collect your real -name authentication information (including name, ID card -related information (ID number, front and back photos of ID cards, positive face photos with your ID card)).", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to fulfill the requirements of relevant laws and regulations and regulatory systems, we will collect your real -name authentication information through iQiyi Broadcasting Platform."}
{"task": "rw_11.jsonl", "id": 40608, "text": "Institutional creator: In order to ensure the authenticity of the partner's identity, ensure the security and cooperation of transactions and cooperation, if you apply to become an institutional creator of the iQiyi IQ, we need to collect your corporate name, unified social credit code, business license, andThe identity information of the legal representative or operator (may include name, ID card -related information, face information (static or dynamic), mobile phone number), bank card -related information, may be different according to the actual situation, and ID card -related information and information and information and information and information and information and information and information and information and information and information and information and information and information related toFace information only signed a cooperation agreement with you, to ensure the smooth signing of the agreement for collection);", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "If you apply to become an institutional creator for iQiyi IQ, we need to collect your corporate name, unified social credit code, business license, legal representative or operator identity information."}
{"task": "rw_11.jsonl", "id": 40609, "text": "If you are a personal user and apply to become an institutional signing expert, you first need to perform real -name information certification in accordance with the requirements of iQiyi IQ service.Face information (static or dynamic), may be different according to the actual situation).", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If you are a personal user and apply to become an institutional signing expert, we will collect your real -name authentication information."}
{"task": "rw_11.jsonl", "id": 40610, "text": "We will entrust a third -party real -name authentication service provider to conduct real -name verification, explain to you on the relevant verification page to explain to you the types of information collected and used, and get your authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will entrust a third -party real -name authentication service provider for real -name verification and explain to you to obtain your authorization consent."}
{"task": "rw_11.jsonl", "id": 40611, "text": "Professional content producers: According to relevant laws and regulations and regulatory requirements, when you apply for content producers in some professional fields, we need to collect relevant personal information such as service qualifications, professional qualifications, and professional backgrounds in your corresponding professional field for verification.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you apply for content producers in some professional fields, we need to collect related personal information such as service qualifications, professional qualifications, and professional backgrounds in your corresponding professional field for verification."}
{"task": "rw_11.jsonl", "id": 40612, "text": "For the above -mentioned scenarios that require real -name authentication and authentication, you need to request your camera/album permissions. If you refuse to authorize, you may cause your real -name authentication failure;", "label": ["Permission Acquisition", "Important"], "rewrite": "The scene of real -name authentication and authentication requires your camera/album permissions."}
{"task": "rw_11.jsonl", "id": 40613, "text": "If you refuse to provide relevant personal information, you cannot use such functions and services, and do not affect your other functions and services.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40614, "text": "2. Settlement", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40615, "text": "When you use our withdrawal function, you need to provide information about bank card related to your real -name information to complete bank card binding and fund settlement.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the withdrawal function, you need to provide information related to your real -name information."}
{"task": "rw_11.jsonl", "id": 40616, "text": "You can view the bank card information bound to your iQiyi account on the relevant page of our product or apply for a bank card for replacement.", "label": ["Important", "Edit/Control"], "rewrite": "You can check the bank card information bound to your iQiyi account or apply for a binding bank card."}
{"task": "rw_11.jsonl", "id": 40617, "text": "If you refuse to provide relevant information about the aforementioned bank card, you will not be able to withdraw from it smoothly and will not affect your other functions and services.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40618, "text": "(3) Service Content Browse/Search/Playing", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40619, "text": "1. Service content browse/play", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40620, "text": "When you use our audio and video, electronic readings (books, comics) and other service content to browse and playback functions, provide you with a continuous and consistent experience and ensure service quality for you. We need to record your equipment information and individualsInternet records.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use audio and video, electronic readings and other service content to browse and playback functions, we need to record your equipment information and personal Internet records."}
{"task": "rw_11.jsonl", "id": 40621, "text": "The aforementioned device information includes: network -related information (IP address, base station, Bluetooth, network operator, WLAN access point (such as SSID, BSSID), network status, type, access method) and equipment parameter information (device name, device model), Operating system information (operating system and version, system language, resolution, screen height and width, CPU serial number, total disk space, system memory space).", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40622, "text": "The aforementioned personal Internet records include: browse/click/play records, collection/attention/attention/reservation records, likes/sharing/release records, visits date/time/time, number of interaction, etc.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40623, "text": "When you watch the video, to provide you with a good viewing experience, we will call your acceleration and direction sensor, and to detect the screen direction of the device through your sensor information (separate sensor information)Switch horizontal screen.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you watch the video, we will call your acceleration and direction sensor, detect the changes in the screen direction of the device, and switch the horizontal and vertical screen during video playback."}
{"task": "rw_11.jsonl", "id": 40624, "text": "When you use a panoramic video and immersion mode, we will call your magnetic field and gyroscope sensor to detect your mobile phone movement and rotation behavior, and position the area of the video screen.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "When you use a panoramic video and immersion mode, we will call your magnetic field and gyroscope sensor to detect your mobile phone movement and rotation behavior."}
{"task": "rw_11.jsonl", "id": 40625, "text": "Eye protection mode: To help you protect your vision, we provide eye protection mode (only iOS mobile phone end users) in the product.", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40626, "text": "Eye protection mode requires your camera permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "Eye protection mode requires your camera permissions."}
{"task": "rw_11.jsonl", "id": 40627, "text": "When you authorize the eye protection mode, we will use TrueDepth, APIS to obtain the space location information of your face to calculate the distance between your face and device screens in real time.Essence", "label": ["Important", "First Party Collection Information"], "rewrite": "When you authorize the eye protection mode, we will use the TrueDepth Apis to obtain the space location information of your face."}
{"task": "rw_11.jsonl", "id": 40628, "text": "This function is implemented on your local device, and we will not return, store or share any information of you with third parties.", "label": ["Data Retention", "Third Party Sharing/ Disclosure", "Important"], "rewrite": "The eye protection mode is implemented on your local device, and we will not return, store or share any information with your third parties."}
{"task": "rw_11.jsonl", "id": 40629, "text": "You can turn on/off the eye protection mode on the related settings page: iQiyi APP-Mine-Settings-Play and download-children's eye protection mode.", "label": ["Edit/Control", "Important"], "rewrite": "You can turn on/off the eye protection mode on the related settings page: iQiyi APP-Mine-Settings-Play and download-children's eye protection mode."}
{"task": "rw_11.jsonl", "id": 40630, "text": "Vote the screen: When you use the screen service to play the video content, we need to find and connect to the local network devices, collect your network information, WLAN access points (such as SSID, BSSID) and TV -side hardware equipment names, names, and TV -side hardware equipment names, names, names, and TV -side hardware equipment names, names, names, and TV -side hardware equipment names, names, and TV -side hardware equipment names.Manufacturers and equipment models to confirm that your mobile client hardware equipment and TV -side hardware equipment are in the same local area network to achieve the interoperability and completion effect adaptation of hardware equipment.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the screen service to play video content, we need to find and connect to the local network device, collect your network information and TV -side hardware equipment names, manufacturers, and equipment models to achieve the interconnection of hardware equipment."}
{"task": "rw_11.jsonl", "id": 40631, "text": "Operator free flow service: When you use the free traffic viewing video and other services that we cooperate with the operator, in order to accurately identify the status of the free traffic user and better record the traffic consumption of the consumed consumption, we need to collect your IP address, international international, international international, internationalMobile user identification code (IMSI), network operators, equipment model information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use free traffic to watch videos and other services, we need to collect your IP address, international mobile user identification code (IMSI), network operators, equipment model information."}
{"task": "rw_11.jsonl", "id": 40632, "text": "2. Service content search", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40633, "text": "When you use the search function, we will automatically collect some of your information, including the following personal information: search content, browsing records and time, search time, and the number of times to interact with them.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the search function, we will automatically collect some of your information."}
{"task": "rw_11.jsonl", "id": 40634, "text": "In order to provide efficient search services, some of the aforementioned information will temporarily store on your local device and show you search history.", "label": ["Data Retention", "Important"], "rewrite": "Search historical records will temporarily store on your local equipment and show you."}
{"task": "rw_11.jsonl", "id": 40635, "text": "Voice search: We provide you with a voice search function.", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40636, "text": "When you use the voice search function, we will ask you to authorize the microphone rights and collect your voice information.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "When you use the voice search function, we will ask you to authorize the microphone rights and collect your voice information."}
{"task": "rw_11.jsonl", "id": 40637, "text": "Photo search: When you use the picture search function, we will ask you to authorize the camera, album permissions, and collect the picture information you choose to search.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "When you use the picture search function, we will ask you to authorize the camera, album permissions, and collect the picture information you choose to search."}
{"task": "rw_11.jsonl", "id": 40638, "text": "AR sweeping: When AR sweeps the content of the stars, posters, etc., we will call your light sensor to adjust the screen brightness;", "label": ["Permission Acquisition", "Important"], "rewrite": "When AR sweeps the contents of the stars, posters, etc., we will call your light sensor to adjust the screen brightness."}
{"task": "rw_11.jsonl", "id": 40639, "text": "Call your acceleration sensor to detect the direction and angle information of your equipment to remind and help you complete the identification smoothly.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "We will call your acceleration sensor to detect the direction and angle information of your equipment."}
{"task": "rw_11.jsonl", "id": 40640, "text": "(4) Information production and release", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40641, "text": "Content release: When you use pictures/audio and video production, publishing, live broadcast, posts, barrage, comments and other functions, you may actively provide related graphic/audio and video content information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use pictures/audio and video production, release, live broadcast, posts, barrage, comment and other functions, you may actively provide relevant graphic/audio and video content information."}
{"task": "rw_11.jsonl", "id": 40642, "text": "We will collect your above information and show your nicknames, avatars, and publishing content.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect the relevant graphic/audio and video content information, and show your nickname, avatar, publishing content."}
{"task": "rw_11.jsonl", "id": 40643, "text": "At the same time, we will collect your interactive information, including interactive records such as praise/sharing/review/collection.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect your interactive information."}
{"task": "rw_11.jsonl", "id": 40644, "text": "The information you posted may include personal information of others. Please obtain legal authorization of others to avoid illegally leaking personal information of others.", "label": ["Important", "First Party Collection Information"], "rewrite": "The information you posted may include personal information of others, please be able to obtain legal authorization of others."}
{"task": "rw_11.jsonl", "id": 40645, "text": "As for the production and release function of the aforementioned part of the information, when you use it, we will ask you to authorize the rights of the camera, album, and microphone.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you make information release, we will ask you to authorize the rights of cameras, albums, and microphones."}
{"task": "rw_11.jsonl", "id": 40646, "text": "Content review: In order to meet the requirements of relevant laws and regulations, fulfill the ecological governance obligations of the content of the network information, and prohibit the release and dissemination of illegal and bad information. For the content you posted, we will review it through machines and artificially.", "label": ["Important", "Usage"], "rewrite": "As for the content you posted, we will review it through machines and artificially."}
{"task": "rw_11.jsonl", "id": 40647, "text": "Please rest assured that we will only review the content you posted by the above purposes, and will not be processed.", "label": ["Usage"], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40648, "text": "Account Management: In order to meet the relevant requirements of supervision of Internet account management, for any users who have published information, we will display your IP address on your personal space page, graphic/video release page, comment and other information release page to display your IP addressBased on provinces/municipalities.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For any users who have published information, we will display your IP address belonging to the province/municipality on your personal space page, graphic/video release page, review and other information release page."}
{"task": "rw_11.jsonl", "id": 40649, "text": "In response to institutional content creators and agencies signing experts, we will display information about your iQiyi's account, registered operation address, content production category, unified social credit code and other information on your personal space page;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In response to institutional content creators and agencies signing experts, we will display information such as the operating subject, registered operation address, content production category, unified social credit code and other information on your personal space page."}
{"task": "rw_11.jsonl", "id": 40650, "text": "For content producers in some professional fields, we will display the corresponding authentication information in your personal space page.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For content producers in some professional fields, we will display the corresponding authentication information in your personal space page."}
{"task": "rw_11.jsonl", "id": 40651, "text": "Publishing tool:", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40652, "text": "(1), if you want to display the publishing location in the work information, you can automatically add your geographical information by authorizing our location authority, and you can also take the initiative to select) Add.", "label": ["Permission Acquisition", "Edit/Control", "Important"], "rewrite": "If you want to display the publishing location in the information, you can automatically add it by authorizing the position authority, or you can add it by actively selection."}
{"task": "rw_11.jsonl", "id": 40653, "text": "(2) In the process of making AR video clips and production, we call your light sensor to detect the light and adjust the brightness;", "label": ["Permission Acquisition", "Important"], "rewrite": "In the process of AR video editing and production, we call your light sensor, detect light, and adjust the brightness."}
{"task": "rw_11.jsonl", "id": 40654, "text": "Call your acceleration sensor and detect the direction and angle information of your equipment to realize the angle adjustment of the AR material screen.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "We will call your acceleration sensor to detect the direction and angle information of your device to realize the angle adjustment of the AR material screen."}
{"task": "rw_11.jsonl", "id": 40655, "text": "(3) In some of our products and/or services, when you shoot the interactive video of the game, we will call your gyroscope sensor to detect the direction and angle information of your equipment to adjust the angle of the interactive video.", "label": ["First Party Collection Information", "Permission Acquisition"], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40656, "text": "(4) In order to provide you with better video visual effects, we provide you with video beautification functions such as beauty, beauty, filter, special effects, and face stickers.", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40657, "text": "When you use this function, we will intelligently identify your skin and facial parameters through the facial point technology to locate your facial features and judge the results according to the location to match makeup or provide corresponding special effects.", "label": ["Important", "Usage"], "rewrite": "When you use the video beautification function, we will intelligently identify your skin and facial parameters through the face point technology to match your makeup or provide corresponding special effects."}
{"task": "rw_11.jsonl", "id": 40658, "text": "This function is implemented on your local device. We will not use the aforementioned information for face recognition, nor will it be passed on, storage or shares your information with a third party.", "label": ["Data Retention", "Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "The video beautification function is implemented on your local device. We will not use the information for face recognition, nor will it be passed on, storage, or share your information with a third party."}
{"task": "rw_11.jsonl", "id": 40659, "text": "In addition, we provide you with beauty memory services, and we will record the beauty parameters you set in the login state (such as the face loss index, whitening index, big eye index, etc.), so that you can directly match the corresponding match next time you log in to use this function.Parameters, convenient for you to use.", "label": ["Important", "First Party Collection Information"], "rewrite": "Provide you with beauty memory services, we will record the beauty parameters you set in the login state."}
{"task": "rw_11.jsonl", "id": 40660, "text": "At the same time, we may use the facade image depth related information operation results in the human face image in the ARKit and TrueDepth API of iOS to optimize our beautification function to achieve better processing effects.", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40661, "text": "We will not use the operation result for other purposes, nor will we return and store to the server.", "label": ["Data Retention", "Important", "Usage"], "rewrite": "We will not use the calculation results for other purposes, nor will we return or store to the server."}
{"task": "rw_11.jsonl", "id": 40662, "text": "(5) Exchange interaction", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40663, "text": "When you conduct exchanges and interaction, we will collect your interactive records (including interactive records such as reviews/sharing/attention), interactive content (including communication and interactive information such as reviews, barrage).", "label": ["Important", "First Party Collection Information"], "rewrite": "When you communicate and interact, we will collect your interaction records and interactive content."}
{"task": "rw_11.jsonl", "id": 40664, "text": "Watch \"together\": When you use the \"watch together\" function, in order to achieve real -time communication with your friends when watching together, we will ask your microphone rights and collect your voice information to collect your voiceInformation is necessary to realize your communication with your friends and content audits.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the \"watch\" function together, we will ask your microphone rights and collect your voice information to realize the need to communicate with your friends and content review."}
{"task": "rw_11.jsonl", "id": 40665, "text": "After we are commissioned by our entrusted third parties (if.) After real -time processing, we will return to you to deal with the results, and will not store your voice information.", "label": ["Data Retention", "Important"], "rewrite": "After we and we entrust the third -party real -time processing voice information, we will return to you to process the results, and will not store your voice information."}
{"task": "rw_11.jsonl", "id": 40666, "text": "Friend recommendation/invitation/sharing: When you use friend recommendation, invitation, and sharing functions (such as recommending contacts in your address book to follow, inviting your friends to use our products and/or services in activities, sending you (or your Works) to recommend people you may know), we may request your address book permission and collect relevant address book information (including contact names and corresponding contact information, address book friend list).", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "When you use your friends to recommend, invite, and share functions, we may ask your communication records and collect relevant address book information."}
{"task": "rw_11.jsonl", "id": 40667, "text": "Communication records are sensitive permissions, please open it with caution.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40668, "text": "We may recommend friends to recommend friends based on people who have a relationship with you, attention, fans, and users who have been interacting with you with content/activities, that is, the system may recommend friends (or friends based on the aforementioned information (or friends (or friendsWork) or recommend you (or your work) to the corresponding users.", "label": ["Important", "Usage"], "rewrite": "We may recommend friends to recommend friends based on people who have a relationship with your friends, attention, fans, and users who have been interacting with you with content/activities."}
{"task": "rw_11.jsonl", "id": 40669, "text": "We respect your right to choice. If you don't want to be recommended to friends, you can set up on the related page. The path: iQiyi APP-Mine-Privacy Center-Other Privacy Settings-Recommend me to someone who may know.", "label": ["Important", "Edit/Control"], "rewrite": "You can close your friend recommendation through \"iQiyi APP-Mine-Privacy Center-Other Privacy Settings-Recommend me to someone who may know\"."}
{"task": "rw_11.jsonl", "id": 40670, "text": "(6) Place order, order management and delivery", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40671, "text": "1. Place order and order management", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40672, "text": "When you buy goods/services, we need to collect the following or all personal information based on the type of goods/service, including: your consignee information (may include names, addresses, contact telephones, postal code, invoice information, if you collect itIf the goods are not you, you should ensure that you have obtained the relevant authorization of the consignee), the trading product/service information, the order number, the order time, the order amount, and your remarks information. We collect this information to help you complete the successful completionCommodity/service purchase, guarantee your transaction security, query order information, provide customer service, etc.", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40673, "text": "At the same time, in order to facilitate your understanding, query order information, and manage order information, we will collect the order information you generated during our service process to display it to you and facilitate the management of your order.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "To facilitate your understanding, query order information and manage order information, we will collect your order information."}
{"task": "rw_11.jsonl", "id": 40674, "text": "2. Payment", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40675, "text": "In order to complete the order payment and ensure the security of transactions, we need to collect your transaction amount, order time, order merchant, order number, payment method, payment account, payment status information, andFinancial institutions such as banks) are shared by the aforementioned part or all information.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "In order to complete the order payment and ensure the security of transactions, we need to collect your transaction amount, order time, order merchant, order number, payment method, payment account, payment status information, and share with the payment institution."}
{"task": "rw_11.jsonl", "id": 40676, "text": "At the same time, if you use the face/fingerprint login and/or payment function of the person in our product and/or service, you need to enter the face or fingerprint information on your local device, and when using the serviceComplete information verification.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If you use the face/fingerprint login and/or payment function of the person in our product and/or service, you need to enter the face or fingerprint information in advance and complete the information verification."}
{"task": "rw_11.jsonl", "id": 40677, "text": "We need to use your face ID/touch ID permissions (biometric identification authentication permissions) to receive the verification results, but we do not collect your face or fingerprint information.", "label": ["Permission Acquisition", "Important"], "rewrite": "We need to use face ID/touch ID permissions to receive verification results, but do not collect face or fingerprint information."}
{"task": "rw_11.jsonl", "id": 40678, "text": "If you do not turn on this authority, you will not be able to use the aforementioned service, but it will not affect your choice of other login or payment methods.", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40679, "text": "3. Delivery", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40680, "text": "After you have successfully placed an order, such as providing or product/services for third -party merchants in the product/service department requires third -party distribution. In order to smoothly, safe, and accurately complete the delivery and delivery of goods/services, third -party merchants and logistics service providersIt is inevitable that your consignee information will be known.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "If the product/service department you place an order provides or requires a third -party distribution, third -party merchants and logistics service providers will inevitably know your consignee information."}
{"task": "rw_11.jsonl", "id": 40681, "text": "At the same time, in order to provide you with the purpose of after -sales and dispute solutions, we may need to learn and confirm the delivery progress and status in a timely manner. You agree that we can collect information related to the delivery progress from the aforementioned subject.", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to provide you with the purpose of after -sales and dispute solutions, we may need to learn and confirm the delivery progress and status in a timely manner."}
{"task": "rw_11.jsonl", "id": 40682, "text": "(7) Event participation", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40683, "text": "Reward distribution: When you participate in our activities, such as drawing, quiz, answering, and questionnaires, you may need to submit relevant information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you participate in our activities, you may need to submit relevant information."}
{"task": "rw_11.jsonl", "id": 40684, "text": "For example: In order to receive rewards, you need to provide necessary personal information related to receiving prizes (for example: those involved in offline sending, need to provide the consignee information;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "To receive rewards, you need to provide necessary personal information related to the award."}
{"task": "rw_11.jsonl", "id": 40685, "text": "Those involved in real -name certification, such as the purchase of tickets for amusement parks, need to provide information -related information).", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40686, "text": "Share and interact: In the case of sharing (such as using WeChat) or receiving the information that has been shared, and participating in the event, we will read your clipboard content to determine whether there is a related oral order code (such as invitation code, member rights code)Information to achieve functions or services such as jumping, sharing, and activities.", "label": ["Permission Acquisition", "Important"], "rewrite": "In the case of sharing or receiving the shared information and participation in the event, we will read your clipboard content to determine whether there is a related oral code information."}
{"task": "rw_11.jsonl", "id": 40687, "text": "Only when the clipboard has the aforementioned information, we will collect the information after the server is verified, and feedback you to the content or binding related rights you need.", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40688, "text": "Please rest assured that we will not collect and store other information about your clipboard, and the separate clipboard information cannot identify your specific identity.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will not collect and store other information about your clipboard."}
{"task": "rw_11.jsonl", "id": 40689, "text": "In addition, we may need to apply for access to your mobile phone album to facilitate the shared videos and pictures that have been shared.", "label": ["Permission Acquisition", "Important"], "rewrite": "We may need to apply for access to your mobile phone album to facilitate the shared videos and pictures that have been shared."}
{"task": "rw_11.jsonl", "id": 40690, "text": "Innovation interaction: When you use innovative activities, advertising and other interaction functions (such as shaking and twisting the screen), we call your gyroscope, gravity, and acceleration sensor to determine your equipment status and confirm whether you participate in your equipment status.The aforementioned interaction.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "When you use the interactive function, we call your gyroscope, gravity, and acceleration sensor to determine your device status to confirm whether you are involved."}
{"task": "rw_11.jsonl", "id": 40691, "text": "Calendar reservation: When you use videos, live broadcasts, activities, product launch, etc., we will request your calendar permissions. After you authorize the permission of the calendar, we will access your calendar to help you make an appointment or adjust the appointment.Time and remind you.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use reminders or appointment functions, we will ask your calendar permissions to help you make an appointment or adjust the time for appointment and remind you."}
{"task": "rw_11.jsonl", "id": 40692, "text": "(8) Market promotion and news notice", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40693, "text": "For your contact information (including contact telephone number, contact mailbox) you provided during the use process, we may send one or more of them in operation, for user messages, authentication, securityVerification, user use experience research and other uses.", "label": ["Important", "Usage"], "rewrite": "We may send multiple types of notifications for your contact information you provided during your use."}
{"task": "rw_11.jsonl", "id": 40694, "text": "After your authorization consent, we may provide you with commercial information such as advertising, business activities such as SMS, telephone and/or mail.", "label": ["Important", "Usage"], "rewrite": "After your authorization consent, we may provide you with commercial information such as advertising and business activities that you may be interested in."}
{"task": "rw_11.jsonl", "id": 40695, "text": "If you don't want to receive our commercial information, in the iQiyi APP, you can set it on the related page. The path: iQiyi APP-Mine-Privacy Center-other privacy settings-business information receiving;", "label": ["Important", "Edit/Control"], "rewrite": "You can refuse to receive commercial information through \"iQiyi APP-Mine-Privacy Center-other privacy settings-commercial information receiving\"."}
{"task": "rw_11.jsonl", "id": 40696, "text": "You can also withdraw the booking method provided by SMS and email (for example: you can reply to the marketing SMS by replying to \"TD\").", "label": ["Edit/Control", "Important"], "rewrite": "You can use the withdrawal method provided by SMS and email for commercial information."}
{"task": "rw_11.jsonl", "id": 40697, "text": "(9) Operation and product safety needs", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40698, "text": "We need to collect some of your information to ensure the security of your products and/or services when using our products and/or services, prevent malicious procedures and anti -cheating, anti -fraud, and assist in improving our products and/service security.And reliability to prevent any behaviors that endanger users, iQiyi Group, and society, including: equipment information, personal Internet records, service log information, transaction information, account number and real -name authentication related information, geographical location information, and obtain you in accordance with the law to obtain you in accordance with the law and obtain you in accordance with the law.After authorization, the information collected by our related companies and partners.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We need to collect some of your information to ensure the security of accounts, systems and transactions, and prevent malicious procedures and anti -cheating, anti -fraud."}
{"task": "rw_11.jsonl", "id": 40699, "text": "At the same time, we will detect the related sensors of your equipment to further provide a safe, credible product and use environment, and provide high -quality and reliable services and information.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40700, "text": "The aforementioned device information includes: device identification information (IMEI, Meid, IMSI, Android ID, IDFA, IDFV, OAID, ICCID, OpenUDID, GAID, MAC address and other comprehensive device parameters and system information formation, application list, application list,Network -related information (WLAN access points (such as SSID, BSSID), Bluetooth, base station, IP address, network operator, network status, type, access method), device parameter information (device name, hardware model, hardware sequence number), Software and hardware operating system information (application version, operating system, language, resolution), etc.", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40701, "text": "The aforementioned personal Internet records include: you use our audio and video browsing, clicking, searching, playing, communicating and interactive, ordering, paying, payment, activity participation, etc. The operation records of the products and/or services we provide.", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40702, "text": "The aforementioned service log information includes: the application information that is being installed or the process information that is running, the overall operation of the application, the use of usage and frequency, the application crash, the overall installation usage, performance data, and the source of the application.", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40703, "text": "We will comprehensively judge your account and transaction risk based on the above information, conduct authentication, test and prevent security incidents, scam monitoring, archive and backup purposes, and take necessary records, audit, analysis, and disposal measures in accordance with the law.", "label": ["Important", "Data Security"], "rewrite": "We will comprehensively judge your account and transaction risk, conduct authentication, test and prevent security incidents, scam monitoring, archive and backup purposes, and take necessary records, audit, analysis, and disposal measures in accordance with the law."}
{"task": "rw_11.jsonl", "id": 40704, "text": "After the above information is identified or anonymous, it may be used for internal research, statistical analysis and prediction, improve the content and layout of our platform and services, provide product or service support for business decisions, and improve our products and services (to improve our products and services (Including anonymous data for machine learning or model algorithm training).", "label": ["Important", "Usage"], "rewrite": "After the information is identified or anonymous, it may be used for internal research, statistical analysis and prediction, and improve services."}
{"task": "rw_11.jsonl", "id": 40705, "text": "(10) Service content display and recommendation", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40706, "text": "We will collect your personal Internet records, and combine the basic information information (such as), equipment information, personalized tags you actively choose (only applicable to audio and video content recommendations), general geographical location information, member identityInformation (Gold/Platinum/Star Diamond Member identity), order information and other personal information you have authorized (including some information collected by your partner on your partner platform after obtaining your authorization in accordance with the law), extract your preference characteristicsRecommend your correlation with stronger graphic/audio and video content, information and information, and commercial information such as push, advertising and other more matched with your needs, optimize our display and search results, and improve our recommendation mechanism.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We will collect your personal Internet records, and combine your personal information that you actively fill in, extract your preference features, and make personalized recommendations to you."}
{"task": "rw_11.jsonl", "id": 40707, "text": "The aforementioned personal Internet records include: you use our audio and video browsing, clicking, searching, playing, communicating, ordering, ordering, and participation in our products and/or services.", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40708, "text": "The aforementioned device information includes: device logo information (IMEI, Meid, IMSI, Android ID, IDFA, IDFV, OAID, OpenUDID, ICCID, GAID, MAC addresses and other comprehensive device parameters and system information formation of equipment logo, application list, application listEquipment parameter information (device name, hardware model), network -related information (network status, type, access method, network operator), software and hardware operating system information (operating system and its version, application version, language settings, resolution, resolution, resolution, resolution, resolution, resolution)wait.", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40709, "text": "To avoid doubt, the basic information information of your information (such as your nickname, gender, birthday, region, etc., if.) You decide whether to fill in it. If you have not filled inWe will not extract your preferences based on this and recommend it to you;", "label": ["Important", "First Party Collection Information", "Edit/Control"], "rewrite": "Your basic information information is self -decided to fill in, and we will not extract your preferences based on this and recommend it to you."}
{"task": "rw_11.jsonl", "id": 40710, "text": "Regarding your personalized label, you will manage and adjust yourself. We will recommend your favorite content and adjust your video preferences based on your choice.", "label": ["Important", "Usage", "Edit/Control"], "rewrite": "Your personalized label will be managed and adjusted by yourself, and we will recommend it to you according to your choice."}
{"task": "rw_11.jsonl", "id": 40711, "text": "You can pass the path in iQiyi APP: iQiyi APP-Mine-Privacy Center-content recommendation management-personalized label management, select your favorite personalized label.", "label": ["Important", "Edit/Control"], "rewrite": "You can use the path: iQiyi APP-Mine-Privacy Center-content recommendation management-personalized label management, select your favorite personalized label."}
{"task": "rw_11.jsonl", "id": 40712, "text": "If you have not chose any personalized label, we will not extract your preferences based on this and recommend it to you.", "label": ["Important", "Usage"], "rewrite": "If you have not chose any personalized label, we will not extract your preferences based on this and recommend it to you."}
{"task": "rw_11.jsonl", "id": 40713, "text": "Some of our content will be recommended to you according to your geographical location information (for example: according to the cities and/or counties corresponding to the cities corresponding to the general geographical location information to you, recommend the local content of your area (city, district, county, etc.);", "label": ["Important", "Usage"], "rewrite": "Some of our content will be recommended to you according to your geographical information."}
{"task": "rw_11.jsonl", "id": 40714, "text": "To you according to the accurate geographical location information, recommend user works nearby, etc.).", "label": ["Usage"], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40715, "text": "If you refuse to authorize us to obtain your location permissions, we will not make content display, recommendation, etc. to you based on the geographical information obtained through your location permissions, but it will not affect the normal use of other functions.", "label": ["Usage", "Permission Acquisition"], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40716, "text": "In the process of recommending content to you, we strive to use advanced technologies to properly protect your privacy.", "label": ["Important", "Data Security"], "rewrite": "In the process of recommending content to you, we strive to protect your privacy properly."}
{"task": "rw_11.jsonl", "id": 40717, "text": "We will use de -identification technology and recommendation algorithms based on machine learning, model predictions, etc. to recommend you more suitable for you according to the calculation results.", "label": ["Important", "Usage"], "rewrite": "We will use de -identification technology and recommendation algorithm recommendation content based on machine learning, model prediction and so on."}
{"task": "rw_11.jsonl", "id": 40718, "text": "And our recommendation algorithm does not identify the true identity of a specific natural person.", "label": ["Important", "Usage"], "rewrite": "Our recommendation algorithm does not identify the true identity of a specific natural person."}
{"task": "rw_11.jsonl", "id": 40719, "text": "You can manage personalized content recommendations and procedural/personalized advertising recommendations based on the \"(3) withdrawal consent\" guidelines in Chapter 4 of this policy.", "label": ["Important", "Edit/Control"], "rewrite": "You can manage personalized content recommendation and programmatic/personalized advertising recommendations."}
{"task": "rw_11.jsonl", "id": 40720, "text": "(11) Customer service and other user response functions", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40721, "text": "When you use our customer service or other user response functions, for your account and system security, we may need you to provide account information first and match your previous personal information to verify your user identity.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "When you use the user's response function, we may need you to provide account information first and verify your identity."}
{"task": "rw_11.jsonl", "id": 40722, "text": "At the same time, we may also need to collect your following personal information: contact information (the phone number/email address you use when you contact us or other contact information you provide to us), your communication information (including text, including text/Picture/Audio Video/Call Records), other necessary information associated with your needs.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may need to collect your contact information, communicate information with us, and other necessary information related to your needs."}
{"task": "rw_11.jsonl", "id": 40723, "text": "We collect this information to investigate the facts and help you solve the problem.", "label": ["Important", "Usage"], "rewrite": "We collect the information to investigate the facts and help you solve the problem."}
{"task": "rw_11.jsonl", "id": 40724, "text": "When you use some functions of online customer service, feedback, etc., we will ask your camera, album, microphone permission and collect your pictures/audio and video, voice information.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "When you use some functions of online customer service, feedback, etc., we will ask your camera, album, microphone permission and collect your pictures/audio and video, voice information."}
{"task": "rw_11.jsonl", "id": 40725, "text": "If you refuse to provide, it will only make you unable to use this function, but it does not affect other functions of your normal use of products and/or services.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40726, "text": "(12) Other functions", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40727, "text": "If a function or product/service that needs to collect your personal information is not explained in this policy, or we are beyond the purpose of the purpose of being claimed to be related to your personal information and the scope of a direct or reasonable relationship, weI will tell you again and obtain your consent in accordance with the relevant requirements of laws and regulations.", "label": ["Important", "First Party Collection Information"], "rewrite": "If the collection and use information fails to explain in this policy, or exceeds the known purpose, we will tell you again and obtain your consent."}
{"task": "rw_11.jsonl", "id": 40728, "text": "Exception", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40729, "text": "In the following circumstances, we handle your personal information without your authorization consent:", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In the following circumstances, we handle your personal information without your authorization consent:"}
{"task": "rw_11.jsonl", "id": 40730, "text": "In order to establish and fulfill the contract as a party as a party;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to establish and fulfill the collection and use information necessary for the person as a party as a party, there is no need to solicit authorization consent."}
{"task": "rw_11.jsonl", "id": 40731, "text": "To fulfill the statutory duties or the requirements of the statutory duty;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to fulfill the statutory duties or the collection and usage information necessary for the statutory volunteer, there is no need to solicit authorization consent."}
{"task": "rw_11.jsonl", "id": 40732, "text": "In order to deal with emergencies, or in urgent situations, it is necessary to protect the health and property security of natural people in emergency situations;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to cope with emergencies, or in urgent cases to protect the life and health of natural persons and the necessary collection and use information, no need to solicit authorization."}
{"task": "rw_11.jsonl", "id": 40733, "text": "Implement news reports, public opinion supervision and other behaviors for public interests, and handle personal information within a reasonable range;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to implement news reports and public opinion supervision, deal with personal information within a reasonable scope without soliciting authorization consent."}
{"task": "rw_11.jsonl", "id": 40734, "text": "In accordance with the provisions of this Law, handle personal information within a reasonable scope or other legitimate personal information;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In accordance with laws and regulations, personal information is processed by individuals or other legal disclosure within a reasonable range, and no authorization consent is required."}
{"task": "rw_11.jsonl", "id": 40735, "text": "Other circumstances stipulated in laws and administrative regulations.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Other collection and use information stipulated in laws and regulations does not need to solicit authorization."}
{"task": "rw_11.jsonl", "id": 40736, "text": "Basic function mode", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40737, "text": "We provide the basic functional mode of audio and video browsing, searching, and playback, but in this mode, you cannot experience the high -quality services we provided by we provided by the speed, barrage, comment, sharing, members, etc. In the basic function mode, what you see in the basic function mode you seeVideo and other information will also be randomly pushed by operations;", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40738, "text": "The search function will only provide search results based on your search keywords, and will not optimize the search results.", "label": ["Usage"], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40739, "text": "In the basic functional mode, we will not collect device MAC addresses and device logo information (Android, such as Android, ID/OAID/GAID;", "label": ["Important", "First Party Collection Information"], "rewrite": "In the basic functional mode, we will not collect the MAC address and equipment identification information of the device."}
{"task": "rw_11.jsonl", "id": 40740, "text": "iOS end, such as: IDFA/IDFV), etc., such as device information and other personal information that may recognize your personal identity.", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40741, "text": "You can switch to all functional modes under the basic function mode at any time.", "label": ["Important", "Edit/Control"], "rewrite": "You can switch to all functional modes under the basic function mode at any time."}
{"task": "rw_11.jsonl", "id": 40742, "text": "2. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40743, "text": "When you use our products and/or services, we or our partners may use cookies and similar technologies to collect some of your personal information, including: your habit of visiting the website, your browsing information, and your login information so that you can so as toProvide you with a better service experience.", "label": ["Important", "First Party Collection Information"], "rewrite": "We or our partners may use cookies and similar technologies to collect some of your personal information."}
{"task": "rw_11.jsonl", "id": 40744, "text": "We will strictly require third parties to use cookies and similar technologies within the scope of the policy.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40745, "text": "If your browser allows, you can manage cookies and similar technologies through your browser settings.", "label": ["Edit/Control", "Important"], "rewrite": "If your browser allows, you can manage cookies and similar technologies through your browser settings."}
{"task": "rw_11.jsonl", "id": 40746, "text": "You understand and know: Some of our products and/or services can only be achieved by using cookies or similar technologies. If you refuse to use or delete, you may not be able to get our products and/or services the best for the best service of our products and services.The service experience may also have a certain impact on your information protection and account security.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40747, "text": "For more situations about using Cookie and similar technologies, please check the iQiyi Cookie policy.", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40748, "text": "3. How can we share, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40749, "text": "(1) Sharing", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40750, "text": "We share your personal information on the premise that we follow the premise of \"legitimate legitimacy, minimum necessity, and clear principle of purpose.\"", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We share your personal information on the premise that we follow the premise of \"legitimate legitimacy, minimum necessity, and clear principle of purpose.\""}
{"task": "rw_11.jsonl", "id": 40751, "text": "If we entrust a third party to handle your personal information, we will agreed with the trustee to agreed to the purpose, time limit, processing method, type of personal information, protection measures, and the rights and obligations of both parties, andInformation processing activities supervise.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If we entrust a third party to handle your personal information, we will agreed with the trustee's various contents to be commissioned and supervise the trustee's personal information processing activities."}
{"task": "rw_11.jsonl", "id": 40752, "text": "If we and third -party personal information processors determine the purpose and method of processing your personal information, it will agreed with the partners to agree on their respective rights and obligations, and the agreement will not affect you from any of the individual information processors to exercise you to exercise youIf the rights of your personal information are damaged, we will bear joint responsibility according to law.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If we and third -party personal information processors jointly determine the purpose and method of processing of personal information, if we infringe your personal information rights and interests, we will bear joint responsibility according to law."}
{"task": "rw_11.jsonl", "id": 40753, "text": "We will conduct an evaluation of personal information protection for the shared activities of personal information, and take effective technical protection measures on the output form, circulation, use, etc.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will conduct a pre -personal information protection assessment of personal information sharing activities and take effective technical protection measures."}
{"task": "rw_11.jsonl", "id": 40754, "text": "At the level of the cooperation agreement, the information protection obligations and responsibilities of the partner's information are strictly requested, and the protection agreement on data security with business partners has signed a protection agreement on data security before cooperation.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "At the level of the cooperation agreement, the information protection obligations and responsibilities of the partner's information are strictly required."}
{"task": "rw_11.jsonl", "id": 40755, "text": "We have developed the \"Information Sharing List\" to clearly and simply introduce our \"iQiyi\", \"iQiyi Edition\", \"Set\" embedded SDK list and the third -party list of partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For details of the SDK list and third -party list of partners, please refer to the \"Information Sharing List\"."}
{"task": "rw_11.jsonl", "id": 40756, "text": "Check the iQiyi \"Information Sharing List\", iQiyi's \"Information Sharing List\", and \"List of Information Sharing\".", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40757, "text": "1. Our partner", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40758, "text": "(1) Payment service: In order to ensure the security of transactions and complete the payment of goods/services, we will pay your order payment related information (if you use bank card payment, you need to provide name, mobile phone number, ID card information, bank card information;", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "In order to ensure the security of transactions and complete the payment of goods/services, we will provide your order payment related information to provide payment services to partners."}
{"task": "rw_11.jsonl", "id": 40759, "text": "If you use phone bills, you need to provide mobile phone numbers) partners for payment services.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40760, "text": "(2) Co -branded member service: In order to help you successfully receive relevant rights and interests such as partners and members, we will provide your mobile phone number (QQ number (only when purchasing QQ joint members)) to partners who develop joint members.Ensure that partners can distribute relevant equity to the partner platform account that is bound to your aforementioned mobile phone number.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We will provide your mobile phone number to partners who develop joint members in order to receive members."}
{"task": "rw_11.jsonl", "id": 40761, "text": "(3) In order to help you use the operator's points to redeem the relevant rights and interests of iQiyi members, we will provide your mobile phone number to the point -to -purchase service partnerDeduct the corresponding points exchange of relevant membership rights.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We will provide your mobile phone number to the points and purchase service partners to help you use operators to exchange equity."}
{"task": "rw_11.jsonl", "id": 40762, "text": "(4) Real -name authentication service: In order to complete the real -name authentication and allow you to use our related services smoothly, we will entrust the real -name authentication service provider to inquire and verify your real -name authentication related information, including your name, ID card -related information, static or static or orDynamic face information (if it involves, it will get the user's individual consent again).", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We will entrust the real -name authentication service provider to inquire and verify your real -name authentication related information to complete the real -name authentication."}
{"task": "rw_11.jsonl", "id": 40763, "text": "(5), product/service warehousing, distribution and after -sales service: In order to realize the needs of purchasing goods/services (including commodity/service distribution and logistics query, enjoy after -sales service, etc.), we will use your purchase of goods/services and quantities of its amount, Delivery related information and processing the necessary personal information (to provide specific service purposes, provide users with personal information in the \"minimum necessary\" scope) to provide partners (such as warehousing and logistics service providers).", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We will provide your purchasing goods/services and quantities, distribution -related information, and personal information necessary for processing the problems involved to service partners to realize your needs for purchasing goods/services."}
{"task": "rw_11.jsonl", "id": 40764, "text": "(6) Joint marketing activities: In order to ensure your complete participation and help partners issue rewards to you, we will provide you with the information necessary to issue rewards to partners in joint marketing activities, such as: involving cooperation involving cooperationThe merchant is responsible for offline delivery. We need to provide the consignee information to the partner (the name of the consignee, the telephone number of the consignee, the receipt address, etc.).", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We will provide you with the information necessary for the reward to the marketing partners so that the partners can issue a reward to you."}
{"task": "rw_11.jsonl", "id": 40765, "text": "(7), marketing: We will provide equipment information after encrypted processing to some third -party websites and applications, and then provide you with information, commercial promotion, service promotion and other information on the third -party platform, and measure optimization and optimizationThe marketing effect on our products and/or services.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We will provide some third -party websites and applications with encrypted device information, thinking that you provide commercial information and optimize the promotion effect."}
{"task": "rw_11.jsonl", "id": 40766, "text": "(8) Advertising cooperation", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40767, "text": "Advertising: We may provide your equipment information and group labels to the advertisers and/or its commissioned agent to push you more suitable information such as information and promotion to you.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We may provide your equipment information and group labels to the advertisers and/or its entrusted agent to push you commercial information to you."}
{"task": "rw_11.jsonl", "id": 40768, "text": "Advertising site: In order to provide a better service that is more suitable for you, advertisers and/or its entrusted proxy business will collect the relevant personal information that you actively fill in on the relevant advertising page (including contact telephone number, specifically providing the actual page)Essence", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Put the agent will collect the relevant personal information of your active filling on the related advertising pages."}
{"task": "rw_11.jsonl", "id": 40769, "text": "Advertising statistical analysis and optimization: We may provide your equipment information, group labels, advertising exposure, browsing, clicking, playback, and advertising transformation data to provide partners who provide advertising statistical analysis and optimization services.Measure the effectiveness of advertising and related services, advertise or decision suggestions, increase the effective touch rate of advertising, and provide you with high -quality and suitable services for you;", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We may provide advertisements, group labels, advertising exposure, and other advertising related data to advertising service partners to analyze and optimize advertising."}
{"task": "rw_11.jsonl", "id": 40770, "text": "Advertisers and/or their entrusted agents may require us to provide the aforementioned part or all information for the operation analysis of user sources, optimize advertising strategies, or improve their products and services.", "label": ["Usage", "Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40771, "text": "Please rest assured that we will provide data to provide data with technical measures such as de -identification, anonymous or encryption algorithms in the above -mentioned advertising cooperation to ensure that partners cannot directly identify your identity.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will use technical measures such as de -identification, anonymous or encryption algorithms to deal with data to ensure that advertising partners cannot directly identify your identity."}
{"task": "rw_11.jsonl", "id": 40772, "text": "Based on the receiving data, the partners decide whether to issue advertisements through automation, analyze and optimize statistical analysis (including the combination of other data obtained from its legal acquisition for statistical analysis and optimization););", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Based on the receiving data, the partner decides whether to issue advertisements, conduct statistical analysis and optimization."}
{"task": "rw_11.jsonl", "id": 40773, "text": "Please know that for some advertising content, it is the personalized recommendation of the advertisers based on your user portrait, preferences and other user portraits based on your application/software. Without your authorization or illegal situationWill get your behavior or personal information in other applications.", "label": ["Important", "First Party Collection Information"], "rewrite": "Without your authorization or illegal situation, we will never obtain your behavior or personal information in other applications."}
{"task": "rw_11.jsonl", "id": 40774, "text": "In the process of using financial services, financial institutions (including banks, lending, insurance, fund securities companies and other institutions such as banks, loans, insurance, fund securities companies, etc.) that provide you with loans and deposits need to collect your personal information, and financial institutions will obtain your authorization consent separately.After your authorization consent, according to your instructions, we will transmit your relevant information (including device information, names, ID information, bank card information, address book information, geographical location information, shall prevail on your authorization) transmission) transmission)Give the partner in order to help you quickly complete the authentication of financial institutions, risk control verification, etc.;", "label": ["Important", "First Party Collection Information"], "rewrite": "In the process of using financial services, according to your instructions after you authorize and consent, we transmit your relevant information to financial institutions that provide you with loans and deposits."}
{"task": "rw_11.jsonl", "id": 40775, "text": "At the same time, you have authorized us to share with the aforementioned financial institutions that we use your relevant information collection of indirect user portraits, de -identification or anonymous analysis/statistical information to help financial institutions judge your credit status and reduce your credit status and reduceBad debt rate, ensuring commercial security and anti -fraud.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "You can authorize us to share the analysis/statistical information that we use the indirect user portrait, de -identification or anonymous processing formed by the cooperative financial institutions."}
{"task": "rw_11.jsonl", "id": 40776, "text": "We promise: With a separate consent, we will not share personal information that can directly recognize your identity with it.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "With a separate consent, we will not share personal information that can directly identify your identity with financial institutions."}
{"task": "rw_11.jsonl", "id": 40777, "text": "When you use the products and/or services provided by a third -party value -added service partner provided by third -party value -added service partners such as life payment/recharge/traffic recharge, we will serve as a trustee to collect your mobile phone number, payment household number, geographical location information based on the entrustment of the partner entrust(For example) (specifically based on the content commissioned by the partner), and transmit the aforementioned information to the partner to help the partner provide you with the corresponding third -party value -added services to you.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "When you use the products and/or services provided by a third -party value -added service partner provided by a third -party value -added service partner for your use of life payment/recharge/traffic recharge, we will collect your mobile phone number, payment account number, and geographical location information to value -added service cooperation based on the partner entrust.business."}
{"task": "rw_11.jsonl", "id": 40778, "text": "(9), the problem resolution and dispute handling: some activities/product services of our platform shall be provided or mainly provided by the partners or the partners.Disputes, etc., we may provide your personal information required to solve problems and deal with disputes within the \"minimum necessary\" range (such as: if the product delivery address error leads to the dispute, we may provide your distribution address information to the partner's delivery address informationSo that all parties can complete information verification).", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to solve the complaints and disputes between us and/or our partners, we may provide your personal information needed to solve problems and deal with disputes within the \"minimum necessary\" range."}
{"task": "rw_11.jsonl", "id": 40779, "text": "(10) On the premise of ensuring your personal information security and purpose, we may provide de -identified or anonymous data to scientific research institutes, universities and other institutions that cooperate with us for scientific research in related fields.Promote the development of scientific and technological.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Under the premise of ensuring your personal information security and purpose, we may provide dentalization or anonymous data to scientific research institutes, universities and other institutions that cooperate with us to use scientific research in related fields and promote scientific and technological development."}
{"task": "rw_11.jsonl", "id": 40780, "text": "(11) When we accept due diligence or audit, share your relevant information with external supervision, professional consulting agencies (such as audit institutions).", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "When we accept due diligence or audit, we shared your relevant information with external supervision, professional consulting agencies (such as audit institutions)."}
{"task": "rw_11.jsonl", "id": 40781, "text": "(12) Other shared sharing to realize our service/functions.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40782, "text": "2. Related app", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40783, "text": "In order to facilitate us to provide you with the needs of consistent services, improve personalized experience, realize security risk control, and provide customer service, the related APP with corresponding connections will apply a unified account system.", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40784, "text": "The affiliated company app that is applicable to the unified account system will synchronize some personal information of your registration, logging in, and using our products and/or services, which may include the following parts or all information: (1) your device information;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The APP applied to a unified account system will synchronize your registration, log in, and use some personal information of our products and/or services."}
{"task": "rw_11.jsonl", "id": 40785, "text": "(2) Your basic information and information, including nicknames, avatars, birthdays, gender, location;", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40786, "text": "(3) Your personal Internet records, including browsing/search/play/play/release/interactive records;", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40787, "text": "(4) Trading records, order records, etc.;", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40788, "text": "(5) Equity/asset information;", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40789, "text": "(6) User portrait.", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40790, "text": "The aforementioned information will be displayed in the associated app, and you can use relevant equity/assets in the associated app (as applicable).", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40791, "text": "Note:", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40792, "text": "(1) \"Unified Account System\" refers to the mobile phone number bound to your affiliate APP, create a unified string, realize the unified account login, and obtain relevant functions;", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40793, "text": "(2) The \"related app\" of the unified account system includes iQiyi, iQiyi Speed Edition, iQiyi Cosmetic, iQiyi Babu, QixiuThe products of iQiyi's products and related companies of iQiyi, iQiyi sports, iQiyi knowledge, TV fruit and other related products;", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40794, "text": "(3) Specific linked display information is subject to the actual synchronization between the associated apps.", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40795, "text": "3. Third -party SDK service provider:", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40796, "text": "In order to ensure the stable operation and functional implementation of our client, so that you can use and enjoy more services and functions. Our application will embed the software tool development package (SDK) or other similar applications of business partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In our application, we will embed the software tool development package (SDK) or other similar applications of business partners."}
{"task": "rw_11.jsonl", "id": 40797, "text": "We will strictly monitor the SDK and application interface (API) of business partners to obtain information, so that we will handle personal information in accordance with this policy and any other related confidentiality and security measures to ensure data security.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will strictly monitor the information of business partners to obtain information, so that we will handle personal information in accordance with this policy and any other related confidentiality and security measures."}
{"task": "rw_11.jsonl", "id": 40798, "text": "Check the iQiyi \"Information Sharing List\", the high -speed version of \"Information Sharing List\", and the \"embedded SDK\" in the \"Information Sharing List\" further.", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40799, "text": "(2) Transfer", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40800, "text": "Transfer refers to the process of transferring personal information control to other companies, organizations or individuals.", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40801, "text": "In principle, we will not transfer your personal information, except the following situations:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In principle, we will not transfer your personal information, except the following situations:"}
{"task": "rw_11.jsonl", "id": 40802, "text": "1. You make your own requirements and meet the relevant conditions of laws and regulations and regulatory regulations.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You make your own request and meet the relevant requirements of laws, regulations and regulatory regulations."}
{"task": "rw_11.jsonl", "id": 40803, "text": "2. If we need to transfer personal information for the reasons for merging, separation, dissolution, and declaration of bankruptcy, we will inform you that the name or name and contact information of the receiver will be informed of the receiver, and the receiver will continue to be constrained by this policy.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When involving mergers, acquisitions, or bankruptcy liquidation, if personal information transfer is involved, it will be required to continue to be bound by the policy, otherwise it will request that it will re -solicit authorization consent."}
{"task": "rw_11.jsonl", "id": 40804, "text": "If the receiver changes the original treatment purpose and method of processing, we will ask the receiver to re -obtain your consent.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40805, "text": "(3) Public disclosure", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40806, "text": "Except for public disclosure or obtaining an accident in accordance with the provisions of laws and regulations, we will not disclose public information that you have not disclosed or unreasonably disclosed.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Except for public disclosure or obtaining an accident in accordance with the provisions of laws and regulations, we will not disclose public information that you have not disclosed or unreasonably disclosed."}
{"task": "rw_11.jsonl", "id": 40807, "text": "And before we publicly disclose your personal information, we will conduct an impact assessment of personal information protection, and use security measures that meet the standards of the industry for treatment.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We publicly disclose your personal information protection assessment before we disclose your personal information, and use security measures that meet the standards of the industry for treatment."}
{"task": "rw_11.jsonl", "id": 40808, "text": "4. The control of your personal information", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40809, "text": "We attach great importance to your rights enjoyed as the subject of personal information, and do our best to protect your personal information control, and provide you with multiple ways to facilitate your more peace of mind and more convenient privacy settings and personal information management to ensure protectionYour personal information is safe.", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40810, "text": "Please understand that some services/functions need to handle your personal information to achieve it. Therefore, if you withdraw our consent/authorization of your information processing, it may affect your use of the corresponding service/function, but it does not affect your other services/Function.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40811, "text": "At the same time, you withdraw your consent/authorization, which will not affect the activity based on your consent/authorized personal information processing before withdrawal.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "You withdraw your consent/authorization will not affect your personal information processing activity based on your consent/authorized personal information processing before withdrawal."}
{"task": "rw_11.jsonl", "id": 40812, "text": "(1) Query, correct/modify, delete your personal information", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40813, "text": "You can query and manage your personal information through a variety of paths in our products (please note that the path may be different in different APPs, and the actual path of the APP shall prevail):", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40814, "text": "1. Manage the relevant information of personal accounts (including basic information (such as: avatar, nickname, gender, signature, account UID, etc.), account number binding mobile phone number, account login device, binding third -party account number, etc.).", "label": ["Important", "Edit/Control"], "rewrite": "Manage personal account -related information: Inquire about the relevant information in the iQiyi APP \"My - Settings -Account and Security\", and correct/modify and delete some information."}
{"task": "rw_11.jsonl", "id": 40815, "text": "For example: Inquire about information in the iQiyi APP \"My - Settings -Account and Security\", and correct/modify and delete some information.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40816, "text": "2. Management of relevant information (including your dynamics, your movie viewing records, praise/follow/reservation/collection records, messages, points, orders, etc.).", "label": ["Important", "Edit/Control"], "rewrite": "Management of records related information: Inquire in the iQiyi APP \"My - Watch History/Collection and Appointment/Download\" and other information, and correct/modify and delete some information."}
{"task": "rw_11.jsonl", "id": 40817, "text": "For example: Inquire about information such as \"My - Watch History/Collection and Appointment/Download\" in the iQiyi APP, and more corrected/modified and deleted some information.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40818, "text": "3., unified personal information management entrance, you can directly conduct account information, watch history, publish content, interactive records, orders, transaction records and other information in the entrance.", "label": ["Important", "Edit/Control"], "rewrite": "For unified personal information management entrances, you can directly conduct information and management of information such as account information, watching history, publishing content, interactive records, orders, transaction records and other information on this entrance."}
{"task": "rw_11.jsonl", "id": 40819, "text": "For example: Inquiry, correction/modification, and deletion in the iQiyi APP's \"Settings -Privacy Center -Personal Information Management -Personal Information Inquiry/Personal Information Delete\".", "label": ["Important", "Edit/Control"], "rewrite": "Inquiring, corrected/modified, and deleted in the iQiyi APP's \"My - Settings -Privacy Center -Personal Information Management  Personal Information Inquiry/Personal Information Delete\"."}
{"task": "rw_11.jsonl", "id": 40820, "text": "4. When you find that our personal information is wrong, you have the right to submit your correction/modification application through feedback, error reporting and other channels we published, and ask us to make corrections/modifications.", "label": ["Edit/Control", "Important"], "rewrite": "You have the right to submit your correction/modification application to us through the feedback, error reporting, etc., and ask us to make corrections/modifications."}
{"task": "rw_11.jsonl", "id": 40821, "text": "But for the consideration of security and identification, you may not be able to modify some initial registration information submitted during registration.", "label": ["Important", "Edit/Control"], "rewrite": "For the consideration of security and identity, you may not be able to modify some initial registration information submitted during registration."}
{"task": "rw_11.jsonl", "id": 40822, "text": "5. In the following circumstances, you can directly make a request to delete your personal information, but except for the anonymous processing of data or other provisions of laws and regulations:", "label": ["Important", "Edit/Control"], "rewrite": "You can directly make a request to delete your personal information, but except for the anonymous processing of data or other provisions of laws and regulations."}
{"task": "rw_11.jsonl", "id": 40823, "text": "(1) The purpose of the treatment has been achieved, unable to achieve or to achieve the purpose of the treatment;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40824, "text": "(2) We stop providing products and/or services, or the storage period has expired;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40825, "text": "(3) You withdraw consent;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40826, "text": "(4) We violate laws, administrative regulations or deal with your personal information.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40827, "text": "You understand and agree: When you delete information from our products and/or services, we may not immediately delete the corresponding information from the backup system, but this information will be deleted when the backup is updated.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Delete the information you require delete in the backup update."}
{"task": "rw_11.jsonl", "id": 40828, "text": "(2) Copy for personal information", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40829, "text": "You can obtain your personal information copy through the following ways, but the laws and regulations have other provisions and other provisions of this policy:", "label": ["Important", "Edit/Control"], "rewrite": "You can obtain your personal information copy, but the laws and regulations have other provisions and other plans."}
{"task": "rw_11.jsonl", "id": 40830, "text": "1. Online acquisition.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40831, "text": "For example: Apply for download in the iQiyi APP \"My - Settings -Privacy Center -Personal Information Management -Personal Information Copy Download\".", "label": ["Important", "Edit/Control"], "rewrite": "Apply for downloading personal information copy in the iQiyi APP \"My - Settings -Privacy Center -Personal Information Management -Personal Information Relational Download\"."}
{"task": "rw_11.jsonl", "id": 40832, "text": "Please note that in different APPs, the path may be different, and the actual path is subject to the actual path.", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40833, "text": "2. Contact us through the method provided by this policy. After verifying your identity, we will provide you with a copy of your personal information in our service.", "label": ["Edit/Control", "Data Security", "Important"], "rewrite": "After verifying your identity, we will provide you with a copy of your personal information in our service."}
{"task": "rw_11.jsonl", "id": 40834, "text": "(3) Withdrawal consent", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40835, "text": "You can change or withdraw the scope of your personal information through the following ways (please note that in different APPs, the path may be different.", "label": ["Important", "Edit/Control"], "rewrite": "You can change or withdraw the scope of your personal information."}
{"task": "rw_11.jsonl", "id": 40836, "text": "1. System permissions settings: We provide system permissions settings in the product.", "label": ["Important", "Edit/Control"], "rewrite": "We provide system permissions settings in the product."}
{"task": "rw_11.jsonl", "id": 40837, "text": "For example: Manage the system permission authorization of our product in the iQiyi APP \"My  Settings -Privacy Center -Permanent Settings\" (including location, address book, camera, album/storage, microphone, calendar, etc.).", "label": ["Edit/Control", "Important"], "rewrite": "Manage the system permission authorization of our products in the iQiyi APP \"My  Settings -Privacy Center -Permanent Settings\"."}
{"task": "rw_11.jsonl", "id": 40838, "text": "2. Recommended management: You can choose your favorite viewing content and adjust your preferences.", "label": ["Edit/Control", "Important"], "rewrite": "You can choose your favorite viewing content and adjust your preferences."}
{"task": "rw_11.jsonl", "id": 40839, "text": "For example: Setting in the iQiyi App \"Settings -Privacy Center -Content Recommendation Management\" is allowed to allow us to recommend it according to your personal preferences that are more suitable for you and adjust your personalized tags.", "label": ["Edit/Control", "Important"], "rewrite": "Setting in the iQiyi APP \"Settings -Privacy Center -Content Recommendation Management\" is allowed to allow us to recommend it according to your personal preferences that are more suitable for you and adjust your personalized labels."}
{"task": "rw_11.jsonl", "id": 40840, "text": "3. Advertising management: You can independently decide to receive programmatic/personalized advertising.", "label": ["Edit/Control", "Important"], "rewrite": "You can independently decide to receive programmatic/personalized ads."}
{"task": "rw_11.jsonl", "id": 40841, "text": "For example: In the iQiyi APP \"My - Settings -Privacy Center -Advertising Management\", we explain the principle of advertising recommendation to you and let you choose whether to receive programmatic/personalized advertising.", "label": ["Edit/Control", "Important"], "rewrite": "In the iQiyi APP \"My - Settings -Privacy Center -Advertising Management\", you can freely choose whether to receive programmatic/personalized advertisements."}
{"task": "rw_11.jsonl", "id": 40842, "text": "If you turn off and receive, the advertisement you see in our products may not decrease, but the correlation with you will be reduced.", "label": ["Important", "Edit/Control"], "rewrite": "If you close the receiving programmatic/personalized advertising, the number of ads you see may not decrease, but the correlation with you will be reduced."}
{"task": "rw_11.jsonl", "id": 40843, "text": "At the same time, you can also click the \"X\" next to the advertisement to feedback your opinions, and we will adjust the strategy based on your feedback.", "label": ["Important", "Edit/Control"], "rewrite": "You can click \"X\" next to the advertisement to feedback your opinion."}
{"task": "rw_11.jsonl", "id": 40844, "text": "4. Except for the explanation of this policy, other settings are specifically provided by the actual product.", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40845, "text": "(4) Logging out the account", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40846, "text": "You can cancel your iQiyi account in the following ways (please note that the path may be different in different APPs, the specific path is subject to the actual path):", "label": ["Important", "Edit/Control"], "rewrite": "You can log out your iQiyi account."}
{"task": "rw_11.jsonl", "id": 40847, "text": "(1) Logging online.", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40848, "text": "For example: submit a cancellation application in the iQiyi APP \"My - Help Feedback -Account Logout\".", "label": ["Important", "Edit/Control"], "rewrite": "Submit a cancellation application in the iQiyi APP \"My - Help Feedback -Account Logging out\"."}
{"task": "rw_11.jsonl", "id": 40849, "text": "(2) Contact our customer service to cancel the account.", "label": ["Important", "Edit/Control"], "rewrite": "Contact our customer service for account cancellation."}
{"task": "rw_11.jsonl", "id": 40850, "text": "(3) Other ways we announce.", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40851, "text": "After you cancel the iQiyi account, the content, information, data, records, etc. under the account will be deleted or anonymous (but except that the laws and regulations have other regulations or the regulatory authorities have other requirements);", "label": ["Important", "Edit/Control"], "rewrite": "After the account is canceled, the content, information, data, records, etc. under the account will be deleted or anonymous."}
{"task": "rw_11.jsonl", "id": 40852, "text": "At the same time, once the iQiyi account is canceled, it will not be recovered.", "label": ["Important", "Edit/Control"], "rewrite": "Once the iQiyi account is canceled, it will not be recovered."}
{"task": "rw_11.jsonl", "id": 40853, "text": "For more information about the cancellation of iQiyi account, please refer to the \"iQiyi account cancellation agreement\".", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40854, "text": "(5) Knowing in advance products and/or services stop operation", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40855, "text": "We will continue to provide you with high -quality services. If our part or all products and/or services are forced to stop operations for special reasons, we will send push messages to you in advance After the collection of your personal information, at the same time, after the necessary and short period of time stipulated in the laws and regulations, we will delete or anonymous processing of your personal information.", "label": ["Important", "Cessation of Operations"], "rewrite": "When stopping operations, we will notify in advance to stop collecting information and delete or processes your personal information."}
{"task": "rw_11.jsonl", "id": 40856, "text": "(6) Automatic decision -making of constraint information system", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40857, "text": "In certain business functions, we may make decisions only based on the non -artificial automatic decision -making mechanism, including information systems, algorithms, etc.", "label": ["Important", "Usage"], "rewrite": "In certain business functions, we may only make decisions based on non -artificial automatic decision -making mechanisms."}
{"task": "rw_11.jsonl", "id": 40858, "text": "If these decisions significantly affect your legitimate rights and interests, you can contact us through the contact information provided by the end of the text.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40859, "text": "(7) Help and feedback", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40860, "text": "We provide you with a variety of feedback channels. For details, please see the \"How to contact us\" in Chapter 9 of this policy.", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40861, "text": "5. How do we store and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40862, "text": "(1) Storage of personal information", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40863, "text": "1. Storage location: The personal information we collected and generated in the operation of the People's Republic of China is stored in the territory of the People's Republic of China.", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in domestic operations will be stored in China."}
{"task": "rw_11.jsonl", "id": 40864, "text": "After the following situations, and after meeting the relevant provisions of the laws and regulations and the regulatory authorities, we may provide your personal information to the overseas entities, and strictly require the receiver to handle your personal information in accordance with the requirements of relevant laws and regulations and this policy.: (1) The laws and regulations have clearly stipulated;", "label": ["Data Retention", "Important", "Risk"], "rewrite": "After the following situations, and after meeting the relevant provisions of the laws and regulations and the regulatory authorities, we may provide your personal information to the overseas entities: (1) the laws and regulations have clearly stipulated;) The products and/or services you use involve cross -border, and you actively provide personal information to overseas."}
{"task": "rw_11.jsonl", "id": 40865, "text": "(2) Obtain your alone consent;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40866, "text": "(3) The product and/or service you use involve cross -border, and you actively provide personal information to overseas.", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40867, "text": "2. Storage period: We must retain your personal information during the purpose of providing our products and/or services for the purpose of providing our products and/or services, for example: when you use our registration/login function, we need to collect yourThe mobile phone number, while you are provided and during your function, we need to continue to retain your mobile phone number for you to provide you with the function, ensure your account number and system security.", "label": ["Data Retention", "Important"], "rewrite": "Generally, your personal information is retained within the time limit required to achieve service purposes, unless the law has other requirements."}
{"task": "rw_11.jsonl", "id": 40868, "text": "After you actively delete your personal information, cancel your account, or exceed the necessary storage period, we will delete or processes your personal information, except for the lawThe saving time of service information and transaction information is not less than three years from the date of the transaction).", "label": ["Data Retention", "Important"], "rewrite": "After you actively delete your personal information, cancel your account, or go beyond the necessary storage period, we will delete or processes your personal information, except for other provisions of laws and regulations."}
{"task": "rw_11.jsonl", "id": 40869, "text": "We judge the necessary storage period for personal information mainly based on the following standards: (1) Maintain corresponding transactions and business records to cope with your possible query or complaints;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40870, "text": "(2) Make sure we provide you with service safety and quality;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40871, "text": "(3) Do you agree to a longer retention period.", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40872, "text": "(2) Protection measures for personal information", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40873, "text": "We have always attached great importance to protecting users' personal information security. To this end, we have adopted protection measures such as security technology, organizational and management of industry standards to maximize the leak, damage, misuse, non -authorized access, non -authorized access, non -authorized access, non -authorized access, non -authorized access, non -authorized access, non -authorized access to the greatest extent.The risk of authorization and changes.", "label": ["Important", "Data Security"], "rewrite": "We have adopted protective measures such as industry standards and organizations and management to protect your information security."}
{"task": "rw_11.jsonl", "id": 40874, "text": "include:", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40875, "text": "(1) In the use of a variety of security technical measures to control data collection, transmission, storage, processing, destruction, auditing and other links.", "label": ["Important", "Data Security"], "rewrite": "A variety of security technical measures are used to control the collection, transmission, storage, processing, destruction, and audit of data."}
{"task": "rw_11.jsonl", "id": 40876, "text": "(2) Establish measures for personal information security protection organizations, and implement measures such as personal information security specifications, information security promotion and training.", "label": ["Important", "Data Security"], "rewrite": "Establish personal information security protection organizations, and implement measures such as personal information security specifications, information security promotion and training."}
{"task": "rw_11.jsonl", "id": 40877, "text": "(3) Construct and improve the personal information security management system including security system certification, business security ability certification and network security level protection certification.", "label": ["Important", "Data Security"], "rewrite": "Construct and improve the personal information security management system including security system certification, business security certification and network security level protection certification."}
{"task": "rw_11.jsonl", "id": 40878, "text": "(4) Establish a safety emergency response system and emergency treatment mechanism for safety incidents, and complete safety incident treatment in time and efficiently.", "label": ["Important", "Data Security"], "rewrite": "Establish a safety emergency response system and safety incident emergency treatment mechanism, and complete the safety event treatment in a timely and efficient."}
{"task": "rw_11.jsonl", "id": 40879, "text": "Specifically for our personal information security measures, please check the user's personal information protection measures.", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40880, "text": "Please know and understand that the Internet is not an absolutely safe environment. We strongly recommend that you use security methods, complex passwords, regularly modify passwords, do not disclose your account password and related personal information to others to help us guarantee yourAccount is safe.", "label": ["Important", "Data Security"], "rewrite": "Please use complex passwords to help us guarantee your account security."}
{"task": "rw_11.jsonl", "id": 40881, "text": "If you find your personal information disclosure, especially your account or password leak, please contact us according to the contact information provided by the privacy policy at the end of this privacy policy so that we can take corresponding measures to protect your information security.", "label": ["Important", "Data Security"], "rewrite": "If your personal information is leaked, please contact our customer service immediately."}
{"task": "rw_11.jsonl", "id": 40882, "text": "6. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40883, "text": "The iQiyi Group has always paid great attention to the protection of minors and is committed to practicing our corporate social responsibility.", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40884, "text": "If you are a minor, you should first obtain the consent of his guardian (including this policy), and use and submit personal information after the guardian's consent and guidance.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a minor, you should first obtain the consent of his guardian, and use and submit personal information after the guardian's consent and guidance."}
{"task": "rw_11.jsonl", "id": 40885, "text": "If you are under children under the age of 14, before you use our service, please notify your guardian to read our \"Iqiyi Children's Personal Information Protection Rules\" and pleaseUse our products and/or services under the guidance.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are under the age of 14, please use our products and/or services under the guidance of the guardian under the guidance of the guardian."}
{"task": "rw_11.jsonl", "id": 40886, "text": "For the consent of the guardian's agreed to use our products and/or services, we will only collect, use, share, share, transfer, or publicly disclose when the laws and regulations are allowed, the guardian's clear consent or protecting minors.", "label": ["Specific Audiences", "Important"], "rewrite": "For the consent of the guardian's agreed to use our products and/or services, we will only collect, use, share, share, transfer, or publicly disclose when the laws and regulations are allowed, the guardian's clear consent or protecting minors."}
{"task": "rw_11.jsonl", "id": 40887, "text": "For more about the processing and protection of children's personal information, please refer to the \"Iqiyi Children's Personal Information Protection Rules\".", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40888, "text": "7. Update of this policy", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40889, "text": "We encourage you to consider our \"Iqiyi Privacy Policy\" carefully before using our products or services.", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40890, "text": "In order to provide you with better services, we will update the terms of this policy according to the update of the product and the relevant requirements of laws and regulations, which constitutes part of the cost of the policy.", "label": ["Policy Change", "Important"], "rewrite": "We will update the terms of this policy according to the update of the product and the relevant requirements of laws and regulations, which constitutes part of the policy policy."}
{"task": "rw_11.jsonl", "id": 40891, "text": "We will remind you of the updated content in the station or other appropriate ways so that you can understand the latest version of this policy in a timely manner.", "label": ["Policy Change", "Important"], "rewrite": "We will remind you of the updated content so that you can understand the latest version of this policy in time."}
{"task": "rw_11.jsonl", "id": 40892, "text": "If the update involves major changes, we will notify you in an appropriate manner before this policy takes effect (such as in -site letters, website publicity, etc.) so that you can understand the latest version of this privacy policy in time.", "label": ["Policy Change", "Important"], "rewrite": "If the update involves major changes, we will notify you through appropriate ways before this policy takes effect."}
{"task": "rw_11.jsonl", "id": 40893, "text": "Without your clear consent, we will not reduce or infringe your personal rights and interests you enjoy in accordance with this policy.", "label": ["Policy Change", "Important"], "rewrite": "Without your clear consent, we will not reduce or infringe your personal rights and interests you enjoy in accordance with this policy."}
{"task": "rw_11.jsonl", "id": 40894, "text": "8. How to contact us", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40895, "text": "If you have any complaints, suggestions, and questions about the implementation of this policy or our privacy protection related matters, you can contact us through the following ways. We will reply to you within 15 working days after verifying your user identity:", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40896, "text": "1. Special email channel: In order to better protect your rights, we set up privacy@qiyi.com mailboxes, you can contact us through this mailbox;", "label": ["Important", "Contact Information"], "rewrite": "Special email channel: privacy@qiyi.com."}
{"task": "rw_11.jsonl", "id": 40897, "text": "2. Personal information protection specialist: you can send emails to privacy@qiyi.com or write to the following address to contact them: 2nd floor of iQiyi Innovation Building, No. 365 Linhong Road, Shanghai MayorInformation protection commissioner (receipt);", "label": ["Important", "Contact Information"], "rewrite": "Personal Information Protection Specialist: You can send emails to privacy@qiyi.com or write to the following address to contact them: Personal Information Protection Specialist (receipt)Essence"}
{"task": "rw_11.jsonl", "id": 40898, "text": "Postal code: 200335;", "label": ["Important", "Contact Information"], "rewrite": "Postal code: 200335;"}
{"task": "rw_11.jsonl", "id": 40899, "text": "3. Online customer service/other online opinion feedback channels: You can contact the online customer service on the product function page on our platform or submit feedback on online submission;", "label": ["Important", "Contact Information"], "rewrite": "You can contact the online customer service or submit feedback on online."}
{"task": "rw_11.jsonl", "id": 40900, "text": "4. Artificial customer service channel: You can call any of our customer service calls to us.", "label": ["Important", "Contact Information"], "rewrite": "You can call any of our customer service calls to us."}
{"task": "rw_11.jsonl", "id": 40901, "text": "Nine, others", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40902, "text": "(1) The interpretation and dispute resolution of this policy shall apply laws of the People's Republic of China.", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40903, "text": "If any controversy has occurred on the signing and performance of this policy, the two parties should try to resolve it as friendly as much as possible;", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40904, "text": "When negotiation is not successful, either party can filed a lawsuit to the people's court with jurisdictions in the residence of the defendant.", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40905, "text": "(2) The title of this policy is only for convenience and reading, and does not affect the meaning or explanation of any terms of this agreement.", "label": [], "rewrite": []}
{"task": "rw_11.jsonl", "id": 40906, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
