{"task": "rw_112.jsonl", "id": 73477, "text": "Youku Games Privacy Protection Guidelines", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73478, "text": "Update date: April 2, 2022", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73479, "text": "Effective date: April 2, 2022", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73480, "text": "You are welcome to choose Youku game provided by Youku Shengshi Technology (Beijing) Co., Ltd. (hereinafter referred to as \"We\")!", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73481, "text": "In addition to the \"Youku Privacy Policy\", we will also further refine the situation of \"Youku Game Privacy Protection Guide\" (\"Big Guideline\").And the relevant rights and other matters you enjoy, this guidance is part of the \"Youku Game License and Service Agreement\". The main points are as follows:", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73482, "text": "We know the importance of personal information to you and do our best to protect your personal information security.", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73483, "text": "We specially formulate this policy so that you can understand how we collect, store, protect, use, and share your personal information, and how you can manage your personal information so that you can make better choices.", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73484, "text": "Before you start using our product or/and service, please be sure to read and understand this policy carefully. In particular, you should focus on reading the terms of our bold/down line logo to ensure that you fully understand and consent.Services.", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73485, "text": "You know and agree: You clicks to agree with this policy, or if you use or continue to use our services, you say you agree to accept the constraints of this policy.", "label": ["Policy Change", "Important"], "rewrite": "You clicks to agree with this policy, or if you use or continue to use your service, all indicate that you authorize this policy."}
{"task": "rw_112.jsonl", "id": 73486, "text": "Unless you have read and accepted all the contents of this policy, you have no right to use the service of Youku's prosperity.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73487, "text": "If you have any questions about this \"Privacy Policy\" and its related matters, please contact us, and we will answer you as soon as possible.", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73488, "text": "If you are a minor under the age of 18 (especially children under 14 years of age or those who are not a complete civil behavior), you need to read this policy accompanied by your guardian, and obtain your guardian to this policyAfter the consent of all clauses, use the service of Youku Shengshi.", "label": ["Policy Change", "Specific Audiences", "Important"], "rewrite": "If you are a minor, please use our services after your parents or other guardians read this policy carefully."}
{"task": "rw_112.jsonl", "id": 73489, "text": "1. How do we collect and use your information", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73490, "text": "In the process of using Youku Shengshi application services, we need/may collect and use your following personal information to provide you and optimize our services.", "label": ["Important", "First Party Collection Information"], "rewrite": "We need/may collect and use your personal information to provide and optimize services."}
{"task": "rw_112.jsonl", "id": 73491, "text": "If we want to use your personal information for other purposes that are not stated in this policy, or use the information collected for other purposes based on specific purposes, we will inform you in a reasonable way, and before useGet your consent", "label": ["Important", "Usage"], "rewrite": "If your personal information is used in other purposes outside of the policy that has not been stated or agreed in advance, we will inform you and ask your consent again."}
{"task": "rw_112.jsonl", "id": 73492, "text": "We collect and use your personal information mainly include the following two: the following:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73493, "text": "1. In order to provide you with the information necessary to provide you with the core business functions of our products and/or services: this kind of information is a necessary information for the normal operation of the product and/or the service, you must authorize us to collect it.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73494, "text": "If you refuse to provide, you will not be able to use our products and/or services normally;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73495, "text": "2. In order to provide you with additional business functions to our products and/or services that may need to be collected: You can choose whether to authorize us to collect this type of information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73496, "text": "If you refuse to provide it, you will not be able to use related additional functions normally or cannot achieve the functional effects we intend to achieve, but it does not affect your normal use of core business functions.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73497, "text": "1.1 Help you complete registration and login", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73498, "text": "In order to facilitate us to provide you with continuous and stable services and ensure your security of Youku service, we need you to provide basic registration or login information, including account nicknames and passwords, user avatars, mobile phone numbers, e -mail.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect your basic registration or login information to provide services."}
{"task": "rw_112.jsonl", "id": 73499, "text": "The above information is a must -have information for your registered and logging in Youku user account or using the core business of Youku Shengshi service. If you choose not, you may not be able to use our service.", "label": ["Important", "First Party Collection Information"], "rewrite": "Basic registration or login information is necessary to use basic services."}
{"task": "rw_112.jsonl", "id": 73500, "text": "If you use WeChat, QQ, and (or) accounts on a third -party platform as a game account associated to log in to the cool age, in order to provide you with a better game service and improve the game experience, we will obtain the third -party account based on your authorizationThe relevant information (including third -party accounts, user names, nicknames, avatars, and other information you authorize, shall prevail with a third -party account authorization page).", "label": ["Important", "First Party Collection Information"], "rewrite": "When registering and logging in with a third -party account, visit and collect your personal information after your authorization."}
{"task": "rw_112.jsonl", "id": 73501, "text": "If you refuse to authorize such information, you will not be able to log in to our game services with an account on a third -party platform, but it will not affect the normal use of other products and services we provide.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to authorize the relevant information under the third -party account, you cannot use the account to log in to the game, but it does not affect the use of other products or services."}
{"task": "rw_112.jsonl", "id": 73502, "text": "1.2 Implement identity authentication", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73503, "text": "In order to meet the requirements of laws, regulations, policies and relevant competent authorities, you need to register real -name registration to use the service of Youku Shengshi. We will collect your personal identity information (including names, including names, including name, including your consent or actively provided by your active provision.ID number), biometric information (static or dynamic facial features) to complete identity authentication;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We will collect personal identity information and biometric information provided by you to complete identity certification."}
{"task": "rw_112.jsonl", "id": 73504, "text": "If you use a third -party account to associate with the cool world service, after you have authorized, we may obtain your above information from the third party, and collect the above information to complete identity certification.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If you log in with a third -party account, we have authorized to collect your personal identity information and biometric information from a third party to complete the identity authentication."}
{"task": "rw_112.jsonl", "id": 73505, "text": "Collecting the above information is used to complete the real -name authentication. The real -name identity information you provided is compared with the authoritative data platform data source.", "label": ["Important", "Usage"], "rewrite": "Collect your personal identity information and biometric information to complete real -name authentication."}
{"task": "rw_112.jsonl", "id": 73506, "text": "If you do not provide the above information, it may cause you to be unable to log in to Youku's prosperous age, or be subject to corresponding restrictions during the use of Youku's prosperity.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you do not provide personal identity information and biometric information, you may lead to restrictions on your use."}
{"task": "rw_112.jsonl", "id": 73507, "text": "In order to meet the needs of user identity, guarantee system and service security, and other specific service functions (including account unbinding), we may need you to provide real identity information (including name, ID number), biometric information (static or dynamic or dynamic information (static or dynamic or dynamicFacial features) to complete identity authentication.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may need you to provide real identity information and biometric information to complete your identity authentication."}
{"task": "rw_112.jsonl", "id": 73508, "text": "If you do not provide the above information, we will not be able to provide you with related functions and services.", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73509, "text": "In order to achieve the purpose of identity certification, you agree and authorize us to provide, query, and check your aforementioned identity information provided by the relevant identity authentication agencies (including personal credit reporting agencies, government departments and other agencies) in the third direction.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "You agree and authorize us to provide, inquire, and check your identity information on our own identity certification agencies in the third direction."}
{"task": "rw_112.jsonl", "id": 73510, "text": "Please note that your personal identity information and biometric information are personal sensitive information. Please provide it with caution. If you refuse to provide you, you will not be able to obtain related services, but it will not affect the normal use of other functions and services.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide personal identity information and biometric information, it will not be able to obtain related services, but it does not affect the use of other functions."}
{"task": "rw_112.jsonl", "id": 73511, "text": "1.3 Normal operation, optimization and improvement of our services or providing you with security guarantees", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73512, "text": "1.3.1 In order to maintain the normal and stable operation of the basic functions of the game, we need to obtain the permissions of the external storage of the read/write to the device, and obtain the above permissions and information for the installation storage and reading game archives and files of the game products in the device (Including the necessary game processes and cache, writing/download/save/modify pictures, documents, files, collapse log information and other necessary information).", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "We need to obtain the permissions of the external storage of reading/writing the device for installing storage and reading game archives and files."}
{"task": "rw_112.jsonl", "id": 73513, "text": "If you refuse to provide the aforementioned permissions, it may cause you to be unable to use our related products and/or services.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you refuse to provide the permissions of the external storage of reading/writing the device, it may cause related products or services to be inaccurate."}
{"task": "rw_112.jsonl", "id": 73514, "text": "1.3.2 In order to verify the account information, ensure your account security and advertising data monitoring and verification, it also creates a fair, healthy and safe game environment to combat the behavior of destroying the fair environment or interference of the game, and the normal conduct of game services. WeWill collect your gaming application information, equipment information (only device recognition symbols, equipment serial numbers, equipment manufacturers, equipment names, equipment types and versions, equipment models, equipment styles, equipment MAC addresses), network identity information (IP address IP address), Hardware and operating system information, application lists, process information, network environment information and game crash records.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We will collect your game application information, device information, network identity information, hardware and operating system information, application lists, process information, network environment information and game crash records to ensure the normal operation of the game."}
{"task": "rw_112.jsonl", "id": 73515, "text": "We may use your IP address recognition device to connect to the location of the Internet to achieve the content of specific activities.", "label": ["Important", "Usage"], "rewrite": "We may use your IP address recognition device to connect to the location of the Internet."}
{"task": "rw_112.jsonl", "id": 73516, "text": "1.3.3 When you use Youku Shengshi Service, we will collect your game log information, including login logs, items logs, shop purchase logs, activities logs, guild logs, upgrade logs, chat logs, game pairs information, games, games, gamesDating records and other log information generated during the process of using Youku Shengshi.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use Youku Shengshi service, we will collect your game log information."}
{"task": "rw_112.jsonl", "id": 73517, "text": "We collect the above information for game operation statistical analysis, customer complaint processing, game anti -cheating analysis, and other game experience optimization analysis. At the same time, it is convenient for you to view your game history records on the game client;", "label": ["Important", "Usage"], "rewrite": "We collect game log information for game operation statistical analysis, customer complaint processing, game anti -cheating analysis and other game experience optimization analysis."}
{"task": "rw_112.jsonl", "id": 73518, "text": "If you refuse to provide the aforementioned information, it may cause you to be unable to use our related products and/or services.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide game log information, it may cause related products and/or services to be inaccurate."}
{"task": "rw_112.jsonl", "id": 73519, "text": "1.3.4 When you use the consumption function in the game, we will collect your transaction information, including recharge records, consumption records and other necessary information related to transaction. We collect the aforementionThe degree guarantees the safety of your virtual items. When the transaction is controversial, it provides customer service personnel with information to support disputes.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the consumption function in the game, we will collect your transaction information to query transaction records, ensure the safety of virtual items, and support disputes."}
{"task": "rw_112.jsonl", "id": 73520, "text": "The recharge records and consumption records are personal sensitive information. Collecting the above information is necessary to achieve the consumption function of Youku Shengshi, otherwise the transaction will not be completed.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting recharge records and consumption records is necessary for consumption functions to achieve the service of Youku Shengshi."}
{"task": "rw_112.jsonl", "id": 73521, "text": "1.4 Provide you with customer service or other user response services", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73522, "text": "When you contact our customer service or use other users to respond to functional services (such as selling after -sale after sale, personal information protection complaints or suggestions, other customer complaints and needs), we may need you to provide the necessary personal information to match and verify youUser identity to ensure your account and system security.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "When you contact our customer service, we may need you to provide the necessary personal information to verify the identity."}
{"task": "rw_112.jsonl", "id": 73523, "text": "In order to facilitate contact with you or help you solve problems or send gifts, we may also need you to provide your name, mobile phone number, email and other contact information and personal information.", "label": ["Important", "Usage"], "rewrite": "We need to collect your name, mobile phone number, email and other contact information and personal information for contacting or sending gifts."}
{"task": "rw_112.jsonl", "id": 73524, "text": "We may also save your contact information, your communication information (including text, pictures, audio and video, call records) and other necessary information associated with your needs. The aforementioned information is personal sensitive information.The information is to help you solve the problem. If you refuse to provide the above information, we may not be able to feedback or effectively solve the problem in time.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may also save your contact information, your communication information and other necessary information to help you solve the problem."}
{"task": "rw_112.jsonl", "id": 73525, "text": "In order to provide reasonable needs of services and improve service quality, other information we may also use, including the relevant information you provided when you contact the customer service, the questionnaire answering information you sent to us during the questionnaire survey.", "label": ["Important", "Usage"], "rewrite": "We may use the information that you contact with customer service or fill in the questionnaire to improve service quality."}
{"task": "rw_112.jsonl", "id": 73526, "text": "1.5 Provide information display or push", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73527, "text": "We may share your information from the partners and other third parties to achieve the function of Youku Shengshi, so that you use the services you need, including providing data services (including online advertising monitoring, data statistics, data analysis) cooperationPartners, or third -party sharing of third parties such as partners who entrust us to promote, the purpose is to make these third parties understand the coverage and effectiveness of the promotion.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We may share your information from a partner and other third parties to provide the services you need normally."}
{"task": "rw_112.jsonl", "id": 73528, "text": "For example, we may inform how many people in the third party have seen their promotional information or purchased the commodity of the client after seeing the information, or provide them with statistical information that cannot recognize personal identity to help them understand their audience or customers.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We may inform third parties their promotion or provide them with logging statistical information to help them understand their audience."}
{"task": "rw_112.jsonl", "id": 73529, "text": "1.6 cookie and similar technologies", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73530, "text": "In order to provide you with a more personalized service experience and improve our services, we or our third -party partners may collect and use your information through cookies and similar technologies, and store these information as log information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We or our third -party partners may collect and use your information through Cookie and similar technologies, and save this as a log message."}
{"task": "rw_112.jsonl", "id": 73531, "text": "By using Cookie and similar technologies, we provide you with a more convenient, fast and personal service experience.", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73532, "text": "The above use may be used for: remember your identity, analyze your service situation, and advertise optimization.", "label": ["Important", "Usage"], "rewrite": "Use cookie technology to remember your identity, analyze your usage, and advertise optimization."}
{"task": "rw_112.jsonl", "id": 73533, "text": "While we use cookies and similar technologies for the above purposes, we may be provided to advertisers and other partners collected through cookie and similar technologies to analyze how users use Youku Shengshi services and send you to you mayInterested advertisements, or the effects of advertising services.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "We may provide non -personal identity information collected through cookies and similar technologies to advertisers and other partners to analyze service use, understand advertising preferences, and evaluate advertising effects."}
{"task": "rw_112.jsonl", "id": 73534, "text": "These third -party cookies and similar technologies are collected and used by such information that are not bound by this policy, but are subject to their own information protection statements. We are not responsible for third -party Cookie and similar technologies.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "The collection and use information of third -party cookies and similar technologies are not subject to this policy, and we do not take responsibility for this."}
{"task": "rw_112.jsonl", "id": 73535, "text": "1.7 Exception of your authorization consent", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73536, "text": "According to relevant laws and regulations, collecting your information in the following situations does not need to obtain your authorization consent:", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "According to relevant laws and regulations, collecting your information in the following situations does not need to obtain your authorization consent:"}
{"task": "rw_112.jsonl", "id": 73537, "text": "(1) Directly related to national security and national defense security;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "(1) Directly related to national security and national defense security;"}
{"task": "rw_112.jsonl", "id": 73538, "text": "(2) Directly related to public safety, public health, and major public interests;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "(2) Directly related to public safety, public health, and major public interests;"}
{"task": "rw_112.jsonl", "id": 73539, "text": "(3) Directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "(3) Directly related to criminal investigation, prosecution, trial, and judgment execution;"}
{"task": "rw_112.jsonl", "id": 73540, "text": "(4) Out of maintaining major legitimate rights and interests of your or other individuals, but it is difficult to get my consent;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "(4) Out of maintaining major legitimate rights and interests of your or other individuals, but it is difficult to get my consent;"}
{"task": "rw_112.jsonl", "id": 73541, "text": "(5) The personal information collected is made by your own public;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "(5) The personal information collected is made by your own public;"}
{"task": "rw_112.jsonl", "id": 73542, "text": "(6) Signing and fulfilling the contract according to your requirements;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "(6) Signing and fulfilling the contract according to your requirements;"}
{"task": "rw_112.jsonl", "id": 73543, "text": "(7) Collect personal information from the information disclosed by legal publicly, such as legal news reports, government information disclosure and other channels; and other channels;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "(7) Collect personal information from the information disclosed by legal publicly, such as legal news reports, government information disclosure and other channels; and other channels;"}
{"task": "rw_112.jsonl", "id": 73544, "text": "(8) Maintaining the safe and stable operation of Youku services, including but not limited to the failure of discovering and disposing of products or services;", "label": ["Important", "First Party Collection Information", "Usage", "Risk"], "rewrite": "(8) Maintaining the safe and stable operation of Youku services, including but not limited to the failure of discovering and disposing of products or services;"}
{"task": "rw_112.jsonl", "id": 73545, "text": "(9) It is necessary to carry out legal news reports;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "(9) It is necessary to carry out legal news reports;"}
{"task": "rw_112.jsonl", "id": 73546, "text": "(10) When the statistical or academic research institute is needed for public interests, and provides academic research or description results, the information contained in the result is identified by", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "(10) When the statistical or academic research institute is needed for public interests, and provides academic research or description results, the information contained in the result is identified by"}
{"task": "rw_112.jsonl", "id": 73547, "text": "(11) Other circumstances stipulated in laws and regulations.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "(11) Other circumstances stipulated in laws and regulations."}
{"task": "rw_112.jsonl", "id": 73548, "text": "2. How do we share, transfer, and disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73549, "text": "2.1 How do we share your information", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73550, "text": "We attach importance to the protection of your personal information. Under normal circumstances, except for the following situations, without your consent, we will not share your personal information with any third party other than the prosperous age of Youku:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We attach importance to the protection of your personal information. Under normal circumstances, except for the following situations, without your consent, we will not share your personal information with any third party other than the prosperous age of Youku:"}
{"task": "rw_112.jsonl", "id": 73551, "text": "(1) In response to your legal needs or your authorization consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "(1) In response to your legal needs or your authorization consent;"}
{"task": "rw_112.jsonl", "id": 73552, "text": "(2) Provide your information in accordance with the legitimate requirements of your guardian;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "(2) Provide your information in accordance with the legitimate requirements of your guardian;"}
{"task": "rw_112.jsonl", "id": 73553, "text": "(3) To share your personal information in accordance with the applicable laws and regulations, legal procedures, government forced orders, judicial rulings, government supervision requirements, and social public interests;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "(3) To share your personal information in accordance with the applicable laws and regulations, legal procedures, government forced orders, judicial rulings, government supervision requirements, and social public interests;"}
{"task": "rw_112.jsonl", "id": 73554, "text": "(4) In the scope of legal requirements or permits, it is necessary to provide your personal information to the third party in order to protect the interests of Youku's prosperous users or social public or security.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "(4) In the scope of legal requirements or permits, it is necessary to provide your personal information to the third party in order to protect the interests of Youku's prosperous users or social public or security."}
{"task": "rw_112.jsonl", "id": 73555, "text": "(5) Your personal information may be shared between our affiliated companies.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "(5) Your personal information may be shared between our affiliated companies."}
{"task": "rw_112.jsonl", "id": 73556, "text": "We will only share the necessary personal information, and this sharing is also restricted by the purpose of this policy.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only share the necessary personal information, and this sharing is also restricted by the purpose of this policy."}
{"task": "rw_112.jsonl", "id": 73557, "text": "If related companies want to change the purpose, scope, and method of personal information processing, it will solicit your authorization consent again;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If related companies want to change the purpose, scope, and method of personal information processing, it will once again solicit your authorization consent."}
{"task": "rw_112.jsonl", "id": 73558, "text": "(6) In order to provide you with more complete and high -quality products and services, some of our services will be provided by third -party partners.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73559, "text": "We may share some of your personal information with your partners to provide better customer service and user experience.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share your personal information with your partners to provide better services."}
{"task": "rw_112.jsonl", "id": 73560, "text": "We will only share your personal information for legal, correct, necessary, specific, and clear purposes, and only share the personal information necessary for providing services.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73561, "text": "Our partners collect and handle information such as information such as their own privacy clauses or related statements, and do not apply for this policy terms.", "label": ["Important"], "rewrite": "Our partners collect and handle information such as information such as their own privacy clauses or related statements, and do not apply for this policy terms."}
{"task": "rw_112.jsonl", "id": 73562, "text": "In order to ensure your information security to the greatest extent, we recommend that you check its privacy clauses before using third -party services.", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73563, "text": "In order to protect your legitimate rights and interests, if you find a risk of related third -party services, it is recommended that you immediately terminate the relevant operations and contact us in time.", "label": ["Important"], "rewrite": "If you find a risk of third -party services, it is recommended that you stop related operations and contact us immediately."}
{"task": "rw_112.jsonl", "id": 73564, "text": "The current situation of the third -party partners we access is as follows:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The current situation of the third -party partners we access is as follows:"}
{"task": "rw_112.jsonl", "id": 73565, "text": "Third -party service name partner name acquisition permissions/information use partner website", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73566, "text": "QQ login/sharing, Shenzhen Tencent Computer System Co., Ltd., access to network, storage permissions, equipment information (device MAC address, device unique identification code, location information, application list).User information/data type: device (logo) information, user third -party account related information.Login/sharing, http://privacy.qq.com/", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "QQ login/sharing obtain access to network, storage permissions, and equipment information for login/sharing functions."}
{"task": "rw_112.jsonl", "id": 73567, "text": "WeChat login/sharing/payment, Shenzhen Tencent Computer System Co., Ltd., access to network, storage permissions, equipment information (equipment unique identification code), payment information, transaction information.User information/data type: device (logo) information, user third -party account related information.Login/share/payment, http://privacy.qq.com/", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "WeChat login/sharing/payment obtain access to network, storage permissions, equipment information (device unique identification codes), payment information, transaction information, for login/sharing/payment function."}
{"task": "rw_112.jsonl", "id": 73568, "text": "Alipay Payment, Zhejiang Ant Xiaowei Financial Services Group Co., Ltd., visiting networking and equipment information (equipment identification code).User information/data type: Device (logo) information, payment information: data about your billing address and payment method, including bank details, credit cards, debit cards or other payment card information.Pay, https://render.alipay.com/p/c/k2cx0tg8", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Alipay pays the access to the Internet, equipment information (device recognition code), and payment information for payment functions."}
{"task": "rw_112.jsonl", "id": 73569, "text": "Xintong Institute OAID, SDK, Mobile Security Alliance, access to network, equipment information (equipment identification code), and obtain the current network environment.User information/data type: device information (including network status, call status, OAID).Get device logo, http://msa- alliance.cn/col.jsp? ID = 120", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "The OAID SDK of the Xintong Institute obtains access to the Internet, device information (device recognition code), and obtains the current network environment for obtaining equipment logo."}
{"task": "rw_112.jsonl", "id": 73570, "text": "Lezu heat update, Shanghai Zhuoliang Information Technology Co., Ltd., visiting the Internet, obtaining the current network environment, storage authority, and equipment information.User information/data type: device identification information, hot update http://www.loveota.com/register/privacy.html", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Lexi heat update obtain access to the Internet, obtain the current network environment, storage authority, and equipment information for thermal update function."}
{"task": "rw_112.jsonl", "id": 73571, "text": "Tencent Bugly, Shenzhen Tencent Computer System Co., Ltd., visiting the Internet and obtaining the current network environment and equipment information (the unique identification code of the equipment).User information/data type: log information, device ID, system name, system version, networking information, IMSI, MAC address, collecting and statistical APP abnormal conditions, https: //privacy.qq.com/documew/fbd2c3f899925dddddd49d57827", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Tencent Bugly obtains access to the Internet, obtains the current network environment, equipment information, log information, logo information, equipment ID, system name, system version, network information, IMSI, MAC address, to collect and statistical APP abnormal conditions."}
{"task": "rw_112.jsonl", "id": 73572, "text": "Huge engine, Beijing huge amount engine network technology Co., Ltd., access to the Internet and obtain the current network environment.User information/data type: device (logo) information (device MAC address, device IMEI number), advertising statistics, https://www.ocenengine.com/extra/legal", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "The huge engine obtains access to the Internet, obtains the current network environment, equipment (logo) information, and is used for advertising statistics."}
{"task": "rw_112.jsonl", "id": 73573, "text": "UC, GISM, SDK, Guangzhou Dynamic Computer Technology Co., Ltd., visiting the Internet and obtaining the current network environment.User information/data type: device (logo) information (device MAC address, device IMEI number), advertising statistics, https://e.uc.cn/sso/statics/policy/hcprivacy.html", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "UC GISM SDK obtains access to the Internet and obtains the current network environment and equipment (logo) information for advertising statistics."}
{"task": "rw_112.jsonl", "id": 73574, "text": "Baidu, OAID, SDK, Beijing Baidu Net News Technology Co., Ltd., visiting the Internet and obtaining the current network environment.User information/data type: Device (logo) information (device MAC address, device IMEI number), advertising statistics, https: //yingxiao.baidu.com/home/help/details? From = yingxiaserch & id = 57444444444444444444444444444444444", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Baidu OAID SDK obtains access to the Internet and obtains the current network environment for advertising statistics."}
{"task": "rw_112.jsonl", "id": 73575, "text": "Xiaomi channel SDK, Xiaomi Technology Co., Ltd., visiting the Internet and obtaining the current network environment.User information/data type: Device identification information, identification channel users, https://privacy.mi.com/xiaomigame-sdk/zh_cn/", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Xiaomi channel SDK needs to obtain equipment identification information to identify channel users."}
{"task": "rw_112.jsonl", "id": 73576, "text": "Baidu channel SDK, Baidu Online Network Technology (Beijing) Co., Ltd., access to the Internet and obtain the current network environment.User information/data type: Device identification information, identification channel users, http://privacy.baidu.com/detail? ID = 288", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Baidu channel SDK obtains access to the Internet, obtains the current network environment, and equipment identification information for identification channel users."}
{"task": "rw_112.jsonl", "id": 73577, "text": "OPPO channel SDK, OPPO Guangdong Mobile Communications Co., Ltd., access to the Internet and obtain the current network environment.User information/data type: Device identification information, identification channel users, https://dsfs.oppo.com/store/cn/app/files/privacy_android.html", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "OPPO channel SDK obtains access to the Internet, obtains the current network environment, and equipment identification information for identification channel users."}
{"task": "rw_112.jsonl", "id": 73578, "text": "Huawei HMS, SDK, Huawei Software Technology Co., Ltd., visiting the Internet and obtaining the current network environment.User information/data type: Device identification information, identification channel user, statistics, https://consumer.huawei.com/cn/privacy/privacy-policy/", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Huawei HMS SDK obtains access to the Internet, obtains the current network environment, and equipment identification information for identification and statistical channel users."}
{"task": "rw_112.jsonl", "id": 73579, "text": "Vivo channel SDK, Vivo Mobile Communication Co., Ltd., visiting the Internet and obtaining the current network environment.User information/data type: Device identification information, identification channel users, https://www.vivo.com.cn/about-divo/privacy-policy", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "The vivo channel SDK obtains access to the Internet, obtains the current network environment, and equipment identification information for identification channel users."}
{"task": "rw_112.jsonl", "id": 73580, "text": "Application Bao channel SDK, Shenzhen Tencent Computer Technology Co., Ltd., access to the Internet and obtain the current network environment.User information/data type: Device identification information, identification channel users, https://privacy.qq.com/", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Applying the Bao channel SDK to obtain access to the Internet, obtain the current network environment, and equipment logo information for identifying users."}
{"task": "rw_112.jsonl", "id": 73581, "text": "Samsung channel SDK, Samsung (China) Investment Co., Ltd., visiting the Internet and obtaining the current network environment.User information/data type: device identification information, identification channel users, https://www.samsung.com/cn/info/privacy/", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Samsung channel SDK obtains access to the Internet, obtains the current network environment, and equipment identification information for identification channel users."}
{"task": "rw_112.jsonl", "id": 73582, "text": "2.2 How do we transfer your information", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73583, "text": "We will not transfer your personal information to any company, organization and individual, except the following situations: except:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not transfer your personal information to any company, organization and individual, except the following situations: except:"}
{"task": "rw_112.jsonl", "id": 73584, "text": "(1) Transfer when obtaining your clear consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "(1) Transfer when obtaining your clear consent;"}
{"task": "rw_112.jsonl", "id": 73585, "text": "After getting your clear consent, we will transfer your personal information to other parties;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73586, "text": "(2) Provide by the requirements of the applicable laws and regulations, legal procedures, mandatory administrative or judicial requirements;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "(2) Provide by the requirements of the applicable laws and regulations, legal procedures, mandatory administrative or judicial requirements;"}
{"task": "rw_112.jsonl", "id": 73587, "text": "(3) With the continuous development of our business, we may conduct merger, acquisition, asset transfer or similar transactions, and your information may be transferred as part of such transactions.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "(3) If mergers, acquisitions, asset transfer or similar transactions, your information may be transferred as part of such transactions."}
{"task": "rw_112.jsonl", "id": 73588, "text": "We will ask for new companies and organizations holding your personal information to continue to be subject to this policy, otherwise we will ask the company and the subject to reconcile your authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The new controller may continue to be subject to the constraints of this policy or re -obtain your authorization consent."}
{"task": "rw_112.jsonl", "id": 73589, "text": "2.3 How do we disclose your information", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73590, "text": "We will disclose your personal information in the following circumstances:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will disclose your personal information in the following circumstances:"}
{"task": "rw_112.jsonl", "id": 73591, "text": "(1) After getting your clear consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "(1) After getting your clear consent;"}
{"task": "rw_112.jsonl", "id": 73592, "text": "(2) We may disclose your personal information when legal, legal procedures, litigation, or government authorities are required.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "(2) We may disclose your personal information when legal, legal procedures, litigation, or government authorities are required."}
{"task": "rw_112.jsonl", "id": 73593, "text": "2.4 Sharing, transfer and disclosure of no authorization", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73594, "text": "According to relevant laws and regulations and national standards, in the following circumstances, we may share, transfer, and publicly disclose personal information without obtaining your authorization consent in advance:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "According to relevant laws and regulations and national standards, in the following circumstances, we may share, transfer, and publicly disclose personal information without obtaining your authorization consent in advance:"}
{"task": "rw_112.jsonl", "id": 73595, "text": "(1) What is related to the obligations stipulated in the performance of our laws and regulations;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "(1) What is related to the obligations stipulated in the performance of our laws and regulations;"}
{"task": "rw_112.jsonl", "id": 73596, "text": "(2) Related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "(2) Related to national security and national defense security;"}
{"task": "rw_112.jsonl", "id": 73597, "text": "(3) It is related to public safety, public health, and major public interests;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "(3) It is related to public safety, public health, and major public interests;"}
{"task": "rw_112.jsonl", "id": 73598, "text": "(4) Related to crime investigation, prosecution, trial, and judgment execution;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "(4) Related to crime investigation, prosecution, trial, and judgment execution;"}
{"task": "rw_112.jsonl", "id": 73599, "text": "(5) For major legitimate rights and interests such as the main body of personal information or other individuals, but it is difficult to get my consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "(5) For major legitimate rights and interests such as the main body of personal information or other individuals, but it is difficult to get my consent;"}
{"task": "rw_112.jsonl", "id": 73600, "text": "(6) The subject of personal information disclose personal information to the public by itself;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "(6) The subject of personal information disclose personal information to the public by itself;"}
{"task": "rw_112.jsonl", "id": 73601, "text": "(7) Collect personal information from legal disclosure information, such as legal news reports and government information disclosure.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "(7) Collect personal information from legal disclosure information, such as legal news reports and government information disclosure."}
{"task": "rw_112.jsonl", "id": 73602, "text": "Please know that according to applicable laws, take technical measures and other necessary measures for personal information, so that the data receiver cannot re -identify specific individuals and cannot recover.You notify and obtain your consent.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Data that shared, transferred, and disclosed unpredictable specific individuals and cannot be restored does not need to notify you separately and obtain your consent."}
{"task": "rw_112.jsonl", "id": 73603, "text": "3. How do we store and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73604, "text": "3.1 Information storage", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73605, "text": "3.1.1 We will store your personal information collected in the territory of the People's Republic of China in China.", "label": ["Data Retention", "Important"], "rewrite": "Personal information collected in China is stored in China."}
{"task": "rw_112.jsonl", "id": 73606, "text": "We will not transmit your personal information cross -border cross -border.", "label": ["Data Retention", "Important"], "rewrite": "We will not transmit your personal information cross -border cross -border."}
{"task": "rw_112.jsonl", "id": 73607, "text": "3.1.2 We will retain your personal information within the time limit for you to provide you with the necessary product and service purposes.", "label": ["Data Retention", "Important"], "rewrite": "Save personal information within the necessary period of service purposes."}
{"task": "rw_112.jsonl", "id": 73608, "text": "We may preserve the necessary periods stipulated by your relevant information (for example, the E -Commerce Law of the People's Republic of China stipulates that the preservation time of goods and service information and transaction information is not less than three years from the date of the transaction).", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73609, "text": "3.1.3 After exceeding the storage period, we will delete or processes your personal information.", "label": ["Data Retention", "Important"], "rewrite": "We will delete or processes personal information beyond the storage period."}
{"task": "rw_112.jsonl", "id": 73610, "text": "3.2 Information protection", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73611, "text": "We strive to provide security guarantee for your information to prevent information leakage, loss, improper use, unauthorized access and disclosure.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73612, "text": "We use multi -directional security measures to ensure that the user's personal information is at a reasonable level of security.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73613, "text": "Please understand that due to the technical restrictions and the limitations of risk prevention, even if we have tried to strengthen security measures, we cannot always ensure that the information is 100 % security.", "label": ["Important", "Data Security"], "rewrite": "Although there are security measures, it is impossible to fully guarantee that there is no security problem."}
{"task": "rw_112.jsonl", "id": 73614, "text": "I hope you can understand that your access and/or the system and communication network used in our products or services may have problems due to the situation outside of our controlled scope.", "label": ["Important", "Data Security"], "rewrite": "Systems and communication networks may have problems due to unprepared factors."}
{"task": "rw_112.jsonl", "id": 73615, "text": "3.3 User account use and storage", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73616, "text": "(1) In order to ensure the security of user accounts, Youku Shengshi has the right to review whether the identity information provided by the user registration is true and effective, and it will take reasonable measures such as technical and management to ensure the security of the user account;", "label": ["Important", "Data Security"], "rewrite": "Youku Shengshi has the right to verify the identity information of the user, and take reasonable measures such as technology and management to ensure the security of user accounts."}
{"task": "rw_112.jsonl", "id": 73617, "text": "The user is obliged to keep its account and password properly, and use its account and password correctly and safely.", "label": ["Important", "Data Security"], "rewrite": "The user is obliged to keep the account and password properly and use it correctly and safely."}
{"task": "rw_112.jsonl", "id": 73618, "text": "If any party does not do its best to cause damage to the civil rights of users or others, it shall bear legal responsibility if it is lost and stolen to the civil rights of users or others.", "label": ["Important"], "rewrite": "If Youku's prosperity or user fails to lead to damage to the civil rights and interests of the user or others, it shall bear legal responsibility for the civil rights of the user or others."}
{"task": "rw_112.jsonl", "id": 73619, "text": "(2) The user has rights and responsibility for the behavior of the account he held in accordance with the law.", "label": ["Important", "Edit/Control"], "rewrite": "Users have their rights and responsibility for the behavior of the accounts they hold in accordance with the law."}
{"task": "rw_112.jsonl", "id": 73620, "text": "(3) If the user finds that its account or password is illegally used by others or has abnormalities, it should be notified according to the contact information published by Youku Shengshi in a timely manner.Consider taking measures to suspend or stop login and use the account.", "label": ["Important", "Data Security"], "rewrite": "If the account or password is leaked, please contact Youku's prosperity immediately. You Cool Shengshi considers the suspension of the login and use of the account according to the situation."}
{"task": "rw_112.jsonl", "id": 73621, "text": "(4) If Youku Shengshi suspends the login and use of the user account according to the user's notice, Youku Shengshi shall ask users to provide and verify the personal effective identity information of the individual consistent with their registered identity information.", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "Youku Shengshi is required to perform identity verification according to the user's notification to suspend the login and use of the user account."}
{"task": "rw_112.jsonl", "id": 73622, "text": "(5) If Youku Shengshi verify the personal valid identity information provided by the user consistent with the registered identity information, Youku Shengshi should take measures to suspend the login and use of the user account;", "label": ["Important", "Data Security"], "rewrite": "If Youku Shengshi verify the passage of identity information, Youku Shengshi should take measures to suspend the login and use of the user account."}
{"task": "rw_112.jsonl", "id": 73623, "text": "If the information is not consistent, Youku Shengshi has the right to refuse the user's request.", "label": ["Important", "Data Security"], "rewrite": "If the information is not consistent, Youku Shengshi has the right to reject users to suspend the request of login and use of user accounts."}
{"task": "rw_112.jsonl", "id": 73624, "text": "4. How to manage your personal information", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73625, "text": "We understand your attention to personal information and make every effort to ensure that your personal information inquiry, correction, supplement, delete, and withdraw your consent in order to fully protect your personal information and privacy security.", "label": ["Important", "Edit/Control"], "rewrite": "We make every effort to ensure your right to query, correct, supplement, delete, and withdraw consent of your personal information."}
{"task": "rw_112.jsonl", "id": 73626, "text": "Your rights include:", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73627, "text": "4.1 Query, correct, supplement and delete.", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73628, "text": "You can query, correct, supplement, and delete your account information and other personal information in the process of using our services. If you encounter any problems in this process or you may not be currently provided with online query/correction/supplement/supplementation/Delete the service situation, you can contact us through the method provided by this policy.", "label": ["Important", "Edit/Control"], "rewrite": "You can query, correct, supplement, and delete your account information and other personal information, and contact us when you encounter difficulties."}
{"task": "rw_112.jsonl", "id": 73629, "text": "The scope and way you exercise the above rights will depend on the specific service you use.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73630, "text": "When you query, correct, supplement, or delete relevant information, we may verify your identity to ensure accounts and information security.", "label": ["Edit/Control", "Data Security", "Important"], "rewrite": "When you query, correct, supplement, or delete relevant information, we may verify your identity."}
{"task": "rw_112.jsonl", "id": 73631, "text": "After verifying your identity and correcting/modifying the objectivity and accuracy of the information, we can make corrections or modifications of errors or incomplete information, except for laws and regulations.", "label": ["Important", "Edit/Control"], "rewrite": "We can make corrections or modifications on errors or incomplete information, except for other provisions of laws and regulations."}
{"task": "rw_112.jsonl", "id": 73632, "text": "But for consideration of security and identification, you cannot modify the real -name registration information (including name and ID number) submitted when registering.", "label": ["Important", "Edit/Control"], "rewrite": "You cannot modify the real -name registration information you submitted when you register."}
{"task": "rw_112.jsonl", "id": 73633, "text": "4.2 Public and sharing.", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73634, "text": "You may share the relevant information of your service (including but not limited to the nickname) during the use of our service period. This kind of information can be modified by your own access and modify it according to the rules of this policy.Personal information sharing to an open information area.", "label": ["Third Party Sharing/ Disclosure", "Important", "Edit/Control"], "rewrite": "The information you share can be modified through your own access and modify it according to this policy rules, but please share it carefully to the public information area."}
{"task": "rw_112.jsonl", "id": 73635, "text": "As a result of your information, we are not responsible.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You shared the information to the information leak caused by the information area, and we are not responsible."}
{"task": "rw_112.jsonl", "id": 73636, "text": "4.3 Change/withdrawal consent.", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73637, "text": "You can choose whether your information is disclosed, and you can change your authorization of information or withdraw your authorization by deleting information, closing the device function or other ways.", "label": ["Important", "Edit/Control"], "rewrite": "You can decide whether the information is disclosed, or you can change or withdraw authorization by deleting information, closing the device function or other methods."}
{"task": "rw_112.jsonl", "id": 73638, "text": "If you encounter any problems in this process, you can contact us through the method provided by this policy.", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73639, "text": "4.4 Logging out the account.", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73640, "text": "We will provide you with the corresponding situation of the game product to provide you with a corresponding cancellation account operation settings, or you can contact us to apply for a cancellation of your account through the method provided by this policy or the official website announced by Youku Shengshi.", "label": ["Important", "Edit/Control"], "rewrite": "You can apply for a cancellation of your account by canceling the account operation settings or contact us."}
{"task": "rw_112.jsonl", "id": 73641, "text": "After your account is canceled, you will no longer log in to and use the product and/or service of using Youku Shengshi;", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73642, "text": "And this account will be cleared during the use of the rights and interests that has been generated during the use of Youku Shengshi service but not consumed and the expected interests in the future;", "label": ["Important", "Edit/Control"], "rewrite": "After the account of the account is canceled, all rights such as the account that have generated but not consumed and the future expected interests will be cleared."}
{"task": "rw_112.jsonl", "id": 73643, "text": "The content, information, data, records, etc. under this account will be deleted or anonymous (but the laws and regulations have other provisions or other requirements, such as the \"Cyber Security Law of the People's Republic of China\", youThe network operation log will be kept at least six months).", "label": ["Important", "Edit/Control"], "rewrite": "After the account is canceled, the personal information under the game account will be deleted or anonymous."}
{"task": "rw_112.jsonl", "id": 73644, "text": "If you log in quickly through a third -party account, you will need to contact the third party to deal with the cancellation account.", "label": ["Important", "Edit/Control"], "rewrite": "If you log in quickly through a third -party account, you will need to contact the third party to deal with the cancellation account."}
{"task": "rw_112.jsonl", "id": 73645, "text": "Please understand that after the cancellation of the user account is completed, it will not be able to recover.", "label": ["Important", "Edit/Control"], "rewrite": "Once the cancellation is completed, it will not be restored."}
{"task": "rw_112.jsonl", "id": 73646, "text": "5. The information we may send to you", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73647, "text": "5.1 Information push.", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73648, "text": "When you use our service, we may send emails, text messages, information or push notifications to your device.", "label": ["Important", "Usage"], "rewrite": "We may send you email, text message, information, or push notification."}
{"task": "rw_112.jsonl", "id": 73649, "text": "If you don't want to receive this information, you can choose to cancel the subscription on the device according to our relevant prompts, or ask us to stop using your personal information for the above use.", "label": ["Edit/Control", "Important"], "rewrite": "You can choose to cancel the subscription on the device, or ask us to stop using your personal information for push."}
{"task": "rw_112.jsonl", "id": 73650, "text": "5.2 Announcement related to service.", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73651, "text": "We may issue an announcement related to the service -related announcement when necessary (for example, when the system maintenance is suspended due to system maintenance).", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73652, "text": "You may not be able to cancel these announcements related to services and nature.", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73653, "text": "6. Special description of channel scenes", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73654, "text": "We may provide our services through third -party Android or iOS systems or other application distribution platforms (hereinafter collectively referred to as \"channel parties\").", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73655, "text": "If you download, install, and use our services through the channel party, the channel party will provide you with an account creation and management, payment functional service in your own name, and provide real -name authentication.", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73656, "text": "6.1, when you download, install, and use our services through the channel party, the channel party will collect your device information in other ways by accessing the SDK in our service or other information in our service. Please pay attention toApply for the authorization of your device authority and apply for a special prompt to collect your personal information based on the needs of the channel party.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When you download, install, and use our services through the channel party, the channel party will collect your device information or the information you use in our service."}
{"task": "rw_112.jsonl", "id": 73657, "text": "6.2, when you are recording and using our services through the channel party, these channels will share your personal information with us so that you can use our service through the channel party account, usually including your account information, payment information, IP IPaddress.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you are recording and using our services through the channel, the channel party will share your personal information with us."}
{"task": "rw_112.jsonl", "id": 73658, "text": "The information collected from these channels may be different from your privacy settings in such channels, and is subject to the privacy policy and service terms of these channels. Therefore, please use a third -party account.Read the special prompts of the relevant login interface when logging in to our service.", "label": ["Important", "First Party Collection Information"], "rewrite": "The information we collected from the channel may be different from your privacy settings in the channel side."}
{"task": "rw_112.jsonl", "id": 73659, "text": "6.3 If you record our service through the channel and you ask for cancellation your account, you need to apply for a cancellation account or cancel the license to log in to our account.", "label": ["Important", "Edit/Control"], "rewrite": "If you have recorded our service through the channel and you ask for cancellation your account, you need to apply to the channel party to cancel the account or cancel the license to log in to our account."}
{"task": "rw_112.jsonl", "id": 73660, "text": "Logging out on the account means that we will terminate services to you through this channel party account, and once the account is canceled, it will not be recovered. Please back up all the relevant information and data before the operation.", "label": ["Important", "Edit/Control"], "rewrite": "Please back up all the relevant information and data before canceling the account."}
{"task": "rw_112.jsonl", "id": 73661, "text": "7. Scope of application of this policy", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73662, "text": "7.1 Except for certain specific services, all services in Youku Shengshi are applicable to this policy.", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73663, "text": "These specific services will apply specific personal information protection statements.", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73664, "text": "The personal information protection statement of this specific service constitutes a part of the cost of composition.", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73665, "text": "If any personal information protection statement of any specific service is inconsistent with this policy, the personal information protection statement of specific services is applied.", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73666, "text": "7.2 Please note that this policy is only applicable to the collection, preservation, use, sharing, and disclosure information collected by Youku Shengshi, and it is not applicable to services provided by other companies or individuals.", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73667, "text": "For example: This policy is not applicable to the following situation:", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73668, "text": "(1) Information collected by a third -party service (including any third -party website and application) accessed through our services.", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73669, "text": "This policy is only applicable to the information we collected, and it is not applicable to the service provided by any third -party service or the information usage rules of the third party. We do not have any responsibility for these third -party collection and use of your personal information;", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73670, "text": "(2) Information collected by other companies or institutions that provide advertising services in our services.", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73671, "text": "Please know: If you provide your personal information to the third party when you browse a third -party website or using the third -party product and / or service, your information should apply the privacy statement or similar policy of the third party. You need to read carefully.Its policy content.", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73672, "text": "We do not have any legal responsibilities for any third party's improper use or disclosure of your personal information. Whether you log in or browse the above websites, software, or use your product and / or service based on our links or guidance.", "label": ["Important", "Risk"], "rewrite": "We do not have any legal responsibilities for any third party's improper use or disclosure of your personal information. Whether you log in or browse the above websites, software, or use your product and / or service based on our links or guidance."}
{"task": "rw_112.jsonl", "id": 73673, "text": "8. Update and visit of this policy", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73674, "text": "In order to provide you with better services, we may update the terms of this policy according to the service updates and the relevant requirements of laws and regulations, which constitute a part of the policy.", "label": ["Policy Change", "Important"], "rewrite": "We may update the terms of this policy in accordance with the service update of the service and the relevant requirements of laws and regulations."}
{"task": "rw_112.jsonl", "id": 73675, "text": "We will inform you the updated terms in an appropriate manner in this policy.", "label": ["Policy Change", "Important"], "rewrite": "We will inform you the updated terms in an appropriate manner in this policy."}
{"task": "rw_112.jsonl", "id": 73676, "text": "If you do not agree with such updates and changes, you can choose to stop using the service of Youku's prosperous age;", "label": ["Policy Change", "Important"], "rewrite": "If you do not agree with the update and change of policy terms, you can choose to stop using it."}
{"task": "rw_112.jsonl", "id": 73677, "text": "If you continue to use it, it means that you have fully read, understand and agree to be constrained by the updated terms.", "label": ["Policy Change", "Important", "Risk"], "rewrite": "Continue to use services is deemed to agree to accept the content of the privacy policy after the revision."}
{"task": "rw_112.jsonl", "id": 73678, "text": "Any of our modification will put your satisfaction first.", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73679, "text": "We encourage you to check our privacy policy every time you use Youku Shengshi.", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73680, "text": "9. Application with law", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73681, "text": "9.1 The signing of the \"Youku Shengshi Privacy Policy\" is the Chaoyang District of the People's Republic of China.", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73682, "text": "The establishment, performance, interpretation, and dispute resolution of this agreement are applicable to the law of the People's Republic of China and exclude the application of all other conflict laws.", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73683, "text": "If the two parties have any disputes on the content of this policy or the performance of the performance, they should be solved by friendly negotiation. When negotiation cannot be achieved, either party shall sue to the people's court with jurisdictions with jurisdictions.", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73684, "text": "9.2 The title of all the terms of this agreement is only convenient to read. There is no substantial meaning in itself, and it cannot be used as the basis for the explanation of the meaning of this agreement.", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73685, "text": "9.3 Regardless of what reason for this agreement, it does not affect the effectiveness of other terms.", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73686, "text": "10. How to contact us", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73687, "text": "10.1 If you have any questions, opinions or suggestions on this \"Privacy Policies for Youku Shengshi\" or when you encounter personal information protection related matters when using our service, you can contact us through Youku Shengshi official website.", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73688, "text": "@(Beijing) Co., Ltd. All rights reserved", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73689, "text": "Room A458, Building 14, Cuiwei Zhongli, Haidian District, Beijing", "label": ["Important", "Contact Information"], "rewrite": "Contact address: Room A458, Building 14, Cuiwei Zhongli, Haidian District, Beijing"}
{"task": "rw_112.jsonl", "id": 73690, "text": "Beijing ICP No. 14053202 Jingwangwen (2017) 9365-1071", "label": [], "rewrite": []}
{"task": "rw_112.jsonl", "id": 73691, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
