{"task": "rw_105.jsonl", "id": 72111, "text": "Guidance of King Camp Privacy Protection Protection", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72112, "text": "Update date: June 16, 2022", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72113, "text": "Effective date: June 23, 2022", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72114, "text": "overview", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72115, "text": "You are welcome to choose from Tencent (hereinafter referred to as \"we\".", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72116, "text": "Tencent in this guidelines specifically refers to Shenzhen Tencent Computer System Co., Ltd., a provider of \"King Camp\" and its services, and Shenzhen Tencent Tianyou Technology Co., Ltd.", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72117, "text": "Among them, Shenzhen Tencent Computer System Co., Ltd. is registered as the 35th floor of Tencent Building, Tencent Building, Magna Community Technology Central, Yuehai Street, Nanshan District, Shenzhen;", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72118, "text": "Shenzhen Tencent Tianyou Technology Co., Ltd. is registered for the \"Kings Camp\" (hereinafter referred to as \"Kings Camp\" or 523, Block 5, Haiwang Road, Haiwang Road, Xin'an Street, Baoan District, Shenzhen)\"This product\")!", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72119, "text": "In addition to the \"Tencent Privacy Policy\" and \"King's Camp Permit and Service Agreement\", we will also further refine it to you through the \"Guidelines for the Privacy Protection Protection of the King's Camp\" (\"This Guideline\"), Storage and sharing personal information, as well as related rights you enjoy.", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72120, "text": "This guideline is an integral part of the \"King's Camp Permit and Service Agreement\". In addition to the other instructions, the definition of the noun in this guideline has the same meaning as the \"King Camp License and Service Agreement\".", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72121, "text": "The main points of this guideline are as follows:", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72122, "text": "In order to provide you with information reading, friends chat, community interaction, record inquiry and other services, we need to collect information such as your equipment information, account information, related game product log information.", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72123, "text": "You can manage your personal information and related authorization according to this guideline.", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72124, "text": "We use multi -directional security measures to ensure that your personal information protection is at a reasonable level of security.", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72125, "text": "If you are under the age of 18, please read this agreement and other above agreements with the accompaniment of the legal guardian.", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72126, "text": "Products or services.", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72127, "text": "You can learn more detailed personal information processing rules through reading the full version of \"Guidelines for Privacy Protection of the King's Camp\" to understand the corresponding relationship between the type and use of personal information.", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72128, "text": "1. The information we collect and use", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72129, "text": "In the process of using this product service, we will collect the information that you actively provide or because of the service provided by the service as follows to provide you with your services and ensure your account security:", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72130, "text": "1.1, when you register or use this product service, we will collect your network identity identification information and personal common equipment information for users who are your products.", "label": ["Important", "First Party Collection Information"], "rewrite": "It will collect your network identity information and personal common equipment information for users who are your products."}
{"task": "rw_105.jsonl", "id": 72131, "text": "If you use WeChat, QQ and (or) other accounts (hereinafter referred to as \"third -party accounts\") as the king camp account associated to log in to this product, we will collect the unique logo and avatar of your WeChat, QQ and third -party accounts, Nickname, and friends or other information authorized by you to help you complete registration and login, and achieve a better social experience.", "label": ["Important", "First Party Collection Information"], "rewrite": "Will collect the unique logo, avatar, nickname, nickname, and friends or other information authorized by your WeChat, QQ and third -party accounts to complete registration and login."}
{"task": "rw_105.jsonl", "id": 72132, "text": "You can check and manage the above information authorization in WeChat, QQ or third -party platforms.", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72133, "text": "1.2, if you are used to log in to the WeChat, QQ and / or third -party accounts of this product, the related game \"Glory of the King\" (hereinafter referred to as \"related game\") of the product of this product has been affiliated to this product, we will retrieve the WeChat game of the affiliated game, QQ and (or) a third -party account number in the related game account (hereinafter referred to as the \"related game account\") log information, including game account nickname, login log, dating records, item logs, game -to -game information, record information, record information informationWaiting for information so that you or your friends or other users can view your game history records in related games in this product.", "label": ["Important", "First Party Collection Information"], "rewrite": "The log information of the corresponding game account (hereinafter referred to as the \"related game account\") will be obtained from the affiliated game in the related game account."}
{"task": "rw_105.jsonl", "id": 72134, "text": "We will use your privacy settings for this information in related games, and you can also set independent settings on how to show the above information through this product [Settings]-[Privacy Settings].", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72135, "text": "For the collection and use of your information, please refer to the privacy guidance or related instructions of related games.", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72136, "text": "1.3 In order to meet the requirements of relevant laws and regulations and relevant authorities, when you post, reply, recharge and other operations in this product, you need to perform real -name authentication to enjoy related services.", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72137, "text": "If you use WeChat, QQ or third -party accounts used by registering and logging in to this product, you have already opened a game account in related games, you know and agree to obtain your real -name certification results from related games;", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72138, "text": "If you have not used these accounts associated to log in to the related game, when you trigger the corresponding features, we will collect your real name information (including name, mobile phone number, ID number, photo, photo, photo, photo, photo card number, ID number, photo card numberFor information) For real -name authentication, you agree that Tencent can submit the real -name information you submitted to the national authority, financial institutions, payment institutions, and relevant organizations that have legally retained your information for verification.", "label": ["Important", "First Party Collection Information"], "rewrite": "You will collect your real -name information (including name, mobile phone number, ID number, photo, etc.) for real -name authentication when obtaining consent or active provision."}
{"task": "rw_105.jsonl", "id": 72139, "text": "1.4, in order to help you complete the social functions of the king's camp registration and use the king camp, we will collect your mobile phone number, nickname, avatar, gender, birthday information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Will collect your mobile phone number, nickname, avatar, gender, birthday information."}
{"task": "rw_105.jsonl", "id": 72140, "text": "Collecting and using mobile phone number information is to meet the requirements of social platform certification on social platforms to meet relevant laws and regulations. If you do not provide relevant information, you may not be able to use certain functions.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If you do not provide relevant information, you may not be able to use certain features."}
{"task": "rw_105.jsonl", "id": 72141, "text": "You can also choose information such as nicknames, avatars, gender, birthday and other information according to your own needs to use the social functions of the king camp.", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72142, "text": "1.5, in order to ensure your normal use of our services, maintain the normal operation of the basic functions of the product, optimize product performance, improve your experience and ensure your account security, we will collect your device ID, equipment name, equipment model, equipment, equipment, equipment, equipmentTypes and versions, system versions, IP addresses, device recognition symbols (such as: IMEI, IMSI, MAC address, Android, ID, device SN), ICCID, Application ID, network type and other information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Will collect device ID, device name, device model, equipment type and version, system version, IP address, device recognition symbols (such as: IMEI, IMSI, MAC address, Android ID, device SN), ICCID, application ID, network type, etc.information."}
{"task": "rw_105.jsonl", "id": 72143, "text": "In order to achieve your ability to jump other apps when using some functions, we will collect a list you have installed to determine whether the jump function between the apps can occur.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect lists you have installed to determine whether the jumping function between apps can occur."}
{"task": "rw_105.jsonl", "id": 72144, "text": "At the same time, in order to facilitate the operation of copying and paste, we will collect your clipboard information.", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to facilitate the operation of copying and paste, we will collect your clipboard information."}
{"task": "rw_105.jsonl", "id": 72145, "text": "1.6, when you use this product service, we will collect your log information, such as logging in logs, interactive records (publishing records, subscription records, browsing records, collection records, etc.), making dating records, etc.Other users can check your historical records in this product, and at the same time used for product operation statistical analysis, customer service complaint processing, and other product safety analysis.", "label": ["Important", "First Party Collection Information"], "rewrite": "Will collect your log information, such as logging in logs, interactive records (publishing records, subscription records, browsing records, collection records, etc.), and dating records."}
{"task": "rw_105.jsonl", "id": 72146, "text": "You can view the specific collection content and how to display the above information through this product [Settings]-[Privacy Settings].", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72147, "text": "1.7, in order to achieve the auxiliary positioning function, we will use your acceleration sensor, gravity sensor, rotating vector sensor, magnetic field sensor, gyroscope sensor to derive the forecasting point when the positioning is lost or request positioning, such as the function of the people nearbyCheck the scenes such as nearby players and the Honor List area;", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "The acceleration sensor, gravity sensor, rotating vector sensor, magnetic field sensor, and gyroscope sensor will be used to derive the forecast positioning point."}
{"task": "rw_105.jsonl", "id": 72148, "text": "In order to realize the interactive function of user actions, we will use your acceleration sensor, gravity sensor, rotating vector sensor, magnetic field sensor, gyroscope sensor to determine your operation and supply function to the next step, such as: Shaking and vertical screens and switching of videos in some activities;", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "We will use acceleration sensors, gravity sensors, rotating vector sensors, magnetic field sensors, gyroscopes sensors to determine your operation action."}
{"task": "rw_105.jsonl", "id": 72149, "text": "In order to prevent black production, identification and filtering black production virtual machines, we will use your distance sensor, light sensor, gyroscope sensor to determine whether the device is a real machine, such as: message push filtering, security strategy recognition and other scenarios;", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "We will use your distance sensor, light sensor, and gyroscope sensor to determine whether the device is a real machine."}
{"task": "rw_105.jsonl", "id": 72150, "text": "In order to avoid errors in the screen during use for a distance, we will use your distance sensor, light sensor, gyroscope sensor to judge your distance from the device to prevent errors, such as: voice call operation and other scenariosEssence", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "We will use your distance sensor, light sensor, and gyroscope sensor to determine your distance from the device and prevent errors."}
{"task": "rw_105.jsonl", "id": 72151, "text": "1.8 In order to bring you a better experience, the king's camp has a personalized recommendation service involving automated decision -making. We need to notify you the following items:", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72152, "text": "Automated decision -making refers to: procedures can automatically analyze and evaluate personal behavior habits and content service preferences by obtaining your specific personal information, so as to formulate personalized recommendation services for you.", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72153, "text": "When you use the information, communities and other functions of this product, in order to provide you with higher -quality, effective, and personalized services and content, we will use automated decision -making to achieve personalized recommendations.", "label": ["Important", "Usage"], "rewrite": "We will use automated decisions to achieve personalized recommendations."}
{"task": "rw_105.jsonl", "id": 72154, "text": "We will use your personal information such as the attention, browsing, collection, interaction, search records and other personal information in the camp to achieve automated decision -making.", "label": ["Important", "Usage"], "rewrite": "We will use your personal information such as the attention, browsing, collection, interaction, search records and other personal information in the camp to achieve automated decision -making."}
{"task": "rw_105.jsonl", "id": 72155, "text": "We will use your above information to evaluate your reading and browsing preferences. When you use the corresponding functions, use the preferences of program assessment to present you recommended content and services.", "label": ["Important", "Usage"], "rewrite": "We will use your above information to evaluate your reading, browsing preferences, and recommending content."}
{"task": "rw_105.jsonl", "id": 72156, "text": "When you turn on the service of automated decision -making, you can get better and more effective content and services when using information, communities and other functions.", "label": ["Important", "Usage"], "rewrite": "When the service of automated decision -making, you can get better and more effective content and services when using information, communities and other functions."}
{"task": "rw_105.jsonl", "id": 72157, "text": "You can close personalized content recommendation through this product [Settings]-[Privacy Settings].", "label": ["Edit/Control", "Usage", "Important"], "rewrite": "You can close personalized content recommendation through this product [Settings]-[Privacy Settings]."}
{"task": "rw_105.jsonl", "id": 72158, "text": "After closing, this product will no longer use your personal information for automated decision -making.", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72159, "text": "When you use modules such as communities, malls, etc., we will not present a personalized recommendation.", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72160, "text": "At the same time, the channels, heroes, teaching and other channels that use personalized recommendations as the core features in the information recommendation will also be closed, but it does not affect the homepage, official, short video, fellow, live broadcast, world, peripherals, columns and other functions of the king camp.Normal use.", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72161, "text": "1.9, in order to ensure the safe and stable operation of the product and achieve specific functions, some services in the king's camp are provided by our affiliated parties or other third parties.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Some services in the king's camp are provided by our affiliated parties or other third parties."}
{"task": "rw_105.jsonl", "id": 72162, "text": "We will choose third -party and third -party services, urge relevant third parties to collect and use your personal information in accordance with this guideline or the agreement reached with you, and take appropriate security technology and management measures to ensure your personal information security.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Will choose third -party and third -party services, urge relevant third parties to collect and use your personal information in accordance with guidelines or agreed, and take appropriate technical and management measures to ensure personal information security."}
{"task": "rw_105.jsonl", "id": 72163, "text": "For the specific situation of the third -party information sharing of this product, please refer to the \"Third -Party Information Sharing List\" (including \"Third -Party SDK Catalog\").", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For the specific situation of the third -party information sharing of this product, please refer to the \"Third -Party Information Sharing List\" (including \"Third -Party SDK Catalog\")."}
{"task": "rw_105.jsonl", "id": 72164, "text": "1.10 When you use this product on Android device, in order to achieve the real -time message push function, we access the mobile push TPNS SDK.", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72165, "text": "In order to enable you to receive the message sent by the camp contact at the first time and ensure the time and effectiveness of the push reminder, the SDK will be pulled up in the background when there is a new application message notification.Will not collect any personal information.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "The SDK will take the application process in the background when the SDK is notified in a regular basis, but this process will not collect any personal information of your personal information."}
{"task": "rw_105.jsonl", "id": 72166, "text": "1.11, when you use the mall service or payment function of this product, we will collect information such as your purchase records, recharge records, payment records, etc., so you can check your transaction records.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect information such as your purchase records, recharge records, payment records so that you can check your transaction records."}
{"task": "rw_105.jsonl", "id": 72167, "text": "Purchasing records, recharge records, and payment records are sensitive information. Collecting the above information is necessary for the mall and payment function of this product, otherwise the transaction will not be completed.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting sensitive information is necessary for the mall and payment function of this product, otherwise the transaction will not be completed."}
{"task": "rw_105.jsonl", "id": 72168, "text": "When you use the function of the peripheral mall of this product, we will collect information such as your recipient's name, mailing address, and contact mobile phone number, and collect the above information to ship the logistics of the product, otherwise the transaction will not be completed.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect information such as the recipient's name, mailing address, receipt contact mobile phone number, and collect the above information to ship the logistics of the product, otherwise the transaction will not be completed."}
{"task": "rw_105.jsonl", "id": 72169, "text": "1.12, when you interact with other players through text, pictures, voice, videos, and other methods in this product, we may apply for access to your album permissions, local storage permissions, camera permissions or microphones.", "label": ["Permission Acquisition", "Important"], "rewrite": "We may apply for access to your album authority, local storage permissions, camera permissions or microphones."}
{"task": "rw_105.jsonl", "id": 72170, "text": "If you refuse to authorize, it may cause the corresponding function to be unavailable normally, but it does not affect other functions of your product.", "label": ["Permission Acquisition", "Important", "Risk"], "rewrite": "If it is rejected, it may cause the corresponding function to be unavailable normally, but it does not affect your other functions."}
{"task": "rw_105.jsonl", "id": 72171, "text": "At the same time, we may collect and preserve the content of the above information you sent to filter the improper content such as pornography, violence, politics, abuse, malicious advertisements, etc., in order to purify the network environment and maintain a healthy Internet environment.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may collect and save the above information content you sent to filter improper content."}
{"task": "rw_105.jsonl", "id": 72172, "text": "1.13, if you want to interact with nearby product users or use other geographical location-based services, after you authorize and agree, we will collect your geographical location information (including your nearby Wi-Fi, nearby base stations, that is, Cellid, Cellid, Cellid), Used to find nearby users so that you can match with nearby users.", "label": ["Important", "First Party Collection Information"], "rewrite": "After authorizing consent, we will collect your geographical location information (including your nearby Wi-Fi, nearby base stations, that is, cellid) to find users nearby."}
{"task": "rw_105.jsonl", "id": 72173, "text": "Geographical location information is a sensitive information. Refusing to provide this information will only cause you to be unable to enjoy geographical location -based services, but it does not affect other functions of your normal use of this product. You can also cancel your geographical location information authorization at any time.", "label": ["Risk", "Edit/Control", "First Party Collection Information", "Important"], "rewrite": "Refusing to provide geographical location information can only cause you to be unable to enjoy geographical location -based services, but do not affect normal use of other functions. You can cancel geographical location information at any time."}
{"task": "rw_105.jsonl", "id": 72174, "text": "1.14, if you want to use the wireless screen of this product on the iOS device, the network delay of the \"More Tools\" page accurately display or other local network authority -based services, after you authorize the consent, we will collect your local areaNetwork permissions are used to find available screening equipment, accurately calculate network delay, etc.", "label": ["Permission Acquisition", "Important"], "rewrite": "After you have authorized consent, we will collect your local network permissions for finding available screen device."}
{"task": "rw_105.jsonl", "id": 72175, "text": "Local network permissions are sensitive information. Refusing to provide this information will only cause you to be unable to enjoy local network authority -based services, but it does not affect other functions of your normal use of this product. You can also cancel your local network permission authorization at any time.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Refusing to provide local network permissions can only cause you to be unable to enjoy services based on local network authority, but do not affect normal use of other functions. You can cancel authorization at any time."}
{"task": "rw_105.jsonl", "id": 72176, "text": "1.15, when you participate in the activities of the information channel, daily welfare and other pages in this product, use the appointment/cancellation of the appointment function on the page to conduct activities, events, content, live broadcast, game versions, etc.We need to obtain the calendar permissions of your equipment to write an appointment or an appointment that you want to make an appointment or adjustment into your equipment calendar.", "label": ["Permission Acquisition", "Important"], "rewrite": "We need to obtain the calendar permissions of your equipment to write an appointment event you made or to be adjusted into the calendar of your equipment."}
{"task": "rw_105.jsonl", "id": 72177, "text": "If you refuse to provide it that you can only make you unable to use this function, but it does not affect other functions of your normal use of this product, you can also cancel your calendar authority at any time.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you refuse to provide calendar permissions, it will only make you unable to use this function, but it does not affect the normal use of other functions. You can cancel the calendar authority authorization at any time."}
{"task": "rw_105.jsonl", "id": 72178, "text": "1.16, if you choose to use personal identity authentication, creator income withdrawal, IP new travel internal test, national e -sports registration and other functions, in order to ensure your account security, we may need to fill in your real name, mobile phone number, identity identity, identity identityThe certificate number or other identity proof and the verification of the \"face recognition\" to confirm that it is your own operation.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your real name, mobile phone number, ID number, or other identity certificate and check through the \"face recognition\" method to confirm that it is your own operation."}
{"task": "rw_105.jsonl", "id": 72179, "text": "We will tell you the relevant personal information collection and use rules again when you use related functions, and obtain your photos through albums or cameras after you authorize your consent.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will inform the relevant personal information collection and use rules again when using related functions, and obtain photos through albums or cameras after authorization."}
{"task": "rw_105.jsonl", "id": 72180, "text": "You can also choose to refuse to authorize or use related functions, rejecting other functions of your normal use of king camps.", "label": ["Edit/Control", "Important"], "rewrite": "You can choose to refuse to authorize or use related functions, and refuse to not affect other functions of your normal use of the king camp."}
{"task": "rw_105.jsonl", "id": 72181, "text": "Without separate instructions and obtaining your consent, we will not retain or use your above information for other purposes.", "label": ["Data Retention", "Important", "First Party Collection Information"], "rewrite": "Without separate instructions and obtaining your consent, we will not retain or use your above information for other purposes."}
{"task": "rw_105.jsonl", "id": 72182, "text": "1.17, when you use this product to purchase related game coupons or participate in welfare activities, we need to synchronize the points and welfare information that you buy or obtain to get related games to complete the recharge and dot coupons and welfare issuance of the corresponding game account.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "We need to synchronize the coupon you purchased or obtained to the associated game."}
{"task": "rw_105.jsonl", "id": 72183, "text": "1.18, we may collect your information through, cookie, identifiers, and related technologies in order to provide you with services and appearance according to the service style and appearance you want, and ensure the security of the service. You can manage cookies through the browser.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may collect your information through cookies, identifiers, and related technologies, and you can manage cookies through the browser."}
{"task": "rw_105.jsonl", "id": 72184, "text": "But please note that if Cookie is discontinued, you may not be able to enjoy the best service experience, and certain services may not be used normally.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If Cookie is stopped, you may not be able to enjoy the best service experience, and certain services may not be used normally."}
{"task": "rw_105.jsonl", "id": 72185, "text": "If you want to learn more about the security of cookies, please check the \"Tencent Privacy Policy\" further.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you want to learn more about the security of cookies, please check the \"Tencent Privacy Policy\" further."}
{"task": "rw_105.jsonl", "id": 72186, "text": "1.19, According to relevant laws, regulations and national standards, we may collect and use your relevant personal information without asking for your authorization and consent in the following situations:", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "In the following situations, we may collect and use your relevant personal information without asking your authorization consent:"}
{"task": "rw_105.jsonl", "id": 72187, "text": "Directly related to national interests such as national security and national defense security;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect personal information directly related to national interests such as national security and national defense security without agreeing."}
{"task": "rw_105.jsonl", "id": 72188, "text": "Directly related to the major public interests such as public safety, public health, and public knowledge;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collection of personal information directly related to major public interests such as public safety, public health, and public awareness does not require consent."}
{"task": "rw_105.jsonl", "id": 72189, "text": "Directly related to criminal investigation, prosecution, trial, and execution of judgment;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collection of personal information directly related to criminal investigations, prosecutions, trials, and enforcement of sentences, etc., without consent."}
{"task": "rw_105.jsonl", "id": 72190, "text": "Out of maintaining major legitimate rights and interests such as life, property, and reputation of you or other individuals, it is difficult to get my consent;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting and maintaining major legitimate rights and interests, but it is difficult to get personal information that I agree, no need to agree."}
{"task": "rw_105.jsonl", "id": 72191, "text": "The personal information collected is publicly disclosed to the public by itself;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "The collected personal information is publicly disclosed to the public by itself and does not need to agree."}
{"task": "rw_105.jsonl", "id": 72192, "text": "Collect personal information from the legal public information, such as legal news reports, government information disclosure and other channels;;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If you collect personal information from the legal disclosure information, you don't need to agree."}
{"task": "rw_105.jsonl", "id": 72193, "text": "The required signing and fulfillment of the contract must be signed according to your request;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting the personal information necessary for signing and performing the contract, there is no need to agree."}
{"task": "rw_105.jsonl", "id": 72194, "text": "The necessary and stable operation of the products or services provided by maintaining the products or services, such as discovering and disposing of products or services;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting the personal information necessary for the safe and stable operation of the products or services provided by maintenance, no need to agree."}
{"task": "rw_105.jsonl", "id": 72195, "text": "It is necessary to carry out legal news reports;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect personal information necessary for legitimate journalism without consent."}
{"task": "rw_105.jsonl", "id": 72196, "text": "When it is necessary to carry out statistics or academic research in public interests, and the results of academic research or descriptions are provided, the personal information contained in the results is identified by", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "It is not necessary to agree to the personal information of statistics or academic research in the institute of statistics or academic research."}
{"task": "rw_105.jsonl", "id": 72197, "text": "Other circumstances stipulated in laws and regulations.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect personal information under other circumstances stipulated in laws and regulations, no need to agree."}
{"task": "rw_105.jsonl", "id": 72198, "text": "1.20, please understand that the functions and services we provide to you are constantly updated and developed. If a function or service is not in the aforementioned instructions and collects your information, we will use page prompts, interactive processes, websites, websites, websites, websites, websites, websites, websites, websitesAnnouncement and other methods to explain the content, scope and purpose of the collection of information to obtain your consent.", "label": ["Important", "First Party Collection Information"], "rewrite": "If a function or service is not collected in the aforementioned instructions and your information is collected, we will explain the content, scope and purpose of the information collection to you to obtain consent."}
{"task": "rw_105.jsonl", "id": 72199, "text": "At present, in addition to collecting product survey information from a third -party research agency to help us improve the product, and the provisions of Article 1.1 of this guideline, you will use a third -party account to log in to this product.Your personal information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will not take the initiative to obtain your personal information from a third party outside Tencent Group."}
{"task": "rw_105.jsonl", "id": 72200, "text": "If the business development needs to obtain and process your personal information from a third party outside Tencent Group in the future, we will strictly abide by the provisions of relevant laws and regulations, ask the third party to obtain your consent and ensure that the information provided by the information it provides provided is legal.sex.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "We will strictly abide by the provisions of relevant laws and regulations, asking the third party to obtain consent and ensure the legitimacy of the information it provides."}
{"task": "rw_105.jsonl", "id": 72201, "text": "2. Storage of information", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72202, "text": "2.1 Method and period of information storage", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72203, "text": "We will store your information in a safe way, including local storage (such as using APP for data cache), database and server logs.", "label": ["Data Retention", "Important"], "rewrite": "We will store information in a safe way, including local storage (such as using APP for data cache), database and server logs."}
{"task": "rw_105.jsonl", "id": 72204, "text": "Under normal circumstances, we will only store your personal information within the time necessary for the purpose of service to achieve service purposes or under the conditions of laws and regulations.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "Under normal circumstances, we will only store your personal information within the time necessary for the purpose of service to achieve service purposes or under the conditions of laws and regulations."}
{"task": "rw_105.jsonl", "id": 72205, "text": "2.2 The area where information storage", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72206, "text": "We will store personal information collected in China in China in accordance with laws and regulations.", "label": ["Data Retention", "Important"], "rewrite": "Store the personal information collected in China to China."}
{"task": "rw_105.jsonl", "id": 72207, "text": "2.3 Notice of the product or service stopping operation", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72208, "text": "When our products or services stop operation, we will announce notifications in accordance with relevant laws and regulations and protect your legitimate rights and interests in accordance with the law.", "label": ["Important", "Cessation of Operations"], "rewrite": "When the product or service stops operation, it will be announced in accordance with relevant laws and regulations and protects legitimate rights and interests in accordance with the law."}
{"task": "rw_105.jsonl", "id": 72209, "text": "3. Information security", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72210, "text": "3.1 Safety protection measures", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72211, "text": "We strive to provide protection for users' information security to prevent information leakage, loss, improper use, unauthorized access and disclosure.", "label": ["Important", "Data Security"], "rewrite": "We strive to provide protection for users' information security to prevent information leakage, loss, improper use, unauthorized access and disclosure."}
{"task": "rw_105.jsonl", "id": 72212, "text": "We use multi -directional security protection measures to ensure that user personal information protection is at a reasonable level of security, including technological protection methods, management system control, and security system guarantee.", "label": ["Important", "Data Security"], "rewrite": "We use multi -directional security measures to ensure that user personal information protection is at a reasonable level of security."}
{"task": "rw_105.jsonl", "id": 72213, "text": "We use industry -leading technical protection measures.", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72214, "text": "The technical means we use include but not limited to firewalls, encryption (such as SSL), de -identification or anonymous treatment, access control measures, etc.", "label": ["Important", "Data Security"], "rewrite": "The technical means we use include but not limited to firewalls, encryption (such as SSL), de -identification or anonymous treatment, access control measures, etc."}
{"task": "rw_105.jsonl", "id": 72215, "text": "In addition, we will continue to strengthen the security capabilities of software installed on your device.", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72216, "text": "For example, we will complete some information encryption work locally to consolidate security transmission;", "label": ["Important", "Data Security"], "rewrite": "We will complete some information encryption work locally to consolidate security transmission."}
{"task": "rw_105.jsonl", "id": 72217, "text": "We will understand the application information and running process information installed by your device to prevent malicious programs such as viruses and Trojans.", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72218, "text": "We have established a special management system, process and organization that guarantees personal information security.", "label": ["Important", "Data Security"], "rewrite": "We have established a special management system, process and organization that guarantees personal information security."}
{"task": "rw_105.jsonl", "id": 72219, "text": "For example, we strictly restrict the scope of the personnel of the access information, require them to abide by the confidentiality obligations and audit, and those who violate the obligations will be punished in accordance with regulations.", "label": ["Important", "Data Security"], "rewrite": "We strictly restrict the scope of the personnel access information, require obligations to obey confidentiality and conduct audit, and personnel who violate the obligations will be punished in accordance with regulations."}
{"task": "rw_105.jsonl", "id": 72220, "text": "We will also review the management system, process and organization to prevent unauthorized access, use or disclosure of user information.", "label": ["Important", "Data Security"], "rewrite": "We will review the management system, process and organization to prevent unauthorized access, use or disclosure of user information."}
{"task": "rw_105.jsonl", "id": 72221, "text": "We recommend that you pay full attention to the protection of personal information when using products and services, and we will also provide multiple security functions to help you protect your personal information security.", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72222, "text": "3.2 Safety event disposal measures", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72223, "text": "If personal information leaks and other security incidents occur, we will start emergency plans to prevent security incidents from expanding.", "label": ["Important", "Data Security"], "rewrite": "If personal information leaks and other security incidents occur, we will start emergency plans to prevent security incidents from expanding."}
{"task": "rw_105.jsonl", "id": 72224, "text": "After the security incident occurs, we will inform you the basic situation of the security incident in the form of announcement, push notification or email, we are about or already adopted, and our proposals for your response.", "label": ["Important", "Data Security"], "rewrite": "After the security incident, we will inform the basic situation, disposal measures and remedial measures of the security incident to cope with suggestions."}
{"task": "rw_105.jsonl", "id": 72225, "text": "If it is difficult to notify one by one, we will issue warnings through announcements and other means.", "label": ["Important", "Data Security"], "rewrite": "If it is difficult to notify one by one, we will issue warnings through announcements and other means."}
{"task": "rw_105.jsonl", "id": 72226, "text": "4. How do we use information", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72227, "text": "We strictly abide by the provisions of laws and regulations and the agreement with users, in accordance with the guidelines and the use and collection information described in the \"King's Camp Permits and Service Agreement\" and \"Tencent Privacy Policy\" to provide you with better services.", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72228, "text": "4.1 Information use rules", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72229, "text": "We will use the collected information according to the following rules:", "label": ["Important", "Usage"], "rewrite": "We will use the collected information according to the following rules:"}
{"task": "rw_105.jsonl", "id": 72230, "text": "We will provide you with various functions and services based on the information we collect, including basic information reading, friends chat, community interaction, record query functions, etc.;", "label": ["Important", "Usage"], "rewrite": "We will provide you with various functions and services based on the collected information."}
{"task": "rw_105.jsonl", "id": 72231, "text": "We will analyze the operation of our products based on the frequency and conditions of your use of this product, fault information, performance information, etc., to ensure the security of services, optimize our products, and improve our service quality.", "label": ["Important", "Usage"], "rewrite": "We will analyze the operation of our products based on the frequency and situation of this product, fault information, and performance information to ensure the security of the service."}
{"task": "rw_105.jsonl", "id": 72232, "text": "We will not combine the information we store in the analysis software with the personal identity information you provide.", "label": ["Important", "Data Security"], "rewrite": "We will not combine the information we store in the analysis software with the personal identity information you provide."}
{"task": "rw_105.jsonl", "id": 72233, "text": "4.2 The way to obtain consent after notifying the purpose of the change", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72234, "text": "We will use the collected information in the purpose covered by this guideline.", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72235, "text": "If we use your personal information beyond the stated purpose and scope of direct or reasonable connection with the collection, we will notify you again and obtain your express consent before using your personal information.", "label": ["Important", "Data Security", "Usage"], "rewrite": "If we use your personal information, which exceeds the purpose and scope of the purpose of the time when we collect, we will tell you again before using personal information and obtain consent."}
{"task": "rw_105.jsonl", "id": 72236, "text": "5. Provide outside", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72237, "text": "At present, except for this guideline and the situation stipulated in the \"King's Camp Permit and Service Agreement\", we will not actively share, provide or transfer your personal information to the third parties outside Tencent Group, such as other sharing, providing or transferring youWhen your personal information or you need us to share, provide or transfer or transfer your personal information to a third -party situation outside Tencent Group, we will directly or confirm that the third party obtains your consent of the above behavior.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If there is a sharing situation, we will directly or confirm that the third party obtains your explicit consent of the above behavior."}
{"task": "rw_105.jsonl", "id": 72238, "text": "Except for this guideline and the \"King's Camp Permits and Service Agreement\" and \"Tencent Privacy Policy\", we will not disclose the personal information collected publicly to the public.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Except for this guideline and the \"King's Camp Permit and Service Agreement\" and \"Tencent Privacy Policy\", they will not disclose the collected personal information collected publicly."}
{"task": "rw_105.jsonl", "id": 72239, "text": "If public disclosure is necessary, we will inform you of the purpose of the public disclosure, the type of information disclosed and the sensitive information that may be involved, and obtain your express consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you must disclose it publicly, you will tell you the purpose of the public disclosure, the type of disclosure information, and the sensitive information that may be involved, and obtain the consent."}
{"task": "rw_105.jsonl", "id": 72240, "text": "With the continuous development of our business, we may conduct merging, acquisition, asset transfer and other transactions. We will inform you that the relevant situation will continue to protect or request new controller to continue in accordance with laws and regulations and not lower than the standards required by this guideline.Protect your personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the case of mergers, acquisitions, asset transfers and other transactions, we will inform you of the relevant circumstances, and continue to protect or require the new controller to continue to protect your personal information."}
{"task": "rw_105.jsonl", "id": 72241, "text": "In addition, according to relevant laws, regulations and national standards, we may share, transfer, and publicly disclose personal information under the circumstances specified in Article 1.19 of these Guidelines without obtaining your prior authorization and consent.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "We may share, transfer, and publicly disclose personal information without obtaining your authorization consent in advance."}
{"task": "rw_105.jsonl", "id": 72242, "text": "6. Your rights", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72243, "text": "During your use of this product service, we may provide you with the corresponding operation settings according to the specific situation of this product, so that you can inquire, delete, correct or remove your relevant personal information. You can refer to the specific guidance of the product for operation.", "label": ["Important", "Edit/Control"], "rewrite": "We may provide you with the corresponding operation settings according to the specific situation of this product so that you can inquire, delete, correct, or withdraw your relevant personal information."}
{"task": "rw_105.jsonl", "id": 72244, "text": "In addition, we have set up a complaint report channel, and your opinions will be dealt with in a timely manner.", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72245, "text": "7. Change", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72246, "text": "We may revise this guidelines in a timely manner.", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72247, "text": "When the terms of this guideline change, we will prompt you the guidance after the version is updated in an appropriate manner.", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72248, "text": "Please read the content of the privacy protection or guidelines carefully after the change. You continue to use this product to indicate that you agree to collect, process or use your personal information according to the updated privacy protection guidelines.", "label": ["Policy Change", "Important"], "rewrite": "You continue to use this product to indicate that you agree to collect, process or use your personal information according to the updated privacy protection guidelines."}
{"task": "rw_105.jsonl", "id": 72249, "text": "8. Minor protection", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72250, "text": "We attach great importance to the protection of personal information of minors and continue to explore the updated personal information protection methods of minors.", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72251, "text": "According to the relevant laws and regulations, if you are a minor under the age of 18, you should obtain the consent of your parents or legal guardians before using Tencent's service.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a minor under the age of 18, you should obtain the consent of your parents or legal guardians before using the service."}
{"task": "rw_105.jsonl", "id": 72252, "text": "In particular, if you are a child under the age of 14, you should help you complete the product or service registration process by your parents or the legal guardian so that you can use the products or services we provide.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a child under the age of 14, the legal guardian should help you complete the product or service registration process."}
{"task": "rw_105.jsonl", "id": 72253, "text": "If you are the guardian of minors, when you help children complete the registration and use of products or services, you should carefully read this guideline and the \"Child Privacy Protection Statement\", decide whether to agree with this guideline and the \"Child Privacy Protection Statement\".Help minors register and use so that they can use the products or services we provide.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are the guardian of minors, you should read carefully and decide whether to agree with this guideline and the \"Child Privacy Protection Statement\" before registering and use."}
{"task": "rw_105.jsonl", "id": 72254, "text": "If you have relevant questions or claims for personal information protection of the minor information you are monitored, please contact us through the contact information of the disclosure in the \"Child Privacy Protection Statement\".", "label": ["Specific Audiences", "Important"], "rewrite": "If you have relevant questions or claims for personal information protection of minors, please contact us through the contact information in the \"Child Privacy Protection Statement\"."}
{"task": "rw_105.jsonl", "id": 72255, "text": "We will deal with and reply to you within a reasonable time.", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72256, "text": "9. Others", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72257, "text": "\"Tencent Privacy Policy\" is a general privacy clause for Tencent's unified applicable. The content stipulated in it includes but not limited to user rights and information security measures.", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72258, "text": "For example, the \"Tencent Privacy Policy\" is inconsistent or contradictory with this guideline, please refer to this guideline.", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72259, "text": "\"Child Privacy Protection Statement\" is a personal information protection rule for children under 14 years of age.", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72260, "text": "Within the scope of the \"Child Privacy Protection Statement\", such as the \"Tencent Privacy Policy\" and this guideline are inconsistent or contradictory, please refer to the \"Child Privacy Protection Statement\".", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72261, "text": "10. Contact us", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72262, "text": "When you have any other complaints, suggestions, and personal information related to minors, please contact us through https://kf.qq.com/.", "label": ["Important", "Contact Information"], "rewrite": "Please contact us through https://kf.qq.com/."}
{"task": "rw_105.jsonl", "id": 72263, "text": "You can also send your question to dataprivacy@tencent.com or send it to the following address:", "label": ["Important", "Contact Information"], "rewrite": "You can send the question to dataprivacy@tencent.com."}
{"task": "rw_105.jsonl", "id": 72264, "text": "Tencent Binhai Building, No. 33 Haitian Er Road, Haitian 2nd Road, Nanshan District, Guangdong Province, China (closed), postcode: 518054", "label": ["Important", "Contact Information"], "rewrite": "You can send the problem to the following address: Tencent Binhai Building, No. 33 Haitian Er Road, Nanshan District, Shenzhen, Guangdong Province, China."}
{"task": "rw_105.jsonl", "id": 72265, "text": "We will review the issues involved as soon as possible and answer your request within the period of 15 or the period stipulated by laws and regulations.", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72266, "text": "Shenzhen Tencent Computer System Co., Ltd.", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72267, "text": "Shenzhen Tencent Tianyou Technology Co., Ltd.", "label": [], "rewrite": []}
{"task": "rw_105.jsonl", "id": 72268, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
