{"task": "rw_127.jsonl", "id": 77035, "text": "Personal Information and Privacy Protection Policy of Miha You Yuan Gods", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77036, "text": "overview", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77037, "text": "\"Original User Personal Information and Privacy Protection Policy\" (hereinafter referred to as \"Privacy Policy\" \") from you (hereinafter referred to as\" user \"or\" you \") and Shanghai Mihayou Film and Iron Technology Co., Ltd. (also known as\" \"also\" also known as \"\"Mihayou \"or\" we \") jointly concluded that this\" Privacy Policy \"has a contract effect.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77038, "text": "You are welcome to use the services provided by Mihayou for you, including your interactive behavior and/or your registered and/or registered products or services provided by Miha You (hereinafter collectively referred to as \"Mihayou service \"or\" service \").", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77039, "text": "In order to ensure the privacy of users during the use of Mihayou service, Mihayoute has formulated this \"Privacy Policy\" to explain to you how to collect, use, store, and share your individuals when using the Mida -yam service.The information, as well as the way we provide access, update, control and protect this information.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77040, "text": "This \"Privacy Policy\" is suitable for the service we provided by us.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77041, "text": "When you use the services we provide, we will process and protect your personal information in accordance with the agreement of this \"Privacy Policy\".", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77042, "text": "The points are as follows:", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77043, "text": "• In order to provide you with basic services such as gaming entertainment and interactive and consumption related to this player, we need to collect your account and login information, game log information, equipment information, consumption information, real -name certification information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Need to collect your account and login information, game log information, device information, consumption information, real-name authentication information"}
{"task": "rw_127.jsonl", "id": 77044, "text": "In order to provide you with other value -added services and logistics services, we also need to collect other information such as your delivery address and birthday, as well as the contact information you actively provide us.", "label": ["Important", "First Party Collection Information"], "rewrite": "You also need to collect other information such as your delivery address and birthday, as well as the contact information you provided to us."}
{"task": "rw_127.jsonl", "id": 77045, "text": "• In the process of providing services, we may need to apply for some system permissions based on the specific scenes and functions of service. You can manage your personal information and related authorization according to the guidance.", "label": ["Permission Acquisition", "Important"], "rewrite": "You need to apply for some system permissions, you can manage your personal information and related authorization according to the guide"}
{"task": "rw_127.jsonl", "id": 77046, "text": "•, except for the situation stipulated in this \"Privacy Policy\", we will not actively share, transfer, disclose your personal information until third parties other than Mihayou, such as other sharing, transfer, disclose your personal information or youWhen we need to share, transfer, and disclose your personal information to a third party other than Mihayou, we will directly or confirm that the third party obtains your consent of your above behavior.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Will not take the initiative to share, transfer, and disclose your personal information until the third party other than Mihayou."}
{"task": "rw_127.jsonl", "id": 77047, "text": "•, you can query, correct, delete, copy your personal information, change the scope of your authorization consent or revoke your authorization consent, and cancel the Mihayou service account.", "label": ["Important", "Edit/Control"], "rewrite": "You can query, correct, delete, copy your personal information, change the scope of your authorization consent or revoke your authorization consent, and cancel the Midyou service account."}
{"task": "rw_127.jsonl", "id": 77048, "text": "• We use multi -directional security protection measures to ensure that your personal information protection is at a reasonable level of security.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77049, "text": "You can understand the full version of \"Personal Information and Privacy Protection Policy\" by reading the full version of the corresponding relationship of personal information types and uses.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77050, "text": "If you are a minor under the age of 18 (especially children under the age of 14), Mihayou specifically please pay attention. You need to read this \"Privacy Policy\" with your guardian.Thin fonts are marked with personal information related to the personal information of minors (especially children under the age of 14), please and your guardians must read it carefully;", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a minor under the age of 18 (especially children under the age of fourteen), Mihayou specifically please pay attention, you need to read this \"Privacy Policy\" with your guardian"}
{"task": "rw_127.jsonl", "id": 77051, "text": "After obtaining your guardian's consent of all the terms of this \"Privacy Policy\", use Midhayou service.", "label": ["Specific Audiences", "Important"], "rewrite": "After obtaining your guardian's consent of all the terms of this \"Privacy Policy\", use Midhayou service."}
{"task": "rw_127.jsonl", "id": 77052, "text": "Children's special description:", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77053, "text": "We suggest: Any child should obtain the consent of the guardian in advance.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77054, "text": "If you are a child under the age of 14, please notify your guardian to read the \"Privacy Policy\" together, and seek and obtain your consent and guidance of your guardian before you submit your personal information and use Mihayou services.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a child under the age of 14, please notify your guardian to read the \"Privacy Policy\" together and obtain the consent and guidance of your guardian."}
{"task": "rw_127.jsonl", "id": 77055, "text": "You click to agree with this \"Privacy Policy\", or if you use/continue to use Midhayou services and submit personal information, you have said that you have obtained the permission of your guardian, and your guardian also agrees to be subject to the \"Privacy Policy\".", "label": ["Specific Audiences", "Important"], "rewrite": "You click to agree to this \"Privacy Policy\", or you use/continue to use the Midhayou service and submit personal information, all indicate that you have obtained the permission of your guardian"}
{"task": "rw_127.jsonl", "id": 77056, "text": "We may revise this \"Privacy Policy\" in a timely manner.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77057, "text": "When the terms of this \"Privacy Policy\" change, we will prompt you to prompt you the guidance after the version prompt, pop -up window, website announcement, etc. When the version is updated.", "label": ["Policy Change", "Important"], "rewrite": "When the terms of this \"Privacy Policy\" change, we will prompt you in appropriate methods such as page prompts, pop -ups, and website announcements when the version is updated."}
{"task": "rw_127.jsonl", "id": 77058, "text": "Please read the \"Privacy Policy\" after the change.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77059, "text": "You continue to use the Mihayou service, saying that you agree that we collect, process or use your personal information according to the updated \"Privacy Policy\".", "label": ["Policy Change", "Important"], "rewrite": "Continue to use the Mihayou service, and agrees to collect, process or use your personal information according to the updated \"Privacy Policy\""}
{"task": "rw_127.jsonl", "id": 77060, "text": "After reading this \"Privacy Policy\", if you have any problems with this \"Privacy Policy\" or related matters relatedContact us with customer service contact.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77061, "text": "1. Information collected by Mihayou:", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77062, "text": "When we provide you with services, we will collect, store or use the following information related to you in other legal ways.", "label": ["Important", "First Party Collection Information"], "rewrite": "Will collect, store or use the following information related to you in other legal ways."}
{"task": "rw_127.jsonl", "id": 77063, "text": "If you do not provide relevant information, you will not be able to register as our user, or to enjoy part or all products or services we provide, or to achieve the effect that related services intend to achieve.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If you do not provide relevant information, you will not be able to register as a user, or you cannot enjoy the service or achieve the effect."}
{"task": "rw_127.jsonl", "id": 77064, "text": "You understand and agree that some single services may require you to turn on specific access permissions in your device to achieve the collection and use of information involved in these permissions.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "Some single services may need to open a specific access permissions in the device to achieve the collection and use of information involved in these permissions."}
{"task": "rw_127.jsonl", "id": 77065, "text": "We will collect and use your personal information for the following goals:", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77066, "text": "1.1 We will collect the following information when you take the initiative:", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect the following information when you take the initiative:"}
{"task": "rw_127.jsonl", "id": 77067, "text": "1.1.1 When you register and log in to the account, you need to complete a series of registration or login procedures according to our guidance. In the process, you need to provide us with a mobile phone number or email address to accept the verification code matching the identity of the person to complete the registration/ complete registration/Log in.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the mobile phone number or email to accept the verification code matching the identity of the person to complete the registration/login"}
{"task": "rw_127.jsonl", "id": 77068, "text": "Only by providing the above information of the above -mentioned information can you successfully register the account and use the core function of Midhayou products;", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77069, "text": "If you refuse to provide the information necessary for the above registration, it will cause you to be unable to register/log in, or be subject to corresponding restrictions during the game;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If you refuse to provide the information necessary for the above registration, it will lead to being unable to register/log in, or be subject to corresponding restrictions during the game;"}
{"task": "rw_127.jsonl", "id": 77070, "text": "1.1.2, in order to meet the \"Notice of the National Press and Publication Administration on Preventing the Independence of Minors\", \"Notice on Further Strict Management and Performing and Preventing Minors to Daling Online Games\" and other relevant laws and regulations and policiesRequires, you need to provide us with name, phone number and identity certificate when registering accounts or using Midhayou services. This type of information is sensitive information. Refusing to provide real -name authentication information can cause you to be unable to log in or be corresponding during the game process.limit;", "label": ["Important", "First Party Collection Information"], "rewrite": "Need to collect names, phone numbers, and identity certificates, refusal to provide real -name authentication information can lead to being unable to log in or be subject to corresponding restrictions during the game"}
{"task": "rw_127.jsonl", "id": 77071, "text": "In order to strengthen minor protection measures, you also need to provide your face characteristics information in specific circumstances to perform practical verification. Rejecting provision of real -person authentication information may cause you to be restricted by the corresponding anti -addiction during the game.", "label": ["Specific Audiences", "First Party Collection Information", "Important"], "rewrite": "Under certain circumstances, you need to collect your face characteristics information for practical verification, refusing to provide solid authentication information, which will lead to the corresponding anti -addiction limit during the game"}
{"task": "rw_127.jsonl", "id": 77072, "text": "1.1.3 In order to provide you with value -added services other than Mihayou services, including gifts, prizes, and birthday wishes, you agree to provide us with relevant personal information, including sending address and birthday. Refusing to provide this information will only cause you to be unable to be unable to provide you.Get relevant value -added services does not affect other functions of your normally use Mihayou.", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to provide value -added services, relevant personal information will be collected, including the delivery address and birthday. The refusal to provide the information will only cause the relevant value -added services to obtain the relevant value -added services and not affect the normal use of other functions."}
{"task": "rw_127.jsonl", "id": 77073, "text": "1.1.4, to provide you with logistics services for third -party logistics service providers, you agree to provide us with relevant personal information, including names, mobile phone numbers, address information, etc., refusing to provide this information will only cause you to obtain relevant logistics servicesIt does not affect other functions of Mihayou normally.", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to provide logistics services, related personal information will be collected, including name, mobile phone number, address information, etc., refusing to provide provision of logistics services that can only obtain relevant logistics, it will not affect your normal use of other functions."}
{"task": "rw_127.jsonl", "id": 77074, "text": "1.2 In order to provide you with services and protect account security, we will collect information you actively provided when using the service or because of the service when using the service:", "label": ["Important", "First Party Collection Information"], "rewrite": "To provide services and protect account security, collect information in the following ways"}
{"task": "rw_127.jsonl", "id": 77075, "text": "1.2.1 Device or software information.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77076, "text": "In order to identify your devices, ensure your normal use of our services, maintain the normal operation of the basic functions of the game and ensure your account security, we will collect your mobile devices, web browsers or other services to access our products or servicesThe configuration information provided by the program, your IP address, terminal device (including mobile phones, tablets, computers, computers, mobile smart devices, home game consoles, customer equipment, wireless routers, operating systems and other must -have, other must -have, hardware or Internet devices))The versions of the equipment (IMEI), SIM information (national identification code), IMSI, MAC address, device ID, Android ID, developer anonymous device logo, application anonymous device logo, Android advertising identification, and installation of uniquelyIdentification, application unique logo, equipment name, equipment type and version, system type and version, equipment model, brand, time zone, system country, timestamp, battery status, CPU information and architecture, graphics card information, baseband version, whether ROOT/Jailbreak, simulator information (only Android), device horizontal and vertical screen information (only iOS), unique identification of ROM, device screen resolution and size, system startup time, whether it runs in the simulator, language area, game capacity, equipment memory, Remnant memory, remaining built -in and external SD card space capacity, application ID, network information (including network type information, network environment), OAID, UUID, IDFA, WIFI, list, retrieval application, installation application software list and information, and information, and information, information, and information, information, and information, information, and information, and information, and information, information, and information, and information, and information, and information, and information, and information, and information, and information, and information, and information, and information, and information, and information, and information, information, and information, and information, and information, and information, and information, and information, and information, and information.Application name and version, SDK version, running process information, host files, SD card should be a file list, memory sequence number, disk serial number, CPU serial number, network card serial number.", "label": ["Important", "First Party Collection Information"], "rewrite": "Will collect your configuration information, your IP address, terminal device (including mobile phones, tablets, computers, mobile smart devices, home gaming machines, customer equipment, wireless routers, operating systems and other necessary soft, hardware or Internet devices))The versions of the equipment (IMEI), SIM information (national identification code), IMSI, MAC address, device ID, Android ID, developer anonymous device logo, application anonymous device logo, Android advertising identification, and installation of uniquelyIdentification, application unique logo, equipment name, equipment type and version, system type and version, equipment model, brand, time zone, system country, timestamp, battery status, CPU information and architecture, graphics card information, baseband version, whether ROOT/Jailbreak, simulator information (only Android), device horizontal and vertical screen information (only iOS), unique identification of ROM, device screen resolution and size, system startup time, whether it runs in the simulator, language area, game capacity, equipment memory, Remaining memory, remaining built -in and external SD card space capacity, application ID, network information (including network type information, network environment), OAID, UUID, IDFA, WIFI lists, retrieval applications, installation application software lists and information, applications, applications, applications, applications, applications, applications, applications, applications, applications, applications, applications, applications, applications, applications, applications, applications, applications, applications, applications, applications, applications, applications, applications, and applications, applications, applications, applications, applications, and applications, applications, and applications, applications, applications, and applications, and applications, and applications.Name and version, SDK version, running process information, host files, SD card applicable cache file list, memory sequence number, disk serial number, CPU serial number, network card serial number."}
{"task": "rw_127.jsonl", "id": 77077, "text": "Among them, the only identification information of the device is used only to provide you with a security guarantee function in the process of using the Mida travel service;", "label": ["Important", "First Party Collection Information"], "rewrite": "The device unique identification information is only used for you to provide you with a security guarantee function in the process of using the Mida travel service."}
{"task": "rw_127.jsonl", "id": 77078, "text": "This type of information is the basic information that must be collected for services;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77079, "text": "In order to provide you with accurate transaction services, we will also obtain your international mobile user recognition code, MEID and SIM information (SIM card serial number) to ensure your transaction security, collect the above information to achieve Mihayou to travelThe consumption function of game products is necessary, otherwise the transaction will not be completed.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the international mobile user recognition code (IMSI), MEID and SIM information (SIM card serial number) to ensure your transaction security"}
{"task": "rw_127.jsonl", "id": 77080, "text": "1.2.2 User's game behavior log.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77081, "text": "In order to enable you to view your game history records on the client, at the same time used for game operation statistical analysis, customer service complaint processing and game security analysis.After obtaining your consent, we may synchronize the aforementioned information to the subsequent version of the game or other Mihayou services you are using.", "label": ["Important", "First Party Collection Information"], "rewrite": "Will collect your login log, item log, game matching information, purchase records, and dating records. After obtaining consent, the aforementioned information may be synchronized"}
{"task": "rw_127.jsonl", "id": 77082, "text": "In addition, in order to ensure your account security, in the login verification scenario, we will collect and use the cursor movement speed and click position of the cursor generated during the operation verification process;", "label": ["Important", "First Party Collection Information"], "rewrite": "Will collect and use information such as the movement speed of the cursor generated during the operation verification process and the click position and other information"}
{"task": "rw_127.jsonl", "id": 77083, "text": "1.2.3 When you use the consumption function of MiHoYo game products, we will collect your recharge records and consumption records so that you can check your transaction records, provide you with payment functions, and protect your virtual Items are safe.", "label": ["Important", "First Party Collection Information"], "rewrite": "Will collect recharge records and consumer record information in order to query transaction records and provide payment functions"}
{"task": "rw_127.jsonl", "id": 77084, "text": "The recharge record and consumption record are sensitive information. Collecting the above information is necessary to achieve the consumption function of Mihayou game products, otherwise the transaction will not be completed;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "The recharge record and consumption record are sensitive information. Collecting the above information is necessary to achieve consumer functions, otherwise the transaction will not be completed"}
{"task": "rw_127.jsonl", "id": 77085, "text": "1.2.4 Based on providing security guarantee for your game account, we will collect your game recognition information, game versions, hardware and operating system information, application lists, current operation task information, game and non -game abnormal process information, game operation operation, game operationRelated call methods and information, whether there are other external programs, external programs attempt/access to the game and data, and the effect of game operation related to the game information, and the impact of external program information on the game.Or interference and destroying the normal behavior of game services are used to detect pirated, scanned plug -in, and prevent cheating;", "label": ["Important", "First Party Collection Information"], "rewrite": "It will collect game recognition information, game versions, hardware and operating system information, application lists, current operation task information, game and non -game abnormal process information, game operation related calling methods and information, whether there are other external programs, external programs in the game interfaceTry to the record of the records and data of the game and data, the effect of the game operation related to the game, and the impact of external program information on the game. It is used to maintain the fair game fairness"}
{"task": "rw_127.jsonl", "id": 77086, "text": "1.2.5, when you interact with other players through text, pictures, voice, and video methods in the game, we may collect and save the above information content you sent to filter pornography, violence, politics, abuse, malicious advertisingImproper content to purify the game environment and maintain a healthy Internet environment;", "label": ["Important", "First Party Collection Information"], "rewrite": "Will collect and save the interactive information you sent to purify the game environment"}
{"task": "rw_127.jsonl", "id": 77087, "text": "1.2.6 Equipment rights.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77088, "text": "In the process of providing services, the specific scenarios and functions of the service may require you to turn on some equipment access rights.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77089, "text": "Under normal circumstances, we will collect and use your following permissions in the following scenarios:", "label": ["Permission Acquisition", "Important"], "rewrite": "We will collect and use your following permissions in the following scenarios:"}
{"task": "rw_127.jsonl", "id": 77090, "text": "1) Camera (camera) access permissions. When you take pictures in the software to upload graphic content, actual authentication and/or scan our product or service, we need to authorize us to access your album and///Or camera (camera) permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "Apply for camera (webcam) access"}
{"task": "rw_127.jsonl", "id": 77091, "text": "If you refuse to authorize, it will affect your normal use of taking pictures, code -scanning login functions, and real -person authentication functions, but it will not affect other functions in your software;", "label": ["Permission Acquisition", "Important"], "rewrite": "If the authorization is refused, it will affect the normal use of the photo upload function, the code scanning login function and the actual authentication function, but it will not affect other functions"}
{"task": "rw_127.jsonl", "id": 77092, "text": "2) Read and write storage space (album) permissions. When you need to upload pictures or files in your device in the software, store game screens or videos to your device, perform practical verification or obtain game resources, we, we, we, we, we, we can obtain game resources, we we can get game resources, weYou need to authorize us to access your storage space (album) permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "Apply for obtaining reading and writing storage space (album) permissions"}
{"task": "rw_127.jsonl", "id": 77093, "text": "If you refuse to authorize, it will affect your normal use of pictures, files or video upload/or download functions, actual authentication, and normal acquisition of game resources, but it will not affect other functions in your software;", "label": ["Permission Acquisition", "Important"], "rewrite": "If you refuse to authorize, it will affect the uploading/or download function of normal use of pictures, files or videos, the actual certification of real -person authentication, and the normal acquisition of game resources, but it will not affect other functions"}
{"task": "rw_127.jsonl", "id": 77094, "text": "3) Network permissions, when you use the network function in the software, we need to authorize us to access the network permissions, otherwise, you will not be able to connect normally and use the Internet, but it will not affect other functions in your software;", "label": ["Permission Acquisition", "Important"], "rewrite": "Apply to obtain access to network permission"}
{"task": "rw_127.jsonl", "id": 77095, "text": "4) Mobile/telephone status access permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "Apply for mobile phone/telephone status access permissions"}
{"task": "rw_127.jsonl", "id": 77096, "text": "When you log in to our game products with the game link channel, we need to authorize us to access your mobile phone/phone status to obtain your unique device identification code, so as to better protect your account security or your real certification informationSafe, but when you cancel the authorization, we will no longer collect the information, and we will no longer provide you with the above -mentioned services;", "label": ["Permission Acquisition", "Important", "Edit/Control"], "rewrite": "Apply for mobile phone/telephone status access permissions. After the authorization is canceled, the information will no longer be collected, and the above -mentioned service can be provided."}
{"task": "rw_127.jsonl", "id": 77097, "text": "But unless you delete your personal information in accordance with the law, your cancellation behavior will not affect the processing and storage of our personal information based on your previous authorization.", "label": ["Permission Acquisition", "Important", "Edit/Control"], "rewrite": "Unless the personal information is deleted in accordance with the law, the cancellation of behavior will not affect the processing and storage of personal information based on previous authorization"}
{"task": "rw_127.jsonl", "id": 77098, "text": "5) Cutting board permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "Apply for obtaining shear board permissions"}
{"task": "rw_127.jsonl", "id": 77099, "text": "When you paste the contents from external copy to our products, copy content from the product to the inside or outside of the product, including copying content from the product to the Miyou Club APP for posting, comments, dynamics, transmission and dynamic dynamics,We will call your shear function.", "label": ["Permission Acquisition", "Important"], "rewrite": "Apply the shear function"}
{"task": "rw_127.jsonl", "id": 77100, "text": "2. How MiHoYo uses your information", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77101, "text": "2.1 For the necessary personal information, we will use the business functions of Mihayou services.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77102, "text": "2.2 For non -necessary personal information, we will use the following purposes, including real -time weather, picture upload functions for customer service consulting and complaints, user questionnaire surveys, user research telephone interviews, voice chat.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77103, "text": "You can contact us at any time to cancel your unnecessary personal information and authorize us.", "label": ["Edit/Control", "Important"], "rewrite": "Can be canceled at any time, the authorization provided by the unnecessary personal information to us"}
{"task": "rw_127.jsonl", "id": 77104, "text": "Canceling authorization may cause you to be unable to realize some of the corresponding functions of Mihayou services.", "label": ["Important", "Edit/Control"], "rewrite": "Canceling authorization may cause you to be unable to realize some of the corresponding functions of Mihayou services."}
{"task": "rw_127.jsonl", "id": 77105, "text": "2.3 If we use your information in other uses that have not been stated in this \"Privacy Policy\", we will solicit your consent in advance.", "label": ["Important", "Usage"], "rewrite": "If the information is used for other purposes that are not stated in this \"Privacy Policy\", you will solicit your consent in advance."}
{"task": "rw_127.jsonl", "id": 77106, "text": "However, according to relevant laws and regulations and national standards, in the following circumstances, we may share, transfer, and openly disclose personal information without requiring your authorization consent in advance:", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "In the following circumstances, we may share, transfer, and publicly disclose personal information without requiring your authorization consent in advance:"}
{"task": "rw_127.jsonl", "id": 77107, "text": "1) Directly related to national interests such as national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Personal information directly related to national interests such as national security and national defense security, no need to agree"}
{"task": "rw_127.jsonl", "id": 77108, "text": "Directly related to the major public interests such as public safety, public health, and public knowledge;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Personal information directly related to major public interests such as public safety, public health, and public knowledge."}
{"task": "rw_127.jsonl", "id": 77109, "text": "2) Directly related to criminal investigation, prosecution, trial and judgment execution;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Direct related personal information such as sharing directly related to crime investigation, prosecution, trial, and judgment execution, no need to agree"}
{"task": "rw_127.jsonl", "id": 77110, "text": "3) For major legitimate rights and interests such as maintaining your life, property, and reputation of you or other individuals, it is difficult to get my consent;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Share and maintain major legitimate rights and interests, but it is difficult to get personal information that I agree, no need to agree"}
{"task": "rw_127.jsonl", "id": 77111, "text": "4) The collected personal information is made by your own public;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Share personal information that you disclose to the public by yourself, no need to agree"}
{"task": "rw_127.jsonl", "id": 77112, "text": "5) Collect personal information from the legal publicly disclosed information, such as legal news reports, government information disclosure and other channels;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Personal information collected from the information disclosed by legal publicly, no need to agree"}
{"task": "rw_127.jsonl", "id": 77113, "text": "6) Signing and fulfilling the contract according to your requirements;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Shared the personal information necessary for signing and fulfilling the contract according to your requirements, no need to agree"}
{"task": "rw_127.jsonl", "id": 77114, "text": "7) The necessary and stable operation of the products or services provided by the maintenance of the products provided, including the failure of the discovery and disposal of the product or service;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Share the personal information necessary for the safe and stable operation of the product or service provided by the product or service, no need to agree"}
{"task": "rw_127.jsonl", "id": 77115, "text": "8) It is necessary to carry out legal news reports;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Sharing is the required personal information for legal news reports, no need to agree"}
{"task": "rw_127.jsonl", "id": 77116, "text": "9) When the statistics or academic research institutes are needed for public interests, and the results of academic research or descriptions are provided, the personal information contained in the result is identified by", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Shared the personal information necessary for statistics or academic research for public interests, and no need to agree"}
{"task": "rw_127.jsonl", "id": 77117, "text": "10) Other circumstances stipulated in laws and regulations.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Shared personal information under other circumstances stipulated in laws and regulations, no need to agree"}
{"task": "rw_127.jsonl", "id": 77118, "text": "3. How to share, transfer or disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77119, "text": "Except for the situation stipulated in this \"Privacy Policy\", we will not actively share, transfer, disclose your personal information to third parties other than Mihayou, such as other sharing, transfer, disclosure of your personal information or you need us to need us need us.When sharing, transfer, disclose your personal information to a third party outside Mihayou, we will directly or confirm that the third party obtains your consent of your behavior.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Except for the situation stipulated in this \"Privacy Policy\", it will not actively share. If there is a sharing, it will directly or confirm that the third party obtains your consent of the above behavior."}
{"task": "rw_127.jsonl", "id": 77120, "text": "3.1 How do we share your information", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77121, "text": "We follow the provisions of laws and regulations and strictly restrict the sharing of personal information.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77122, "text": "Unless the Treaty of 2.3, or we get your clear consent, we will not share your personal information with any other companies, organizations and individuals.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Unless the situation set in the 2.3 Treaty, or obtains a clear consent, will not share personal information with any other companies, organizations and individuals,"}
{"task": "rw_127.jsonl", "id": 77123, "text": "Based on the following situations, we will ask you to authorize your personal information to agree:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Based on the following situations, we will ask you to authorize your personal information to agree:"}
{"task": "rw_127.jsonl", "id": 77124, "text": "3.1.1 In order to facilitate the convenience of the account of the original god game, the account of the original god game binds information, play data, role data and provide you with personalized recommendation content. We may share your aforementioned information from the Miyou Club APP;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share your account binding information, play data, and role data from the Miyou APP to provide personalized recommendation content"}
{"task": "rw_127.jsonl", "id": 77125, "text": "3.1.2 Maintain and improve our products or services.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77126, "text": "We may share your information with partners and other third parties to help us provide you with more targeted and complete services, including: to provide the corresponding order information to logistics service providers for sending gifts;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share your information with partners and other third parties in order to provide targeted services, such as: order information"}
{"task": "rw_127.jsonl", "id": 77127, "text": "For the purpose of real -name verification, provide the corresponding contact information to the communication service provider;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For the purpose of real -name verification, provide the corresponding contact information to the communication service provider"}
{"task": "rw_127.jsonl", "id": 77128, "text": "3.1.3 Mihayou provides users with a wealth of online interactive activities. In order to facilitate your participation in interactive activities and get interactive prizes, Mihayou usually requires you to be in addition to the contact method (mailing address and telephone).Fill in the form.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77129, "text": "Such information is used by Miha to accumulate data from its users.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77130, "text": "Whether you provide the required information and participating in such activities, this is completely determined by your own;", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77131, "text": "3.1.4 The purpose of fulfilling our obligations in this \"Privacy Policy\" or we reached with you;", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77132, "text": "3.1.5 When you use the Mihayou service, you will also use the SDK that provides us with some other services.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When using the Mihayou service, you will use the SDK that provides us with some other services"}
{"task": "rw_127.jsonl", "id": 77133, "text": "The above SDK may collect your personal information for the purpose of providing the above services.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "The above SDK may collect your personal information for the purpose of providing the above service"}
{"task": "rw_127.jsonl", "id": 77134, "text": "The SDK list is like an attachment.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The SDK list is like an attachment"}
{"task": "rw_127.jsonl", "id": 77135, "text": "For specific conditions such as SDK's legal liability, please see the privacy policy of the SDK operator;", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77136, "text": "The name of a third -party company, product/service, involved personal information, use scenarios, use purpose, sharing method, third -party link", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Third -party company name products/services involve personal information use scenarios to use the purpose of sharing method of third -party links"}
{"task": "rw_127.jsonl", "id": 77137, "text": "Shenzhen Hexun Huayu Information Technology Co., Ltd., Aurora JPUSH, Android version, baseband version, device model, equipment name, UUID, OAID, SIM information (national identification code), developer anonymous device identifier, application anonymous device logo, application anonymous device logo, application anonymous device identifier, application of anonymous device identifiers, identifiers,Android advertising identification, device information (mobile phone time zone, mobile phone brand, screen size, screen resolution, device language, CPU information), network type, collapse log, use when pushing messages, push messages, SDK machine collection, https:///www.jiguang.cn/en/license/privacy", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Shenzhen Hexunhua Information Technology Co., Ltd. Aurora android version, baseband version, device model, equipment name, UUID, OAID, SIM information (national identification code), developer anonymous device logo, application anonymous device identifier, Android advertisingIdentification, device information (mobile phone time zone, mobile phone brand, screen size, screen resolution, device language, CPU information), network type, and collapse log when pushing messages SDK/en/livense/privacy"}
{"task": "rw_127.jsonl", "id": 77138, "text": "Alipay (China) Network Technology Co., Ltd., Alipay Payment, IMEI/IMSI, SIM card serial number/MAC address, Android_id, network information, use Alipay payment when users use Alipay, help users use Alipay in the application, SDK This machine, and use the SDK.https://opendocs.alipay.com/open/01g6qm", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Alipay (China) Network Technology Co., Ltd. Alipay Payment IMEI/IMSI, SIM card serial number/MAC address, Android_id, network information uses Alipay payment when users use Alipay to help users use Alipay SDK in the application HTTPS: // OpenDOCS.alipay.com/open/01g6qm"}
{"task": "rw_127.jsonl", "id": 77139, "text": "Beijing Weimeng Chuangke Network Technology Co., Ltd., Weibo SDK, Android ID, use when users share content to Weibo, help users share content to third -party applications, sdk this machine collection, https://weibo.com/signup/v5/privacy", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Beijing Weimeng Chuangke Network Technology Co., Ltd. Weibo SDK Android ID uses the content when users share the content to Weibo to help users share content to third -party application SDK."}
{"task": "rw_127.jsonl", "id": 77140, "text": "Beijing Jiyun Technology Co., Ltd., Trackingio, SDK (Android, iOS), iOS advertising identifier (IDFA and IDFV), Android advertising labels (ID), network card address (MAC), IP address, international mobile devicesIdentification code (IMEI), mobile device recognition code (Meid), anonymous device identification code (OAID), device model, terminal manufacturer, terminal equipment operating system version, IP address, when tracking advertising effects, advertising effect analysis, SDK This machine, this machine This machine, this machine This machine is based on the machine.Collection, https://www.trackingio.com/#/policy", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Beijing Jiyun Technology Co., Ltd. Trackingio SDK (Android, iOS) IOS IOS advertising identifier (IDFA and IDFV), Android advertisement label (Android ID), network card address (MAC), IP address, international mobile device recognition code (IMEI), Mobile device recognition code (MEID), anonymous device identification code (OAID), equipment model, terminal manufacturer, terminal equipment operating system version, IP address tracking advertising effect, advertising effect analysis SDK collection HTTPS: //www.trackingio.com/#/Policy"}
{"task": "rw_127.jsonl", "id": 77141, "text": "China Information and Communication Research Institute Ter Terminal Laboratory, Mobile Security Alliance, mobile smart terminal supplementary equipment logo system uniformly call SDK, anonymous device identifier (OAID), when tracking advertising effects, advertising effect analysis, SDK collection, www.msa-alliance.cn/col.jsp?id=120", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "China Information and Communication Research Institute Ter Terminal Laboratory and Mobile Security Alliance Mobile Intelligent Terminal Supplementary Equipment Identification System Uniformly calls the SDK anonymous device identifier (OAID) to track the advertising effect. Advertising effect analysis SDK This machine collects www.msa- alliance.cn/col.jsp? ID = 120"}
{"task": "rw_127.jsonl", "id": 77142, "text": "Alibaba Cloud Computing Co., Ltd., Alibaba Cloud Performance Certification SDK, device information (including equipment models, operating system versions, device settings, MAC addresses and IMEI, IDFA and other feature information, equipment environment and other characteristics), facial features, real persons, real personsUse when authentication identity, face recognition and real person verification, SDK collection, https://help.aliyun.com/document_detail/171604.html#tital-FGG-J3S-4SR", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Alibaba Cloud Computing Co., Ltd. Alibaba Cloud Performance SDK Equipment Information (including feature information such as device models, operating system versions, device settings, MAC addresses and IMEI, IDFA and other feature informationUse human face recognition and real person verification SDK to collect https://help.aliyun.com/document_detail/171604.html#tital-fgg-J3S-4S"}
{"task": "rw_127.jsonl", "id": 77143, "text": "Wuhan Jiyi Network Technology Co., Ltd., polar test SDK, application name, power status, equipment version, network type, network environment, national, screen height, device information (classification, name, model, pixel), SDK version number, SDK version number, Whether to jailbreak, memory size, system type, system version, APP version, time stamp, installation unique logo, the speed of application, the speed of the clicks, iOS, unique: device horizontal and vertical screen, Android, unique, uniquely unique: Simulator information, battery index, whether there is a power supply in the device, before the user's account login or send a mobile phone/SMS verification code, log in verification function, SDK machine collection, http://www.geetest.com/private", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Wuhan Jiyi Network Technology Co., Ltd. Jiqi SDK application name, power status, equipment version, network type, network environment, national, screen height, device information (classification, name, model, pixel) version number, SDK version number, whether, whetherJailbreak, memory size, system type, system version, APP version, time stamp, installation unique logo, unique logo, the speed of cursor movement, click location, iOS unique: device horizontal vertical screen, Android unique: simulator information: emulator information, Whether the battery index, whether there is a power user account login or sending a mobile phone/SMS verification code before logging in to the verification function SDK This machine collection http://www.geetest.com/private"}
{"task": "rw_127.jsonl", "id": 77144, "text": "Shanghai Youkun Information Technology Co., Ltd., Share, SDK, System Version, Equipment Model, Equipment Manufacturer, Available Memory Storage Space, Operator Information, Current Access Network Information, Current Available WIFI Network Information, GPSWhen sharing, content sharing, SDK This machine collection, https://www.mob.com/about/policy", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Shanghai Youkun Information Technology Co., Ltd. Share SDK system version, device model, equipment manufacturer, available memory, available disk storage space, operator information, current access network information, current available WIFI network information, GPS users for content sharing when sharing content sharingSDK This machine collects https://www.mob.com/about/policy"}
{"task": "rw_127.jsonl", "id": 77145, "text": "Shenzhen Tencent Computer System Co., Ltd., Bugly, log information, device ID, networking information, system name, system version, when the positioning collapse, collect collapse information, sdk this machine collection, https://privacy.qq.com/document/Preview/FC748B3D96224FDB825EA79E132C1A56", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Shenzhen Tencent Computer System Co., Ltd. Bugly log information, device ID, networking information, system name, system version of the collapse of collapse information SDK This machine collection https://privacy.qq.com/documew/fc748b3d9625EA79E132C1A 56"}
{"task": "rw_127.jsonl", "id": 77146, "text": "ROM's unique identification, device screen resolution, system startup time, whether it runs in simulator, language area, remaining memory, remaining built -in and external SD card space capacity, installed APK information, running process information, host files, SDList of files under the cache catalog, after user login account, use during the game, anti-cheating, SDK This machine collection, https://www.anticheatexpert.com/doc-doc-8fc4c119534672881bc4010698921", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Shenzhen Tencent Computer System Co., Ltd. MTP (ACE) device model, system version, IMEI, IMSI, Android ID, MAC address, network type, WIFI name, nearby WIFI name, brand, CPU architecture, whether ROOT, ROM is the only oneIdentification, device screen resolution, system startup time, whether to run in simulator, language area, remaining memory, remaining built -in and external SD card space capacity, installed APK information, running process information, host files, SD card application cache should be cachedAfter the file list in the directory, after the user login the account, use the anti-cheating SDK to collect https://www.anticheatexpert.com/doc-doc-8FC4C46A2C74E472CA4010698921"}
{"task": "rw_127.jsonl", "id": 77147, "text": "3.1.6 If you obtain software and access the Mikhayou service through the non -Mihayou platform such as the game joint transportation channel (such as brand mobile phones or third -party app stores), some channels will access the joint transport channel SDK in the software, and use it.Log in to our game products through this channel to achieve payment and real -name system functions.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Access services through game joint transportation channels, some channels will access the joint transport channel SDK in the software"}
{"task": "rw_127.jsonl", "id": 77148, "text": "In order to ensure that you can log in to the game product and use related services, you need to authorize the channel Fang SDK to provide the corresponding services;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to successfully log in to the game product and use related services, the authorized channel side SDK needs to provide the corresponding services;"}
{"task": "rw_127.jsonl", "id": 77149, "text": "After you authorize, the channel party will collect your relevant personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After the authorization, the channel party will collect your related personal information"}
{"task": "rw_127.jsonl", "id": 77150, "text": "Regarding the types of information, use, personal information protection rules and exit mechanism collected by the channel party, please understand according to the specific transport channels of your software, refer to the codes of the council SDK privacy policy in the table below, and understand the specific collection of users of the channel SDKInformation and scope of use, and the legal responsibility it bear.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77151, "text": "That is, if the channel you obtain the software is Xiaomi App Store, the corresponding channel SDK is Xiaomi SDK, and so on.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77152, "text": "The name of a third -party company, product/service, involved personal information, use scenarios, use purpose, sharing method, third -party link", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Third -party company name products/services involve personal information use scenarios to use the purpose of sharing method of third -party links"}
{"task": "rw_127.jsonl", "id": 77153, "text": "Beijing Wali Network Technology Co., Ltd., Xiaomi SDK, personal common equipment information (including hardware serial number, hardware model, equipment MAC address, operating system type, software list, unique device identification code)Use real -name services, provide account login, ⽀ payment, and real -name service, SDK This machine collection, https://privacy.mi.com/xiaomigame/zh_cn/", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "119 of 264 Beijing Wali Network Technology Co., Ltd. Xiaomi SDK personal common equipment information (including hardware serial number, hardware model, device MAC address, operating system type, software list, unique device recognition code) Xiaomi channel provides account login, ⽀ payment, and payment, and payment and paymentWhen real -name services, use account login, ⽀ 实, and real -name service SDK to collect https://privacy.mi.com/xiaomigame/zh_cn/"}
{"task": "rw_127.jsonl", "id": 77154, "text": "Shanghai Kuanyu Digital Technology Co., Ltd., Bilibili, SDK, personal commonly used equipment information (including hardware serial number, hardware model, equipment MAC address, operating system type, software list, unique device recognition code), Bilibili channel provides account login login login, Payment and real-name services, provide account login, payment and real-name service, SDK This machine collection, https://www.bilibili.com/blackboard/privacy-html", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Shanghai Kuanyu Digital Technology Co., Ltd. Bilibili SDK Personal common equipment information (including hardware serial number, hardware model, equipment MAC address, operating system type, software list, unique device recognition code) Bilibili channel provides account login, payment, real -name system system systemUse account login, payment, and real-name service SDK to collect https://www.bilibili.com/blackboard/privacy-pc.html"}
{"task": "rw_127.jsonl", "id": 77155, "text": "3.1.7 We provide you with a link to connect to the Mihayou service through SMS, so that you can access the Mihayou service through the third -party platform (such as the game joint transportation channel);", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77156, "text": "3.1.8 Tips on sharing information", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77157, "text": "Some of the Mihayou service functions we provide allows you to share your relevant information with all users who also use the service.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77158, "text": "Including the information you uploaded or published in the Mihayou service (including your personal information, your photos), the response to the information you uploaded or published by others, and the location related to this informationData and log information.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77159, "text": "Other users who use Mihayou services may also share information related to you (including location data and log information).", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77160, "text": "Especially in our APP chat system, it is designed to allow you to share information with other users, so that the shared information can be passed in real time and extensively.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77161, "text": "As long as you do not delete the shared information, the relevant information has always left the public field;", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77162, "text": "Even if you delete sharing information, the relevant information may still be cached, replicated or stored independently by other users or the third party that is not controlled by us, or is preserved by other users or such third parties in the public.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Even if the shared information is deleted, the relevant information may still cache, copy or store it independently, or save it in the public field."}
{"task": "rw_127.jsonl", "id": 77163, "text": "Therefore, please consider the content of uploading, publishing and communicating through our products or services.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77164, "text": "You can also control the scope of user -sharing information through the privacy settings of some of our services.", "label": ["Third Party Sharing/ Disclosure", "Important", "Edit/Control"], "rewrite": "You can control the privacy setting of some of our services to control the scope of the user of your shared information"}
{"task": "rw_127.jsonl", "id": 77165, "text": "3.2 How do we transfer your information", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77166, "text": "With the sustainable development of our business, we may conduct merger, acquisition, asset transfer or similar transactions, and your information may be transferred as part of such transactions.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Personal information may be transferred as a part of merger, acquisition, asset transfer or similar transactions."}
{"task": "rw_127.jsonl", "id": 77167, "text": "We will inform you that the relevant situation will continue to protect your personal information in accordance with the laws and regulations and not lower than the standards required by the Privacy Policy.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77168, "text": "3.3 How do we disclose your information", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77169, "text": "We will only disclose your information only under the following circumstances and adopt the premise that we meet the industry standards:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Under the premise of following the following circumstances and taking safety protection measures, disclose your information:"}
{"task": "rw_127.jsonl", "id": 77170, "text": "1) After getting your clear consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After getting your clear consent, disclose personal information"}
{"task": "rw_127.jsonl", "id": 77171, "text": "2) In the case of compulsory requirements of legal, legal procedures, litigation, or government authorities, we may publicly disclose your personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the case of compulsory requirements of legal, legal procedures, litigation, or government authorities, personal information may be disclosed publicly"}
{"task": "rw_127.jsonl", "id": 77172, "text": "3.4 No need to authorize sharing, transfer, disclosure", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77173, "text": "According to relevant laws and regulations and national standards, in the following circumstances, we may share, transfer, and publicly disclose personal information without obtaining your authorization consent in advance:", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "In the following circumstances, it may be shared, transferred, and publicly disclosed that personal information does not need to obtain your authorization consent in advance:"}
{"task": "rw_127.jsonl", "id": 77174, "text": "1) Directly related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Sharing personal information directly related to national security and national defense security, no need to agree"}
{"task": "rw_127.jsonl", "id": 77175, "text": "2) Directly related to public safety, public health, and major public interests;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Personal information directly related to public safety, public health, and major public interests."}
{"task": "rw_127.jsonl", "id": 77176, "text": "3) Directly related to criminal investigation, prosecution, trial and judgment execution;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Direct related personal information such as sharing directly related to crime investigation, prosecution, trial, and judgment execution, no need to agree"}
{"task": "rw_127.jsonl", "id": 77177, "text": "4) For major legitimate rights and interests such as the life and property of the subject of personal information or other individuals, it is difficult to get my consent;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Share and maintain major legitimate rights and interests, but it is difficult to get personal information that I agree, no need to agree"}
{"task": "rw_127.jsonl", "id": 77178, "text": "5) The subject of personal information disclose personal information to the public by itself;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Share personal information disclosed to the public by yourself, no need to agree"}
{"task": "rw_127.jsonl", "id": 77179, "text": "6) Collect personal information from legal public information, such as legal news reports and government information disclosure.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Personal information collected from the information disclosed by legal publicly, no need to agree"}
{"task": "rw_127.jsonl", "id": 77180, "text": "3.5 How do we retain, store and protect your information", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77181, "text": "We only retain your personal information during the time limit for the purpose of the \"Privacy Policy\" and the time limit required by laws and regulations.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "Reserved your personal information only during the necessary period of the \"Privacy Policy\" and the time limit required by laws and regulations"}
{"task": "rw_127.jsonl", "id": 77182, "text": "We will take the following means to protect your information:", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77183, "text": "3.5.1 Data security technical measures.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77184, "text": "We use various security technologies and procedures to prevent information loss, improper use, unauthorized reading or disclosure.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77185, "text": "Including, in certain services, we will use encryption technology to protect the personal information you provide to us.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77186, "text": "Due to the technical restrictions and the limitations of risk prevention, even if we have tried to strengthen security measures, we cannot always ensure that information is 100 % security.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77187, "text": "I hope you can understand that your system and communication networks used in your products or services may have problems due to the situation outside the control scope.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77188, "text": "3.5.2 We have taken other security measures to protect your personal information.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77189, "text": "We manage the storage and use of information by establishing a data classification classification system, data security management specifications, and data security development specifications;", "label": ["Important", "Data Security"], "rewrite": "Establish data classification hierarchical system, data security management specifications, data security development specifications to manage the storage and use of information"}
{"task": "rw_127.jsonl", "id": 77190, "text": "Our confidentiality agreement, monitoring and auditing mechanism through information contacts to comprehensively control the data;", "label": ["Important", "Data Security"], "rewrite": "Through information contacts confidentiality agreements, monitoring and auditing mechanisms to make comprehensive security control of data"}
{"task": "rw_127.jsonl", "id": 77191, "text": "By strengthening the awareness of security and strengthening employees' awareness of protecting the importance of information;", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77192, "text": "We only allow Miha tourists and partners to visit your information, and we have set up strict access to control and monitoring mechanisms for this reason;", "label": ["Important", "Data Security"], "rewrite": "Only allowed Miha and partners to visit your information for this information only to be allowed to visit your information and set up strict access to control and monitoring mechanism"}
{"task": "rw_127.jsonl", "id": 77193, "text": "We also require all personnel who may contact your information to fulfill the corresponding confidentiality obligations.", "label": ["Important", "Data Security"], "rewrite": "At the same time, all personnel who may be exposed to your information fulfill the corresponding confidentiality obligations"}
{"task": "rw_127.jsonl", "id": 77194, "text": "We will strive to ensure that the aforementioned personnel complies with the \"Privacy Policy\" and other appropriate confidentiality measures and security measures we ask them to follow.Termid the cooperative relationship with Mihayou.", "label": ["Important", "Data Security"], "rewrite": "Ensure that the aforementioned personnel complies with this \"Privacy Policy\" and other appropriate confidentiality and security measures when they are exposed to personal information."}
{"task": "rw_127.jsonl", "id": 77195, "text": "3.5.3 Please understand that we will try our best to ensure the security of your personal information, but the Internet environment is not 100 % security.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77196, "text": "Due to the technical restrictions and the limitations of risk prevention, even if we have tried to strengthen security measures, we cannot always ensure that information is 100 % security.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77197, "text": "I hope you can understand that your system and communication networks used in your products or services may have problems due to the situation outside the control scope.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77198, "text": "If security incidents such as personal information leakage occur, we will start emergency plans to prevent security incidents from expanding.", "label": ["Important", "Data Security"], "rewrite": "Safety events such as personal information leakage will start emergency plans to prevent the expansion of security incidents"}
{"task": "rw_127.jsonl", "id": 77199, "text": "After the security incident occurs, we will inform you the basic situation of the security incident in the form of announcement, push notification emails, and SMS, and we are about or already adopted.", "label": ["Important", "Data Security"], "rewrite": "After the security incident occurs, the basic situation, disposal measures, remedial measures, and response suggestions will be informed by announcement, push notification emails, SMS forms."}
{"task": "rw_127.jsonl", "id": 77200, "text": "If it is difficult to achieve one by one, we will issue warnings by announcement.", "label": ["Important", "Data Security"], "rewrite": "If it is difficult to achieve one by one, we will issue warnings by announcement."}
{"task": "rw_127.jsonl", "id": 77201, "text": "3.5.4 Method and period of information storage.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77202, "text": "We guarantee that we collect and generate personal information in the territory of the People's Republic of China will be stored in the People's Republic of China.", "label": ["Data Retention", "Important"], "rewrite": "The personal information we collected and generated in the People's Republic of China will be stored in the People's Republic of China."}
{"task": "rw_127.jsonl", "id": 77203, "text": "We will not transfer your personal information out of the country without obtaining your explicit authorization, the clear stipulation of laws and regulations, and the requirements of/or the requirements of/or relevant competent authorities.", "label": ["Data Retention", "Important"], "rewrite": "The requirements for not obtaining explicit authorization, laws and regulations, and the requirements of/or relevant competent authorities will not transfer your personal information out of the country"}
{"task": "rw_127.jsonl", "id": 77204, "text": "We will store your information in a safe way, including local storage (using APP for data cache), database and server logs.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "It will store information through security methods, including local storage (using APP for data cache), database and server logs."}
{"task": "rw_127.jsonl", "id": 77205, "text": "We guarantee that you will only store your personal information within the time required for service purposes or the conditions and periods stipulated by laws and regulations.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "You will only store your personal information within the time necessary for the service purpose or the conditions and periods stipulated in the law and regulations."}
{"task": "rw_127.jsonl", "id": 77206, "text": "After below the above storage period, we will delete or processes your personal information.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "After exceeding the above storage period, personal information will be deleted or anonymous."}
{"task": "rw_127.jsonl", "id": 77207, "text": "However, you exercise the right to delete the right to delete, cancel accounts or other laws and regulations (for example: the \"E -commerce Law\" stipulates that the saving time of goods and service information and transaction information is not less than three years from the date of the transaction completion).", "label": ["Data Retention", "Important", "Risk"], "rewrite": "However, except for exercising the right to delete, canceling accounts or other laws and regulations"}
{"task": "rw_127.jsonl", "id": 77208, "text": "4. How to manage your information", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77209, "text": "4.1 Personal information query.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77210, "text": "When you need to query your information, you can check your personal information binding and other information through the Mida Travel Pass account system https://user.mihoyo.comBinding the mobile phone.", "label": ["Important", "Edit/Control"], "rewrite": "You can check the personal information binding of personal information"}
{"task": "rw_127.jsonl", "id": 77211, "text": "Before the inquiry, we may ask you to verify your identity to ensure information security.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77212, "text": "For specific operation methods, you can log in to the Mihayou Pass account system https://user.mihoyo.com, or operate in accordance with the specific guidelines of the single service, we will handle your request within 15 working days.", "label": ["Important", "Edit/Control"], "rewrite": "Log in to Mihayou Pass account system https://user.mihoyo.com, we will handle your request within 15 working days"}
{"task": "rw_127.jsonl", "id": 77213, "text": "4.2 Personal information correction.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77214, "text": "When you need to correct your information, you can modify and.Essence", "label": ["Important", "Edit/Control"], "rewrite": "Correct the corresponding information through the Mihayou Pass account system https://user.mihoyo.com"}
{"task": "rw_127.jsonl", "id": 77215, "text": "Before correction, we may ask you to verify your identity to ensure information security.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77216, "text": "For specific operation methods, you can operate by logging in to the Mihayou Pass account system https://user.mihoyo.com or according to the specific guidelines of the single service. We will handle your request within 15 working days.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77217, "text": "4.3 Copy for personal information.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77218, "text": "When you need to obtain your personal information copy, you can check your personal information binding through the Mikhayou Pass account system https://user.mihoyo.com and obtain the corresponding information.", "label": ["Important", "Edit/Control"], "rewrite": "Inquire about personal information binding through the Mihayou Pass account system https://user.mihoyo.com"}
{"task": "rw_127.jsonl", "id": 77219, "text": "At the same time, through the above -mentioned Mihayou Pass account account system https://user.mihoyo.com, you can also access your information and obtain a copy of the avatar, nickname, gender, birthday, and binding mobile phone.", "label": ["Important", "Edit/Control"], "rewrite": "Access personal information"}
{"task": "rw_127.jsonl", "id": 77220, "text": "Before obtaining a copy, we may ask you to verify your identity to ensure information security.", "label": ["Important", "Edit/Control"], "rewrite": "Before obtaining a copy, a verification is performed to ensure information security."}
{"task": "rw_127.jsonl", "id": 77221, "text": "For specific operation methods, you can operate by logging in to the Mihayou Pass account system https://user.mihoyo.com or according to the specific guidelines of the single service. We will handle your request within 15 working days.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77222, "text": "4.4 Delete your personal information", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77223, "text": "In the following circumstances, you can make a request to delete personal information:", "label": ["Important", "Edit/Control"], "rewrite": "In the following circumstances, you can make a request to delete personal information:"}
{"task": "rw_127.jsonl", "id": 77224, "text": "1) If our behavior of handling personal information violates laws and regulations;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77225, "text": "2) If we collect and use your personal information, it has not obtained your consent;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77226, "text": "3) If our behavior of handling your personal information violates this \"Privacy Policy\";", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77227, "text": "4) If you no longer use Mihayou service, or you cancel your account;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77228, "text": "5) If we no longer provide you with Mihayou service.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77229, "text": "You can contact us by applying an internal information interface (Pai Meng avatar) -Fedback-Submit feedback-contact customer service or call customer service 400-666-6312 to contact us. We will answer your request within 15 working days.", "label": ["Important", "Contact Information", "Edit/Control"], "rewrite": "You can contact us by applying an internal information interface (Pai Meng avatar) -Fedback-Submit feedback-contact customer service 400-666-6312 to contact us"}
{"task": "rw_127.jsonl", "id": 77230, "text": "If we decide to respond to your deletion request, we will also notify the third parties that obtain your personal information from our personal information, asking them to delete timely, unless the laws and regulations have an agreement, or the third party has obtained your separate authorization.", "label": ["Important", "Edit/Control"], "rewrite": "If you decide to respond to the deletion request, it will also notify the third parties to delete in time, unless the laws and regulations have another agreement, or the third party has obtained your separate authorization."}
{"task": "rw_127.jsonl", "id": 77231, "text": "When you delete the information from our services, we may not immediately delete the corresponding information in the backup system, but will delete these information when the backup is updated.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "When the information is deleted, the corresponding information may not be deleted immediately in the backup system, but this information will be deleted when the backup update"}
{"task": "rw_127.jsonl", "id": 77232, "text": "4.5 Change the scope of your authorization consent or revoke your authorization consent", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77233, "text": "If such authorizations are not necessary to use the Mikhayou service, you can use the internal information interface (Pai Meng avatar)-Feedback-Submit feedback-contact customer service or call customer service 400-666-6312 to contact us to some personal informationChange or revoke your authorization consent.", "label": ["Edit/Control", "Contact Information", "Important"], "rewrite": "If such authorization consent is not necessary, you can contact us by applying an internal information interface-feedback-submission feedback-contact customer service or dialing customer service 400-666-6312 to contact us to change or revoke the authorization consent of some personal information."}
{"task": "rw_127.jsonl", "id": 77234, "text": "We will answer your request within 15 working days.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77235, "text": "When you revoke the authorization consent, we will no longer deal with the corresponding personal information, but your decision to revoke the authorization consent will not affect personal information processing carried out based on your authorization.", "label": ["Permission Acquisition", "Edit/Control", "Risk", "Important"], "rewrite": "After revoking the authorization consent, the corresponding personal information will no longer be processed, but it will not affect the personal information processing that was previously authorized"}
{"task": "rw_127.jsonl", "id": 77236, "text": "4.6 Logging out", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77237, "text": "You have the right to cancel the Midyou service account.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77238, "text": "We provide you with the way to cancel the Mihayou service account. You can make a request through the application of internal information interface (Pai Meng avatar) -The settings-account-user center-cancellation or dialing customer service 400-666-6312.", "label": ["Important", "Contact Information", "Edit/Control"], "rewrite": "Through the application of the internal information interface (Pai Meng avatar) -Setting-account-user center-cancellation or call customer service phone 400-666-6312 to make a request."}
{"task": "rw_127.jsonl", "id": 77239, "text": "After you cancel the Mihayou service account, you will no longer log in and use Mihayou services with this account;", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77240, "text": "The equity that has been generated during the use of Mihayou's service but not consumed will be cleared;", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77241, "text": "The content, information, data, records, etc. under the account will be deleted or anonymized (unless otherwise stipulated by laws and regulations or otherwise required by regulatory authorities);", "label": ["Important", "Edit/Control"], "rewrite": "The content, information, data, records, etc. under the account will be deleted or anonymized (unless otherwise stipulated by laws and regulations or otherwise required by regulatory authorities);"}
{"task": "rw_127.jsonl", "id": 77242, "text": "At the same time, once the Mihayou service account is canceled, it will not be recovered.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Once the Mihayou service account is canceled, it will not be recovered."}
{"task": "rw_127.jsonl", "id": 77243, "text": "The processing period for account cancellation is 15 working days.", "label": ["Important", "Edit/Control"], "rewrite": "The processing period for account cancellation is 15 working days."}
{"task": "rw_127.jsonl", "id": 77244, "text": "When you choose to cancel the Midyou service account, or, when the \"User Service Agreement\" that meets Mihayou's single services occurs, or stipulated in relevant national laws and regulations, your Mihayou service account will beLogging out.", "label": ["Important", "Edit/Control"], "rewrite": "When you choose to cancel, or when the \"User Service Agreement\" lists, or the relevant national laws and regulations, your Mihayou service account will be canceled."}
{"task": "rw_127.jsonl", "id": 77245, "text": "When the account is canceled, we will delete your personal information according to your requirements, except for other provisions of laws and regulations.", "label": ["Important", "Edit/Control"], "rewrite": "When the account is canceled, you will delete your personal information, except for other provisions of laws and regulations."}
{"task": "rw_127.jsonl", "id": 77246, "text": "4.7 respond to your above request", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77247, "text": "4.7.1 To ensure safety, you may need to provide written requests or prove your identity in other ways.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77248, "text": "We may ask you to verify your identity first, and then process your request.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77249, "text": "We will answer within 30 days.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77250, "text": "If you are not satisfied, you can also contact us and complain through the contact information released by Article 9 of the Privacy Policy.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77251, "text": "For your reasonable request, we do not charge fees in principle, but we will charge a certain cost fee depending on the request that repeats and beyond the reasonable limit.", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "For reasonable requests, no fee is charged in principle, but for repeated requests that exceed reasonable limits, a certain cost will be charged depending on the situation."}
{"task": "rw_127.jsonl", "id": 77252, "text": "For those that are unreasonably repetitive, require excessive technical means (for example: requiring the development of new systems or fundamental changes in existing practices), pose risks to the legitimate rights and interests of others, or are very impractical (for example: involving information stored on backup tapes) request, we may deny it.", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "It may be rejected to reject the risk or unrealistic request for the repetition of the unseen, the need for too many technical means, the risk or unrealistic request to the legitimate rights and interests of others."}
{"task": "rw_127.jsonl", "id": 77253, "text": "4.7.2 In the following circumstances, we will not be able to respond to your request:", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "In the following circumstances, we will not be able to respond to your request:"}
{"task": "rw_127.jsonl", "id": 77254, "text": "1) What is related to the obligation stipulated in the performance of personal information controller;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "If it is related to the obligation stipulated by the personal information controller to fulfill the law and regulations, the request cannot be responded to the request"}
{"task": "rw_127.jsonl", "id": 77255, "text": "2) Directly related to national security and national defense security;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Those who are directly related to national security and national defense security cannot respond to requests"}
{"task": "rw_127.jsonl", "id": 77256, "text": "3) Directly related to public safety, public health, and major public interests;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Those who are directly related to public safety, public health, and major public interests cannot respond to requests"}
{"task": "rw_127.jsonl", "id": 77257, "text": "4) Directly related to criminal investigation, prosecution, trial and execution of judgments;", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "Those who are directly related to criminal investigation, prosecution, trial, and execution judgments cannot respond to request"}
{"task": "rw_127.jsonl", "id": 77258, "text": "5) The personal information controller has sufficient evidence to show that the personal information subject has subjective malice or abuse of rights;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Personal information controller has sufficient evidence to indicate that the subject of personal information has subjective malice or abuse of rights, and cannot respond to the request"}
{"task": "rw_127.jsonl", "id": 77259, "text": "6) For major legitimate rights and interests such as the life and property of the subject of personal information or other individuals, it is difficult to get my consent;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "If you maintain major legitimate rights and interests, but it is difficult to get your consent, you cannot respond to the request"}
{"task": "rw_127.jsonl", "id": 77260, "text": "7) The request to respond to the subject of the personal information will cause the legitimate rights and interests of the personal information subject or other individuals and organizations to be seriously damaged;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "In response to the request of the subject of the personal information, if the legitimate rights and interests are severely damaged, the request cannot be responding to"}
{"task": "rw_127.jsonl", "id": 77261, "text": "Involved in business secrets.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77262, "text": "5. Cookies policy", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77263, "text": "Cookie is a neutral technology that allows website server to store data on the client or read data from the client.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77264, "text": "Safe cookies can provide you with more convenient services when surfing the Internet.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77265, "text": "By using cookies, Mihayou provides users with a simple and easy network experience.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77266, "text": "We may collect and use your information through cookies and store these information.", "label": ["Data Retention", "Important", "First Party Collection Information"], "rewrite": "Collect and use your information through cookies and store these information."}
{"task": "rw_127.jsonl", "id": 77267, "text": "We use cookies to remember your identity and log in for your user.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77268, "text": "You can reject cookies through the user selection mechanism, such as the browser settings. If you choose to refuse, you will not be able to log in to the Miha You Pass.", "label": ["Edit/Control", "Important"], "rewrite": "You can refuse cookies through the user selection mechanism, such as the browser settings. If you choose to refuse, you will not be able to log in to the Mihayou Pass"}
{"task": "rw_127.jsonl", "id": 77269, "text": "6. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77270, "text": "MiHoYo attaches great importance to the information security and protection of minors. We implement the anti-addiction system in accordance with the relevant national anti-addiction policies and requirements.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77271, "text": "We will determine whether the real -name information of the relevant account is a minor and your age through the real -name information verification, and then decide whether this account is included in the anti -addiction system.", "label": ["Specific Audiences", "Important"], "rewrite": "It will determine whether it is a minor and your age interval through real -name information verification, and then decide whether this account is included in the anti -addiction system."}
{"task": "rw_127.jsonl", "id": 77272, "text": "In addition, we will collect your login time, game duration information to judge and decide to take anti -addiction measures, guide minors to make reasonable games, and try to contact their guardians to remind, confirm and handle it after suspected minors consumption to helpMinors are healthy online.", "label": ["Specific Audiences", "First Party Collection Information", "Important"], "rewrite": "Will collect your login time, game time information to judge and decide to take anti -addiction measures"}
{"task": "rw_127.jsonl", "id": 77273, "text": "If you are a guardian under the age of 14, when you have any questions about your service you use our service or the user information you provide to us, please\"The contact information provided in time to contact us in time.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77274, "text": "We will protect the confidentiality and security of children's user information in accordance with relevant national laws and regulations and the provisions of the \"Personal Information and Privacy Protection Policy of the original God Children\".", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77275, "text": "Mihayou has a full -time department of personal information protection and designated the person in charge of specialized child personal information protection. It will protect personal information in accordance with the \"Personal Information and Privacy Protection Policy of the original God Children\".", "label": ["Specific Audiences", "Important"], "rewrite": "Mihayou has the full -time department of personal information protection and designated the person in charge of the special child personal information protection"}
{"task": "rw_127.jsonl", "id": 77276, "text": "If guardians and children have complaints about network information security, or have any questions, comments or suggestions about the \"Yuanshin Children's Personal Information and Privacy Protection Policy\" and/or MiHoYo's rules and measures for children's personal information protection , please feel free to contact us through the minor growth care hotline 021-60371740.", "label": ["Specific Audiences", "Contact Information", "Important"], "rewrite": "At any time, contact us through minor growth care hotline 021-60371740"}
{"task": "rw_127.jsonl", "id": 77277, "text": "7. Change of privacy policy changes", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77278, "text": "We may revise policies in a timely manner.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77279, "text": "When the terms change, we will show you the change of privacy policy after you log in, pop -up notification, pop -up or other appropriate forms.", "label": ["Policy Change", "Important"], "rewrite": "When the clause is changed, the privacy policy after the change of notification, pop -up window or other appropriate forms will be used when logging in"}
{"task": "rw_127.jsonl", "id": 77280, "text": "8. Other regulations", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77281, "text": "8.1 As any clause in this \"Privacy Policy\", regardless of whether it is completely or partially invalid or not executive, the remaining terms of this \"Privacy Policy\" should still be valid and binding and executive.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77282, "text": "8.2 The titles of all the terms of the Privacy Policy are only for easy reading. There is no actual meaning in itself. It cannot be used as the basis for explaining the meaning of this \"Privacy Policy\" and the meaning of related terms.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77283, "text": "8.3 Mita Traveling does not exercise, fails to exercise in time, or fails to fully exercise this agreement or the rights enjoyed in accordance with the laws and regulations. It should not be considered to abandon the right, nor does it affect Mihayou in the future to exercise such rights.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77284, "text": "8.4 Mihayou retains the relevant rights of the amendment, supplementing, deleting and updating the relevant rights of this \"Privacy Policy\".", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77285, "text": "8.5 This \"Privacy Policy\" is enforced, fulfilled, explained, and controversial resolution. The laws of the People's Republic of China are applicable and the application of all his conflict law is excluded.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77286, "text": "This agreement is established in Xuhui District, Shanghai.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77287, "text": "If the two parties have any controversy in the content of the \"Privacy Policy\" or their execution, the two parties should be friendly and negotiated;", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77288, "text": "When the negotiation fails, the two parties agreed to be handed over to the Shanghai Xuhui District People's Court and handled it.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77289, "text": "Nine, contact information", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77290, "text": "If you have any opinions or suggestions on this \"Privacy Policy\" or other personal information protection related matters, you can contact our data protection team through the official customer service contact information published by Mihayou or the following contact information. We will give you the necessary helpThe", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77291, "text": "Contact email: privacy@mihoyo.com", "label": ["Important", "Edit/Control"], "rewrite": "Contact email: privacy@mihoyo.com"}
{"task": "rw_127.jsonl", "id": 77292, "text": "We will review the problems involved as soon as possible and deal with it in time after verifying our identity.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77293, "text": "Shanghai Mihayou Ying Tie Technology Co., Ltd.", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77294, "text": "Customer service phone 400-666-6312", "label": ["Important", "Edit/Control"], "rewrite": "Customer service phone 400-666-6312"}
{"task": "rw_127.jsonl", "id": 77295, "text": "Unit 103, 1st Floor, No. 83, Building, No. 700, Yishan Road, Xuhui District, Shanghai", "label": ["Important", "Contact Information"], "rewrite": "Unit 103, 1st Floor, No. 83, Building, No. 700, Yishan Road, Xuhui District, Shanghai"}
{"task": "rw_127.jsonl", "id": 77296, "text": "Release date: August 24, 2022", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77297, "text": "Latest version Effective Date: August 24, 2022", "label": [], "rewrite": []}
{"task": "rw_127.jsonl", "id": 77298, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
