{"task": "rw_18.jsonl", "id": 43535, "text": "User Privacy Policy (detailed version)", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43536, "text": "\"China Telecom Business Hall APP\" (referred to as \"this APP\") was owned and operated by China Telecom Co., Ltd. (referred to as \"we\"). Our registered address is: No. 99, Xingshikou Road, Haidian District, BeijingBuilding.", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43537, "text": "In the process of registering and using this APP, we may collect and use your relevant information.", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43538, "text": "This \"User Privacy Policy\" (referred to as \"this privacy policy\" or \"this policy\") aims to explain the rules of this app to handle your personal information, including but not limited to your personal information, collect, store and use youPersonal information and methods, and how you exercise your privacy rights.", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43539, "text": "Please carefully read and fully understand all the contents of this policy before using this APP, especially the content that is significantly identified by the font boldness.", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43540, "text": "If you have any questions about this privacy policy, please contact us.", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43541, "text": "If you use or continue to use our products or services after we update our privacy policy, it means that you agree with the content of the privacy policy (including the updated version) and agree that we will process your relevant information in accordance with this privacy policy.", "label": ["Policy Change", "Important", "Risk"], "rewrite": "If you use or continue to use our products or services after we update our privacy policy, it means that you agree to be subject to this privacy policy."}
{"task": "rw_18.jsonl", "id": 43542, "text": "If you do not agree with this privacy policy or any provisions, you can choose to stop registering or stop using or cancel this APP. At the same time, this APP will no longer provide you with relevant services.", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43543, "text": "Our related companies mentioned in this privacy policy include China Telecom Group Co., Ltd. and its branches, holding subsidiaries and their branches.", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43544, "text": "This privacy policy includes the following:", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43545, "text": "1. Use the rules of user information collection and use in various business functions;", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43546, "text": "2. How do we use cookies and similar technologies;", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43547, "text": "3. How do we share, transfer, and publicly disclose your personal information;", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43548, "text": "4. How do we protect your personal information;", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43549, "text": "5. How can we save your personal information;", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43550, "text": "6. Protection of Minor Information;", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43551, "text": "Seven, your rights;", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43552, "text": "8. How to update this policy;", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43553, "text": "Nine, how to contact us.", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43554, "text": "1. User information collection and use rules in various business functions", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43555, "text": "Personal information refers to the various information related to the recognized or recognizable natural person recorded in electronics or other methods, excluding information after anonymous processing.", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43556, "text": "Sensitive personal information refers to personal information that can easily cause the personality and dignity of natural persons to be infringed or harmed by personal and property security, including biometrics, religious beliefs, specific identities, medical health, financial accounts, trajectory trajectory and other informationAnd personal information under minor at the age of 14.", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43557, "text": "When we deal with your sensitive personal information, we will solicit your authorization by pop -up window.", "label": ["Important", "Data Security"], "rewrite": "When we deal with your sensitive personal information, we will solicit your authorization by pop -up window."}
{"task": "rw_18.jsonl", "id": 43558, "text": "The purpose, use, type, frequency and timing of the information that you need to provide or allow us to collect or allow us to collect this app, and the impact of the impact on you if you refuse us to collect and process these information on you:", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43559, "text": "(1) Login function and related services", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43560, "text": "1. Account Login", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43561, "text": "When logging in to this APP account with China Telecom's mobile phone number and broadband account number (\"Telecom user\"), this APP needs to provide you with a login mobile phone number or broadband account.", "label": ["Important", "First Party Collection Information"], "rewrite": "When telecommunications users log in to this APP account, this APP needs to provide you with a login mobile phone number or broadband account."}
{"task": "rw_18.jsonl", "id": 43562, "text": "For the name of the access mobile phone number, the broadband account, the name of the network, and the information of the network, since you have provided the real -name system when you apply for the China Telecom's mobile phone number and broadband products, you don't need to fill in it again when using this APP.", "label": ["Important", "First Party Collection Information"], "rewrite": "When using this APP, you don't need to fill in the name of the login mobile phone number, broadband account name, the name of the network, and the Internet card."}
{"task": "rw_18.jsonl", "id": 43563, "text": "If telecommunications users need to change information from the Internet, please go to China Telecom's physical business hall for processing.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43564, "text": "Users who use non -China Telecom mobile phone numbers (referred to as \"non -telecommunications users\") When logging in to this APP account, this APP (1) will obtain your mobile phone number after obtaining your consent and certify your phone number and certify the secret density exemption.Log in, in addition, this app will not obtain other personal information when you are free of charge;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you log in to this APP account, non -telecommunications users will obtain your mobile phone number and be certified by your phone number."}
{"task": "rw_18.jsonl", "id": 43565, "text": "Or (2) Identity authentication through the mobile phone number and SMS verification code you entered and logged in to this APP.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43566, "text": "If you no longer use this APP, you can cancel the registered account with the path of \"I-Settings-Universal-Logging\".", "label": ["Important", "Edit/Control"], "rewrite": "If you no longer use this APP, you can cancel the registered account with the path of \"I-Settings-Universal-Logging\"."}
{"task": "rw_18.jsonl", "id": 43567, "text": "2. Login -free login", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43568, "text": "The ability to log in for telecommunications users and non -telecommunications users is for your faster login.", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43569, "text": "When you open and use this APP for the first time, we will remind you through pop -ups that you need to obtain your mobile phone number and certify the density.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you open and use this APP for the first time, we will remind you through pop -ups that you need to obtain your mobile phone number and certify the secrets."}
{"task": "rw_18.jsonl", "id": 43570, "text": "This APP preferentially uses gateway certification capabilities to obtain your mobile phone number (for non -telecommunications users, we will obtain your mobile phone number based on the relevant number certification service cooperation agreement signed with China Unicom/China Mobile to obtain your mobile phone number) Come to complete the login, at this time does not involve terminal equipment authorization;", "label": ["Important", "First Party Collection Information"], "rewrite": "This APP preferentially uses gateway certification capabilities to obtain your mobile phone number to complete the login. At this time, it does not involve terminal device authorization."}
{"task": "rw_18.jsonl", "id": 43571, "text": "If you refuse to use secret login or fail to log in, you can log in through the service password or SMS random code.", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43572, "text": "3. Human face recognition login", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43573, "text": "In order to enable you to log in to this APP safely and conveniently, you can choose to use the real celebrity face recognition login service we provided by us, and provide us with your face image or video to verify your identity;", "label": ["Important", "First Party Collection Information"], "rewrite": "You can choose to use the main real celebrity face recognition login service to provide us with your face image or video to verify your identity."}
{"task": "rw_18.jsonl", "id": 43574, "text": "Face images or videos belong to your personal sensitive information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43575, "text": "Face recognition login is only one of the login methods. If you do not need to use this function, you can also log in and use this app in other ways.", "label": ["Important", "Edit/Control"], "rewrite": "If you do not need to use face recognition login, you can also log in and use this app in other ways."}
{"task": "rw_18.jsonl", "id": 43576, "text": "4. Modify the password", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43577, "text": "When you modify this APP account password, you need to fill in your name and ID number. The name and ID number you entered is only used to modify the identity verification of the password service. This APP will not retain your input identity information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you modify this APP account password, you need to fill in your name and ID number for authentication."}
{"task": "rw_18.jsonl", "id": 43578, "text": "If you do not fill in, you will not be able to use the password to modify the service normally.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43579, "text": "We will be stored in China for the information collected by the above account login, secret login and modification of the password function.", "label": ["Data Retention", "Important"], "rewrite": "The information collected by account login, secret login and modification of password functions will be stored in China."}
{"task": "rw_18.jsonl", "id": 43580, "text": "(2) Provide you with network transaction services", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43581, "text": "If you use this APP for the network transaction services provided by you, when buying products (broadband group products) that require logistics delivery or winning prizes that require logistics delivery, this APP may require you to provide your collectionThe goods information includes: the consignee's name, the telephone number of the consignee, and the address information of the consignee.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you use this APP to provide you with network transaction services, you need to provide your delivery information."}
{"task": "rw_18.jsonl", "id": 43582, "text": "You can increase, modify and delete the retained commonly used receipt information through the path of \"I-Settings-Receiving Address\" of this APP;", "label": ["Edit/Control", "Important"], "rewrite": "You can increase, modify, and delete the retained commonly used receipt information through the path of \"I-Settings-Receiving Address\"."}
{"task": "rw_18.jsonl", "id": 43583, "text": "Or the commonly used receipt information is cleared through the path of \"I-Settings-General-Logging\".", "label": ["Important", "Edit/Control"], "rewrite": "You can remove the commonly used receipt information through the path of \"I-Settings-General-Logging\"."}
{"task": "rw_18.jsonl", "id": 43584, "text": "If you don't agree with us to collect and use the above information, we will not be able to send you goods or prizes to you, but it will not affect other services you use this app.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43585, "text": "For the above information, we will be stored in China.", "label": ["Data Retention", "Important"], "rewrite": "The receiving information will be stored in China."}
{"task": "rw_18.jsonl", "id": 43586, "text": "(3) Check in the network access of telecommunications business for you", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43587, "text": "If the telecommunications business products you order need to go through the network access procedures, in accordance with the \"Regulations on the Registration of Real identity information of telephone users\" (Order No. 25 of the Ministry of Industry and Information Technology), you should provide us with real identity information, including the network access procedures, including the network access procedure:Valid documents;", "label": ["Important", "First Party Collection Information"], "rewrite": "The telecommunications business products you order need to go through the network access procedures, you need to provide real identity information."}
{"task": "rw_18.jsonl", "id": 43588, "text": "At the same time, in order to verify the accuracy and integrity of this type of information, we will verify and verify the information that you provide with the information you provided with your information (government agencies, institutions, and commercial institutions);", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "To verify the accuracy and integrity of the information you provide, we will verify and verify the information with the organization with legal information to verify and check."}
{"task": "rw_18.jsonl", "id": 43589, "text": "After the verification, we will retain your personal information through taking pictures or online video and go through the network access procedures.", "label": ["Data Retention", "Important"], "rewrite": "We will retain your personal information by taking pictures or online video and go through the network access procedures."}
{"task": "rw_18.jsonl", "id": 43590, "text": "You need to collect your personal information including: user name, valid communication contact information, valid documents and numbers, registration information contained in valid documents, installation address, payment account number, email address, photo or online video method, image information obtained, and online video.Service accounts and passwords, password protection answers, proceeding business.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The network access requires collecting information such as the registration information, installation address and other information of your user name, effective communication contact information, valid documents and numbers, and valid documents."}
{"task": "rw_18.jsonl", "id": 43591, "text": "If you refuse to provide the above information, you will not be able to go through the network access procedures, and the corresponding products or services cannot be used.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43592, "text": "For the above information, we will be stored in China.", "label": ["Data Retention", "Important"], "rewrite": "The information collected by the network will be stored in China."}
{"task": "rw_18.jsonl", "id": 43593, "text": "(4) Personalized recommendation", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43594, "text": "For the package use information you generate in the process of using our products and services, we will be used to provide you with personalized or customized products and services to show you higher information flow or promotion information results to you.", "label": ["Important", "Usage"], "rewrite": "For your package information, we will be used to provide you with personalized or customized products and services."}
{"task": "rw_18.jsonl", "id": 43595, "text": "We may need your authorization message push permissions to send relevant content to you. If you do not want to receive this information, you can unsubscribe SMS and cancel the path of \"I-Settings-Universal-Business Recommendation\" through this app.", "label": ["Important", "Edit/Control"], "rewrite": "We may need your authorization message push permissions to send relevant content to you. You can cancel the SMS and use the path of this APP \"I-Settings-Universal-Business Recommendation\"."}
{"task": "rw_18.jsonl", "id": 43596, "text": "If these products and services significantly affect your legitimate rights and interests, you have the right to ask us to explain.", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43597, "text": "The product business functions are collected and used by your information item by item, please refer to the \"User Information Collection List\".", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43598, "text": "(5) In order to provide you with other services of this app, we will get your related mobile terminal permissions:", "label": ["Permission Acquisition", "Important"], "rewrite": "In order to provide you with other services of this APP, we will obtain your related mobile terminal authority."}
{"task": "rw_18.jsonl", "id": 43599, "text": "For the following authorization of mobile terminals, if you do not agree with authorization, you cannot use the corresponding functions and services of this app.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43600, "text": "As this APP function is further enriched, if the subsequent new features involve obtaining user authorization permissions, we will obtain the permissions required for this function after you have authorized consent.", "label": ["Permission Acquisition", "Important"], "rewrite": "If the subsequent new features involve obtaining user authorization permissions, we will obtain the authority required for the function after you authorize the consent."}
{"task": "rw_18.jsonl", "id": 43601, "text": "If you have not obtained your authorization, we will not collect and use relevant information.", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43602, "text": "1. When you first use this APP \"Scan and Scan\" function to scan the local picture QR code, use a photo upload or local picture upload function, this APP needs to obtain your terminal storage permissions to obtain your album storage content information.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "When you first use this APP \"Scan and Scan\" function to scan the two -dimensional code of the local picture, upload or upload the function of local pictures, this APP needs to obtain your terminal storage permissions to obtain your album storage content information."}
{"task": "rw_18.jsonl", "id": 43603, "text": "We will solicit your authorization through pop -up windows. If you refuse to authorize, you will not be able to use \"sweeping\", uploading photos, or uploading functions of local pictures.", "label": ["Permission Acquisition", "Important"], "rewrite": "We will solicit your authorization through pop -up windows in the usage scenario. If you refuse to authorize, we will not be able to use \"sweep\", uploading by taking pictures, or uploading functions of local pictures."}
{"task": "rw_18.jsonl", "id": 43604, "text": "For the above information, we will be stored in China.", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43605, "text": "2. When you first use the localized service and broadband business processing service of this APP for the first time, we will solicit your authorization through pop -up windows. After your authorization consent, Used to provide you with localized services, broadband business processing services;", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "When you first use the localized service and broadband business processing service of this APP for the first time, you can obtain your location positioning permissions after you authorize and agree to get your geographical location information."}
{"task": "rw_18.jsonl", "id": 43606, "text": "Special reminder: Geographical location information is a sensitive personal information. Once leakage may cause your personal safety, etc., you please pay attention to your attention.", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43607, "text": "If you refuse to authorize, we will not provide related functions and services related to your location information, but will not affect the use of other functions and services.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43608, "text": "This APP does not store your geographical information.", "label": ["Data Retention", "Important"], "rewrite": "This APP does not store your geographical information."}
{"task": "rw_18.jsonl", "id": 43609, "text": "3. When you first use the \"Scan and Scan\" function scanning code recharge card recharge communication fee, real -name activation verification when activating the new access number, face recognition login, upload your avatars in this APP, we will pass the pop -up window through the pop -up window.A method of soliciting your authorization, obtain the camera and storage permissions after you authorize the consent. If you refuse to authorize, you will not be able to use the aforementioned function and service;", "label": ["Permission Acquisition", "Important"], "rewrite": "You use the \"Scan and Scan\" function scanning code recharge card recharge communication cost for the first time, real -name activity verification when the new access number is activated, face recognition login, and upload your avatars in this APP.Get the camera and storage permissions of this machine."}
{"task": "rw_18.jsonl", "id": 43610, "text": "4. When you use the communication assistant function for the first time, we will solicit your authorization through pop -up window. After you have authorized consent, obtain the communication recording/writing permissions of the machine.When recording, when using the trumpet call, select the address book, recharge your friends to select a communication records, if you refuse to authorize, you will not be able to use the aforementioned function and service", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use the communication assistant function for the first time, we will obtain the communication recording/writing permissions after you authorize the consent."}
{"task": "rw_18.jsonl", "id": 43611, "text": "5. When you use the trial call for the first time, we will solicit your authorization by pop -up window. After your authorization consent, obtain the call permissions.Telephone, if you do not authorize this permission, you cannot use the functional service;", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use the trial call for the first time, we will obtain the call permissions after you authorize the consent."}
{"task": "rw_18.jsonl", "id": 43612, "text": "In addition, in order to show you the details of the dialogue through the form of a floating window when you use the small number to answer the phone, we need to obtain the authority of the suspension window;", "label": ["Permission Acquisition", "Important"], "rewrite": "In order to show you the dialogue details through the form of a floating window when you answer the phone call, we need to obtain the authority of the floating window."}
{"task": "rw_18.jsonl", "id": 43613, "text": "6. In order to provide you with insufficient phone bills and set meal use threshold reminder services in time, we use the news in the third -party Aurora Station Push, SDK will send you a threshold to remind you information, we will solicit your authorization through pop -up window, and get it after your authorization consent.View network connection permissions, storage permissions and location permissions are used to realize the APP threshold reminder, territorial service information to obtain your Android device unique identification (Androidid);", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "In order to provide you with insufficient phone bills and setting threshold removal services in a timely manner, we use the news in the third -party Aurora Station Push SDK to send you a threshold reminder information to you. After you authorize the consent, obtain the network connection permission.Threshold reminder, territorial service information to obtain your Android device unique logo."}
{"task": "rw_18.jsonl", "id": 43614, "text": "If the authority is not authorized, the functional service will not be used.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43615, "text": "If you don't want to receive this information, you can close the authorization through the path of \"I-Settings-Privacy-Systems permissions\" through this app;", "label": ["Important", "Edit/Control"], "rewrite": "You can close the notification authorization through the path of \"I-Settings-Privacy-System permissions\" through this app."}
{"task": "rw_18.jsonl", "id": 43616, "text": "7. In order to facilitate your use of online payment and recharge and payment of communication fees, we use WeChat SDK, Alipay SDK, Wing Payment, Du Xiaoman (Baidu), UnionPay payment SDK.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to facilitate your use of online payment and recharge and payment of communication fees, we use WeChat SDK, Alipay SDK, Wing Payment, Du Xiaoman (Baidu), UnionPay payment SDK."}
{"task": "rw_18.jsonl", "id": 43617, "text": "You need to access your equipment information, write storage permissions, view WIFI status permissions, and view network connection permissions to ensure your normal payment.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "You need to access your equipment information, write storage permissions, view WIFI status permissions, and view network connection permissions to ensure your normal payment."}
{"task": "rw_18.jsonl", "id": 43618, "text": "If you do not authorize this permission, you will not be able to use online payment function services;", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43619, "text": "8. In order to be able to send you a telecommunications service notice in time, if you use Xiaomi, Meizu, Huawei, OPPO, vivo mobile phone, we access the above -mentioned mobile phone manufacturer Push, SDK, you need to collect your equipment information, and you may collect youThe mobile phone model, system type, system version, and device screen size parameters are used to implement APP push services.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "In order to be able to send you a telecommunications service notice in time, we need to access the mobile phone manufacturer Push SDK to collect your equipment information to achieve APP push services."}
{"task": "rw_18.jsonl", "id": 43620, "text": "If you do not want to receive these notifications or information, you can close the path through the APP \"I-Settings-General-New Message Reminder\";", "label": ["Important", "Edit/Control"], "rewrite": "Close notifications or information through the path of \"I-Settings-General-New Message Reminder\" through the APP."}
{"task": "rw_18.jsonl", "id": 43621, "text": "When the push message reaches the application interface, the red dot message is displayed at the corresponding position of the APP icon, which will obtain the red dot permissions of your use of the terminal.", "label": ["Permission Acquisition", "Important"], "rewrite": "When the push message reaches the application interface, the red dot message is displayed at the corresponding position of the APP icon, which will obtain the red dot permissions of your use of the terminal."}
{"task": "rw_18.jsonl", "id": 43622, "text": "9. We will obtain your power -on permissions for the specific reminder function of birthday and timing.", "label": ["Permission Acquisition", "Important"], "rewrite": "We will obtain your power -on -boot authority for a specific reminder function for birthdays and timing."}
{"task": "rw_18.jsonl", "id": 43623, "text": "10. In order to facilitate your timely upgrade of the APP experience update function, we will obtain your installation permissions to facilitate whether you choose to upgrade to the latest version.", "label": ["Permission Acquisition", "Important"], "rewrite": "We will obtain your installation permissions to facilitate whether you choose to upgrade to the latest version."}
{"task": "rw_18.jsonl", "id": 43624, "text": "11. When you use the voice search function for the first time, we will solicit your authorization through pop -up window. After you authorize your consent, you will obtain microphone admission audio permissions. If you do not authorize, you will not be able to use this functional service.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use the voice search function for the first time, you can obtain the microphone admission audio permissions after your authorization consent."}
{"task": "rw_18.jsonl", "id": 43625, "text": "12. In order to provide you with the search for nearby business halls and 5G thermal coverage in time, we will use Baidu Map SDK. When you first use the aforementioned service, you can solicit your authorization through pop -up window., Storage permissions and reading mobile phone status permissions, if the permissions are not authorized, the corresponding functional services cannot be used.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "In order to provide you with a timely scope of finding nearby business halls and 5G thermal coverage, we will use Baidu Map SDK to obtain the location permissions, storage permissions, and read mobile phone status permissions after you authorize your consent."}
{"task": "rw_18.jsonl", "id": 43626, "text": "13. In order to facilitate your use of the sharing function, we use sharing SDK and Sina Weibo SDK.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "In order to facilitate your use of the sharing function, we use sharing SDK and Sina Weibo SDK."}
{"task": "rw_18.jsonl", "id": 43627, "text": "You need to visit your read and write storage (live broadcast sharing does not need to be retrieved), access to share title, sharing words to ensure your normal sharing", "label": ["Permission Acquisition", "Important"], "rewrite": "You need to visit your read and write storage (live broadcast sharing does not need to be retrieved), access to share title, and sharing words to ensure your normal sharing."}
{"task": "rw_18.jsonl", "id": 43628, "text": "14. In order to facilitate your use of network speed measuring function, when you first use the network speed measuring, we will solicit your authorization through pop -up window, and obtain your equipment information and positioning permissions after your authorization.The server provides you with speed measuring services of telecommunications operators.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "In order to facilitate your use of network speed measuring function, we will obtain your equipment information and positioning authority after you authorize."}
{"task": "rw_18.jsonl", "id": 43629, "text": "If you do not authorize this permissions, you will not be able to use network speed measuring functional services normally.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43630, "text": "15. In order to provide you with a more thoughtful and intimate voice and video customer service service, we use the video customer service SDK. When you first use the voice and video customer service service, you need to authorize the microphone and camera authority of this machine.Provide customer service services.", "label": ["Permission Acquisition", "Important"], "rewrite": "In order to provide you with voice and video customer service services, we use video customer service SDK to obtain microphone, camera permissions, and storage permissions authorized by your authorized."}
{"task": "rw_18.jsonl", "id": 43631, "text": "If you do not authorize this permissions, you will not be able to use video customer service functions normally. When you use taking pictures and viewing album functions, you will call your external storage permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use taking pictures and viewing the album function, you will call your external storage permissions."}
{"task": "rw_18.jsonl", "id": 43632, "text": "16. When you use the privacy sentry security service for the first time, we will solicit your authorization through pop -up windows. After your authorization consent, obtain your mobile phone number and application list permissions.Test history and obtain the application software app name and version number information in your mobile phone, which is used to identify and output security monitoring results.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the privacy sentry security service for the first time, we will obtain your mobile phone number and application list permissions after you authorize your consent."}
{"task": "rw_18.jsonl", "id": 43633, "text": "If you do not authorize this permissions, you will not be able to use privacy sentry services normally.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43634, "text": "17. When you modify your avatar in \"My Information\" for the first time, we will solicit your authorization through pop -up window. After you authorize your consent, obtain the camera and album permissions of this machine.Use the service normally.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you modify your avatar in \"My Information\" for the first time, we obtain the camera and album permissions after you authorize consent."}
{"task": "rw_18.jsonl", "id": 43635, "text": "18.For you can use the Bluetooth headset when watching the live broadcast, we need to obtain the Bluetooth authority of your machine.", "label": ["Permission Acquisition", "Important"], "rewrite": "For you can use the Bluetooth headset when watching the live broadcast, we need to obtain the Bluetooth authority of your machine."}
{"task": "rw_18.jsonl", "id": 43636, "text": "In order to use the call experience when using the live broadcast function, we also need to obtain your access to mobile phone information to make it easy for you to play live audio at the same time when using the Bluetooth headset to answer the phone.", "label": ["Permission Acquisition", "Important"], "rewrite": "For your call experience when using the live broadcast function, we also need to obtain your access to mobile phone information authority."}
{"task": "rw_18.jsonl", "id": 43637, "text": "19. When you give feedback on your opinion, you can use the convenient voice input function. When you use this function, we need to obtain your microphone right. If you refuse to authorize, you will not be able to use voice input functions.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you feedback your opinion, we need to obtain your microphone right to provide you with voice input function."}
{"task": "rw_18.jsonl", "id": 43638, "text": "20. In order to better use the relevant map service, we use Baidu Map SDK to provide services. Baidu Map SDK will obtain your Android device's unique logo (Androidid). For the sake of facilitating problems, if you refuse to authorize, you will not be able to be authorized.Use map -related services.", "label": ["Permission Acquisition", "Important"], "rewrite": "Baidu Map SDK will obtain the unique logo of your Android device, to locate the problem when problems are convenient."}
{"task": "rw_18.jsonl", "id": 43639, "text": "21. In the interaction scenario of using this APP with WeChat and Alipay applets, the user does not need to restart the app to the applet to provide better user services and experiences. We need to obtain your application taskSequence change permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "In the interaction scenario of using this APP with WeChat and Alipay mini -programs, the user does not need to restart the app to the applet after using the user to jump to the applet. You need to obtain your application task order change permissions."}
{"task": "rw_18.jsonl", "id": 43640, "text": "If you refuse to authorize, you will not be able to restart the convenient experience of the APP when you provide a switching scenario.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43641, "text": "22. When you use the H5 page to use the shaking function, we will call the acceleration sensor, gyroscope sensor, and rotating vector sensor information of your device to determine whether the mobile phone is shaking when allowing the application to load the webpage interface.Web content;", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "When you use the H5 page to use the shaking function, we will call the acceleration sensor, gyroscope sensor, and rotating vector sensor information of your device."}
{"task": "rw_18.jsonl", "id": 43642, "text": "When you use the personalized products and services provided by this APP, we will call the acceleration sensor of your device to collect the relevant fields of the screen direction for platform user behavior analysis.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "When you use personalized products and services, we will call the acceleration sensor of your device to collect related fields in the screen direction for platform user behavior analysis."}
{"task": "rw_18.jsonl", "id": 43643, "text": "23. When you have performance problems during this APP, we use listening to Yun SDK to obtain your location information permissions to collect collapse logs and optimize client operation efficiency.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "When you use performance problems during this APP, get your location information permissions for collecting collapse logs and optimize client operating efficiency."}
{"task": "rw_18.jsonl", "id": 43644, "text": "24. In order to provide you with the service of loading applets in the end, we use containerized SDK. When you use the corresponding functions of various small programs run by container, you may need to obtain your camera permissions, allow installation of APK permissions, and allow installation of APK permissions.Storage permissions, uninstalling and establishing desktop shortcut permissions, access to network permissions, microphone permissions, and modification of mobile phone sound permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "In order to provide you with services to load applets in the end, we use containerized SDK to obtain your camera permissions, allow installation of APK permissions, storage permissions, uninstall and establish desktop shortcut permissions, access network permissions, microphone permissions, modify the sound of mobile phone sounds, modify the sound of mobile phonesPermissions."}
{"task": "rw_18.jsonl", "id": 43645, "text": "(6) Under the premise of complying with national laws and regulations and regulatory policies, we may also use the collected information for the following uses:", "label": ["Important", "Usage"], "rewrite": "On the premise of complying with national laws and regulations and regulatory policies, we may also use the collected information for the following uses:"}
{"task": "rw_18.jsonl", "id": 43646, "text": "1. When we provide services, it is used for authentication, customer service, security precautions, fraud monitoring, archiving and backup to ensure the safety of the products and services we provided to you;", "label": ["Important", "Usage"], "rewrite": "When we provide services, it is used for authentication, customer service, security precautions, fraud monitoring, archiving and backup to ensure the safety of products and services."}
{"task": "rw_18.jsonl", "id": 43647, "text": "2. Through information and data analysis, help us provide you with new services for better perception;", "label": ["Important", "Usage"], "rewrite": "Through information and data analysis, help us provide you with better new services."}
{"task": "rw_18.jsonl", "id": 43648, "text": "If you don't want to provide you with personalized services, you can close the recommendation through the path of \"I-Settings-General-Business Recommendation\" through this app;", "label": ["Important", "Edit/Control"], "rewrite": "Close personalized services through the path of \"I-Settings-General-Business Recommendation\" through this APP."}
{"task": "rw_18.jsonl", "id": 43649, "text": "3. In order to make us better understand how you use our services, so as to meet your personalized needs, such as language settings, location settings, personalized help services and instructions, or other services to you and other usage we use us and other servicesUsers make other responses;", "label": ["Important", "Usage"], "rewrite": "Use your personal information to make us better understand how you use our services, thereby meeting your personalized needs targeted."}
{"task": "rw_18.jsonl", "id": 43650, "text": "4. When you use this app, if we push advertisements to you, the word \"fixed push\" will be marked in related advertisements.", "label": ["Important", "Usage"], "rewrite": "If we push advertisements to you, the word \"fixed push\" will be stipulated in related advertisements."}
{"task": "rw_18.jsonl", "id": 43651, "text": "If you do not receive an advertisement with the word \"fixed push\", then this APP does not push you for you;", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43652, "text": "5. Software authentication and management software upgrade", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43653, "text": "6. Invite you to participate in surveys on our products and services", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43654, "text": "(7) According to relevant laws and regulations and national standards, in the following situations, we collect and use your relevant personal information without asking your authorization consent. In this case, we will handle your personal information strictly in accordance with the conditions and procedures stipulated in the law and procedures.The", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In the following circumstances, we collect and use your relevant personal information without soliciting your authorization consent."}
{"task": "rw_18.jsonl", "id": 43655, "text": "1. What is related to the obligation stipulated in the performance of the personal information controller;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The collection and usage information related to the obligations stipulated by the personal information controller fulfills the obligation of laws and regulations does not need to solicit authorization consent."}
{"task": "rw_18.jsonl", "id": 43656, "text": "2. Directly related to national security and national defense security;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The collection and use information directly related to national security and national defense security does not need to solicit authorization consent."}
{"task": "rw_18.jsonl", "id": 43657, "text": "3. Directly related to public safety, public health, and major public interests;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The collection and use information directly related to public safety, public health, and major public interests does not need to solicit authorization consent."}
{"task": "rw_18.jsonl", "id": 43658, "text": "4. Directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Direct related collection and use information such as criminal investigation, prosecution, trial, and execution of judgments does not need to solicit authorization consent."}
{"task": "rw_18.jsonl", "id": 43659, "text": "5. For major legitimate rights and interests of the life and property of personal information subjects or other individuals, it is difficult to get my authorization consent;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collecting the use of information from major legitimate legitimate rights and interests such as the life and property of the subject of personal information or other individuals, but it is difficult to obtain the consent of my authorization, and no authorization consent is required."}
{"task": "rw_18.jsonl", "id": 43660, "text": "6. The personal information involved is made by the personal information subject to the public by themselves;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The personal information involved is disclosed to the public by itself, and there is no need to solicit authorization consent."}
{"task": "rw_18.jsonl", "id": 43661, "text": "7. Signing and fulfilling the contract according to the requirements of the personal information subject;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The collection and use information necessary for signing and fulfilling the contract according to the requirements of the personal information subject does not need to solicit authorization consent."}
{"task": "rw_18.jsonl", "id": 43662, "text": "8. Collect personal information from the information disclosed by legal publicly, such as legal news reports and government information disclosure;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If you collect personal information from the legal disclosure information, you do not need to solicit authorization consent."}
{"task": "rw_18.jsonl", "id": 43663, "text": "9. Maintain the safe and stable operation of the products or services provided by the product or service, such as discovering and disposing of products or services;", "label": ["Risk", "Important", "First Party Collection Information", "Usage"], "rewrite": "Maintaining the collection and use information necessary for the safe and stable operation of the product or service, no need to solicit authorization consent."}
{"task": "rw_18.jsonl", "id": 43664, "text": "10. Personal information controller is a news unit, and it is necessary to carry out legal news reports;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Personal information controller is a news unit, and the collection and use information necessary for legal news reports does not need to solicit authorization consent."}
{"task": "rw_18.jsonl", "id": 43665, "text": "11. Personal information controller is an academic research institution, which is necessary to carry out statistics or academic research institutes for public interests, and when it provides academic research or description results, it is identified to identify the personal information contained in the results.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Personal information controller is an academic research institution, which is necessary to carry out statistics or academic research institutes for public interests, and when it provides academic research or description results, it is identified to identify the personal information contained in the result without soliciting solicitation.Authorized consent."}
{"task": "rw_18.jsonl", "id": 43666, "text": "(8) You understand and agree, we can anonymous processing of your personal information through technical means, and the information that anonymous processing process will not be able to identify your identity.", "label": ["Important", "Data Security"], "rewrite": "Anonymous processing information will not be able to identify your identity."}
{"task": "rw_18.jsonl", "id": 43667, "text": "In this case, and under the premise of compliance with relevant laws and regulations and regulatory policies, we can use information that has been anonymous to analyze and use it.", "label": ["Important", "Data Security", "Usage"], "rewrite": "We can use information that has been anonymous to analyze and use it."}
{"task": "rw_18.jsonl", "id": 43668, "text": "(9) If we need to use other purposes that the information is not stated in this policy, we will solicit your consent in advance.", "label": ["Important", "Usage"], "rewrite": "If we need to use other purposes that the information is not stated in this policy, we will solicit your consent in advance."}
{"task": "rw_18.jsonl", "id": 43669, "text": "2. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43670, "text": "To ensure the normal operation of this APP, we will store small data files named Cookie on your mobile devices.", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43671, "text": "Cookie usually contains identifiers, site names, mobile phone models, system types, system versions, and device screen size.", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43672, "text": "With the help of cookies, you can store your preferences or product data in shopping baskets.", "label": ["Important", "Usage"], "rewrite": "With the help of cookies, you can store your preferences or product data in shopping baskets."}
{"task": "rw_18.jsonl", "id": 43673, "text": "We will not use Cookie for any purpose outside the purpose of this policy.", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43674, "text": "You can manage or delete Cookie according to your preferences.", "label": ["Important", "Edit/Control"], "rewrite": "You can manage or delete Cookie according to your preferences."}
{"task": "rw_18.jsonl", "id": 43675, "text": "See AboutCookies.org for details.", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43676, "text": "You can clear all the cookies saved on this device, and most of the network browsers have the function of preventing cookies.", "label": ["Important", "Edit/Control"], "rewrite": "You can clear all the cookies saved on this device."}
{"task": "rw_18.jsonl", "id": 43677, "text": "But if you do this, you need to change the user settings when using this app.", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43678, "text": "3. How can we share, transfer and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43679, "text": "(1) Sharing", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43680, "text": "Except for other provisions of these policies and the following situations, and the following circumstances, without your previous consent, we will not share your personal information with other third parties:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Except for other provisions of these policies and the following situations, and the following circumstances, without your previous consent, we will not share your personal information with other third parties:"}
{"task": "rw_18.jsonl", "id": 43681, "text": "1. In accordance with the requirements of laws and regulations and regulatory policies, or in accordance with the compulsory requirements of administrative and judicial organs, share your personal information with third -party or administrative and judicial organs;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In accordance with the requirements of laws and regulations and regulatory policies, or in accordance with the mandatory requirements of administrative and judicial organs, share your personal information with third parties or administrative and judicial organs."}
{"task": "rw_18.jsonl", "id": 43682, "text": "2. When you authorize banks and credit reporting agencies to inquire and collect your information in this APP, we will share your information from the scope of laws and regulations and regulatory policies and your authorization scope of the third partyWe will share your personal information on the premise of compliance with laws and regulations and regulatory policies in accordance with the legitimacy of the source of personal information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "When you authorize banks and credit reporting agencies to inquire and collect your information in this APP, share your information from third parties within the scope of your authorization."}
{"task": "rw_18.jsonl", "id": 43683, "text": "3. Shared with a partner who handles your personal information: In order to achieve the purpose of the statement in this policy, some personal information will be processed by a third -party trustee partner.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Only to achieve the purpose of this policy, some of your personal information will be processed by third -party trustee partners."}
{"task": "rw_18.jsonl", "id": 43684, "text": "After your authorization, we may share some of your personal information with your partners to provide better customer service and user experience.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After your authorization, we may share some of your personal information with your partners."}
{"task": "rw_18.jsonl", "id": 43685, "text": "For example, when you purchase goods or ordering business through this app, we must share your personal information with logistics service providers to arrange delivery or arrange partners to provide services.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When you buy goods or ordering business, we share your personal information with logistics service providers."}
{"task": "rw_18.jsonl", "id": 43686, "text": "Within the scope of your authorization, our trustee partners may collect your information through cookies or similar technologies, including your personal name, residence address, mobile phone number, order information.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Within the scope of your authorization, our trusted partners may collect your information through cookies or similar technologies."}
{"task": "rw_18.jsonl", "id": 43687, "text": "We will only share your personal information for legal, correct, necessary, specific, and clear purposes, and only share the personal information necessary for providing services.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only share your personal information for legal, correct, necessary, specific, and clear purposes, and only share the personal information necessary for providing services."}
{"task": "rw_18.jsonl", "id": 43688, "text": "Our entrusted partners will ensure that your personal information is processed in accordance with the agreed purpose, processing methods, etc., and there is no right to use the personal information shared for any other purpose. There is no right to transfer others to handle personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Our entrusted partners will guarantee your personal information in accordance with the agreed, and there is no right to use personal information for any other purpose."}
{"task": "rw_18.jsonl", "id": 43689, "text": "Our third -party partners include: Zhongtong Service Net Ying Technology Co., Ltd., Shaanxi Hua Yaurong Communication Technology Development Co., Ltd., Jiangsu Zhongbo Communication Co., Ltd., Tianyi Telecom Terminal Co., Ltd., Beijing Chuangsi Jiayin Technology Co., Ltd.Limited Satellite Communications Branch, Beijing Jingdong Century Trading Co., Ltd., SF Holdings Co., Ltd., Tianyi Digital Life Technology Co., Ltd.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43690, "text": "4. We may share your personal information with other information processors. Other information processors include the following three types:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share your personal information with other information processors."}
{"task": "rw_18.jsonl", "id": 43691, "text": "(1) Suppliers, service providers and other partners.", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43692, "text": "We send information to suppliers, service providers, and other partners that support our business. These support include providing technical infrastructure services, analyzing the use of our services, measurement of the effectiveness of advertising and services, providing customer service, convenient payment of paymentOr conduct academic research and investigation.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may send information to suppliers, service providers and other partners who support our business."}
{"task": "rw_18.jsonl", "id": 43693, "text": "(2) Third -party merchants.", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43694, "text": "We must share your order information and the necessary information related to transactions with third -party merchants to realize your needs for purchasing goods or services from it, and to promote the subsequent after -sales service.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We share your order information and necessary information related to transactions with third -party merchants to achieve your purchase needs."}
{"task": "rw_18.jsonl", "id": 43695, "text": "(3) Related company.", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43696, "text": "After your authorization, we may share your personal information with our affiliated company.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After your authorization, we may share your personal information with our affiliated company."}
{"task": "rw_18.jsonl", "id": 43697, "text": "We will only share the necessary personal information and be subject to the purpose of the privacy policy.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only share the necessary personal information and be subject to the purpose of the privacy policy."}
{"task": "rw_18.jsonl", "id": 43698, "text": "If related companies want to change the purpose of personal information, they will solicit your authorization consent again.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If related companies want to change the purpose of personal information, they will solicit your authorization consent again."}
{"task": "rw_18.jsonl", "id": 43699, "text": "Regarding the names, contact information, processing purpose, processing methods and personal information of other information processors, please check the \"Third -Party Information Sharing List\".", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Please check the \"Third -Party Information Sharing List\"."}
{"task": "rw_18.jsonl", "id": 43700, "text": "If other information processors change the original processing purpose and method of processing, we will re -obtain your consent.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "If other information processors change the original processing purpose and method of processing, we will re -obtain your consent."}
{"task": "rw_18.jsonl", "id": 43701, "text": "(2) Transfer", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43702, "text": "In addition to the other terms of these policies, and the following situations, we will not transfer your personal information to the third party:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In addition to the other terms of these policies, and the following situations, we will not transfer your personal information to the third party:"}
{"task": "rw_18.jsonl", "id": 43703, "text": "1. After getting your separate consent, we will transfer your personal information to other parties;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After getting your separate consent, we will transfer your personal information to other parties."}
{"task": "rw_18.jsonl", "id": 43704, "text": "2. When involving mergers, acquisitions or bankruptcy liquidation, if you involve personal information transfer, we will tell you the name or name and contact information of the receiver, and the receiver will continue to be constrained by this privacy policy, continue to fulfill the privacy of this privacy,Under the policy of the protection of your personal information, and requiring the receiver to change your authorized consent if it changes the original treatment purpose and method of processing;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When involving mergers, acquisitions, or bankruptcy liquidation, if personal information transfer is involved, it will be required to continue to be bound by the policy, otherwise it will request that it will re -solicit authorization consent."}
{"task": "rw_18.jsonl", "id": 43705, "text": "3. Other circumstances stipulated in laws and regulations.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Others stipulated in laws and regulations that can transfer personal information."}
{"task": "rw_18.jsonl", "id": 43706, "text": "(3) Public disclosure", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43707, "text": "We will only publicly disclose your personal information in the following circumstances:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only publicly disclose your personal information in the following circumstances:"}
{"task": "rw_18.jsonl", "id": 43708, "text": "1. After getting your alone consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After getting your own consent, you may disclose your personal information publicly."}
{"task": "rw_18.jsonl", "id": 43709, "text": "2. In the case of compulsory requirements of laws and regulations, legal procedures, litigation or government authorities, we may publicly disclose your personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the case of laws and regulations, legal procedures, litigation or government authorities, we may publicly disclose your personal information."}
{"task": "rw_18.jsonl", "id": 43710, "text": "4. How do we protect your personal information", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43711, "text": "(1) We promise to ensure user information security strictly in accordance with relevant national regulations.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43712, "text": "To ensure your information security, we will use the necessary security technology and supporting management system to prevent your information from being leaked, damaged or lost.", "label": ["Important", "Data Security"], "rewrite": "Use the necessary security technology and supporting management system to prevent your information from being leaked, damaged or lost."}
{"task": "rw_18.jsonl", "id": 43713, "text": "We have set up user information protection responsibility departments and establishes related internal control, and adopt the minimum principle of authorization for the staff who may contact your information;", "label": ["Important", "Data Security"], "rewrite": "The establishment of user information protection responsibility departments and establishment of related internal control, to take the minimum principle of authorization for the staff who may contact your information."}
{"task": "rw_18.jsonl", "id": 43714, "text": "Continuously monitor the staff of relevant laws and regulations, privacy policies, and security awareness of staff, and systematically monitor the behavior of the staff to handle your information.", "label": ["Important", "Data Security"], "rewrite": "Continuously monitor the relevant laws and regulations, privacy policies and security awareness of staff, and systematically monitor the behavior of handling your information."}
{"task": "rw_18.jsonl", "id": 43715, "text": "(2) You should properly save information such as the login account, password and other information, and the consequences of the leakage of information such as account numbers, passwords and other information due to your reasons are borne by you.", "label": ["Important", "Data Security"], "rewrite": "The consequences of the disclosure of accounts, passwords and other information due to your reasons are borne by you."}
{"task": "rw_18.jsonl", "id": 43716, "text": "In order to prevent information leakage, we will adopt the technical means of anti -leakage and anti -crawler to restrict frequent inquiry of your information abnormal operating behavior to prevent the leakage of the account password, the status of others, causing you to produce bad behavior records or your information leak.", "label": ["Important", "Data Security"], "rewrite": "Adopt anti -leakage and anti -crawler technical means to limit frequent inquiry of your information abnormal operation behavior to prevent the account password from leaking."}
{"task": "rw_18.jsonl", "id": 43717, "text": "(3) Due to technical level restrictions and various malicious means, security issues may occur due to factors outside of our controllable range.", "label": ["Important", "Data Security"], "rewrite": "Security issues may appear due to factors outside the control scope."}
{"task": "rw_18.jsonl", "id": 43718, "text": "After a personal information security incident, we will tell you in a timely manner in accordance with the requirements of relevant laws and regulations and regulatory policies that it is difficult to inform the subject of personal information one by one, and we will publish an announcement in a reasonable way.", "label": ["Important", "Data Security"], "rewrite": "The relevant situation of the security incident will be informed in time. When it is difficult to inform one by one, it will issue an announcement."}
{"task": "rw_18.jsonl", "id": 43719, "text": "At the same time, we will also actively report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "Report the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities."}
{"task": "rw_18.jsonl", "id": 43720, "text": "(4) We have used security measures that meet the industry standards to protect your personal information, avoiding data from unauthorized access, public disclosure, use, modification, damage or loss.", "label": ["Important", "Data Security"], "rewrite": "Use security protection measures that meet industry standards to protect your personal information, avoid data from unauthorized access, publicly disclosed, used, modified, damaged or lost."}
{"task": "rw_18.jsonl", "id": 43721, "text": "We will take all reasonable and feasible measures to ensure the security, integrity, authenticity, and effectiveness of your personal information, such as:", "label": ["Important", "Data Security"], "rewrite": "We will take all reasonable and feasible measures to ensure the security, integrity, authenticity, and effectiveness of your personal information."}
{"task": "rw_18.jsonl", "id": 43722, "text": "1. Use encrypted technology to store personal information and data, and use the trusted protection mechanism to prevent data from being attacked;", "label": ["Important", "Data Security"], "rewrite": "Use encrypted technology to store personal information data, and use the trusted protection mechanism to prevent data from being attacked."}
{"task": "rw_18.jsonl", "id": 43723, "text": "In the application interface involving personal information needs, we use the necessary mask desensitization methods to ensure that it is not illegally stolen;", "label": ["Important", "Data Security"], "rewrite": "In the application interface that needs to be displayed by personal information, we use mask desensitization to ensure that it is not illegally stolen."}
{"task": "rw_18.jsonl", "id": 43724, "text": "2. When you first use this app for the first time, we will follow the principle of minimizing, combine specific business scenarios and the equipment involved in the equipment, clarify the use on demand, solicit your full authorization, and protect your right to knowledge and privacy.Essence", "label": ["Important", "Data Security"], "rewrite": "When you first use this app for the first time, we will follow the principle of minimizing, clarify the purpose on demand, and solicit your full authorization."}
{"task": "rw_18.jsonl", "id": 43725, "text": "5. How can we save your personal information;", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43726, "text": "(1) Storage location", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43727, "text": "The collection of this app collection will be stored on the servers of this APP in the People's Republic of China (the purpose of this privacy policy, excluding Hong Kong, Macau, and Taiwan).", "label": ["Data Retention", "Important"], "rewrite": "Your information will be saved on the server in this app on the People's Republic of China."}
{"task": "rw_18.jsonl", "id": 43728, "text": "(2) Save time limit", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43729, "text": "For the collected information, we will be preserved within the minimum period (within 6 months) stipulated by the law.", "label": ["Data Retention", "Important"], "rewrite": "For the collected information, we will be stored within the minimum period stipulated by the law."}
{"task": "rw_18.jsonl", "id": 43730, "text": "When your information no longer needs to be used to realize the purpose and purpose stipulated in the privacy policy, and we do not need to be stored in accordance with the provisions of relevant laws and regulations, we will take reasonable steps to destroy personal information in a safe way or perform anonymous processing.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "When your information is no longer used in agreed purposes and exceeds the legal preservation period, it will be destroyed or anonymous."}
{"task": "rw_18.jsonl", "id": 43731, "text": "In principle, the shortest storage period for non -service user information that must be preserved is 6, a month.", "label": ["Data Retention", "Important"], "rewrite": "In principle, the shortest storage period for user information that must be preserved for non -service is 6 months."}
{"task": "rw_18.jsonl", "id": 43732, "text": "(3) Termination operation", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43733, "text": "If we terminate the operation of the product or service, we will stop the activities of continuing to collect personal information in time, and notify you in the form of the notification of operation in the form of one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one service.", "label": ["Important", "Cessation of Operations"], "rewrite": "When stopping operations, we will stop collecting and notify you in time."}
{"task": "rw_18.jsonl", "id": 43734, "text": "We will delete or anonymous processing of personal information that have been collected.", "label": ["Important", "Data Security"], "rewrite": "When stopping operations, we will delete or do the collected personal information."}
{"task": "rw_18.jsonl", "id": 43735, "text": "6. Protection of Minor Information", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43736, "text": "If you are a minor, we ask you to ask your guardian to read this privacy policy carefully and use our services or provide information to us under the premise of obtaining your consent.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a minor, please use our services or provide information to us under the premise of obtaining your guardian's consent."}
{"task": "rw_18.jsonl", "id": 43737, "text": "If you are under 14 years of age (children), before you use our service, please and your guardian to read us carefully, \"Children's Personal Information Protection Policy and Guardian Notice\" to ensure that the guardian is obtained by the guardianYes, after the \"Children's Personal Information Protection Policy and Guardian\", you can use our services under the guidance of the guardian.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a child under the age of 14, please read the \"Children's Personal Information Protection Policy and Guardian Notice\" and agree to use services or provide information under the guidance of the guardian."}
{"task": "rw_18.jsonl", "id": 43738, "text": "For the consent of the guardian to collect children's personal information with our products or services, we will only use, share, transfer or disclose this information with the permission of laws and regulations, the guardian clearly agree, or protect the children.", "label": ["Specific Audiences", "Important"], "rewrite": "We will only use, share, transfer, or disclose this information when the laws and regulations are allowed, the guardian to clearly agree or protect children."}
{"task": "rw_18.jsonl", "id": 43739, "text": "If your guardian does not agree that you use our services or provide information to us in accordance with this policy, please immediately terminate our services and inform us in time so that we can take corresponding measures.", "label": ["Specific Audiences", "Important"], "rewrite": "If your guardian does not agree that you can use services or provide information on this policy, please stop using and inform us in time."}
{"task": "rw_18.jsonl", "id": 43740, "text": "If you are the parents of the minor or other guardians, please pay attention to whether the minors you guard with your authorization will use our services after obtaining your authorization consent.", "label": ["Specific Audiences", "Important"], "rewrite": "Please pay attention to whether the minor you guard at your monitoring uses our service after obtaining your authorization consent."}
{"task": "rw_18.jsonl", "id": 43741, "text": "If you have any questions about the personal information of the minors you monitor, please contact us through the contact information at the end of this privacy policy.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43742, "text": "Seven, your rights", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43743, "text": "(1) Visit your personal information", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43744, "text": "Account Information: You can access your personal information in real time through the path of \"My-Avatar\" and \"I-Settings-Receiving Address\";", "label": ["Edit/Control", "Important"], "rewrite": "You can access your personal information in real time through the path of \"I-Avatar\", \"I-Settings-Receiving Address\"."}
{"task": "rw_18.jsonl", "id": 43745, "text": "Other personal information: For other personal information generated during your product or service, if you need, you can get in touch with us through the contact information of the end of this privacy.", "label": ["Important", "Edit/Control"], "rewrite": "Visit the other personal information generated during your product or service. You can contact us."}
{"task": "rw_18.jsonl", "id": 43746, "text": "(2) Correct your personal information", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43747, "text": "When you find that we have an error in handling your personal information, you have the right to ask us to make corrections or supplements.", "label": ["Important", "Edit/Control"], "rewrite": "When you find that we have an error in handling your personal information, you have the right to ask us to make corrections or supplements."}
{"task": "rw_18.jsonl", "id": 43748, "text": "You can correct it by yourself through the path of \"I-Avatar\" and \"I-Settings-Receiving Address\".", "label": ["Important", "Edit/Control"], "rewrite": "You can correct it by yourself through the path of \"I-Avatar\" and \"I-Settings-Receiving Address\"."}
{"task": "rw_18.jsonl", "id": 43749, "text": "If you find that you can't correct yourself, you can also contact customer service to make a correction of personal information request.", "label": ["Edit/Control", "Important"], "rewrite": "If you can't correct your personal information by yourself, you can make a correction of personal information requests."}
{"task": "rw_18.jsonl", "id": 43750, "text": "(3) Delete your personal information", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43751, "text": "You can delete your address information through the path of \"I-Settings-Receiving Address\". For other personal information, you can make a request to delete personal information to us through the contact information at the end of this privacy policy.We will stop providing you with products or services and delete your personal information according to the requirements of applicable laws.", "label": ["Edit/Control", "Important"], "rewrite": "You can delete your address information through the path of \"I-Settings-Receiving Address\", and other information can be contacted to us to delete."}
{"task": "rw_18.jsonl", "id": 43752, "text": "(4) Withdraw your authorization information", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43753, "text": "Withdrawal of privacy policy authorization: You can withdraw your authorization of privacy policy through the path of \"I-Settings-Privacy-Privacy-Privacy-Countering Privacy Policies\";", "label": ["Important", "Edit/Control"], "rewrite": "You can withdraw your authorization of privacy policy through the path of \"I-Settings-Privacy-Privacy-Privacy-Withdrawal Agreement Privacy Policy\"."}
{"task": "rw_18.jsonl", "id": 43754, "text": "Withdrawal of system authority authorization: You can withdraw your authorization of privacy policy through the path of \"I-Settings-Privacy-System permissions\" through this app;", "label": ["Important", "Edit/Control"], "rewrite": "You can withdraw your authorization of privacy policy through the path of \"I-Settings-Privacy-System Power\" through this app."}
{"task": "rw_18.jsonl", "id": 43755, "text": "Withdrawal of personal information collection: You can also withdraw all the authorization of your personal information through the path of \"I-Settings-GM-Logout\".", "label": ["Edit/Control", "Important"], "rewrite": "You can also withdraw all the authorization of collecting your personal information through the path of \"I-Settings-GM-Logging\"."}
{"task": "rw_18.jsonl", "id": 43756, "text": "Please understand that each business function requires some basic personal information to be completed. When you withdraw consent or authorization, we cannot provide you with corresponding functional services, and we will no longer process your corresponding personal information.", "label": ["Edit/Control", "Important"], "rewrite": "When you withdraw consent or authorization, we cannot provide you with corresponding functional services, and no longer process your corresponding personal information."}
{"task": "rw_18.jsonl", "id": 43757, "text": "But your decision to withdraw consent or authorization will not affect the personal information processing that has been carried out based on your authorization", "label": ["Important", "Edit/Control"], "rewrite": "The decision you withdraws or authorized will not affect personal information processing that was previously authorized."}
{"task": "rw_18.jsonl", "id": 43758, "text": "(5) Logging out this app account", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43759, "text": "You can cancel your account through the path of \"I-Settings-GM-Logout\", and your cancellation application will officially take effect within 15 days.", "label": ["Important", "Edit/Control"], "rewrite": "You can cancel your account through the path of \"I-Settings-GM-Logistics\"."}
{"task": "rw_18.jsonl", "id": 43760, "text": "The behavior of your cancellation account is irreversible. After canceling the account, the relevant service information, orders, common addresses, personal information, etc. in China Telecom Business Office (including the headquarters, network halls, public accounts, small programs, etc.) areIt will be canceled and cleared.", "label": ["Important", "Edit/Control"], "rewrite": "After the cancellation of the account, the relevant service information, order information, common address, and personal information of the China Telecom Business Office will be canceled and cleared."}
{"task": "rw_18.jsonl", "id": 43761, "text": "If you need to completely sell the current mobile phone number, bring a valid ID to China Telecom's physical business hall for application.", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43762, "text": "(6) Copy your personal information", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43763, "text": "If you need a copy of your personal information, you can contact us through the contact information at the end of this privacy policy. After verifying your identity, we will provide you with your personal information copy (including personal information, identity, identity, identityInformation, but otherwise provided by laws and regulations or other privacy policies, except for other agreed.", "label": ["Edit/Control", "Important"], "rewrite": "If you need a copy of your personal information, we will provide you after verifying your identity."}
{"task": "rw_18.jsonl", "id": 43764, "text": "For your reasonable request about user personal information above, we will respond to your personal information request within 15 working days.", "label": ["Important", "Edit/Control"], "rewrite": "We will respond to your personal information request within 15 working days."}
{"task": "rw_18.jsonl", "id": 43765, "text": "In principle, we do not charge fees, but we will charge a certain cost fee depending on the situation for requests that repeat and beyond the reasonable limit.", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43766, "text": "8. How to update this policy", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43767, "text": "Based on the purpose of providing you better service, and in accordance with the development of telecommunications business or the requirements of laws and regulations and regulatory policies, we may make amendments and updates in time.", "label": ["Policy Change", "Important"], "rewrite": "We may revise and update this policy in a timely manner."}
{"task": "rw_18.jsonl", "id": 43768, "text": "For a revised or updated privacy policy, when collecting personal information purposes, methods, and scope changes, we will once again notify you by pop -up window or in -site letter notification, and ask your consent.", "label": ["Policy Change", "Important"], "rewrite": "For the revised or updated privacy policies, when collecting personal information purposes, methods, and scope changes, you will be notified again and asking your consent again."}
{"task": "rw_18.jsonl", "id": 43769, "text": "Nine, how to contact us", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43770, "text": "(1) If you have any questions, opinions or suggestions on your privacy policy or your personal information, please contact us in the following ways to deal with personal information protection and data security issues:", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43771, "text": "1. Company Name: China Telecom Co., Ltd. omni -channel operation center", "label": ["Important", "Contact Information"], "rewrite": "Company Name: China Telecom Co., Ltd. omni -channel operation center"}
{"task": "rw_18.jsonl", "id": 43772, "text": "2. Registration address: 4, No. 99 Xingshikou Road, Haidian District, Beijing", "label": ["Important", "Contact Information"], "rewrite": "Registration address: 4, No. 99 Xingshikou Road, Haidian District, Beijing"}
{"task": "rw_18.jsonl", "id": 43773, "text": "3. Customer service hotline: 4008167189", "label": ["Important", "Contact Information"], "rewrite": "Customer service hotline: 4008167189"}
{"task": "rw_18.jsonl", "id": 43774, "text": "4. Personal person in charge of personal information protection: privacy.qq@chinatelecom.cn", "label": ["Important", "Contact Information"], "rewrite": "Personal information protection person mailbox: privacy.qq@chinatelecom.cn"}
{"task": "rw_18.jsonl", "id": 43775, "text": "(2) To ensure safety, you may need to provide a written request or prove your identity in other ways. We will reply within 15 working days.", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43776, "text": "If you are not satisfied with our response, especially our personal information processing behavior harms your legitimate rights and interests, you can complain or report to the regulatory authorities such as online information, public security, and municipal supervisors.The court of jurisdiction filed a lawsuit.", "label": [], "rewrite": []}
{"task": "rw_18.jsonl", "id": 43777, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
