{"task": "rw_110.jsonl", "id": 72984, "text": "Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 72985, "text": "Update date: September 3, 2022", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_110.jsonl", "id": 72986, "text": "Foreword", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 72987, "text": "This privacy policy is set by users (hereinafter collectively referred to as \"user\" or \"you\") and Friendship Time Technology Co., Ltd. Suzhou Qinyou Network Technology Co., Ltd. (hereinafter collectively referred to as \"Qinyou\" or \"us\")The solemn promise to protect the personal information and privacy security of users who use Qinyou products and services (hereinafter collectively referred to as \"Qinyou Service\").", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 72988, "text": "When you use Qinyou service, we may collect and use your personal information.", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 72989, "text": "We hope to explain to you through the \"Privacy Policy\" (hereinafter referred to as \"this policy\") to explain related matters such as collecting and using your relevant personal information to better protect your rights and interests.", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 72990, "text": "This policy is suitable for all the Qinyou services we provided.", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 72991, "text": "Except for the provisions of policy and service clauses and other announced standards, we will not publish information related to personal identity with users.", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 72992, "text": "Please note that Qinyou will check his privacy measures from time to time, so related measures will change.", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 72993, "text": "We urge you to regularly patronize this page to ensure that the latest version of our privacy policy always understands.", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 72994, "text": "Before using various Qinyou services, you should focus on reading the clauses that are identified by the threatened/thick body, and start using it after confirmation and consent.", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 72995, "text": "If you do not agree with the content of this policy, it may cause Qinyou service to be unable to run normally or to achieve the service effect we are going to achieve, and you should immediately stop access/use Qinyou services.", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 72996, "text": "If you use or continue to use Qinyou services, you agree that you agree that we collect, use, and store your personal information in accordance with this policy (including updated versions).", "label": ["Policy Change", "Important", "Risk"], "rewrite": "If you use or continue to use Qinyou services, you agree that you agree that we collect, use, and store your personal information in accordance with this policy (including updated versions)."}
{"task": "rw_110.jsonl", "id": 72997, "text": "After reading this policy, if you have any problems with this policy or related matters related to this policy, you can contact us through the feedback channels listed in the chapter of the \"How to contact us\" chapters in this policy, and we will answer you as soon as possible.", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 72998, "text": "1. How do we collect and use information", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 72999, "text": "We collect your personal information mainly to use services easier and more satisfactory to you and other users.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73000, "text": "In the process of using our services, we will collect information you actively provide or because of the service provided by the service as follows to provide you with your services and ensure your account security:", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73001, "text": "When you use our products and/or services, we need/may need to collect and use your personal information, including the following: below:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73002, "text": "1. In order to realize the basic functions of our products and/or services to you, you must authorize the necessary information we collect and use.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73003, "text": "If you refuse to provide the corresponding information, you will not be able to use our products and/or services normally.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide necessary information, you will not be able to use products and/or services normally."}
{"task": "rw_110.jsonl", "id": 73004, "text": "2. In order to provide you with additional functions to provide you and/or services, you can choose to authorize the information we collect and use.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73005, "text": "If you refuse to provide it, you will not be able to use related additional functions normally or cannot achieve the functional effects we intend to achieve, but it will not affect your basic functions of using our products and/or services.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide non -necessary information, it will not be able to use related additional functions normally, but does not affect the basic function."}
{"task": "rw_110.jsonl", "id": 73006, "text": "(1) Basic necessary function", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73007, "text": "1. Register and log in", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73008, "text": "(1) Mobile phone number registration and login: When you register and log in to related services, you can create an account through your mobile phone number. The information is collected to help you complete the registration and meet the real identity information certification requirements of relevant laws and regulations.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your mobile phone number to help you complete the registration and meet the true identity information certification requirements of laws and regulations."}
{"task": "rw_110.jsonl", "id": 73009, "text": "The mobile phone number belongs to personal sensitive information. If you refuse to provide the \"mobile phone number login\" method to register and log in, it does not affect your registration and login in other ways, nor does it affect the normal use of other functions.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide a mobile phone number, you will not be able to use the \"mobile phone number login\" method to register and log in, but it does not affect other ways to register and log in."}
{"task": "rw_110.jsonl", "id": 73010, "text": "(2) One -click login: Based on our cooperation with communication operators, when you use the \"one -click login of this machine number\" function, after your explicit consent, the operator will send us your mobile phone number toYou provide a quick login service.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the \"one -click login of this machine number\" function, you can collect your number to the operator with the consent."}
{"task": "rw_110.jsonl", "id": 73011, "text": "The mobile phone number belongs to personal sensitive information. If you refuse to provide the \"one -click login of this machine number\" to register and log in, but it does not affect your registration in other ways, nor does it affect the normal use of other functions.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide a mobile phone number, you will not be able to use the \"one -click login of this machine number\" to register and log in, but it does not affect other ways to register and log in."}
{"task": "rw_110.jsonl", "id": 73012, "text": "(3) Account login: You can use quickly register, we will automatically generate account numbers and passwords, so that you can register quickly.", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73013, "text": "You can also modify your registered account name and password to define registration. You can use our services by registering successful account numbers and passwords.", "label": ["Important", "Edit/Control"], "rewrite": "You can modify your registered account name and password for custom registration."}
{"task": "rw_110.jsonl", "id": 73014, "text": "(4) We may collect your network identity identification information (including system accounts, passwords, IP addresses, personal digital certificates) and personal common equipment information (including hardware serial number, hardware model, device name, equipment MAC address, operating system system, operating system systemTypes, operating system versions, software lists, device unique device recognition codes, network status, operators) are used to mark you as our users.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may collect your network identity identification information and personal commonly used equipment information to mark you as our users."}
{"task": "rw_110.jsonl", "id": 73015, "text": "2. Real -name authentication", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73016, "text": "In order to meet the requirements of relevant laws, regulations, policies and the requirements of relevant competent authorities, real -name authentication must be performed and enjoyed after registration.", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73017, "text": "We will collect your real -name identity information (including name, ID number, photo, etc.) when obtaining your consent or active provision.You are restricted in the process of using Qinyou games.", "label": ["Important", "First Party Collection Information"], "rewrite": "You agree or take the initiative to provide your real -name identity information for your login game."}
{"task": "rw_110.jsonl", "id": 73018, "text": "In order to achieve the purpose of identity certification, you agree and authorize us to provide, query, and check your aforementioned identity information to relevant identity authentication agencies (such as the national unified real -name certification system).", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "You agree and authorize us to provide, inquire, and check your identity information to relevant identity authentication agencies."}
{"task": "rw_110.jsonl", "id": 73019, "text": "(2) Additional business functions", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73020, "text": "When you use our additional business functions, in order to satisfy you the purpose of providing the product and service, in addition to the registration information, you also need to provide us with your personal identity information, location information, and other services to youInformation, if you do not use specific products and services, you do not need to provide relevant information (the following will be clarified in detail).", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If you use specific products or services, you need to provide personal identity information, location information and other information for you."}
{"task": "rw_110.jsonl", "id": 73021, "text": "1. Based on the additional function of the camera.", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73022, "text": "You can use this function to use this function to scan the function to log in to multi -platform after turning on the camera, flash, and vibration permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "Open the camera, flash, and vibration."}
{"task": "rw_110.jsonl", "id": 73023, "text": "We use TrueDepth, API to collect the face information of the TrueDepth camera, and use the collected information for the character's facial expression animation (such as synchronization of expressions) in the game.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We use TrueDepth API to collect face information for the character's facial expression animation in the game."}
{"task": "rw_110.jsonl", "id": 73024, "text": "Any data collected by TrueDepth and API is only stored in your device and will not be shared with third parties.", "label": ["Data Retention", "Third Party Sharing/ Disclosure", "Important"], "rewrite": "The data collected through the TrueDepth API is only stored in the device and will not be shared with third parties."}
{"task": "rw_110.jsonl", "id": 73025, "text": "Camera information is a sensitive information. Rejecting to provide this information will only make you unable to use related functions, but it does not affect other functions of your product normally.", "label": ["Important", "First Party Collection Information"], "rewrite": "Refusing to provide camera information only makes you unable to use related functions, but does not affect other functions."}
{"task": "rw_110.jsonl", "id": 73026, "text": "You can turn off the camera permissions at any time.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73027, "text": "2. Function based on positioning information.", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73028, "text": "In order to quickly identify/add/invite your friends around your location, you can choose to authorize to call the location permissions in the device you use.", "label": ["Permission Acquisition", "Important"], "rewrite": "You can authorize the location permissions in your device."}
{"task": "rw_110.jsonl", "id": 73029, "text": "When you turn on the device positioning function and use the relevant services provided by our position, we will obtain your general location information through the network, or to obtain your exact location information through the IP address, GPS, and WLAN or base stations that can provide relevant information.Essence", "label": ["Permission Acquisition", "Important"], "rewrite": "When you turn on the device positioning function and use the relevant services provided by our position, we will collect your location information."}
{"task": "rw_110.jsonl", "id": 73030, "text": "Location information is sensitive information. Rejecting to provide this information will only make you unable to use the functions related to location information, but it does not affect other functions of your product normally.", "label": ["Important", "First Party Collection Information"], "rewrite": "Refusing to provide location information only makes you unable to use the functions related to location information, but does not affect the use of other functions."}
{"task": "rw_110.jsonl", "id": 73031, "text": "3. Business card function.", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73032, "text": "You can modify or supplement your avatar, nickname, gender, birthday, address, this information is your account information.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can modify or supplement your avatar, nickname, gender, birthday, address."}
{"task": "rw_110.jsonl", "id": 73033, "text": "You do not provide the above information that will not affect other functions of your product normally.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you do not provide account information, it will not affect other functions of your products normally."}
{"task": "rw_110.jsonl", "id": 73034, "text": "We will strictly protect the personal information involved in such account information.", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73035, "text": "4. Information release function.", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73036, "text": "After you have registered successfully, you can publish a circle topic in the circle and comment on the content of other user circles.", "label": ["Edit/Control", "Important"], "rewrite": "You can publish a circle topic in the circle and comment on the content of other user circles."}
{"task": "rw_110.jsonl", "id": 73037, "text": "In the process, we will collect your equipment information and log information.", "label": ["Important", "First Party Collection Information"], "rewrite": "In the process of publishing topics or comments, we will collect your equipment information and log information."}
{"task": "rw_110.jsonl", "id": 73038, "text": "5. Payment function.", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73039, "text": "You can obtain our products and/or services related to/or service -related virtual products, including game coins, game props, etc.", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73040, "text": "Please note that the payment function will be provided to you by a third -party payment institution that cooperates with us.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The payment function is provided to you by a third -party payment institution that cooperates with us."}
{"task": "rw_110.jsonl", "id": 73041, "text": "Third -party payment institutions may need to collect your name, bank card type and card number, validity period and mobile phone number.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Third -party payment institutions may need to collect your name, bank card type and card number, validity period and mobile phone number."}
{"task": "rw_110.jsonl", "id": 73042, "text": "The bank card number, validity period, and mobile phone number are personal sensitive information. This information is an information necessary for payment functions. It refuses to provide normal use that will cause you to unable to use this function, but does not affect other functions.", "label": ["Important", "First Party Collection Information"], "rewrite": "Refusing to provide a bank card number, validity period and mobile phone number will cause you to unable to use the payment function, but it does not affect the normal use of other functions."}
{"task": "rw_110.jsonl", "id": 73043, "text": "We will not get information such as payment accounts, passwords and other information related to you.", "label": ["Important"], "rewrite": "We will not get information such as payment accounts, passwords and other information related to you."}
{"task": "rw_110.jsonl", "id": 73044, "text": "After your successful payment, we will only obtain the verification information of your payment from the third -party payment service provider, and then provide you with the corresponding virtual products.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "After your successful payment, we will only obtain the payment results verification information from the third -party payment service provider."}
{"task": "rw_110.jsonl", "id": 73045, "text": "If you want to understand the specific rules of third -party service providers to collect personal information, please refer to the privacy policy of the third -party payment service provider you choose.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73046, "text": "In order to show you the transaction information of the account and ensure the security of the transaction, we will collect the information you generate in the process of using our service (such as the product or service information, specific order number, order creation time, transaction amount) for your purchases for easyYou manage the order.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect the information you generated during the use of our service to facilitate your management of orders."}
{"task": "rw_110.jsonl", "id": 73047, "text": "6. Suspension ball function.", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73048, "text": "To help you better use our products and services, we will obtain suspended ball permissions, so that the account management related functions of our products are suspended on the application.", "label": ["Permission Acquisition", "Important"], "rewrite": "We will obtain the authority of suspended balls so that account management related functions are suspended on the application."}
{"task": "rw_110.jsonl", "id": 73049, "text": "7. Exit function.", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73050, "text": "We will obtain a compulsory withdrawal from the background process permissions to use the exit function of our products normally.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "We will obtain a compulsory exit process permissions to use the product exit function."}
{"task": "rw_110.jsonl", "id": 73051, "text": "8. Installation function.", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73052, "text": "To help you better use the installation service, we will obtain request installation application permissions, allowing the product to use this permissions to automatically complete the new version installation when the product releases a new version.", "label": ["Permission Acquisition", "Important"], "rewrite": "We will obtain a request installation application right to automatically complete the new version installation."}
{"task": "rw_110.jsonl", "id": 73053, "text": "9. Safety guarantee function.", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73054, "text": "In order to improve the security of your services to provide services with our affiliated companies and partners, protect the security of personal property of you or other users or the public, and better prevent fishing websites, fraud, network vulnerabilities, computer viruses, and cyber attacks, Security risks such as network invasion, we will collect the necessary information to achieve security guarantee functions.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "We will collect the necessary information to realize the safety guarantee function."}
{"task": "rw_110.jsonl", "id": 73055, "text": "We may use or integrate your account information, transaction information, equipment information, service log information, and our affiliated companies and partners to obtain information on your authorization or sharing in accordance with the law to comprehensively judge the risk of account transaction, authentication, testing and preventionSafety events, and take necessary records, audits, analysis, and disposal measures.", "label": ["Important", "Data Security", "Usage"], "rewrite": "We may use or integrate your various information and our related companies and partners to obtain your authorization or information shared in accordance with the law to determine transaction risks, conduct authentication, test and prevent security incidents, and take necessary measures."}
{"task": "rw_110.jsonl", "id": 73056, "text": "(1) In order to ensure the safe operation of software and services, we will collect the equipment attribute information of your end user:, SDK version, device manufacturer, equipment model, equipment language, equipment name, operating system and application version and type, type and type, and type, and types, and types, and types, and types, and types, and types, and types, and types, and types, and types, and types, and types, and types, and types, and types, and types, and types, and types, and types, and types, and types, and types, and types, and types, and types, and types, and types, and types, and types, and types, and application versions and types, and types, and types, and types, and application versions and types of application.Language settings, resolution, IP address, GPS location, system platform, system version, application package name and version, application time before and after application, independent device logo, network card (MAC) address, iOS advertising logo (IDFA), international mobile device, international mobile devicesIdentification code (IMEI), anonymous device identifier (OAID), integrated circuit card recognition code (ICCID), Androidid, sensor information, Bluetooth information, WIFI status information, CPU information, memory information, equipment information, battery usage, network connection, network connectionInformation including type, type, state, state, network quality data, and operation logs.", "label": ["Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "In order to ensure the safe operation of software and services, we will collect the equipment attribute information of your end users."}
{"task": "rw_110.jsonl", "id": 73057, "text": "Application source.", "label": ["Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "For product operation safety, we will collect the installation and operation information related to the application."}
{"task": "rw_110.jsonl", "id": 73058, "text": "(3) We may use your account information, transaction information, equipment information, service log information, as well as the information that our affiliated parties and partners are obtained or shared according to law to judge the security of the account, conduct authentication, test and test, andPrevent security incidents.", "label": ["Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "We may use your various information and our related parties and partners to obtain information that you authorize or shared according to law to determine account security, conduct authentication, test and prevent security incidents."}
{"task": "rw_110.jsonl", "id": 73059, "text": "10. Customer service.", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73060, "text": "If you contact our customer service, we may need you to provide the necessary personal information for authentication to ensure your account security.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When contacting customer service, collect personal information for authentication to ensure account security."}
{"task": "rw_110.jsonl", "id": 73061, "text": "In order to provide services in accordance with your demand, after your authorization, artificial customer service personnel need to inquire or verify your relevant information within the scope of your authorization. We will adopt technical and management measures as much as possible to ensure your information security and confidentiality.Use within the range.", "label": ["Important", "Data Security", "Usage"], "rewrite": "Artificial customer service staff inquire or verify your relevant information within the scope of your authorization, and we take information security and confidentiality measures."}
{"task": "rw_110.jsonl", "id": 73062, "text": "We may also save your contact information (the mobile phone number, mailbox or other contact information you use or actively provided), your communication records and content with us, and other necessary information in order to provide you and record customer service.", "label": ["Important", "Usage"], "rewrite": "Collect contact information, communication records and content, as well as other necessary information to provide and record customer service."}
{"task": "rw_110.jsonl", "id": 73063, "text": "11. You understand and agree that some single services may require you to open specific access rights in your device to achieve the collection and use of information involved in these permissions:", "label": ["Permission Acquisition", "Important"], "rewrite": "You need to open specific access permissions in your device to provide some single services."}
{"task": "rw_110.jsonl", "id": 73064, "text": "(1) After you turn on the storage authority, you allow us to access, read, modify or delete your storage space so that you can download, save, modify, delete photos, media content and documents on the memory card to achieveThe corresponding service functions such as game screenshots, screen records, and custom avatars.", "label": ["Permission Acquisition", "Important"], "rewrite": "Open the storage permission so that we can access, read, modify or delete your storage space."}
{"task": "rw_110.jsonl", "id": 73065, "text": "(2) After you open the position permissions, we can get your location information so that you can quickly identify/add/invite nearby friends.", "label": ["Permission Acquisition", "Important"], "rewrite": "Open the location permissions to obtain location information to quickly identify/add/invite nearby friends."}
{"task": "rw_110.jsonl", "id": 73066, "text": "(3) After you turn on the album and/or camera (camera) permissions, you can upload and take photos/pictures/videos to realize the functions of upload information, share pictures, or communicate with customer service to provide proof.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "Open the album and/or camera (camera) permissions so that you can upload and take photos/pictures/videos."}
{"task": "rw_110.jsonl", "id": 73067, "text": "(4) After you turn on the microphone rights, you can realize the voice chat function.", "label": ["Permission Acquisition", "Important"], "rewrite": "Open the microphone right to achieve voice chat function."}
{"task": "rw_110.jsonl", "id": 73068, "text": "(5) After you turn on the equipment information permissions, you allow us to obtain your device information as the unique identifier for your device to provide you with pages to display and recommend personalized content in accordance with your needs, understand product adaptability, understand product adaptability, Identify abnormal status and ensure the security of our services and operations.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "Open the equipment information permissions to obtain equipment information as the unique identifier of the equipment."}
{"task": "rw_110.jsonl", "id": 73069, "text": "(6) After you turn on the modification system settings, you allow our application to modify your system settings.", "label": ["Permission Acquisition", "Important"], "rewrite": "Open the modification system settings to modify your system settings."}
{"task": "rw_110.jsonl", "id": 73070, "text": "When you need to close these functional authority, most mobile devices will support your needs. For specific methods, please refer to or contact your mobile device service providers or manufacturers.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73071, "text": "Please note that when you start the right of power, it means that you authorize us to collect and use relevant information to provide you with corresponding services. Once you turn off the right of authority, it means that you cancel the authorization.Using relevant information, it is impossible to provide you with the service corresponding to the permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "The opening of one authority means that the authorization is authorized to collect and use the relevant information to provide corresponding services. Close the authority to cancel the authorization representative, and no longer continue to collect and use relevant information based on the corresponding permissions."}
{"task": "rw_110.jsonl", "id": 73072, "text": "However, your decision to close permissions will not affect the collection and use of information based on your authorization.", "label": ["Permission Acquisition", "Important"], "rewrite": "Close authority will not affect the collection and use of information based on authorization."}
{"task": "rw_110.jsonl", "id": 73073, "text": "12. In order to ensure your game account security, create a fair, healthy and safe game environment, we will collect information such as your game recognition information, hardware and operating system information, application lists, processes, and game collapse records to combat to combatDestroy the fair environment or interference of the game, and destroy the normal behavior of game services (such as to detect piracy, scanned plug -in, prevent cheating, etc.).", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your game recognition information, hardware and operating system information, application lists, processes, and game crash records to ensure game fairness."}
{"task": "rw_110.jsonl", "id": 73074, "text": "13. When you interact with other players through text, pictures, voice and other methods, we may collect and save the above information you send to filter the improper content of pornography, violence, politics, abuse, malicious advertisements to purify the networkEnvironment, maintain a healthy network environment.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect and save the interactive information you sent to filter improper content such as pornography, violence, politics, abuse, and malicious advertisements."}
{"task": "rw_110.jsonl", "id": 73075, "text": "14. Qinyou some products (advertising push service products list) will provide you with advertising push services.", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73076, "text": "We may use your device logo, such as IMEI, IDFA, OAID, etc., such as exposure, clicking data, etc., device information such as system language, high -wide screen, screen direction and other information.Interests of advertising, evaluation and improvement of our advertising, other promotions and promotion activities, and business analysis.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Use your device logo and equipment information to provide advertisements you may be interested in, evaluate and improve the effects of promotional promotion activities and business analysis."}
{"task": "rw_110.jsonl", "id": 73077, "text": "You can learn about the principle of showing advertisements on the advertising page.", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73078, "text": "If you don't want to receive personalized advertising services, you can go to [Settings]-[Privacy]-[Personalized Advertising] in products that provide advertising push services.", "label": ["Important", "Edit/Control"], "rewrite": "Go to [Settings]-[Privacy]-[Personalized Advertising] to close personalized advertising services in the product providing advertising push services."}
{"task": "rw_110.jsonl", "id": 73079, "text": "If you choose to close, the number of ads you see will not decrease, but the product will no longer show you personalized advertisements, and the ads you see may be reduced with your preference.", "label": ["Important", "Edit/Control"], "rewrite": "Closing personalized advertising services will no longer show personalized advertising without reducing the number of advertising."}
{"task": "rw_110.jsonl", "id": 73080, "text": "15. According to relevant laws and regulations and national standards, in the following circumstances, we may collect, use, and provide your relevant personal information without asking your authorization consent:", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "According to relevant laws and regulations and national standards, in the following circumstances, we may collect, use, and provide your relevant personal information without asking your authorization consent:"}
{"task": "rw_110.jsonl", "id": 73081, "text": "(1) Directly related to national interests such as national security and national defense security;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "(1) Directly related to national interests such as national security and national defense security;"}
{"task": "rw_110.jsonl", "id": 73082, "text": "Directly related to the major public interests such as public safety, public health, and public knowledge;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Directly related to the major public interests such as public safety, public health, and public knowledge;"}
{"task": "rw_110.jsonl", "id": 73083, "text": "(2) Directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "(2) Directly related to criminal investigation, prosecution, trial, and judgment execution;"}
{"task": "rw_110.jsonl", "id": 73084, "text": "(3) For the maintenance of major legitimate rights and interests such as life, property, and reputation of your or other individuals, it is difficult to get my consent;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "(3) For the maintenance of major legitimate rights and interests such as life, property, and reputation of your or other individuals, it is difficult to get my consent;"}
{"task": "rw_110.jsonl", "id": 73085, "text": "(4) The personal information collected is publicly disclosed to the public by itself;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "(4) The personal information collected is publicly disclosed to the public by itself;"}
{"task": "rw_110.jsonl", "id": 73086, "text": "(5) Collect personal information from the information disclosed by legal and publicly disclosed, such as legal news reports, government information disclosure and other channels;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "(5) Collect personal information from the information disclosed by legal and publicly disclosed, such as legal news reports, government information disclosure and other channels;"}
{"task": "rw_110.jsonl", "id": 73087, "text": "(6) Signing and fulfilling the contract according to your requirements;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "(6) Signing and fulfilling the contract according to your requirements;"}
{"task": "rw_110.jsonl", "id": 73088, "text": "(7) The necessary and stable operation of the products or services provided by the maintenance of the products provided, such as the failure of discovering and disposing of products or services;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "(7) The necessary and stable operation of the products or services provided by the maintenance of the products provided, such as the failure of discovering and disposing of products or services;"}
{"task": "rw_110.jsonl", "id": 73089, "text": "(8) It is necessary to carry out legal news reports;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "(8) It is necessary to carry out legal news reports;"}
{"task": "rw_110.jsonl", "id": 73090, "text": "(9) For the need to carry out statistics or academic research in public interests, and it provides academic research or description results, it is identified to identify the personal information contained in the results;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "(9) For the need to carry out statistics or academic research in public interests, and it provides academic research or description results, it is identified to identify the personal information contained in the results;"}
{"task": "rw_110.jsonl", "id": 73091, "text": "(10) Other circumstances stipulated in laws and regulations.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "(10) Other circumstances stipulated in laws and regulations."}
{"task": "rw_110.jsonl", "id": 73092, "text": "16. Please understand that the functions and services we provide to you are constantly updated and developed. If a function or service is not in the aforementioned instructions and collects your information, we will use page prompts, website announcements, etc.Explain the content, scope and purpose of the collection of information to obtain your consent.", "label": ["Policy Change", "Important"], "rewrite": "If functions or services outside the description collect your information, we will explain to you separately to obtain your consent."}
{"task": "rw_110.jsonl", "id": 73093, "text": "17. At present, in addition to collecting game survey information from a third -party research agency to help us improve the game products and provide services that are suitable for you, and this privacy policy has clearly stated, we will not take the initiative to obtain your individual from a third party from a third party.information.", "label": ["Important", "First Party Collection Information"], "rewrite": "In addition to collecting game survey information from a third -party research agency, we will not take the initiative to obtain your personal information from a third party."}
{"task": "rw_110.jsonl", "id": 73094, "text": "If the business development needs to obtain and process your personal information from a third party in the future, we will strictly abide by the provisions of relevant laws and regulations, asking the third party to obtain your consent and ensure the legitimacy of the information it provides.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you need to obtain and process your personal information from a third party, we will ask the third party to obtain your consent and ensure the legitimacy of the information it provides."}
{"task": "rw_110.jsonl", "id": 73095, "text": "2. Personal information sharing, transfer and public disclosure", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73096, "text": "(1) Personal information sharing", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73097, "text": "Except for the situation stipulated in this privacy policy, without your consent, we will not actively share your personal information until third parties.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Except for the situation stipulated in this privacy policy, without your consent, we will not actively share your personal information until third parties."}
{"task": "rw_110.jsonl", "id": 73098, "text": "If you have other personal information that shared your personal information or you need us to share your personal information into a third party to surpass the original authorization purpose, we will directly or indirectly obtain your consent of your behavior through this third party.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If there are other personal information that shared your personal information or surpassing the original authorization purpose, we will directly or indirectly obtain your explicit consent through the third party."}
{"task": "rw_110.jsonl", "id": 73099, "text": "1. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73100, "text": "In order to better protect the physical and mental health of minors and promote the healthy access of minors, we will try to contact their guardians after suspected minors consumption, inform their guardians and inform them of relevant consumer records and other information.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Important"], "rewrite": "We will notify their guardians in discovering that suspected minors consumption, and informed the guardian of the game -related consumption records."}
{"task": "rw_110.jsonl", "id": 73101, "text": "2. Agent product", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73102, "text": "If you use the game products issued by our agent, we may share your logs and related information (such as logging in logs, etc.) with the development subject or related third parties, for game security analysis, improve game services, and further optimize usersGame experience.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We may share your logs and related information you generate in the game with the development subject or related third parties of the game product issued by the agent."}
{"task": "rw_110.jsonl", "id": 73103, "text": "If we share the aforementioned information, we will take corresponding compliance measures in accordance with relevant laws and regulations to ensure that personal information sharing meets the corresponding laws.", "label": ["Third Party Sharing/ Disclosure", "Data Security"], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73104, "text": "The preceding of the preceding compliance measures include but not limited to the request for the development subject or related third parties to strictly abide by the agreed collection and use your personal information reached by you, and urge the development of the subject or related third parties to adopt appropriate security technology and management measures to ensure yourPersonal information security, etc.", "label": ["Important", "Data Security"], "rewrite": "We will ask the development subject or related third parties to comply with the agreement reached with you and to urge them to take personal information security protection measures."}
{"task": "rw_110.jsonl", "id": 73105, "text": "3. Related product and service", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73106, "text": "When you use other products or services of non -Qinyou games we provide (\"related products\"), after you are clearly authorized, we will bind the Qinyou game product account with related products and correspond toThe nicknames, avatars, records, or other information you authorized by the game product account shared with related products to show it to you or other users in the affiliate, so that you can participate in game welfare activities in related products, and receive corresponding benefits.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "When you use our affiliate products, we have authorized to bind your choice account with related products and share account information with it."}
{"task": "rw_110.jsonl", "id": 73107, "text": "Specific personal information collection and use rules will synchronize with you when you bind your account, and complete your account binding and information sharing after obtaining your authorization consent.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73108, "text": "You can check and manage your game historical information authorization based on the prompts, or choose whether to show your game historical information to other users.", "label": ["Important", "Edit/Control"], "rewrite": "You can view and manage your game historical information authorization or choose whether to show game history information on the related product [Settings] page."}
{"task": "rw_110.jsonl", "id": 73109, "text": "Refusing to authorize does not affect your functions of Qinyou Games and related products.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73110, "text": "4. Third -party service", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73111, "text": "In order to ensure the safe and stable operation of the game and achieve specific functions, some services in Qinyou Games are provided by our affiliates or other third parties.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Some services in the game are provided by our related parties or other third parties."}
{"task": "rw_110.jsonl", "id": 73112, "text": "We will choose third -party and third -party services, urge relevant third parties to collect and use your personal information in accordance with this policy or the agreement reached with you, and take appropriate security technology and management measures to ensure your personal information security.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will ask relevant third parties to abide by the agreement reached with you and urge them to take personal information security protection measures."}
{"task": "rw_110.jsonl", "id": 73113, "text": "For the specific situation of the third -party information sharing of Qinyou Game Products, please refer to the attachment: \"Third -Party Information Sharing List\" (including \"Third -Party SDK Catalog\").", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For the specific situation of the third -party information sharing of Qinyou Game Products, please refer to the attachment: \"Third -Party Information Sharing List\" (including \"Third -Party SDK Catalog\")."}
{"task": "rw_110.jsonl", "id": 73114, "text": "5. Advertising", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73115, "text": "Some products of Qinyou Games will provide you with advertising push services.", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73116, "text": "In order to put on advertising, evaluate, optimize the effect of advertising, we need to share some of your data from third -party partners such as advertisers and agents, and require them to strictly abide by our measures and requirements on data privacy protection, including but not but notIt is limited to the processing of data protection agreements, commitments and related data processing policies to avoid identifying personal identity and ensuring privacy security.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security", "Usage"], "rewrite": "We share some of your data from the advertisers and their agents and other third -party partners, asking them to abide by our measures and requirements on data privacy protection."}
{"task": "rw_110.jsonl", "id": 73117, "text": "How to share data with advertisers such as advertisers, please see the advertising push part of the product \"Third -Party Information Sharing List\" for details.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For details, please refer to the advertisement push part of the product \"Third -Party Information Sharing List\"."}
{"task": "rw_110.jsonl", "id": 73118, "text": "6. Statistical analysis and research", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73119, "text": "In order to improve our capabilities and technical scientific research capabilities, promote service security and technical level in order to provide users with higher quality services, we will ensure that the purpose is legitimate and data security within a reasonable and necessary scope.Scientific research institutes, universities and other institutions shared data after de -identification or anonymous processing.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We will share data from research institutions, research institutes, universities and other institutions within a reasonable and necessary scope."}
{"task": "rw_110.jsonl", "id": 73120, "text": "Without your clear authorization, we will not share with the above agencies that can be used to identify your personal identity information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Without your clear authorization, we will not share information from research institutions, research institutes, universities and other institutions that can be used to identify your personal identity."}
{"task": "rw_110.jsonl", "id": 73121, "text": "(2) Public information disclosure disclosure", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73122, "text": "Except for the special agreement of this policy and in accordance with the law, you do not need to obtain your consent to be disclosed directly. Without your consent, we will not disclose the personal information collected publicly.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Except for the special agreement of this policy and in accordance with the law, you do not need to obtain your consent to be disclosed directly. Without your consent, we will not disclose the personal information collected publicly."}
{"task": "rw_110.jsonl", "id": 73123, "text": "If we must disclose publicly, we will inform you that the purpose of the public disclosure, the type of disclosure information, and the sensitive personal information that may be involved, and obtain your explicit consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If we must disclose publicly, we will inform you that the purpose of the public disclosure, the type of disclosure information, and the sensitive personal information that may be involved, and obtain your explicit consent."}
{"task": "rw_110.jsonl", "id": 73124, "text": "Please note that if you are dealt with in violation of the \"User Agreement\" or any violations of laws and regulations during the use of Qinyou games, we may announce the results and disclose relevant account information in the announcement.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may announce the results of violations of the \"User Agreement\" or illegal and illegal acts, and disclose relevant account information."}
{"task": "rw_110.jsonl", "id": 73125, "text": "(3) Transfer of personal information", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73126, "text": "Without your authorization, we will not transfer your personal information to a third party.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Without your authorization, we will not transfer your personal information to a third party."}
{"task": "rw_110.jsonl", "id": 73127, "text": "With the continuous development of our business, we may conduct merging, acquisition, asset transfer and other transactions. We will inform you that the relevant situation will continue to protect or request new processors to continue in accordance with laws and regulations and the standards required by this policy.Protect your personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If there is a transaction such as mergers, acquisitions, and asset transfer, we will inform you that the relevant situation will continue to protect your personal information in accordance with the laws and regulations and the standards that are not lower than the standards required by this guideline."}
{"task": "rw_110.jsonl", "id": 73128, "text": "3. How do we use cookies or similar technologies", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73129, "text": "We may obtain and use your information through cookies or similar technologies, and store such information as log information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may obtain and use your information through cookies or similar technologies, and store storage as a log information."}
{"task": "rw_110.jsonl", "id": 73130, "text": "By using Cookies, we provide users with a simple and easy -going and personalized network experience.", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73131, "text": "A cookies are a small amount of data, which are sent from a network server to your browser and there are equipment hard disks.", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73132, "text": "We use cookies to make users benefit.", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73133, "text": "For example, in order to make the service login process faster, you can choose to exist in a cookies.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can choose to have a cookies in a cookies for easy login."}
{"task": "rw_110.jsonl", "id": 73134, "text": "This way you can be more convenient and fast when you log in next time.", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73135, "text": "Cookies can help us determine the pages and content you are connected, and you spend time on our specific services and the services you choose.", "label": ["Important", "First Party Collection Information"], "rewrite": "Cookies can determine the pages and content you connect and the time spent on specific services."}
{"task": "rw_110.jsonl", "id": 73136, "text": "We and third -party partners may collect and use your information through cookies or similar technologies and store these information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We and third -party partners may collect and use your information through cookies or similar technologies."}
{"task": "rw_110.jsonl", "id": 73137, "text": "We use our own cookies or similar technologies, which may be used for the following uses:", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73138, "text": "1. Remember your identity.", "label": ["Usage"], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73139, "text": "For example: cookies or similar technologies help us identify your identity as our registered user, or save you to provide us with your preferences or other information;", "label": ["Important", "Usage"], "rewrite": "Cookies or similar technologies help identify the identity of registered users, or preserve personal preference information."}
{"task": "rw_110.jsonl", "id": 73140, "text": "2. Analyze the situation of your service.", "label": ["Usage"], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73141, "text": "We can use cookies or similar technologies to understand what activities or services you use our services or services;", "label": ["Important", "Usage"], "rewrite": "You can use cookies or similar technologies to learn about the most popular services or activities."}
{"task": "rw_110.jsonl", "id": 73142, "text": "3. Advertising optimization.", "label": ["Usage"], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73143, "text": "Cookies or similar technologies help us provide you with advertisements related to you instead of universal advertising according to your information.", "label": ["Important", "Usage"], "rewrite": "Cookies or similar technologies help provide personalized advertisements."}
{"task": "rw_110.jsonl", "id": 73144, "text": "We use cookies or similar technologies for the above purpose, and we may collect your non -personal identity information through cookies or similar technologies to advertisers and other partners to analyze how you and other users use our services and use it for our servicesAdvertising Services.", "label": ["Important", "Usage"], "rewrite": "We may collect your non -personal identity information through cookies or similar technologies to advertisers and other partners to analyze your behavior."}
{"task": "rw_110.jsonl", "id": 73145, "text": "There may be Cookies or similar technologies placed by advertisers and other partners in our services.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "There may be Cookies or similar technologies placed by advertisers and other partners in our services."}
{"task": "rw_110.jsonl", "id": 73146, "text": "These cookies or similar technologies may collect non -personal identity information related to you to analyze how users use such services, send ads that you may be interested in, or to evaluate the effect of advertising services.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Cookies or similar technologies placed by advertisers and other partners may collect non -personal identity information related to you to analyze user behavior and send advertisements."}
{"task": "rw_110.jsonl", "id": 73147, "text": "These third -party cookies or similar technologies are collected and used by such information that are not bound by this policy, but are subject to their own information protection statements. We are not responsible for third -party Cookies or similar technologies.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "The collection and use of third -party cookies or similar technologies are not subject to this policy, and we are not responsible for this."}
{"task": "rw_110.jsonl", "id": 73148, "text": "You can refuse or manage cookies or similar technologies through a browser or user selection mechanism.", "label": ["Edit/Control", "Important"], "rewrite": "You can refuse or manage cookies or similar technologies through browser or user selection mechanism."}
{"task": "rw_110.jsonl", "id": 73149, "text": "But please note that if you stop using cookies or similar technologies, we may not be able to provide you with the best service experience, and certain services may not be used normally.", "label": ["Important", "Edit/Control"], "rewrite": "If you stop cookies or similar technologies, certain services may not be used normally."}
{"task": "rw_110.jsonl", "id": 73150, "text": "At the same time, our services will provide a convenient button for management orientation push. You can choose to open or close the personalized content recommendation function according to your own situation.", "label": ["Edit/Control", "Important"], "rewrite": "You can select or turn off the personalized content recommendation function through the convenient button of the directional push."}
{"task": "rw_110.jsonl", "id": 73151, "text": "4. How do we retain, store and protect your information", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73152, "text": "We only retain your personal information during the time limit for the purpose of the \"Privacy Policy\" and the time limit required by laws and regulations.", "label": ["Data Retention", "Important"], "rewrite": "Reserves your personal information within the time limit required for the service purpose, unless the law has other requirements."}
{"task": "rw_110.jsonl", "id": 73153, "text": "We use various security technologies and procedures to prevent information loss, improper use, unauthorized reading or disclosure.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73154, "text": "For example, in certain services, we will use encryption technology (such as SSL) to protect the personal information you provide to us.", "label": ["Important", "Data Security"], "rewrite": "Use encryption technology to protect your personal information."}
{"task": "rw_110.jsonl", "id": 73155, "text": "But please understand that due to the technical restrictions and the limitations of risk prevention, even if we have tried to strengthen security measures, we cannot always ensure that the information is 100 % security.", "label": ["Important", "Data Security"], "rewrite": "Although there are security measures, it is impossible to fully guarantee that there is no security problem."}
{"task": "rw_110.jsonl", "id": 73156, "text": "You need to understand that the system and communication network you use to access our services may occur due to the situation outside the control scope.", "label": ["Important", "Data Security"], "rewrite": "Systems and communication networks may have problems due to unprepared factors."}
{"task": "rw_110.jsonl", "id": 73157, "text": "We only store your personal information within the shortest time limit during the purpose of this policy and the shortest time limit required by laws and regulations.", "label": ["Data Retention", "Important"], "rewrite": "Storage of your personal information within the shortest time limit during the purpose of this policy and the shortest time limit required by laws and regulations."}
{"task": "rw_110.jsonl", "id": 73158, "text": "If we terminate our services or operations, we will stop collecting your personal information in time. At the same time, we will comply with relevant laws and regulations to inform you in advance, and delete or processes your personal information after termination of the service or operation.However, except for laws and regulations or regulatory departments.", "label": ["Important", "Cessation of Operations"], "rewrite": "After we terminate the service or operation, we will stop information collection in time, delete or processes information, and notify you in advance, except for laws and regulations or regulators."}
{"task": "rw_110.jsonl", "id": 73159, "text": "The personal information we collected and generated in the operation of the People's Republic of China is stored in China, except for the following situations:", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in domestic operations is stored in China. Except for the following situations: 1. The laws and regulations have clearly stipulated; 2. Get your authorization consent; 3. Our services you use involved cross -border, we need we needProvide your personal information overseas."}
{"task": "rw_110.jsonl", "id": 73160, "text": "1. The laws and regulations have clear stipulation;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73161, "text": "2. Get your authorization consent;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73162, "text": "3. The service you use involves cross -border, and we need to provide your personal information overseas.", "label": ["Data Retention", "Important", "Risk"], "rewrite": "The service you use involves cross -border, and we need to provide your personal information overseas."}
{"task": "rw_110.jsonl", "id": 73163, "text": "In response to the above situations, we will ensure that your personal information is provided with sufficient protection in accordance with the requirements of this policy and national laws and regulations.", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73164, "text": "We attach great importance to information security, set up a special security team, and take all reasonable and feasible measures to protect your personal information:", "label": ["Data Security"], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73165, "text": "(1) Data security technical measures", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73166, "text": "We will adopt security measures that meet industry standards, including establishing reasonable institutional specifications and security technology to prevent your personal information from being accessed and modified by unauthorized access to avoid data damage or loss.", "label": ["Important", "Data Security"], "rewrite": "Establish a reasonable institutional norms and security technologies to protect your information security."}
{"task": "rw_110.jsonl", "id": 73167, "text": "Our services have adopted a variety of encryption technologies. For example, in some of our services, we will use encrypted technology (such as SSL) to protect your personal information, use encryption technology for encryption and preservationTechnical isolation.", "label": ["Important", "Data Security"], "rewrite": "Use encryption technology to encrypt your personal information and isolate through isolation technology."}
{"task": "rw_110.jsonl", "id": 73168, "text": "When the personal information is used, such as information display and information association calculation, we will use multiple data desensitization technology to enhance the security of information in use.", "label": ["Important", "Data Security"], "rewrite": "Use a variety of data desensitization technology to enhance the security of information in use."}
{"task": "rw_110.jsonl", "id": 73169, "text": "We will also use strict data access permissions control and multiple identity authentication technology to protect personal information to avoid data from illegal use.", "label": ["Important", "Data Security"], "rewrite": "Use strict data access permissions control and multiple identity authentication technology to protect personal information."}
{"task": "rw_110.jsonl", "id": 73170, "text": "(2) Other security measures we have taken to protect personal information", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73171, "text": "We manages the storage and use of personal information by establishing a data classification classification system, data security management specifications, and data security development specifications.", "label": ["Important", "Data Security"], "rewrite": "Establish a data classification hierarchical system, data security management specifications, and data security development specifications to manage the storage and use of personal information."}
{"task": "rw_110.jsonl", "id": 73172, "text": "We control the data through the confidentiality agreement, monitoring and audit mechanism through information contactors.", "label": ["Important", "Data Security"], "rewrite": "Through information contacts confidentiality agreements, monitoring and auditing mechanisms, the data is fully securely controlled."}
{"task": "rw_110.jsonl", "id": 73173, "text": "We will also organize safety and privacy protection training courses to strengthen employees' awareness of safety and understand the importance of protection.", "label": ["Important", "Data Security"], "rewrite": "Organize safety and privacy protection training courses to strengthen employee understanding."}
{"task": "rw_110.jsonl", "id": 73174, "text": "(3) We only allow employees and partners who need to know these information to visit your personal information, and set up strict access to control and monitoring mechanisms for this.", "label": ["Important", "Data Security"], "rewrite": "Set strict access to control and monitoring mechanisms."}
{"task": "rw_110.jsonl", "id": 73175, "text": "We also require all personnel who may be exposed to your personal information to fulfill the corresponding confidentiality obligations. If our employees and partners fail to fulfill their confidentiality obligations, we may be held legal or suspended with our cooperative relationship.", "label": ["Important", "Data Security"], "rewrite": "All personnel who may be exposed to your personal information fulfill the corresponding confidentiality obligations, otherwise it may be held accountable."}
{"task": "rw_110.jsonl", "id": 73176, "text": "(4) We will take all reasonable and feasible measures to ensure unrelated personal information.", "label": ["Important", "Data Security"], "rewrite": "Ensure unrelated personal information."}
{"task": "rw_110.jsonl", "id": 73177, "text": "(5) The Internet is not an absolutely secure environment, and the communication method of email, instant messaging, social software or other service software cannot be determined whether it is completely encrypted. We recommend that you use complex passwords when using this kindPay attention to protect your information security.", "label": ["Important", "Data Security"], "rewrite": "It is recommended that you use complex passwords when using software that can communicate with other users and pay attention to protecting information security."}
{"task": "rw_110.jsonl", "id": 73178, "text": "(6) The Internet environment is not 100 % security. We will try our best to ensure or guarantee the security of your personal information you send to our personal information.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73179, "text": "If our physical, technical, or management protection facilities are damaged, and personal information is caused by unauthorized access, public disclosure, tampering, or destruction, which will cause your legitimate rights and interests to be damaged, we will bear the corresponding legal responsibility.", "label": ["Important", "Data Security"], "rewrite": "If our physical, technical, or management protection facilities are damaged, the information is caused by unauthorized access, public disclosure, tampering or destruction, which will cause your legitimate rights and interests to be damaged, and we will bear the corresponding legal responsibility."}
{"task": "rw_110.jsonl", "id": 73180, "text": "(7) Safety event disposal", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73181, "text": "When communicating or purchasing goods and services with third parties through our services, you inevitably disclose your information from the other party or the potential transaction of the transaction, such as the contact method or mailing address.", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73182, "text": "Please protect your information properly and provide others with only necessary situations.", "label": ["Important", "Data Security"], "rewrite": "Protecting your personal information properly, it is provided to others only under the necessary situation."}
{"task": "rw_110.jsonl", "id": 73183, "text": "In order to cope with the possible risks of personal information leakage, damage and loss, we have formulated a number of systems to clarify the classification and classification standards of security events, the classification standards of security vulnerabilities, and the corresponding processing process.", "label": ["Important", "Data Security"], "rewrite": "A number of systems have been formulated to clarify the classification and classification standards of safety events, safety vulnerabilities, and corresponding processing processes."}
{"task": "rw_110.jsonl", "id": 73184, "text": "We have also established a special emergency response team for security incidents. In accordance with the requirements of safety incidents, we initiated the safety plan for different security incidents to conduct stop loss, analysis, positioning, formulation of remedial measures, and combined with relevant departments to trace the source and strike.", "label": ["Important", "Data Security"], "rewrite": "A special emergency response team was established for security incidents to launch a safety plan for different security incidents, conduct stop loss, analysis, positioning, formulation of remedial measures, and combined with relevant departments to trace the source and crack down."}
{"task": "rw_110.jsonl", "id": 73185, "text": "After unfortunately, the information security incident occurs, we will inform you in a timely manner in accordance with the requirements of the laws and regulations: the basic situation and possible impact of the security incident, the disposal measures we have taken or we are going to take, the suggestions that you can prevent and reduce risks independently and reduce risks, Remedy for your remedy.", "label": ["Important", "Data Security"], "rewrite": "Inform you in a timely manner that the basic situation and possible impact of safety events, handling measures that have been taken or will be adopted, suggestions that can prevent and reduce risks, and remedy measures."}
{"task": "rw_110.jsonl", "id": 73186, "text": "At the same time, we will inform you that the incident -related situation is in the form of mail, letter, telephone, push notification, etc. When it is difficult to inform the information subject one by one, we will publish an announcement in a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "When it is difficult to inform the subject of personal information one by one, it will be published in a reasonable and effective way."}
{"task": "rw_110.jsonl", "id": 73187, "text": "At the same time, we will also actively report the disposal of information security incidents in accordance with the requirements of the regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "The disposal of personal information security incidents will be reported in accordance with the requirements of the regulatory authorities."}
{"task": "rw_110.jsonl", "id": 73188, "text": "Please understand that due to the technical restrictions and the limitations of risk prevention, even if we have tried to strengthen security measures, we cannot always ensure that the information is 100 % security.", "label": ["Important", "Data Security"], "rewrite": "Although there are security measures, it is impossible to fully guarantee that there is no security problem."}
{"task": "rw_110.jsonl", "id": 73189, "text": "You need to understand that you can access the system and communication network we use in our services, and problems may occur due to the situation outside our controlled range.", "label": ["Important", "Data Security"], "rewrite": "Systems and communication networks may have problems due to unprepared factors."}
{"task": "rw_110.jsonl", "id": 73190, "text": "Please keep your account, password and other identity elements properly.", "label": ["Important", "Data Security"], "rewrite": "Keep your account, password and other identity elements properly."}
{"task": "rw_110.jsonl", "id": 73191, "text": "When you use our service, we will identify your identity through your account, password and other identity elements.", "label": ["Important", "Data Security"], "rewrite": "You can verify your identity through your account number, password and other identity elements."}
{"task": "rw_110.jsonl", "id": 73192, "text": "Once you leak the aforementioned information, you may suffer losses and may be unfavorable to you.", "label": ["Important"], "rewrite": "Once you leak accounts, passwords and other identity elements, it may suffer adversely."}
{"task": "rw_110.jsonl", "id": 73193, "text": "If you find the account, password and/or other identity elements that may be leaked, please contact us immediately so that we can take corresponding measures in time to avoid or reduce related losses.", "label": ["Important", "Data Security"], "rewrite": "If the personal information discovered, please contact our customer service immediately."}
{"task": "rw_110.jsonl", "id": 73194, "text": "Fifth, the mail and information we send to you", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73195, "text": "1. Mail and information push", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73196, "text": "When you use our service, we may use your information to send an email or push notification to your device.", "label": ["Important", "Usage"], "rewrite": "We may use your information to send an email or push notification to your device."}
{"task": "rw_110.jsonl", "id": 73197, "text": "If you don't want to receive this information, you can choose to cancel the subscription on the device according to the instructions we sent to you.", "label": ["Important", "Edit/Control"], "rewrite": "You can choose to cancel the subscription push message according to the instructions of the email."}
{"task": "rw_110.jsonl", "id": 73198, "text": "2. Announcement related to service", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73199, "text": "We may issue announcements related to service -related time when we may (for example when we suspend a certain service due to system maintenance).", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73200, "text": "You may not be able to cancel these announcements related to services and nature.", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73201, "text": "6. Your rights", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73202, "text": "During your use of Qinyou game service, we may provide you with the corresponding operation settings as the specific situation of the game product so that you can inquire, copy, correct, supplement, delete, or withdraw your relevant personal information. You can refer to the corresponding game according to the corresponding gameThe specific guidelines of the product are operated.", "label": ["Important", "Edit/Control"], "rewrite": "You can check, copy, correct, supplement, delete, or withdraw your relevant personal information through the corresponding operation settings."}
{"task": "rw_110.jsonl", "id": 73203, "text": "In addition, we have set up a complaint report channel, and your opinions will be dealt with in a timely manner.", "label": ["Important", "Edit/Control"], "rewrite": "Your opinion will be dealt with in a timely manner through complaint report channels."}
{"task": "rw_110.jsonl", "id": 73204, "text": "1. Inquiry of personal information collection and use rules", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73205, "text": "You can check the product collection and use rules at any time in the Qinyou game [Settings] interface, including but not limited to this policy, \"Third -Party Information Sharing List\", etc.", "label": ["Important", "Edit/Control"], "rewrite": "View the personal information collection and use rules of the product [Settings] in Qinyou Games."}
{"task": "rw_110.jsonl", "id": 73206, "text": "Please know and understand that the service and corresponding personal information collection and usage in this policy may be different because of the specific services you choose to use, and there are differences in factors such as the equipment models and system versions you use.", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73207, "text": "2. Personal information query, correction", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73208, "text": "(1) You can check and access the basic information of your account (account avatar, nickname, and personal information you choose to fill in), game historical information (such as character levels, achievements, records, records, records, records, records, records, records, records.And the specific game information of each product).", "label": ["Important", "Edit/Control"], "rewrite": "You can query and access the basic information and game historical information in Qinyou game products."}
{"task": "rw_110.jsonl", "id": 73209, "text": "(2) You can query more information about your use of Qinyou game products and services according to the prompts according to the actual situation. For details, please refer to the [Settings] interface description of each product.", "label": ["Important", "Edit/Control"], "rewrite": "You can query more information about the use of specific Qinyou game products and services according to the actual situation. For details, please refer to the [Settings] interface description."}
{"task": "rw_110.jsonl", "id": 73210, "text": "(3) If you have other needs for personal information inquiry, replication, correction, and supplementation, you can also contact us through the contact information described in Article 10 of this policy.", "label": ["Edit/Control", "Important"], "rewrite": "You can contact us with contacting inquiries, replication, correction, and supplementing personal information."}
{"task": "rw_110.jsonl", "id": 73211, "text": "But please note that when you contact us to apply for personal information rights, in order to ensure account number and personal information security, we may verify your identity and account security status.", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "When you contact us to apply for personal information rights, we may verify your identity and account security status."}
{"task": "rw_110.jsonl", "id": 73212, "text": "For your reasonable request, we will support as much as possible, but in the case of the storage scope of our personal information, exceeding the reasonable limit, or responding to your request, we may not be able to cause you or other third -party legitimate rights and interests.Responsive your application.", "label": ["Edit/Control", "Data Security", "Important"], "rewrite": "We may not be able to respond to your application that exceeds the storage range, exceeds the reasonable limit, or it will cause serious damage to your or other third -party legitimate rights and interests."}
{"task": "rw_110.jsonl", "id": 73213, "text": "3. Personal information display and sharing", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73214, "text": "(1) Basic information (avatar, nickname, character level) of your game account will be displayed on your personal homepage, the ranking or related functions you participate in.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Basic information of your game account will be displayed on the personal homepage, the ranking or related functions you participate in."}
{"task": "rw_110.jsonl", "id": 73215, "text": "(2) Your historical game information (specifically but not limited to your login status, battle information/status, and achievement information) will be displayed to you or other users or friends according to your choice.", "label": ["Third Party Sharing/ Disclosure", "Important", "Edit/Control"], "rewrite": "Show your historical game information to you or other users or friends according to your choice."}
{"task": "rw_110.jsonl", "id": 73216, "text": "The game products will provide you with relevant permissions depending on the specific situation so that you can set the aforementioned information according to the publicly display. For details, please refer to the instructions in each product.", "label": ["Important", "Edit/Control"], "rewrite": "You can set the corresponding setting of historical game information."}
{"task": "rw_110.jsonl", "id": 73217, "text": "(3) The information you uploaded or published in Qinyou's game products, or the information you actively shared, will be displayed to users within the scope of the publishing or shared.", "label": ["Third Party Sharing/ Disclosure", "Important", "Edit/Control"], "rewrite": "The information uploaded or published in the game product, or the information shared to the outside, will be displayed according to your choice."}
{"task": "rw_110.jsonl", "id": 73218, "text": "(4) When you authorize third parties to obtain your information in Qinyou games, the third party will disclose your relevant information to you or other users of the third party within your authorization range.", "label": ["Important", "Edit/Control"], "rewrite": "The third party will disclose your relevant information to you or other users of the third party within your authorization range."}
{"task": "rw_110.jsonl", "id": 73219, "text": "For specific display rules and public scope settings, please pay attention to the rules of the third -party platform.", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73220, "text": "4. Collecting and use of authorization of personal information", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73221, "text": "You can change the equipment permissions obtained by deleting information, closing or opening specific product functions, closing or opening a specific product acquisition (the specific permissions are different due to the different equipment models and system versions used by the user).Scope of authorization.", "label": ["Important", "Edit/Control"], "rewrite": "You can change the scope of the authorization of the equipment authority to change information, close or turn on specific product functions, close or turn on the device acquisition."}
{"task": "rw_110.jsonl", "id": 73222, "text": "After withdrawing authorization, you may not be able to use the authorized product function, but do not affect the use of other functions.", "label": ["Important", "Edit/Control"], "rewrite": "After withdrawing authorization, you may not be able to use the authorized product function, but do not affect the use of other functions."}
{"task": "rw_110.jsonl", "id": 73223, "text": "You withdraw authorization will not affect the effectiveness of personal information processing activities that have been performed based on your authorization before withdrawal.", "label": ["Edit/Control", "Important"], "rewrite": "Closing authority will not affect the personal information processing based on authorization."}
{"task": "rw_110.jsonl", "id": 73224, "text": "Some personal information collection and use of the basic functions corresponding to our services. If you want to withdraw the authorization of relevant personal information collection and use may cause us to be unable to provide you with services. In this case, if you still want to withdraw relevant authorization, you can pass throughApply for account cancellation to achieve the demand.", "label": ["Important", "Edit/Control"], "rewrite": "If the authorization of the withdrawal of basic functions, if the service cannot be provided, the relevant authorization may be withdrawn by canceling the account."}
{"task": "rw_110.jsonl", "id": 73225, "text": "5. Account cancellation", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73226, "text": "Through our service registration account, you can submit an account to cancel the application through the following two ways.", "label": ["Important", "Edit/Control"], "rewrite": "Through our service registration account, you can submit the account to cancel the application through the following two ways: (1) Customer service phone: 0512-67678595 Contact the official customer service;: Https://uc.9917.com/member/logout.html"}
{"task": "rw_110.jsonl", "id": 73227, "text": "(1) Customer service phone: 0512-67678595 Contact the official customer service;", "label": ["Important", "Contact Information"], "rewrite": "(1) Customer service phone: 0512-67678595 Contact the official customer service;"}
{"task": "rw_110.jsonl", "id": 73228, "text": "(2) Send mail to kefu@friendtimes.net;", "label": ["Important", "Contact Information"], "rewrite": "(2) Send mail to kefu@friendtimes.net;"}
{"task": "rw_110.jsonl", "id": 73229, "text": "(3) Logging out: https://uc.9917.com/member/logout.html", "label": ["Important", "Contact Information"], "rewrite": "(3) Logging out: https://uc.9917.com/member/logout.html"}
{"task": "rw_110.jsonl", "id": 73230, "text": "Through third -party accounts registered by third -party, such as: Huawei, Xiaomi, OPPO and other third -party accounts, account cancellation requires corresponding third -party customer service or applicable to third -party account cancellation rules and methods for account cancellation applications.", "label": ["Important", "Contact Information"], "rewrite": "Third -party accounts registered by third parties need to be applied for an account for a third -party account."}
{"task": "rw_110.jsonl", "id": 73231, "text": "After completing the cancellation of the game account, in addition to other regulations or this policy, your personal information under this game will delete or anonymous processing, and the related products and services that have previously related to the game account will no longer be related to the association.Essence", "label": ["Important", "Edit/Control"], "rewrite": "After the game account is canceled, the personal information under the game account will be deleted or anonymous, and it is no longer associated with related products and services."}
{"task": "rw_110.jsonl", "id": 73232, "text": "Once the game account is canceled, it will not be recovered, please do it carefully.", "label": ["Important", "Edit/Control"], "rewrite": "Once the cancellation is completed, it will not be restored."}
{"task": "rw_110.jsonl", "id": 73233, "text": "Seven, change", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73234, "text": "We may revise this policy in a timely manner. When the personal information collection and usage rules and other laws and regulations stipulates the matters described in this policy, we will prompt you to change the policy after the version update.", "label": ["Policy Change", "Important"], "rewrite": "When the version is updated, we will prompt you the change policy after the version update."}
{"task": "rw_110.jsonl", "id": 73235, "text": "Please read the content of the privacy policy after careful reading. You continue to use Qinyou Games to indicate that you agree that we can collect, process or use your personal information according to the updated privacy policy.", "label": ["Policy Change", "Important", "Risk"], "rewrite": "Continue to use services is deemed to agree to accept the content of the privacy policy after the revision."}
{"task": "rw_110.jsonl", "id": 73236, "text": "8. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73237, "text": "1. General clauses of minors", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73238, "text": "(1) If you are a minor under the age of 18, before using our related services, you should read and agree with your parents or other guardians under the supervision and guidance of your parents or guardians.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a minor, you should read and agree with your parents or other guardians under supervision and guidance."}
{"task": "rw_110.jsonl", "id": 73239, "text": "(2) In accordance with the relevant national laws and regulations, we protect the personal information of minors, and will only collect, use, share, or disclose minors to collect, use, share or disclose minors when legal permits, parents or other guardians need to protect or protect minors.Personal information;", "label": ["Specific Audiences", "Important"], "rewrite": "It will only use, share, transfer, or disclose this information if the laws and regulations are allowed, parents or guardians to clearly agree or protect minors."}
{"task": "rw_110.jsonl", "id": 73240, "text": "If we find that the personal information of minors is collected without the consent of parents or other guardians who can be proven in advance, we will try to delete relevant information as soon as possible.", "label": ["Specific Audiences", "Important"], "rewrite": "If the personal information of minors was collected without the consent of the parents, he would try to delete relevant information as soon as possible."}
{"task": "rw_110.jsonl", "id": 73241, "text": "(3) If you are the guardian of the minor, when you use our service to use our service or have any questions about the minors you monitor, please pass the contact information in Article 10Contact us in time.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73242, "text": "2. Special protection of minors", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73243, "text": "We attach great importance to the protection of personal information of minors.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73244, "text": "We will actively protect the legitimate rights and interests of minors by enabling the anti -addiction system in accordance with the requirements of national defense addiction policies.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73245, "text": "We will determine whether the real -name information of the relevant account is minor through information verification such as real -name identity, and then decide whether to incorporate this account into the anti -addiction system.", "label": ["Specific Audiences", "Important"], "rewrite": "Determine whether it is a minor by verifying information such as the real name identity, and decide whether to be included in the anti -addiction system."}
{"task": "rw_110.jsonl", "id": 73246, "text": "In addition, we will guide the rational game of minors through automatic intervention and restricting minor game time through the system level, including restricting login time, game duration, and enabled offline function.After consumption, try to contact the guardian to remind, confirm and deal with it to help minors to access the Internet healthy.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73247, "text": "In particular, if you are under the age of 14, you also apply this policy and the \"Child Privacy Protection Statement\" at the same time.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a minor under the age of 14, you also apply this policy and the \"Child Privacy Protection Statement\" at the same time."}
{"task": "rw_110.jsonl", "id": 73248, "text": "You can use our game service only after obtaining the guardian's consent of the \"Child Privacy Protection Statement\".", "label": ["Policy Change", "Specific Audiences", "Important"], "rewrite": "You can use our game service only after obtaining the guardian's consent of the \"Child Privacy Protection Statement\"."}
{"task": "rw_110.jsonl", "id": 73249, "text": "Nine, notice and revision", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73250, "text": "In order to provide you with better services, we may modify the terms of this policy in a timely manner according to the updates of our service and the relevant requirements of laws and regulations, which constitute a part of the policy.", "label": ["Policy Change", "Important"], "rewrite": "The terms of this policy modify part of the policy policy."}
{"task": "rw_110.jsonl", "id": 73251, "text": "If such updates have caused the substantial reduction or major changes of your rights under this policy, we will notify you through the website announcement, pop -up window prompts or other methods before this policy. If you do not agree with these changes, you can choose to stop.Use our service;", "label": ["Policy Change", "Important"], "rewrite": "After the privacy policy is updated, you will show you the change of privacy policy after login and version update."}
{"task": "rw_110.jsonl", "id": 73252, "text": "If you continue to use our service, it means that you have fully read, understand and agree to the constraints of the policy revised.", "label": ["Policy Change", "Important", "Risk"], "rewrite": "Continue to use services is deemed to agree to accept the content of the privacy policy after the revision."}
{"task": "rw_110.jsonl", "id": 73253, "text": "Any of our modification will put your satisfaction first.", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73254, "text": "We encourage you to check our privacy policy every time you use our services.", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73255, "text": "Ten, how to contact us", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73256, "text": "We have set up a full -time department for personal information protection and will protect your personal information in accordance with this policy.", "label": [], "rewrite": []}
{"task": "rw_110.jsonl", "id": 73257, "text": "If you have any questions, opinions or suggestions on complaints and reports on network information security, or you have any questions, opinions or suggestions on this policy, our privacy measures, your information, and personal information of minors.For personnel contact, you can send emails to ysfw@friendtimes.net.", "label": ["Important", "Contact Information"], "rewrite": "Contact our personal information protection staff, mailbox: ysfw@friendtimes.net."}
{"task": "rw_110.jsonl", "id": 73258, "text": "Under normal circumstances, we will reply within 15 working days after receiving your questions, opinions or suggestions, and verify your user identity.\"", "label": ["Important", "Contact Information"], "rewrite": "A reply within fifteen working days after verifying your user identity."}
