{"task": "rw_117.jsonl", "id": 74701, "text": "Lingxi Mutual Entertainment Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74702, "text": "Update date: September 2, 2022", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74703, "text": "Effective date: September 2, 2022", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74704, "text": "introduction", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74705, "text": "You are welcome to use our products and services!", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74706, "text": "We know the importance of personal information to you. Your trust is very important to us. We will strictly abide by laws and regulations to take corresponding security protection measures to protect your personal information security and controlling.", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74707, "text": "Based on this, the service provider Guangzhou Lingxi Interactive Entertainment Co., Ltd. (referred to as \"Ling Rhino Interoperability\" or \"We\") formulates this \"Ling Rhino Mutual Entertainment Privacy Policy\" (hereinafter referred to as \"this policy\"/\"privacy policy\") to help youFully understand how we use our products and services, how we will collect, use, share, store, and protect your personal information, as well as how you can manage your personal information so that you can make better choices.", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74708, "text": "Before you start using our products and services, please read and understand this policy carefully. In particular, we should focus on reading the clauses we logging in the threatening of the body/coarse body to ensure that you fully understand and agree to use it before starting to use.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74709, "text": "The professional vocabulary involved in this policy, we try to explain to you in a concise and popular expression in order to facilitate your understanding.", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74710, "text": "If you have any questions, opinions or suggestions on the content of this policy, you can contact us through the contact information at the end of this policy.", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74711, "text": "You agree that the privacy policy said that you have understood the functions provided by the application, and the necessary personal information required for functional operation, and give corresponding collection and use authorization, but it does not mean that you have agreed to open up additional functions and handle non -necessary personal information.The opening, processing non -necessary personal information and processing sensitive personal information, we will solicit your consent separately according to your actual usage.", "label": ["Policy Change", "Important"], "rewrite": "You agree that the representative of the privacy policy understands the basic functions and authorizes the collection of necessary information, but the non -necessary personal information required by the additional function will still solicit consent separately according to the actual situation."}
{"task": "rw_117.jsonl", "id": 74712, "text": "This privacy policy will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74713, "text": "1. Scope of application", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74714, "text": "2. Information collection and use", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74715, "text": "3. Provide information to the outside world", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74716, "text": "Fourth, your rights", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74717, "text": "5. Storage of information", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74718, "text": "6. Policy update", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74719, "text": "7. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74720, "text": "Eight, contact us", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74721, "text": "Appendix: Related Definition", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74722, "text": "1. Scope of application", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74723, "text": "This policy is applicable to the various products and services provided by the new forms provided by the Lingxi Mutual Entertainment Service Providers with new forms that appeared with technology development with the development of technology.", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74724, "text": "If we and related companies have a privacy policy for the products or services it provide to you, the corresponding privacy policies are applicable to the corresponding products or services.", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74725, "text": "2. Information collection and use", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74726, "text": "When you use our products/services, the personal information we need/may need to collect and use includes the following:", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The personal information we need/may need to be collected and use includes the following: (1) you must authorize the necessary information we collect and use;Information required for function."}
{"task": "rw_117.jsonl", "id": 74727, "text": "1. In order to realize the basic functions of providing you with our products and/or services, you must authorize us to collect and use the necessary information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74728, "text": "If you refuse to provide the corresponding information, you will not be able to use our products and/or services normally;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74729, "text": "2. In order to provide you with additional functions to our products and/or services, you can choose to agree or disagree with the information we collected and used alone.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74730, "text": "If you refuse to provide it, you will not be able to use related additional functions normally or cannot achieve the functional effects we intend to achieve, which will not affect your basic functions.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74731, "text": "We are here to remind you that we are committed to creating a variety of products and services to meet your needs.", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74732, "text": "Because there are many types and services we provide to you, and there are differences in the scope of the specific product/service selected by different users, the basic/additional functions and the personal information types and scope of personal information and use will be different. Please use specific ones.Product/service function shall prevail.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74733, "text": "The specific feature scenarios we will provide you include::", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74734, "text": "(1) Help you become our user", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74735, "text": "1. Basic account service", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74736, "text": "We provide you with a service based on the Lingxi Mutual Entertainment account.", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74737, "text": "In order to create a Lingxi Mutual Entertainment account, you need to provide us with at least your mobile phone number and mobile phone verification code/password.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your mobile phone number, mobile phone verification code/password for creating Ling Rhino Mutual Entertainment Account"}
{"task": "rw_117.jsonl", "id": 74738, "text": "If you refuse to provide the above information, you may not be able to register the Lingxi Mutual Entertainment account.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide mobile phone numbers and mobile verification codes/passwords, you may not be able to register for the Ling Rhino Mutual Entertainment account."}
{"task": "rw_117.jsonl", "id": 74739, "text": "If you use Alipay, Taobao, and (or) third -party accounts as associated with the game account login game, we will collect the unique logo, nickname, avatar, and mobile phone number involved in the third -party account number you use to help you complete the registration and login loginAnd realizing a better social experience.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When registering and logging in with a third -party account, visit and collect your personal information after your authorization is used to complete the registration and login"}
{"task": "rw_117.jsonl", "id": 74740, "text": "You can check and manage the above information authorization in a third -party platform.", "label": ["Edit/Control", "Important"], "rewrite": "View and manage information authorization on third -party platforms"}
{"task": "rw_117.jsonl", "id": 74741, "text": "You can choose to fill in gender, region and other information to improve your game account information.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can choose to fill in the gender, region and other information"}
{"task": "rw_117.jsonl", "id": 74742, "text": "2. Real -name authentication", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74743, "text": "In order to meet the requirements of relevant laws, regulations and policies and the requirements of relevant competent authorities, users need to provide real -name certification to continue to use and enjoy game services.", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74744, "text": "We will collect your real -name identity information (including name, ID number and other information) when obtaining your consent or active provision. This information is a sensitive personal information. Refusing to provide real -name identity information may cause you to be unable to log in to the game orCorresponding restrictions during the use of the game.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your real -name identity information for real -name authentication, and refuse to provide provision that may lead to being unable to log in to the game or restricted"}
{"task": "rw_117.jsonl", "id": 74745, "text": "(2) Provide you with specific products or services", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74746, "text": "1. In order to ensure that you can use our services normally, the information we need to collect", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74747, "text": "(1) Log information: For example, login log, item log, operating information, game -to -game information, friends list, game process and game collapse record, etc., so that you can view your game history records on the client, and at the same time for customer serviceComplaint processing and other game security analysis (such as testing piracy, plug -in, cheating and other improper behaviors).", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect log information for game history records, complaint processing, and other security analysis"}
{"task": "rw_117.jsonl", "id": 74748, "text": "To enhance your game experience, we may synchronize the aforementioned information to the subsequent version of the game.", "label": ["Important", "Usage"], "rewrite": "Synchronous game log information to the subsequent version"}
{"task": "rw_117.jsonl", "id": 74749, "text": "(2) Equipment and network information: device name, equipment type and version, system version, IP address, device recognition symbols (such as IMEI, IMSI, MAC address), application ID, network type and other information to ensure that you use us normally usServing the normal operation of the basic functions of the game.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect equipment and network information for normal operations that provide services normally and maintain the normal operation of the basic functions of the game"}
{"task": "rw_117.jsonl", "id": 74750, "text": "(3) Payment information: When you use the consumption and recharge function, you can choose Alipay, Huayan, WeChat wallet, QQ wallet, Apple payment for payment (specifically based on the payment channel provided by each game product).", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the consumption and recharge function, collect your payment information"}
{"task": "rw_117.jsonl", "id": 74751, "text": "We will share your game account name, corresponding payment institution account name, order payment related information, order security related equipment information and payment information service provider.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share your game account name with payment information service provider, corresponding payment institution account name, order payment related information, order security related equipment information"}
{"task": "rw_117.jsonl", "id": 74752, "text": "At the same time, in order to allow us to learn and confirm your payment progress and status in a timely manner, and provide you with customer service and dispute solutions, you agree that we can collect and pay the progress related information from the above payment information services provider.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect payment progress related information to confirm the progress and status of payment, provide customer service and dispute solution services"}
{"task": "rw_117.jsonl", "id": 74753, "text": "2. To experience more services or functions, you may take the initiative to provide us information", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74754, "text": "(1), we may collect your mobile phone number and email address when you take the initiative to notify the results of the results you participateYou agree to send you game information to you (you can directly withdraw a linked in the mail and SMS).", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your active personal information or send you game information to you with consent (you can withdraw bips in the withdrawal link)"}
{"task": "rw_117.jsonl", "id": 74755, "text": "After you authorize our geographical authority, we will collect your geographical location information to match the most suitable game server so that you can match with nearby players, chat and interact.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect the geographical location information obtained by obtaining permissions to match the most suitable game server"}
{"task": "rw_117.jsonl", "id": 74756, "text": "Geographical location information is a sensitive personal information. Rejecting to provide this information will only cause you to be unable to interact with nearby gamers, but it does not affect other functions of your product normally. You can also cancel your geographical location information at any time.", "label": ["Important", "First Party Collection Information"], "rewrite": "Refusing to provide geographical information can only cause you to be unable to interact with nearby gamers without affecting other functions"}
{"task": "rw_117.jsonl", "id": 74757, "text": "(2) If you want to interact with other game players through text, pictures, voice (if.), After you authorize, the game will access your photos or storage files, microphones, and provide you with it to provide you withScreenshot saving, picture upload, voice chat and other functions.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The game will visit your photos or storage files, microphones to provide screenshots saving, picture upload, voice chat and other functions"}
{"task": "rw_117.jsonl", "id": 74758, "text": "If you refuse to authorize, you will not be able to use the corresponding function, but it does not affect your normal use of other functions, you can also cancel the relevant authority authorization at any time.", "label": ["Important", "First Party Collection Information"], "rewrite": "Refusing to authorize photos or storage files, microphone permission will cause the corresponding function, but it does not affect the use of other functions"}
{"task": "rw_117.jsonl", "id": 74759, "text": "We may collect the above information in order to preserve and assist you sent the above information. In addition, in order to meet the requirements of relevant laws and regulations and policies, we need to filter improper content such as pornography, violence, politics, abuse, and malicious advertisements to maintain healthy green colorThe game environment.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your interactive information to filter the improper content of pornography, violence, politics, abuse, malicious advertising, etc."}
{"task": "rw_117.jsonl", "id": 74760, "text": "(3) Customer service and dispute handling", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74761, "text": "When you contact us or propose the application for sale, after -sales, and dispute dispute handling, in order to ensure your account and system security, we need you to provide the necessary personal information to verify your identity.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you contact us or propose the application for sale, after -sales, and dispute dispute handling, we will collect the necessary personal information to verify the identity"}
{"task": "rw_117.jsonl", "id": 74762, "text": "In order to facilitate the processing plan and results of helping you solve the problem or record related issues as soon as possible, we may save your communication, communication/call records and related content (including account information, game process information, to prove to prove to prove it to proveOther information provided by related facts, or contact information you leave).", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Save your communication, communication/call records and related contents to help you solve the problem or record the processing scheme and results of related issues"}
{"task": "rw_117.jsonl", "id": 74763, "text": "If you consult, complain or provide suggestions for specific payment and recharge, we will use your account information and payment information.", "label": ["Important", "Usage"], "rewrite": "Use your account information and payment information to respond to consultation, complaints or suggestions related to payment and recharge"}
{"task": "rw_117.jsonl", "id": 74764, "text": "In order to provide reasonable needs for services and improve service quality, we may also use your other information, including the relevant information you provided when you contact the customer service, and the questionnaire reply information sent us when you participate in the questionnaire survey.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Use other information you provide to provide services or improve service quality"}
{"task": "rw_117.jsonl", "id": 74765, "text": "(4) Provide you with security guarantee", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74766, "text": "In order to improve the security of your service, protect the safety of personal property of your or other users or the public, and better prevent the risk of fishing websites, fraud, network vulnerabilities, computer viruses, network attacks, network invasion risks, and more accuratelyIdentify the cases and rules that violate laws and regulations or related agreements and rules, and we embed the application security SDK developed by our affiliate company in the application to collect your equipment information and log information, and may use or integrate your membership information and transaction information, Equipment information, log information, and our related companies and partners obtain information that you authorize or sharing according to law (Among them, we may collect MAC addresses, IMEI, application lists, and other device logo in the application background operation.), Come to comprehensively judge your account risk, authentication, testing external cheating and preventing security incidents, and adopting necessary records, auditing, analysis, and disposal measures in accordance with the law.", "label": ["Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "Collect your device information and log information through the application security SDK developed by related companies, and may use or integrate your member information, transaction information, equipment information, log information, and our affiliates and partners to obtain information you authorize or share according to law.To ensure the security of the service, and take the necessary records, audit, analysis, and disposal measures in accordance with the law"}
{"task": "rw_117.jsonl", "id": 74767, "text": "(5) Other additional services provided for you", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74768, "text": "1. Additional services based on system permissions", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74769, "text": "In order to provide you with more convenient and better products and/or services, and strive to improve your experience, we may collect and use your personal information by opening system permissions in the additional service provided to you.", "label": ["Permission Acquisition", "Important"], "rewrite": "To collect and use your personal information to provide you with additional services provided by your personal information"}
{"task": "rw_117.jsonl", "id": 74770, "text": "If you do not agree to start related permissions, it will not affect your basic services to use Lingxi Mutual Entertainment, but you may not be able to obtain the user experience brought by these additional services to you.", "label": ["Permission Acquisition", "Important"], "rewrite": "If the system permissions are not turned on, it will not affect the use of basic services but it will affect the additional service"}
{"task": "rw_117.jsonl", "id": 74771, "text": "You can decide these permissions to open or close at any time.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74772, "text": "Please note that when you start the right of power, it means that you authorize us to collect and use relevant personal information to provide you with corresponding services. Once you turn off the right of power, it means that you cancel the authorization.With relevant personal information, you cannot continue to provide you with the service corresponding to the permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "Opening one authority, which means authorized collection and use of relevant information to provide corresponding services, closing any authority representative cancels the authorization, and no longer continues to collect and use relevant information based on the corresponding permissions"}
{"task": "rw_117.jsonl", "id": 74773, "text": "The decision of your closure authority will not affect the collection and use of information based on your authorization.", "label": ["Permission Acquisition", "Important"], "rewrite": "Closing authority will not affect the collection and use of information based on authorization before"}
{"task": "rw_117.jsonl", "id": 74774, "text": "You can click here to view the application and usage of the application authority of the gaming products of Lingmei Mutual Entertainment.", "label": ["Permission Acquisition", "Important"], "rewrite": "You can click here to view the application and usage of the application authority of the gaming products of Lingmei Mutual Entertainment."}
{"task": "rw_117.jsonl", "id": 74775, "text": "2. Cookie and services of similar technologies", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74776, "text": "Cookie and similar device information identification technology are commonly used in the Internet.", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74777, "text": "When you use our service, we may use related technologies to send one or more, cookie, or anonymous identifiers (hereinafter referred to as \"Cookie\") to collect, identify and store your access, use this product, use this productInformation about time.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect, identify and store your access and use this product through cookies"}
{"task": "rw_117.jsonl", "id": 74778, "text": "We promise that cookies will not be used for any other purposes other than the purpose of this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74779, "text": "We use, cookies, mainly to ensure the safety and efficient operation of products and services, allow us to confirm the security status of your account and transaction, check the relevant abnormal situation of collapse and delay, and help you save you to fill in the form, enter the search contentSteps and processes.", "label": ["Important", "Usage"], "rewrite": "Use cookie to ensure the safety and efficient operation of products and services"}
{"task": "rw_117.jsonl", "id": 74780, "text": "3. Provide information to the outside world", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74781, "text": "(1) Sharing", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74782, "text": "We will not share your personal information with companies, organizations, and individuals other than Lingxi Mutual Entertainment, except the following situations:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not share your personal information with companies, organizations, and individuals other than Lingxi Mutual Entertainment, except the following situations:"}
{"task": "rw_117.jsonl", "id": 74783, "text": "1. The sharing necessary for fulfilling the law office: we may share your personal information in accordance with the requirements of laws and regulations, lawsuits, and disputes in accordance with the requirements of administrative and judicial organs in accordance with the requirements of administrative, judicial organs, and other legal obligations.Essence", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "1. Perform the shared sharing necessary for the legal obligations"}
{"task": "rw_117.jsonl", "id": 74784, "text": "2. Share sharing when you get your consent: After getting your clear consent, we will share your personal information with other parties.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "2. Share it when you get your consent"}
{"task": "rw_117.jsonl", "id": 74785, "text": "3. In order to establish and fulfill your contract as a party as a party: In order to ensure the operation of the game and achieve specific functions, some services in the game are provided by our affiliated parties or other third parties.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "3. The sharing that is necessary to set up and fulfill your contract as a party as a party"}
{"task": "rw_117.jsonl", "id": 74786, "text": "We will prudent third -party and third -party services, and urge relevant third parties to collect and use your personal information in accordance with this privacy policy or the agreement reached with you, and take appropriate security technology and management measures to ensure your personal information security security securityEssence", "label": ["Important", "Data Security"], "rewrite": "We will prudent third -party and third -party services, and urge relevant third parties to collect and use your personal information in accordance with the provisions, and take appropriate security technology and management measures"}
{"task": "rw_117.jsonl", "id": 74787, "text": "4. Sharing with affiliated companies: In order to facilitate us to provide some services with you, it provides you with products and services based on the spiritual rhino -entertainment account, and protects the personal property of Lingxi Mutual Entertainment Company or other users or the public.If you are infringed, your personal information may be shared with our affiliated company and/or its designated service providers.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "4. Shared with affiliated companies: When providing services together, your personal information may be shared with our affiliated company and/or its designated service provider"}
{"task": "rw_117.jsonl", "id": 74788, "text": "We will only share the necessary personal information and be restricted by the purpose declared in this policy. If we share your sensitive personal information or the purpose of changing personal information to change personal information, we will solicit your authorization consent again.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Only share the necessary personal information, and the situation of sensitive personal information or changing the purpose of use will once again solicit authorization consent"}
{"task": "rw_117.jsonl", "id": 74789, "text": "5. Agent product: Our business includes game products issued by agent. We may share your logs and related information (such as logging in logs, etc.) with the development subject or related third parties.Game services to further optimize the user's game experience.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We may share with the development subject or related third -party sharing logs and related information for game security analysis, improve game services, and optimize the game experience"}
{"task": "rw_117.jsonl", "id": 74790, "text": "If we share the aforementioned information, we will take corresponding compliance measures in accordance with relevant laws and regulations to ensure that personal information sharing meets the corresponding laws.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If we share game logs and related information, we will take compliance measures"}
{"task": "rw_117.jsonl", "id": 74791, "text": "The preceding of the preceding compliance measures include but not limited to the request for the development subject or related third parties to strictly abide by the promise to collect and use your personal information reached by you, and urge the development of the subject or related third parties to adopt appropriate security technology and management measures to ensure youPersonal information security, etc.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "The compliance measures adopted during sharing include the request to obey the agreement reached and the agreement reached, and urge them to adopt safety technology and management measures"}
{"task": "rw_117.jsonl", "id": 74792, "text": "6. Advertising push: Some of our game products will provide advertising push services.", "label": ["Important", "Usage"], "rewrite": "Some of our game products provide advertising push services"}
{"task": "rw_117.jsonl", "id": 74793, "text": "In order to evaluate and optimize the effect of advertising, we need to share some of your data from third -party partners such as advertisers and agents, and require them to strictly abide by our measures and requirements on data privacy protection, including but not limited to data based on dataProtection agreement, commitment letters and related data processing policies are treated to avoid identifying personal identity and ensuring privacy security.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "When sharing some of your data with third -party partners in order to evaluate and optimize the effect of advertising."}
{"task": "rw_117.jsonl", "id": 74794, "text": "How to share data with advertisers such as advertisers, please refer to the content disclosed in the SDK details of the product access to each game product of Ling Rhino.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "How to share data with advertisers such as advertisers. For details, see the content disclosed in the SDK details of each game product access"}
{"task": "rw_117.jsonl", "id": 74795, "text": "Please note that when you use our service, you voluntarily share or even publicly share information, which may involve your or other people's personal information and even sensitive personal information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Edit/Control"], "rewrite": "Note: The information that voluntarily shared or even publicly shared may involve personal sensitive information of you or others."}
{"task": "rw_117.jsonl", "id": 74796, "text": "Please consider and make a decision more cautiously.", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74797, "text": "(2) Entrusted processing", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74798, "text": "We may entrust a partner to handle your personal information in order to authorize partners to represent you to provide you with certain services or fulfilling functions.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may entrust a partner to handle your personal information"}
{"task": "rw_117.jsonl", "id": 74799, "text": "We will only entrust their information for the legal, correct, necessary, specific, and clear goals of this policy statement. We can authorize partners to only contact the information required by their duties, and we will ask for the agreement to request that it must not be requiredThis information is used for any other purpose beyond the scope of commission.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only entrust personal information for legal, correct, necessary, specific, and clear purposes. The authorization partners can only expose the information required by the performance and not be allowed to use this information for the purpose of the entrustment scope."}
{"task": "rw_117.jsonl", "id": 74800, "text": "If the authorized partner will use your information for our unreasonable purpose, it will obtain your consent alone.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If the authorization partner exceeds the scope of the commission, it will obtain your consent separately"}
{"task": "rw_117.jsonl", "id": 74801, "text": "At present, our authorized partners include the following types:", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74802, "text": "1. Authorized partners of advertising and analysis of service categories.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74803, "text": "Under the premise of using industry -universal security technology, we will entrust these partners to handle information about advertising, coverage, and effectiveness related to advertising.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Entrust partners to process information related to advertising"}
{"task": "rw_117.jsonl", "id": 74804, "text": "We will not commission your personal identity information to commission partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not handle your personal identity information commissioned partner"}
{"task": "rw_117.jsonl", "id": 74805, "text": "2. Suppliers, service providers and other partners.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74806, "text": "We entrust the information to the suppliers, service providers and other partners who support our business to handle it. These support for the technical infrastructure services that we are entrusted to provide, analyze the usage methods of our services, provide customer service, pay conveniently, or perform academic academic academicsResearch and investigation.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We entrust the information to suppliers, service providers and other partners who support our business to handle"}
{"task": "rw_117.jsonl", "id": 74807, "text": "In order to ensure the stable operation and functional implementation of our client, so that you can use and enjoy more services and functions. Our application will embed the SDK or other similar applications of authorized partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Our application will embed the SDK or other similar applications of authorized partners"}
{"task": "rw_117.jsonl", "id": 74808, "text": "We will strictly test the application interface (API) and software tool development package (SDK) of the authorized partners to obtain relevant information, and strict data protection measures with the authorized partners, so that it will be in accordance with this policy and any other any otherRelated confidentiality and security measures to handle personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will conduct security detection on the API and SDKs that have obtained information obtained by authorized partners and agree on data protection measures"}
{"task": "rw_117.jsonl", "id": 74809, "text": "Except for the authorized partners to obtain your consent alone.", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74810, "text": "You can click here to view the details of the SDKs connected to each game product of Lingxi Interactive Entertainment.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You can click here to view the SDK details of each game product connection of Lingxi Interactive Entertainment"}
{"task": "rw_117.jsonl", "id": 74811, "text": "(3) Transfer", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74812, "text": "If we need to transfer personal information for the reasons for merging, separation, dissolution, and declaration of bankruptcy, we will inform you the name or name and contact information of the receiver.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If business mergers, acquisitions, asset transfer and other transactions will be informed of the relevant situation, and it will continue to protect your personal information in accordance with laws and regulations and not lower than the standards required by this guideline."}
{"task": "rw_117.jsonl", "id": 74813, "text": "The receiver will continue to fulfill this policy and other legal obligations.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74814, "text": "If the receiver changes the original treatment purpose and method of processing, you will re -obtain your consent.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74815, "text": "(4) Public disclosure", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74816, "text": "We will only publicly disclose your personal information in the following circumstances:", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74817, "text": "1. Based on your active choice and other individual consent, we may publicly disclose your personal information;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Based on your active choice and other individual consent, we may publicly disclose your personal information"}
{"task": "rw_117.jsonl", "id": 74818, "text": "2., if we are sure that you have violated laws and regulations or serious violations of related agreements and rules of Lingxi Mutual Entertainment, or to protect the security of the personal property of the human or public or the public, we may disclose your personal information,Including related violations and the measures that Ling Rhino Entertainment have taken you.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When you have violations of laws and regulations, or in order to protect the security of users and the public from being infringed, we may disclose your personal information"}
{"task": "rw_117.jsonl", "id": 74819, "text": "Fourth, your rights", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74820, "text": "You can check and manage your information through the following ways, and we will respond to your request in the case of compliance with laws and regulations:", "label": ["Important", "Edit/Control"], "rewrite": "You can check and manage your information through the following ways, and we will respond to your request in the case of compliance with laws and regulations"}
{"task": "rw_117.jsonl", "id": 74821, "text": "(1) Review, copy, correct and supplement", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74822, "text": "You have the right to review, copy, correct and supplement your information by:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74823, "text": "1., you can query and access your account basic information (avatar, nickname, and personal information you choose to fill in), game historical information (such as character level, achievement, record, and other personal information (avatar, nickname, nickname, nickname, nickname, nickname, nickname, nickname, nickname, nickname, nickname, nickname, nickname, nickname, nickname, nickname, nickname, nickname, nicknames, nicknames, and other personal information you choose.Each product specific game information).", "label": ["Important", "Edit/Control"], "rewrite": "Query and access your account basic information and game historical information in the Lingxi Mutual Entertainment Products you use"}
{"task": "rw_117.jsonl", "id": 74824, "text": "2. You can inquire about the information of the products and services that you use the \"user center\" or \"user\" interface in detail according to the prompts in the actual situation of the product. For details, please see the \"user center\" or \"user\" interface.", "label": ["Important", "Edit/Control"], "rewrite": "Inquiry about the information about your use of Lingxi Mutual Entertainment products and services in Lingxi Mutual Entertainment products. For details, please see the \"user center\" or \"user\" interface description of each product"}
{"task": "rw_117.jsonl", "id": 74825, "text": "3. If you have other doubts or difficulties in the process of checking, replication, correction, and supplementation in the process of using the product, you can also contact us through the contact information described in Article 8.You handle it.", "label": ["Important", "Edit/Control"], "rewrite": "To meet our needs of your inspection, replication, correction, and compensation"}
{"task": "rw_117.jsonl", "id": 74826, "text": "But in order to ensure accounts and personal information security, we may verify your identity and account security status.", "label": ["Important", "Data Security"], "rewrite": "Before you exercise various rights, we will verify your identity account security status"}
{"task": "rw_117.jsonl", "id": 74827, "text": "We will support your reasonable request.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74828, "text": "We may not be able to respond to your requests that exceed our personal information storage scope, exceed the reasonable limit, or respond to your request that will cause you or other third -party legitimate rights and interests.", "label": ["Important", "Edit/Control"], "rewrite": "We may not be able to respond to your request that you have exceeded a reasonable limit or may cause the legitimate rights and interests of others"}
{"task": "rw_117.jsonl", "id": 74829, "text": "(2) Delete and cancel the account", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74830, "text": "You can adjust your information through \"(1) to check, copy, correct, and supplement your information\" columns, or apply for cancellation account to delete all your information.", "label": ["Important", "Edit/Control"], "rewrite": "The path adjustment of \"(1) to check, copy, correct, and supplement your information\" can be adjusted for some information or apply for a cancellation account to delete all information"}
{"task": "rw_117.jsonl", "id": 74831, "text": "Because some personal information collection and use of the basic functions corresponding to our services, if you want part to delete, it may cause us to be unable to provide you with services. In this case, if you still want to delete, you can cancel your needs by applying for an account.", "label": ["Edit/Control", "Important"], "rewrite": "If the authorization of the withdrawal of basic functions, if the service cannot be provided, the relevant authorization can be withdrawn by canceling the account"}
{"task": "rw_117.jsonl", "id": 74832, "text": "You can apply for a cancellation of your account in the following ways:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74833, "text": "You can apply for account cancellation at the \"user center\" or \"user\"-\"account cancellation\" or other channels that are notified in the product.", "label": ["Important", "Edit/Control"], "rewrite": "Application for account cancellation in the \"User Center\" or \"User \"-\" Account Logging \"or other channels in the product"}
{"task": "rw_117.jsonl", "id": 74834, "text": "You can click on your own address https://appeal.lingxigames.com/aq, and submit the account to cancel the account for the account number in the \"Account Activity Center-Please select the Cause of the Appeal-Logging up the Account\" page according to the instruction.", "label": ["Important", "Edit/Control"], "rewrite": "Click the following address https://appeal.lingxigames.com/aq, in the \"Account Appellation Center-Please select the Reason for Calculation-Lamdate the Account\" Page"}
{"task": "rw_117.jsonl", "id": 74835, "text": "You can also apply through customer service to apply for a cancellation of your account.", "label": ["Important", "Edit/Control"], "rewrite": "Through customer service contact, apply for a cancellation account"}
{"task": "rw_117.jsonl", "id": 74836, "text": "After you take the initiative to cancel your account, we will stop providing you with products or services and delete or process your personal information according to the requirements of applicable laws.", "label": ["Important", "Edit/Control"], "rewrite": "After the game account is canceled, the personal information under the game account will be deleted or anonymous"}
{"task": "rw_117.jsonl", "id": 74837, "text": "(3) Change the scope of authorization", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74838, "text": "You can change or withdraw the scope of your personal information in the following ways or withdrawn or process your personal information:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74839, "text": "1., you can use the internal functions of the account, close or open the internal functions of the spiritual rhino -entertainment product, close or open the equipment permissions obtained by specific spiritual rhino -entertainment products (specific permissions are different due to the different equipment models and system versions used by the user, such as:, for example:The iOS system can manage the corresponding device authorization through \"Settings-Privacy\";", "label": ["Important", "Edit/Control"], "rewrite": "Change or withdraw authorization by canceling the internal function of the account, closing or opening the internal functions of Lingxi interactive products, closing or opening the device permissions obtained by specific spiritual rhino-entertainment products (iOS system can manage corresponding equipment authorization through \"setting-privacy\"; through the game, pass through the game.\"More-System-Privacy\" management corresponding equipment permissions)"}
{"task": "rw_117.jsonl", "id": 74840, "text": "The game in the game through \"more-system-privacy\" to manage the corresponding equipment permissions) to change the scope of authorization to collect and use your personal information.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74841, "text": "2., for the authorization that you cannot directly set in the above method, you can modify it through customer service contact.", "label": ["Important", "Edit/Control"], "rewrite": "Modify authorization through customer service contact"}
{"task": "rw_117.jsonl", "id": 74842, "text": "But please note that for some types of personal information, such as the information necessary for the basic functions of the spiritual rhino -entertainment products, or the information required by the obligation stipulated in the law and regulations, we may not be able to respond to your request to change the scope of authorization.", "label": ["Edit/Control", "Important"], "rewrite": "If the authorization of the withdrawal of basic functions, if the service cannot be provided, the relevant authorization can be withdrawn by canceling the account"}
{"task": "rw_117.jsonl", "id": 74843, "text": "In this case, if you still want to withdraw relevant authorization, you can cancel the demand through applying for an account.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74844, "text": "When you withdraw authorization, we will no longer process the corresponding personal information.", "label": ["Important", "Edit/Control"], "rewrite": "When you withdraw authorization, we will no longer process the corresponding personal information."}
{"task": "rw_117.jsonl", "id": 74845, "text": "However, your decision to withdraw your authorization will not affect our previous processing of personal information based on your authorization.", "label": ["Important", "Edit/Control"], "rewrite": "Withdrawal authorization will not affect personal information processing based on authorization before"}
{"task": "rw_117.jsonl", "id": 74846, "text": "(4) respond to your above request", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74847, "text": "For your or your guardians, close relatives, and other authority to make the above requests to us, and your relevant personal information rights stipulated in the laws of the People's Republic of China and other applicable laws, you can contact us through customer service or directly to us to usPersonal information protection full -time departments initiated complaints.", "label": ["Important"], "rewrite": "You can contact us through customer service or directly file a complaint with our personal information protection department to protect the exercise of your personal information rights"}
{"task": "rw_117.jsonl", "id": 74848, "text": "We will make a reply within 15 days.", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74849, "text": "To ensure your account security and your personal information security, when you make a request to us, we may verify your identity (such as adding account verification, requesting you to provide written requests or other reasonable ways), and then process youRequest.", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "Before handling your request, we may verify your identity first"}
{"task": "rw_117.jsonl", "id": 74850, "text": "For your reasonable request, we do not charge fees in principle, but we will charge a certain fee as appropriate for requests that repeat and beyond the reasonable limit.", "label": ["Important", "Edit/Control"], "rewrite": "Reasonable requests In principle, not charging and exceeding the reasonable limit of reasonable requests"}
{"task": "rw_117.jsonl", "id": 74851, "text": "For information that is not directly associated with your identity, the information that is repeatedly applied without reasonable reasons, or you need too many technical means (if you need to develop a new system or change the current convention fundamentally), bring risks to others' legitimate rights or notIn actual requests, we may refuse.", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "We may refuse to exceed the reasonable limit or bring risks or unrealistic requests to the legitimate rights and interests of others"}
{"task": "rw_117.jsonl", "id": 74852, "text": "5. Storage of information", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74853, "text": "(1) Storage period", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74854, "text": "We will only retain your personal information within the time limit of the cost of reaching the cost of the cost, unless the law has compulsory retention requirements.", "label": ["Data Retention", "Important"], "rewrite": "Keep your personal information within the time limit of the cost of reaching the cost of the cost of reaching the cost of the cost, unless the law has other requirements"}
{"task": "rw_117.jsonl", "id": 74855, "text": "If we terminate our services or operations, we will stop collecting your personal information activities in time, and at the same time, we will comply with relevant laws and regulations to inform you in advance.", "label": ["Important", "Cessation of Operations"], "rewrite": "When stopping operation, an announcement will be announced in accordance with relevant laws and regulations, and personal information will be stopped"}
{"task": "rw_117.jsonl", "id": 74856, "text": "We judge the storage period of personal information mainly based on the following standards:", "label": ["Data Retention", "Important"], "rewrite": "We judge the storage period of personal information mainly by reference to the following criteria: 1) Complete the business functions you agree to use; 2) Ensure the safety and quality of the services we provide you; 3) Longer retention period agreed by you; 4) Whether there is Additional Provisions on Retention Periods."}
{"task": "rw_117.jsonl", "id": 74857, "text": "1. Complete your related transaction purpose, maintain the corresponding transactions and business records to cope with your possible inquiries or complaints;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74858, "text": "2. Ensure that we provide you with service safety and quality;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74859, "text": "3. Do you agree to a longer retention period;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74860, "text": "4. Whether there are special agrees or laws and regulations on the retention period (such as: the provisions of the time limit for litigation in the Civil Code).", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74861, "text": "After exceeding the reservation or termination service/operation, we will delete or proces your personal information according to the requirements of applicable laws.", "label": ["Data Retention", "Important"], "rewrite": "After exceeding the reservation or termination service/operation, delete or process personal information according to the requirements of applicable laws"}
{"task": "rw_117.jsonl", "id": 74862, "text": "(2) Storage location", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74863, "text": "The personal information we collected and generated in the operation of the People's Republic of China will be stored in China.", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in the domestic operations will be stored in China"}
{"task": "rw_117.jsonl", "id": 74864, "text": "In the following circumstances, we will provide your personal information to possible overseas entities after fulfilling the obligations stipulated in the law:", "label": ["Data Retention", "Important", "Risk"], "rewrite": "In the following circumstances, we will provide your personal information to possible overseas entities after fulfilling the obligations stipulated by the law: 1. The applicable laws have clearly stipulated;E -commerce transactions and other types of contracts are required."}
{"task": "rw_117.jsonl", "id": 74865, "text": "1. Applicable laws have clear regulations;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74866, "text": "2. Obtain your separate consent;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74867, "text": "3. As a cross -border e -commerce transaction and other types of contracts for one party, you are necessary for the establishment and other types of contracts.", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74868, "text": "In response to the above situations, we will protect your personal information security in accordance with this policy.", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74869, "text": "(3) Storage safety", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74870, "text": "1. Technical measures for data protection", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74871, "text": "We have adopted our information that meets industry standards, reasonable and feasible security measures to protect your information, and prevent personal information from being disclosed, used, modified, damaged or lost by unauthorized access, publicly disclosed, used, modified, damaged, or lost.", "label": ["Important", "Data Security"], "rewrite": "We adopt the information that meets industry standards and reasonable and feasible security measures to protect your information"}
{"task": "rw_117.jsonl", "id": 74872, "text": "For example, the technical means we use include, but not limited to firewalls, encryption (such as SSL), de -identification or anonymous treatment, etc.;", "label": ["Important", "Data Security"], "rewrite": "Use SSL, information encryption storage, data center access control and other technologies to protect your information."}
{"task": "rw_117.jsonl", "id": 74873, "text": "We will use a trusted protection mechanism to prevent personal information from being maliciously attacked;", "label": ["Important", "Data Security"], "rewrite": "Using a trusted protection mechanism to prevent personal information from being maliciously attacked"}
{"task": "rw_117.jsonl", "id": 74874, "text": "We will deploy the access control mechanism to make every effort to ensure that only authorized personnel can access personal information.", "label": ["Important", "Data Security"], "rewrite": "Deploy the access control mechanism, and try their best to ensure that only authorized personnel can access personal information."}
{"task": "rw_117.jsonl", "id": 74875, "text": "2. Measures for data protection management organization", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74876, "text": "We have established a data security management system that is advanced in the industry with data as the core and the data security management system around the data life cycle, and improves the security of personal information from organizational construction, institutional design, personnel management and product technology.", "label": ["Important", "Data Security"], "rewrite": "Improve the security of the entire system through the data security management system."}
{"task": "rw_117.jsonl", "id": 74877, "text": "We have set up a full -time department for personal information protection.", "label": ["Important", "Data Security"], "rewrite": "A full -time department of personal information protection is set up"}
{"task": "rw_117.jsonl", "id": 74878, "text": "Through training courses and examinations, we have continuously strengthened employees' awareness of protecting the importance of personal information.", "label": ["Important", "Data Security"], "rewrite": "Through training courses and examinations, continuously strengthen employees' understanding of the importance of protecting personal information"}
{"task": "rw_117.jsonl", "id": 74879, "text": "3. Response of personal information security incident", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74880, "text": "If our physical, technical, or management protection facilities are damaged, and the information is caused by unauthorized access, public disclosure, tampering or destruction, and damage to your legitimate rights and interests, we will launch an emergency plan in time and take reasonable and necessary measures.In order to reduce the impact on your personal.", "label": ["Important", "Data Security"], "rewrite": "Start the emergency plan in a timely manner to deal with safety events, and take reasonable and necessary measures to reduce the impact on your personal impact as much as possible"}
{"task": "rw_117.jsonl", "id": 74881, "text": "If a personal information security incident occurs, we will also inform you the basic situation and possible impact of the security incident in accordance with the requirements of the laws and regulations.Remedy.", "label": ["Important", "Data Security"], "rewrite": "Inform you the basic situation and possible impact of the safety incident in time, the disposal measures that have been taken or will take, suggestions that can prevent and reduce risks, and remedy measures"}
{"task": "rw_117.jsonl", "id": 74882, "text": "We will inform you in SMS, telephone, push notification, and other reasonable channels that it is difficult to inform one by one. We will publish an announcement in a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "It is difficult to inform personal information by mail, letter, telephone, and push notification one by one, and will publish an announcement in a reasonable and effective way"}
{"task": "rw_117.jsonl", "id": 74883, "text": "At the same time, we will also report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "The disposal of personal information security incidents will be reported in accordance with the requirements of the regulatory authorities."}
{"task": "rw_117.jsonl", "id": 74884, "text": "4. Prevention of account security risk", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74885, "text": "When using and enjoying game interactive services, you inevitably disclose your account and game information to other players or friends (account avatars, character names, levels, achievements, records).", "label": ["Important", "Edit/Control"], "rewrite": "In the game interaction, you will inevitably disclose your account and game information to other players or friends"}
{"task": "rw_117.jsonl", "id": 74886, "text": "In addition, you can also establish communication, exchange information or analysis content with our services.", "label": ["Important", "Edit/Control"], "rewrite": "You can establish communication, exchange information or analysis content with third parties through our services"}
{"task": "rw_117.jsonl", "id": 74887, "text": "Please protect your personal information properly, provides others only under the necessary circumstances, and do not trust the transaction through other trading tools to avoid the stolen information or even encounter telecommunications network fraud.", "label": ["Important", "Data Security"], "rewrite": "Protecting your personal information properly, it is provided to others only under the necessary situation."}
{"task": "rw_117.jsonl", "id": 74888, "text": "If you are worried about your personal information, especially your account or password, please contact our customer service immediately so that we can take corresponding measures based on your application.", "label": ["Important", "Data Security"], "rewrite": "If the personal information discovered, please contact our customer service immediately."}
{"task": "rw_117.jsonl", "id": 74889, "text": "6. Policy update", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74890, "text": "In order to bring you a better product and service experience, we continue to strive to improve our products, services and technology.", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74891, "text": "When the new service and business processes change, we may update our privacy policy to inform you of specific changes.", "label": ["Policy Change", "Important"], "rewrite": "When the new service and business processes change, we may update our privacy policy to inform you of specific changes."}
{"task": "rw_117.jsonl", "id": 74892, "text": "But without your clear consent, we will not limit your rights you enjoy in accordance with this policy.", "label": ["Policy Change", "Important"], "rewrite": "After the policy is updated, we will not limit your rights without your consent."}
{"task": "rw_117.jsonl", "id": 74893, "text": "We will release any changes to this policy on the special page.", "label": ["Policy Change", "Important"], "rewrite": "We will release any changes to this policy on the special page."}
{"task": "rw_117.jsonl", "id": 74894, "text": "For major changes, we will also provide more significant notifications (including we will notify the official website and the game or provide you with pop -up window prompts).", "label": ["Policy Change", "Important"], "rewrite": "For major changes, we will also provide a more significant notice."}
{"task": "rw_117.jsonl", "id": 74895, "text": "The major changes in this policy include, but not limited to:", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74896, "text": "1. The business model of the product has changed significantly.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74897, "text": "Such as the purpose of handling personal information, the type of personal information, and the use of personal information;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74898, "text": "2. The main body of the privacy policy caused by business adjustment and transaction mergers and acquisitions, and the new subject receiving party changes the original processing purpose and method of treatment;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74899, "text": "3. The main object of personal information sharing or public disclosure changes;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74900, "text": "4. User personal information rights and their exercise methods have changed significantly;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74901, "text": "5. When dealing with the person in charge of the person in charge of the personal information protection and the change of complaint channels;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74902, "text": "6. Personal information protection assessment report shows that the existence of products has a significant impact on personal rights.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74903, "text": "7. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74904, "text": "In gaming entertainment activities, we preferably you have the corresponding civil behavior capabilities.", "label": ["Specific Audiences", "Important"], "rewrite": "In gaming entertainment activities, we preferably you have the corresponding civil behavior capabilities."}
{"task": "rw_117.jsonl", "id": 74905, "text": "If you are a minor, we ask you to ask your parents or other guardians to read this policy carefully, and use our services or provide information to us under the consent of your parents or other guardians.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a minor, please use our services or provide us with information after your parents or other guardians have carefully read this policy and agreed"}
{"task": "rw_117.jsonl", "id": 74906, "text": "If you are a child under the age of 14, before you use our services, you and your guardian should carefully read our specially formulated \"Rules on the Protection of Children's Personal Information\" to ensure that you have obtained the guardian's understanding of the \"Rules on the Protection of Children's Personal Information\" After agreeing, you can use our services under the guidance of your guardian to ensure your safety when using our services and conducting transactions.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a child under the age of 14, please carefully read this policy and the \"Personal Information Protection Rules for Children\" and agree to the guidance of the guardian under your parents or other guardians."}
{"task": "rw_117.jsonl", "id": 74907, "text": "If you are a parent or other guardian of a child, please pay attention to whether the child uses our services after obtaining your authorization and consent.", "label": ["Specific Audiences", "Important"], "rewrite": "Parents or other guardians should pay attention to whether children use services or provide personal information after obtaining your authorization consent"}
{"task": "rw_117.jsonl", "id": 74908, "text": "If you have any questions about your child's personal information, please contact our personal information protection department.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74909, "text": "Eight, contact us", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74910, "text": "You can contact us in the following ways. We will reply to your request within 15 days:", "label": ["Important", "Contact Information"], "rewrite": "You can contact us in the following ways. We will reply to your request within 15 days:"}
{"task": "rw_117.jsonl", "id": 74911, "text": "1. If you have any questions, opinions or suggestions on the content of this policy, you can pass the online customer service in the game, call our customer service phone (0571-26884478) or send an email to kfzx@lingxigames.com, and at any timeconnect;", "label": ["Important", "Contact Information"], "rewrite": "(1) Through online customer service in the game, (2), by dialing our customer service phone (0571-26884478), (3), by sending emails to kfzx@lingxigames.com"}
{"task": "rw_117.jsonl", "id": 74912, "text": "2. We have also set up a full -time information protection department for personal information. You can contact us through privacy_lx@linzgxigames.com (please indicate specific related game products and explain the specific facts).Room 621, No. 38 Pu Road.", "label": ["Important", "Contact Information"], "rewrite": "Personal information protection full -time department: privacy_lx@linzgxigames.com, office address: Room 621, Gaopu Road, Tianhe District, Guangzhou, Guangzhou"}
{"task": "rw_117.jsonl", "id": 74913, "text": "It should be noted that we may not reply to the issue that has nothing to do with the right to this policy or your personal information.", "label": ["Important", "Contact Information"], "rewrite": "We may not respond to questions not related to this policy or your personal information rights"}
{"task": "rw_117.jsonl", "id": 74914, "text": "If you are dissatisfied with our response, especially if you believe that our personal information processing behavior has damaged your legal rights, you can also seek a solution by filing a lawsuit with the court with jurisdiction where the defendant is domiciled.", "label": ["Important"], "rewrite": "You can protect the legitimate rights and interests by filing to a court with jurisdiction in the place of residence in the defendant"}
{"task": "rw_117.jsonl", "id": 74915, "text": "Appendix: Related Definition", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74916, "text": "Related company: It refers to the legal heirs, legal institutions, or the above -mentioned companies and legal institutions that are controlled, controlled or controlled by one party in the future.", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74917, "text": "Control refers to (1) directly or indirectly holding more than half of the voting rights;", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74918, "text": "Or (2) directly or indirectly enjoy more than half of the distribution profits;", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74919, "text": "Or (3) the composition of more than half of the members of the board of directors directly or indirectly;", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74920, "text": "Or (4) Half of the registered capital directly or indirectly.", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74921, "text": "Personal information: Various information related to the recognized or recognized natural persons recorded in electronics or other ways, excluding information after anonymous processing.", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74922, "text": "Sensitive personal information: Once sensitive personal information is leaked or illegally, it is easy to lead to personal information that is harmful to natural person's personality dignity or personality and property security.Track information, and personal information of minors under the age of 14.", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74923, "text": "Child: Refers to minors under the age of 14.", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74924, "text": "Equipment information: Including device identifier (IMEI, IDFA, Android ID, Mac, OAID, IMSI, BSSID, SSID, MEID, SIM card serial number), application information (application crash information, notification switch status, application installation list, other applications, other applications, other applications, other applications, other applications, other applications, other applications, other applications, other applications, other applications, other applications, other applications, other applications, and other applications.Related information), device parameters and system information (device type, equipment model, operating system and hardware -related information), device network environment information (IP address, WIFI information, base station information and other network -related information).", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74925, "text": "The actual collection of the product shall prevail.", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74926, "text": "Log information: Including login logs, items logs, operating information, game -to -game information, dating records, browsing records, click to view records, search query records, follow sharing information, publish information, and IP address, device type, telecommunications operator,Use language, visit date and time.", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74927, "text": "Decoration: Refers to the process of personal information processing, so that it cannot recognize specific natural persons without using additional information.", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74928, "text": "Anonymous: Refers to the process that personal information cannot identify specific natural persons and cannot recover.", "label": [], "rewrite": []}
{"task": "rw_117.jsonl", "id": 74929, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
