{"task": "rw_125.jsonl", "id": 76625, "text": "Kingsoft Online Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76626, "text": "Release date of this version: November 24, 2020", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76627, "text": "Effective date: November 24, 2020", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76628, "text": "This \"Privacy Policy\" is applicable to the Jinshan Pass registration service (hereinafter referred to as \"this service\") for all Kingsoft Software operations.", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76629, "text": "You are welcome to use this service. This \"Privacy Policy\" will work hard to explain the policies and measures of this service in collecting, using, managing, and protecting your personal information through the easy -to -understand, concise and concise text, as well as us as our personal information.The way you provide access, update, delete and protect these information.", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76630, "text": "Please note that this \"Privacy Policy\" is only applicable when you register the Jinshan Pass. If you log in to online games, mobile games and mobile software operated by Jinshan Software through Jinshan Pass, you need to agree to the privacy policy of the corresponding game and software.", "label": ["Policy Change", "Important"], "rewrite": "This \"Privacy Policy\" is only applicable when registering the Jinshan Pass. For example, if you log in to online games, mobile games and mobile software operated by Jinshan Software through the Jinshan Pass, you need to agree to the corresponding privacy policy."}
{"task": "rw_125.jsonl", "id": 76631, "text": "This service operator \"Chengdu Xishanju Shiyou Technology Co., Ltd.\" and its related companies (hereinafter referred to as \"we\") will protect your personal information in accordance with the relevant provisions of laws and regulations.", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76632, "text": "In order to ensure that you can better use the services we provide, we recommend that you carefully read this \"Privacy Policy\" (especially the bold clauses that are directly related to your rights and involve your personal sensitive information), and then decide after confirming the full understanding.Whether we use the service we provide to you, if you have any questions, please contact us to get in contact with us through the contact information provided by this policy.", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76633, "text": "The main content of this \"Privacy Policy\" is as follows:", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76634, "text": "1. Collection of personal information", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76635, "text": "2. The use and management of personal information", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76636, "text": "Third, the use of cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76637, "text": "Fourth, the protection of personal information", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76638, "text": "5. Your right to personal information", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76639, "text": "6. Special protection for personal information of minors (including children)", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76640, "text": "7. Application and modification of this \"Privacy Policy\"", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76641, "text": "8. Application and dispute resolution of law", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76642, "text": "Nine, contact us", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76643, "text": "10. Keyword description", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76644, "text": "1. Collection of personal information", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76645, "text": "1.1 The information you provided or we collected", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76646, "text": "When you register the Jinshan Pass account account or use the various business functions provided by this service, this service will collect the following related personal information you provide. Under the current technical level, it will be used to provide you with services and improve us.The quality of service, ensuring your account security and compliance with national laws and regulations and regulatory regulations:", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76647, "text": "(1) User registration", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76648, "text": "You first need to register a Jinshan Pass account to become a user of this service. When you register, you need to provide us with at least the account name you are preparing to use, the password you createdThe name and citizen ID number, mailbox (collected according to laws, regulations, policies and the requirements of relevant competent authorities), we will assist your identity by sending a SMS verification code.", "label": ["Important", "First Party Collection Information"], "rewrite": "You need to collect the account name, the password created by you, the real -name mobile phone number under my name, my name and citizen ID number, mailbox"}
{"task": "rw_125.jsonl", "id": 76649, "text": "(2) Consumption function", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76650, "text": "If you purchase the paid service of this service, when you settle the content of the service you choose, the order will stipulate the order number, the content you purchased, the amount you should pay and the payment method.", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76651, "text": "(3) Customer service function", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76652, "text": "When you contact our customer service, our system may record the communication records between you and customer service.", "label": ["Important", "First Party Collection Information"], "rewrite": "Will collect the communication records between you and customer service"}
{"task": "rw_125.jsonl", "id": 76653, "text": "Our customer service will use your account information based on your identity needs.", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76654, "text": "When you need us to provide customer service services related to your order information, we will check your order information.", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76655, "text": "When you need us to provide further customer service services, you will need to provide separate necessary information according to the actual service needs.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you need further customer service services, you need to provide the necessary information related to"}
{"task": "rw_125.jsonl", "id": 76656, "text": "(4) Use and improve the functions necessary for our services", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76657, "text": "In order to provide you better, we will collect your login status, service data, service operation data, and service consumption data in the process of using your service.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your login status, service usage data, service operation data, and service consumption data to provide better services"}
{"task": "rw_125.jsonl", "id": 76658, "text": "In order to better improve our services, we will collect log information in your service (including your publishing error information, feedback and review information, time information you use service), use record information,The shared information provided by other parties, your opinions and suggestions on our service, and you actively contact us to submit or feedback information for service operation statistical analysis and service improvement plan.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect log information (including your publishing error information, feedback and comments information, time information you use service), use record information, sharing information provided by other parties through this service, your opinions on our service, suggestion information of suggestions, suggestions information informationYou actively contact us to submit or feedback information for service operation statistical analysis and service improvement plan"}
{"task": "rw_125.jsonl", "id": 76659, "text": "(5) Make sure your account security necessary functional features", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76660, "text": "In order to ensure your system security when using this service, we may collect your device model, IP address, equipment software version information, device identification code, equipment identifiers, regions, network usage habits, service collapse information, and may be possible.Record some link information that we think is risky;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect equipment models, IP addresses, equipment software version information, device recognition code, equipment identifier, region, network usage habits, service collapse information, and record some link information that may be risky."}
{"task": "rw_125.jsonl", "id": 76661, "text": "To further analyze and investigate the possible systemic abnormalities and system risks, to combat the behavior of destroying the fair environment or interference of services or normal services.", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76662, "text": "(6) Interactive function", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76663, "text": "When you interact with other users, or actively publish information, we may collect and save the relevant information content you send.", "label": ["Important", "First Party Collection Information"], "rewrite": "Will collect and save the interactive information you send and the information published by the active release"}
{"task": "rw_125.jsonl", "id": 76664, "text": "The relevant information content we will filter inappropriate content in accordance with the requirements of laws, regulations, policies and relevant competent authorities.", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76665, "text": "1.2 No need to be authorized by you in advance", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76666, "text": "According to relevant laws and regulations and national standards, in the following circumstances, we may collect and use your relevant personal information without asking your authorization consent:", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "In the following situations, we may collect and use your relevant personal information without asking your authorization consent:"}
{"task": "rw_125.jsonl", "id": 76667, "text": "(1) Directly related to national interests such as national security and national defense security;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect personal information directly related to national interests such as national security and national defense security."}
{"task": "rw_125.jsonl", "id": 76668, "text": "Directly related to the major public interests such as public safety, public health, and public knowledge;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect personal information directly related to public safety, public health, and public interest in public safety, public health, and public interest."}
{"task": "rw_125.jsonl", "id": 76669, "text": "(2) Directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect direct personal information related to criminal investigation, prosecution, trial, and execution of judgments. No need to agree"}
{"task": "rw_125.jsonl", "id": 76670, "text": "(3) For the maintenance of major legitimate rights and interests such as life, property, and reputation of your or other individuals, it is difficult to get my consent;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting and maintaining major legitimate rights and interests, but it is difficult to get personal information that I agree, no need to agree"}
{"task": "rw_125.jsonl", "id": 76671, "text": "(4) The personal information collected is publicly disclosed to the public by itself;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "The collected personal information is made by your own public to the public, so you don’t need to agree"}
{"task": "rw_125.jsonl", "id": 76672, "text": "(5) Collect personal information from the information disclosed by legal and publicly disclosed, such as legal news reports, government information disclosure and other channels;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If you collect personal information from the legal disclosure information, you don't need to agree"}
{"task": "rw_125.jsonl", "id": 76673, "text": "(6) Provide services to you or perform the contract according to your requirements;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect the information required to provide you with services or perform the contract according to your requirements, no need to agree"}
{"task": "rw_125.jsonl", "id": 76674, "text": "(7) The necessary and stable operation of the service or service provided by maintenance, such as the failure of discovering, disposing of service or service;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect the personal information necessary for the safe and stable operation of the service or service provided by the service or service provided, no need to agree"}
{"task": "rw_125.jsonl", "id": 76675, "text": "(8) It is necessary to carry out legal news reports;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting the personal information necessary for legal news reports, no need to agree"}
{"task": "rw_125.jsonl", "id": 76676, "text": "(9) When the statistical or academic research institute is needed for public interest, and the results of academic research or descriptions are provided, the personal information contained in the results is identified;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting the personal information necessary for statistics or academic research for public interests, no need to agree"}
{"task": "rw_125.jsonl", "id": 76677, "text": "(10) Other circumstances stipulated in laws and regulations.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "In other circumstances stipulated in the laws and regulations, there is no need to agree to collect personal information"}
{"task": "rw_125.jsonl", "id": 76678, "text": "1.3 Information to be collected due to service renewal", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76679, "text": "Limited by the nature of our service, please know and understand that our services will continue to be updated and improved, and new and changes may occur in various business functions.", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76680, "text": "If we need to supplement the collection of a specific information of your service update, we will follow the actual situation, through the revision of this policy, obtain your authorization, page prompts, and publish one or more ways in the announcement method.You explain to obtain your consent.", "label": ["Policy Change", "Important"], "rewrite": "If you need to supplement to collect your specific information, you will explain to you separately to obtain your consent."}
{"task": "rw_125.jsonl", "id": 76681, "text": "2. The use and management of personal information", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76682, "text": "2.1 Use of personal information", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76683, "text": "In order to provide you with better services, this service will use your personal information in the following situation:", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76684, "text": "(1) Based on legal regulations and service needs", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76685, "text": "In accordance with the requirements of relevant laws and regulations, legal procedures;", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76686, "text": "And according to this service related service terms;", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76687, "text": "Use your personal information based on the needs of various business functions and services.", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76688, "text": "(2) Provide personalized services", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76689, "text": "We may analyze data analysis on the basis of your collected information to form a user portrait to provide you with a higher degree of consistent and more suitable for you to make the service information you are interested inShow you;", "label": ["Important", "Usage"], "rewrite": "The collection of your information for data analysis to form user portraits to provide personalized services to provide personalized services"}
{"task": "rw_125.jsonl", "id": 76690, "text": "Or show you the content you might want to find;", "label": ["Usage"], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76691, "text": "Show you or provide an advertisement, promotional information or information you may be interested in.", "label": ["Important", "Usage"], "rewrite": "Show you or provide advertisements, information and promotional materials that may be interested in"}
{"task": "rw_125.jsonl", "id": 76692, "text": "(3) Improve service", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76693, "text": "According to your service, service operation, and service security protection needs, you will improve and improve your service without leaking your personal information.", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76694, "text": "(4) Marketing, research, raffle activities", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76695, "text": "Under the premise that you agree to participate in the promotion or marketing, research, and lottery activities of this service, use your information to manage such activities in order to get in touch with you.", "label": ["Important", "Usage"], "rewrite": "Under the premise that you agree to participate in the promotion or marketing, research, and drawing activities, use your information to manage such activities"}
{"task": "rw_125.jsonl", "id": 76696, "text": "We will send you marketing activities and rewards to you after your consent (if. If there is, external desensitet display information), game update, game research and other information.", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76697, "text": "2.2 Sharing of personal information", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76698, "text": "(1) Partner type", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76699, "text": "In order to achieve the purpose of this \"Privacy Policy\", we may share your necessary information with our partners for the necessary, legal, legitimate, and specific purpose, and will ask such partners to only provide you with only providing you with youUse your information within the scope of the service.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "To share your necessary information with partners for the necessary, legal, legitimate, and specific purposes, and will require partners to use information within the scope of the service."}
{"task": "rw_125.jsonl", "id": 76700, "text": "The current partner of this service includes::", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76701, "text": "Ø, Payment service provider: In order to realize the payment function of the service, we will share your necessary transaction-related information with the payment service provider.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to realize the payment function of the service, the necessary information related to the transaction is shared with the payment service provider."}
{"task": "rw_125.jsonl", "id": 76702, "text": "应, service providers, suppliers: In order to better realize the functions of our service, so as to bring you a better service experience, we will provide us with a business support for us, service providers (including technical infrastructure services, Data Analysis Service, Customer Service or Academic Research and Survey Services) Provide you necessary information related to the service.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "It will provide you with the necessary information about the service -related information to the supplier and service provider (including technical infrastructure services, data analysis services, customer service or academic research and survey services)."}
{"task": "rw_125.jsonl", "id": 76703, "text": "：, Third -party merchants: When the content of your purchase involves the services provided by third -party merchants, we must share your order information and necessary information related to transactions with third -party merchants to realize that you purchase goods or services from them.The demand is prompted to complete the subsequent after -sales service.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share your order information and necessary information related to transactions with third -party merchants to realize your needs for purchasing goods or services from it"}
{"task": "rw_125.jsonl", "id": 76704, "text": "服务, Advertising and Analysis Service Providers: We will not directly provide your personal information to advertising or analytical service providers.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You will not directly provide your personal information to advertisements or share with analytical service providers."}
{"task": "rw_125.jsonl", "id": 76705, "text": "In order to help advertising service providers increase the effective touch rate of advertising without identifying your personal information, or to improve the effectiveness of the analysis results of the analysis service provider, we will provide relevant information and provideYou personally.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to help advertising service providers increase the effective touch rate of advertising without identifying personal information, it will provide relevant information and provide it so that it will not directly identify your individual"}
{"task": "rw_125.jsonl", "id": 76706, "text": "主, the essential subject to provide services: Based on fulfilling legal obligations or contractual obligations, preventing technology or security issues, we should disclose your personal information to it.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Based on the performance of legal obligations or contract obligations, preventing technology or security issues, you should disclose your personal information."}
{"task": "rw_125.jsonl", "id": 76707, "text": "当, government agencies: When complaints and disputes involving you with others, we may provide the relevant content of complaints and disputes, your contact information, and the necessary information designated by government agencies to government agenciesExcept for laws and regulations clearly prohibited.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The relevant content of complaints and disputes, your contact information, and the necessary information designated by government agencies are provided to government agencies to promote the timely resolution of complaints and disputes. Except for laws and regulations,"}
{"task": "rw_125.jsonl", "id": 76708, "text": "Companies, organizations and individuals who share personal information with us, we will ask them to observe the confidentiality agreement, and ask them to handle your personal information in accordance with our instructions, the \"Privacy Policy\" and any other related confidentiality and security measuresEssence", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Companies, organizations, and individuals who are required to share personal information with us comply with confidentiality, and process your personal information in accordance with confidentiality and security measures"}
{"task": "rw_125.jsonl", "id": 76709, "text": "(2) Special description of the embedded third -party code and plug -in", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76710, "text": "The plug -in in this service is not embedded in a third -party code and will not share fields containing personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The plug -in in this service is not embedded in a third -party code and will not share fields containing personal information."}
{"task": "rw_125.jsonl", "id": 76711, "text": "2.3 Transfer and public disclosure of personal information", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76712, "text": "Except for the situation stipulated in Article 2.4 of this \"Privacy Policy\", we will not transfer your personal information to any company, organization and individual or public disclosure.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Except for the situation stipulated in Article 2.4 of this \"Privacy Policy\", your personal information will not be transferred to any company, organization and individual or publicly disclosed"}
{"task": "rw_125.jsonl", "id": 76713, "text": "When involving mergers, acquisitions, asset transfers, or similar transactions, if personal information is transferred, we will ask new companies that hold your personal information and organizations to continue to be subject to the \"Privacy Policy\". Otherwise, we will ask forThe company and organization re -authorize your authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When merging, acquisition, asset transfer or similar transactions, if you involve personal information transfer, new personal information processors will continue to be constrained by the \"Privacy Policy\", otherwise, you will re -authorize your authorization consent."}
{"task": "rw_125.jsonl", "id": 76714, "text": "2.4 Exceptions", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76715, "text": "According to relevant laws and regulations and national standards, in the following circumstances, we may share, transfer, and publicly disclose personal information without requiring your authorization consent in advance:", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "In the following situations, we may share, transfer, and publicly disclose personal information without requiring your authorization consent in advance:"}
{"task": "rw_125.jsonl", "id": 76716, "text": "(1) Directly related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Sharing information directly related to national security and national defense security, no need to agree"}
{"task": "rw_125.jsonl", "id": 76717, "text": "(2) Directly related to public safety, public health, and major public interests;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Personal information directly related to public safety, public health, and major public interests."}
{"task": "rw_125.jsonl", "id": 76718, "text": "(3) Directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Direct related personal information such as sharing directly related to crime investigation, prosecution, trial, and judgment execution, no need to agree"}
{"task": "rw_125.jsonl", "id": 76719, "text": "(4) Out of maintaining major legitimate rights and interests of your or other individuals, but it is difficult to get my consent;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Share and maintain major legitimate rights and interests, but it is difficult to get personal information that I agree, no need to agree"}
{"task": "rw_125.jsonl", "id": 76720, "text": "(5) If you disclose personal information to the public by yourself, or get your clear consent or authorization in advance;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Share personal information to the public by themselves, or obtain personal information that has clear consent or authorization in advance, no need to agree"}
{"task": "rw_125.jsonl", "id": 76721, "text": "(6) Collect personal information from legal public information, such as legal news reports and government information disclosure.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Personal information collected from the information disclosed by legal publicly, no need to agree"}
{"task": "rw_125.jsonl", "id": 76722, "text": "(7) It meets the relevant agreements signed (including the user agreement signed online) or other legal documents.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Sharing is in line with relevant protocols (including user agreements signed online) or personal information stipulated in other legal documents, no need to agree"}
{"task": "rw_125.jsonl", "id": 76723, "text": "(8) Administrative or judicial requirements in accordance with laws and regulations or mandatory administrative or judicial requirements.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "According to laws and regulations or forced administrative or judicial requirements, you don’t need to agree"}
{"task": "rw_125.jsonl", "id": 76724, "text": "Third, the use of cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76725, "text": "In order to ensure the normal operation of the service, we will store a small data file called Cookie on your computer or mobile device.", "label": ["Important", "First Party Collection Information"], "rewrite": "Small data files that will be stored on a computer or mobile device"}
{"task": "rw_125.jsonl", "id": 76726, "text": "Cookie usually contains identifiers, site names, and some numbers and characters.", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76727, "text": "Cookies can help us identify registered users, count the number of users, analyze page design and effectiveness of advertisements, and save you from entering repetitive information.", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76728, "text": "You can manage and delete Cookie by allocating browsers (most of the network browsers will automatically accept cookies, but you can usually modify the browser settings according to your needs to reject, cookie).", "label": ["Important", "Edit/Control"], "rewrite": "You can manage and delete Cookie through configuration of the browser"}
{"task": "rw_125.jsonl", "id": 76729, "text": "After you manage and delete cookie, you may affect your access to this service or not to fully obtain the service content of this service.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "After managing and deleting cookies, it may affect the content of the service content of visiting this service or not fully obtain the service content."}
{"task": "rw_125.jsonl", "id": 76730, "text": "In addition to cookies, we may use similar technologies according to the actual needs of the service.", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76731, "text": "Our research and use of Cookie and similar technologies is mainly used to improve service/service quality and optimize user experience, and will not exceed the purpose described in the \"Privacy Policy\".", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76732, "text": "Fourth, the protection of personal information", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76733, "text": "4.1 Storage", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76734, "text": "This service will retain your personal information during the period of time to realize the purpose of this \"Privacy Policy\" and the time limit required by laws and regulations.", "label": ["Data Retention", "Important"], "rewrite": "This service will retain your personal information during the period of time to realize the purpose of this \"Privacy Policy\" and the time limit required by laws and regulations."}
{"task": "rw_125.jsonl", "id": 76735, "text": "In response to some of the main data preservation period stipulated in the current laws and regulations, we will explain to you as follows:", "label": ["Data Retention", "Important"], "rewrite": "For some main data preservation period stipulated in the current laws and regulations, the description is as follows:"}
{"task": "rw_125.jsonl", "id": 76736, "text": "(1), user log information: the retention period is 60 days.", "label": ["Data Retention", "Important"], "rewrite": "User log information: The storage period is 60 days."}
{"task": "rw_125.jsonl", "id": 76737, "text": "(2) User recharge and consumption records: The storage period is not less than 180 days.", "label": ["Data Retention", "Important"], "rewrite": "User recharge and consumption records: The storage period is not less than 180 days."}
{"task": "rw_125.jsonl", "id": 76738, "text": "(3) Real backup of Internet security protection technical measures: The storage period is at least 60 days.", "label": ["Data Retention", "Important"], "rewrite": "Internet security protection technical measures record backup: The storage period is at least 60 days."}
{"task": "rw_125.jsonl", "id": 76739, "text": "If our service has terminated operations, we will notify the announcement in advance.", "label": ["Important", "Cessation of Operations"], "rewrite": "If the service terminates the operation, the announcement will be notified in advance."}
{"task": "rw_125.jsonl", "id": 76740, "text": "After exceeding the storage period, we will delete or processes your personal information, but national laws, regulations, regulations, standardized documents, or government policies and orders have other requirements or to fulfill our compliance obligationsExcept for your personal information.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "After exceeding the storage period, we will delete or processes your personal information"}
{"task": "rw_125.jsonl", "id": 76741, "text": "In principle, the personal information we collected and generated in the territory of the People's Republic of China will be stored in the territory of the People's Republic of China.", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in the People's Republic of China will be stored in the People's Republic of China."}
{"task": "rw_125.jsonl", "id": 76742, "text": "If you need to transport your personal information cross -border, we will obtain your authorization consent alone.", "label": ["Data Retention", "Important"], "rewrite": "If you need to transport your personal information cross -border, you will obtain your authorization consent alone."}
{"task": "rw_125.jsonl", "id": 76743, "text": "After getting your authorization consent, your personal information may be transferred to overseas jurisdictions of your service or service country/region, or access to these jurisdictions.", "label": ["Data Retention", "Important"], "rewrite": "After obtaining the consent of authorization, your personal information may be transferred to overseas jurisdiction or accessed by these jurisdictions."}
{"task": "rw_125.jsonl", "id": 76744, "text": "There may be different data protection laws in such jurisdictions, and no relevant laws are set up.", "label": ["Data Retention", "Important", "Risk"], "rewrite": "There may be different data protection laws in such jurisdictions, and no relevant laws are set up."}
{"task": "rw_125.jsonl", "id": 76745, "text": "In such circumstances, your personal information will be equally protected as the People's Republic of China.", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76746, "text": "Before cross -border data transfer, we will implement security measures such as data dementification.", "label": ["Important", "Data Security"], "rewrite": "Before cross -border data transfer, the implementation of the implementation data to identify security measures and other security measures"}
{"task": "rw_125.jsonl", "id": 76747, "text": "4.2 Security measures", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76748, "text": "This service will do everything in reasonable efforts to protect your personal information under the current technical level.", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76749, "text": "To prevent your personal information from being illegally accessed, replicated, modified, transmitted, lost, lost, processed or used under unexpected and unauthorized circumstances.", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76750, "text": "We use multi -directional security protection measures (including technical protection methods, management system measures, etc.) to ensure that your personal information protection treatment is reasonable.", "label": ["Important", "Data Security"], "rewrite": "Use multi -position security protection measures (including technical protection methods, management system measures, etc.) to ensure that personal information protection is at a reasonable level of security"}
{"task": "rw_125.jsonl", "id": 76751, "text": "This service will adopt technical means such as encrypted technology (such as SSL), firewalls, restrictions on unauthorized access, de -identification or anonymous treatment to protect your personal information.", "label": ["Important", "Data Security"], "rewrite": "The technical means such as encrypted technology (such as SSL), firewalls, restrictions on unauthorized access, de -identification or anonymous treatment will be used to protect personal information"}
{"task": "rw_125.jsonl", "id": 76752, "text": "We will also continue to strengthen the construction of software security capabilities, such as completing some information encryption work locally to consolidate security transmission;", "label": ["Important", "Data Security"], "rewrite": "We will continue to strengthen the construction of software security capabilities, such as completing part of the information encryption work locally on the device to consolidate secure transmission."}
{"task": "rw_125.jsonl", "id": 76753, "text": "Understand the application information and running process information installed by your device to prevent malicious programs such as viruses and Trojans.", "label": ["Important", "Data Security"], "rewrite": "Understand the application information and running process information installed by your device to prevent malicious programs such as viruses and Trojans."}
{"task": "rw_125.jsonl", "id": 76754, "text": "However, please understand that due to the technical restrictions and various malicious means, in the Internet industry, even if you can do your best to strengthen security measures, it is impossible to ensure that the information is 100 % security.", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76755, "text": "You need to understand that the systems and communication networks you use to access our services may be due to factors outside of our controllable scope.", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76756, "text": "We will continue to improve the relevant management system and establish related processes and organizations simultaneously to further protect your personal information and prevent your personal information from being accessed, used or disclosed by unauthorized personnel.", "label": ["Important", "Data Security"], "rewrite": "It will continuously improve the relevant management system and establish related processes and organizations simultaneously to further protect your personal information."}
{"task": "rw_125.jsonl", "id": 76757, "text": "We will strictly restrict the scope of the personnel accessing information and sign a confidentiality agreement with the aforementioned personnel. Persons who violate the obligations of confidentiality will be punished in accordance with the management system.", "label": ["Important", "Data Security"], "rewrite": "The scope of personnel who will strictly restrict access to information and sign a confidentiality agreement with the aforementioned personnel. Persons who violate the obligations of confidentiality will be punished in accordance with the management system."}
{"task": "rw_125.jsonl", "id": 76758, "text": "We will take all reasonable and feasible measures to ensure unrelated personal information.", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76759, "text": "We will only retain your personal information within the time limit required by the cost of reaching the cost of the cost, unless you need to extend the retention period or be permitted by law.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "Personal information will only be retained within the time limit required for the purpose of the cost of reaching the cost of the cost, unless the reserved period is required or permitted by the law."}
{"task": "rw_125.jsonl", "id": 76760, "text": "4.3 Safety event processing", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76761, "text": "If a personal information security incident occurs, we will inform you the basic situation of the security incident in time through the requirements of the laws and regulations, through the announcement, push notification, and the contact information you reserved.To minimize your losses or remedy your losses.", "label": ["Important", "Data Security"], "rewrite": "In the event of a personal information security incident, the basic situation of the security incident, the processing process and other information will be promptly notified."}
{"task": "rw_125.jsonl", "id": 76762, "text": "At the same time, we will also actively report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "It will take the initiative to report the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities."}
{"task": "rw_125.jsonl", "id": 76763, "text": "4.4 Safety suggestion", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76764, "text": "Although the above -mentioned reasonable and effective measures have been taken and the standards required by relevant laws have been adopted, they are limited by existing technical restrictions. This service still cannot guarantee that your personal information canSafety during communication.", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76765, "text": "Therefore, it is recommended that you take positive measures to ensure the security of personal information, such as setting complex passwords, modifying the account password regularly, and not disclosing personal information such as your account password to others.", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76766, "text": "You should try to avoid providing personal sensitive information when submitting personal information to this website and decide carefully.", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76767, "text": "If you find your personal information disclosure, especially your account password leak, please contact us immediately according to the contact information provided in this privacy policy so that we can take corresponding measures.", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76768, "text": "5. Your right to personal information", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76769, "text": "We will exercise the following rights in accordance with relevant Chinese laws and regulations to ensure your personal information:", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76770, "text": "5.1 Query, modification", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76771, "text": "Out of security and identity identification (such as number appeal services), you may not be able to inquire about some initial registration information and verification information provided when registering.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "You may not be able to inquire about some initial registration information and verification information provided during registration."}
{"task": "rw_125.jsonl", "id": 76772, "text": "If you do have this need, you can contact us in accordance with the contact information agreed in Article 9, but please understand that we need to verify your necessary identity.", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76773, "text": "If you need to modify the password and mobile phone number when the initial registration, you can modify it in www.xoyo.com- Security Center-account security according to requirements and steps.", "label": ["Important", "Edit/Control"], "rewrite": "If you need to modify the password and mobile phone number during the initial registration, you can modify it in www.xoyo.com-Security Center-Account Security"}
{"task": "rw_125.jsonl", "id": 76774, "text": "5.2 Delete", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76775, "text": "You can contact us in accordance with the following circumstances, and contact us in accordance with the contact information agreed in Article 9, and make a request to delete personal information (in general, we will reply to your request within 15 working days)Essence", "label": ["Important", "Edit/Control"], "rewrite": "You can make a request to delete personal information."}
{"task": "rw_125.jsonl", "id": 76776, "text": "(1) If our behavior of handling personal information violates laws and regulations;", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76777, "text": "(2) If we collect and use your personal information without your consent;", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76778, "text": "(3) If our behavior of handling personal information violates your agreement;", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76779, "text": "(4) If you no longer use our service, or you cancel your account;", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76780, "text": "(5) If we no longer provide you with services.", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76781, "text": "If we decide to respond to your deletion request, we will also promptly notify other entities that obtain your personal information from us in time, asking them to delete them in time, except that the laws and regulations have stipulated that or these entities have obtained your independent authorization.", "label": ["Important", "Edit/Control"], "rewrite": "If we decide to respond to the deletion request, we will notify other entities to delete in time, but the laws and regulations have other regulations or these entities have obtained your independent authorization"}
{"task": "rw_125.jsonl", "id": 76782, "text": "When you delete the information from our services, we may not back up the corresponding information in the system, but will delete these information when the backup is updated.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "When you delete the information from our service, you may not immediately delete the corresponding information in the system, but you will delete these information when the backup update."}
{"task": "rw_125.jsonl", "id": 76783, "text": "5.4 Logging out", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76784, "text": "You can click to enter the corresponding game area at any time through the customer service center (https://kefu.xoyo.com/) → click the [Help] button above → select you to select the [Jinshan Pass Logging out] at the application of the GM operation.Registered account.", "label": ["Important", "Edit/Control"], "rewrite": "Enter the [Help] button at the Customer Service Center (https://kefu.xoyo.com/), and select your registered account to select the setting method of [Jinshan Pass Logging out] at the application office of the GM operation."}
{"task": "rw_125.jsonl", "id": 76785, "text": "Please note that once you cancel your account, you will not be able to use the account service of the account and your information and account -related data will be deleted or anonymous after the account is canceled, so please do it carefully.", "label": ["Important", "Edit/Control"], "rewrite": "Once the account is canceled, the account corresponding to the account and your information and account -related data will be deleted or anonymous after the account is canceled."}
{"task": "rw_125.jsonl", "id": 76786, "text": "If you cannot cancel it in the above way, you can contact us in accordance with the contact information agreed in Article 9, and make a request for the cancellation of the account (in general, we will reply to your request within 15 working days).", "label": ["Important", "Edit/Control"], "rewrite": "If you cannot cancel it in the above way, you can make a request to cancel your account (in general, we will reply to your request within 15 working days)"}
{"task": "rw_125.jsonl", "id": 76787, "text": "5.5 Rights exercise reminder", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76788, "text": "In order to protect the security of the account, when you make a decision of modification, deletion, and cancellation, we may ask you to verify your identity.", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76789, "text": "For your reasonable request, we do not charge fees in principle, but for multiple repeated and more reasonable requests, we may charge a certain cost fee as actual situation.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "For reasonable requests, in principle, it does not charge fees, but for multiple repeated and more reasonable requests, a certain cost may be charged."}
{"task": "rw_125.jsonl", "id": 76790, "text": "We may refuse to reject those who have no repetition, need too much technical means, bring risks or very unrealistic requests to others.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "For those requests that have no repetition, need too much technical means, and bring risks to others' legitimate rights and interests, they may refuse."}
{"task": "rw_125.jsonl", "id": 76791, "text": "5.6 exceptional situation", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76792, "text": "When involving the following situation, we may not be able to respond to your decision on modification, deletion, and cancellation:", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "When it comes to the following circumstances, it may not be able to respond to your decision, etc."}
{"task": "rw_125.jsonl", "id": 76793, "text": "(1) Directly related to national security and national defense security;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Those who are directly related to national security and national defense security cannot respond to requests"}
{"task": "rw_125.jsonl", "id": 76794, "text": "(2) Directly related to public safety, public health, and major public interests;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Those who are directly related to public safety, public health, and major public interests cannot respond to requests"}
{"task": "rw_125.jsonl", "id": 76795, "text": "(3) Directly related to criminal investigation, prosecution, trial, and execution judgment;", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "Directly related to criminal investigation, prosecution, trial, and execution judgment cannot respond to request"}
{"task": "rw_125.jsonl", "id": 76796, "text": "(4) We have sufficient evidence that you have subjective malicious or abuse of rights (for example, your request will endanger public safety and the legitimate rights and interests of others, or your request exceeds the scope of general technical means and commercial costs);", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "If there is sufficient evidence that you have subjective malice or abuse of rights, you cannot respond to the request"}
{"task": "rw_125.jsonl", "id": 76797, "text": "(5) Response such requests will cause the legitimate rights and interests of you or other individuals and organizations;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "If responding to such requests will cause damage to the legitimate rights and interests of you or other individuals or organizations, it is impossible to respond to the request"}
{"task": "rw_125.jsonl", "id": 76798, "text": "(6) Any reasonable reasons involving business secrets.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "If there are reasonable reasons involving business secrets, you cannot respond to the request"}
{"task": "rw_125.jsonl", "id": 76799, "text": "6. Special protection for personal information of minors", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76800, "text": "This service attaches great importance to the protection of personal information of minors (citizens under the age of 18).", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76801, "text": "This service will protect personal information of minors in accordance with relevant laws and regulations and the provisions of this \"Privacy Policy\".", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76802, "text": "If you are a minor, please carefully read the \"Privacy Policy\" with your guardian before using this service to understand the relevant provisions of your personal data collection and ensure that our personal data collection has obtained the guardian.Use this service before agreeing.", "label": ["Specific Audiences", "Important"], "rewrite": "Before using this service, please carefully read the \"Privacy Policy\" with your guardian and ensure that the consent of the guardian has obtained"}
{"task": "rw_125.jsonl", "id": 76803, "text": "For the personal information of minors collected by the guardian's consent, we will only use or disclose this information if the guardians are allowed, the guardian to clearly agree or protect the minors.", "label": ["Specific Audiences", "Important"], "rewrite": "For the personal information of minors collected by the guardian's consent, it will only use or disclose this information if the guardian is allowed, the guardian clearly agrees or protects minors."}
{"task": "rw_125.jsonl", "id": 76804, "text": "If you are a minor but failed to obtain/without your consent of your guardian, even if you use this service and have provided information to us, please or your guardian to immediately stop using this service and contact us in a timely manner.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a minor but failed to get the consent of your guardian, please or your guardian to immediately stop using this service and contact us in time."}
{"task": "rw_125.jsonl", "id": 76805, "text": "If we find that the collection of related data has not obtained the consent of your guardian, we will suspend your related services and try to delete relevant data as soon as possible.", "label": ["Specific Audiences", "Important"], "rewrite": "If it is found that the collection of relevant data has not obtained the consent of the guardian, the relevant services will be suspended and the relevant data will be deleted as soon as possible."}
{"task": "rw_125.jsonl", "id": 76806, "text": "7. Application and modification of this \"Privacy Policy\"", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76807, "text": "7.1 Application of \"Privacy Policy\"", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76808, "text": "For example, the content of this \"Privacy Policy\" is not the same as the \"Privacy Policies\" or other similar documents that you signed with \"User Agreement\", \"Service Terms\" or related specific services.", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76809, "text": "7.2 Modification of \"Privacy Policy\"", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76810, "text": "In order to provide you in time and better in time, the content of this \"Privacy Policies\" may change due to our business function changes, the purpose of personal information use, and the change of personal information protection.Don't worry, without your clear consent, such changes will not reduce the rights you should enjoy in accordance with this \"Privacy Policy\".", "label": ["Policy Change", "Important"], "rewrite": "The content of this Privacy Policy may be changed, and such changes will not reduce your rights under this Privacy Policy without express consent."}
{"task": "rw_125.jsonl", "id": 76811, "text": "Once the content of the Privacy Policy has changed, we will expose the page in this service mainly, or through the way you reserve (please note that you agree that we will send you this \"privacy\"Policies\" modification, update notification, and game services provided by/or Jinshan software, update notifications for mobile software), or notify you through proper ways such as pop -up windows;", "label": ["Policy Change", "Important"], "rewrite": "Once the content of \"Privacy Policy\" has changed, the main exposure page of this service will be exposed on this service, or inform you through appropriate methods such as reserved methods and pop -ups"}
{"task": "rw_125.jsonl", "id": 76812, "text": "The aforementioned acts and notification behaviors will be deemed that we have notified you to modify the content.", "label": ["Policy Change", "Important"], "rewrite": "The aforementioned an announcement and notification behavior will be deemed to have notified you to modify the content."}
{"task": "rw_125.jsonl", "id": 76813, "text": "If you do not agree to the modifications we have made to the terms of this Privacy Policy, you may immediately stop using the Service.", "label": ["Policy Change", "Important"], "rewrite": "If you do not agree with the amendments to the terms of this \"Privacy Policy\", you can stop using this service immediately."}
{"task": "rw_125.jsonl", "id": 76814, "text": "If you continue to use this service, you will be deemed to be a modified content made by the user's consent and accepting the terms of this \"Privacy Policy\", and you must not require any compensation or compensation.", "label": ["Policy Change", "Important"], "rewrite": "If this service is continued, it is deemed to be a modified content made by the user's consent and accepting the terms of this \"Privacy Policy\", and it shall not require any compensation or compensation for this."}
{"task": "rw_125.jsonl", "id": 76815, "text": "8. Application and dispute resolution of law", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76816, "text": "This \"Privacy Policy\" applies to the laws of the People's Republic of China (the purpose of these clauses does not include Hong Kong, Macau and Taiwan law), and does not consider any conflict law.", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76817, "text": "If you have related disputes with us, you should submit the lawsuit of the People's Court of the Registered Local of Chengdu Xishanju Technology Co., Ltd., the operator of this service operator.", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76818, "text": "Nine, contact us", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76819, "text": "Our registered address is located at China (Sichuan) Free Trade Zone Chengdu High -tech South Road No. 669, No. 669, Block B, No. 15, No. 15 Floor. If you have any opinions or suggestions on this \"Privacy Policy\", or visit your personal informationThere are any opinions, suggestions or complaints such as modification or other matters that can be contacted in the following ways (in general, we will reply within 15 working days):", "label": ["Important", "Contact Information"], "rewrite": "Our registered address is located on China (Sichuan) Free Trade Pilot Zone Chengdu High -tech Zone Vientiane Vientiane No. 669, Jiachen International Center, Block B Floor, No. 15, No. 15"}
{"task": "rw_125.jsonl", "id": 76820, "text": "Contact information of our personal information protection person: Tel 028-85437733-9.", "label": ["Important", "Contact Information"], "rewrite": "Contact information of our personal information protection person: Tel 028-85437733-9."}
{"task": "rw_125.jsonl", "id": 76821, "text": "In order to protect your personal information and your rights, we may ask you to verify your personal information or other rights.", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76822, "text": "10. Keyword description", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76823, "text": "10.1 related company", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76824, "text": "Refers to the company or other legal entities controlled by one party, or one party is controlled, or one party is controlled by a third party;", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76825, "text": "Control refers to the state that one party controls the other party or other methods determined by the people's court through holding, most voting rights, agreements, or other methods identified by the people's court.", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76826, "text": "10.2 Personal sensitive information", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76827, "text": "Including identity documents, personal biometric information, bank accounts, communication records and content, property information, credit information, trajectory trajectory, accommodation information, health and physiological information, transaction information, etc.", "label": [], "rewrite": []}
{"task": "rw_125.jsonl", "id": 76828, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
