{"task": "rw_20.jsonl", "id": 43995, "text": "【Quark】 Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 43996, "text": "Effective date: [2022] Year [8] month [24] Day", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 43997, "text": "Update date: [2022] Year [9] month [1] Day", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 43998, "text": "【introduction】", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 43999, "text": "You are welcome to use our products and services!", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44000, "text": "We know the importance of personal information to you. Your trust is very important to us. We will strictly abide by laws and regulations to take corresponding security protection measures to protect your personal information security and controlling.", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44001, "text": "Based on this, the [Quark] service provider (or \"we\") formulates this \"[Quark] Privacy Policy\" (hereinafter referred to as \"this policy\"/\"privacy policy\"), helping you fully understand the use of our products and our products and our products and our products and andDuring the service, how will we collect, use, share, store, and protect your personal information, as well as how you can manage your personal information so that you can make a better choice.", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44002, "text": "Before you start using our products and services, please read and understand this policy carefully. In particular, we should focus on reading the clauses we logging in the threatening of the body/coarse body to ensure that you fully understand and agree to use it before starting to use.", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44003, "text": "The professional vocabulary involved in this policy, we try to explain to you in a concise and popular expression in order to facilitate your understanding.", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44004, "text": "If you have any questions, opinions or suggestions on the content of this policy, you can contact us through the contact information at the end of this policy.", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44005, "text": "You agree that the privacy policy said that you have understood the functions provided by the application, and the necessary personal information required for functional operation, and give corresponding collection and use authorization, but it does not mean that you have agreed to open up additional functions and handle non -necessary personal information.The opening, processing non -necessary personal information and processing sensitive personal information, we will solicit your consent separately according to your actual usage.", "label": ["Cessation of Operations", "First Party Collection Information", "Policy Change"], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44006, "text": "This privacy policy will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44007, "text": "1. Scope of application", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44008, "text": "2. Information collection and use", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44009, "text": "3. Provide information to the outside world", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44010, "text": "Fourth, your rights", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44011, "text": "5. Storage of information", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44012, "text": "6. Policy update", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44013, "text": "7. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44014, "text": "Eight, contact us", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44015, "text": "Appendix: Related Definition", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44016, "text": "1. Scope of application", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44017, "text": "This policy is applicable to the products and services provided by you with a website, APP client, and new forms that emerge with technology development.", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44018, "text": "We and affiliated companies have privacy policies on their products or services (such as: \"Book Banner Privacy Policy\" and \"Helping Privacy Policy\"), and the corresponding privacy policy is applicable to the corresponding products or services.", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44019, "text": "In addition to the relevant information collection and use activities described in this policy, this policy is not applicable to other services you provided by the collaborators and other third directions, and other services apply to the personal information collection and use rules that they explain to you.", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44020, "text": "For example, when you read comics, you can use its special \"Quick Watching Privacy Agreement\" by Kuai World (Beijing) Technology Co., Ltd..", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44021, "text": "2. Information collection and use", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44022, "text": "When you use our products/services, the personal information we need/may need to collect and use includes the following:", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44023, "text": "1. In order to realize the basic functions of providing you with our products and/or services, you must authorize us to collect and use the necessary information.", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44024, "text": "If you refuse to provide the corresponding information, you will not be able to use our products and/or services normally;", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44025, "text": "2. In order to provide you with additional functions to our products and/or services, you can choose to agree or disagree with the information we collected and used alone.", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44026, "text": "If you refuse to provide it, you will not be able to use related additional functions normally or cannot achieve the functional effects we intend to achieve, which will not affect your basic functions.", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44027, "text": "We are here to remind you that we are committed to creating a variety of products and services to meet your needs.", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44028, "text": "Because there are many types and services we provide to you, and there are differences in the scope of the specific product/service selected by different users, the basic/additional functions and the personal information types and scope of personal information and use will be different. Please use specific ones.Product/service function shall prevail.", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44029, "text": "The specific feature scenarios we will provide you include::", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44030, "text": "(1) Help you become our member and account management", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44031, "text": "1. Basic member service", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44032, "text": "We provide you with services based on the quark account.", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44033, "text": "In order to create a quark account, you need to provide us at least your mobile phone number.", "label": ["Important", "First Party Collection Information"], "rewrite": "To create a quark account, you need to provide your mobile phone number."}
{"task": "rw_20.jsonl", "id": 44034, "text": "If you refuse to provide the above information, you will not be able to register for the quark account, you can only use browsing and search services.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44035, "text": "In order to ensure that we are providing services for you, we may verify your identity according to the above information you provide.", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44036, "text": "If there is a scene that needs to determine your necessary identity (including protecting the rights and interests of minors in accordance with the law, cracking down on telecommunications network fraud, deducting taxes and fees for you, relevant subjects in administrative law enforcement or judicial litigation), you can authorize usThe company obtains your necessary authentication information for your Alipay account for the above purposes.", "label": ["Important", "First Party Collection Information"], "rewrite": "If there is a scene that needs to determine your necessary identity according to law, you can authorize us to obtain the necessary authentication information of your corresponding Alipay account from Alipay."}
{"task": "rw_20.jsonl", "id": 44037, "text": "2. Third party authorization Login", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44038, "text": "You can also log in to Quark through third -party accounts (including Taobao, Alipay, Weibo, WeChat, QQ).", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44039, "text": "In order to achieve the previous description, you understand and agree that we will obtain and collect your third -party account information from a third party, such as nicknames, avatars, and other information that you agree with the authorization interface.", "label": ["Important", "First Party Collection Information"], "rewrite": "You understand and agree that we will obtain and collect your third -party account information from a third party to achieve login."}
{"task": "rw_20.jsonl", "id": 44040, "text": "3. Account certification service", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44041, "text": "When you use the functions or services that you can provide to provide, such as network disk, mini -game, photography questions, or live broadcast services, event reward tax deduction services provided by third parties embedded in SDK forms, in accordance with relevant laws and regulations, according to relevant laws and regulations, according to relevant laws and regulations, andYou may need to provide your name, ID number, phone number to prove your true identity.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the function or service that you need to authenticate to provide, you may need to provide the name, ID number, and phone number to prove your true identity."}
{"task": "rw_20.jsonl", "id": 44042, "text": "You can refuse to provide it, but you may not be able to obtain related services, but do not affect the normal use of other functions and services.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44043, "text": "4. Additional member service", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44044, "text": "You can choose to further improve your account information, such as providing us your avatars, nicknames, mobile phone numbers, constellations to get additional services that meet your needs.", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44045, "text": "If you provide a real and effective mobile phone number, Taobao account, and Alipay account for binding, when you encounter accounts such as registered account loss, you can more conveniently find the account.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you provide a real and effective mobile phone number, Taobao account, and Alipay account for binding, you can recover your account faster when you encounter an account problem."}
{"task": "rw_20.jsonl", "id": 44046, "text": "By binding Taobao accounts and Alipay accounts, you can participate in services such as marketing activities, coupons collection, and convenient cash on marketing activities held in Alipay/Taobao in Quark.", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44047, "text": "You can also choose not to bind, you will not be able to use the above -mentioned related services, but do not affect the normal use of other functions and services.", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44048, "text": "You can manage the binding relationship through \"my-account and security\".", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44049, "text": "(2) Provide you with search and browsing services", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44050, "text": "1. Search", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44051, "text": "When you use the quark search service, we will collect your search keywords.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the quark search service, we will collect your search keywords."}
{"task": "rw_20.jsonl", "id": 44052, "text": "In order to provide efficient search services, some search keywords and service log information will be temporarily stored in your local storage device, and you can show you the content of search results and search history.", "label": ["Data Retention", "Important"], "rewrite": "Some search keywords and service log information will temporarily store in your local storage device, and you can show you the content of the search results and search history."}
{"task": "rw_20.jsonl", "id": 44053, "text": "When you use camera search and voice search function, we need to obtain the camera permissions, album readings, and microphone recording permissions when using camera and voice search functions.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use camera search and voice search function, we need to obtain the camera permissions, album readings, and microphone recording permissions when using camera and voice search functions."}
{"task": "rw_20.jsonl", "id": 44054, "text": "We can only call the aforementioned permissions only when you just call the corresponding search function by clicking the camera/voice search entrance by clicking on the camera/voice search entrance, if you refuse to authorize the camera permissions, album reading permissions, or microphone recording.Permanent, you will be unable to evoke the corresponding service, but do not affect other functions.", "label": ["Permission Acquisition", "Important", "Edit/Control"], "rewrite": "We should only call the camera permissions, album read permissions, and microphone recording permissions when you have evoked the corresponding search function."}
{"task": "rw_20.jsonl", "id": 44055, "text": "2. View", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44056, "text": "In the process of using our service, to identify the abnormal status of the account, understand the product adaptability, and provide you with the page display and search results that meet your needs.You need to obtain your storage read and write permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "In the process of using our service, we need to obtain your storage reading and writing permissions based on basic operating needs such as cache, download, log storage and other basic operations."}
{"task": "rw_20.jsonl", "id": 44057, "text": "In order to provide you with more convenient and more information display and search for your personalized needs, we will collect your equipment information and service log information according to law, extract your preferences, and use the characteristic label output indirect crowd portraits, use it with the characteristics of the indirect people, use it with a characteristic labeling, use the portrait portrait portrait.For display, push information and possible commercial advertisements.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We will collect your equipment information and service log information, and produce indirect portrait portraits for display, push information and possible commercial advertisements."}
{"task": "rw_20.jsonl", "id": 44058, "text": "In the non -marking browsing mode, we will still collect the above equipment information and service log information data.", "label": ["Important", "First Party Collection Information"], "rewrite": "In the non -marking browsing mode, we will still collect equipment information and service log information data."}
{"task": "rw_20.jsonl", "id": 44059, "text": "When you use no trace browsing mode, your search history, web browsing history, cookie, and local storage cache will be cleared after you exit the no trace browse mode or restart the browser.", "label": ["Data Retention", "Important"], "rewrite": "When you use no trace browsing mode, your search history, web browsing history, cookie, and local storage cache will be cleared after you exit the no trace browse mode or restart the browser."}
{"task": "rw_20.jsonl", "id": 44060, "text": "If you want to manage the personalized advertisements we send to you, you can set it in \"My-Settings-Privacy Settings-Personalized Advertising Recommendation\".", "label": ["Important", "Edit/Control"], "rewrite": "You can manage personalized advertisements in \"My-Settings-Privacy Settings-Personalized Advertising Recommendation\"."}
{"task": "rw_20.jsonl", "id": 44061, "text": "If you want to manage the personalized content we push you, you can set it in \"My-Settings-Privacy Settings-Personalized Content Recommendation\".", "label": ["Important", "Edit/Control"], "rewrite": "You can set the recommendation of personalized content in \"My-Settings-Privacy Settings-Personalized Content Recommendation\"."}
{"task": "rw_20.jsonl", "id": 44062, "text": "In addition, we will use your above information to continuously improve and optimize the above functions.", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44063, "text": "(3) Provide you with information release interactive services", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44064, "text": "1. Upload and release of content", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44065, "text": "(1) When you use content publishing, comments, questions, answers and other functions, we will show your nickname, avatar, publishing content (graphic, video and audio).", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When you use content publishing, comments, questions, answers and other functions, we will show your nickname, avatar, publishing content."}
{"task": "rw_20.jsonl", "id": 44066, "text": "(2) When you use uploading pictures and publishing audio and video functions, we will ask you to authorize the camera/album read, write, storage, read, write/microphone rights.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use uploading pictures and publishing audio and video functions, we will ask you to authorize the camera/album read, write/store reading and write/microphone permission."}
{"task": "rw_20.jsonl", "id": 44067, "text": "If you refuse to authorize, you will not be able to use related functions, but it will not affect your normally use the other functions of Quark.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44068, "text": "(3) When you need to interact with the service provided by a third party on the service based on the location, we will ask you to authorize the location permissions and collect the location information related to the service.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "When you interact with third parties, we need to do a position based on the position, and we will ask you to authorize the position permissions and collect information related to the service."}
{"task": "rw_20.jsonl", "id": 44069, "text": "If you refuse to provide accurate geographical information, you will not be able to use this function, but it will not affect your normally use other functions of Quark.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44070, "text": "(4) Please note that the information you posted publicly may involve your or other people's personal information and even personal sensitive information. If you publish, choose to upload pictures containing personal information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "You may involve your personal information and even personal sensitive information in your public information."}
{"task": "rw_20.jsonl", "id": 44071, "text": "Please consider whether to share or even publicly share relevant information when using our services.", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44072, "text": "If your public information involves personal information of children, you need to obtain the authorization of the child involved before the release.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Important"], "rewrite": "If your public information involves personal information of children, you need to obtain the authorization of the child involved before the release."}
{"task": "rw_20.jsonl", "id": 44073, "text": "In the aforementioned situation, children or guardians have the right to contact us through the approaches of Article 9 of this policy, asking for more correct or deleting content involving children's personal information.", "label": ["Specific Audiences", "Important"], "rewrite": "Children or guardians have the right to contact us to ask for correct or deleting the content of children's personal information."}
{"task": "rw_20.jsonl", "id": 44074, "text": "2. Other services related to operational activities", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44075, "text": "(1) Provide you with technical docking support. When you use small programs in Quark, in order to achieve the purpose of providing technical support such as docking, we need to provide small program developers and technical service providers (for example: Alipay Small Program Technical Service Service ServiceProvide) Get your necessary personal information, equipment information, log information for your necessary personal information to achieve the previous description.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use a small program in Quark, we need to obtain your necessary personal information, equipment information, and log information from the service provider."}
{"task": "rw_20.jsonl", "id": 44076, "text": "When you use a small program service through Quark, your information will apply the privacy policy of mini -program developers and technical service providers. It is recommended that you read and confirm the relevant agreement before receiving the relevant services.", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44077, "text": "(2) To provide you with related services for operational activities, Quark will launch operating activities for newly launched services and functions from time to time. If you participate in related operating activities, we will collect through the operation activity interfaceMethods in order to get in touch with you, verify your rewards for qualifications, and issue operational rewards to you.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If you participate in related operating activities, we will collect include but not limited to your identity information and contact information, in order to get in touch with you, verify your reward acquisition qualifications, and issue operational rewards to you."}
{"task": "rw_20.jsonl", "id": 44078, "text": "If you do not participate in related operating activities, you do not need to provide the aforementioned information. If you participate in the operating activities but refuse to provide it, you will not get relevant rewards.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44079, "text": "(4) Provide you with tools services", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44080, "text": "1. Quark network disk", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44081, "text": "(1) As an information storage space, the quark network disk provides you with services such as uploading, storage, downloading, synchronization (backup), management, preview and sharing of content. You need to request you to grant read and write storage permissions.", "label": ["Data Retention", "Permission Acquisition", "Important"], "rewrite": "The quark network disk provides you with services such as uploading, storage, downloading, synchronization (backup), management, preview and sharing of content, you need to request you to grant read and write storage permissions."}
{"task": "rw_20.jsonl", "id": 44082, "text": "At the same time, you can open the automatic backup function according to product guidance, and actively select the type of files you need to back up, such as albums, videos, documents, installation packages, compressed packages, etc. Using this function, you need to connect to the network and log in to the quark of Quark on your mobile phone.accomplish.", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44083, "text": "If you want to close this function, you can close it in [Quark Network Disk-Homepage-My Backup-upper right corner settings] and close according to other guidelines in the product. If you close the entrance, unless you manually backup, we will not read anymoreTake and synchronize the corresponding information.", "label": ["Important", "Edit/Control"], "rewrite": "You can turn off the automatic backup function on the [Quark Network Disk-Homepage-My Backup-Backup Settings in the upper right corner] and turn off the automatic backup function according to other guidelines in the product."}
{"task": "rw_20.jsonl", "id": 44084, "text": "(2) In the quark network disk service, in order to help you find and manage pictures better, Quark relying on AI technology to classify the face, place, things, and text in your picture for smart characters.", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44085, "text": "If you use this function, you can quickly find the pictures you need by searching the function (such as input: Guangzhou, flowers, etc.);", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44086, "text": "You can also try the text information contained in the picture to find the picture you need.", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44087, "text": "According to your participation and authorization, we may use the picture training image recognition algorithm you proactively provided to improve the quality of the service, but we will not store your picture information separately, nor will we use your picture outside the scene.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may use the picture training image recognition algorithm you actively provide to improve the quality of the service, but it will not store your picture information separately and will not be used outside the scene."}
{"task": "rw_20.jsonl", "id": 44088, "text": "If you need to close it, you can set it on the [Quark Network Disk-Album-the upper right corner-Privacy Settings-Character Intelligent Group]. After the closure, your character classification information will be deleted and the character classification content cannot be viewed.", "label": ["Edit/Control", "Important"], "rewrite": "You can classify the character classification settings in the [Quark Network Disk-Album-Privacy Setting-Privacy Settings-Character Smart Group]."}
{"task": "rw_20.jsonl", "id": 44089, "text": "If you need to close the function of the corresponding picture according to the text information contained in the picture, you can turn off in the [Quark Network-File-File-Upper Right Menu-Privacy Settings-Extract Picture and Documents].", "label": ["Important", "Edit/Control"], "rewrite": "You can close the function of the corresponding picture of the text information included in the [Quark Network Disk-File-File-Privacy Settings-Extract Pictures, Documents] Close the text information retrieval in the picture."}
{"task": "rw_20.jsonl", "id": 44090, "text": "(3) In order to provide you with audio and video playback and document reading services, we need to grant the read and write permissions of the local files so that we can make local storage and offline reading and browsing of audio and video and reading content.", "label": ["Permission Acquisition", "Important"], "rewrite": "In order to provide you with audio and video playback and document reading service, we need you to grant the read and write permissions of the local files."}
{"task": "rw_20.jsonl", "id": 44091, "text": "You can obtain the read -write/storage permissions of your local files by canceling the system to authorize the quark network disk at any time, stop our collection of your information, and then you may be unable to use the file to play or read services or functions.", "label": ["Important", "Edit/Control"], "rewrite": "You can obtain the read and write permissions of your local files by cancel the system authorized quark network disk at any time."}
{"task": "rw_20.jsonl", "id": 44092, "text": "We will also collect the corresponding file names, audio and video playback, and document browsing records so that we can help you quickly locate your last time you play or browse.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the corresponding file name, audio and video playback and document browsing records in order to help you quickly locate your last play or browse position."}
{"task": "rw_20.jsonl", "id": 44093, "text": "2. Provide you with medical and health services", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44094, "text": "When you use medical and health services, you need to provide information such as gender, age, physical health, family history, so that AI intelligent tools (AI intelligent diagnosis, AI intelligent major illness screening, etc.) generate diagnostic suggestions or screening suggestions.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use medical and health services, you need to provide information such as gender, age, physical health, family medical history and other information."}
{"task": "rw_20.jsonl", "id": 44095, "text": "3. Provide you with scanning services", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44096, "text": "(1) When you use the scanning function, in order to read, manage, search and naming files, we need to call the camera and storage permissions of your device.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use the scanning function, in order to read, manage, search and naming files, we need to call the camera and storage permissions of your device."}
{"task": "rw_20.jsonl", "id": 44097, "text": "If you don't agree with us to call the above permissions, you may not be able to use our scanning service.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44098, "text": "When you choose to save the scanned file, your file will be sent to the cloud. We promise that your file content is transmitted and transmitted, and it will not be identified and other useless.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "When you choose to save the scan file, your file will be sent to the cloud and is encrypted."}
{"task": "rw_20.jsonl", "id": 44099, "text": "When you use the offline scanning function, the files you scan and save are only processed locally and will not be uploaded to the cloud.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "When you use the offline scanning function, the files you scan and save are only processed locally and will not be uploaded to the cloud."}
{"task": "rw_20.jsonl", "id": 44100, "text": "If you want to close this function, you can turn off at the [Quark Scan King-Scanning File Page Top-Traum-free Mode button].", "label": ["Important", "Edit/Control"], "rewrite": "Can be closed offline scanning on the [Quark Scan King-Scanning File Page Top-Traum-free Mode button]."}
{"task": "rw_20.jsonl", "id": 44101, "text": "(2) When you use the format conversion service, including the picture to PDF, Word, Excel, TXT, and PDF to Word, Excel, pictures and texts. We need to call the storage authority of your device.You will not be able to use format conversion services.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use the format conversion service, we need to call the storage authority of your device."}
{"task": "rw_20.jsonl", "id": 44102, "text": "When you choose to save the conversion file, your file will be sent to the cloud. We promise that your file content is transmitted and transmitted, which will not be identified and other useless uses.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "When you choose to save the conversion file, your file will be encrypted to the cloud."}
{"task": "rw_20.jsonl", "id": 44103, "text": "(3) When you use the document to remove the watermark and remove the handwriting function, in order to obtain the document you uploaded and save the document for you, we need to call your camera and storage authority.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use a document to remove the watermark and handwriting function, you need to call your camera, storage permissions to get your uploaded documents and save the document for you."}
{"task": "rw_20.jsonl", "id": 44104, "text": "If you don't agree with us to call this permissions, you will not be able to use the above services.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44105, "text": "When you use anti -theft and signature seal functions, in order to help you save the processing documents, we need to call your camera and storage authority.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use the anti-theft and signature stamp functions, you need to call your camera and storage permission to save the processed documents."}
{"task": "rw_20.jsonl", "id": 44106, "text": "If you agree with the above authorization, the anti -theft and signature seal services are only completed locally, and we will not collect and use your personal information.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "Anti -theft and signature seal services are only completed locally, and we will not collect and use your personal information."}
{"task": "rw_20.jsonl", "id": 44107, "text": "When you use the extraction text, extraction form, and taking pictures, we will use the OCR recognition function to help you realize OCR identification, document naming, content editing and translation.Your camera and storage permissions, if you do not agree that we call this permissions, you will not be able to use text extraction services.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use the extraction text, extraction form, and taking pictures, we all need to call your camera and storage permissions to use the OCR recognition function."}
{"task": "rw_20.jsonl", "id": 44108, "text": "(4) The landscaping of the license contains professional image photos, background color, photo repair, photo watermark, passers -by, and one -click smile service. When you use the above services, in order to obtain your photos and save the photos after processing, we need to need to be processed.Call your camera and storage permissions. If you do not agree that we call this permissions, you will not be able to use a license to beautify the service.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use a license to take a beautification service, we need to call your camera and storage permissions to get your photos and save the processed photos."}
{"task": "rw_20.jsonl", "id": 44109, "text": "(5) Consider scanning code contains all things recognition, scanning medicine, sweeping calories, and scanning QR codes. When using the above services, in order to identify your scanning content, we need to call your camera storage permissions. If you do not agree with us to callThis permissions, you will not be able to use the picture scanning service.", "label": ["Permission Acquisition", "Important"], "rewrite": "When using the scanning code service, we need to call your camera storage right to identify your scanning content."}
{"task": "rw_20.jsonl", "id": 44110, "text": "(6) If you are an Android system, when you use the printing document function, we will call the Bluetooth permissions of your device. In view of the need to apply for positioning permissions in the Android system, we will also call your equipment's positioning permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you are an Android system, when you use the print document function, we will call the Bluetooth permissions of your device, and may also call the positioning authority of the device."}
{"task": "rw_20.jsonl", "id": 44111, "text": "If you are an iOS system, we will call the Bluetooth permissions of your device to search and connect your printer device with the Bluetooth function of your device, and print the selected documents on the connected printer.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you are an iOS system, we will call the Bluetooth permissions of your device to search and connect your printer device with the Bluetooth function of your device."}
{"task": "rw_20.jsonl", "id": 44112, "text": "We get your above information to provide you with a printing document service. If you do not agree that we call the permissions, you will not be able to use a direct printing service.", "label": ["First Party Collection Information", "Permission Acquisition"], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44113, "text": "4. Provide you with a quark college entrance examination service", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44114, "text": "You can use the estimated achievements of Quark college entrance examination, simulation of volunteer, management volunteer tables and other functions. Based on your input, we will collect information such as your role, province, subjects, and results.Provide services related to intelligent voluntary reporting functions, which will not be used as other purposes without authorization.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the estimated scores of Quark college entrance examination, simulation of volunteer, management volunteer tables and other functions, we will collect information such as your role, province, subjects, and results."}
{"task": "rw_20.jsonl", "id": 44115, "text": "5. Baby Quark", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44116, "text": "When you use the quacker baby product for content interaction, we will collect the information content you posted in the interaction, conduct semantic identification and instruction judgment, and then interact smoothly with you.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the quacker baby product for content interaction, we will collect the information content you posted in the interaction."}
{"task": "rw_20.jsonl", "id": 44117, "text": "If you choose to interact in the form of voice input, we need to get your microphone right.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you choose to interact in the form of voice input, we need to get your microphone right."}
{"task": "rw_20.jsonl", "id": 44118, "text": "We will only adjust the permissions when you use the aforementioned function, and no longer continue to collect after the interaction is completed.", "label": ["Permission Acquisition", "Important"], "rewrite": "After the interaction is completed, the microphone is no longer obtained."}
{"task": "rw_20.jsonl", "id": 44119, "text": "(5) Provide you with content services", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44120, "text": "1. Quark documentation", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44121, "text": "When downloading the document and the Lieutenant Document of Quark Document to the local mobile phone, you need to retrieve your storage permissions so that the document can be saved to your mobile phone.", "label": ["Data Retention", "Permission Acquisition", "Important"], "rewrite": "When downloading the document to the local mobile phone, you need to retrieve your storage authority."}
{"task": "rw_20.jsonl", "id": 44122, "text": "2. Quark learning", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44123, "text": "When you use educational services, we may need you to collect the section information you are concerned to in order to provide you with corresponding sequential services.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use educational services, we may need to collect sequential information you are concerned about."}
{"task": "rw_20.jsonl", "id": 44124, "text": "When you use a connection to answer doubt services, we may need to call your microphone rights and storage permissions in order to provide you with a connection answer service.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use the connection to answer the question, we may need to call your microphone rights and storage permissions."}
{"task": "rw_20.jsonl", "id": 44125, "text": "3. Quark University Tong", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44126, "text": "You can fill in the college name, majors, and grade information in the Tong University of Quark. The above information is only used to provide you with more suitable content. Without your authorization, it will not be used as other purposes.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can fill in the college name, majors, and grade information in the Tong University of Quark."}
{"task": "rw_20.jsonl", "id": 44127, "text": "(6) Help you complete the payment", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44128, "text": "To fulfill our transaction order with your transaction, we need you to provide Alipay/WeChat accounts, or choose other payment methods to complete the order payment.", "label": ["Important", "First Party Collection Information"], "rewrite": "To fulfill our transaction order with your transaction, we need you to provide Alipay/WeChat accounts, or choose other payment methods to complete the order payment."}
{"task": "rw_20.jsonl", "id": 44129, "text": "If you choose Alipay and WeChat for payment, we will put your quark account, the corresponding Alipay/WeChat account member name, order payment related information, order security related equipment information, and other necessary information required by other anti -money laundering laws.The embedded Alipay software tool development package (SDK) and other methods are shared with Alipay/WeChat.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you choose Alipay and WeChat for payment, we will share your quark account, Alipay/WeChat account member name, order payment related information, order security related equipment information, etc. to share with Alipay/WeChat."}
{"task": "rw_20.jsonl", "id": 44130, "text": "If you choose to provide you with a payment service by other financial institutions, we will also share your bank card payment, which is valid for the bank card, and share the necessary information of bank card payment with the corresponding financial institutions you choose.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you choose to provide you with a payment service with other financial institutions, sharing your bank card payment, which is valid, and the validity period, and share it with the corresponding financial institutions you choose."}
{"task": "rw_20.jsonl", "id": 44131, "text": "In order to allow us to learn and confirm your payment progress and status in a timely manner, and to provide you with after -sales and dispute solutions, we may collect and pay the progress of the transaction objects, Alipay/WeChat company or other financial institutions you chooseRelated Information.", "label": ["Important", "First Party Collection Information"], "rewrite": "To allow us to learn and confirm your payment progress and status in time, we may collect and pay the progress related information from the financial institutions you choose."}
{"task": "rw_20.jsonl", "id": 44132, "text": "(7) Customer service and dispute handling", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44133, "text": "When you contact us or propose the application for sale, after -sales, and dispute dispute handling, in order to ensure your account and system security, we need you to provide the necessary personal information to verify your membership status.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you contact us or propose the application for sale, after -sales, and dispute dispute handling, we need you to provide the necessary personal information to verify your membership status."}
{"task": "rw_20.jsonl", "id": 44134, "text": "In order to facilitate the treatment schemes and results that help you solve the problem or record related issues as soon as possible, we may save your communication, communication/call records and related content (including account information, addresses, mailboxes, other contact informationAnd to prove other information provided by related facts).", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may save your communication, communication/call records and related content in order to communicate with you, solve problems, etc."}
{"task": "rw_20.jsonl", "id": 44135, "text": "If you consult, complain or provide suggestions for specific orders, we need you to provide your account information and order information.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you consult, complain or provide suggestions for specific orders, we need you to provide your account information and order information."}
{"task": "rw_20.jsonl", "id": 44136, "text": "In order to provide customer service services and improve customer service quality, other information we may also use, including the relevant information you provided when you contact the customer service, and the questionnaire reply information sent us when you participate in the questionnaire survey.", "label": ["Important", "Usage"], "rewrite": "We may also use the relevant information you provided when you contact the customer service, the questionnaire answering information you sent to us during the questionnaire survey, etc. to provide customer service services."}
{"task": "rw_20.jsonl", "id": 44137, "text": "(8) Provide you with security guarantee", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44138, "text": "In order to fulfill the security of transactions and other legal obligations, improve your use of Quark's security, protect the safety of personal property of you or other users or the public, and better prevent fishing websites, fraud, network vulnerabilities, computer viruses, and cyber attacksThe risk of network invasion and more accurately identify the cases that violate laws and regulations or [Quark] related agreements and rules.Or integrate your membership information, transaction information, equipment information, service log information, and information that our affiliated companies and partners obtain your authorization or sharing according to law (Among them, we may collect MAC addresses, IMEI, software, software, software, software, and software during the application background operation period.Use the records and other equipment identification to perform risk verification) to comprehensively judge your account and transaction risk, conduct authentication, test and prevent security incidents, and take necessary records, audit, analysis, and disposal measures in accordance with the law.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Data Security"], "rewrite": "We embed the application security SDK developed by related companies to collect your equipment information, service log information, and may use or integrate your member information, transaction information, equipment information, etc. to ensure the security of transaction security, judge account risk, etc., and take the necessaryRecording, auditing, analysis, and disposal measures."}
{"task": "rw_20.jsonl", "id": 44139, "text": "(9) Other additional services provided for you", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44140, "text": "1. Additional services based on system permissions", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44141, "text": "To provide you with more convenient, better, personalized products and/or services, and strive to improve your experience, we may collect and use your personal information by opening system permissions in the following additional services.", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44142, "text": "If you do not agree to start the relevant permissions, it will not affect your basic services to use [Quark], but you may not be able to get the user experience brought by these additional services to you.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44143, "text": "You can check the state of the above permissions in your device \"My-Settings-Privacy Settings-Personal Information Collection Management\" in your device, and you can determine that these permissions will be turned on or closed at any time.", "label": ["Important", "Edit/Control"], "rewrite": "You can view the state of permissions in your device \"Mine-Settings-Privacy Settings-Personal Information Collection Management\", and you can determine that these permissions are turned on or closed at any time.Essence"}
{"task": "rw_20.jsonl", "id": 44144, "text": "Please note that when you start the right of power, it means that you authorize us to collect and use relevant personal information to provide you with corresponding services. Once you turn off the right of power, it means that you cancel the authorization.With relevant personal information, you cannot continue to provide you with the service corresponding to the permissions.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "The opening of one authority means that the authorization is authorized to collect and use the relevant information to provide corresponding services. Close the authority to cancel the authorization representative, and no longer continue to collect and use relevant information based on the corresponding permissions."}
{"task": "rw_20.jsonl", "id": 44145, "text": "The decision of your closure authority will not affect the collection and use of information based on your authorization.", "label": ["Permission Acquisition", "Edit/Control", "Important"], "rewrite": "The decision of your closure authority will not affect the collection and use of information based on your authorization."}
{"task": "rw_20.jsonl", "id": 44146, "text": "You can click here to view the application authority application and usage description.", "label": ["Important", "Edit/Control"], "rewrite": "You can click here to view the application authority application and usage description."}
{"task": "rw_20.jsonl", "id": 44147, "text": "2. Cookie and services of similar technologies", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44148, "text": "Cookie and similar device information identification technology are commonly used in the Internet.", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44149, "text": "When you use our service, we may use related technologies to send one or more, cookie, or anonymous identifiers (hereinafter referred to as \"Cookie\") to collect, identify and store your access, use this product, use this productInformation about time.", "label": ["Important", "First Party Collection Information"], "rewrite": "Use cookie or anonymous identifiers to collect, identify, and store your information when you access and use the product."}
{"task": "rw_20.jsonl", "id": 44150, "text": "We promise that cookies will not be used for any other purposes other than the purpose of this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44151, "text": "We use Cookie to ensure the safety and efficient operation of products and services. It can make us confirm the security status of your account and transaction, check the related abnormal conditions of collapse and delay, and help you save the steps of filling in your form and entering search content.And process.", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44152, "text": "At the same time, we may use, cookie, show you the information or function you may be interested in, and optimize your choice of advertising.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Use Cookie to show you the information or functions you may be interested in and optimize your choice of advertising."}
{"task": "rw_20.jsonl", "id": 44153, "text": "Most browsers provide users with the function of removing the browser cache data. You can perform the corresponding data clearing operation, or you can modify the degree of acceptance of cookies or reject our cookies.", "label": ["Edit/Control", "Important"], "rewrite": "You can perform the corresponding data clearing operation, or you can modify the degree of acceptance of Cookie or reject our cookies."}
{"task": "rw_20.jsonl", "id": 44154, "text": "You may not be able to use services or corresponding functions that depend on cookies because of these modifications.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44155, "text": "3. Provide information to the outside world", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44156, "text": "(1) Sharing", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44157, "text": "We will not share your personal information with companies, organizations and individuals other than service providers, except the following situations:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not share your personal information with companies, organizations and individuals other than service providers, except the following situations:"}
{"task": "rw_20.jsonl", "id": 44158, "text": "1. Perform the sharing necessary for the legal obligations: we may share your personal information in accordance with the requirements of laws and regulations, litigation, and disputes in accordance with the requirements of administrative and judicial organs in accordance with the requirements of administrative and judicial organs in accordance with the law, and other legal obligations.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share your personal information in accordance with the requirements of laws and regulations, litigation, and disputes, or in accordance with the requirements put forward by administrative and judicial organs in accordance with the law, as well as other legal obligations."}
{"task": "rw_20.jsonl", "id": 44159, "text": "2. Sharing your consent: After getting your clear consent, we will share your personal information with other parties.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After getting your clear consent, we will share your personal information with other parties."}
{"task": "rw_20.jsonl", "id": 44160, "text": "3. The shared sharing in order to establish and fulfill your contract as a party as a party: If you buy goods or services through quarks, we will share the necessary information related to the transaction information in your order information according to your choice.Commodities or services providers to realize your needs of transactions, distribution and after -sales service.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "You can buy goods or services through quarks, and we will share the necessary information in your order information to the providers of related products or services according to your choice."}
{"task": "rw_20.jsonl", "id": 44161, "text": "4. Shared with affiliated companies: In order to facilitate us to provide some services with you, we provide you with products and services based on the Quark platform account. It is recommended that you may be interested in information, identify the abnormal membership account, protect the quark affiliated company orThe safety of personal property of other users or the public is exempted from violations, and your personal information may be shared with our affiliated companies and/or its designated service providers.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Your personal information may be shared with our affiliated companies and/or its designated service providers to provide services together."}
{"task": "rw_20.jsonl", "id": 44162, "text": "We will only share the necessary personal information and be restricted by the purpose declared in this policy. If we share your sensitive personal information or the purpose of changing personal information to change personal information, we will solicit your authorization consent again.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will only share the necessary personal information and be constrained by this policy, such as sharing your sensitive personal information or related companies to change the purpose of use and processing, and will solicit your authorization consent again."}
{"task": "rw_20.jsonl", "id": 44163, "text": "Please note that when you use our service, you voluntarily share or even publicly share information, which may involve your or other people's personal information and even sensitive personal information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "The information you voluntarily shared or even publicly shared may involve personal information of you or others and even sensitive personal information."}
{"task": "rw_20.jsonl", "id": 44164, "text": "Please consider and make a decision more cautiously.", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44165, "text": "(2) Entrusted processing", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44166, "text": "We may entrust a partner to handle your personal information in order to authorize partners to represent you to provide you with certain services or fulfilling functions.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may entrust a partner to handle your personal information in order to provide you with certain services or fulfilling functions."}
{"task": "rw_20.jsonl", "id": 44167, "text": "We will only entrust their information for the legal, correct, necessary, specific, and clear goals of this policy statement. We can authorize partners to only contact the information required by their duties, and we will ask for the agreement to request that it must not be requiredThis information is used for any other purpose beyond the scope of commission.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Authorized partners can only expose the information required for their duties, and must not use this information for any other purpose that exceeds the scope of entrustment."}
{"task": "rw_20.jsonl", "id": 44168, "text": "If the authorized partner will use your information for our unreasonable purpose, it will obtain your consent alone.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If the authorized partner will use your information for our unreasonable purpose, it will obtain your consent alone."}
{"task": "rw_20.jsonl", "id": 44169, "text": "At present, our authorized partners include the following types:", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44170, "text": "1. Authorized partners of advertising and analysis of service.", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44171, "text": "Under the premise of using industry -universal security technology, we will entrust these partners to handle information about advertising, coverage, and effectiveness related to advertising.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Entrust partners to process information related to advertising, coverage, and effectiveness related to advertising."}
{"task": "rw_20.jsonl", "id": 44172, "text": "We will not commission your personal identity information to commission partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not commission your personal identity information to commission partners."}
{"task": "rw_20.jsonl", "id": 44173, "text": "2. Suppliers, service providers and other partners.", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44174, "text": "We entrust the information to the suppliers, service providers and other partners who support our business to handle it. These support for the technical infrastructure services that we are entrusted to provide, analyze the usage methods of our services, provide customer service, pay conveniently, or perform academic academic academicsResearch and investigation.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We entrust the information to the suppliers, service providers and other partners who support our business."}
{"task": "rw_20.jsonl", "id": 44175, "text": "In order to ensure the stable operation and functional implementation of our client, so that you can use and enjoy more services and functions. Our application will embed the SDK or other similar applications of authorized partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Our applications will embed the SDK or other similar applications of authorized partners to ensure the stable operation of the client."}
{"task": "rw_20.jsonl", "id": 44176, "text": "We will strictly test the application interface (API) and software tool development package (SDK) of the authorized partners to obtain relevant information, and strict data protection measures with the authorized partners, so that it will be in accordance with this policy and any other any otherRelated confidentiality and security measures to handle personal information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will conduct strict security testing on the API and SDKs of authorized partners and agreed to data protection measures."}
{"task": "rw_20.jsonl", "id": 44177, "text": "You can click here to view the details we access.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You can click here to view the details we access."}
{"task": "rw_20.jsonl", "id": 44178, "text": "(3) Transfer", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44179, "text": "If we need to transfer personal information for the reasons for merging, separation, dissolution, and declaration of bankruptcy, we will inform you the name or name and contact information of the receiver.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If we need to transfer personal information for the reasons for merging, separation, dissolution, and declaration of bankruptcy, we will inform you the name or name and contact information of the receiver."}
{"task": "rw_20.jsonl", "id": 44180, "text": "The receiver will continue to fulfill this policy and other legal obligations.", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44181, "text": "If the receiver changes the original treatment purpose and method of processing, you will re -obtain your consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If the receiver changes the original treatment purpose and method of processing, you will re -obtain your consent."}
{"task": "rw_20.jsonl", "id": 44182, "text": "(4) Public disclosure", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44183, "text": "We will only publicly disclose your personal information in the following circumstances:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only publicly disclose your personal information in the following circumstances:"}
{"task": "rw_20.jsonl", "id": 44184, "text": "1. Based on your active choice and other individual consent, we may publicly disclose your personal information;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Based on your active choice and other individual consent, we may publicly disclose your personal information."}
{"task": "rw_20.jsonl", "id": 44185, "text": "2. If we determine that you have violated laws and regulations or seriously violated the relevant agreements and rules of the quark platform, or to protect the security of the personal property of the quark platform users or the public, we may disclose your personal information, including related violations of regulations, including related regulationsThe behavior and the measures that the quark platform has taken you.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you violate legal head hoop or seriously violate platform rules, or avoid violations of personal property to protect users or the public, we may disclose your personal information."}
{"task": "rw_20.jsonl", "id": 44186, "text": "Fourth, your rights", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44187, "text": "You can check and manage your information through the following ways, and we will respond to your request in the case of compliance with laws and regulations:", "label": ["Important", "Edit/Control"], "rewrite": "You can check and manage your information through the following ways, and we will respond to your request in the case of compliance with laws and regulations:"}
{"task": "rw_20.jsonl", "id": 44188, "text": "(1) Review, correct and supplement", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44189, "text": "You have the right to check, correct and supplement your information through the following ways:", "label": ["Important", "Edit/Control"], "rewrite": "You have the right to check, correct and supplement your information through the following ways."}
{"task": "rw_20.jsonl", "id": 44190, "text": "1. Log in to Quick, click \"My\", click the avatar in the upper left corner to enter \"account and security\";", "label": ["Important", "Edit/Control"], "rewrite": "Log in to Quick, click \"My\", click on the upper left corner to enter \"account and security\"."}
{"task": "rw_20.jsonl", "id": 44191, "text": "2. Log in to quark, select \"My - Settings -Customer Service Consultation\";", "label": ["Important", "Edit/Control"], "rewrite": "Log in to Quick, select \"My - Settings -Customer Service Consultation\"."}
{"task": "rw_20.jsonl", "id": 44192, "text": "(2) Copy right", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44193, "text": "You have the right to obtain your personal information copy.", "label": ["Edit/Control", "Important"], "rewrite": "You have the right to obtain your personal information copy."}
{"task": "rw_20.jsonl", "id": 44194, "text": "If you need to get the copy of your personal information we collected, you can contact us with our customer service center or contact us through the contact information stated by Article 8.", "label": ["Edit/Control", "Important"], "rewrite": "You can contact us to get the copy of your personal information we collected."}
{"task": "rw_20.jsonl", "id": 44195, "text": "Under the premise of meeting relevant laws and feasibility, we will provide you with a copy of your personal information.", "label": ["Edit/Control", "Important"], "rewrite": "Under the premise of meeting relevant laws and feasibility, we will provide you with a copy of your personal information."}
{"task": "rw_20.jsonl", "id": 44196, "text": "(3) Delete", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44197, "text": "You can delete your information through the path of \"(1), correct, and supplement your information\" column, or apply for a cancellation account to delete all your information.", "label": ["Important", "Edit/Control"], "rewrite": "You can delete your information through the path of \"(1), correct, and supplement your information\" column, or apply for a cancellation account to delete all your information."}
{"task": "rw_20.jsonl", "id": 44198, "text": "In the following circumstances, you can make a request to delete personal information through [customer service]:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44199, "text": "1. If our behavior of handling personal information violates laws and regulations;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44200, "text": "2. If we collect and use your personal information, it has not obtained your clear consent;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44201, "text": "3. If our behavior of handling personal information seriously violates your agreement;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44202, "text": "4. If our treatment purpose has been achieved, cannot be achieved or is not necessary for the purpose of the treatment;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44203, "text": "5. If we stop providing products or services, or the storage period has expired.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44204, "text": "If we decide to respond to your deletion request, we will also notify the subject of your personal information from our personal information as much as possible at the same time, and ask them to delete it in time (unless laws and regulations have other regulations, or these subjects have independently obtained your authorization)Essence", "label": ["Edit/Control", "Data Security", "Important"], "rewrite": "If we respond to your deletion request, we will also notify the subject of your personal information from our personal information at the same time, unless the laws and regulations have other provisions, or obtain your authorization."}
{"task": "rw_20.jsonl", "id": 44205, "text": "When you or we assisted you to delete the relevant information, because of the applicable legal and security technical restrictions, we may not be able to immediately delete the corresponding information from the backup system.Treatment until the backup can be removed or achieved anonymous.", "label": ["Data Retention", "Data Security", "Important", "Risk"], "rewrite": "If you cannot delete the backup system, store your information securely and restrict it further until the backup can be removed or achieved anonymous."}
{"task": "rw_20.jsonl", "id": 44206, "text": "(4) Change the scope of authorization", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44207, "text": "You can change or withdraw the scope of your personal information through the following ways to authorize us to collect and process your personal information: you can authorize the binding relationship through \"my-account and security\".", "label": ["Edit/Control", "Important"], "rewrite": "You can authorize the binding relationship through \"My-Account and Security\"."}
{"task": "rw_20.jsonl", "id": 44208, "text": "Your leaves can authorize the authorization of equipment permissions in your device \"My-Settings-Privacy Settings-Personal Information Collection Management\".", "label": ["Important", "Edit/Control"], "rewrite": "You can manage the authorization of equipment permissions in your device \"My-Settings-Privacy Settings-Personal Information Collection Management\"."}
{"task": "rw_20.jsonl", "id": 44209, "text": "For the authorization that you cannot directly set through the above method, you can modify it through customer service contact, but please note that for some types of personal information, such as the information necessary for the basic functions of Quark or the necessaryInformation, we may not be able to respond to your request to change the scope of authorization.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "You can modify the authorization through customer service contact, but you may not be able to change the information required for basic functions or the information we must fulfill the obligations."}
{"task": "rw_20.jsonl", "id": 44210, "text": "When you withdraw authorization, we will no longer process the corresponding personal information.", "label": ["Important", "Edit/Control"], "rewrite": "When you withdraw authorization, we will no longer process the corresponding personal information."}
{"task": "rw_20.jsonl", "id": 44211, "text": "But your decision to withdraw authorization will not affect our personal information processing based on your previous authorization.", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "Your decision to withdraw authorization will not affect personal information processing based on your authorization."}
{"task": "rw_20.jsonl", "id": 44212, "text": "(5) Logging out the account", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44213, "text": "You can apply for a cancellation of your account in the following ways:", "label": ["Edit/Control", "Important"], "rewrite": "You can apply for a cancellation of your account in the following ways:"}
{"task": "rw_20.jsonl", "id": 44214, "text": "1. You can also log in to Quark and enter \"My-Click on the upper left corner-enter the account and security-account cancellation\".", "label": ["Important", "Edit/Control"], "rewrite": "You can also log in to Quark and enter the entrance to \"My-click on the upper left corner-enter the account and security-account cancellation\"."}
{"task": "rw_20.jsonl", "id": 44215, "text": "2. Log in to quark, select \"My - Settings -Customer Service Consultation\" consultation account for cancellation;", "label": ["Important", "Edit/Control"], "rewrite": "Log in to Quick, select \"My — Settings -Customer Service Consultation\" consultation account for cancellation."}
{"task": "rw_20.jsonl", "id": 44216, "text": "After you take the initiative to cancel your account, we will stop providing you with products or services and delete or process your personal information according to the requirements of applicable laws.", "label": ["Important", "Edit/Control"], "rewrite": "After the account is canceled, it will stop providing you with products or services and delete or anonymous your personal information."}
{"task": "rw_20.jsonl", "id": 44217, "text": "(6) Automatic decision -making of constraint information system", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44218, "text": "In certain business functions, we may make decisions only based on the non -artificial automatic decision mechanism, including the algorithm.", "label": ["Important", "Usage"], "rewrite": "In certain business functions, we may make decisions only based on the non -artificial automatic decision mechanism, including the algorithm."}
{"task": "rw_20.jsonl", "id": 44219, "text": "If these decisions affect your legitimate rights and interests, you can contact us through customer service.", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44220, "text": "(7) Responsive your above request", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44221, "text": "For your or your guardians, close relatives, and other authority to make the above requests to us, and your relevant personal information rights stipulated in the laws of the People's Republic of China and other applicable laws, you can contact us through customer service or directly to us to usPersonal information protection full -time departments initiated complaints.", "label": ["Edit/Control", "Important"], "rewrite": "You or your guardian, close relatives, etc. have the right to make a request for personal information rights, and you can contact us."}
{"task": "rw_20.jsonl", "id": 44222, "text": "We will make a reply within 15 days.", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44223, "text": "To ensure your account security and your personal information security, when you make a request to us, we may verify your identity (such as adding account verification, requesting you to provide written requests or other reasonable ways), and then process youRequest.", "label": ["Important", "Edit/Control"], "rewrite": "We may verify your identity first, and then process your request."}
{"task": "rw_20.jsonl", "id": 44224, "text": "For your reasonable request, we do not charge fees in principle, but we will charge a certain fee as appropriate for multiple and more reasonable requests.", "label": ["Important", "Edit/Control"], "rewrite": "Reasonable requests are not charged in principle without charging and exceeding the reasonable limit."}
{"task": "rw_20.jsonl", "id": 44225, "text": "For information that is not directly associated with your identity, the information that is repeatedly applied without reasonable reasons, or you need too many technical means (if you need to develop a new system or change the current convention fundamentally), bring risks to others' legitimate rights or notIn actual requests, we may refuse.", "label": ["Important", "Edit/Control"], "rewrite": "We may refuse to repeat for unseen, need too much technical means, bring risks or very unrealistic requests to others' legitimate rights and interests."}
{"task": "rw_20.jsonl", "id": 44226, "text": "5. Storage of information", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44227, "text": "(1) Storage period", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44228, "text": "We will only retain your personal information within the time limit required for the cost of reaching the cost policy, unless the law has compulsory retention requirements, for exampleIt is no less than three years from the date of completion.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "Generally, your personal information is retained within the time limit required to achieve service purposes, unless the law has other requirements."}
{"task": "rw_20.jsonl", "id": 44229, "text": "We judge the storage period of personal information mainly based on the following standards:", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44230, "text": "1. Complete your related transaction purpose, maintain the corresponding transactions and business records to cope with your possible inquiries or complaints;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44231, "text": "2. Ensure that we provide you with service safety and quality;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44232, "text": "3. Do you agree to a longer retention period;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44233, "text": "4. In accordance with the requirements of the effective regulations of the applicable lawsuit or the legal prosecution and defense needs of the company's business;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44234, "text": "5. There are other special agreement or laws and regulations on the retention period.", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44235, "text": "After exceeding the reservation period, we will delete or deal with your personal information according to the requirements of the applicable law.", "label": ["Data Retention", "Important"], "rewrite": "Your personal information will be deleted or processed anonymously after the retention period."}
{"task": "rw_20.jsonl", "id": 44236, "text": "(2) Storage location", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44237, "text": "The personal information we collected and generated in the operation of the People's Republic of China will be stored in China.", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in domestic operations will be stored in China."}
{"task": "rw_20.jsonl", "id": 44238, "text": "In the following circumstances, we will provide your personal information to possible overseas entities after fulfilling the obligations stipulated in the law:", "label": ["Data Retention", "Important", "Risk"], "rewrite": "In the following circumstances, our possible overseas entities provide your personal information: 1. The applicable laws are clearly stipulated; 2. Get your separate consent; 3. Cross -border e -commerce transactions as one party and other types of contractsPerforming the necessary."}
{"task": "rw_20.jsonl", "id": 44239, "text": "1. Applicable laws have clear regulations;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44240, "text": "2. Get your individual consent;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44241, "text": "3. As a cross -border e -commerce transaction and other types of contracts for one party, you are necessary for the establishment and other types of contracts.", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44242, "text": "In response to the above situations, we will protect your personal information security in accordance with this policy.", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44243, "text": "(3) Storage safety", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44244, "text": "1. Data protection technical measures", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44245, "text": "We have adopted our information that meets industry standards, reasonable and feasible security measures to protect your information, and prevent personal information from being disclosed, used, modified, damaged or lost by unauthorized access, publicly disclosed, used, modified, damaged, or lost.", "label": ["Important", "Data Security"], "rewrite": "Take security measures to protect your information to prevent personal information from being unauthorized, disclosed, use, modified, damaged or lost."}
{"task": "rw_20.jsonl", "id": 44246, "text": "For example, we will use encrypted technology to improve the security of personal information. When you exchange data between your browser and the server, the SSL protocol is encrypted and protected, and we provide the HTTPS protocol security browsing method;", "label": ["Important", "Data Security"], "rewrite": "Use encryption technology to improve the security of personal information, and is protected by SSL protocol when you exchange data."}
{"task": "rw_20.jsonl", "id": 44247, "text": "We will use a trusted protection mechanism to prevent personal information from being maliciously attacked;", "label": ["Important", "Data Security"], "rewrite": "We will use a trusted protection mechanism to prevent personal information from being maliciously attacked."}
{"task": "rw_20.jsonl", "id": 44248, "text": "We will deploy the access control mechanism to make every effort to ensure that only authorized personnel can access personal information.", "label": ["Important", "Data Security"], "rewrite": "We will deploy the access control mechanism and try our best to ensure that only authorized personnel can access."}
{"task": "rw_20.jsonl", "id": 44249, "text": "At present, our important information systems have been evaluated through the third level of network security level protection.", "label": ["Important", "Data Security"], "rewrite": "Important information systems have been evaluated through three or above through network security levels."}
{"task": "rw_20.jsonl", "id": 44250, "text": "2. Measures for data protection management organization", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44251, "text": "We have established a data security management system that is advanced in the industry with data as the core and the data security management system around the data life cycle, and improves the security of personal information from organizational construction, institutional design, personnel management and product technology.", "label": ["Important", "Data Security"], "rewrite": "Establish a data security management system to improve the security of personal information from organizational construction, system design, personnel management and product technology."}
{"task": "rw_20.jsonl", "id": 44252, "text": "We have set up a full -time department for personal information protection and designated the protection of personal information for children.", "label": ["Important", "Data Security"], "rewrite": "The full -time department of personal information protection is set up, and a special person is responsible for the protection of personal information of children."}
{"task": "rw_20.jsonl", "id": 44253, "text": "Through training courses and examinations, we have continuously strengthened employees' awareness of protecting the importance of personal information.", "label": ["Important", "Data Security"], "rewrite": "Through training courses and examinations, employees have continuously strengthened employees' awareness of protecting the importance of personal information."}
{"task": "rw_20.jsonl", "id": 44254, "text": "3. Response of personal information security incident", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44255, "text": "If our physical, technical, or management protection facilities are damaged, and the information is caused by unauthorized access, public disclosure, tampering or destruction, and damage to your legitimate rights and interests, we will launch an emergency plan in time and take reasonable and necessary measures.In order to reduce the impact on your personal.", "label": ["Important", "Data Security"], "rewrite": "If our physical, technical, or management protection facilities are damaged and information leaks cause your legitimate rights and interests to be damaged, we will launch an emergency plan in time."}
{"task": "rw_20.jsonl", "id": 44256, "text": "If a personal information security incident occurs, we will also inform you the basic situation and possible impact of the security incident in accordance with the requirements of the laws and regulations.Remedy.", "label": ["Important", "Data Security"], "rewrite": "If a personal information security incident occurs, we will inform your basic situation, possible impact, disposal measures, independent prevention suggestions, etc."}
{"task": "rw_20.jsonl", "id": 44257, "text": "We will inform you in SMS, telephone, push notification, and other reasonable channels that it is difficult to inform one by one. We will publish an announcement in a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "The relevant situation of security incidents will be informed by mail, letter, telephone, push notification, etc. When it is difficult to inform one by one, it will issue an announcement."}
{"task": "rw_20.jsonl", "id": 44258, "text": "At the same time, we will also report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "Report the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities."}
{"task": "rw_20.jsonl", "id": 44259, "text": "4. Prevention of account security risk", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44260, "text": "When using the quark service for online transactions, you inevitably disclose your personal information to the other party or the potential transaction of the transaction, such as contact or contact address.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When using the quark service for online transactions, you need to disclose personal information to the transaction party."}
{"task": "rw_20.jsonl", "id": 44261, "text": "In addition, you can also establish communication, exchange information or analysis content with our services.", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44262, "text": "Please protect your personal information properly, provides others only under the necessary circumstances, and do not trust the transaction through other trading tools to avoid the stolen information or even encounter telecommunications network fraud.", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44263, "text": "If you are worried about your personal information, especially your account or password, please contact our customer service immediately so that we can take corresponding measures based on your application.", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44264, "text": "6. Policy update", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44265, "text": "In order to bring you a better product and service experience, we continue to strive to improve our products, services and technology.", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44266, "text": "When the new service and business processes change, we may update our privacy policy to inform you of specific changes.", "label": ["Policy Change", "Important"], "rewrite": "We may update our privacy policy to inform you of specific changes."}
{"task": "rw_20.jsonl", "id": 44267, "text": "But without your clear consent, we will not limit your rights you enjoy in accordance with this policy.", "label": ["Policy Change", "Important"], "rewrite": "Without your clear consent, we will not limit your rights you enjoy in accordance with this policy."}
{"task": "rw_20.jsonl", "id": 44268, "text": "For major changes, we will also provide more significant notifications (including we will notify or provide you with pop -up window prompts through the method of publicity by the quark website).", "label": ["Policy Change", "Important"], "rewrite": "For major changes, we will also provide a more significant notice."}
{"task": "rw_20.jsonl", "id": 44269, "text": "The major changes in this policy include, but not limited to:", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44270, "text": "1. The business model of the product has changed significantly.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44271, "text": "Such as the purpose of handling personal information, the type of personal information, and the use of personal information;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44272, "text": "2. The main body of the privacy policy caused by business adjustment and transaction mergers and acquisitions, and the new subject receiving party changes the original processing purpose and method of treatment;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44273, "text": "3. The main object of personal information sharing or public disclosure changes;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44274, "text": "4. User personal information rights and their exercise methods have changed significantly;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44275, "text": "5. When dealing with the person in charge of the person in charge of the personal information protection and the change of complaint channels;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44276, "text": "6. Personal information protection assessment report shows that the existence of products has a significant impact on personal rights.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44277, "text": "7. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44278, "text": "Quark can be used without account registration and login, and generally cannot recognize your specific age.", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44279, "text": "If you are a minor, we ask you to ask your parents or other guardians to read this policy carefully, and use our services or provide information to us under the consent of your parents or other guardians.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a minor, use our services or provide information to us under the premise of obtaining the consent of the guardian."}
{"task": "rw_20.jsonl", "id": 44280, "text": "If you are under the age of 14, before you use our service, you and your guardian should carefully read the \"Quick Children's Personal Information Protection Rules and Guardian Notice\" that we specially formulated to ensure that the guardian is obtained.After the information protection rules and the guardian's notice \", you can use our services under the guidance of the guardian to ensure that you use our services and the security of transactions.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a child under the age of 14, please use the policy to carefully read the policy and the Qualites' personal information protection rules and the guardian instructions \"and agree to use services under the guidance of the guardian."}
{"task": "rw_20.jsonl", "id": 44281, "text": "If you are a child's parents or other guardians, please pay attention to whether the child uses our service after obtaining your authorization consent.", "label": ["Specific Audiences", "Important"], "rewrite": "Please pay attention to whether the child will use our service after obtaining your authorization consent."}
{"task": "rw_20.jsonl", "id": 44282, "text": "If you have any questions about your child's personal information, please contact our personal information protection department. You can also give feedback through the entrance of \"Settings-Privacy Settings-Minor Feedback\".", "label": ["Specific Audiences", "Important"], "rewrite": "Feedback can be performed through the entrance of \"Mine-Settings-Privacy Settings-Feedback of Minor\"."}
{"task": "rw_20.jsonl", "id": 44283, "text": "Eight, contact us", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44284, "text": "You can contact us in the following ways. We will reply to your request within 15 days:", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44285, "text": "1. If you have any questions, opinions or suggestions on the content of this policy, you can contact us through Quark's online customer service;", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44286, "text": "2. We have also set up a full -time department for personal information protection. You can connect privacy_zx@service.alibaba.com (please indicate that it is related to Quark and explain the specific facts).Fourth District 4 Building Ali B Blocks Ball Little Post Office Legal Affairs Department.", "label": ["Important", "Contact Information"], "rewrite": "Personal information protection full -time department mailbox: privacy_zx@service.alibaba.com; Office address: Ali B small post office of Block 4, Building 4, Floor Building 4, Wangjingyuan District, Chaoyang District, Beijing."}
{"task": "rw_20.jsonl", "id": 44287, "text": "It should be noted that we may not reply to the issue that has nothing to do with the right to this policy or your personal information.", "label": ["Important"], "rewrite": "We may not reply to the issue that has nothing to do with this policy or your personal information rights."}
{"task": "rw_20.jsonl", "id": 44288, "text": "If you are not satisfied with our reply, especially if you think our personal information processing behavior has harm your legitimate rights and interests, you can also seek solutions by filed a lawsuit to a court with jurisdiction in the place of residence in the defendant.", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44289, "text": "Appendix: Related Definition", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44290, "text": "Quick: Refers to the website of Quick (domain name is quark.cn) and Quickbao client.", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44291, "text": "Quark service provider: refers to Quick's Internet information and software technology service providers Guangzhou Morality Computer Technology Co., Ltd..", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44292, "text": "Related company: Refers to the related companies of the quark platform service provider disclosed by Alibaba Group Holding Limited (Alibaba Group Holding Limited).", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44293, "text": "Alipay: Refers to the main Alipay (China) Network Technology Co., Ltd. providing Alipay services.", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44294, "text": "Personal information: Various information related to recognized or recognized natural persons recorded in electronics or other ways, excluding information after anonymous processing.", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44295, "text": "Sensitive personal information: Once sensitive personal information is leaked or illegally, it is easy to lead to personal information that is harmful to natural person's personality dignity or personality and property security.Track information, and personal information of minors under the age of 14.", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44296, "text": "Child: Refers to minors under the age of 14.", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44297, "text": "Equipment information: Including device identifiers (IMEI, IDFA, Android ID, Mac, OAID, IMSI and other device -related information), application information (application crash information, notification switch status, application installation list, and other application related information), equipment parameters), equipment parametersAnd system information (device type, device model, operating system and hardware -related information), device network environment information (IP address, WIFI information, base station information and other network -related information).", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44298, "text": "The actual collection of the product shall prevail.", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44299, "text": "Service log information: When you use the products or services we provide, we will automatically collect and record your detailed usage situation, as a service log, including browsing records, click to view records, search query records, collectors records, purchase services, purchase services, purchase services, and purchase services.Trading and after -sales, follow, comment and share information, publish information, collapse logs, performance logs, and IP addresses, browser types, telecommunications operators, use language, access date and time.", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44300, "text": "Decoration: Refers to the process of personal information processing, so that it cannot recognize specific natural persons without using additional information.", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44301, "text": "Anonymous: Refers to the process that personal information cannot identify specific natural persons and cannot recover.", "label": [], "rewrite": []}
{"task": "rw_20.jsonl", "id": 44302, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
