{"task": "rw_23.jsonl", "id": 45377, "text": "Beijing Kuaishou Technology Co., Ltd. (hereinafter referred to as \"We\") is an operator of the Kuaiying APP. Quick Shadow respects and pays attention to the protection of the personal privacy of users. In order to use our products and/or services in order to fully use our products and/or services.In accordance with the provisions of this privacy protection policy and disclose your personal information, we know the importance of personal information to you, and we will do our best to protect your personal information security and reliable.", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45378, "text": "This privacy protection policy explains how Kua Ying will collect, use your personal information, and help you understand your rights. Please read and understand the privacy protection policy carefully before using our service.", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45379, "text": "[Special Tips] Please read the \"Privacy Protection Policy\" (especially the content of bold and line) and determine our personal information processing rules.", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45380, "text": "In the process of reading and using the fast film, if you have any questions, you can contact our customer service consultation. If you do not agree with any terms in the agreement, you should stop access and use immediately.", "label": ["Policy Change", "Important"], "rewrite": "If you do not agree with any terms in the agreement, you should stop access and use immediately."}
{"task": "rw_23.jsonl", "id": 45381, "text": "This policy will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45382, "text": "1. Definition", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45383, "text": "2. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45384, "text": "3. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45385, "text": "4. How do we share, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45386, "text": "5. How do we protect and save your personal information", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45387, "text": "6. Your rights", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45388, "text": "7. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45389, "text": "8. How to update this policy", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45390, "text": "Nine, scope of application", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45391, "text": "Ten, how to contact us", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45392, "text": "1. Definition", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45393, "text": "Quick Shadow: Refers to Beijing Kuaishou Technology Co., Ltd., 1st floor 101-10, Building 1, No. 6, Shangdi West Road, Haidian District, Beijing.", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45394, "text": "The following is called \"fast shadow\" or \"us\".", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45395, "text": "Personal information: Refers to the various information that can be recorded alone or with other information with other information alone or with other information.", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45396, "text": "For personal information referred to this privacy protection policy, please see the types of \"how do we collect and use your personal information\".", "label": ["Important"], "rewrite": "For personal information referred to this privacy protection policy, please see the types of \"how do we collect and use your personal information\"."}
{"task": "rw_23.jsonl", "id": 45397, "text": "Personal sensitive information: Refers to personal information such as leakage, illegal provision or abuse that may endanger people's body and property, and it is easy to lead to personal information such as personal reputation, physical and mental health damage or discrimination.", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45398, "text": "Personal sensitive information involved in this privacy protection policy includes: your personal network identity identification information (including account name, account nickname, aforementioned password);", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45399, "text": "Other information (including location information, web browsing records).", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45400, "text": "For the above personal sensitive information listed in this privacy protection policy, in order to facilitate your alertness when reading, in addition to the definition and listing here, we will still use the fonts in this privacy protection policy.Coupled with the line, or point out the way to display it alone, prompt you to pay attention.", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45401, "text": "2. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45402, "text": "During the development and upgrade process of fast shadow, we will continue to improve the product function. We will only collect and use your personal information for the following goals described in this policy:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45403, "text": "(1) Help you register as a user who becomes a fast shadow", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45404, "text": "To help you become a fast -shadow user, that is, complete the creation of accounts so that we can provide you with registered user services (such as registered users can enjoy rich technical functions such as collection). We provide you with a variety of registered channels for you to choose from choosing yourself to choose from yourself.Essence", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45405, "text": "When you choose to register with your mobile phone number, you need to provide us with your personal sensitive information of your mobile phone number. We use this type of information to send the verification code information to submit whether to submit the verification identity.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you choose to register with your mobile phone number, you need to provide your mobile phone number."}
{"task": "rw_23.jsonl", "id": 45406, "text": "When you choose to use a third -party account (such as Kuaishou, WeChat, QQ, etc.) to register and log in to Kuaiying user account, we will access and collect your personal information after indirectly (you are in a third party in a third party (you are in a third partyThe avatar and nickname information in the account are subject to the public information and permissions authorized by different third -party accounts) and bind your third -party account with your fast -shadow registration account.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you choose to use a third -party account to register and log in to Kuaiying user account, we will visit and collect your personal information after the authorization authorized, and bind your third -party account with your Kuaishi registered account."}
{"task": "rw_23.jsonl", "id": 45407, "text": "If you refuse to provide information under a third -party account, you cannot choose to register and log in to use a third -party account. We promise the legitimacy of the third -party account channel source of this type of personal information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45408, "text": "You need to remind you that when you choose to log in to fast shadow with your fast -hand account, we will collect your follow -up user list information in Kuaishou so that you can recommend you to the high -quality template material published by users in fast shadow.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you choose to log in to the fast shadow with fast -hand account, we will collect your attention user list information."}
{"task": "rw_23.jsonl", "id": 45409, "text": "At the same time, in order to facilitate your timely understanding of yourself or the dynamic situation of the fast -handed works made by users using fast shadows, we will give you feedback to you or the point of fast -handed works published by the user through pop -ups, in -site letters, etc.Social information such as praise.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will feedback the dynamic situation of you or the users you pay attention to in the form of pop -up windows, in -site letters."}
{"task": "rw_23.jsonl", "id": 45410, "text": "Regarding the information of the user list, you can refuse to provide it by rejecting authorization during the landing. You can also withdraw the authorization by the way that the fast hand [setting-account and security-authorization management-fast shadow-lift authorization], refuse to provide or withdraw the authorization authorization onlyThe impact on the use of corresponding functions will not affect your normal use of Kuaibu other functions.", "label": ["Important", "Edit/Control"], "rewrite": "Regarding the information of the user list, you can refuse to provide it by rejecting authorization when landing. You can also withdraw the authorization through the way that you can withdraw by the way of refusing to authorize."}
{"task": "rw_23.jsonl", "id": 45411, "text": "In the process of registering as a fast film user and in the process of using Kuangying, you can choose to supplement your nickname (including the real name), which will help us provide you with better user services.", "label": ["Important", "First Party Collection Information"], "rewrite": "In the process of registering as a fast film user and in the process of using Kuangying, you can choose to add your nickname to provide your nickname."}
{"task": "rw_23.jsonl", "id": 45412, "text": "You know that we collect mobile phone number information to meet the real -name system requirements of relevant laws and regulations. If you do not provide such information, we may not be able to use our registered user services normally.", "label": ["Important", "First Party Collection Information"], "rewrite": "We collect mobile phone numbers information to meet the real -name system requirements of the network."}
{"task": "rw_23.jsonl", "id": 45413, "text": "However, you do not provide mobile phone numbers, third -party account information, and supplementary information, which will not affect the basic functions of your service.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45414, "text": "(2) Provide you with audio and video, picture text and other content editing services", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45415, "text": "Content editing services such as audio and video, picture text and other content are the core business functions of our products.", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45416, "text": "When you upload, edit, edit, publish audio and video, picture text and other content services by yourself, in order to be edited and stored in order to implement resources such as shooting, recording, uploading videos, pictures, and audioEquipment information (including device models, operating system versions, device settings, unique device identifiers, network equipment hardware address Mac, IMSI, software installation list soft hardware feature information), the relevant information of the device (including IP, address, geographical location, and location, geographical location, and locationWLAN access points, Bluetooth and other sensor information that can provide relevant information) and personal Internet records (including browsing records, software usage records, click records, interactive records).", "label": ["Important", "First Party Collection Information"], "rewrite": "When you upload, produce, edit, publish audio, video, picture text and other content services, we will collect equipment information, related information of the equipment, and personal Internet records."}
{"task": "rw_23.jsonl", "id": 45417, "text": "At the same time, in order to be edited and stored and stored in order to realize resources such as shooting, recording, uploading videos, pictures, and audio, we will ask you to authorize cameras, photos, microphones, albums, media libraries, storage (including SD cards) and vibrations(Used for the climax point) permissions;", "label": ["Permission Acquisition", "Important"], "rewrite": "In order to edit and store the resources of shooting, recording, uploading videos, pictures, and audio, we will ask you to authorize the authorization of cameras, photos, microphones, albums, media libraries, storage and shocks."}
{"task": "rw_23.jsonl", "id": 45418, "text": "We may also provide you with magic expressions, filters, and beauty functions. When you take the initiative to upload or shoot in real time, you will use facial pixel information only for the function on the client to provide better visual effects and beauty effectsIn the process, unless there is another clear explanation and obtaining your consent, we will not collect, transmit, store or share any facial pixel information, and will not use your facial pixel information for any other uses of other purposesEssence", "label": ["Important", "First Party Collection Information"], "rewrite": "When you take the initiative to upload or shoot real -time shooting, you will use facial pixel information only for the function on the client. Unless there is another clear explanation and obtaining your consent, we will not collect, repay, store, or share any of your facial faces.Pixel information may be used as other purposes."}
{"task": "rw_23.jsonl", "id": 45419, "text": "If the Android client is in use during use, if the system collapses and needs to check the background log information, we will ask you to ask you the status code permissions;", "label": ["Permission Acquisition", "Important"], "rewrite": "If the system collapses, you need to check the background log information, and we will ask you to ask you to ask the mobile phone status code permissions."}
{"task": "rw_23.jsonl", "id": 45420, "text": "When the iOS client mobile phone uses the shooting function, we need to determine that the mobile phone is currently on the horizontal screen or vertical screen to provide you with better services. We will ask you the sensor permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "When the iOS client mobile phone uses the shooting function, we will ask you to ask you sensor permissions."}
{"task": "rw_23.jsonl", "id": 45421, "text": "In the process, you can choose whether to provide us by yourself. If you refuse to provide authorization, you will not be able to use this additional function, but it does not affect your normal use of other functions.", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45422, "text": "(3) Provide you with social interactive functional services", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45423, "text": "1. When you perform social interaction with other users (such as collection and other product functions), we will collect the content of your collection and show you the content.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you do social interaction with other users through fast shadows, we will collect the content of your collection and show you the content."}
{"task": "rw_23.jsonl", "id": 45424, "text": "2. In order to enhance your user experience and realize the interaction of service functions, understand the service function we may launch in advance in advance.Function, we will access your device calendar to load you, \"Remind\" or \"Sign -in\", such as your device calendar and \"reminding\" or \"sign -in\" service functions through the system information through the system informationNotify you by way.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you use the \"reminder\" or \"sign -in\" function, we will access your device calendar."}
{"task": "rw_23.jsonl", "id": 45425, "text": "3. Under the situation of sharing, receiving, or actively obtaining the shared information, participating in activities, Kuaishi needs to access your shear plate locally, read the password, sharing code, and link contained in itShare, activity linkage and other functions or services to help users open the content of sharing or activities and enhance the user experience.", "label": ["Permission Acquisition", "Important"], "rewrite": "In the case of sharing, receiving, or actively obtaining shared information and participating in activities, Kuaishi needs to access your shear plate locally to read the passwords, sharing code, and links contained in it."}
{"task": "rw_23.jsonl", "id": 45426, "text": "Quick Shadow will upload our server only when the contents of the shear plates belong to Kuaying Jump, Sharing, and event linkage.", "label": ["Permission Acquisition", "Important"], "rewrite": "Quick Shadow will upload our server only when the contents of the shear plates belong to Kuaying Jump, Sharing, and event linkage."}
{"task": "rw_23.jsonl", "id": 45427, "text": "In addition, Kuaiying will not upload other information about your cut plate to our server.", "label": ["Permission Acquisition", "Important"], "rewrite": "Kuaiying will not upload other information of your shear board to our server."}
{"task": "rw_23.jsonl", "id": 45428, "text": "Some mobile phone devices may indicate that the application is reading your shear plate, but the system prompts whether it is not distinguished by local processing or uploading, and due to the standard differences between the statistical methods of different equipment, the possibility of misunderstanding is not ruled out.", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45429, "text": "Therefore, if you find similar prompts and have questions, please contact us.", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45430, "text": "(4) Carry out marketing activities", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45431, "text": "Quick Film will launch various marketing activities in a timely manner according to the operation. When you choose to participate, you must provide name, contact address and contact information, bank account or third -party payment account information according to the activity situation.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you choose to participate in marketing activities, you must provide name, contact address and contact information, bank account or third -party payment account information according to the activity situation."}
{"task": "rw_23.jsonl", "id": 45432, "text": "This information may include personal sensitive information (such as personal phone number, bank account, or third -party payment account, etc.). Rejecting this information, we will not be able to pay you award -winning target, but it does not affect other functions of your normal use of fast shadows.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45433, "text": "(5) Improve our products or services", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45434, "text": "We may also obtain your other information to improve the reasonable needs of our products or services, including the relevant feedback information provided by you when contacting the customer service, the questionnaire answering information sent to us during the questionnaire survey, and you and usWhen the related parties and our partners are interacted, we authorize the relevant information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may obtain other information to improve our product or service reasonable needs."}
{"task": "rw_23.jsonl", "id": 45435, "text": "For information collected from your various devices, we may associate them so that we can provide you with consistent services on these devices.", "label": ["Important", "Usage"], "rewrite": "We may be related to the information collected from your various devices to provide consistent services."}
{"task": "rw_23.jsonl", "id": 45436, "text": "We may combine information from a certain service with other services to provide you with services and suggestions.", "label": ["Important", "Usage"], "rewrite": "We may combine information from a certain service with other services to provide you with services and suggestions."}
{"task": "rw_23.jsonl", "id": 45437, "text": "(6) Provide you with security", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45438, "text": "In order to improve the security of your service, protect the safety of personal property of you, other users or the public, be exempted from infringement, and better prevent security risks such as fishing websites, fraud, network vulnerabilities, computer viruses, cyber attacks, network invasion, etc.To accurately identify the rules of violations of laws and regulations or the relevant agreement rules of the company, we may use or integrate your registered information, equipment information, network equipment hardware address (MAC), unique device logo, network log, and application information you installedThe process information that is running, the overall operation of the application, the frequency of the application of the application, the collapse data, the overall installation of the usage, performance data, and the source of the application to comprehensively judge your account risk, authentication, testing, and testing, and testing and testing.Prevent safety events, and take necessary records, audit, analysis, and disposal measures according to law.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "We may use or integrate your registration information, equipment information, use information, etc. to comprehensively judge your account risk, and adopt necessary records, audit, analysis, and disposal measures in accordance with the law."}
{"task": "rw_23.jsonl", "id": 45439, "text": "For example, we will comprehensively analyze the abnormalities of user account activity, multi -end login, and abnormal traffic to protect your account security.", "label": ["Important", "Data Security"], "rewrite": "We will comprehensively analyze the abnormal user account activity, multi -end login, and abnormal traffic to protect your account security."}
{"task": "rw_23.jsonl", "id": 45440, "text": "(7) Other purposes and uses", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45441, "text": "In the following circumstances, we will solicit your consent in advance in accordance with the provisions of laws and regulations: 1. We use information for other purposes and purposes that are not stated in this privacy protection policy;", "label": ["Important", "Data Security"], "rewrite": "We will use information for other purposes and purposes that are not stated in this privacy protection policy, and we will solicit your consent separately."}
{"task": "rw_23.jsonl", "id": 45442, "text": "2. We use the information collected based on specific uses for other uses.", "label": ["Important", "Data Security"], "rewrite": "When we use the information collected by a specific purpose, we will solicit your consent when using the information for other uses."}
{"task": "rw_23.jsonl", "id": 45443, "text": "(8) Exception of obtaining authorization consent", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45444, "text": "According to relevant laws and regulations, collecting your personal information in the following circumstances does not need to obtain your authorization consent:", "label": ["Important", "First Party Collection Information"], "rewrite": "According to relevant laws and regulations, collecting your personal information in the following circumstances does not need to obtain your authorization consent:"}
{"task": "rw_23.jsonl", "id": 45445, "text": "Related to national security and national defense security;", "label": ["Important", "First Party Collection Information"], "rewrite": "The collection and use information directly related to national security and national defense security does not need to solicit authorization consent."}
{"task": "rw_23.jsonl", "id": 45446, "text": "Related to public safety, public health, and major public interests;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collection and use information related to public safety, public health, and major public interests does not need to solicit authorization consent."}
{"task": "rw_23.jsonl", "id": 45447, "text": "Related to crime investigation, prosecution, trial, and judgment execution", "label": ["Important", "First Party Collection Information"], "rewrite": "Collection and use information related to criminal investigation, prosecution, trial and judgment implementation does not need to solicit authorization consent."}
{"task": "rw_23.jsonl", "id": 45448, "text": "It is difficult to obtain your consent because of maintaining major legitimate rights and interests such as the subject of personal information or other individuals; it is difficult to get your own consent;", "label": ["Important", "First Party Collection Information"], "rewrite": "Out of the major legitimate rights and interests of the life and property of personal information subjects or other individuals, it is difficult to obtain the collection and use information that you agree with, without requiring the consent of authorization."}
{"task": "rw_23.jsonl", "id": 45449, "text": "The personal information collected is publicly disclosed to the public by itself;", "label": ["Important", "First Party Collection Information"], "rewrite": "The collected personal information is publicly disclosed to the public by itself, and there is no need to solicit authorization consent."}
{"task": "rw_23.jsonl", "id": 45450, "text": "Collect personal information from the legal public information, such as legal news reports, government information disclosure and other channels;;", "label": ["Important", "First Party Collection Information"], "rewrite": "If you collect personal information from the legal disclosure information, you do not need to solicit authorization consent."}
{"task": "rw_23.jsonl", "id": 45451, "text": "Signing the contract according to your requirements;", "label": ["Important", "First Party Collection Information"], "rewrite": "The collection and usage information necessary for signing the contract according to your request does not need to solicit authorization consent."}
{"task": "rw_23.jsonl", "id": 45452, "text": "The necessary and stable operation of the products or services provided by maintaining the products or services, such as discovering and disposing of products or services;", "label": ["Important", "First Party Collection Information"], "rewrite": "The collection and use information necessary for the safe and stable operation of the products or services provided by the products provided does not need to solicit authorization consent."}
{"task": "rw_23.jsonl", "id": 45453, "text": "It is necessary for legal news reports;", "label": ["Important", "First Party Collection Information"], "rewrite": "The necessary collection and use information for legal news reports does not need to solicit authorization consent."}
{"task": "rw_23.jsonl", "id": 45454, "text": "When academic research institutions are necessary to carry out statistics or academic research based on public interests, and provide academic research or description results, the personal information contained in the results is identified by", "label": ["Important", "First Party Collection Information"], "rewrite": "When academic research institutions are necessary to carry out statistics or academic research based on public interests, and provide academic research or description results, the personal information contained in the result is to identify the collection and use information of the identification processing, without requiring the consent of authorization."}
{"task": "rw_23.jsonl", "id": 45455, "text": "Other circumstances stipulated in laws and regulations;", "label": ["Important", "First Party Collection Information"], "rewrite": "Other collection and use information stipulated in laws and regulations does not need to solicit authorization."}
{"task": "rw_23.jsonl", "id": 45456, "text": "3. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45457, "text": "(1) Cookie", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45458, "text": "In order to ensure the normal operation of fast shadow and get a easier access experience for you, we will store small data files named Cookie on your mobile devices.", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45459, "text": "Cookie usually contains identifiers, site names, and some numbers and characters.", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45460, "text": "For example, with the help of cookies, websites and clients can store data such as registered accounts, mailboxes, passwords (encryption) and preferences. Cookie can also help us count the traffic information, analyze the effectiveness of page design and advertising.", "label": ["Important", "Usage"], "rewrite": "With Cookie, websites and clients can store data such as registered accounts, mailboxes, passwords and preferences."}
{"task": "rw_23.jsonl", "id": 45461, "text": "We will not use Cookie for any purpose outside the purpose of this policy.", "label": ["Important"], "rewrite": "We will not use Cookie for any purpose outside the purpose of this policy."}
{"task": "rw_23.jsonl", "id": 45462, "text": "You can manage or delete according to your preferences, cookies.", "label": ["Important", "Edit/Control"], "rewrite": "You can manage or delete Cookie according to your preferences."}
{"task": "rw_23.jsonl", "id": 45463, "text": "You can remove all the Cookie saved on the mobile device, but if you do this, you need to change the user settings in person every time you use fast shadows.", "label": ["Important", "Edit/Control"], "rewrite": "You can clear all Cookie saved on the mobile device."}
{"task": "rw_23.jsonl", "id": 45464, "text": "You can also choose to choose not to be tracked by deleting cookie and restoring (clear) mobile terminal settings (content and data).", "label": ["Important", "Edit/Control"], "rewrite": "You can also choose not to be tracked by deleting cookie and restoring mobile terminal settings."}
{"task": "rw_23.jsonl", "id": 45465, "text": "(2) Network beaches and pixel labels", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45466, "text": "In addition to Cookie, we may also use other similar technologies such as websites and pixel labels.", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45467, "text": "For example, the email we send to you may contain a link to our click URL. If you click the link, we will track this click to help us understand your preference for products or services and improve customer service.", "label": ["Important", "Usage"], "rewrite": "If you click our URL, we will track this click."}
{"task": "rw_23.jsonl", "id": 45468, "text": "The website's beacon is usually a transparent image embedded in the website or email. With the pixel label in the email, we can know whether the email is opened to help us determine the number of emails sending emails to users or not to be directed to the user or not to be directed to users.Users send emails.", "label": ["Important", "Edit/Control"], "rewrite": "With the pixel labels in emails, we can know whether the email has been opened."}
{"task": "rw_23.jsonl", "id": 45469, "text": "If you don't want your activities to be tracked in this way, you can withdraw from our signal list at any time.", "label": ["Important", "Edit/Control"], "rewrite": "If you don't want your activities to be tracked, you can withdraw from our letter at any time."}
{"task": "rw_23.jsonl", "id": 45470, "text": "4. How do we share, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45471, "text": "(1) Sharing and disclosure", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45472, "text": "We will not share your personal information to any company, organization and individual other than the company, except the following situations: except:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not share your personal information to any company, organization and individual other than the company, except the following situations: except:"}
{"task": "rw_23.jsonl", "id": 45473, "text": "Share sharing with your clear consent or authorization of you (and guardians) or actively choosing.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share sharing with your clear consent or authorization of you (and guardians) or actively choosing."}
{"task": "rw_23.jsonl", "id": 45474, "text": "Sharing in statutory situations.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Sharing in statutory situations."}
{"task": "rw_23.jsonl", "id": 45475, "text": "We may share your personal information to the outside world in accordance with the requirements of laws and regulations, litigation disputes, or in accordance with the requirements of administrative and judicial organs in accordance with law.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share your personal information to the outside world in accordance with the requirements of laws and regulations, litigation disputes, or in accordance with the requirements of administrative and judicial organs in accordance with law."}
{"task": "rw_23.jsonl", "id": 45476, "text": "For example, if we determine that you have violated laws and regulations or seriously violated the rules of this agreement, or for the protection of personal property of the company's and its related companies or the public, we may disclose it in accordance with laws and regulations or platform -related agreement rules.Your personal information, including related violations and the measures we have taken.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you violate laws and regulations or violate the rules of this agreement, or to protect the safety of personal property of all parties, we may disclose your personal information."}
{"task": "rw_23.jsonl", "id": 45477, "text": "For example, if you or your account upload illegal videos, illegal videos, seriously violate our rules, violate laws and regulations, and/or violate public order and customs, causing a major social impact and causing a reputation loss on our platform. We may disclose you publicly.Information and punishment.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you upload illegal videos and illegal videos and have a significant social impact, we may publicly disclose your information and punishment."}
{"task": "rw_23.jsonl", "id": 45478, "text": "Share your personal information with the company's affiliates.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share your personal information with the company's affiliates."}
{"task": "rw_23.jsonl", "id": 45479, "text": "In this case, we will only share the necessary personal information and be subject to the purpose of the purpose declared in the privacy protection policy.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only share the necessary personal information with related parties and be restricted by the purpose declared in the privacy protection policy."}
{"task": "rw_23.jsonl", "id": 45480, "text": "If our affiliates want to change the purpose of personal information, we will solicit your authorization consent again.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If our affiliates want to change the purpose of personal information, we will solicit your authorization consent again."}
{"task": "rw_23.jsonl", "id": 45481, "text": "Share with authorized partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share with authorized partners."}
{"task": "rw_23.jsonl", "id": 45482, "text": "In order to achieve the purpose of the privacy protection policy, some of our services will be provided by authorized partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Some of our services will be provided by authorized partners."}
{"task": "rw_23.jsonl", "id": 45483, "text": "We may share some of your personal information with our partners to provide better customer service and user experience.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share some of your personal information with our partners to provide better customer service and user experience."}
{"task": "rw_23.jsonl", "id": 45484, "text": "For example, when mailing gifts to you, we must share your personal information with logistics service providers to arrange delivery, or arrange partners to provide services.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When mailing gifts, etc., we must share your personal information with logistics service providers to arrange delivery, or arrange partners to provide services."}
{"task": "rw_23.jsonl", "id": 45485, "text": "We will only share your personal information for legal, correct, necessary, specific, and clear purposes, and only share the personal information necessary for providing services.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only share your personal information for legal, correct, necessary, specific, and clear purposes, and only share the personal information necessary for providing services."}
{"task": "rw_23.jsonl", "id": 45486, "text": "Our partners have no right to use the personal information they shared for any other purpose.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Our partners have no right to use the personal information they shared for any other purpose."}
{"task": "rw_23.jsonl", "id": 45487, "text": "If you refuse our partners to collect personal information required for services when providing services, it may cause you to be unable to use the third -party service in Kuaishi.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45488, "text": "At present, our authorized partners include the following types:", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45489, "text": "In order to realize the authorized partners of advertising, push, advertising, and analysis of services.", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45490, "text": "These partners will only obtain user portrait labels and device information or statistical information that cannot be identified or anonymous after being unable to identify your personal identity information to help them increase the effective access rate of advertising without identifying your personal identity without identifying your personal identity.To help it increase the effective touch rate of information without identifying your personal identity.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to achieve advertising, push, advertising, and analysis of service partners of the service category, only the user portrait label and device information or statistical information that can be identified or anonymous after the user's personal identity information can only be obtained."}
{"task": "rw_23.jsonl", "id": 45491, "text": "Unless you get your permission, we will not make your personal identity information (referring to information that can identify your identity, such as names or mobile phone numbers, you can contact you or identify your identity through this information) and provide advertising and analysis services.Partners share.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Unless you get your permission, we will not share your personal identity information with partners who provide advertising and analyze services."}
{"task": "rw_23.jsonl", "id": 45492, "text": "Sharing with suppliers, service providers and other partners.", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45493, "text": "Suppliers, system service providers and other partners (such as hardware manufacturers, telecommunications operators, etc.) that support our business will obtain your equipment information.The effectiveness of service, provide customer service or conduct academic research and investigation.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Suppliers, system service providers and other partners who support our business will obtain your equipment information."}
{"task": "rw_23.jsonl", "id": 45494, "text": "We will sign a strict data protection agreement with shared partners, asking them to handle personal information in accordance with our requirements, the privacy protection policy, and any other related confidentiality and security measures.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will sign a strict data protection agreement with shared partners, asking them to process personal information according to the agreed confidentiality and security measures."}
{"task": "rw_23.jsonl", "id": 45495, "text": "If we share your personal sensitive information or authorize partners to change the purpose of the use and processing of personal information, we will solicit your authorization consent again.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If we share your personal sensitive information or authorize partners to change the purpose of the use and processing of personal information, we will solicit your authorization consent again."}
{"task": "rw_23.jsonl", "id": 45496, "text": "In order to enable you can log in, accept information push, share information, data statistics, and the above services such as third -party platforms, we will embed the software tool development package (SDK) or other similar of software tool development packages (SDK) or other similar in the application.The application also conducts strict security inspections to protect data security.", "label": ["Important", "Data Security"], "rewrite": "We will embed the software tool development package or other similar applications of authorized partners in the application and conduct strict security inspections to protect data security."}
{"task": "rw_23.jsonl", "id": 45497, "text": "We list items one by one (click to check) related to the use of SDKs used by user information.", "label": ["Important", "Data Security"], "rewrite": "We list items one by one (click to check) related to the use of SDKs used by user information."}
{"task": "rw_23.jsonl", "id": 45498, "text": "Assist in handling disputes.", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45499, "text": "For example, if a certain content you posted on Kuaishha is accused of infringement of intellectual property rights or illegal content, if the complaint, judicial institution or administrative law enforcement agency submits information disclosure requests, we will provide the above agency or individual as depending on the situation.The necessary information such as the contact method of the complaint user to promote the resolution of controversy.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will provide necessary information such as contacting methods of the user or individual depending on the situation to promote the solution of the controversy."}
{"task": "rw_23.jsonl", "id": 45500, "text": "We only assume corresponding legal responsibilities under the circumstances that the law has clearly stipulated.", "label": ["Important"], "rewrite": "We only assume corresponding legal responsibilities under the circumstances that the law has clearly stipulated."}
{"task": "rw_23.jsonl", "id": 45501, "text": "Third -party software or technology.", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45502, "text": "In order to make you use our products normally, we may use third -party software or technologies. Third -party software or technology may collect your device information (the software and hardware feature information of the only device identifier).", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may use third -party software or technology, and third -party software or technology may collect your equipment information."}
{"task": "rw_23.jsonl", "id": 45503, "text": "(2) Transfer", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45504, "text": "We will not transfer your personal information to any company, organization and individual, except the following situations: except:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not transfer your personal information to any company, organization and individual, except the following situations: except:"}
{"task": "rw_23.jsonl", "id": 45505, "text": "Transfer when obtaining clear consent: After getting your clear consent, we will transfer your personal information to other parties;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After getting your clear consent, we will transfer your personal information to other parties."}
{"task": "rw_23.jsonl", "id": 45506, "text": "When the company has a merger, acquisition or bankruptcy liquidation situation, or other cases involving mergers, acquisitions or bankruptcy liquidation, if you involve personal information transfer, we will require new companies that hold your personal information and organizations to continue to be subject to this policy.Restrictions, otherwise we will ask the company, organization, and individuals to reconcile your authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When involving mergers, acquisitions, or bankruptcy liquidation, if personal information transfer is involved, it will be required to continue to be bound by the policy, otherwise it will request that it will re -solicit authorization consent."}
{"task": "rw_23.jsonl", "id": 45507, "text": "(3) Public disclosure", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45508, "text": "We will only disclose your personal information only under the following circumstances and adopt the premise of the industry standards:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only disclose your personal information only under the following circumstances and adopt the premise of the industry standards:"}
{"task": "rw_23.jsonl", "id": 45509, "text": "According to your needs, disclose your personal information you specified under your clear consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "According to your needs, disclose your personal information you specified under the disclosure of your clear consent."}
{"task": "rw_23.jsonl", "id": 45510, "text": "In accordance with the requirements of laws and regulations, mandatory administrative law enforcement or judicial requirements that must provide your personal information, we may disclose your personal information according to the types and disclosure methods required.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In accordance with the requirements of laws and regulations, mandatory administrative law enforcement or judicial requirements that must provide your personal information, we may disclose your personal information according to the types and disclosure methods required."}
{"task": "rw_23.jsonl", "id": 45511, "text": "Under the premise of compliance with laws and regulations, when we receive a request for the above disclosure information, we ask we must issue corresponding legal documents such as tickets or investigation letters.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Under the premise of compliance with laws and regulations, when we receive a request to the above disclosure, we require a corresponding legal document."}
{"task": "rw_23.jsonl", "id": 45512, "text": "We firmly believe that for the information requested by us, it should be as transparent as much as possible within the scope of law.", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45513, "text": "We will conduct a cautious review of all requests to ensure that it has a legitimate basis, and it is limited to data obtained by law enforcement agencies because of specific investigations and legitimate rights.", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45514, "text": "(4) Sharing, transfer, and disclose personal information.", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45515, "text": "According to the relevant laws and regulations, in the following circumstances, sharing, transfer, and publicly disclose your personal information without obtaining your authorization consent in advance:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "According to the relevant laws and regulations, in the following circumstances, sharing, transfer, and publicly disclose your personal information without obtaining your authorization consent in advance:"}
{"task": "rw_23.jsonl", "id": 45516, "text": "a) Directly related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The sharing or disclosure directly related to national security and national defense security does not require authorization."}
{"task": "rw_23.jsonl", "id": 45517, "text": "b) Directly related to public safety, public health, and major public interests;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Sharing or disclosure directly related to public safety, public health and major public interests does not need to be authorized."}
{"task": "rw_23.jsonl", "id": 45518, "text": "c) It is related to criminal investigation, prosecution, trial and judgment execution;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Sharing or disclosure related to criminal investigation, prosecution, trial, and judgment execution does not need to be authorized."}
{"task": "rw_23.jsonl", "id": 45519, "text": "d) For major legitimate rights and interests such as the life and property of the subject of personal information or other individuals, it is difficult to get my consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Out of the major legitimate rights and interests of the life and property of the subject of personal information or other individuals, it is difficult to get shared or disclosed by my consent, and there is no need to solicit."}
{"task": "rw_23.jsonl", "id": 45520, "text": "e) The collected personal information is made to the public to the public;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The collected personal information is the sharing or disclosure of the subject of the personal information to the public by themselves without authorization."}
{"task": "rw_23.jsonl", "id": 45521, "text": "f) Other laws and regulations stipulates.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The sharing or disclosure of other laws and regulations and other regulations does not need to be authorized."}
{"task": "rw_23.jsonl", "id": 45522, "text": "According to the law, the personal information of sharing and transferred the identification processing, and ensure that the data receiver cannot restore and re -identify the subject of personal information, which does not belong to the external sharing, transfer and public disclosure of personal information.Save and processing will not be notified to you separately and obtain your consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "According to the law, the personal information of sharing and transferred the identification processing, and ensure that the data receiver cannot restore and re -identify the subject of the personal information, no need to obtain your consent."}
{"task": "rw_23.jsonl", "id": 45523, "text": "5. How do we protect and save your personal information", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45524, "text": "(1) Technical protection:", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45525, "text": "In order to ensure your information security, we strive to take a variety of reasonable physical, electronics and management security measures that meet industry standards to protect your information, so that your information will not be leaked, damaged or lostSSL, information encryption storage, data center access control.", "label": ["Important", "Data Security"], "rewrite": "Take physical, electronics and management security measures to protect your information so that your information will not be leaked, damaged or lost."}
{"task": "rw_23.jsonl", "id": 45526, "text": "We will use encryption technology to improve the security of personal information;", "label": ["Important", "Data Security"], "rewrite": "We will use encrypted technology to improve the security of personal information."}
{"task": "rw_23.jsonl", "id": 45527, "text": "We will use a trusted protection mechanism to prevent personal information from being maliciously attacked;", "label": ["Important", "Data Security"], "rewrite": "We will use a trusted protection mechanism to prevent personal information from being maliciously attacked."}
{"task": "rw_23.jsonl", "id": 45528, "text": "We will deploy the access control mechanism to make every effort to ensure that only authorized personnel can access personal information.", "label": ["Important", "Data Security"], "rewrite": "We will deploy the access control mechanism to make every effort to ensure that only authorized personnel can access personal information."}
{"task": "rw_23.jsonl", "id": 45529, "text": "(2) Security system guarantee:", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45530, "text": "We have the industry's advanced data security management system based on data -centered data and data security management systems around the data life cycle. From the aspects of organizational construction, system design, personnel management, product technology, and personal information security impact assessment, the security of the entire system is improved.", "label": ["Important", "Data Security"], "rewrite": "Having data security management system based on data as the core and setting around the data life cycle."}
{"task": "rw_23.jsonl", "id": 45531, "text": "At present, we have passed the third -level certification of information security level.", "label": ["Important", "Data Security"], "rewrite": "We have passed the third -level certification of information security level."}
{"task": "rw_23.jsonl", "id": 45532, "text": "(3) Personnel safety management:", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45533, "text": "We have also adopted strict management of employees or outsourcing personnel who may contact you, including but not limited to adopting different permissions control according to different jobs, signing confidentiality agreements with them, monitoring their operations.", "label": ["Important", "Data Security"], "rewrite": "Employees or outsourcing staff who may be exposed to your information also adopt strict management."}
{"task": "rw_23.jsonl", "id": 45534, "text": "We will provide corresponding security measures according to existing technologies to protect your information and provide reasonable security guarantees. We will try our best to make your information not be leaked, damaged or lost.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45535, "text": "We will organize safety and privacy protection training courses to strengthen employees' awareness of protecting the importance of personal information.", "label": ["Important", "Data Security"], "rewrite": "Organize safety and privacy protection training courses to strengthen employees' awareness of protecting the importance of personal information."}
{"task": "rw_23.jsonl", "id": 45536, "text": "(4) Sensitive information and password protection tips:", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45537, "text": "Personal sensitive information protection: You voluntarily shared or even publicly shared information when using our service may involve personal information of you or others and even personal sensitive information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The information you voluntarily shared or even publicly shared may involve personal information of you or others and even personal sensitive information."}
{"task": "rw_23.jsonl", "id": 45538, "text": "Please consider whether to share or even publicly share relevant information when using our services.", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45539, "text": "Please use complex passwords to help us guarantee your account security.", "label": ["Important", "Data Security"], "rewrite": "Please use complex passwords to help us guarantee your account security."}
{"task": "rw_23.jsonl", "id": 45540, "text": "We will try our best to ensure the security of any information you send to us.", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45541, "text": "If our physical, technical, or management protection facilities are damaged, the information is caused by unauthorized access, public disclosure, tampering or destruction, which will cause your legitimate rights and interests to be damaged, and we will bear the corresponding legal responsibility.", "label": ["Important", "Data Security"], "rewrite": "For example, our physical, technical, or management protection facilities are damaged, resulting in unauthorized access, public disclosure, tampering, or destruction, leading to damage to your legitimate rights and interests, we will bear the corresponding legal responsibility."}
{"task": "rw_23.jsonl", "id": 45542, "text": "Your account has a security protection function, please keep your account and password information properly.", "label": ["Important", "Data Security"], "rewrite": "Please keep your account and password information properly."}
{"task": "rw_23.jsonl", "id": 45543, "text": "We will ensure that your information is not lost and will not be abused and altered by backup security measures such as backup and encryption of user passwords.", "label": ["Important", "Data Security"], "rewrite": "We will ensure that your information is not lost and will not be abused and altered by backup security measures such as backup and encryption of user passwords."}
{"task": "rw_23.jsonl", "id": 45544, "text": "Although there are aforementioned security measures, please also understand that there are no \"perfect security measures\" on the information network.", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45545, "text": "Information disclosure prompt and password leak processing: Please pay attention to the Internet is not an absolutely safe environment.", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45546, "text": "We will try our best to ensure the security of any information you send to us.", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45547, "text": "Please protect your personal information properly and provide them with others only.", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45548, "text": "If you find your personal information leakage, especially your account and password leak, please contact our customer service immediately so that we can take corresponding measures.", "label": ["Important", "Data Security"], "rewrite": "If the personal information discovered, please contact our customer service immediately."}
{"task": "rw_23.jsonl", "id": 45549, "text": "(5) Information security incident processing:", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45550, "text": "After unfortunately a personal information security incident, we will inform you in accordance with the requirements of the laws and regulations: the basic situation and possible impact of the security incident, the disposal measures we have taken or we will take, the suggestions that you can prevent and reduce the risk,Remedy for your remedy.", "label": ["Important", "Data Security"], "rewrite": "If a personal information security incident occurs, we will inform your basic situation, possible impact, disposal measures, independent prevention suggestions, etc."}
{"task": "rw_23.jsonl", "id": 45551, "text": "In the event related to the incident, we will inform you in the form of mail, letter, telephone, push notification, etc. When it is difficult to inform the subject of personal information one by one, we will publish an announcement in a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "The relevant situation of security incidents will be informed by mail, letter, telephone, push notification, etc. When it is difficult to inform one by one, it will issue an announcement."}
{"task": "rw_23.jsonl", "id": 45552, "text": "At the same time, we will also report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "Report the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities."}
{"task": "rw_23.jsonl", "id": 45553, "text": "(6) How do we save your personal information:", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45554, "text": "Storage location: The company will store and generate personal information collected and generated during the domestic operations in accordance with the provisions of laws and regulations.", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in domestic operations will be stored in China."}
{"task": "rw_23.jsonl", "id": 45555, "text": "If the company needs to be transmitted overseas due to business development, it will clearly inform and obtain your consent.", "label": ["Data Retention", "Important"], "rewrite": "If the company needs to be transmitted overseas due to business development, it will clearly inform and obtain your consent."}
{"task": "rw_23.jsonl", "id": 45556, "text": "Storage period: We will take reasonable and feasible measures to avoid collecting unrelated personal information.", "label": ["Data Retention", "Important"], "rewrite": "We will take reasonable and feasible measures to avoid collecting unrelated personal information."}
{"task": "rw_23.jsonl", "id": 45557, "text": "We will only retain your personal information within the shortest period of the purpose of the cost of reaching the cost policy, unless you agree to extend the retention period or be permitted by law.", "label": ["Data Retention", "Important"], "rewrite": "Keep your personal information only within the shortest period required for the purpose of the cost of reaching the cost of the cost, unless you agree to extend the retention period or be permitted by the law."}
{"task": "rw_23.jsonl", "id": 45558, "text": "After exceeding the storage period, we will delete your personal information or take technical measures for anonymized processing, except for other provisions of laws and regulations.", "label": ["Data Retention", "Important"], "rewrite": "After exceeding the storage period, your personal information will be deleted or anonymous, except for other provisions of laws and regulations."}
{"task": "rw_23.jsonl", "id": 45559, "text": "6. Your rights", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45560, "text": "(1) Visit and correct your personal information", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45561, "text": "When you complete the registration and login of the fast shadow account, you have the right to access your own personal information through the following methods:", "label": ["Important", "Edit/Control"], "rewrite": "When you complete the registration and login of the fast shadow account, you have the right to access and correct your personal information."}
{"task": "rw_23.jsonl", "id": 45562, "text": "account information.", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45563, "text": "You can click your avatar in the client application, and then click \"Edit Personal Information\" in the page to view your account name, avatar, personal data and other account information at any time;", "label": ["Important", "Edit/Control"], "rewrite": "You can click your avatar in the client application, and then click \"Edit Personal Information\" in the page to view and correct your personal information at any time."}
{"task": "rw_23.jsonl", "id": 45564, "text": "In the same path, you can correct your account name, avatar, personal information and other account information at any time.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45565, "text": "Under normal circumstances, you can browse and correct the information submitted at any time, but for the consideration of security and identification (such as number appeal services), some initial registration information and verification information provided during registration are not available.", "label": ["Important", "Edit/Control"], "rewrite": "Some initial registration information and verification information provided during registration are not available."}
{"task": "rw_23.jsonl", "id": 45566, "text": "(2) Delete personal information", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45567, "text": "You can directly remove or delete information on our products and/or service pages, including account information such as personal data.", "label": ["Important", "Edit/Control"], "rewrite": "You can directly remove or delete information, including account information such as personal data."}
{"task": "rw_23.jsonl", "id": 45568, "text": "You can click your avatar in the client application, and then click \"Edit Personal Information\" in the page to delete account information such as personal data at any time.", "label": ["Important", "Edit/Control"], "rewrite": "You can click your avatar in the client application, and then click \"Edit Personal Information\" in the page to delete account information such as personal data at any time."}
{"task": "rw_23.jsonl", "id": 45569, "text": "In the following circumstances, you can make a request to delete personal information:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45570, "text": "1) If our handling of personal information violates laws and regulations;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45571, "text": "2) If we collect and use your personal information, it has not obtained your consent;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45572, "text": "3) If our behavior of handling personal information violates your agreement;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45573, "text": "4) If you cancel the fast -shaded account;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45574, "text": "5) If we terminate our services and operations.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45575, "text": "If we decide to respond to your deletion request, we will also also notify the entities that obtain your personal information from our personal information and ask them to delete them in time, unless laws and regulations have other regulations, or these entities have obtained your independent authorization.", "label": ["Important", "Edit/Control"], "rewrite": "If we decide to respond to your deletion request, we will also notify the entities that obtain your personal information at the same time, asking them to delete timely, unless laws and regulations have other regulations, or these entities have obtained your independent authorization."}
{"task": "rw_23.jsonl", "id": 45576, "text": "When you delete the information from our services, we may not immediately delete the corresponding information from the backup system, but will delete these information when the backup is updated.", "label": ["Important", "Edit/Control"], "rewrite": "Delete the information you require delete in the backup update."}
{"task": "rw_23.jsonl", "id": 45577, "text": "(3) Manage and withdraw your authorization consent", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45578, "text": "You can modify the function management of mobile applications and mobile terminal device, withdraw your authorization consent.", "label": ["Important", "Edit/Control"], "rewrite": "You can modify the function management of mobile applications and mobile terminal device, withdraw your authorization consent."}
{"task": "rw_23.jsonl", "id": 45579, "text": "Specifically, you can withdraw or manage your authorization in the application through [My-Settings], or use the mobile terminal device function or application permission management, but the specific path may be different depending on the mobile terminal.", "label": ["Important", "Edit/Control"], "rewrite": "You can withdraw or manage your authorization through the [My-Settings] exit login, or use the mobile terminal device function or application permission management."}
{"task": "rw_23.jsonl", "id": 45580, "text": "Please understand that each business function requires some basic personal information to be completed. When you withdraw consent or authorization, we cannot continue to provide you with the service corresponding to the withdrawal consent or authorization, and no longer handle your corresponding personal informationEssence", "label": ["Edit/Control", "Important"], "rewrite": "When you withdraw consent or authorization, we cannot provide your corresponding services, and we will no longer deal with your corresponding personal information."}
{"task": "rw_23.jsonl", "id": 45581, "text": "But your decision to withdraw consent or authorization will not affect personal information processing based on your authorization.", "label": ["Permission Acquisition", "Important", "Edit/Control"], "rewrite": "The decision you withdraws or authorized will not affect personal information processing that was previously authorized."}
{"task": "rw_23.jsonl", "id": 45582, "text": "(4) Logging out your account", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45583, "text": "You can apply for the cancellation of the account of the account by clicking [Mine-Settings-Edit Information].", "label": ["Edit/Control", "Important"], "rewrite": "You can apply for the cancellation of the account of the account by clicking [Mine-Settings-Edit Information]."}
{"task": "rw_23.jsonl", "id": 45584, "text": "In order to ensure that the user or user authorizes the application of the account for cancellation accounts, Kua Ying will collect and verify the personal identity information of users and applicants to do their best to protect the rights and interests of the user.", "label": ["Important", "Edit/Control"], "rewrite": "When the account is canceled, Kuaishi will collect and verify the personal identity information of users and applicants."}
{"task": "rw_23.jsonl", "id": 45585, "text": "Quick Shadow special reminder that your behavior of canceling your account is an irreversible behavior. Once you log out your account, the Kuaying Platform will delete or anonymous information about your account.Services.", "label": ["Important", "Edit/Control"], "rewrite": "Once you cancel your account, the Quick Shadow Platform will delete or anonymous information about your account."}
{"task": "rw_23.jsonl", "id": 45586, "text": "(5) Complaint report and response", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45587, "text": "When you have other complaints, suggestions, or related issues, please contact Kuai Ying through [Mine-Settings-Feedback].", "label": ["Important", "Contact Information"], "rewrite": "Please contact Quick Ying through [Mine-Settings-Feedback]."}
{"task": "rw_23.jsonl", "id": 45588, "text": "Quick Shadow will review the issues involved as soon as possible. Quick Shadow will review the problems involved as soon as possible, and reply to your user in time after verifying your user identity. Generally, we will reply to your question within 48 hours.", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45589, "text": "Of course, if you are not satisfied, you can also report complaints to the competent authority.", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45590, "text": "For your reasonable requests, we do not charge fees in principle, but we will charge a certain cost fee as required for multiple repeated and more reasonable limit.", "label": ["Important", "Edit/Control"], "rewrite": "Reasonable requests are not charged in principle without charging and exceeding the reasonable limit."}
{"task": "rw_23.jsonl", "id": 45591, "text": "For those unprocessed, too many technical means (for example, need to develop new systems or fundamentally change the current practice), bring risks or very unrealistic requests to the legitimate rights and interests of others, we may refuse.", "label": ["Important", "Edit/Control"], "rewrite": "We may refuse to repeat for unseen, need too much technical means, bring risks or very unrealistic requests to others' legitimate rights and interests."}
{"task": "rw_23.jsonl", "id": 45592, "text": "(6) Visiting Privacy Protection Policy", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45593, "text": "When you first register the Kuaishi account for the first time, we will remind you that this privacy protection policy and you will make your choice of consent. In addition, you can log in to your personal account in the mobile application, [My-Settings-Settings-Regarding Kuai Shadow-Privacy Protection Policy] Pages to check all the content of this privacy protection policy at any time.", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45594, "text": "(7) I have the right to obtain a notice of stopping operations", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45595, "text": "If the Kuaishi platform terminates the service or operation, we will stop collecting your personal information in time, and will notify you in the form of notifications to be delivered or announced one by one in the form of at least 30 days in advance, and after the termination of the service or operationDelete or processes your personal information.", "label": ["Important", "Cessation of Operations"], "rewrite": "When stopping operation, we will make an announcement notice and delete or processes your personal information."}
{"task": "rw_23.jsonl", "id": 45596, "text": "7. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45597, "text": "We attach importance to the protection of personal information of minors. If you are a minor under the age of 18, you should read and agree with the supervision and guidance of your parents or other guardians before you use Kuaishi related services.Privacy policy, and use our service or provide information to us under the premise of obtaining your consent.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a minor under the age of 18, please read privacy policies with your guardian and use services or provide information under the consent and guidance of the guardian."}
{"task": "rw_23.jsonl", "id": 45598, "text": "For the case where parents or guardians agree to use our products or services to collect personal information of minors, we will only use, share, transfer, transfer, transfer, transfer, transfer, transfer, and transfer they are clearly agreed or protected by laws or guardians.Or disclose this information.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45599, "text": "If we find the personal information of minors without obtaining proven parents in advance, we will try to delete relevant information as soon as possible.", "label": ["Specific Audiences", "Important"], "rewrite": "If the personal information of minors was collected without the consent of the legal guardian, he would try to delete relevant information as soon as possible."}
{"task": "rw_23.jsonl", "id": 45600, "text": "8. How to update this policy", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45601, "text": "(1) The company may amend the privacy protection policy in a timely manner. Without your clear consent, we will not reduce the rights you should enjoy in accordance with the privacy protection policy.", "label": ["Policy Change", "Important"], "rewrite": "Without your clear consent, we will not reduce the rights you should enjoy in accordance with the privacy protection policy when revising the policy."}
{"task": "rw_23.jsonl", "id": 45602, "text": "(2) After the privacy protection policy is updated, the company will show you the change of privacy protection policies in the form of pushing notifications and pop -ups in the form of push notifications and pop -ups.The latest version of.", "label": ["Policy Change", "Important"], "rewrite": "The company will show you the change of privacy protection policies to you in the form of push notifications and pop -ups when you log in and version update."}
{"task": "rw_23.jsonl", "id": 45603, "text": "If you continue to use our services, you agree to accept the content of the revised policy, but if the updated content needs to collect video, obtain address book, contact information, geographical location and other personal sensitive information, you will still solicit again in a significant way to solicit with a significant way. Your consent.", "label": ["Policy Change", "Important"], "rewrite": "If you continue to use our services, you agree to accept the content of the policy after the revision."}
{"task": "rw_23.jsonl", "id": 45604, "text": "(3) For major changes, we will also provide a more significant notice (we will use the method of specializing in but not limited to SMS, private messages, and on the login page to explain the specific change content of privacy protection policies To.", "label": ["Policy Change", "Important"], "rewrite": "For major changes, we will also provide a more significant notice."}
{"task": "rw_23.jsonl", "id": 45605, "text": "We will also archive the old version of this privacy protection strategy for you to check.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45606, "text": "The major changes referred to this privacy protection policy include but are not limited to:", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45607, "text": "Our service model has changed significantly.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45608, "text": "Such as the purpose of handling personal information, the type of personal information of the processing, the way of use of personal information, etc.;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45609, "text": "We have changed significantly in the aspects of ownership structure and organizational structure.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45610, "text": "Such as all changes caused by business adjustment, bankruptcy mergers and acquisitions, etc.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45611, "text": "The main object of personal information sharing, transfer or public disclosure changes;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45612, "text": "You participated in the right of personal information processing and its exercise methods have undergone major changes;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45613, "text": "When we are responsible for handling the responsibility departments, contact methods and complaint channels of personal information security;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45614, "text": "The personal information security impact assessment report shows that there is a high risk.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45615, "text": "Nine, scope of application", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45616, "text": "This privacy protection policy is only applicable to all services provided by Beijing Kuaishou Technology Co., Ltd. and its related parties, including Kuaishi client, website, etc.Third -party products or services.", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45617, "text": "This privacy protection policy is not applicable to other third -party products or services in the fast -shading service. You use these third -party services (including any personal information you provided to these third parties).Constraction of privacy protection policies (rather than this privacy protection policy), please read the terms of third parties carefully.", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45618, "text": "Please protect your personal information properly and provide third parties only if necessary.", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45619, "text": "Ten, how to contact us", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45620, "text": "If you have any questions, complaints, opinions, or suggestions on the protection policies, personal information security, and personal information protection of minors, you can send your question to [kuaiying@kuaishou.com]", "label": ["Important", "Contact Information"], "rewrite": "Email: kuaiying@kuaishou.com"}
{"task": "rw_23.jsonl", "id": 45621, "text": "Quick Shadow contact address: 1st floor of Building No. 6, No. 6, Shanghai West Road, Haidian District, Beijing, and 400-126-0088 in contact information.", "label": ["Important", "Contact Information"], "rewrite": "Quick Shadow contact address: No. 6, Building No. 6, No. 6, Shangdi Road, Haidian District, Beijing, 101 D1-10, contact information 400-126-0088."}
{"task": "rw_23.jsonl", "id": 45622, "text": "Quick Shadow will review the issues involved as soon as possible and reply to your user identity in time after verifying your user identity.", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45623, "text": "Under normal circumstances, we will reply to your request within 48 hours.", "label": [], "rewrite": []}
{"task": "rw_23.jsonl", "id": 45624, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
