{"task": "rw_24.jsonl", "id": 45625, "text": "Dear JD users: We have updated the \"JD Privacy Policy\". This version of the update mainly focuses on the collection and use of personal information in the service scenario in the service scenario, the information collection method in the payment function, and the use of personal information use rules in order to use in orderYou can understand the protection policy of personal information more clearly and intuitively.", "label": ["Policy Change", "Important"], "rewrite": "We updated the JD Privacy Policy."}
{"task": "rw_24.jsonl", "id": 45626, "text": "【Special Note】", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45627, "text": "This policy is only applicable to the products and services and services provided by Beijing Jingdong Sanbai Lu Shidu Electronic Commerce Co., Ltd. and its affiliated companies (including but not limited to Beijing Jingdong Century Trading Co., Ltd., the following or \"Us\" or \"JD\")The function of extension (hereinafter referred to as \"Jingdong Service\"), including JD APP, website, client, applet, and new forms that appear with technology development to you.", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45628, "text": "If a certain product we provided has a separate privacy policy or a special agreement in the corresponding user service agreement, the privacy policy of the product will be given priority.The content is prevailing.", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45629, "text": "If we use the products or services provided by JD.com in our affiliated company but have not set up an independent privacy policy, this privacy policy is also applicable to this part of the product or service.", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45630, "text": "Please read the \"JD Privacy Policy\" (especially the content of the band) and determine our personal information processing rules.", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45631, "text": "During the reading process, if you have any questions, you can consult us through the contact information in JD.com.", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45632, "text": "Version update date: April 13, 2022", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45633, "text": "Version Effective Date: April 20, 2022", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45634, "text": "If you have any questions, opinions or suggestions, you can contact us through the following contact information:", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45635, "text": "Contact number: 950618", "label": ["Important", "Contact Information"], "rewrite": "Contact number: 950618"}
{"task": "rw_24.jsonl", "id": 45636, "text": "Contact email: privacy@jd.com", "label": ["Important", "Contact Information"], "rewrite": "Contact email: privacy@jd.com"}
{"task": "rw_24.jsonl", "id": 45637, "text": "Registration address: Room 222, Block C, No. 18, Science and Technology Development Zone, Beijing Economic and Technological Development Zone, Beijing", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45638, "text": "Common office address: No. 18, Science and Technology Innovation 11th Street, Beijing Economic and Technological Development Zone, Beijing", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45639, "text": "introduction", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45640, "text": "Welcome to use JD!", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45641, "text": "We attach great importance to user privacy and personal information protection.", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45642, "text": "When you use our products and/or services, we may collect and use your relevant information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45643, "text": "We hope to explain to you how we collect, use, save, share and transfer, and transfer it to you when you use our products and/or services, as well, Update, delete and protect this information.", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45644, "text": "This privacy policy will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45645, "text": "1. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45646, "text": "2. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45647, "text": "3. How do we provide your personal information outside", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45648, "text": "4. How do we protect and save your personal information", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45649, "text": "5. How do you manage personal information", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45650, "text": "6. Protection of personal information of minors", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45651, "text": "7. Notification and revision", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45652, "text": "8. How to contact us", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45653, "text": "This privacy policy is closely related to the JD service you use and the various business functions (hereinafter collectively referred to as \"our products and/or services\").It is confirmed that you have fully understood the content stated in this privacy policy, and let you make a proper choice in accordance with the guidance of this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45654, "text": "In the related terms involved in this privacy policy, we try to make a concise expression as much as possible and provide further explanation links so that you can better understand.", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45655, "text": "1. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45656, "text": "Personal information is a variety of information related to the recognized or recognizable natural person recorded in electronics or other methods, excluding information after anonymous processing.", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45657, "text": "Sensitive personal information is personal information that can easily cause the personality dignity of natural persons to be infringed or harmed by personal and property security, including biometrics, religious beliefs, specific identities, medical health, financial accounts, trajectory trajectory, etc.And personal information of minors under the age of 14.", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45658, "text": "We will follow the principles of legitimate, legal, and necessary. For the following goals described in this policy, collect and use personal information that you actively provide or use products and/or services in the process of using products and services.And get your personal information from a third party.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45659, "text": "If we want to use your personal information for other purposes that are not stated in this policy, or use information collected based on specific purposes for other purposes, we will inform you in a reasonable way, and recruitGet your consent.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "For example, we want to use your information to exceed the use of this policy, or to use the information collected based on specific purposes for other purposes, and will inform you and obtain your consent."}
{"task": "rw_24.jsonl", "id": 45660, "text": "(1) You must authorize us to collect and use your personal information", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45661, "text": "Our products and/or services include some core functions. These functions include the functions of realizing the functions of online shopping and the function of ensuring the security of transactions.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45662, "text": "We may collect, save and use the following information related to you to achieve the above functions.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45663, "text": "If you do not provide relevant information, you will not be able to enjoy the products and/or services we provide.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45664, "text": "These functions include:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45665, "text": "1. Realize the functions necessary for online shopping", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45666, "text": "(1) Account registration, login and verification", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45667, "text": "When you register the JD account, you need to provide us at least to provide us with the JD account name, password, mobile phone number, and email address that you are preparing to use. We will verify that your identity is valid by sending a SMS verification code or mail.Card information recognition and display the corresponding operator.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you register the JD account, you need to provide the prepared JD account name, password, mobile phone number, and e -mailbox."}
{"task": "rw_24.jsonl", "id": 45668, "text": "Your account name is your default nickname, you can modify and supplement your nickname, gender, birthday, and your real -name authentication related information. These information belongs to your \"account information\".", "label": ["Important", "First Party Collection Information"], "rewrite": "You can modify and supplement your nickname, gender, birthday, and your real -name authentication related information."}
{"task": "rw_24.jsonl", "id": 45669, "text": "The account information you supplement will help us provide you with personalized product recommendations and better shopping experience, but if you do not provide these supplementary information, it will not affect your basic functions of online shopping.", "label": ["Important", "First Party Collection Information"], "rewrite": "The account information you supplement will help us provide personalized product recommendations and better shopping experiences."}
{"task": "rw_24.jsonl", "id": 45670, "text": "When you successfully register the JD account, you can use the JD account to log in to the \"Jingdong Mall\". When you log in, you need to provide us with your JD account information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you successfully register the JD account, you can log in to \"Jingdong Mall\", and you need to provide your JD account information when logging in."}
{"task": "rw_24.jsonl", "id": 45671, "text": "If you do not provide such information, you will not be able to log in and buy products at the \"Jingdong Mall\". At this time, you can use browsing and search functions, and we will not collect your above personal information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45672, "text": "You can choose to use your face information to use your face information only with your own face information.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can choose to use your face login service."}
{"task": "rw_24.jsonl", "id": 45673, "text": "In order to confirm your identity through your face information, you agree and authorize us to obtain your personal real -name identity information (name, ID number, ID photo photo) and facial photos under this account in order to combine your identity informationFace information to verify your identity.", "label": ["Important", "First Party Collection Information"], "rewrite": "You agree and authorize us to obtain your personal real -name identity information and facial photos in order to combine your identity information and face information to verify your identity."}
{"task": "rw_24.jsonl", "id": 45674, "text": "If you don't want the facial recognition information you will provide, the comparison verification test you authorize after we are saved. You can choose to withdraw authorization. After exiting, your facial recognition information will no longer be used for subsequent comparison tests.", "label": ["Important", "Edit/Control"], "rewrite": "You can choose to withdraw facial information authorization. After exiting, your facial recognition information will no longer be used for subsequent comparison tests."}
{"task": "rw_24.jsonl", "id": 45675, "text": "The specific withdrawal path is \"My-Account Settings-Account and Security-Sign Login\".", "label": ["Edit/Control", "Important"], "rewrite": "The path of withdrawal of facial information authorization is \"My-Account Settings-Account and Security-Login Login\"."}
{"task": "rw_24.jsonl", "id": 45676, "text": "(2) Display and search for product/service information", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45677, "text": "In order to show you products or services to you, we will collect your equipment information (including device name, device model, MAC address and IMEI, device recognition code, mobile application list and other software and hardware feature information, operating systems and application versions, language settings, language settings, Resolution, service provider network ID (PLMN)), the relevant information of the device (including the GPS location information you have authorized and the WLAN access point, Bluetooth and base station sensor information), browser type to the corresponding goods or servicesSorting the content to adapt to your device interface.", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to show you products or services, we will collect your equipment information, the relevant information of the equipment, and the type of browser."}
{"task": "rw_24.jsonl", "id": 45678, "text": "In order to provide you with search history, browsing records, collecting products or stores, shops, shopping carts or order products or service display services, we will collect your browsing information, search records, collection records, follow records, additional purchases information, plus purchase information,order information.", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to provide you with search history, browsing records, collecting products or stores, shops, shopping carts or order products or service display services, we will collect your browsing information, search records, collection records, follow records, additional purchases information, plus purchase information,order information."}
{"task": "rw_24.jsonl", "id": 45679, "text": "We will carry out data analysis and predicting your preferences based on your above information and other information you have authorized. We will push you the commodities/services, commercial advertising, commercial advertising, business advertisements, commercial advertisements, commercial advertisements, commercial advertisements, commercial advertisements, commercial advertisements, businessSex messages and other marketing information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will carry out data analysis and prediction preferences based on the collected information and the information you authorize, and make personalized recommendations."}
{"task": "rw_24.jsonl", "id": 45680, "text": "If you need to modify the product or service sorting or commercial advertising and other contents that you show you, you can achieve it in the following ways:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45681, "text": "1), if you are not interested in the products or services displayed by the homepage \"Recommended for you\", you can choose the recommended product or service pictures to be selected according to the prompts to reduce or block the relevant products or service categories;", "label": ["Important", "Edit/Control"], "rewrite": "You can choose the recommended product or service pictures to reduce or block related products or service categories according to the prompt pop -up window."}
{"task": "rw_24.jsonl", "id": 45682, "text": "2) If you do not want to receive the search page for the comprehensive recommended products or services for you, you can choose to receive the corresponding search results display according to the sales volume, price or other pages;", "label": ["Edit/Control", "Important"], "rewrite": "You can choose to receive the corresponding search results display according to sales, price, or other pages."}
{"task": "rw_24.jsonl", "id": 45683, "text": "3) If you don't want to receive commercial SMS, you can cancel the mobile phone promotion text message we sent to you according to the text message content prompts;", "label": ["Important", "Edit/Control"], "rewrite": "You can cancel the mobile phone promotion text message according to the text message content prompt."}
{"task": "rw_24.jsonl", "id": 45684, "text": "4) If you don't want to receive message notifications sent by the app, you can set it through the mobile app \"Message Center-Message Settings\" settings;", "label": ["Important", "Edit/Control"], "rewrite": "You can notify the message \"Message Center-Message Settings\" settings."}
{"task": "rw_24.jsonl", "id": 45685, "text": "5) If you want to manage the personalized advertisements we send you, you can set up in \"My-Account Setting-General-Privacy Settings-Advertising Management\".", "label": ["Edit/Control", "Important"], "rewrite": "You can manage personalized advertisements in \"My-Account Settings-General-Privacy Settings-Advertising Management\"."}
{"task": "rw_24.jsonl", "id": 45686, "text": "Click to go.", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45687, "text": "6) If you want to manage the personalized content we send to you, you can set it in \"My-Account Settings-General-Privacy Settings-Recommended Management\".", "label": ["Edit/Control", "Important"], "rewrite": "You can manage personalized content in \"My-Account Settings-General-Privacy Settings-Recommended Management\"."}
{"task": "rw_24.jsonl", "id": 45688, "text": "Click to go.", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45689, "text": "7), others: You can cancel the promotional information of the email subscription in the mail subscription menu on the PC account.", "label": ["Edit/Control", "Important"], "rewrite": "You can cancel the promotional information of the email subscription through the mail subscription menu on the PC account."}
{"task": "rw_24.jsonl", "id": 45690, "text": "(3) Place order and order management", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45691, "text": "When you are going to settle the goods in your shopping cart, the JD system will generate orders for your purchase of goods.", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45692, "text": "You need to fill in at least your consignee's name, receiving address and mobile phone number in the order. At the same time, the order number will be stated in the order, the product or service information you purchaseAnd payment method;", "label": ["Important", "First Party Collection Information"], "rewrite": "You need to fill in your consignee's name, receiving address and mobile phone number in the order, and the order will indicate the order number, the product or service information you purchaseEssence"}
{"task": "rw_24.jsonl", "id": 45693, "text": "You can also fill in the consignee's contact phone number and mailbox address information to increase more contact information to ensure that the product can be delivered accurately, but it does not affect the production of your order without filling in this information.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can also fill in the consignee's contact telephone number and mailbox address information to ensure that the product is accurate."}
{"task": "rw_24.jsonl", "id": 45694, "text": "If you need to issue an invoice, you also need to provide an invoice, taxpayer identification number, and e -mail for receiving invoices.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you need to issue an invoice, you also need to provide an invoice, taxpayer identification number, and e -mail for receiving invoices."}
{"task": "rw_24.jsonl", "id": 45695, "text": "You also need to provide other necessary information when realizing some special types of goods or services, such as you apply for a booking ticket, train ticket, hotel, traveling mobile phone card or contract machine, processing broadband, cross -border transactions, cross -border transactions on JD.comWhen applying for energy -saving subsidies and other businesses, you may need to be based on national laws and regulations or service providers (including ticket sellers, hotels, travel agencies and its authorized agents, basic telecommunications operators, mobile resale operators, customs, etc.)Requires your real -name information, these real -name information may include your identity information (such as your birth certificate, hukou book, ID card, military officer certificate, passport, driver's license, etc.Your own photos or videos, names, phone numbers.", "label": ["Important", "First Party Collection Information"], "rewrite": "You also need to provide other necessary information when realizing some special types of goods or services. For example, if you apply for a booking ticket, hotel, etc., you need to provide real -name information."}
{"task": "rw_24.jsonl", "id": 45696, "text": "These orders may include your itinerary, hotel address, your designated service address or device installation address (probably your home address).", "label": ["Important", "First Party Collection Information"], "rewrite": "The order may include your itinerary, hotel address, your designated service address or equipment installation address information."}
{"task": "rw_24.jsonl", "id": 45697, "text": "When you buy an accident insurance for your mobile phone, you may also need to provide your mobile IMEI information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you buy an accident insurance for your mobile phone, you may also need to provide your mobile IMEI information."}
{"task": "rw_24.jsonl", "id": 45698, "text": "All the above information constitutes your \"order information\". We will use your order information (including third parties to the third parties with the above services) for your identity test, determine transactions, payment settlement, complete distribution, query you order for you, query you order for youAnd provide customer service consultation and after -sales service.", "label": ["Important", "Usage"], "rewrite": "We will use your order information to perform your identity verification, determine transactions, payment settlement, complete distribution, query orders for you, and provide customer service consultation and after -sales service."}
{"task": "rw_24.jsonl", "id": 45699, "text": "We will also use your order information to determine whether your transaction is abnormal to protect your transaction security.", "label": ["Important", "Usage"], "rewrite": "We will use your order information to determine whether your transaction is abnormal to protect your transaction security."}
{"task": "rw_24.jsonl", "id": 45700, "text": "(4) Payment function", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45701, "text": "After you place an order, you can choose JD.com's affiliated parties or the third -party payment institutions (including JD Pay, WeChat Pay and UnionPay, and Internet Union payment channels (including JD.com Payment, WeChat Payment, UnionPay, and Internet Union.Essence", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45702, "text": "We need to share your JD order number and transaction amount information with these payment institutions to complete the order payment function.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "We need to share your JD order number and transaction amount information with the payment institution to complete the order payment function."}
{"task": "rw_24.jsonl", "id": 45703, "text": "When you use the payment function, the payment institution will collect or verify your bank card (including savings card, credit card) and other payment necessary information through its page to achieve its payment instructionCorresponding privacy policy.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "When you use the payment function, the payment institution will collect or verify your bank card and other payment necessary information through its page to confirm that you complete the payment."}
{"task": "rw_24.jsonl", "id": 45704, "text": "In order to facilitate your normal use of your wallet function, the account amount information you open and use the JD wallet will be displayed on the corresponding payment institution page.", "label": ["Important", "First Party Collection Information"], "rewrite": "The account amount information you open and using the JD wallet will be displayed on the corresponding payment institution page."}
{"task": "rw_24.jsonl", "id": 45705, "text": "(5) Delivery products and/or service functions", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45706, "text": "After you place an order and choose to pay or complete the payment online, or choose to get the test items and prizes, JD, JD.com's related parties, suppliers, merchants or third -party distribution companies (hereinafter referred to as \"distribution company\"\") The delivery of the order will be completed.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After you place an order and choose to pay or complete the payment online, or choose to get the test items and prizes, the delivery company will complete the delivery of the order for you."}
{"task": "rw_24.jsonl", "id": 45707, "text": "You know and agree that JD, JD.com's related parties, suppliers, and merchants or distribution companies that cooperate with JD.com will use your order information within the above link to ensure that your ordering products can be delivered safely.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You know and agree that third parties will use your order information to ensure that your ordered goods can be delivered safely."}
{"task": "rw_24.jsonl", "id": 45708, "text": "While providing you with distribution services for you, our delivery staff will help you complete real -name authentication based on the requirements of certain business laws, such as you buy a mobile phone number card service.", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45709, "text": "We will use your ID card to check your identity through the proprietary device of the state's rights certification agency. We will not collect your ID information, and our delivery staff must comply with the company's confidential system regulationsEssence", "label": ["Important", "First Party Collection Information"], "rewrite": "We will use your ID card to check your identity by using your ID card through the proprietary device of the state's rights certification agency."}
{"task": "rw_24.jsonl", "id": 45710, "text": "(6) Customer service and after -sales function", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45711, "text": "Our telephone customer service and after -sales function will use your account information and order information.", "label": ["Important", "Usage"], "rewrite": "Our telephone customer service and after -sales function will use your account information and order information."}
{"task": "rw_24.jsonl", "id": 45712, "text": "To ensure your account security, our call center customer service and online customer service will use your account information to verify your identity with you.", "label": ["Important", "Usage"], "rewrite": "Call Center customer service and online customer service will use your account information to verify your identity with you."}
{"task": "rw_24.jsonl", "id": 45713, "text": "When you need us to provide customer service and after -sales service related to your order information, we will check your order information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you need us to provide customer service and after -sales service related to your order information, we will check your order information."}
{"task": "rw_24.jsonl", "id": 45714, "text": "You may provide other information outside of the above information when communicating with our customer service staff. If you ask us to change the delivery address, contact or contact phone number.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the information provided by you when you communicate with customer service."}
{"task": "rw_24.jsonl", "id": 45715, "text": "If you have a gift or purchase of commodity freight insurance, the freight that you generate when returns and exchanges may apply for payable payment by the freight insurance service provider. To achieve insurance and claims, we will collect or query the start and end of the warranty of your purchase of goods.Return goods courier company, express order number, return address, delivery time information.", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to achieve the insurance and claims of freight insurance, we will collect or query the start and end period for your purchase of goods, refund goods courier companies, courier orders, return addresses, and delivery time information."}
{"task": "rw_24.jsonl", "id": 45716, "text": "2. Must guarantee the functions necessary for transaction security", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45717, "text": "Equipment MAC address, application process list, device recognition code, device serial number, operating system and software version, device status, network condition), historical online records, log information, facial information, IP address, location information, browsing information, order information, order information, Common software lists, SSID, WIFI information, IMSI, SIM card information, battery use to identify whether it is a real natural person, whether to log in to an abnormal place, judge your account risk, and may record some links we think there is a risk of risk(\"Url\");", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "Collect your account information, history Internet records, log information, facial information, etc. to judge your account risk, and record some risk links."}
{"task": "rw_24.jsonl", "id": 45718, "text": "We will also collect your device information to analyze, statistical traffic and investigate the possible risks of JD system issues, and check it when you choose to send an abnormal information to us.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "Collect your device information to analyze, statistically traffic and investigate the possible risks of JD system problems."}
{"task": "rw_24.jsonl", "id": 45719, "text": "If you do not provide the above information, we cannot protect your service and account security during your use of JD service.", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45720, "text": "(2) The situation of your personal information you can provide independently", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45721, "text": "In order to make your shopping more convenient or more fun and improve your online shopping experience in JD, we may collect and use your personal information in the expansion function.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may collect and use your personal information in the expansion function."}
{"task": "rw_24.jsonl", "id": 45722, "text": "If you do not provide these personal information, you can still shop online, but you may not be able to use the expansion function of shopping fun or you need to fill in some information when buying some products.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45723, "text": "For information and use of these extended functions, see here for details.", "label": ["Important", "First Party Collection Information"], "rewrite": "For information and use of these extended functions, see here for details."}
{"task": "rw_24.jsonl", "id": 45724, "text": "Please note that when you start the right of power, it means that you authorize us to collect and use relevant personal information to provide you with corresponding services. Once you turn off the right of power, it means that you cancel the authorization.With relevant personal information, you cannot continue to provide you with the service corresponding to the permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "The opening of one authority means that the authorization is authorized to collect and use the relevant information to provide corresponding services. Close the authority to cancel the authorization representative, and no longer continue to collect and use relevant information based on the corresponding permissions."}
{"task": "rw_24.jsonl", "id": 45725, "text": "The decision of your closure authority will not affect the collection and use of information based on your authorization.", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "The decision of your closure authority will not affect the collection and use of information based on your authorization."}
{"task": "rw_24.jsonl", "id": 45726, "text": "(3) We get your personal information from a third party", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45727, "text": "We may obtain the account information of your authorized sharing (avatar, nickname, and other information prompts on the authorized page) from third parties, and bind your third -party account with your JD account after you agree with your consent.Log in through a third -party account and use our products and/or services.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "We may obtain the account information of your authorized sharing from a third party, and bind it with your JD account after being agreed."}
{"task": "rw_24.jsonl", "id": 45728, "text": "We will use your personal information to use your personal information on the premise of complying with relevant laws and regulations in accordance with the agreement with the third party and the legitimacy of the source of personal information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We will use your personal information based on the agreement with the third party and the legitimacy of the source of personal information."}
{"task": "rw_24.jsonl", "id": 45729, "text": "You can also use this machine number to quickly log in. We will provide your network information to the operator to complete the registration or login.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you use quickly, we will provide your network information to the operator to complete or log in."}
{"task": "rw_24.jsonl", "id": 45730, "text": "(4) JD APP involves the case of embedded third -party code and plug -in transmission personal information. Please see here.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "JD APP involves the case of embedded third -party code and plug -in transmission personal information. Please see here."}
{"task": "rw_24.jsonl", "id": 45731, "text": "(5) The rules of your personal information use", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45732, "text": "1. We will use the personal information collected for our products and/or service functions according to the content of this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45733, "text": "2. After collecting your personal information, we will identify the data through technical means.", "label": ["Important", "Data Security"], "rewrite": "After collecting your personal information, we will identify the data through technical means."}
{"task": "rw_24.jsonl", "id": 45734, "text": "3. When we show your personal information, we will use desensitization of your information, including de -identification or anonymous processing to protect your information security.", "label": ["Important", "Data Security"], "rewrite": "We will use desensitization of your information, including de -identification or anonymous processing to protect your information security."}
{"task": "rw_24.jsonl", "id": 45735, "text": "4. To count our product/service usage, we will summarize, analyze and use technical user data, and share statistical information after sharing processing with third parties.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We will summarize, analyze and use technical user data, and share it with third parties."}
{"task": "rw_24.jsonl", "id": 45736, "text": "We will ensure that information receivers cannot re -identify specific individuals through security encryption technical processing methods and other methods.", "label": ["Important", "Data Security"], "rewrite": "Safety encryption technical processing methods and other methods to ensure that information receivers cannot re -identify specific individuals."}
{"task": "rw_24.jsonl", "id": 45737, "text": "5. When we want to use your personal information for other purposes that have not been stated in this privacy policy, or information collected based on specific purposes for other purposes, we will ask your explicit consent in advance.", "label": ["Important", "Usage"], "rewrite": "When we use other purposes that your personal information is not stated in this privacy policy, or the information collected based on specific purposes for other purposes, you will solicit your explicit consent in advance."}
{"task": "rw_24.jsonl", "id": 45738, "text": "Please understand that the products and/or services we provide to you will continue to update and change.", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45739, "text": "If you choose to use other products and/or services that have not been listed in this privacy policy, we will explain to you in detail the purpose, method, scope, and solicitation of the information collection through the agreement, page prompts, etc.Your consent.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you choose other products or services that have not been listed in this privacy policy, we will solicit your consent before collecting personal information."}
{"task": "rw_24.jsonl", "id": 45740, "text": "If you do not agree to provide the aforementioned information, you may not be able to use the product and/or service, but it does not affect your existing products and/or services.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45741, "text": "2. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45742, "text": "(1) Use of cookies", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45743, "text": "1. In order to realize the personalized needs of your online experience, you can get a easier access experience.", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45744, "text": "We will send one or more small data files called Cookies on your computer or mobile device, and the cookies specified to you are the only one. It can only be read to the Web server in your domain.", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45745, "text": "We send you cookies to simplify the steps that you repeat login, store your shopping preferences or products in your shopping cart, and so on to provide you with your shopping preference settings, help you optimize the choice and interaction of advertising, help judge youLogin status and account or data security.", "label": ["Data Retention", "Important", "Usage"], "rewrite": "Cookies can simplify data such as your repeated login, store your shopping preferences, or data in your shopping cart."}
{"task": "rw_24.jsonl", "id": 45746, "text": "2. We will not use any uses outside the purpose of this privacy policy.", "label": ["Important", "Usage"], "rewrite": "We will not use Cookies for any purpose except the purpose of this privacy policy."}
{"task": "rw_24.jsonl", "id": 45747, "text": "You can manage or delete Cookies according to your preferences.", "label": ["Important", "Edit/Control"], "rewrite": "You can manage or delete Cookies according to your preferences."}
{"task": "rw_24.jsonl", "id": 45748, "text": "You can remove everything saved on the computer, cookies, and most of the network browsers will automatically accept cookies, but you can usually modify the setting of the browser according to your needs to reject, cookies;", "label": ["Important", "Edit/Control"], "rewrite": "You can usually modify the browser settings according to your needs to reject cookies."}
{"task": "rw_24.jsonl", "id": 45749, "text": "In addition, you can also remove all cookies stored in the software.", "label": ["Important", "Edit/Control"], "rewrite": "You can also remove all cookies stored in the software."}
{"task": "rw_24.jsonl", "id": 45750, "text": "But if you do this, you may need to change the user settings when you visit the JD.com website, and the corresponding information you recorded before will be deleted, and it may have a certain impact on the security of your service.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45751, "text": "(2) The use of network beacon and similar technologies", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45752, "text": "In addition to cookies, we will also use other similar technologies such as network Beacon on the website.", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45753, "text": "Our webpage often contains some electronic images (called \"single pixel\" GIF file or \"network beacon\").", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45754, "text": "We use the network beacon method::", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45755, "text": "(1) Calculate the number of user access through the use of the Internet Beacon on the JD website, and use the access, cookies to identify registered JD users.", "label": ["Important", "Usage"], "rewrite": "By using the Internet Beacon on the JD website, calculating the number of user access, and accessing the registered JD users by visiting Cookies."}
{"task": "rw_24.jsonl", "id": 45756, "text": "(2) Provide you with personalized services through the Cookies information.", "label": ["Important", "Usage"], "rewrite": "Provide you with personalized services by obtained cookies."}
{"task": "rw_24.jsonl", "id": 45757, "text": "3. How do we provide your personal information outside", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45758, "text": "(1) Sharing", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45759, "text": "1. We will not share your personal information with any company, organization and individual other than JD, except the following situations:", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "We will not share your personal information with any company, organization and individual other than JD, except the following situations:"}
{"task": "rw_24.jsonl", "id": 45760, "text": "(1) Get your clear consent or authorization in advance;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Get your clear consent or authorization in advance, you may share your personal information to the outside world."}
{"task": "rw_24.jsonl", "id": 45761, "text": "(2) Provide the mandatory requirements of laws and regulations, administrative and judicial departments;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Provide your personal information in accordance with the requirements of laws and regulations, administrative and judicial departments."}
{"task": "rw_24.jsonl", "id": 45762, "text": "(3) Within the scope permitted by laws and regulations, it is necessary to provide the affiliated parties or partners of JD and JD.com, you or other JD users or other public interests, property, or security.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Within the scope permitted by laws and regulations, it is necessary to provide your personal information in order to safeguard the interests, property or security damage."}
{"task": "rw_24.jsonl", "id": 45763, "text": "(4) Only by sharing your personal information can we realize the core functions of our products and/or services or the services you need;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Only by sharing your personal information can we realize the core functions of our products and/or services, or provide the services you need, and may share your personal information to the outside world."}
{"task": "rw_24.jsonl", "id": 45764, "text": "(5) You should handle your disputes or disputes with others for you;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you need to deal with your disputes or disputes with others, you may share your personal information."}
{"task": "rw_24.jsonl", "id": 45765, "text": "(6) It is provided by the relevant agreements signed (including the electronic agreement signed online and the corresponding platform rules) or other legal documents.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "It is in line with the relevant agreements or other legal documents you signed with you to provide your personal information."}
{"task": "rw_24.jsonl", "id": 45766, "text": "(7) Based on academic research;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Use your personal information based on academic research."}
{"task": "rw_24.jsonl", "id": 45767, "text": "(8) Public interests based on laws and regulations and public health incidents in accordance with laws and regulations.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Use your personal information based on the public interests of laws and regulations and public health events in accordance with laws and regulations."}
{"task": "rw_24.jsonl", "id": 45768, "text": "2. To provide you with related products or services, show you the content that may be interested in, and protect your account and transaction security. We may share your personal information with our related parties or partners.See here for details.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "To provide you with related products or services, show you the content that may be interested in, and protect your account and transaction security. You may share your personal information with related parties or partners. See the content and purpose for details."}
{"task": "rw_24.jsonl", "id": 45769, "text": "If our related parties or partners want to change the purpose of personal information, we will solicit your authorization consent again.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If our related parties or partners want to change the purpose of personal information, we will solicit your authorization consent again."}
{"task": "rw_24.jsonl", "id": 45770, "text": "Please note that when you use our service, you voluntarily shared or even publicly shared information may involve your or other people's personal information and even sensitive personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The information you voluntarily shared or disclosed may involve your or other people's personal information and even sensitive personal information."}
{"task": "rw_24.jsonl", "id": 45771, "text": "Please consider and decide carefully when sharing.", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45772, "text": "(2) Entrusted processing", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45773, "text": "We may entrust a partner to handle your personal information in order to provide you with corresponding products or services.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may entrust a partner to handle your personal information in order to provide you with corresponding products or services."}
{"task": "rw_24.jsonl", "id": 45774, "text": "But we will only share your personal information for legal, correct, necessary, specific, and clear purposes, and only share the necessary personal information that provides products or services.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only share your personal information for legal, correct, necessary, specific, and clear purposes, and only share the necessary personal information that provides products or services."}
{"task": "rw_24.jsonl", "id": 45775, "text": "If our partner uses your personal information for our unreasonable purpose, it will obtain your consent alone.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If our partner uses your personal information for our unreasonable purpose, it will obtain your consent alone."}
{"task": "rw_24.jsonl", "id": 45776, "text": "Our partners include the following types:", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45777, "text": "(1) Supplier providing technical services.", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45778, "text": "We may provide your personal information to a third party that supports our functions, including suppliers providing us with infrastructure technical services, data analysis services and data processing services.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may provide your personal information to a third party that supports our functions."}
{"task": "rw_24.jsonl", "id": 45779, "text": "(2) Advertising and analysis service partners.", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45780, "text": "We will comply with laws and regulations and general safety technologies of the industry, and entrust these partners to handle information about advertising, coverage, and effectiveness related to advertising.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We commissioned partners to handle information about advertising, coverage, and effectiveness related to advertising."}
{"task": "rw_24.jsonl", "id": 45781, "text": "For our entrusted partners to handle personal information, we will sign a data protection agreement with them, asking them to process personal information in accordance with the agreement, privacy policy, and relevant laws and regulations.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For our entrusted partners to handle personal information, we will sign a data protection agreement with them, asking them to process personal information in accordance with the agreement, privacy policy, and relevant laws and regulations."}
{"task": "rw_24.jsonl", "id": 45782, "text": "In order to ensure that data is safe and controllable in third parties, we have launched Yun Ding services to provide safe and reliable data use and storage environment in the cloud to ensure the security of user data.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "We launched Yun Ding services to provide safe and reliable data use and storage environment in the cloud to ensure the security of user data."}
{"task": "rw_24.jsonl", "id": 45783, "text": "(3) Transfer", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45784, "text": "Those who need to transfer personal information for reasons for merging, separation, dissolution, and declaration of bankruptcy, we will inform you the name or name and contact information of the receiver, and the company that requires your personal information and the organization will continue to be constrained by the privacy policy of this privacy policy.Otherwise, we will ask the company and the organization to reconcile your authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When involving mergers, acquisitions, or bankruptcy liquidation, if personal information transfer is involved, it will be required to continue to be bound by the policy, otherwise it will request that it will re -solicit authorization consent."}
{"task": "rw_24.jsonl", "id": 45785, "text": "(4) Public disclosure", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45786, "text": "We will only disclose your personal information only on the premise that we will only disclose your personal information:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only disclose your personal information only on the premise that we will only disclose your personal information:"}
{"task": "rw_24.jsonl", "id": 45787, "text": "(1) Discover the corresponding personal information according to the scope of authorization you agree with;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Dispute the corresponding personal information according to the scope of authorization you agree with."}
{"task": "rw_24.jsonl", "id": 45788, "text": "(2) If you seriously violate laws and regulations or related agreements and rules, we may disclose your relevant violations and measures we take on you.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you seriously violate laws and regulations, related agreements, rules, and rules, we may disclose your relevant violations and our measures we take."}
{"task": "rw_24.jsonl", "id": 45789, "text": "4. How do we protect and save your personal information", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45790, "text": "(1) We protect your personal information technology and measures", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45791, "text": "We attach great importance to personal information security and take all reasonable and feasible measures to protect your personal information:", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45792, "text": "1. Data security technical measures", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45793, "text": "We will adopt security measures that meet industry standards, including establishing reasonable institutional specifications and security technology to prevent your personal information from being accessed and modified by unauthorized access to avoid data damage or loss.", "label": ["Important", "Data Security"], "rewrite": "Establish a reasonable institutional norms and security technologies to prevent your personal information from being accessed and modified by unauthorized access to avoid damage or loss of data."}
{"task": "rw_24.jsonl", "id": 45794, "text": "For example: JD.com's network service adopts encrypted technologies such as transport layer security protocols, and provides browsing services through HTTPS and other methods to ensure the security of user data during transmission;", "label": ["Important", "Data Security"], "rewrite": "Encryption technologies such as transport layer security protocols are adopted to ensure the security of user data during transmission."}
{"task": "rw_24.jsonl", "id": 45795, "text": "JD.com adopts encrypted technology to encrypt the user's personal information and isolate through isolation technology;", "label": ["Important", "Data Security"], "rewrite": "Use encrypted technology to encrypt the user's personal information and isolate through isolation technology."}
{"task": "rw_24.jsonl", "id": 45796, "text": "When the personal information is used, such as personal information display and personal information association calculation, we will use multiple data desensitization technologies including content replacement and SHA256 to enhance personal information in use;", "label": ["Important", "Data Security"], "rewrite": "We will adopt a variety of data desensitization technology including content replacement and SHA256 to enhance personal information in the use of personal information."}
{"task": "rw_24.jsonl", "id": 45797, "text": "JD.com adopts strict data access permissions control and multiple identity authentication technology to protect personal information to avoid the use of data from illegal use;", "label": ["Important", "Data Security"], "rewrite": "Use strict data access permissions control and multiple identity authentication technology to protect personal information to avoid illegal use of data."}
{"task": "rw_24.jsonl", "id": 45798, "text": "JD.com uses code security automatic inspection and data access log analysis technology for personal information security audit.", "label": ["Important", "Data Security"], "rewrite": "Use code security automatic inspection and data access log analysis technology for personal information security audit."}
{"task": "rw_24.jsonl", "id": 45799, "text": "2. JD.com's other security measures to protect personal information", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45800, "text": "Jingdong manages the storage and use of personal information by establishing a data classification hierarchical system, data security management specifications, and data security development specifications;", "label": ["Important", "Data Security"], "rewrite": "Manage the storage and use of personal information by establishing a data classification grading system, data security management specifications, and data security development specifications."}
{"task": "rw_24.jsonl", "id": 45801, "text": "Through information contacts confidentiality agreement, monitoring and auditing mechanisms to fully control the data;", "label": ["Important", "Data Security"], "rewrite": "Through information contacts confidentiality agreements, monitoring and auditing mechanisms, the data is fully securely controlled."}
{"task": "rw_24.jsonl", "id": 45802, "text": "JD.com establishes the data security committee and has a full -time information protection department and the data security emergency response organization to promote and ensure personal information security.", "label": ["Important", "Data Security"], "rewrite": "Establish a data security committee and set up information protection full -time departments and data security emergency response organizations to promote and ensure personal information security."}
{"task": "rw_24.jsonl", "id": 45803, "text": "We store your personal information underlying cloud technology obtained the third -level certification of the \"Trusted Cloud\" certification issued by the Data Center Alliance, passed the third -level certification of security level protection of the Ministry of Public Security, and also obtained ISO27000 certification.", "label": ["Important", "Data Security"], "rewrite": "The underlying cloud technology has obtained the third -level certification of the \"Trusted Cloud\" certification issued by the Data Center Alliance, passed the third -level certification of the Ministry of Public Security's security level protection, and also obtained ISO27000 certification."}
{"task": "rw_24.jsonl", "id": 45804, "text": "We will also organize safety and privacy protection training courses to strengthen employees' awareness of protecting personal information.", "label": ["Important", "Data Security"], "rewrite": "Organize safety and privacy protection training courses to strengthen employees' awareness of protecting the importance of personal information."}
{"task": "rw_24.jsonl", "id": 45805, "text": "We only allow employees and partners of JD.com and JD.com to visit personal information, and to set up strict access to control and monitoring mechanisms for this.", "label": ["Important", "Data Security"], "rewrite": "Only employees and partners who are necessary to know about information are allowed to visit personal information, and for this reason, it has set up access permissions control and monitoring mechanisms."}
{"task": "rw_24.jsonl", "id": 45806, "text": "We also require all personnel who may be exposed to your personal information to fulfill the corresponding confidentiality obligations.", "label": ["Important"], "rewrite": "All personnel who may be exposed to your personal information fulfill the corresponding confidentiality obligations."}
{"task": "rw_24.jsonl", "id": 45807, "text": "The Internet is not an absolutely secure environment, and the communication method of email, instant messaging, and social software cannot determine whether it is completely encrypted. We recommend that you use complex passwords when using such tools and pay attention to protect your personal information security security security.Essence", "label": ["Important", "Data Security"], "rewrite": "It is recommended that you use complex passwords when using such tools and pay attention to protecting personal information security."}
{"task": "rw_24.jsonl", "id": 45808, "text": "When conducting online products and/or service transactions through JD.com and third parties, you inevitably disclose your personal information from the transaction opponent or potential transaction, such as contact method or postal address.", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45809, "text": "Please protect your personal information properly and provide them with others only.", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45810, "text": "3. Safety event disposal", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45811, "text": "In order to cope with the possible risks of personal information leakage, damage and loss, we have formulated a number of systems to clarify the classification and classification standards of security events, the classification standards of security vulnerabilities, and the corresponding processing process.", "label": ["Important", "Data Security"], "rewrite": "We have formulated a number of systems to clarify the classification and classification standards of security events, safety vulnerabilities, and corresponding processing processes."}
{"task": "rw_24.jsonl", "id": 45812, "text": "We have also established a special emergency response team for security incidents. In accordance with the requirements of safety incidents, we initiated the safety plan for different security incidents to conduct stop loss, analysis, positioning, formulation of remedial measures, and combined with relevant departments to trace the source and strike.", "label": ["Important", "Data Security"], "rewrite": "Start a safety plan for different security incidents, conduct stop loss, analysis, positioning, formulation of remedial measures, and combined with relevant departments to trace back and crack down."}
{"task": "rw_24.jsonl", "id": 45813, "text": "Once the personal information security incident occurs, we will inform you in a timely manner in accordance with the requirements of the laws and regulations: the basic situation and possible impact of the security incident, the disposal measures we have taken or we are going to take, the suggestions that you can prevent and reduce risks independently and reduce risks, Remedy for your remedy.", "label": ["Important", "Data Security"], "rewrite": "If a personal information security incident occurs, we will inform your basic situation, possible impact, disposal measures, independent prevention suggestions, etc."}
{"task": "rw_24.jsonl", "id": 45814, "text": "At the same time, we will inform you that the incident -related situation is promptly informing the event, letter, telephone, push notification, etc. When it is difficult to inform the subject of personal information one by one, we will publish an announcement in a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "It is difficult to inform personal information by mail, letter, telephone, and push notification one by one, and will be announced in a reasonable and effective way."}
{"task": "rw_24.jsonl", "id": 45815, "text": "At the same time, we will also actively report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "Report the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities."}
{"task": "rw_24.jsonl", "id": 45816, "text": "If you have any questions about our personal information protection, contact us through the contact information agreed in this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45817, "text": "If you find your personal information disclosure, especially your account number and password leak, please immediately contact us through the clear contact information in this privacy policy \"8. How to contact us\" so that we can take corresponding measures.", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45818, "text": "(2) Preservation of your personal information", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45819, "text": "1. Your personal information will be stored in the People's Republic of China.", "label": ["Data Retention", "Important"], "rewrite": "Your personal information will be stored in the People's Republic of China."}
{"task": "rw_24.jsonl", "id": 45820, "text": "If you use cross -border transaction services and need to transmit your personal information to overseas, we will obtain your authorization consent and request the receiver to follow the data protection agreement, privacy policies, and relevant laws and regulations signed by both parties.Process your personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If it involves cross -border transmission information, we will obtain your authorization consent and require the receiver to deal with the requirements of the agreement signed by the two parties, this privacy policy, and relevant laws and regulations."}
{"task": "rw_24.jsonl", "id": 45821, "text": "2. During your use of our products and/or services, your personal information will be stored within the time limit of the purpose of this policy.The Republic E -Commerce Law requires that the saving time of goods and service information and transaction information is not less than three years from the date of the transaction.", "label": ["Data Retention", "Important"], "rewrite": "Generally, your personal information is retained within the time limit required to achieve service purposes, unless the law has other requirements."}
{"task": "rw_24.jsonl", "id": 45822, "text": "After exceeding the preservation period, we will delete your personal information according to the requirements of the applicable laws, or perform anonymous processing.", "label": ["Data Retention", "Important"], "rewrite": "After exceeding the storage period, your personal information will be deleted or anonymous."}
{"task": "rw_24.jsonl", "id": 45823, "text": "3. Please note that when you successfully cancel the JD account, we will delete your personal information according to the requirements of the applicable laws, or perform anonymous processing.", "label": ["Data Retention", "Important"], "rewrite": "After the account is canceled, your personal information will be deleted or processed anonymously."}
{"task": "rw_24.jsonl", "id": 45824, "text": "4. If we terminate our services or operations, we will notify you at least 30 days in advance, and delete or anonymous processing of your personal information after termination of the service or operation.", "label": ["Data Retention", "Important"], "rewrite": "When stopping operations, we will notify you in advance and delete or processes your personal information."}
{"task": "rw_24.jsonl", "id": 45825, "text": "5. How do you manage your personal information", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45826, "text": "JD.com attaches great importance to your attention to personal information, and strives to protect your personal information access, correction, deletion, and withdrawal of consent, so that you have full ability to ensure your privacy and security.", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45827, "text": "Your rights include:", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45828, "text": "1. Visit and correct your personal information", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45829, "text": "In addition to laws and regulations, you have the right to access and correct your personal information at any time, including:", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45830, "text": "(1) Your account information: PC side you can check your personal information you submitted to JD on the \"Account Settings\" menu on the \"My JD.com\" page, you can also update the other ways to update the real -name authentication information.Personal information, your real -name authentication information is the name and ID information you used when you pass the real -name authentication. If you need to change your real -name authentication information, you can call the 95118 service hotline to apply for change.", "label": ["Important", "Edit/Control"], "rewrite": "You can check your personal information you submitted to JD in the \"Account Settings\" menu on the \"My JD.com\" page and update the personal information outside the real -name authentication information."}
{"task": "rw_24.jsonl", "id": 45831, "text": "The specific path of the mobile terminal is: account name, personal information information: Homepage- \"My\" enter my JD-in the upper right corner \"Settings\" enter the account setting-click the avatar to enter the personal information page account password, phone number, security information:Home- \"My\" into my JD-In the upper right corner \"Set button\"-account and security;", "label": ["Important", "Edit/Control"], "rewrite": "The specific path of the mobile terminal is: account number name, personal information information: Homepage- \"My\" enters my JD-in the upper right corner \"Set\" and enter the account setting-click the avatar to enter the personal information page; account password, phone number, security information information: Home- \"My\" into my JD-In the upper right corner \"Set button\"-account and security;"}
{"task": "rw_24.jsonl", "id": 45832, "text": "Hobbies: Home- \"My\" enters my JD-product attention, store attention, and favorite content (the specific name is subject to the content of the webpage).", "label": ["Important", "Edit/Control"], "rewrite": "Hobbies: Homepage- \"My\" enters my JD-product attention, store attention, and favorite content."}
{"task": "rw_24.jsonl", "id": 45833, "text": "(2) Your receipt information: PC you can add, change, and delete your delivery address information (including receiving the goods \"by visiting the\" account settings \"of the\" My JD.com \"-\" Receiving address \"menuThe name of the person, the receiving address, the phone number or mailbox of the consignee);", "label": ["Important", "Edit/Control"], "rewrite": "You can add, change, and delete your delivery address information at any time by accessing the \"Account Settings\"-\"receiving address\" menu on the PC."}
{"task": "rw_24.jsonl", "id": 45834, "text": "The specific path of the mobile terminal is: Homepage- \"My\" into my JD-In the upper right corner of the \"Set button\" enter the account settings-address management.", "label": ["Important", "Edit/Control"], "rewrite": "The specific path of the mobile terminal management receiving address is: Homepage- \"My\" enter my JD-In the upper right corner \"Set button\" to enter the account settings-address management."}
{"task": "rw_24.jsonl", "id": 45835, "text": "You can also set the most commonly used delivery address to the default address. In this way, if you do not change the receiving address when you buy the product next time, your product will be distributed to the default address.", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45836, "text": "(3) Your order information: PC you can check all the orders you have completed, pay or wait for sale by accessing the \"My Order\" page.", "label": ["Important", "Edit/Control"], "rewrite": "PCs you can check all your orders that have been completed, paid or after sale by accessing the \"My Order\" page."}
{"task": "rw_24.jsonl", "id": 45837, "text": "The specific path of the mobile terminal is: the homepage of the mobile terminal- \"My\" enters my JD-My Order/Staying/Receiving/Retirement.", "label": ["Important"], "rewrite": "The specific path for the mobile terminal to view the order information is: the mobile side homepage- \"My\" enters my JD-my order/for receipt/waiting/refund."}
{"task": "rw_24.jsonl", "id": 45838, "text": "You can choose to delete your order information that has been completed and canceled to delete your order information, but this may cause us to be unable to accurately judge your purchase information and it is difficult to provide corresponding after -sales service.And evaluation function.", "label": ["Important", "Edit/Control"], "rewrite": "You can choose to delete your order information that has been completed and canceled to delete your order information."}
{"task": "rw_24.jsonl", "id": 45839, "text": "(4) Your browsing information: You can access or clear your search history, view and modify your interest, and manage other data.", "label": ["Important", "Edit/Control"], "rewrite": "You can access or clear your search history, view and modify your interest, and manage other data."}
{"task": "rw_24.jsonl", "id": 45840, "text": "The mobile path is: Search History: Homepage- \"My\" enters my JD-Browse records;", "label": ["Important", "Edit/Control"], "rewrite": "The mobile path is: Search History: Homepage- \"My\" enters my JD-Browse record."}
{"task": "rw_24.jsonl", "id": 45841, "text": "(5) Your comments: You can access your personal comments on PC, or review the products.", "label": ["Important", "Edit/Control"], "rewrite": "Your comments: You can access your personal comments on the PC side, or review the product."}
{"task": "rw_24.jsonl", "id": 45842, "text": "The mobile path is: my JD.com-to be evaluated-evaluation center.", "label": ["Important", "Edit/Control"], "rewrite": "The mobile path is: my JD.com-to be evaluated-evaluation center."}
{"task": "rw_24.jsonl", "id": 45843, "text": "(6) Your invoice information: You can access or update or clear your invoice information. The mobile path is the homepage- \"My\" enter my JD-in the upper right corner to enter the account settings-increase vote qualification qualificationsEssence", "label": ["Important", "Edit/Control"], "rewrite": "You can access or update or remove your invoice information. The mobile path is the homepage- \"My\" enters my JD.com-\"Settings\" in the upper right corner to enter the account settings-increased votes."}
{"task": "rw_24.jsonl", "id": 45844, "text": "(7) Your file information: You can actively add your love model, baby nickname, gender, birthday and school age, equipment model, size, health file in the mobile terminal \"account settings-file\"Related products and services are more convenient, and it is convenient for us to recommend the products you may be interested in.", "label": ["Important", "Edit/Control"], "rewrite": "You can take the initiative to add your model, baby nickname, gender, birthday and school age, equipment model, size, health files, and subsequent deletion and modification in the mobile \"account setting-file\"."}
{"task": "rw_24.jsonl", "id": 45845, "text": "You can delete and modify your above information through this path.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45846, "text": "For other personal information you need to use our products and/or service, you need to access or correct, please contact us at any time.", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45847, "text": "We will respond to your request according to the way and periods listed in this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45848, "text": "2. Delete your personal information", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45849, "text": "You can directly remove or delete information on our products and/or service pages, including order information, browsing information, and receiving address information.", "label": ["Important", "Edit/Control"], "rewrite": "You can directly remove or delete information on our products and/or service pages, including order information, browsing information, and receiving address information."}
{"task": "rw_24.jsonl", "id": 45850, "text": "In the following circumstances, you can make a request to delete personal information:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45851, "text": "(1) If our behavior of handling personal information violates laws and regulations;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45852, "text": "(2) If we collect and use your personal information, it has not obtained your consent;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45853, "text": "(3) If our behavior of handling personal information seriously violates your agreement;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45854, "text": "(4) If you no longer use our products or services, or you cancel the JD account;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45855, "text": "(5) If we terminate our services and operations, or the storage period has expired.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45856, "text": "If we decide to respond to your deletion request, we will also notify it as much as possible from the entities that obtain your personal information as much as possible, and ask them to delete them in time, unless laws and regulations have other regulations, or these entities have obtained your independent authorization.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45857, "text": "Please note that when you successfully cancel the JD account, we will delete or processes your personal information.", "label": ["Data Retention", "Important"], "rewrite": "When you successfully cancel the JD account, we will delete or processes your personal information."}
{"task": "rw_24.jsonl", "id": 45858, "text": "When you or we assist you to delete the relevant information, because of the applicable legal and security technical restrictions, we may not be able to immediately delete the corresponding information from the system. We will securely store your personal information and restrict any further processing of it., Until it can be deleted or achieved anonymous.", "label": ["Data Retention", "Important"], "rewrite": "If we cannot immediately delete your personal information from the system, we will securely store your personal information and restrict further operation until you delete or achieve anonymity."}
{"task": "rw_24.jsonl", "id": 45859, "text": "3. Change the scope of your authorization consent or withdraw your authorization", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45860, "text": "You can change your authorization of the scope of personal information or withdrawing your authorization by deleting information, closing the device function, and making privacy settings in JD.com or software.", "label": ["Edit/Control", "Important"], "rewrite": "You can change the license scope or withdraw authorization by deleting information, closing the device function, and privacy settings in Jingdong website or software."}
{"task": "rw_24.jsonl", "id": 45861, "text": "You can also withdraw the entire authorization of our personal information by canceling the account.", "label": ["Edit/Control", "Important"], "rewrite": "You can withdraw all the authorization of the collection of personal information by canceling the account."}
{"task": "rw_24.jsonl", "id": 45862, "text": "Please understand that each business function requires some basic personal information to be completed. When you withdraw consent or authorization, we cannot continue to provide you with the service corresponding to the withdrawal consent or authorization, and no longer handle your corresponding personal informationEssence", "label": ["Important", "Edit/Control"], "rewrite": "When you withdraw or authorize, we cannot continue to provide you with corresponding services and no longer process personal information."}
{"task": "rw_24.jsonl", "id": 45863, "text": "But your decision to withdraw consent or authorization will not affect personal information processing based on your authorization.", "label": ["Important", "Edit/Control"], "rewrite": "The decision you withdraws or authorized will not affect personal information processing that was previously authorized."}
{"task": "rw_24.jsonl", "id": 45864, "text": "4. Logging out account", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45865, "text": "You can apply for a cancellation account directly in our products.", "label": ["Important", "Edit/Control"], "rewrite": "You can apply for a cancellation account directly in our products."}
{"task": "rw_24.jsonl", "id": 45866, "text": "You can complete the account cancellation by accessing \"My-Account Setting-Account Settings-Account and Security-Logging out of Jingdong Mall\";", "label": ["Important", "Edit/Control"], "rewrite": "You can complete the account cancellation by accessing \"My-Account Settings-Account Setting-Account and Security-Logging out of Jingdong Mall\"."}
{"task": "rw_24.jsonl", "id": 45867, "text": "You can also access the account cancellation through the PC-side access \"My JD-Account Setting-Account Security-Lambage Account\".", "label": ["Important", "Edit/Control"], "rewrite": "You can complete your account cancellation with the \"My JD-Account Settings-Account Security-Logging up\" through the PC."}
{"task": "rw_24.jsonl", "id": 45868, "text": "For the way you cancel your account and the conditions you should meet, please refer to the \"Instructions for Logging in Jingdong Mall Service Account\".", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45869, "text": "After you cancel your account, we will stop providing you with products and/or services, and delete your personal information according to the requirements of applicable laws, or perform anonymous processing.", "label": ["Data Retention", "Important"], "rewrite": "After canceling the account, we will stop providing you with products and/or services, and delete or processes your personal information."}
{"task": "rw_24.jsonl", "id": 45870, "text": "5. Get your personal information copy", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45871, "text": "You have the right to obtain your personal information copy.", "label": ["Edit/Control", "Important"], "rewrite": "You have the right to obtain your personal information copy."}
{"task": "rw_24.jsonl", "id": 45872, "text": "If you need to get the copy of your personal information we collected, you will always contact us.", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45873, "text": "Under the premise of compliance with relevant laws and technical feasibility, we will provide you with corresponding personal information copy according to your requirements.", "label": ["Important", "Edit/Control"], "rewrite": "Under the premise of compliance with relevant laws and technical feasibility, we will provide you with corresponding personal information copy."}
{"task": "rw_24.jsonl", "id": 45874, "text": "6. respond to your request", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45875, "text": "If you cannot access, correct or delete your personal information in the above way, or you need to access, correct or delete other personal information generated by your products and/or services when using our products and/or servicesThere are any violations of laws and regulations or the collection or use of your personal information, you can send emails to privacy@jd.com or contact us through other methods in this privacy policy.", "label": ["Important", "Contact Information"], "rewrite": "Email: privacy@jd.com"}
{"task": "rw_24.jsonl", "id": 45876, "text": "To ensure safety, we may need to provide a written request or provide your identity document. We will answer your request within 15 days after receiving your feedback and verifying your identity.", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45877, "text": "For your reasonable request, we do not charge fees in principle, but we will charge a certain cost fee depending on the request that repeats and beyond the reasonable limit.", "label": ["Important", "Edit/Control"], "rewrite": "Reasonable requests are not charged in principle without charging and exceeding the reasonable limit."}
{"task": "rw_24.jsonl", "id": 45878, "text": "For those who have no repetition and need too much technical means (for example, need to develop new systems or fundamentally change the current practice), bring risks to others' legitimate rights and interests or very unrealistic (for example, information involved in backup tapes)We may refuse.", "label": ["Important"], "rewrite": "We may refuse to repeat for unseen, need too much technical means, bring risks or very unrealistic requests to others' legitimate rights and interests."}
{"task": "rw_24.jsonl", "id": 45879, "text": "6. Protection of personal information of minors", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45880, "text": "1. Jingdong attaches great importance to the protection of personal information of minors.", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45881, "text": "If you are a minor under the age of 18, you should obtain the consent of your guardian in advance before using our products and/or services.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you are a minor under the age of 18, you should obtain the consent of your guardian before use."}
{"task": "rw_24.jsonl", "id": 45882, "text": "JD.com protects personal information of minors in accordance with the provisions of relevant national laws and regulations.", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45883, "text": "2. We will not take the initiative to collect their personal information directly to minors.", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45884, "text": "For the consent of the guardian to collect personal information of minors, we will only use, share, transfer, or disclose this information if they are permitted, consent of the guardian's consent or protection of minors.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "First Party Collection Information", "Important"], "rewrite": "For the consent of the guardian to collect personal information of minors, we will only use, share, transfer, or disclose this information if they are permitted, consent of the guardian's consent or protection of minors."}
{"task": "rw_24.jsonl", "id": 45885, "text": "3. If there is a fact that the minor registered and uses our products and/or services without the consent of the guardian, we will negotiate with the relevant guardian and try to delete relevant personal information as soon as possible.", "label": ["Specific Audiences", "Important"], "rewrite": "If the personal information of minors was collected without the consent of the legal guardian, he would try to delete relevant information as soon as possible."}
{"task": "rw_24.jsonl", "id": 45886, "text": "4. For the personal information of children under 14 years of age, we will further take the following measures to ensure:", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45887, "text": "(1) For the collected children's personal information, in addition to complying with the agreement on user information on this privacy policy, we will also adhere to the principles of legitimate necessity, knowledge consent, clear purpose, security, and use according to law.The requirements of laws and regulations such as information network protection storage, use, and disclosure, and will not exceed the period required for the purpose of collecting and using the purpose of collection and use. After expiry, we will delete or processes the personal information of children.", "label": ["Data Retention", "Specific Audiences", "Important"], "rewrite": "For the personal information of the collected children, in addition to complying with the agreement on personal information of this privacy policy, we will also adhere to the principles of legitimate necessity, knowledge consent, clear purpose, security, and use in accordance with the law, and strictly follow laws and regulations."}
{"task": "rw_24.jsonl", "id": 45888, "text": "We will designate a special person in charge of the protection of personal information of children and set up a special mailbox childprivacy@jd.com for children's personal information protection.", "label": ["Specific Audiences", "Contact Information", "Important"], "rewrite": "Childprivacy@jd.com, a special mailbox for children's personal information protection."}
{"task": "rw_24.jsonl", "id": 45889, "text": "We will also formulate internal special systems for child personal information protection.", "label": ["Specific Audiences", "Important"], "rewrite": "We will formulate internal special systems for child personal information protection."}
{"task": "rw_24.jsonl", "id": 45890, "text": "(2) When you choose to use Jingdong related services as a guardian for children, we may need to collect personal information of childcare children to perform related services to you.", "label": ["Specific Audiences", "First Party Collection Information", "Important"], "rewrite": "When you choose to use JD services as a guardian for the guardian, we may need to collect personal information of the guardian child."}
{"task": "rw_24.jsonl", "id": 45891, "text": "If you need to collect your personal information to you in the specific service, we will obtain your authorization consent in advance and inform you the purpose and purpose of collecting.", "label": ["Specific Audiences", "First Party Collection Information", "Important"], "rewrite": "If you need to collect your personal information in the specific service, we will obtain your authorization consent in advance and inform you the purpose and purpose of collecting."}
{"task": "rw_24.jsonl", "id": 45892, "text": "If you do not provide the aforementioned information, you will not be able to enjoy the related services we provide.", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45893, "text": "In addition, you may take the initiative to provide us with personal information to us when using the information on the sun, evaluation and Q & A function. Please know and choose carefully.", "label": ["Specific Audiences", "First Party Collection Information", "Important"], "rewrite": "You may actively provide us with personal information to us when using the information on the sun, evaluation and Q & A function."}
{"task": "rw_24.jsonl", "id": 45894, "text": "As a guardian, you should correctly fulfill your duties of guardianship and protect your personal information security.", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45895, "text": "If the child needs to register or use our products and/or services, you should properly guide and guard.", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45896, "text": "(3) Children or their guardians have the right to access and correct the personal information of children at any time, and they can also make a request for correction and deletion to us.", "label": ["Specific Audiences", "Important"], "rewrite": "Children or their guardians have the right to access and correct the personal information of children at any time, and they can also make a request for correction and deletion to us."}
{"task": "rw_24.jsonl", "id": 45897, "text": "If you have any opinions, suggestions or complaints, and reports on your personal information related to children, please contact us.", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45898, "text": "We will help you at any time.", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45899, "text": "7. Notification and revision", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45900, "text": "1. To provide you with better services and with the development of JD business, this privacy policy will be updated.", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45901, "text": "But without your clear consent, we will not reduce the rights you should enjoy in accordance with the privacy policy.", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45902, "text": "We will issue a updated version on the JD.com website and JD.com and remind you to update the relevant content through the website announcement or other appropriate ways before taking effect. Please also visit JD in order to understand the latest privacy policy in a timely manner.", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45903, "text": "2. For major changes, we will also provide a more significant notice (we will explain the specific change content of privacy policies through methods including but not limited to mail, text messages or making special prompts on the browsing page).", "label": ["Policy Change", "Important"], "rewrite": "For major changes, we will also provide a more significant notice."}
{"task": "rw_24.jsonl", "id": 45904, "text": "The major changes referred to this privacy policy include, but not limited to:", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45905, "text": "(1) Our service model has changed significantly.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45906, "text": "Such as the purpose of handling personal information, the type of personal information, the use of personal information, etc.;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45907, "text": "(2) We have undergone major changes in the aspects of ownership structure and organizational structure.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45908, "text": "Such as changes caused by business adjustments, bankruptcy mergers and acquisitions, etc.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45909, "text": "(3) The main object of personal information sharing, transfer or public disclosure changes;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45910, "text": "(4) The right to participate in personal information processing and its exercise methods have changed significantly;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45911, "text": "(5) When we are responsible for handling the responsibility departments, contact methods and complaint channels of personal information security;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45912, "text": "(6) Evaluation report on personal information security impact indicates that there is a high risk.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45913, "text": "3. We will also archive the old version of this privacy policy for you to check.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45914, "text": "4. In order to receive notifications in time, it is recommended that you notify us in time when the contact information is updated.", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45915, "text": "If you continue to use our services after the policy update is effective, it means that you have fully read, understand and accept the updated policy and are willing to be subject to updated policy constraints.", "label": ["Policy Change", "Important"], "rewrite": "After this policy is updated, we continue to use our services, which means that you have accepted the updated policy."}
{"task": "rw_24.jsonl", "id": 45916, "text": "We encourage you to check this policy every time we use our services.", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45917, "text": "You can check this policy through \"My-Account Setting-About JD APP-Privacy Policy\" through the JD App.", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45918, "text": "8. How to contact us", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45919, "text": "1. If you are related to this privacy policy or your personal information or complaints, reports, any questions, opinions, or suggestions, please contact us in the following ways.", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45920, "text": "Personal Information Protection Personal Email Privacy@jd.com", "label": ["Important", "Contact Information"], "rewrite": "Personal Information Protection Personal Email PRIVACY@jd.com."}
{"task": "rw_24.jsonl", "id": 45921, "text": "Contact number: [950618]", "label": ["Important", "Contact Information"], "rewrite": "Contact number: [950618]"}
{"task": "rw_24.jsonl", "id": 45922, "text": "Contact address: No. 18, Science and Technology Innovation 11th Street, Economic and Technological Development Zone, Beijing Yizhuang", "label": ["Important", "Contact Information"], "rewrite": "Contact address: No. 18, Science and Technology Innovation 11th Street, Economic and Technological Development Zone, Beijing Yizhuang"}
{"task": "rw_24.jsonl", "id": 45923, "text": "You can also contact us at any time by visiting https://help.jd.com online customer service system or dialing any of our customer service phone calls.", "label": ["Important", "Contact Information"], "rewrite": "You can also contact us at any time through visit https://help.jd.com online customer service system or call any customer service phone call."}
{"task": "rw_24.jsonl", "id": 45924, "text": "2. Under normal circumstances, we will reply within 15 days.", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45925, "text": "If you are not satisfied with our response, especially our personal information processing behavior harms your legitimate rights and interests, you can also complain or report to the regulatory authorities such as online information, telecommunications, public security, and industry and commerce.", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45926, "text": "Attachment: Personal information and sensitive personal information examples (personal information collected by non -Jingdong APP or website, only for example descriptions)", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45927, "text": "Personal information is a variety of information related to the recognized or recognizable natural person recorded in electronics or other methods, excluding information after anonymous processing.", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45928, "text": "Sensitive personal information is personal information that can easily cause the personality dignity of natural persons to be infringed or harmed by personal and property security, including biometrics, religious beliefs, specific identities, medical health, financial accounts, trajectory trajectory, etc.And personal information of minors under the age of 14.", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45929, "text": "(This definition comes from the \"Personal Information Protection Law of the People's Republic of China\").", "label": [], "rewrite": []}
{"task": "rw_24.jsonl", "id": 45930, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
