{"task": "rw_21.jsonl", "id": 78141, "text": "Recent update date: July 25, 2022", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78142, "text": "Effective date: July 26, 2022", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78143, "text": "Version revised content: Modify the format of the text format", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78144, "text": "Email: Privacy-jiakao@mucang.cn", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78145, "text": "Tel: 400-056-1617", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78146, "text": "[Special Tips] Please read our \"Privacy Policy of the Driving Test\" and determine our understanding of our personal information.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78147, "text": "During the reading process, if you have any questions, you can contact us in time (the contact information is subject to the privacy policy).", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78148, "text": "If you do not agree with any provisions in the agreement, you should immediately stop accessing the driving test.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78149, "text": "If you belong to minors under the age of 18, we expect parents or guardians to guide minors to use our services. Please review and accept this agreement with your guardian.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78150, "text": "If you are a minor, it is recommended that your parents or guardians read this policy and use our services or provide us information to us under the consent of your parents or guardians.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78151, "text": "If your guardian does not agree that you use our services or provide information to us in accordance with this policy, please immediately terminate our services and inform us in time so that we can take corresponding measures.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78152, "text": "The Driving Test (hereinafter or \"we\") is Wuhan Mucang Technology Co., Ltd. (registered address: Wuhan Donghu New Technology Development Zone Guanshan Avenue No. 31, No. 31, No. 03) All educational and learning APP.", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78153, "text": "Driving Test Book respects and protects your privacy. When you use our services through computer equipment, mobile terminals, or other devices, we may collect and use your relevant information.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78154, "text": "We hope to explain to you through this privacy policy (hereinafter referred to as \"this policy\") that when we use our services, we may collect your information and how to collect, use, store, and share this information, and we provide you with provide you withThe way to access, control and protect this information.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78155, "text": "This policy is closely related to your service relationship. We recommend that you read and understand all the content of this policy and make a choice you think.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78156, "text": "If you use or continue to use our services, it means that we agree that we can collect, use, store, share, protect and delete your relevant information in accordance with this policy.", "label": ["Policy Change", "Important", "Risk"], "rewrite": "If you use or continue to use our service, it means agreeing to this policy and restricted by this policy."}
{"task": "rw_21.jsonl", "id": 78157, "text": "Please note that we will check and modify this policy from time to time, so the relevant content will change.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78158, "text": "We urge you to regularly patronize this page to ensure that the latest version of the Privacy Policy always knows.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78159, "text": "This privacy policy is suitable for you to access and use our products and services through the driving test of the Book of Driving, the official website of the driving test, the official website of the driving test (https://www.jiakaobaodian.com), and the use of our products and servicesEssence", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78160, "text": "The following will help you understand how we collect, use, store, transmit, share, transfer (applicable) and protect personal information;", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78161, "text": "Help you understand the way query, access, delete, correction, and withdrawn authorized personal information.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78162, "text": "Among them, the important part of the terms of your personal information rights and interests We have reminded in bold forms, please pay special attention.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78163, "text": "1. How do we collect and use information", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78164, "text": "2. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78165, "text": "3. How do we share, transfer, and publicly disclose personal information", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78166, "text": "4. How do you access and manage your personal information", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78167, "text": "5. Information security", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78168, "text": "6. Third -party service", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78169, "text": "7. Personal sensitive information", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78170, "text": "8. Algorithm recommendation service mechanism and rules", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78171, "text": "9. Special agreement for minor privacy", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78172, "text": "10. How do we deal with children's personal information", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78173, "text": "11. Revision and notification", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78174, "text": "12. How to contact us", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78175, "text": "1. How do we collect and use information", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78176, "text": "In order to use the service of the driving test normally, in the following situations, you need to provide us with some information;", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to use the service of the driving test, you need to provide us with some information."}
{"task": "rw_21.jsonl", "id": 78177, "text": "We will also collect your information from a third party with your information in the following situations.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will also collect your information from a third party with your information in the following situations."}
{"task": "rw_21.jsonl", "id": 78178, "text": "If you do not provide relevant information, you may not be able to register as our users or enjoy certain services and functions we provide, or cannot receive our notification, or cannot achieve the effect that related services intend to achieve.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78179, "text": "The ultimate goal of our personal information is to provide you with better products and services, optimize and enrich your user experience.", "label": ["Usage"], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78180, "text": "1.1 Information collection and use", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78181, "text": "(1) Register login", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78182, "text": "a. When you register the Drive Test Alert account, you need to provide us with your mobile phone number at least. We will verify that your identity is valid by sending a SMS verification code.Personal profile, modify or supplement your avatar, nickname, and question bank type to improve your information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you register, you need to provide us at least your mobile phone number. You can choose to fill in gender and personal profile, modify or supplement your avatar, nickname, and question bank type to improve your information."}
{"task": "rw_21.jsonl", "id": 78183, "text": "The account information you supplement will help us provide you with a better service experience, including showing the avatars and nicknames you want to display on the Driving Test Platform.", "label": ["Important", "Usage"], "rewrite": "The account information you supplement will help optimize services."}
{"task": "rw_21.jsonl", "id": 78184, "text": "But if you do not provide these supplementary information, it will not affect your basic function of using the driving test.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78185, "text": "b. You can also log in and use a third -party account. You will authorize us to obtain the public information (avatar, nickname, and other information you authorized) registered on the third -party platform.You can log in and use this product and related services directly.", "label": ["Important", "First Party Collection Information"], "rewrite": "When registering and logging in with a third -party account, access and collect your personal information after your authorization, and bind it."}
{"task": "rw_21.jsonl", "id": 78186, "text": "c. Based on our cooperation with communication operators, when you use the \"one -click login\" function of the driving test, after your explicit consent, the operator will send us your mobile phone numberServe.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the \"one -click login\" function, after your explicit consent, the operator will send us your mobile phone number to us."}
{"task": "rw_21.jsonl", "id": 78187, "text": "The mobile phone number belongs to personal sensitive information. If you refuse to provide the \"one -click login\" method to register the login test book, but it does not affect your registered login in other ways, nor does it affect the normal use of other functions.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78188, "text": "d. When you use community services, we will collect your account information, collection record information, and IP land information. If you refuse to provide relevant information, you will not be able to use the corresponding community services, but it will not affect the use of the user's normal use of driving tests.Other functions.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use community services, we will collect your account information, collection record information, and IP land information."}
{"task": "rw_21.jsonl", "id": 78189, "text": "e. When you use the registration service, we will prompt you to bind the driving school. If you agree to the binding, we will bind your registration account with the driving school. After binding, you can comment on the driving school and upload pictures.", "label": ["Important", "Usage"], "rewrite": "When you use the registration service, you agree to bind your registration account with the driving school. After binding, you can comment on and upload pictures of the driving school."}
{"task": "rw_21.jsonl", "id": 78190, "text": "If you do not agree with binding, you will not be able to comment and upload pictures of driving schools, but it will not affect other functions of your normal use of the driving test.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78191, "text": "After you bind your driving school, you can choose to lift the binding. You can start more in the upper right corner of the binding driving school and choose to lift the binding.", "label": ["Edit/Control", "Important"], "rewrite": "After you bind your driving school, you can start more in the upper right corner of the binding driving school and choose to lift the binding."}
{"task": "rw_21.jsonl", "id": 78192, "text": "After lifting the binding, your registered account will no longer be associated with the driving school.", "label": ["Important", "Edit/Control"], "rewrite": "After lifting the binding, your registered account will no longer be associated with the driving school."}
{"task": "rw_21.jsonl", "id": 78193, "text": "(2) Certification", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78194, "text": "When you use the driving examination function, according to the requirements of laws and regulations (for details: The Ministry of Transportation's announcement on the announcement of the two technical specifications of the \"Technical Specifications for Motor Vehicle Driver Time Training System Platform\", https://xxgk.mot.gov.cn/2020/jigou/ysfws/202006/T20200623_3315268.html) may need to be authenticated by \"face recognition\" to verify your identity.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the driving test, you may need to perform real -name authentication through the \"face recognition\" method to verify your identity."}
{"task": "rw_21.jsonl", "id": 78195, "text": "In the process of real -name authentication, we and third -party certification agencies that provide certification services need you to provide real names, ID numbers and facial feature value information.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "In the process of real -name authentication, we and third -party certification agencies that provide certification services need you to provide real names, ID numbers and facial feature value information."}
{"task": "rw_21.jsonl", "id": 78196, "text": "This information is personal sensitive information. You can refuse to provide it without affecting the normal use of other functions of the driving test.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78197, "text": "This information is for the purpose stipulated in the real -name certification and laws and regulations. It will not be used as other purposes without authorization.", "label": ["Important", "Data Security", "Usage"], "rewrite": "Face recognition is only for real -name certification and laws and regulations, and will not be used as other purposes without authorization."}
{"task": "rw_21.jsonl", "id": 78198, "text": "(3) Information browsing and release function", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78199, "text": "You can publish information about the driving school or driver's license test on the \"Community\" channel of the driving test. You can also comment and like the review/question/answer of others;", "label": ["Edit/Control", "Important"], "rewrite": "You can publish information on driving school or driver's license test on the \"Community\" channel of the driving test, and you can also comment and like the comments/questions/answers of others."}
{"task": "rw_21.jsonl", "id": 78200, "text": "You can also comment on the driving school on the driving test.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78201, "text": "When you use the information release function, we will collect your account information, collection record information, and IP territorial information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the information release function, we will collect your account information, collection record information, and IP territorial information."}
{"task": "rw_21.jsonl", "id": 78202, "text": "When you browse driving schools or coaches on the \"signing up\" channel of the driving test, your browsing records will be stored on your terminal equipment. If you do not want to store the browsing records of driving schools and coaches, you can be at [the driving school you have seen].Delete your browsing data in [Seeing Coach].", "label": ["Data Retention", "Important", "Edit/Control"], "rewrite": "When you browse driving schools or coaches on the \"registration\" channel of the driving test, the browsing records will be stored on your terminal device. You can delete your browsing data in [The Driving School you have seen] and [I have seen]."}
{"task": "rw_21.jsonl", "id": 78203, "text": "According to the \"Cyber Security Law of the People's Republic of China\", users need to provide real -name certification when publishing information in the community.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78204, "text": "You need to provide us at least your mobile phone number. We will verify that your identity is valid by sending a SMS verification code to you. This information is only used as a verification identity and will not be used for other purposes.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We will verify whether your identity is valid by sending a SMS verification code."}
{"task": "rw_21.jsonl", "id": 78205, "text": "a. Service function based on location information:", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78206, "text": "Geographical location information: GPS information, WLAN access point, Bluetooth and base station sensor information.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78207, "text": "We will collect your, location information, (we only collect the geographical location you were at that time, but we will not combine the location information of each period to judge your whereabouts) to judge your locationRecommend the information of driving school in your area, provide local test questions and related information in your city.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We will collect your location information, thinking that you recommend driving school information in your area."}
{"task": "rw_21.jsonl", "id": 78208, "text": "Driving Test Book will not collect other unrelated information when using positioning services for your device.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78209, "text": "b. The function of uploading based on picture: You can upload your photos on the Driving Test to realize the editing publishing you want to publish the information.", "label": ["Important", "Edit/Control"], "rewrite": "You can upload your photos on the Driving Test to implement the editing publishing you want to publish the information."}
{"task": "rw_21.jsonl", "id": 78210, "text": "c. Based on the camera (camera) additional function: You can use this additional feature to complete the function of video shooting, camera, and code scanning.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78211, "text": "The above additional features may need to open your geographical location (location information), album (picture library), microphone (recording authority), and camera (camera) to us in your device to achieve the collection of information involved in these functions.and use.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "The additional function may require you to open your geographical location, album, microphone, and camera permissions to us in your device."}
{"task": "rw_21.jsonl", "id": 78212, "text": "We will prompt you in advance when you download the app for the first time or use the above features one by one in the form of a separate pop -up window. You can choose according to your needs.", "label": ["Important", "Data Security"], "rewrite": "We will prompt you one by one when you download the app for the first time or use the above features."}
{"task": "rw_21.jsonl", "id": 78213, "text": "You can check and close the authority of the above system in different device or system versions in the \"Settings-Application-Application-Right Management\" path. In different equipment or system versions, related views or operation paths and methods may be different. For details, please refer to the device and systemDeveloper description or guidance.", "label": ["Important", "Edit/Control"], "rewrite": "You can check and close the system permissions in the \"Settings-Application-Power Management\" path of your device."}
{"task": "rw_21.jsonl", "id": 78214, "text": "Please note that when you turn on these permissions, it means that you authorize us to collect and use these personal information to achieve the above functions. If you turn off the authority, it means that you cancel these authorization, and we will no longer continue to collect and use your individuals.The information cannot provide you with the above -mentioned functions corresponding to these authorization, but you can still use other driving examinations services other than this.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "The opening of one authority means that the authorization is authorized to collect and use the relevant information to provide corresponding services. Close the authority to cancel the authorization representative, and no longer continue to collect and use relevant information based on the corresponding permissions."}
{"task": "rw_21.jsonl", "id": 78215, "text": "The decision to close permissions will not affect the processing of personal information based on your authorization.", "label": ["Important", "Edit/Control"], "rewrite": "Closing permissions will not affect the processing of personal information based on your authorization."}
{"task": "rw_21.jsonl", "id": 78216, "text": "(4) Message notice", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78217, "text": "You know and agree that for your contact information (contact number) provided by you in the process of using products and or services, we may send one or more types of notifications to one or more in operation for user messagesInform, authentication, security verification;", "label": ["Important", "Usage"], "rewrite": "We may send multiple types of notifications to one or more contact information of you in operation."}
{"task": "rw_21.jsonl", "id": 78218, "text": "In addition, we may also provide you with the mobile phone number collected in the aforementioned process to provide you with the service, function or activity commercial information that you may be interested in, but please rest assured that if you don't want to accept theseInformation, you can be withdrawn through the withdrawal method provided in the mobile phone, or you can contact us directly to the withdrawal.", "label": ["Important", "Usage", "Edit/Control"], "rewrite": "We may provide you with the business information of services, functions, or activities that you may be interested in by text messages and telephones."}
{"task": "rw_21.jsonl", "id": 78219, "text": "(5) Operation and security guarantee", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78220, "text": "In order to ensure your normal use of our services and maintain the normal operation of our service, we will collect your equipment information and log information to improve and optimize your service experience and ensure your account security.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect your equipment information and log information to improve and optimize your service experience and ensure your account security."}
{"task": "rw_21.jsonl", "id": 78221, "text": "a. In order to ensure the security, the quality and efficiency of the operation of software services, we may collect your hardware model, operating system version number, unique device identifier [MAC address information (all have been identified), IMEI, IMSI or orOAID, Android, ID, Openuuid, (iOS), IDFA, (iOS), WIFI information, IP address, SIM card information, task list (Android), Bluetooth, base station, software version number, network access information, system system, system system, system system, system system, system system, system system, system system, system system, system system, system system, system system, systems, systems, systems, systems, systems, systems, systems, systems, systems, systems, systems, systemLog and system clipboard (shear plate);", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "We may collect information such as your hardware model, operating system version number, and unique device identifier to ensure service security."}
{"task": "rw_21.jsonl", "id": 78222, "text": "account information.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78223, "text": "The collection of this information is used to ensure your driving test treasure account security, anti -theft number, and information security function. We will not use other uses of the above information;", "label": ["Important", "Data Security", "Usage"], "rewrite": "The collection of system information, network information, etc. to ensure your driving test Bao Dian account security, anti -theft, and information security."}
{"task": "rw_21.jsonl", "id": 78224, "text": "b. In order to prevent malicious procedures and ensure the quality and efficiency of operation, we will collect the application information of installation;", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to prevent malicious procedures and ensure the quality and efficiency of operating, we will collect the installation application information."}
{"task": "rw_21.jsonl", "id": 78225, "text": "Process information that is running;", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78226, "text": "The operation and use of the application, the collapse, performance data, and source of the application;", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78227, "text": "c. We may use your account information, equipment information, system log information, and our related parties and partners to obtain information that you can share or shared according to law to judge the status of the account, authentication, testing and preventing security incidents.", "label": ["Important", "Data Security", "Usage"], "rewrite": "Use your account information, equipment information, system log information, and information shared by third parties obtained to judge the status of the account and authentication."}
{"task": "rw_21.jsonl", "id": 78228, "text": "(6) When you participate in the [Six Sixth Sixth Learning Car Festival activities] in the driver's test, we will collect your name, mobile phone number, payment information, order information, driving license type, and location information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you participate in the [Six Six Learning Car Festival activities], we will collect your name, mobile phone number, payment information, order information, driving license type, location information."}
{"task": "rw_21.jsonl", "id": 78229, "text": "This information is to check the winning qualifications and the identity of the winner, and issue a reward of the corresponding standards and notify you in time when winning.", "label": ["Important", "Usage"], "rewrite": "Collect information checking the qualifications of winning, the winner of the winner, issue a reward of the corresponding standards and notify you in time when winning."}
{"task": "rw_21.jsonl", "id": 78230, "text": "If you refuse to submit such information, it will cause you to be unable to participate in the prize, but it will not affect your other services that use your driving test.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78231, "text": "(7) When you use the international driver's license authentication translation service provided by a third party in the Driving Test Book, the Driving Test Book is deemed that you allow your third party to collect your personal driving license information, order information, payment information, recipients, recipients, recipients, and recipients.Information, if you refuse third parties to collect such information when providing services, it may cause you to be unable to use the international driver's license certification translation service provided by a third party in the driving test, but it will not affect your other driving test treasures.Serve.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Risk"], "rewrite": "When you use the international driver's license authentication translation service provided by a third party in the Driving Test Book, the Driving Test Book is deemed that you allow a third party to collect your personal information."}
{"task": "rw_21.jsonl", "id": 78232, "text": "(8) Payment function", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78233, "text": "A.VIP course service", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78234, "text": "You can purchase VIP course services in the driving test. We will collect your personal information as follows or all of the personal information, including: product or service information, registered account ID, payment information, order information, we collect this information to help help helpYou successfully complete the transaction, ensure your transaction security, query order information, and provide customer service.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you purchase VIP course services in the driving test, we will collect your part or all personal information."}
{"task": "rw_21.jsonl", "id": 78235, "text": "During the payment process, we may collect your third -party payment account (including Apple, Store account, Alipay account, WeChat account) to achieve the original path refund and after -sales service.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "During the payment process, we may collect your third -party payment account to achieve the original path refund and after -sales service."}
{"task": "rw_21.jsonl", "id": 78236, "text": "We will pay your order payment related information, order security related equipment information, and other necessary information required by anti -money laundering laws according to the payment method you choose.) The way to share with Alipay or other third -party payment companies.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will share your order payment related information, order security related equipment information and other necessary information based on the payment method you choose."}
{"task": "rw_21.jsonl", "id": 78237, "text": "At the same time, we will record and show you the order information of your account, including the purchase of members, the purchase of the subject, the three test room route videos and courses.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We will record and show you the order letter of your account."}
{"task": "rw_21.jsonl", "id": 78238, "text": "b. International driver's license", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78239, "text": "After you have successfully placed the order, the international driver's license service needs third -party assistance to produce and distribute. In order to complete the delivery and distribution of goods to you in orderAvoid knowing your driver's license information, order information, payment information, recipient information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After you place an order, the international driver's license service requires third -party assistance to produce and distribute, and merchants and third -party distribution companies will learn about your driving license information, order information, payment information, recipient information, and recipient information during the delivery and distribution session.Essence"}
{"task": "rw_21.jsonl", "id": 78240, "text": "We promise you that we will ensure your personal information security with the greatest efforts. We will strictly require merchants and third -party distribution companies to keep your personal information confidential, and only learn and use only with the purpose of distribution.use.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will strictly require merchants and third -party distribution companies to keep your personal information confidential and only learn and use only for the purpose of distribution."}
{"task": "rw_21.jsonl", "id": 78241, "text": "c. Six Sixth Learning Car Festival", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78242, "text": "When you participate in the Six Sixth Study Car Day, we will collect your following or all personal information. We collect this information to determine the purchase status of your lottery ticket and prevent the same user from participating in the same period of the same period (hinder other users to participate fairly to participate in the same period (hinder other users to participate in fair participationActivity), including: name, mobile phone number, order information, payment information, driver's license type, location information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you participate in the Six Sixth Study Car Day, collect your part or all personal information to determine the purchase status of your lottery vouchers."}
{"task": "rw_21.jsonl", "id": 78243, "text": "To notify you in time after winning the prize, refund you in time when you are not winning or you give up the prize.", "label": ["Usage"], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78244, "text": "(9) The VIP course test is not compensated services", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78245, "text": "When you use the \"VIP course for the VIP course for not compensation service\" provided by the Driving Test Book, you need to provide screenshots of the name, ID number, examination city, and driving test scores (the Ministry of Public Security's Internet traffic safety comprehensive service management platform, www.122.gov.cn, found) to achieve the application and review of compensation services.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the \"VIP course for not compensation services\", you need to provide screenshots of names, ID numbers, test cities, and driving test results."}
{"task": "rw_21.jsonl", "id": 78246, "text": "We promise you that the personal information you submit only for the review of compensation services, and will not leak or do any other use.", "label": ["Important", "Data Security", "Usage"], "rewrite": "The personal information you submit is only used for the review of compensation services."}
{"task": "rw_21.jsonl", "id": 78247, "text": "(10) \"Help Me Driving School\" service and \"buy a car\" service", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78248, "text": "When you use the \"Help Me Driving School\" service provided by the Driving Test Book, you need to provide the name (non -compulsory) and mobile phone number (after your explicit consent, the operator will send us your mobile phone number to us for convenience for convenienceVerify whether your mobile phone number is your phone number. If you refuse to provide the mobile phone number that will not be able to verify, but it does not affect the normal use of your mobile phone number in other ways, nor does it affect the normal use of other functions.) (We only collect your positioning information at the time or the location information you entered manually, and will not combine your location information of each period to judge your whereabouts. The driving school will use this information to recommend the nearest training ground for you),),),Driver's license type (Driving school will provide you with the corresponding service based on this information can be provided to you). After obtaining your consent, we will share the above information with the driving school where you consult, so that the driving school will call you consultation services in time.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "When you use the \"Help Me Driving School\" service, you need to provide name, mobile phone number, location information, and driver's license type. We will share the above information with your consultation school after obtaining your consent, so that you can call you in time to contact you for you as a telephone school.You provide consulting services.Essence"}
{"task": "rw_21.jsonl", "id": 78249, "text": "The driving school and coach of the consultation will contact you through the virtual number or real mobile phone number we provide. If you contact you through the virtual number, we will record the whole process of the call to fully protect your information security and legal and legalrights and interests.", "label": ["Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "The driving school and coach of the consultation will contact you through the virtual or real mobile phone number we provide, and we will record the whole process of the call."}
{"task": "rw_21.jsonl", "id": 78250, "text": "At the same time, we will store your name, mobile phone number, and geographical location in order to help you automatically fill in the information next time. If you want to delete or correct your name and mobile phone number, click the delete button on the right side of the input box.", "label": ["Data Retention", "Important", "Edit/Control"], "rewrite": "Store your name, mobile phone number, and geographical location to help you fill in the information next time. If you want to delete or correct your name and mobile phone number, click the deletion button on the right side of the input box."}
{"task": "rw_21.jsonl", "id": 78251, "text": "When you use the \"buy car\" service provided by the driving test, when you have a car to inquire about the bottom price of the car, check the minimum transaction price, and check the price reduction information, you can provide all or part of the information based on voluntary, Intent models, gender, car purchase cities (We only collect the positioning information of your current area to locate your current car purchase city, you can also manually choose a car purchase city, we will record the city information you provideWill combine your urban positioning information to judge your whereabouts, location information, browsing records, and collection records. In order to provide you with the reserve price information of the corresponding model, we will provide your contact information to your intention dealers who are interested in your intentions.The dealer will provide you with the corresponding base price information consulting service.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "When you use the \"buy car\" service, you can provide information including name, mobile phone number, intention model, gender, car buying city and other information.We will provide your contact information to your intentional dealers, and it will provide you with a base price information consulting service."}
{"task": "rw_21.jsonl", "id": 78252, "text": "If you need to remove the input when you provide your name and mobile phone number, you can empty the input information on the right side of the input box.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78253, "text": "To provide you with a better use experience, we will fill in your username, mobile phone number and urban information according to your registered account information when you use your car buying service next time.", "label": ["Important", "Usage"], "rewrite": "When you use a car service next time, we will fill your username, mobile phone number and urban information according to your registered account information."}
{"task": "rw_21.jsonl", "id": 78254, "text": "If you need to withdraw the personal information you have provided, you can pass the 400-668-7027 customer service phone, or send an email to Privacy-Qiche@mucang.cn, apply for withdrawal and delete your personal information after verification by phone SMS, weAfter receiving your application, you will delete and inform the third parties of the receiving information in time to delete your personal information. The above work will be completed within 15 working days.", "label": ["Edit/Control", "Important"], "rewrite": "You can apply for the withdrawal and deleting your personal information by dialing 400-668-7027 customer service calls or sending emails to privacy-qiche@mucang.cn to apply after passing a mobile phone SMS verification."}
{"task": "rw_21.jsonl", "id": 78255, "text": "If you need to query and modify your personal information, or have any questions or complaints about the above services, you can also call customer service calls 400-056-1617 or send emails to Privacy-Qiche@mucang.cn.", "label": ["Important", "Edit/Control"], "rewrite": "If you need to query and modify your personal information, or have any questions or complaints about the above services, you can also call customer service calls 400-056-1617 or send emails to Privacy-Qiche@mucang.cn."}
{"task": "rw_21.jsonl", "id": 78256, "text": "When you use the driving test Baoxian to buy a car service, click on the car sources details page in the parallel import channel, which will jump to our group's applet page to display specific model -related information. This piece does not involve third -party applicationsJump, please know.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78257, "text": "(11) Binded coach and course service", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78258, "text": "Binding coach: If you choose to manually add coach binding, you need to provide the coach's name and mobile phone number to match the coach who has settled in the Kaokao Culture;", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78259, "text": "If you add coaches by binding driving schools or bind coaches through the coach's homepage, you need to provide your name or nickname.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you add coaches by binding driving schools or bind coaches through the coach's homepage, you need to provide your name or nickname."}
{"task": "rw_21.jsonl", "id": 78260, "text": "If you need to cancel the binding coach, you can start \"more\" on the upper right corner of your binding coach detail page and choose to lift the binding.", "label": ["Important", "Edit/Control"], "rewrite": "If you need to cancel the binding coach, you can start \"more\" on the upper right corner of your binding coach detail page and choose to lift the binding."}
{"task": "rw_21.jsonl", "id": 78261, "text": "After the binding is lifted, your registered account will no longer be associated with the coach.", "label": ["Important", "Edit/Control"], "rewrite": "After the binding is lifted, your registered account will no longer be associated with the coach."}
{"task": "rw_21.jsonl", "id": 78262, "text": "If you invite coaches outside the driving test, you need to provide the aforementioned personal information of the actual coach.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you invite coaches outside the driving test, you need to provide the aforementioned personal information of the actual coach."}
{"task": "rw_21.jsonl", "id": 78263, "text": "Once the invitation is completed, it is deemed that the actual coach also accepts this \"Privacy Policy\".", "label": ["Policy Change", "Important", "Risk"], "rewrite": "Once the invitation is completed, it is deemed that the actual coach also accepts this \"Privacy Policy\"."}
{"task": "rw_21.jsonl", "id": 78264, "text": "Therefore, before you invite settlement, you should ensure that you have obtained its authorization consent.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78265, "text": "Refusing to provide the above information will not be able to complete the binding coach, but it does not affect other services you use your driving test.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78266, "text": "Course: If you have already bound the coach who has settled in the Driving Test, when you take the initiative to initiate a class, you need to provide your personal name, mobile phone number, and course subject.Class information information, confirm the teaching course.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "You need to provide personal names, mobile phone numbers, and subjects to confirm the teaching course."}
{"task": "rw_21.jsonl", "id": 78267, "text": "The refusal to provide the above information will not be able to complete the appointment, but it does not affect other services you use your driving test.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78268, "text": "(12) Interactive advertisement", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78269, "text": "Action interaction: When you \"shake and shake\", \"shake and shake\", such as interactive or activity (such as interactive advertisements) depend on the development of action, we will use your sensor information (pure sensor data does not belong to individuals who do not belong to individuals.Information), to identify your movements, use it for activity, or show you the next interactive scenario.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We use your sensor information when you perform interactive or activities such as \"shaking\" and \"shaking\"."}
{"task": "rw_21.jsonl", "id": 78270, "text": "(13) Principal's mailbox", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78271, "text": "Note: Only when your login account is registered into the enterprise version of the driving school, it can be seen in the \"registration\" module.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78272, "text": "When the student feeds on the function of the principal's mailbox on the Dian Dian APP, it supports the user upload the picture. At this time, you need to apply for the image album authority of the mobile phone.", "label": ["Permission Acquisition", "Important"], "rewrite": "When the students feedback, support the user upload the pictures. At this time, you need to apply for a picture album authority for the use of your mobile phone."}
{"task": "rw_21.jsonl", "id": 78273, "text": "This is the basic information for students to feedback the opinions of car learning from driving schools. If you refuse to apply, you will not be able to upload picture information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78274, "text": "(14) Scan code training", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78275, "text": "Note: Only when your login account is registered into the enterprise version of the driving school, it can be seen in the \"registration\" module.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78276, "text": "When the students go to the \"sweeping\" function of the Bao Dian app, when they go to the code to scan the code, they need to judge the authenticity of learning cars through the location of the car and get out of the car. At this time, they need to apply for geographic location information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When the trainees go to the code to scan the car, they need to judge the authenticity of learning the car through the location of the car and get off the car. At this time, the geographical information is needed."}
{"task": "rw_21.jsonl", "id": 78277, "text": "This is the basis for determining whether the trainees are effective in scanning the car. If you refuse to apply, you will not be able to use the code to practice the car.", "label": ["Usage"], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78278, "text": "(15) Personalized recommendation", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78279, "text": "a. We will show or recommend the user's geographical information information to the user's geographical location information to recommend or recommend the correlation -related driving school recommendation and local driving information.", "label": ["Important", "Usage"], "rewrite": "For users' geographical location information, it shows that it is recommended or recommended to users with a higher degree of correlation and local driving information."}
{"task": "rw_21.jsonl", "id": 78280, "text": "If the user does not want to obtain our targeted information recommendation service, users can check and close the location (location information) system permissions in the \"Settings-Application-Permissions Management\" path of mobile phone devices. Closing the authority means that the authority means canceling the authorization.No longer recommended for geographical location.", "label": ["Important", "Edit/Control"], "rewrite": "Users can view and close the authority of the \"Settings-Application-Permissions Management\" path of the mobile phone device. Close the geographical location (location information) system permissions. Closing the authority means that the authority is canceled."}
{"task": "rw_21.jsonl", "id": 78281, "text": "You can also choose to close or open the receiving personalized recommendation through the path shown in the Bao Dian APP.", "label": ["Edit/Control", "Important"], "rewrite": "You can choose to close or open a receiving personalized recommendation through the path shown in the Bao Dian APP."}
{"task": "rw_21.jsonl", "id": 78282, "text": "Close the setting path is: [Driving Test Book APP]-[Mine]-[Settings]-[Privacy Settings]. You can click [Personalized Recommendation] button on the right side to close, and users can also choose to open in the shutdown state.", "label": ["Important", "Edit/Control"], "rewrite": "Close the personalized recommendation setting path: [Driving Test APP]-[Mine]-[Settings]-[Privacy Settings], you can click [Personalized Recommendation] to the right button on the right."}
{"task": "rw_21.jsonl", "id": 78283, "text": "b. Driving Test Book of \"Buying a Car\" Channel will recommend related models according to the historical history of the user's model.", "label": ["Important", "Usage"], "rewrite": "The \"buy car\" channel of the driving test will be browsed according to the historical history of the user's model, and the relevant models are recommended."}
{"task": "rw_21.jsonl", "id": 78284, "text": "If the user does not want to receive the recommended content or no longer use the personalized recommendation service for the time being, you can manage it through the various ways we provided: users can reduce the correlation of the recommendation by deleting historical browsing and record data information;", "label": ["Important", "Edit/Control"], "rewrite": "Users can reduce the correlation of recommendation by deleting historical browsing data information."}
{"task": "rw_21.jsonl", "id": 78285, "text": "Management through the function entrance in the APP, the management path is: [Driving Test APP]-[My]-[Settings]-[Privacy Settings].Users can also choose to open in the state.", "label": ["Important", "Edit/Control"], "rewrite": "[Driving Test APP]-[Mine]-[Settings]-[Privacy Settings], you can click [Personalized Recommendation] button on the right to close personalized recommendations."}
{"task": "rw_21.jsonl", "id": 78286, "text": "(16) Description of the use of mobile phone permissions", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78287, "text": "In particular, it is necessary to point out that even after your authorization, we have obtained these sensitive permissions, and we will not collect your information when related functions or services are not needed.", "label": ["Important", "First Party Collection Information"], "rewrite": "Even after your authorization, we have obtained these sensitive permissions, and will not collect your information when related functions or services are not needed."}
{"task": "rw_21.jsonl", "id": 78288, "text": "For details: \"Declaration of Driving Test Book of Driving Test\"", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78289, "text": "We will prompt you in advance when you download the app for the first time or use the above features one by one in the form of a separate pop -up window. You can choose according to your needs.", "label": ["Important", "Data Security"], "rewrite": "We will prompt you in advance when you download the app for the first time or use the above features one by one in the form of a separate pop -up window. You can choose according to your needs."}
{"task": "rw_21.jsonl", "id": 78290, "text": "You can check and close the authority of the above system in different device or system versions in the \"Settings-Application-Application-Right Management\" path. In different equipment or system versions, related views or operation paths and methods may be different. For details, please refer to the device and systemDeveloper's description or guidance, please pay attention.", "label": ["Important", "Edit/Control"], "rewrite": "You can check and close the system permissions in the \"Settings-Application-Power Management\" path of your device."}
{"task": "rw_21.jsonl", "id": 78291, "text": "After closing permissions, it will only affect the current function, but it does not affect the normal use of other functions of the driving test.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78292, "text": "Based on the effective protection of your information and on the basis of your consent, we will label the collection of your information to protect your information security.", "label": ["Important", "Data Security"], "rewrite": "We will label the collected information to protect your information security."}
{"task": "rw_21.jsonl", "id": 78293, "text": "Here I hope you understand and accept that you have the right to analyze and commercialize your information without disclosing your personal information.", "label": ["Important", "Usage"], "rewrite": "I hope you know and accept that you have the right to analyze and use the use of your information on your personal information without disclosing your personal information."}
{"task": "rw_21.jsonl", "id": 78294, "text": "1.2 Exceptions", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78295, "text": "Within the scope permitted by laws and regulations, we may collect your personal information in the following circumstances without requiring your authorization consent:", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Within the scope permitted by laws and regulations, we may collect your personal information in the following circumstances without requiring your authorization consent:"}
{"task": "rw_21.jsonl", "id": 78296, "text": "a), which is related to the obligation stipulated by the Personal Information Controller's Performance of Laws and Regulations;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The collection and usage information related to the obligations stipulated by the personal information controller fulfills the obligation of laws and regulations does not need to solicit authorization consent."}
{"task": "rw_21.jsonl", "id": 78297, "text": "b), directly related to national security and national defense security;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The collection and use information directly related to national security and national defense security does not need to solicit authorization consent."}
{"task": "rw_21.jsonl", "id": 78298, "text": "c) Directly related to public safety, public health, and major public interests;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The collection and use information directly related to public safety, public health, and major public interests does not need to solicit authorization consent."}
{"task": "rw_21.jsonl", "id": 78299, "text": "d), directly related to criminal investigation, prosecution, trial and judgment execution;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Direct related collection and use information such as criminal investigation, prosecution, trial, and execution of judgments does not need to solicit authorization consent."}
{"task": "rw_21.jsonl", "id": 78300, "text": "e), for maintaining major legitimate rights and interests such as the life and property of the subject of personal information or other individuals, but it is difficult to obtain the consent of my authority;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "For major legitimate legitimate rights and interests such as the main body of personal information or other individuals, but it is difficult to obtain the consent of my authorization, it does not need to solicit authorization consent."}
{"task": "rw_21.jsonl", "id": 78301, "text": "f), the personal information involved was made public to the public by the public;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The personal information involved is disclosed to the public by itself, and there is no need to solicit authorization consent."}
{"task": "rw_21.jsonl", "id": 78302, "text": "g), sign and perform the contract according to the requirements of the personal information subject;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The collection and use information necessary for signing and fulfilling the contract according to the requirements of the personal information subject does not need to solicit authorization consent."}
{"task": "rw_21.jsonl", "id": 78303, "text": "Note: The main function of personal information protection policy is to collect and use the scope and rules of personal information to disclose personal information controller, and it is not advisable to regard it as a contract.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78304, "text": "h), collect personal information from the legal and public information, such as legal news reports and government information disclosure;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If you collect personal information from the legal disclosure information, you do not need to solicit authorization consent."}
{"task": "rw_21.jsonl", "id": 78305, "text": "i), maintain the safe and stable operation of the products or services provided by the product or service, such as discovering and disposing of products or services;", "label": ["Risk", "Important", "First Party Collection Information", "Usage"], "rewrite": "Maintaining the collection and use information necessary for the safe and stable operation of the product or service, no need to solicit authorization consent."}
{"task": "rw_21.jsonl", "id": 78306, "text": "j), personal information controller is a news unit, and it is necessary to carry out legal news reports;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Personal information controller is a news unit, and the collection and use information necessary for legal news reports does not need to solicit authorization consent."}
{"task": "rw_21.jsonl", "id": 78307, "text": "K), personal information controller is an academic research institution, and the need to carry out statistics or academic research institutes for public interests, and when it provides academic research or description results, the personal information contained in the result isTreatment.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Personal information controller is an academic research institution, which is necessary to carry out statistics or academic research institutes for public interests, and when it provides academic research or description results, it is identified to identify the personal information contained in the result without soliciting solicitation.Authorized consent."}
{"task": "rw_21.jsonl", "id": 78308, "text": "We will do everything possible to adopt appropriate technical means to ensure that you can access, update, correct and delete your registration information or use other personal information provided when using our services.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78309, "text": "When visiting, updating, correcting, and deleting the aforementioned information, we may ask you to verify your identity to ensure account security.", "label": ["Important", "Data Security"], "rewrite": "When accessing, updating, correcting, and deleting information, we may ask you to verify your identity."}
{"task": "rw_21.jsonl", "id": 78310, "text": "1.3 How will we store your information", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78311, "text": "(1) Storage location", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78312, "text": "We will store your personal information in the territory of the People's Republic of China (including Hong Kong, Macao and Taiwan) in accordance with the provisions of laws and regulations.", "label": ["Data Retention", "Important"], "rewrite": "Your personal information is stored in the People's Republic of China (including Hong Kong, Macao and Taiwan)."}
{"task": "rw_21.jsonl", "id": 78313, "text": "Driving Test Books are evaluated and filing through national network security level protection (level 3).", "label": ["Important", "Data Security"], "rewrite": "Driving Test Books are evaluated and filing through national network security level protection (level 3)."}
{"task": "rw_21.jsonl", "id": 78314, "text": "If we need to store cross -border storage, we will implement strictly in accordance with the provisions of laws and regulations, and obtain your authorization consent alone;", "label": ["Data Retention", "Important", "Risk"], "rewrite": "Cross -border storage will be implemented strictly in accordance with the provisions of laws and regulations, and your authorization consent will be obtained separately."}
{"task": "rw_21.jsonl", "id": 78315, "text": "(2) Storage period", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78316, "text": "We will retain your personal information during the required and shortest period of the purpose of satisfying the product and service purposes, for example: when you use our registration and membership functions, we need to collect your mobile phone number, and after you provide itDuring your use of this function, we need to continue to save your mobile phone number to provide you with the function and ensure your account and system security normally.", "label": ["Data Retention", "Important"], "rewrite": "Keep your personal information for you to provide you with the necessary and shortest period of service purposes."}
{"task": "rw_21.jsonl", "id": 78317, "text": "In addition, we may have the necessary period of time for your membership transaction records, curriculum purchase records, and international driver's license orders to the necessary periods stipulated in the relevant laws (e.g. \"E -commerce Law\" stipulates that the time for the preservation of goods and service information and transaction information is completed from the transaction.No less than three years from the day).", "label": ["Data Retention", "Important"], "rewrite": "For your membership transaction records, curriculum purchase records, and international driver's license order records to be preserved to the necessary period stipulated by relevant laws."}
{"task": "rw_21.jsonl", "id": 78318, "text": "We will retain your personal information within the period for the purpose of providing our services. After exceeding the necessary period, we will delete or processes your personal information, but you ask us to immediately delete or cancel the account, which, or cancel the account,,, if you want to delete or cancel the account.Or except laws and regulations are otherwise stipulated.", "label": ["Data Retention", "Important"], "rewrite": "Keep your personal information during the period for providing service purposes. After exceeding the storage period, your personal information will be deleted or anonymous, except for other provisions of laws and regulations."}
{"task": "rw_21.jsonl", "id": 78319, "text": "2. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78320, "text": "(1) About Cookie and similar technologies", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78321, "text": "Cookie is a small file containing string. When you log in and use the website or other network content, you send and store in your computer, mobile device or other devices (usually encrypted).", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78322, "text": "Similar cookies are other technologies that can be used in similar uses as Cookie, including: Web Beacon, Proxy, Embedded Script.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78323, "text": "At present, we mainly use cookies to collect your personal information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Use cookies to collect your personal information."}
{"task": "rw_21.jsonl", "id": 78324, "text": "You know and agree that with the development of technology and the further improvement of our products and services, we may also use similar Cookie technology.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78325, "text": "(2) How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78326, "text": "When you use our products and/or services, we may use Cookie and similar technologies to collect some of your personal information, including: your habit of accessing the website, your login information, the information you must use when you use a car service service to buy a car service(Name, mobile phone number, city), Cookie and similar technologies collected this kind of information for your need to use our products and/or services, simplify your repeated operation steps (such as registration, login), and facilitate your viewing history (For example, watch history), provide you with the service content that is more interested in your personal needs and the content that you may be more interested in, protect your information and account security, and improve our products and services.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use our products and/or services, collect some of your personal information with Cookie and similar technologies to simplify operations and improve products."}
{"task": "rw_21.jsonl", "id": 78327, "text": "We promise to use cookies and similar technologies within the purpose of the \"Privacy Policy of the Driving Test\".", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78328, "text": "If your browser allows, you can reject Cookie and/or similar technologies through your browser settings, or delete the cookie and and other devices that have been stored in your computer, mobile devices or other devices./Or similar technologies, so that we cannot track your personal information all or partially.", "label": ["Important", "Edit/Control"], "rewrite": "You can manage, refuse cookies and/or similar technologies through the browser settings, or delete cookies and/or similar technologies that have been stored in your computer, mobile devices or other devices."}
{"task": "rw_21.jsonl", "id": 78329, "text": "If you need to learn more about how to change the browser settings in detail, please check the relevant setting page of your browser you use.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78330, "text": "You understand and know: some of our products and/or services can only be realized by using cookies or similar technologies. If you refuse to use or delete, you may not be able to use our related products and/or services or services or services normally.It is impossible to obtain the best service experience through our products and/or services, and it may also have a certain impact on your information protection and account security.", "label": ["Important", "Edit/Control"], "rewrite": "If you refuse to use or delete cookies, we may not be able to use our related products."}
{"task": "rw_21.jsonl", "id": 78331, "text": "3. How do we share, transfer, and publicly disclose personal information", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78332, "text": "3.1 How do we share information outside", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78333, "text": "3.1.1 Sharing Principles", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78334, "text": "We promise to strictly keep your information.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78335, "text": "In addition to laws and regulations and regulatory authorities, we only share your information with third parties in the following situations. Third parties include our affiliated companies, cooperative financial institutions, and other partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In addition to laws and regulations and regulatory authorities, we only share your information with third parties in the following situations."}
{"task": "rw_21.jsonl", "id": 78336, "text": "If you need to share your information to the third party in order to provide you, we will evaluate the legality, legitimacy, and necessity of the third -party collection information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "If you need to share your information to a third party, we will evaluate the legality, legitimacy, and necessity of the third party collection information."}
{"task": "rw_21.jsonl", "id": 78337, "text": "We will require third parties to take protection measures for your information and strictly abide by relevant laws and regulations and regulatory requirements.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will require third parties to take protection measures for your information and strictly abide by relevant laws and regulations and regulatory requirements."}
{"task": "rw_21.jsonl", "id": 78338, "text": "In addition, we will obtain your consent in accordance with the requirements of laws and regulations and national standards to confirm the agreement, the copywriting in the specific scenario, and the form of pop -up window prompts, or confirm that the third party has obtained your consent. Unless the shared individualInformation is an anonymous processing information, and a natural person subject to sharing third parties cannot recognize such information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Sharing information will obtain your consent or confirm that the third party has obtained your consent. Unless the shared personal information is an anonymous processing information, and sharing a third party's natural person who cannot re -identify such information."}
{"task": "rw_21.jsonl", "id": 78339, "text": "3.1.2 Business sharing", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78340, "text": "(1) Realize the sharing information of functions or services", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78341, "text": "Some products or services may be provided by a third party or shared by us and third parties. Therefore, only by sharing your information can we provide the products or services you need.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If products or services are provided or provided for third parties, we will share your information."}
{"task": "rw_21.jsonl", "id": 78342, "text": "a. Geographical location service: GPS information, WLAN access point, Bluetooth and base station sensor information.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78343, "text": "When you use geographical location related services, we will use SDK or related technologies to share GPS information and location service providers (Gaode Maps) in order to return to you.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When you use geographical location -related services, share with the location service provider (Gaode Map) so that you can return to you."}
{"task": "rw_21.jsonl", "id": 78344, "text": "GPS information is a personal sensitive information. It refuses to provide normal use that will only affect geographical location service functions, but does not affect other functions.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78345, "text": "b. Payment function: Payment function will provide you with a third -party payment institution that cooperates with us.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78346, "text": "Third -party payment institutions may need to collect your name, bank card type and card number, validity period and mobile phone number.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Third -party payment institutions may need to collect your name, bank card type and card number, validity period and mobile phone number."}
{"task": "rw_21.jsonl", "id": 78347, "text": "The bank card number, validity period, and mobile phone number are personal sensitive information. This information is an information necessary for payment functions. It refuses to provide normal use that will cause you to unable to use this function, but does not affect other functions.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78348, "text": "c. To adapt the message push function with the terminal model you use, we may share mobile phone models, versions and related equipment information through SDK technology and terminal equipment manufacturers (Huawei, Xiaomi, OPPO, Vivo).", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to adapt the message push function with the terminal model you use, share mobile phone models, versions and related equipment information with terminal equipment manufacturers."}
{"task": "rw_21.jsonl", "id": 78349, "text": "d. Service providers and other partners.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78350, "text": "When you use our specific service, we will send the information you fill in to the service provider you want to contact.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When you use our specific service, you will send the information you filled in to the service provider you want to contact."}
{"task": "rw_21.jsonl", "id": 78351, "text": "For example, when you apply for driving school on the Driving Test Platform, the name and mobile phone number you actively fill in and submitted, and we will provide you with the driving school you want to register after you submit.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78352, "text": "For example, when you want to obtain the \"base price\" of car source information on the Driving Test Platform, we will provide the mobile phone number you filled in to the dealer or automotive information service platform you displayed to the page display, in order to increase more high -quality dealers and manufacturersAnd the group provides you with a quotation. Auto information and service platforms (such as Knowing the Emperor, Car House, Yiche.com, and Driving Platform) will be able to coordinate their cooperation dealers, manufacturers and groups to offer you.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you want to obtain the \"base price\" of the car source information, we will provide the mobile phone number you filled in to the dealer or car information service platform displayed on the page display."}
{"task": "rw_21.jsonl", "id": 78353, "text": "e. Only by sharing your information can you provide your needs or handle disputes or disputes with others.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Only by sharing your information can you provide the service you need or deal with your disputes or disputes with others."}
{"task": "rw_21.jsonl", "id": 78354, "text": "For example, in a certain transaction you created at the driving test, if any party fulfills or partially fulfills the transaction obligations and submits information disclosure requests, the driving test will decide whether to provide the user's contact with the other party's contact based on the evidence situation.Methods, cooperate with the completion of the transaction or the resolution of disputes;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In a certain transaction you created at the driving test, if any party performs or partially fulfills the transaction obligations and submits information disclosure requests, the Driving Test Book will provide information to help the dispute resolution."}
{"task": "rw_21.jsonl", "id": 78355, "text": "f. You agree to submit personal information to third parties by clicking on the corresponding button of related products (including but not limited to, \"help me apply\" and \"help me submit\" keys).", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You agree to submit personal information to third parties by clicking on the corresponding button of related products."}
{"task": "rw_21.jsonl", "id": 78356, "text": "(2) Realizing advertising -related shared information", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78357, "text": "A. Advertising push: We may share information with partners who entrust us to promote and advertise.Identify the indirect portrait label and device information or anonymous information of your personal identity to help them increase the effective touch rate of advertising without identifying your personal identity.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We may share information that cannot identify personal identity with advertising partners, but will not share information that uses your personal identity."}
{"task": "rw_21.jsonl", "id": 78358, "text": "Among them, device information: We will receive and record the device -related information (including device models, operating system versions, device settings, MAC address and IMEI, IDFA, OAID deviceThe position related to the location of the equipment (including the GPS position and WL, AN access point, Bluetooth and base station sensor information) where the device is located.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will receive and record the equipment related information you use based on the specific operations of your access and/or use."}
{"task": "rw_21.jsonl", "id": 78359, "text": "Programmized advertising is one of the advertising display technology, and the advertisers make intelligent recommendations based on your preferences in its application.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78360, "text": "Driving Test Book only provides programmatic advertising docking technology, and will not obtain your behavior or personal data in other applications. You can choose to close or open a receiving programmatic advertisement through the following path:", "label": ["Important", "Edit/Control"], "rewrite": "Driving Test Book only provides programmatic advertising docking technology, and will not obtain your behavior or personal data in other applications."}
{"task": "rw_21.jsonl", "id": 78361, "text": "Close the setting path: \"Mine-Settings-Privacy and Permanent Settings-Procedural Advertising\", choose to close.", "label": ["Important", "Edit/Control"], "rewrite": "Through \"my  setting-privacy and permissions settings-programmatic advertisements\", choose to close programmatic advertisements."}
{"task": "rw_21.jsonl", "id": 78362, "text": "B. Advertising statistics: We may share the analysis of device information or statistical information (including VIP and current question bank types) with business service providers, suppliers and other partners.This information will help us analyze and measure the effectiveness of advertising and related services.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We may share and analyze de -identified equipment information or statistical information with business partners to help us analyze and measure the effectiveness of advertising and related services."}
{"task": "rw_21.jsonl", "id": 78363, "text": "(3) Help you participate in marketing promotion activities", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78364, "text": "If you choose to participate in the raffle, competition or similar promotional activities jointly carried out by us and third -party, we may have the information necessary to complete the activity during the sharing of the event, so that the third party can distribute prizes or provide you with you in time or provide you with youServices, we will clearly inform you what information you need to provide to the third party will be clearly informed on the activity page or through other channels in accordance with the requirements of laws and regulations or national standards.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you choose to participate in the promotion activities jointly organized by us and third -party, we may share the necessary information with them so that you can provide you with services or distribution prizes."}
{"task": "rw_21.jsonl", "id": 78365, "text": "You may need to provide name, communication address, contact information, and bank account information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78366, "text": "This information is personal sensitive information. It refuses to provide may affect your participation in related activities, but it will not affect the use of other functions.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78367, "text": "Only after your consent can we share this information with related parties or third parties to ensure that you have consistent services in the joint event, or entrust a third party to reward you in time.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will share the information with the third party with your consent so that you can get the same services in the joint event, or entrust a third party to fulfill you in time."}
{"task": "rw_21.jsonl", "id": 78368, "text": "(4) Sharing information of safety and analysis statistics", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78369, "text": "a. Safety use security: We attach great importance to accounts and service security. In order to ensure the security of your and other users' accounts and property security, so that you and our legitimate rights and interests are exempted from illegal violations.The service log information and our related parties and partners are obtained by obtaining the information that you can share or shared in accordance with the law to judge the security of the account, verify, test and prevent security incidents.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security", "Usage"], "rewrite": "We may use your account information, device information, service log information, and information that you can share that can be shared to determine account security, conduct authentication, test and prevent security incidents."}
{"task": "rw_21.jsonl", "id": 78370, "text": "b. Analysis of product usage: In order to analyze the use of our services and enhance the experience of user use, it may be dealerized data with related parties or third -party sharing products (collapse, flashback, and duration).It is difficult to combine your personal identity with other information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "In order to analyze the usage of our services and enhance the experience of user use, it may be identified as the use of related parties or third -party shared products."}
{"task": "rw_21.jsonl", "id": 78371, "text": "(5) In the case of obtaining your clear consent in advance, we will share your information with third parties within the scope of your authorization without violation of the scope of public order and good customs.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the case of getting your clear consent in advance, share your information with a third party based on your authorization scope."}
{"task": "rw_21.jsonl", "id": 78372, "text": "In order to ensure the realization of the functions of the Dianbian APP -related functions and the safe and stable operation of the application, we may access the relevant purpose of the software development package (SDK) provided by a third party.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may access the software development package (SDK) provided by a third party to achieve relevant purposes."}
{"task": "rw_21.jsonl", "id": 78373, "text": "We will strictly monitor the software tool development package (SDK) that the partner obtains information to protect data security.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will strictly monitor the software tool development packs obtained by the partner to obtain information to protect data security."}
{"task": "rw_21.jsonl", "id": 78374, "text": "We are listed in the directory of related third -party SDKs.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78375, "text": "Please note that the third -party SDK may change the type of data processing due to its version upgrade and strategic adjustment. Please refer to the official explanation of its publicity.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78376, "text": "Third -party SDK directory", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78377, "text": "Gaode Map SDK (Gaode 3D Map SDK), provider: Gaode Software Co., Ltd., uses the purpose: used to show maps, draw bus routes, and test room routes.The operating system version, equipment brand and model, equipment configuration, operator type, application information (application name, application version number), official website link: https://lbs.amap.com, privacy policy: https://lbs.amap.com/home/privacy", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Gaode Map SDK collects location information, equipment information, MAC address, etc., used to show maps, draw shuttle bus routes, and test room routes."}
{"task": "rw_21.jsonl", "id": 78378, "text": "Gaode Positioning SDK, provider: Gaode Software Co., Ltd., the purpose of use: used to achieve positioning, to provide users with local question banks and local driving schools.The operating system version, equipment brand and model, equipment configuration, operator type, application information (application name, application version number), official website link: https://lbs.amap.com, privacy policy: https://lbs.amap.com/home/privacy", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Gaode Positioning SDK collects your location information, device information, MAC address, etc., used to achieve positioning, providing users with local question banks and local driving schools."}
{"task": "rw_21.jsonl", "id": 78379, "text": "Gaode Map Search SDK (Gaode Search function, SDK), provider: Gaode Software Co., Ltd., uses the purpose: used to achieve map positioning and provide users with local question banks and user local driving schools.Data type: location information (GNSS information, IP address, WLAN hotspot, base station information, Bluetooth equipment, and other sensor information that can be used for positioning), device information (IDFV, OAID, IMEI, MEID, IMSI, etc.), MAC address, operationSystem version, equipment brand and model, equipment configuration, operator type, application information (application name, application version number), official website link: https://lbs.amap.com, privacy policy: https://lbs.amap.com/home/privacy", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Gaode Map Search SDK to collect your location information, equipment information, MAC addresses, etc., to achieve map positioning, providing users with local question banks and user local driving schools."}
{"task": "rw_21.jsonl", "id": 78380, "text": "Gaode Navigation, SDK, provider: Gaode Software Co., Ltd., the purpose of uses: used to achieve map positioning, providing users with local question banks, user local driving schools, and drawing routes.The operating system version, equipment brand and model, equipment configuration, operator type, application information (application name, application version number), official website link: https://lbs.amap.com, privacy policy: https://lbs.amap.com/home/privacy", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Gaode Navigation SDK collects your location information, device information, MAC addresses, etc., to achieve map positioning, providing users with local question banks and local driving schools."}
{"task": "rw_21.jsonl", "id": 78381, "text": "Gaode 3D, map, SDK, provider: Gaode Software Co., Ltd., uses the purpose: for the realization of map positioning, to provide users with local question banks, users' local driving schools, and draw bus routes.The operating system version, equipment brand and model, equipment configuration, operator type, application information (application name, application version number), official website link: https://lbs.amap.com, privacy policy: https://lbs.amap.com/home/privacy", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Gaode 3D map SDK collects your location information, device information, MAC addresses, etc., to achieve map positioning, providing users with local question banks and user local driving schools."}
{"task": "rw_21.jsonl", "id": 78382, "text": "Alipay (Alipay), SDK, (Alipay Payment, SDK), Objective: Propher the Alipay APP to complete payment, data type: network access, obtain WIFI state, read phone status, write external storage, device logo information [MAC address information information [MAC address information information, IMEI, IMSI, OAID, Android, ID, CPU, ID, serial number, openuuid, (iOS)], official website link: https://docs.open.alipay.com/54, privacy policy: https:////render.alipay.com/p/c/k2h4n8ug", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Alipay pays SDK to obtain network access, obtain WIFI status, read phone status, write external storage, device logo information to evoke the Alipay APP to complete the payment."}
{"task": "rw_21.jsonl", "id": 78383, "text": "WeChat Open Platform, SDK, (WeChat, SDK), Objectives: Third -party login, evoking WeChat APP to complete payment, application sharing, application invitation, data type: online access, obtain WIFI state, read phone status, write external storage outside storage, Device logo information [MAC address information, IMEI, IMSI, OAID, Android, ID, CPU, ID, serial number, openuuid, (iOS)], official website link: https://open.weixin.qq.com, privacy, privacyPolicies: https://mp.weixin.qq.com/cgi-bin/announdce?Action = Getannoundment & Key = 1503979103 & Version = 1 & Lang = zh_cn & Platform = 2", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "WeChat SDK obtains network access, obtains WIFI status, reads phone status, writes external storage, device logo information to evoke the WeChat APP to complete the payment."}
{"task": "rw_21.jsonl", "id": 78384, "text": "Share on Weibo, SDK (Sina Weibo, SDK, Weibo, SSO, Authorized, SDK, Weibo Open Platform, SDK), Objectives: Weibo, Application Sharing, Application Invitation, Data Type: Online Access, Get WIFI, get wifiStatus, read phone status, write external storage, read external storage, official website link: https://open.weibo.com/wiki/android_sdk%E8%AF%B4%E68%8E6%96%87%e6%a1%A3, Privacy Policy: https://open.weibo.com/wiki/%E5%BC%80%91%8PAE%AE#.e9.9a.90.E7.8.81.e7.9b.b8.e5.85.b3.9d.a1.e6.ac.be", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Share SDK to get online access, obtain WIFI status, read the phone status, write external storage, read external storage for online recording, application sharing, application invitation."}
{"task": "rw_21.jsonl", "id": 78385, "text": "Xiaomi PUSH (Xiaomi open platform message push, SDK, Xiaomi push SDK), use purpose: push message, involved permissions: network access, writing external storage, reading external storage, obtaining WIFI status, reading phone status, mobile phone vibration, mobile phone vibration, mobile phone vibration, mobile phone vibration, mobile phone vibration, mobile phone vibration, mobile phone vibration, mobile phone vibration, mobile phone vibration, mobile phone vibration, mobile phone vibration, mobile phone vibration, mobile phone vibration, mobile phone vibration, mobile phone vibration, mobile phone vibration, mobile phone vibration, mobile phone vibration, mobile phone vibration, mobile phone vibration, mobile phone vibration, mobile phone vibration, mobile phone vibration, mobile phone vibration,Data type: Equipment identification (OAID), encrypted Android, ID, device -related information [such as equipment manufacturers, equipment models, equipment memory, operating system versions, Xiaomi push SDK version, equipment belonging (country or region), SIM card operations operationThe business name, the current network type (the current network type, the name of the SIM card operator are only read locally in the device, will not be uploaded to the Xiaomi server)], official website link: https://dev.mi.com/console/appservice/push.html, privacy policy: https://dev.mi.com/console/doc/detail? PID = 1822", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Xiaomi PUSH obtains network access, write external storage, read external storage, etc. for push messages."}
{"task": "rw_21.jsonl", "id": 78386, "text": ", CPU, ID, serial number, OPENUUID, (iOS)], write external storage, read external storage, official website link: https://push.vivo.com.cn, privacy policy: https://dev.vivo.com.cn/documentcenter/doc/366#w1-08512613", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Vivo Push obtains online access, operator information, equipment logo information, etc. for push messages."}
{"task": "rw_21.jsonl", "id": 78387, "text": ", CPU, ID, serial number, OPENUUUID, (iOS)], official website link: https://push.oppo.com, privacy policy: https://open.oppomobile.com/wiki/doc#id=1028888", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "OPPO PUSH obtains online access, operator information, device logo information for push messages."}
{"task": "rw_21.jsonl", "id": 78388, "text": ", OpenDevice, Huawei, HMF, TASKS, Huawei Dynamic, Ability, SDK, Huawei LOG, SDK, Huawei Update, SDK, Huawei Advertising Service SDK, Huawei scan code SDK, data type: network visit, operator information information information, equipment identification information information[MAC address information, IMEI, IMSI, OAID, Android, ID, CPU, ID, serial number, Openuuid, (iOS)], write external storage, read external storage, obtain WIFI state, read phone status, official website status, the official website, the official website, the official website, the official websiteLink: https: //developer.huawei.com/consumer/cn/hms/huawei-pushkit, privacy policy: https: //consumer.huawei.com/cn/service-Privacy-notice", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Huawei PUSH is written into external storage, reads external storage, obtained WIFI status, and reads phone status for pushing messages."}
{"task": "rw_21.jsonl", "id": 78389, "text": "Mobile one -click login, (China Mobile Number Certification, SDK), Objective: Implement the \"One -click Login\" function, data type: network access, mobile phone number, device recognition code [MAC address information, IMEI, IMSI, oAID, Android,, android,IP address, device logo information, official website link: http://dev.10086.cn, privacy policy: http://dev.10086.cn/docinside? Contentid = 10000009826805", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "China Mobile Number Authentication SDK obtains network access, mobile phone numbers, device recognition codes, etc., to achieve the \"one -click login\" function."}
{"task": "rw_21.jsonl", "id": 78390, "text": "Unicom one -click login, use the purpose: realize the \"one -click login\" function, data type: network access, mobile phone number, network type, screen size, IP address, device logo information [MAC address information, IMEI, IMSI, oAID, Android,, Android,, android,,, android, Android, android, android, android, android, android, android, android, Android, android, android, android, android,ID,, CPU, ID, serial number, openuuid, (iOS)], official website link: https://cuopen.10010.com, privacy policy: https://cuopen.10010.com/guide- yunshilian_privacy", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Unicom one -click to obtain online access, mobile phone number, network type, screen size, IP address, device identification information, which is used to achieve the \"one -click login\" function."}
{"task": "rw_21.jsonl", "id": 78391, "text": "Telecom one -click login, (China Telecom Tianyi Number Certification, SDK), Objectives: Implement the \"One -click Login\" function, data type: network access, mobile phone number, device recognition code [MAC address information, IMEI, IMSI, oAID, Android, Android, ID,, CPU, ID, serial number, openuuid, (iOS)], media access control address (MAC), device model, device manufacturer, network type and WiFi strong, mobile operating system, device logo information, official website link link: Http://id.189.cn, privacy policy: http://id.189.cn/api? Initialsrc =/html/api_detail_109.html", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "China Telecom Tianyi Number Certification SDK obtains network access, mobile phone number, device recognition code, etc., to achieve the \"one -click login\" function."}
{"task": "rw_21.jsonl", "id": 78392, "text": "Pangolon SDK (byte beating advertisement SDK, today's headline advertising SDK), there is a SDK introduced: byte beating SDK, byte beating Utility, SDK, purpose: use to obtain advertisements, data type: online access, device logo information [Device logo [Get WIFI status, read phone status, write external storage, obtain software application list, official website link: https://ad.ocenengine.com/pages/login/index.html, privacy policy: https://ad.ocenangine.com/union/media/privacy", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Pangolon SDK obtains online access, device logo information, geographical location information, etc. for advertising."}
{"task": "rw_21.jsonl", "id": 78393, "text": "Baidu Alliance SDK (Baidu Advertising SDK, Baidu Advertising Alliance Mobile Edition, SDK), from SDK introduced: Baidu Mobile Statistics Application Analysis (Manual Buried Point) SDK, Objectives: Used to obtain advertising, data type: network access, device identificationInformation [MAC address information, IMEI, IMSI, OAID, Android, ID, CPU, ID, serial number, openuuid, (iOS)], geographical location information (read accurate location, read rough positions), official website link: https: https: //union.baidu.com, privacy policy: https://nion.baidu.com/bqt#/policies", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Baidu Alliance SDK obtains online access, device logo information, geographical location information for advertising."}
{"task": "rw_21.jsonl", "id": 78394, "text": "Android, ID, CPU, ID, serial number, openuuid, (iOS)], write external storage, read external storage, official website link: https://bugly.qq.com/v2, privacy policy: https://privacy.qq.com/document/preview/fc748b3d96224fdb825EA79E13C1A56", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Tencent Bugly SDK obtains network access, obtain WIFI status, read phone status, read logs, device logo information, etc., for reporting and operating statistics for abnormalities, collapsed data."}
{"task": "rw_21.jsonl", "id": 78395, "text": "Mobile Security Alliance SDK, (MSA, Mobile Security Alliance, SDK), so SDK introduces: Lenovo-opendeviceid, SDK, uses: advertising monitorInformation, IMEI, IMSI, OAID, Android, ID, CPU, ID, serial number, openuuid, (iOS)], official website link: http://www.msa- alliance.cn", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "The mobile security alliance SDK obtains network access, device logo information, etc., for advertising monitoring, providing anonymous advertising identification symbols."}
{"task": "rw_21.jsonl", "id": 78396, "text": "Tencent Excellence SDK (Tencent Guangxian Tong Advertising SDK), from this SDK introduced: Tencent wide -point/excellent exchange line is data reported on Android, SDK, Tencent Mobile Open Platform SDK.: Network access, device logo information [MAC address information, IMEI, IMSI, OAID, Android, ID, CPU, ID, serial number, openuuid, (iOS)], geographical location information (read precise position, read rough positions, read rough positions), Online access, obtaining wifi status, official website link: https://adnet.qq.com, privacy policy: https://qzs.gdtimg.com/union/res/union_cdn/dev_rules/ylh_privacy_statement.h TML", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Tencent's excellent exchange SDK obtains network access, equipment logo information, etc. for advertising."}
{"task": "rw_21.jsonl", "id": 78397, "text": "Tencent Cloud, Mobile Live, SDK, this SDK is introduced by excellent exchange SDK (Tencent Guangxian Point Advertising SDK), introduced, and the purpose of use: The Tencent Cloud Mobile Live SDK is used to play video playback in a third -party ad.;, Data type: network access, recording, viewing network status, accessing the network, reading external storage, writing of external storage, network access, account information, device logo information [MAC address information, IMEI, IMSI, oAID, Android, ID, ID, ID, ID, ID, ID, ID, ID, ID, ID, ID, ID, ID, ID, ID, ID, ID, ID, ID, ID, ID, ID, ID, ID, ID, ID, ID, ID, ID, ID, ID, ID, ID, ID, ID, CPU, ID, serial number], official website link: https://cloud.tencent.com/document/product/454, privacy policy: https://cloud.tendent.com/document/301/11470", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Tencent Guangdong Advertising SDK obtains network access, recording, viewing network status, access network, etc., and video playback in third -party advertisements used for launch."}
{"task": "rw_21.jsonl", "id": 78398, "text": "Baidu voice synthesis SDK, uses the purpose: for voice synthesis, light simulation voice instructions, data type: network access, recording, viewing network status, access to the network, writing external storage, reading external storage, official website link: https: //cloud.baidu.com/product/speech/tts, privacy policy: https://cloud.baidu.com/doc/agreements/s/kjwvy245m", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Baidu voice synthetic SDK needs to obtain network access, recording, viewing network status, accessing the network, and writing external storage permissions."}
{"task": "rw_21.jsonl", "id": 78399, "text": "OpenInstall, use the purpose: obtain the source of promotion, identify the installation channel, data type: network access, device logo information [MAC address information, IMEI, IMSI, OAID, Android, ID, CPU, ID, serial number, (iOS), (iOS), (iOS)Policies: https://www.openinstall.io/doc/rules.html", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "OpenInstall obtains network access, device logo information, cutting board access, reading external storage, writing to external storage, to obtain the source of promotion, and identify the installation channel."}
{"task": "rw_21.jsonl", "id": 78400, "text": "NetEase Yidun, uses the purpose: used to verify login, data type: network access, device logo information [MAC address information, IMEI, IMSI, OAID, Android, ID, CPU, ID, serial number, (iOS)], Visit the network, access the network status, official website link: https://corp.163.com, privacy policy: https://corp.163.com/gb/legal.htmlsmlsisis", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Netease Yidun obtain equipment identification information, access the network and access network status, and is used to verify login."}
{"task": "rw_21.jsonl", "id": 78401, "text": "Alibaba Cloud One -click Login (Alibaba Cloud Number Certification Service), Objectives: Used for one -click login and verification whether the mobile phone number is this machine number, data type: network access, device logo information [MAC address information, IMEI, IMSI, IMSI,OAID, Android, ID, CPU, ID, serial number, Openuuid, (iOS)], access the network, access the network shape, official website link: https://www.aliyun.com, privacy policy: http:// terms.Aliyun.com/legal-Agreement/terms/suit_bu_ali_cloud/suit_bu1_ali_cloud201902141711_54837.html?spm=5176.19720258.j_9220772140.88.3 8EF2C4AGF4W2V", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Alibaba Cloud One -click login, obtaining equipment logo information, accessing the network, accessing the network shape, for one -click login and checking whether the mobile phone number is the machine number."}
{"task": "rw_21.jsonl", "id": 78402, "text": "QQ (Tencent Mobile Open Platform, SDK), Objectives: QQ login, application sharing, application invitation, data type: online access, obtain WIFI status, read phone status, write external storage, read external storage, device logo information[MAC address information, IMEI, IMSI, OAID, Android, ID, CPU, ID, serial number, openuuid, (iOS)], official website link: https: //www.qq.com, privacy policy: https: //www.qq.com/yszc-m.htm", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Tencent Mobile Open Platform SDK obtains WIFI status, read the phone status, write external storage, read external storage, device logo information, for QQ login, application sharing, and application invitation."}
{"task": "rw_21.jsonl", "id": 78403, "text": "  Reinforcement (-), uses the purpose: strengthen the app code, it is not easy to be compiled, cracked, data type: none, official website link: https://www.bangcle.com, privacy policy: https:: https:: https://passport.bangcle.com/authcenter/users/agreement", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "It is not easy to be compiled and cracking for reinforcing the APP code."}
{"task": "rw_21.jsonl", "id": 78404, "text": "Ali's device logo, SDK, purpose: Get the device ID, and find specific devices in facilitating the application of the application safely and effectively. Data type: online access, obtaining WIFI status, reading phone status, reading log, device logo information [MAC address information, IMEI, IMSI, OAID, Android, ID, CPU, ID, serial number, openuuid, (iOS)], read external storage, write external storage, official website link: https://help.aliyun.com, privacyPolicies: http://terms.aliyun.com/legal-Agreement/suit_bu1_ali_cloud/suit_bu1_ali_cloud2019021711_54837.html? SPM = A2c4g.1118662333333333333 .2.6.d96a123EZCMBFY", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Ali's device logo SDK obtains WIFI status, read phone status, read logs, device logo information, etc. to obtain device IDs and find specific devices safely and effectively."}
{"task": "rw_21.jsonl", "id": 78405, "text": "Alibaba Cloud Intelligent Voice Interaction, SDK (Alibaba Cloud Equipment end voice interaction NUI, SDK, Alibaba Cloud Intelligent Voice Interaction NLS, SDK), uses: for voice synthesis, lighting simulation voice instructions; data type: online access, recording, recording, recording, recording, recording, recording, recording, recording, recording, recording, recording, recording, recording, recording, recording, recording, recording, recording, recording, recording, recording, recording, recording, recording, recording, recording, recording, recording, recording, recording, recording, recording, recording, recording, recording, recording, recording, recording, recording, recording, recording, recording, recording, recording, recording, recording, recording, recording, recording, recording, recording, recording, recording, recording, recording, recording, recording, recording, recording, recording,.View network status, access the network, read external storage, write to external storage, official website link: https: //ai.aliyun.com/nls?", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Alibaba Cloud Intelligent Voice Interaction SDK View network status, access the network, read external storage, and write external storage, for voice synthesis, lighting simulation voice instructions."}
{"task": "rw_21.jsonl", "id": 78406, "text": "SPM = 5176.10695662.1157759.1.3D705AA0UNHIYW Privacy Policy: http://terms.aliyun.com/legal-Agreement/suit_bu1_ali_bu1_ali_clo UD201902141711_54837.html? SPM = A2C4G.1186623.j_9220772140.83.6C0F4B54CIPACC", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78407, "text": "Ali Mobile API, gateway, SDK, purpose: make the user app network more secure and reliable.Data type: network access, recording, viewing network status, accessing the network, reading external storage, writing to external storage, network access, account information, device identification information [MAC address information, IMEI, IMSI, oAID, Android, ID, ID, ID, ID, ID, ID, ID, ID, ID, ID, ID, ID, ID, ID, ID, ID, ID, ID, ID, ID, ID, ID, ID, ID, ID, ID, ID, id, ID, id, ID, id, ID, id, ID, id, ID, id, ID, id, ID, ID, id, ID, id, ID, ID, id, ID, id, ID, id, ID, ID, id, ID, id, ID, ID, ID, CPU, ID, serial number], official website link: https://www.aliyun.com, privacy policy: http://terms.aliyun.com/legal-Agreement/suit_bu1_ali_bu1_ali_cloud 201902141711_54837.html?", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Ali Mobile API gateway SDK views network status, access to the network, reads external storage, write external storage, network access, account information, and device identification information to make the user APP's network more secure and reliable."}
{"task": "rw_21.jsonl", "id": 78408, "text": "spm=a2c4g.11186623.J_9220772140.83.6c0f4b54cipacc", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78409, "text": "Unity3D, SDK, purpose: Run the three 3D simulation cars.Data type: network access, viewing network status, accessing the network, reading external storage, writing to external storage, network access, account information, device logo information [MAC address information, IMEI, IMSI, OAID, Android, ID, CPU, CPU, CPU, ID, serial number], official website link: https: //unity.cn, privacy policy: https: //unity.cn/legal/china-privacy-policy", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "UNITY3D SDK views network status, access to the network, reads external storage, writes external storage, network access, account information, and equipment identification information to run the three 3D simulation cars of the subject two subjects."}
{"task": "rw_21.jsonl", "id": 78410, "text": "CC, video, SDK (obtaining scene video cloud live broadcast), purpose: play teaching video, data type: device -related information (such as equipment model, operating system version, unique device identifier and other software and hardware characteristics information), the location of the device is locatedRelated information (for example: IP address), the way and types of device access networks (such as: wifi, 4G network, etc.) ;, official website link: https://www.box, privacy policy: https: // www.bokecc.com/Class/140", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "CC video SDK obtains the relevant information of equipment, the relevant information of the device, and the method and type of equipment access to the network to play teaching videos."}
{"task": "rw_21.jsonl", "id": 78411, "text": "Baidu cloud push, SDK, purpose: push message, data type: network access, viewing network status, accessing the network, reading external storage, writing to external storage, network access, account information, device logo information [MAC address information, IMEI, IMEI, IMSI, OAID, Android, ID, CPU, ID, serial number], official website link: http://push.baidu.com, privacy policy: http://push.baidu.com/doc/guide/baidu_legal", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Baidu Cloud Push SDK to view network status, access the network, read external storage, write external storage, network access, account information, equipment identification information to push the message."}
{"task": "rw_21.jsonl", "id": 78412, "text": "Tencent Cloud Instant Communication IM, SDK, Objectives: Introduced by excellent exchange SDK (Tencent Guangdian SDK) to obtain advertising; data types: online access, viewing network status, access to the network, writing external storage, reading, readingTake external storage, network access, account information, equipment logo information [MAC address information, IMEI, IMSI, OAID, Android, ID, CPU, ID, serial number], official website link: https://cloud.tencent.com/document/product/269/42440, privacy policy: https: //Cloud.tencent.com/document/product/301/11470", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Tencent Cloud Instant Communication IM SDK View network status, access to the network, write external storage, read external storage, network access, account information, and equipment identification information to obtain advertising."}
{"task": "rw_21.jsonl", "id": 78413, "text": "ZXING QR code scanning, uses the purpose: used to provide QR code scanning function;, data type: album, photos taken, official website link: https://github.com/zxing/zxing, (this website is an overseas website,May not be able to access directly), privacy policy: https://github.com/zxing/zxing, (this website is an overseas website, may not be directly accessed)", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "ZXING QR code scanning obtains the photo album and taken to provide the QR code scanning function."}
{"task": "rw_21.jsonl", "id": 78414, "text": "Chromium, the purpose of use: auxiliary development; data type: device version, IMSI, device application installation list, network equipment manufacturer, MAC address, network operator, WIFI information, location information, mobile phone manufacturers, SSID, BSSID, IMeiOfficial website link: https://www.chromium.org, (the website is an overseas website, may not be able to access it directly), privacy policy: https://policies.google.com/privacy, (this website is an overseas website, it may not be impossibledirect interview)", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Chromium obtains equipment version, IMSI, equipment application installation list, network equipment manufacturer, MAC address, network operator, etc., for assisting development."}
{"task": "rw_21.jsonl", "id": 78415, "text": "Google (Google), the purpose of using: auxiliary development, data analysis;, data type: none, official website link: https://www.google.com, (this website is an overseas website, may not be directly accessed), privacy policy: https: //Policies.google.com/? HL = zh, (This website is an overseas website, it may not be able to access it directly)", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Google is used to assist development and data analysis."}
{"task": "rw_21.jsonl", "id": 78416, "text": "Glide picture loaded, uses the purpose: auxiliary development; data type: none, the official website link: https://www.google.com, (this website is an overseas website, may not be able to access directly), privacy policy: https: // policies.Google.com/?hl=zh, (This website is an overseas website, it may not be able to access it directly)", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Glide picture is loaded to assist development."}
{"task": "rw_21.jsonl", "id": 78417, "text": "Apache, purpose: Auxiliary development; data type: None, official website link: https://httpd.apache.org, (this website is an overseas website, may not be directly accessed), privacy policy: https://httpd.apache.org/security_report.html, (the website is an overseas website, it may not be able to access it directly)", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Apache is used to assist development."}
{"task": "rw_21.jsonl", "id": 78418, "text": "Wisdom tooth SDK (SDK, SDK, SDK,) Objective: Provide online customer service -related support; data type: camera, album, microphone, clipboard (only Android terminal), read and write storage space (only Android), official website link: https:///www.sobot.com, privacy policy: https://www.sobot.com/clause.html", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Wisdom tooth SDK obtains the permissions of cameras, albums, microphones, and clipboards to provide online customer service related support."}
{"task": "rw_21.jsonl", "id": 78419, "text": "Kuaishou League (fast -handed advertising SDK), purpose: use for advertising, advertising attribution, data type: basic information (device brand, equipment model, software system version, storage information, operator information, equipment time zone, equipment language, network, networkBasic information such as information), device logo (IMEI, MEID, OAID ,, Androidld, IMSI, ICCID), location information (IP address, MAC address, GPS location information, base station information, WIFI information), application information (application installation list)) (application installation list)), Other information (sensor information, SIM card living information), current running program, official website link: https://u.kuaishou.com, privacy policy: https://u.kuaishou.com/home/detail/1290", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Quick -handed advertising SDK obtains basic information, equipment logo, location information, application information, other information, for advertising and advertising attribution."}
{"task": "rw_21.jsonl", "id": 78420, "text": "Torch SDK (currently only the Android client is connected), thereby introduced SDK: volcanic engine, Encryptor, encrypted components, volcanic engines, OneKit, SDK, volcanic engine/byte beating RangersApplog, SDK, volcanic engine/byte beating, volcanic engine/byte beating, byte beating, byte jump,Basic information such as screen resolution), application information (developer application name, application package name, version number and other information), other information (the behavior information of your end user on related content), official website link: https://www.volcengine.com, privacy policy: https://www.volcengine.com/docs/6392/67593", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Torch SDK collects equipment information, application information, and other information for content recommendation and analysis."}
{"task": "rw_21.jsonl", "id": 78421, "text": "Toronto -growth marketing kit SDK (currently only the Android client is connected), there is a SDK introduced: volcanic engine, ENCRYPTOR, encrypted components, volcanic engines, OneKit, SDK, volcanic engine/byte jump RangersApplog, SDK, volcanic engine/character/characterJumping, risk control sub -library SDK, volcanic engine Android on -demand SDK, volcanic engine APMINSIGHT stability monitoring component, uses: data analysis, cross -APP identification device, generating device unique identification ID, data type: equipment brand, model, software systemScreen density, official website link: htps://www.volcengine.com, privacy policy: https://www.volcengine.com/docs/6285/72216", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Toronto -growth marketing kit SDK collection equipment brand, model, software system version related information, etc. It is used for data analysis, cross -APP identification device, and generating the unique identification ID of the device."}
{"task": "rw_21.jsonl", "id": 78422, "text": "Android (Android, SUPPORT, Library, Compat, Android, Open, Source, Project), purpose: Auxiliary development, data type: write external storage, read external storage: https://www.android.com((This website is an overseas website, it may not be able to access it directly.) Privacy policy: https://policies.google.com/? HL = zh, (the website is an overseas website, it may not be able to access it directly)", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Android obtains writing external storage and read external storage permissions for assisting development."}
{"task": "rw_21.jsonl", "id": 78423, "text": "ExoPlayer, use the purpose: for playing video, data type: read phone status, official website link: https://exoplayer.dev, (this website is an overseas website, may not be directly accessed), privacy policy: https: // github.com/Google/EXOPLAYER, (This website is an overseas website, it may not be able to access it directly)", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "EXOPLAYER read the phone status for playing videos."}
{"task": "rw_21.jsonl", "id": 78424, "text": "Information collection frequency publicity form information Name: IMEI uses: safe operation and risk verification, content recommendation scenarios: APP safe operation and risk verification, security prevention, prevention or prohibition of illegal activities, reducing risks; display or recommendation correlation to users moreHigh content or advertisement Main entity: current app, byte beating SDK, Tencent Bugly collection frequency (premise of normal use and browsing APP): up to 8 times/minute", "label": ["Usage"], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78425, "text": "Information Name: IP address Division: Security operation and risk verification, content recommendation Scene: APP safe operation and risk verification, security prevention, prevent or prohibit illegal activities, reduce risks; display or recommend content with higher levels of correlation or recommendationCollect the main body during advertisements: the current app, byte beating SDK, fast -handed advertising SDK collection frequency (premise of normal use and viewing app): up to 38 times/minute high -frequency collection Reason: One -click login service provider and operators based on security considerations based on security considerationsIt may be more frequent to collect IP address information to ensure user account security.", "label": ["Usage"], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78426, "text": "Information name: Read the purpose of external storage (only Android device): safe operation and risk verification and use scenario: APP safe operation and risk verification, security prevention, prevent or prohibit illegal activities, reduce risk collection main body: Ali's equipment logo SDK, OpenInstall SDK, OpenInstallSDK collection frequency (premise for normal use and browsing APP): up to 8 times/minute", "label": ["Usage"], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78427, "text": "Information name: Write to use external storage (only Android device): Safe operation and risk verification and use scenarios: APP safe operation and risk verification, security precautions, prevent or prohibit illegal activities, reduce risk collection main body: Ali's device logo SDK, OpenInstallSDK collection frequency (premise for normal use and browsing APP): up to 8 times/minute", "label": ["Usage"], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78428, "text": "Information name: Androidid (only Android device) uses: Push message, content recommendation, user rights guarantee use scenarios: use when pushing messages in Xiaomi mobile terminal; display or recommend content or advertisements with higher levels of correlation; guarantee tourists; guarantee touristsModel purchases for users' order rights and interests are not lost to collect main body: current app, Xiaomi push SDK, Baidu Advertising Alliance mobile version of SDK, fast -handed advertising SDK, Tencent's excellent exchange SDK collection frequency (premise of normal use, browsing APP as the premise): up to 15 times the highest 15 times)/minute", "label": ["Usage"], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78429, "text": "Information name: IMSI use purpose: safe operation and risk verification, content recommendation scenario: APP safe operation and risk verification, security prevention, prevent or prohibit illegal activities, reduce risk; display or recommend content or advertisements with higher degree of correlation to users;Collect the main body: the current app, byte beating SDK, Ali's device logo SDK, Tencent Exchange SDK collection frequency (based on normal use and browsing APP as the premise): up to 15 times/minute", "label": ["Usage"], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78430, "text": "Information name: Foundation information (model, resolution, screen size, software version, log information, fault description) use: safe operation and risk verification and use scenario: when APP is abnormal and collapsed, upload device information is used to analyze analysisCollect the main body of the processing system: the current APP, Tencent Bugly SDK collection frequency (premise for normal use, browsing the app): only when the APP is started, the app is abnormal, and the collapse is collected, the highest 15 times/minute/minute", "label": ["Usage"], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78431, "text": "Information Name: MAC address Disception: Security operation and risk verification, content recommendation Scene: APP safe operation and risk verification, security precautions, prevent or prohibit illegal activities, reduce risks; display or recommend more content or recommend content or recommendation correlation content or recommended content or recommended content or recommended content or recommended content or recommended content or recommended content or recommended content or more recommended content or recommended content or recommended content or recommended content or recommended content or recommended content or more recommended content or recommended content or recommended content or recommended content or more recommended content or recommended content or recommended content or recommended content or recommended content or recommended content or recommended content or recommended content or recommended content or recommended content or recommended content or recommended content or recommended content or recommended content or recommended content or recommended content or recommended content or recommended content or recommended content or recommended content or recommended content or recommended content or recommended content or recommended content or recommended content or recommended content or recommended content or recommended content or recommended content or recommended content or recommended content or recommended content or recommended content or recommended content or recommended content or recommended content or recommendation of correlation or recommendationCollect the main body during advertisements: byte beating SDK, Alipay payment SDK, fast -handed advertising SDK, Gaode map SDK, Gaode positioning SDK, Gaode map search SDK, OpenInstall SDK collection frequency (premise of normal use, browsing APP as the premise): the highest)15 minutes", "label": ["Usage"], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78432, "text": "Information name: Precise, rough positioning information Best: Local question bank/service recommendation, safe operation and risk verification; content recommendation use scenarios: recommend local question bank/service to users; APP safe operation and risk verification, safety prevention, prevention or prohibition of prohibitionIllegal activities, reduce risks; display or recommend more content or advertising collection main body: the current app, Gaode map SDK, Gaode positioning SDK, Gaode map search SDK, byte beating SDK, Tencent superior exchangehuiSDK collecting frequency (premise for normal use and browsing APP): Local question bank/service recommendation: only when users visit \"selecting cities\", \"select the location of the departure\" and collect the authority for positioning authority; safe operation and risk verification;Collection when it is abnormal and collapsed; content recommendation: collect when the request content is recommended.Up to 10 times/minute", "label": ["Usage"], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78433, "text": "Information name: Systems shear plates: Systems: Security operation and risk verification, scan code binding driving school, judge APP activation channel usage scenarios: APP safe operation and risk verification, security precautions, prevent or prohibit illegal activities, reduce risks; according to users according to usersThe scanned QR code automatically binds driving school; after the user downloads and starts the APP from a third -party channel, it records the channel activation of the collection and collecting the main body: the current APP and OpenInstall collection frequency (based on normal use and browsing app): scan code binding the driving school in the driving schoolTime, download from third -party channels and collect the app for the first time.Maximum 3 times/minute", "label": ["Usage"], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78434, "text": "Information name: The current operation program is used: safe operation and risk verification, push message, content recommendation scenario: APP safe operation and risk verification, security prevention, prevent or prohibit illegal activities, reduce risks;; Demonstrate or recommend content with higher levels of correlation or when advertising: current app, vivo push SDK, fast -handed advertising SDK collection frequency (premise of normal use and browsing APP): up to 10 times/minute", "label": ["Usage"], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78435, "text": "Information name: OAID (only Android device) Objective: Push message, content recommendation scenarios: safe operation and risk verification, content recommendation collection main body: current app, Baidu Advertising alliance mobile version of SDK, fast -handed advertising SDK, Tencent superfume SDK SDK SDK SDK SDK, Byte beating SDK collection frequency (premise for normal use, browsing the app as the premise): up to 15 times/minute", "label": ["Usage"], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78436, "text": "Information Name: Acceleration Sensor Use Objective: Open the screen shake and use the scene: Used to read user device acceleration information, to calculate the shaking collection main body: the current APP, the Baidu Advertising Alliance mobile version of the SDK, fast -handed advertising SDK, Tencent Youyou YouMeasurement SDK, byte beating SDK collection frequency (premise for normal use and browsing APP as the premise): Just collect when Qiping shakes advertisements, up to 3 times/minute", "label": ["Usage"], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78437, "text": "3.2 Transfer", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78438, "text": "We will not transfer your personal information to any company, organization and individual, except the following situations: except:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not transfer your personal information to any company, organization and individual, except the following situations: except:"}
{"task": "rw_21.jsonl", "id": 78439, "text": "(1) Get your clear consent in advance;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Get your clear consent in advance, you may transfer your personal information."}
{"task": "rw_21.jsonl", "id": 78440, "text": "(2) Administrative or judicial requirements in accordance with laws and regulations or mandatory administrative or judicial requirements;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "According to laws and regulations or mandatory administrative or judicial requirements, your personal information may be transferred."}
{"task": "rw_21.jsonl", "id": 78441, "text": "(3) When involving asset transfers, acquisitions, mergers, reorganizations or bankruptcy liquidation, if personal information transfer is involved, we will inform you the relevant situation and require new companies and organizations that hold your personal information to continue to be subject to this policy.The constraints.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When involving mergers, acquisitions, or bankruptcy liquidation, if personal information transfer is involved, it will be required to continue to be bound by the policy, otherwise it will request that it will re -solicit authorization consent."}
{"task": "rw_21.jsonl", "id": 78442, "text": "If the purpose of changing personal information, we will ask the company and organization to obtain your clear consent.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78443, "text": "3.3 Public display", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78444, "text": "In principle, we will not disclose your information publicly, except the following scenarios:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In principle, we will not disclose your information publicly, except the following scenarios:"}
{"task": "rw_21.jsonl", "id": 78445, "text": "a), when the list of winnings or list activities is announced, the desensitators will be displayed in the second name of the prizes or driving test.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When announced the winning or list event list, the desertensive display will be displayed in the winner's mobile phone number or driving test."}
{"task": "rw_21.jsonl", "id": 78446, "text": "b), when you use the information publishing function (including but not limited to posting, comments, barrage, etc.), we will collect your nicknames, avatars, positioning information, and display it with the information published by you.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When you use the information release function, we will collect your nicknames, avatars, and positioning information, and display it with the information you posted."}
{"task": "rw_21.jsonl", "id": 78447, "text": "c), when you use community -related interactive functions (including but not limited to likes, comments, recovery, private messages, attention, participating in community lists, participating in community activities, etc.), we will collect your nicknames, avatars, positioning information,And display with your active interaction information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When you use community -related interactive functions, we will collect your nicknames, avatars, and positioning information, and display with your active interactive information."}
{"task": "rw_21.jsonl", "id": 78448, "text": "If other scenes need to be disclosed publicly, we will inform you that the purpose of the public disclosure, the type of disclosure information, and the sensitive information that may be involved, and obtain your clear consent.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "If other scenes need to be disclosed publicly, we will inform you that the purpose of the public disclosure, the type of disclosure information, and the sensitive information that may be involved, and obtain your clear consent."}
{"task": "rw_21.jsonl", "id": 78449, "text": "3.3.1 Personal information that obtains consent sharing, transfer, and publicly disclosed in accordance with the law", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78450, "text": "According to relevant laws and regulations and national standards, in the following circumstances, we will share, transfer, and publicly disclose your personal information in accordance with the law without obtaining your consent:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "According to relevant laws and regulations and national standards, in the following circumstances, we will share, transfer, and publicly disclose your personal information in accordance with the law without obtaining your consent:"}
{"task": "rw_21.jsonl", "id": 78451, "text": "a), which is related to the obligation stipulated by the Personal Information Controller's Performance of Laws and Regulations;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The sharing, transfer or disclosure of the obligations stipulated by the personal information controller's performance of laws and regulations does not require authorization."}
{"task": "rw_21.jsonl", "id": 78452, "text": "b), directly related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The sharing or disclosure directly related to national security and national defense security does not require authorization."}
{"task": "rw_21.jsonl", "id": 78453, "text": "c) Directly related to public safety, public health, and major public interests;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Sharing or disclosure directly related to public safety, public health and major public interests does not need to be authorized."}
{"task": "rw_21.jsonl", "id": 78454, "text": "d), directly related to criminal investigation, prosecution, trial and judgment execution;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Sharing or disclosure related to criminal investigation, prosecution, trial, and judgment execution does not need to be solicited."}
{"task": "rw_21.jsonl", "id": 78455, "text": "e), for maintaining major legitimate rights and interests such as the life and property of the subject of personal information or other individuals, but it is difficult to obtain the consent of my authority;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Out of the major legitimate rights and interests of the life and property of the subject of personal information or other individuals, it is difficult to get shared or disclosed by my consent, and there is no need to solicit."}
{"task": "rw_21.jsonl", "id": 78456, "text": "f), personal information disclosed to the public by yourself;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The collected personal information is the sharing or disclosure of the subject of the personal information to the public by themselves without authorization."}
{"task": "rw_21.jsonl", "id": 78457, "text": "g) Personal information from legal public information, such as legal news reports, government information disclosure and other channels.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you collect personal information from the legal disclosure information, no authorization is required."}
{"task": "rw_21.jsonl", "id": 78458, "text": "4. How do you access and control your personal information", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78459, "text": "4.1 Manage your information", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78460, "text": "You can modify your avatar, nickname, gender, region, login password and certification information by clicking your avatar, nickname, gender, region, login password and certification information in \"My\".", "label": ["Edit/Control", "Important"], "rewrite": "You can click your avatar or nickname in \"My\" to modify the avatar, nickname, gender, region, login password and certification information."}
{"task": "rw_21.jsonl", "id": 78461, "text": "(1) For your personal information security, your ID number and payment account will be displayed;", "label": ["Important", "Data Security"], "rewrite": "Your ID number and payment account will be displayed."}
{"task": "rw_21.jsonl", "id": 78462, "text": "(2) If you find that your information is wrong, you can modify your information based on the page prompting self-service, you can also contact our customer service phone, 400-056-1617, or submit it through the app \"My help and feedback\"Your willingness to modify will have customer service to reply and correct you.", "label": ["Important", "Edit/Control"], "rewrite": "You can modify your information based on the page prompt, or contact our customer service phone 400-056-1617 or submit your willingness to modify through \"My-Help and Feedback\" in the APP."}
{"task": "rw_21.jsonl", "id": 78463, "text": "For consideration of security and identification or in accordance with laws and regulations and regulatory regulations, you must pass the verification to modify your certified name or the binding mobile phone number;", "label": ["Important", "Data Security"], "rewrite": "You need to pass the verification to modify your certified name or the binding mobile phone number."}
{"task": "rw_21.jsonl", "id": 78464, "text": "(3) In the following circumstances, you can make a request to delete personal information:", "label": ["Important", "Edit/Control"], "rewrite": "In the following circumstances, you can make a request to delete personal information: (1) If our behavior of handling personal information violates laws and regulations; (2) If we collect and use your personal information, it has not obtained your consent.; (3) If our behavior of handling personal information violates your agreement; (4) If you no longer use our products or services, or you cancel the account; (5) If we no longer provide you with a product orServe."}
{"task": "rw_21.jsonl", "id": 78465, "text": "a. If we handle personal information violations of laws and regulations;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78466, "text": "b. If we collect and use your personal information, it has not obtained your consent;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78467, "text": "c. If we deal with personal information, the behavior of handling personal information is violated with you;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78468, "text": "d. If you no longer use our products or services, or you cancel your account;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78469, "text": "e. If we no longer provide you with products or services.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78470, "text": "If we decide to affect your request, we will also notify the entities that obtain your personal information through the entity of our personal information and require timely deletion, unless the laws and regulations have other provisions, or these entities have obtained your independent authorization.", "label": ["Important", "Edit/Control"], "rewrite": "If we respond to your deletion request, we will notify the entity that obtains your personal information in time, unless the laws and regulations have other provisions or you can authorize separately."}
{"task": "rw_21.jsonl", "id": 78471, "text": "We encourage you to update and modify your information to make it more accurate and effective.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78472, "text": "We will do everything possible to adopt appropriate technical means to ensure that you can access, update and correct your registration information or use other personal information provided by our services.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78473, "text": "When visiting, updating, correcting, and deleting the aforementioned information, we may ask you to verify your identity to ensure account security.", "label": ["Edit/Control", "Data Security", "Important"], "rewrite": "When visiting, updating, correcting, and deleting the aforementioned information, we may ask you to verify your identity."}
{"task": "rw_21.jsonl", "id": 78474, "text": "4.2 Manage your scope of authorization", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78475, "text": "If you want to change the scope of authorization (including: location, address book, camera, microphone, message push), you can find the Driving Test APP through the mobile phone permissions settings.\"Bao Dian\", the iOS system setting path is: \"Settings -Driving Test Book\", modify the scope of authorization, and cancel the authorization.", "label": ["Edit/Control", "Important"], "rewrite": "If you want to change the scope of authorization, you can find the Driving Test APP through the mobile phone authority settings., Modify the scope of authorization and cancel the authorization."}
{"task": "rw_21.jsonl", "id": 78476, "text": "When you withdraw authorization, we cannot continue to provide you with the service corresponding to the withdrawal authorization and no longer process your corresponding information.", "label": ["Important", "Edit/Control"], "rewrite": "After you withdraw the authorization, we no longer provide the corresponding services and no longer processing your information."}
{"task": "rw_21.jsonl", "id": 78477, "text": "But your decision to withdraw authorization will not affect the information processing based on your authorization.", "label": ["Important", "Edit/Control"], "rewrite": "Your decision to withdraw authorization will not affect information processing based on previous authorization."}
{"task": "rw_21.jsonl", "id": 78478, "text": "You must have a confidential obligation to your account and password information. In any case, please keep it carefully and properly.", "label": ["Important", "Data Security"], "rewrite": "Please keep your account and password information carefully and properly."}
{"task": "rw_21.jsonl", "id": 78479, "text": "4.3 Logging out account", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78480, "text": "a. You can cancel the previously registered account at any time. You can cancel your account information by logging in to the Driven Test Book of Application.", "label": ["Edit/Control", "Important"], "rewrite": "You can cancel the previously registered account at any time. The cancellation path is: \"Log in to the account -my - click the avatar -account security -cancellation account\"."}
{"task": "rw_21.jsonl", "id": 78481, "text": "When accessing, updating, correcting, and deleting account information, we may ask you to verify your identity to ensure information security.", "label": ["Important", "Edit/Control"], "rewrite": "When visiting, updating, correcting, and deleting account information, we may ask you to verify your identity."}
{"task": "rw_21.jsonl", "id": 78482, "text": "b. In the case of the service agreement stipulated in the service agreement that meets the single service of the driving test and the relevant national laws and regulations, your driving test treasure service account may be canceled or deleted.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78483, "text": "When the account is canceled or was deleted, all the service materials and data related to the account will be deleted or processed in accordance with the service agreement of the single service.", "label": ["Important", "Edit/Control"], "rewrite": "When the account is canceled or deleted, all the service information and data related to the account will be deleted or processed."}
{"task": "rw_21.jsonl", "id": 78484, "text": "c. Logging out the account cannot be restored.", "label": ["Important", "Edit/Control"], "rewrite": "Logging out the account cannot be resumed."}
{"task": "rw_21.jsonl", "id": 78485, "text": "After cancellation, your account will not be used to log in to the product and service of the Driving Test Book of Driving for your account (including but not limited to driving tests, driving test treasures, driving tests, fast applications, driving test treasure edition,Driving Test 3D Car Training and Driving Test).", "label": ["Important", "Edit/Control"], "rewrite": "After canceling, your account will not be used for login."}
{"task": "rw_21.jsonl", "id": 78486, "text": "4.4 Management information disclosure range", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78487, "text": "You can always choose whether to disclose the information.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78488, "text": "Some information is necessary for the use of driving tests, but the provision of most other information is determined by you.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78489, "text": "You can change your authorization of information by deleting information and closing the device function.", "label": ["Important", "Edit/Control"], "rewrite": "You can change the scope of authorization by deleting information and closing the device function or withdraw your authorization."}
{"task": "rw_21.jsonl", "id": 78490, "text": "(1) Close third -party SDK programmatic advertisements", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78491, "text": "Programmized advertising is one of the advertising display technology, and the advertisers make intelligent recommendations based on your preferences in its application.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78492, "text": "The Driving Test Book only provides programmatic advertising docking technology, and will not obtain your behavior or personal data in other applications. You can select or open a receiving programmatic advertisement through the following path: 1. After entering the [Mine] page, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2. Click [Settings], 3. Click [Privacy Settings] and select to close the [programmatic advertisement] button", "label": ["Important", "Edit/Control"], "rewrite": "You can choose to close or turn on the receiving programmatic advertisement through the following path: 1. After entering the [Mine] page 2. Click [Settings] 3. Click [Privacy Settings] and select the [Programmatic Advertising] button."}
{"task": "rw_21.jsonl", "id": 78493, "text": "(2) Manage posts and comments: 1. Enter the [Mine] page, 2. Click [My Posted] to enter my post list, 3. Click a certain post to enter the details. Click on the upper right corner to delete and change it;", "label": ["Important", "Edit/Control"], "rewrite": "Management posts and comments: 1. Enter the [Mine] page 2. Click [My Posted] to enter my post list 3. Click a certain post to enter the details. Click on the upper right corner to delete and change it."}
{"task": "rw_21.jsonl", "id": 78494, "text": "(3) Management of driving schools and coach comments: 1. Enter the comments [Driving School] or [Coach] 2. Click [Student Evaluation-View All] 3. Click on the upper right corner [My Evaluation], 4. Click on the upper right corner [Edit] You can delete it", "label": ["Important", "Edit/Control"], "rewrite": "Management of driving schools and coach comments: 1. Enter the comments [Driving School] or [Coach] 2. Click [Student Evaluation-View All] 3. Click on the upper right corner [My Evaluation] 4. Click [Edit]Delete."}
{"task": "rw_21.jsonl", "id": 78495, "text": "(4) Request to register for driving school/coach registration, 1. Enter the [Mine] page, 2. Click [My Order] 3. Click [Consult the Driving School/Coach Order], 4. Click the [Cancel Consultation] button of the corresponding consultation cardOr contact 400-056-1617 withdrawal consultation", "label": ["Important", "Edit/Control"], "rewrite": "Withdrawal of driving school/coach registration consultation 1. Enter the [Mine] page 2. Click [My Order] 3. Click [Consult the Driving School/Coach Order] 4. Click the [Cancel Consultation] button or contact 400-056-1617 Consultation."}
{"task": "rw_21.jsonl", "id": 78496, "text": "4.5 respond to your above request", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78497, "text": "To ensure safety, you may need to provide a written request or prove your identity in other ways.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78498, "text": "We may ask you to verify your identity first, and then handle your request. We will reply within fifteen days.", "label": ["Edit/Control", "Data Security", "Important"], "rewrite": "We may ask you to verify your identity first, and then handle your request. We will reply within fifteen days."}
{"task": "rw_21.jsonl", "id": 78499, "text": "In the following circumstances, in accordance with the requirements of laws and regulations, we will not be able to respond to your request:", "label": ["Important", "Edit/Control"], "rewrite": "In the following circumstances, in accordance with the requirements of laws and regulations, we will not be able to respond to your request:"}
{"task": "rw_21.jsonl", "id": 78500, "text": "(1) Related to the obligations stipulated in our law;", "label": ["Important", "Edit/Control"], "rewrite": "If your request is related to the obligations stipulated in our laws and regulations, it may not be responding."}
{"task": "rw_21.jsonl", "id": 78501, "text": "(2) Directly related to national security and national defense security;", "label": ["Edit/Control", "Important"], "rewrite": "If your request is directly related to national security and national defense security, you may not be responded."}
{"task": "rw_21.jsonl", "id": 78502, "text": "(3) Directly related to public safety, public health, and major public interests;", "label": ["Important", "Edit/Control"], "rewrite": "Your request is directly related to public safety, public health, and major public interests and may not be responded."}
{"task": "rw_21.jsonl", "id": 78503, "text": "(4) Directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Important", "Edit/Control"], "rewrite": "Your request is related to criminal investigation, prosecution, and trial, and may not be responded."}
{"task": "rw_21.jsonl", "id": 78504, "text": "(5) There is sufficient evidence that you have subjective malice or abuse of rights;", "label": ["Important", "Edit/Control"], "rewrite": "If we have sufficient evidence that the subject of personal information has subjective malice or abuse of rights, we may not be able to respond to requests."}
{"task": "rw_21.jsonl", "id": 78505, "text": "(6) For major legitimate rights and interests such as the life and property of the subject of personal information or other individuals, it is difficult to get the consent of my authority;", "label": ["Important", "Edit/Control"], "rewrite": "Out of the major legitimate rights and interests of the life and property of personal information subjects or other individuals, but it is difficult to get my consent, we may not be able to respond to the request."}
{"task": "rw_21.jsonl", "id": 78506, "text": "(7) In response to your request, the legitimate rights and interests of you or other people and organizations are seriously damaged;", "label": ["Important", "Edit/Control"], "rewrite": "We may not be able to respond to the request that the legitimate rights and interests of personal information subjects or other individuals and organizations are seriously damaged."}
{"task": "rw_21.jsonl", "id": 78507, "text": "(8) Involved in business secrets.", "label": ["Important", "Edit/Control"], "rewrite": "We may not be able to respond."}
{"task": "rw_21.jsonl", "id": 78508, "text": "5. Information security", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78509, "text": "We only retain your personal information during the period required by the purpose of this policy and the time limit required by laws and regulations.", "label": ["Data Retention", "Important"], "rewrite": "Keep your personal information only within the time limit for service purposes, unless the law has other requirements."}
{"task": "rw_21.jsonl", "id": 78510, "text": "We use various security technologies and procedures to prevent information loss, improper use, unauthorized reading or disclosure, sharing.", "label": ["Important", "Data Security"], "rewrite": "Use security technology and procedures to prevent information loss, improper use, unauthorized reading or disclosure, sharing."}
{"task": "rw_21.jsonl", "id": 78511, "text": "For example, in certain services, we will use encryption technology (such as SSL) to protect your personal information.", "label": ["Important", "Data Security"], "rewrite": "Use encryption technology to protect your personal information."}
{"task": "rw_21.jsonl", "id": 78512, "text": "However, please understand that due to the technical restrictions and various malicious means, in the Internet industry, even if you can do your best to strengthen security measures, it is impossible to ensure that the information is 100 % security.", "label": ["Important", "Data Security"], "rewrite": "Although there are security measures, it is impossible to fully guarantee that there is no security problem."}
{"task": "rw_21.jsonl", "id": 78513, "text": "You need to understand that the systems and communication networks you use to access our services may be due to factors outside of our controllable scope.", "label": ["Important", "Data Security"], "rewrite": "Systems and communication networks may have problems due to unprepared factors."}
{"task": "rw_21.jsonl", "id": 78514, "text": "6. Third -party service", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78515, "text": "Driving Test Book may link to social media or other services provided by third parties (including websites or other services).", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78516, "text": "(1) We provide you with links to you through advertising or other ways to enable you to access third -party services or websites.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78517, "text": "(2) Third -party social media or other services may be operated by related third parties or we.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78518, "text": "As long as you do not delete the shared information, the relevant information will always leave the public domain;", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78519, "text": "Even if you delete the shared information, the relevant information may be cached, copied or stored by other users or non -associated third parties that are not controlled by us, or is preserved by other users or third parties in the public domain.", "label": ["Important", "Risk"], "rewrite": "The information you actively shared may be preserved by other users or third parties."}
{"task": "rw_21.jsonl", "id": 78520, "text": "If you disclose or share information through the above channels, we will not bear responsibility for your information leakage.", "label": ["Important", "Risk"], "rewrite": "We are not responsible for the leakage of information leaks to you through a third -party platform or sharing information."}
{"task": "rw_21.jsonl", "id": 78521, "text": "Therefore, we remind and ask you to consider whether to disclose or share your information through the above channels.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Please consider whether to disclose or share your information through third -party channels."}
{"task": "rw_21.jsonl", "id": 78522, "text": "(3) If you use third -party social media services or other services (including any personal information you provided to the third party), you must be subject to the third -party service terms and privacy policies. You need to read its clause carefully.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78523, "text": "This \"Privacy Policy\" is only applicable to the information we collected, and it is not applicable to the service provided by any third party or information use rules for third -party information. If you find that these third -party social media or other services are risky, it is recommended that you terminate you to terminateRelated operations to protect your legitimate rights and interests.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78524, "text": "7. Personal sensitive information", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78525, "text": "Some personal information may be considered a personal sensitive information because of its particularity, such as your identity document, personal biometric information, property information, location information, and minor information.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78526, "text": "We will encrypt, storage, and transmission of personal sensitive information.", "label": ["Important", "Data Security"], "rewrite": "We will encrypt, storage, and transmission of personal sensitive information."}
{"task": "rw_21.jsonl", "id": 78527, "text": "Please note that when you use our services, the content and information provided, uploaded or published (such as photos information about your social activities) may leak your personal sensitive information.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78528, "text": "You need to consider carefully whether to disclose relevant personal sensitive information when using our services.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78529, "text": "You agree that your sensitive information is processed according to the purpose and method described in the \"Privacy Policy\".", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78530, "text": "8. Algorithm recommendation service mechanism and rules", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78531, "text": "8.1 Personalized recommendation", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78532, "text": "In order to show you and recommend more correlation advertisements or information, provide services that meet your requirements more.May be interested in information or services. The following we will explain to you in detail the operating mechanism of this personalized recommendation service and the way you implement control.", "label": ["Important", "Usage"], "rewrite": "The driving test will collect, use your personal information to automatically calculate, predict your preference to match the information or service you may be interested in."}
{"task": "rw_21.jsonl", "id": 78533, "text": "(1), we will recommend you to the products, services, or other information that may be interested in through the system notification column message push and the recommendation of the homepage pop -up window activity.", "label": ["Important", "Usage"], "rewrite": "According to your test models, learning vehicles, in -application browsing records and other information to recommend products, services or other information that may be interested in."}
{"task": "rw_21.jsonl", "id": 78534, "text": "(2) We will recommend advertisements that may be interested in based on your driving stage, the selected test model, and the city where you are located.", "label": ["Important", "Usage"], "rewrite": "According to your car learning stage, the selected test model, the city you are located, recommend advertisements that may be interested in."}
{"task": "rw_21.jsonl", "id": 78535, "text": "(3) We will recommend you to the products, services, or other information that you may be interested in through the information flow car system recommendation, the recommendation of the recommendation, the homepage pop -up window, and the information push of the notification bar.Essence", "label": ["Important", "Usage"], "rewrite": "Depending on your behavior information and other information submitted to the goods, services or other information that may be interested in."}
{"task": "rw_21.jsonl", "id": 78536, "text": "In order to predict your preferences, we may collect and use your device information, location information, and behavior information when using the Driving Test APP. Behavior information includes your content browsing, searching, clicking, clicking, clicking, clicking, clicking, clicking, clicking, clicking, clicking, andCorrespondence information of attention, collection, browsing, and trading, including other information you filled in.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect and use your device information, location information, and behavior information when using the driver's Test Test APP to predict your preference."}
{"task": "rw_21.jsonl", "id": 78537, "text": "We will automatically analyze and calculate the above information. The machine (or system) will automatically push the content that you may be more interested in according to the calculation results, and give the recommendation model from time to time, and constantly adjust the optimization of the recommendation results to better adjust to youprovide excellent service.", "label": ["Usage"], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78538, "text": "Please know that the personalized recommendation algorithm in the Driving Test Book will not identify the true identity of a specific natural person. It is only based on user behavior and characteristics to provide more correlation and richer information.", "label": ["Important", "Usage"], "rewrite": "Personalized recommendation algorithms do not identify the true identity of specific natural persons, just provide higher and richer information based on user behavior and characteristics."}
{"task": "rw_21.jsonl", "id": 78539, "text": "You can choose to close the personalized content push according to your own needs, and the setting path is: [Driving Test APP]-[My]-[Settings]-[Privacy and Permanent Settings]-[Personalized Recommendation], you can click right to right to right.The side button is turned off.", "label": ["Important", "Edit/Control"], "rewrite": "Close the personalized recommendation setting path: [Driving Test APP]-[Mine]-[Settings]-[Privacy and permissions settings]-[Personalized recommendation], you can click the button on the right to close."}
{"task": "rw_21.jsonl", "id": 78540, "text": "When you close, we will not process your personal information based on the purpose of personalized push, but will only push you to you with universal content that has nothing to do with your preference.", "label": ["Important", "Usage"], "rewrite": "When you close personalized recommendations, you will only push you a universal content that has nothing to do with your preference."}
{"task": "rw_21.jsonl", "id": 78541, "text": "You can choose to close the programmatic advertisement according to your own needs, and the way off the setting path is: [Driving Test APP]-[Mine]-[Settings]-[Privacy and Permanent Settings]-[Procedural Advertising], you can click on the right side of the right sideThe button is closed.", "label": ["Edit/Control", "Important"], "rewrite": "Closing the programmatic advertising path: [Driving Test APP]-[My]-[Settings]-[Privacy and Permissions Settings]-[Procedural Advertising], you can click the button on the right to close."}
{"task": "rw_21.jsonl", "id": 78542, "text": "When you close, the number of ads you see will not decrease, but the driving test Book of Application will no longer show you programmatic advertisements, and the advertisement you see may be reduced with your preference.", "label": ["Important", "Edit/Control"], "rewrite": "When you close the programmatic advertisement, the ads you see may be reduced with your preference."}
{"task": "rw_21.jsonl", "id": 78543, "text": "8.2 content filtering", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78544, "text": "In order to provide you with high -quality positive content, when you use the information content published by the driving test, or the relevant content generated after modifying the user's information, you will use the content filtering system to detect keywords, text, pictures and other information, identify, identifyAfter the corresponding content attribute is produced, it matches the conditions of the content filtering rules.", "label": ["Important", "Usage"], "rewrite": "When you use the information content published by the Driving Test Test or modify the relevant content generated by the user information, the content will be filtered to provide you with high -quality positive content."}
{"task": "rw_21.jsonl", "id": 78545, "text": "Information containing specific keywords will trigger the blocking and alarm mechanism of illegal and bad information feature libraries, and will not be presented to the client.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78546, "text": "In order to create a clear network space, build a good network ecology, and present high -quality positive content, the content filtering algorithm will not be able to provide you with any control methods.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78547, "text": "8.3 Selection of Sorting", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78548, "text": "a.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78549, "text": "In order to help you find a good qualification and high -quality driving school (coach) to provide reference for you to register for a car, we integrate the data of students in the driving test of the students, driving school (coaches) certification data, driving school (coach) in -depth cooperation data, use merger and sorting sortingMake multiple dimensions of driving school (coach).", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78550, "text": "Driving school (coach) is updated every 2 hours.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78551, "text": "The sorting rules of each dimension have been publicized in the upper right corner of the list to ensure that the content of the list is open and transparent.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78552, "text": "You can choose the corresponding rankings according to your needs.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78553, "text": "b.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78554, "text": "In order to test your theoretical knowledge learning progress of your driving test, predict and evaluate your theoretical test pass rate, we have set up simulation test results query and ranking functions, and according to the student simulation test results, time, time to register for the students in the driving test, apply for driving schoolFor data such as registration cities, use the three dimensions of the same school, the city, and the country to display the results of the simulation test results of the students.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78555, "text": "You can also show the performance rankings of different time cycles by switching \"Sun and Moon\".", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78556, "text": "9. Special agreement for privacy of minors", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78557, "text": "We expect parents or guardians to guide minors to use our services.", "label": ["Specific Audiences", "Important"], "rewrite": "We expect parents or guardians to guide minors to use our services."}
{"task": "rw_21.jsonl", "id": 78558, "text": "If you are a minor, it is recommended that your parents or guardians read this policy and use our services or provide us information to us under the consent of your parents or guardians.", "label": ["Specific Audiences", "Important"], "rewrite": "Please use services or provide your information on the premise of obtaining the consent of the guardian."}
{"task": "rw_21.jsonl", "id": 78559, "text": "If your guardian does not agree that you use our services or provide information to us in accordance with this policy, please immediately terminate our services and inform us in time so that we can take corresponding measures.", "label": ["Specific Audiences", "Important"], "rewrite": "If the guardian does not agree to use services or provide information in accordance with this policy, please stop using and notify us in time."}
{"task": "rw_21.jsonl", "id": 78560, "text": "The Driving Test Book will protect the confidentiality and security of personal information of minors in accordance with the provisions of relevant national laws and regulations.", "label": ["Specific Audiences", "Important"], "rewrite": "The Driving Test Book will protect personal information of minors in accordance with the provisions of relevant national laws and regulations."}
{"task": "rw_21.jsonl", "id": 78561, "text": "10. How do we deal with children's personal information", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78562, "text": "Our products, websites and services are mainly adults.", "label": ["Specific Audiences", "Important"], "rewrite": "Our products, websites and services are mainly adults."}
{"task": "rw_21.jsonl", "id": 78563, "text": "Without the consent of parents or guardians, children should not create their own personal information main account.", "label": ["Specific Audiences", "Important"], "rewrite": "Children should not create their own personal information subject account unless the guardian consent."}
{"task": "rw_21.jsonl", "id": 78564, "text": "Regarding the case of collecting children's personal information with the consent of parents, we will only use or disclose this information if they are allowed to be allowed, parents or guardians to clearly consent or protect children.", "label": ["Specific Audiences", "Important"], "rewrite": "We will only use or disclose the information collected by the consent of the by law by the permission of law, the guardian clearly consent or protect the children."}
{"task": "rw_21.jsonl", "id": 78565, "text": "Although local laws and customs have different definitions of children, we regard anyone under the age of 14 as children.", "label": ["Specific Audiences", "Important"], "rewrite": "We regard anyone under the age of 14 as children."}
{"task": "rw_21.jsonl", "id": 78566, "text": "If we find that we collect their personal information without the consent of the parents who can be confirmed in advance, they will try to delete relevant data as soon as possible.", "label": ["Specific Audiences", "Important"], "rewrite": "If the personal information of minors was collected without the consent of the legal guardian, he would try to delete relevant information as soon as possible."}
{"task": "rw_21.jsonl", "id": 78567, "text": "11. Revision and notification", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78568, "text": "In order to provide you with better services, the Treasure Book of Driving and related services will be updated and changed from time to time. We will revise the privacy policy in a timely manner. These revisions constitute a part of the privacy policy and have the effect of equivalent privacy policies.You clearly agree that we will not reduce the rights you should enjoy based on the current privacy policy that takes effect.", "label": ["Policy Change", "Important"], "rewrite": "The revision of this privacy policy will constitute a part of it. Without your clear consent, we will not reduce the rights you should enjoy based on the current privacy policy that you take effect."}
{"task": "rw_21.jsonl", "id": 78569, "text": "For major changes, we will provide more significant notifications, such as internal pop -ups or pushes. In this case, if you continue to use the driving test treasure service, that is, the privacy policy that represents the revised \"Privacy Policy\" that is agreed with the revised \"Privacy Policy\" Constraint;", "label": ["Policy Change", "Important", "Risk"], "rewrite": "For major changes, we will provide a more significant notice. If you continue to use it, it means the constraints of the \"Privacy Policy\" that agree with the revised \"Privacy Policy\"."}
{"task": "rw_21.jsonl", "id": 78570, "text": "You can also choose to stop using the driving test.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78571, "text": "Any modification will put your satisfaction first.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78572, "text": "We encourage you to consult our privacy policy every time you use the Driving Test Services.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78573, "text": "12. How to contact us", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78574, "text": "If you have any questions, opinions, or suggestions on online information security, or you have any questions, opinions or suggestions on this \"Privacy Policy\", your information and other related matters, as well as issues of privacy measures about the driving test book, please contact us.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78575, "text": "12.1 Contact us", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78576, "text": "You can consult, 400-056-1617, consult, or send emails to privacy-jiakao@mucang.cn for consultation. We have set up a personal information protection full-time department and personnel and will give you a reply as soon as possible.", "label": ["Important", "Contact Information"], "rewrite": "Contact number: 400-056-1617; Email: Privacy-jiakao@mucang.cn."}
{"task": "rw_21.jsonl", "id": 78577, "text": "Under normal circumstances, we will reply on fifteen working days.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78578, "text": "12.2 Complaint Report", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78579, "text": "You can complain or report in accordance with our publicity system.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78580, "text": "If you think your personal information rights may be infringed, or you can find a clue to infringe the right to personal information, you can get the official website of the Book of Delivery and Feedback in the Driving Test of the Test of the Test of the Test of the Test of the Test.Interface contact us.", "label": ["Important", "Contact Information"], "rewrite": "You can take the Baoist APP [Mine]-[Help and Feedback] or the official website of the driving test-feedback."}
{"task": "rw_21.jsonl", "id": 78581, "text": "After we verify your complaints and reports within 15 working days.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78582, "text": "12.3 Dispute Solution", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78583, "text": "If you are not satisfied with our response, especially if you think our personal information processing behavior harms your legitimate rights and interests, you can also seek solutions by filed a lawsuit with the People's Court of Donghu New Technology Development Zone in Wuhan.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78584, "text": "Thank you for your trust and use of the application of the \"Driving Test\"!", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78585, "text": "Wuhan Mucang Technology Co., Ltd.", "label": [], "rewrite": []}
{"task": "rw_21.jsonl", "id": 78586, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
