{"task": "rw_26.jsonl", "id": 46290, "text": "Mango TV Personal Information Protection Policy", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46291, "text": "Updated in this version: July 29, 2022", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46292, "text": "Effective time of this edition: July 29, 2022", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46293, "text": "We updated the relevant content of the \"Mango TV Personal Information Protection Policy\" earlier.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46294, "text": "The content of this update mainly includes: further supplementing real -name authentication scenarios, increasing game functions, increasing digital collection scenarios, optimizing sharing, transfer, and public disclosure.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46295, "text": "Please read and fully understand the full text before using Mango TV products or services, and use it after agreeing with all the content.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46296, "text": "preface", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46297, "text": "Mango TV (also known as \"us\", operator: Hunan Happy Sunshine Interactive Entertainment Media Co., Ltd.) knows the importance of personal information to you and will do its best to protect your personal information security and reliable.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46298, "text": "We are committed to maintaining your trust in us, adhere to the basic principles of personal information processing, and protect your personal information: right, related, open, quality, safety, and legal principles.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46299, "text": "At the same time, Mango TV promises that we will take corresponding security protection measures to protect your personal information in accordance with the industry's mature security standards.The content is treated and handled with highly prudent obligations.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46300, "text": "This policy is closely related to our products or services you use. When you download, install, start, browse, register, log in, use our products or services, we will handle and protect your personal information in accordance with the agreement of this policy.Therefore, we hope that you can carefully read and fully understand the full text of this policy, and when needed, according to the guidance of this policy, make a proper choice.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46301, "text": "The related technical vocabulary involved in this policy, we try to explain to you with concise expressions in order to facilitate your understanding.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46302, "text": "This policy is suitable for all products, services and software provided by our Mango TV platform and third -party platforms.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46303, "text": "Some specific products, services and software will also apply specific personal information protection policies, and we will further explain to you these specific products and/or services and software.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46304, "text": "Under certain circumstances, we may obtain your authorization consent through pop -ups and other methods. The pop -up window plan will form an effective part of the cost policy.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46305, "text": "For example, specific personal information protection policies are inconsistent with this policy, and specific personal information protection policies shall prevail.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46306, "text": "The specific personal information protection policy is not mentioned, which is subject to this policy.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46307, "text": "It is necessary to specifically explain that this policy is not applicable to the products or services provided directly to you by the mango TV affiliates or third -party cooperation agencies.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46308, "text": "When you use the third -party products and/or services in the mango TV platform, including but not limited to the drainage services provided by third -party e -commerce platforms, fintech platforms, licensed financial institutions, and other legal subjects (hereinafter referred to as \"third parties\"When products and services and software \"), or use the mango TV products and services and services of a third -party platform, for these products or services, we recommend that you check their personal information protection policies before use to understand how they handle youInformation for prudential decisions.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46309, "text": "This policy is based on the laws and regulations on personal information protection such as the Protection of the People's Republic of China and the relevant countries and industry standards, which transparently present how we collect, use, store, share, transfer, and publicly disclose your personal information.And the control of personal information you enjoy.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46310, "text": "You know and confirm that you have read all the contents of this policy when you are registered, and agree to deal with your personal information legally in accordance with this policy.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46311, "text": "If you do not agree with the content of this policy, you should immediately stop using our products and/or services;", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46312, "text": "You use or continue to use our products and/or services, indicating that you fully understand and agree with all the contents of the \"Mango TV Personal Information Protection Policy\" (including the updated version).", "label": ["Policy Change", "Important"], "rewrite": "You use or continue to use the products and/or services we provide, indicating that you fully understand and agree with the privacy policy."}
{"task": "rw_26.jsonl", "id": 46313, "text": "In order to facilitate your reading of this policy, we have a major relationship with major relationships with your legitimate interests and the special logo involved in sensitive information. Please pay attention to reading.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46314, "text": "Before providing us with any sensitive personal information, please consider that this provision is appropriate and agree that your sensitive personal information can be processed according to the purpose and method described in this policy.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46315, "text": "We will collect and use your sensitive information to achieve related functions after getting your consent.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect and use your sensitive information to achieve related functions after getting your consent."}
{"task": "rw_26.jsonl", "id": 46316, "text": "You can refuse to provide us with these sensitive information, but refusing to provide this information will affect your use of Mango TV products and/or services and software items.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can refuse to provide us with these sensitive information, but may affect specific functions."}
{"task": "rw_26.jsonl", "id": 46317, "text": "about Us", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46318, "text": "Mango TV (www.mgtv.com) refers to Hunan Happy Sunshine Interactive Entertainment Media Co., Ltd., registered address: North Fourth Floor, Hunan International Convention and Exhibition Center, Kaifu District, Changsha City;", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46319, "text": "Common office address: West Affiliated Building, Hunan International Convention and Exhibition Center in Kaifu District, Changsha City, Mango TV;", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46320, "text": "Contact number: 4009770707.", "label": ["Important", "Contact Information"], "rewrite": "Contact number: 4009770707."}
{"task": "rw_26.jsonl", "id": 46321, "text": "If you want to learn more about our company and platform in detail, you can contact us through the contact information provided by this policy.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46322, "text": "This \"Mango TV Personal Information Protection Policy\" will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46323, "text": "1. The scope of the \"Mango TV Personal Information Protection Policy\" and the meaning of related words", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46324, "text": "2. User information and collection methods we collect", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46325, "text": "3. How do we store and collect user information", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46326, "text": "4. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46327, "text": "Fifth, how can we share, transfer, and publicly disclose the collection of user information", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46328, "text": "6. How do we guarantee the user information security collected", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46329, "text": "Seven, how do users manage their own information", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46330, "text": "8. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46331, "text": "Nine, the revision and update of this policy", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46332, "text": "10. Contact us", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46333, "text": "11. Other related information", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46334, "text": "1. The scope of the \"Mango TV Personal Information Protection Policy\" and the meaning of related words", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46335, "text": "(1) The scope of application of \"Mango TV Personal Information Protection Policy\"", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46336, "text": "This \"Mango TV Personal Information Protection Policy\" is a uniform content suitable for all our products or services. When you use any of our products or services, this \"Mango TV Personal Information Protection Policy\" is applicable, but such as this product or orIf the service has set a separate privacy clause/privacy policy, the individual privacy clause/privacy policy is preferred;", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46337, "text": "The content of the privacy clause/privacy policy is not mentioned, and this policy is applicable.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46338, "text": "But please note that this \"Mango TV Personal Information Protection Policy\" is not applicable to the following situations:", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46339, "text": "1. Provide third -party information collection for our products and/or services;", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46340, "text": "2. Our products or services may include or link information or third -party services provided by third parties (including any third -party application, website, product, service, etc.).For information or services, it has nothing to do with us.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46341, "text": "We will remind you here that when you use third -party information or services, you should pay attention and read the relevant user agreement and personal information protection policies you displayed in the third direction, and provide your personal information properly and carefully.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46342, "text": "This \"Mango TV Personal Information Protection Policy\" is only applicable to your personal information we collected, and it is not applicable to the collection of your personal information of any third party, as well as any third -party service or third -party information usage rulesWe do not take any responsibility for any third -party collection, storage, and use of your personal information within the scope of legal permission.", "label": ["Important"], "rewrite": "We do not assume any responsibility for any third -party collection, storage and use your personal information within the scope of law."}
{"task": "rw_26.jsonl", "id": 46343, "text": "(2) Related word meaning", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46344, "text": "Our products and/or services: including but not limited to the software, websites, and services we provide (including outside services, such as: our advertising service and \"plug -in through our service application or sharing\"), and related related relatedProduct or service function.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46345, "text": "We need to remind you in particular: Because our products and services are more, the products and service content provided for you are also different. This \"Mango TV Personal Information Protection Policy\" is the general privacy clause that we applies to us.For some specific products/services, we will also formulate specific personal information protection clauses or personal information protection policies to more specifically clarify our personal information protection rules and protection measures.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46346, "text": "The definition of the following professional terms comes from the \"Personal Information Protection Law of the People's Republic of China\", GB/T 35273-2020 \"Information Security Technology Personal Information Security Standards\":", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46347, "text": "1. Personal information: Refers to various information related to recognized or recognized natural persons recorded in electronics or other ways, excluding information after anonymous processing.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46348, "text": "2. Sensitive personal information: It refers to personal information that can easily cause the personality and dignity of natural people to be violated or harmed by personal and property security once it is leaked or illegally used.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46349, "text": "Including information such as biometrics, religious beliefs, specific identities, medical and health, financial accounts, trajectory trajectory and other personal information, as well as personal information of minors under the age of fourteen.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46350, "text": "3. Anonymous processing: Refers to the process that the personal information subject cannot be recognized by the technical processing of personal information, and the processing information after processing cannot be restored.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46351, "text": "The information obtained by personal information after anonymous processing does not belong to personal information.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46352, "text": "4. Devitary processing: It refers to the process of personal information that cannot recognize specific natural persons without using additional information.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46353, "text": "5. Personal information main body: natural person identified or associated by personal information.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46354, "text": "6. Personal information controllers: organization or individuals who have the ability to determine the purpose and method of personal information processing.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46355, "text": "7. Explicit consent: The subject of personal information actively made paper or electronic forms in writing, orally, or made positive actions independently to make clear authorization of their personal information.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46356, "text": "8. Authorization Agree: The subject of personal information conducts a clear authorization of its personal information.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46357, "text": "Including authorization through positive behaviors, or to be authorized through negative inaction.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46358, "text": "9. Minor: Refers to minors under the age of 14.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46359, "text": "10. Delete: Refers to removing personal information in a system involved in daily business functions, so that it keeps it unable to be retrieved and accessed.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46360, "text": "2. User information and collection methods we collect", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46361, "text": "When you use Mango TV products and/or services and software, we need/may need to collect and use your personal information, including the following: below:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46362, "text": "1. In order to provide you with basic functions of mango TV products and/or services and software, you must authorize us to collect and use the necessary information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46363, "text": "If you refuse to provide the corresponding information, you will not be able to use Mango TV products and/or services and software normally;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46364, "text": "2. In order to provide you with additional functions to provides you with mango TV products and/or services and software, you can choose to authorize the information you collect and use.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46365, "text": "If you refuse to provide it, you will not be able to use related additional functions normally or to achieve the functional effects we intend to achieve, but it will not affect the basic functions of your normal use of mango TV products and/or services and software.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46366, "text": "We will follow the principles of legitimate, legal, and necessary. For the following purposes described in this policy, collect and use what you actively provided during the use of mango TV products and services and software.Services and software, as well as your personal information we obtained from third parties.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will follow the principles of legitimate, legal, and necessary, and collect and use your personal information for the purpose described in this policy."}
{"task": "rw_26.jsonl", "id": 46367, "text": "Reminder: If you provide personal information of others, please make sure you have obtained the authorization of the relevant subject.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you provide personal information of others, please make sure that you have obtained the authorization of the relevant subject."}
{"task": "rw_26.jsonl", "id": 46368, "text": "Because we have a lot of products and services and the content provided by users is different, it will also be different from the collection of user information due to the different content of the product/service. The specific product or service is prevailing.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46369, "text": "In addition, you understand and agree, and we hope that the products and services that you provide to you are perfect, so we will continue to improve our products and services, including technology, which means that we may often launch new business functions.It may be necessary to collect new personal information or change the purpose or method of using personal information.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46370, "text": "If a function or product and service that needs to collect users' personal information cannot be explained in this \"Mango TV Personal Information Protection Policy\", we will update this policy and use website announcement, pop -up window, push notification or notice or notice or notice or notice or notice or notice or notice.Other ways to facilitate your knowledge to explain the purpose, content, usage methods, and scope of the collection of the information, and provide users with the way of self -selection consent, and collect it after obtaining the user's public consent.", "label": ["Important", "First Party Collection Information"], "rewrite": "If the collection information exceeds the explanation of this policy, we will notify you the purpose, content, usage method and scope of the collection, and start collecting after you choose to agree."}
{"task": "rw_26.jsonl", "id": 46371, "text": "Without your clear consent, we will not limit your rights you enjoy in accordance with this policy.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46372, "text": "In the process, if the user has any doubts or related matters, you can contact us through the method provided by the end of the text, and we will make a corresponding answer.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46373, "text": "(1) Our specific scene includes:", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46374, "text": "1. Account registration/login and membership function", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46375, "text": "When users use registration/login and membership functions, we need to complete a series of registered (membership) procedures according to our guidelines. After becoming a registered/login (member) user, we will provide products and services exclusive to registered (member) usersEssence", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46376, "text": "When you use the account registration function, we will collect some information that you actively provide us with your real name, including: the matching result of the mobile phone number, account number and verification code/account password (sensitive personal information), andAnd create account UID and passwords.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use your account registration function, collect some information that you actively provide or combined with your real -name identity."}
{"task": "rw_26.jsonl", "id": 46377, "text": "Your password will be automatically storage, transmission, and verification in the form of encryption, and we will not store, transmit, and verify your passwords in a clear text.", "label": ["Important", "Data Security"], "rewrite": "Your password will be automatically stored, transmitted, and verified in the form of encryption."}
{"task": "rw_26.jsonl", "id": 46378, "text": "When you keep, enter, and use your password, you should carefully evaluate the physical and electronic environment to prevent the password from leaking.", "label": ["Important", "Data Security"], "rewrite": "When storage, input, and use your password, please be careful to evaluate the physical and electronic environment to prevent the password from leaking."}
{"task": "rw_26.jsonl", "id": 46379, "text": "We collect this information to complete the registration/login program, and to provide you with products and/or services exclusive to registered users, and protect your account security.", "label": ["Important", "Usage"], "rewrite": "Collect information to complete the registration/login program, provide you with products and/or services, and protect your account security."}
{"task": "rw_26.jsonl", "id": 46380, "text": "You should know that the matching result of the mobile phone number and account number and verification code/account password belongs to your sensitive personal information. We collect this type of information to meet the requirements of the real -name system of relevant laws and regulations. Such information is a necessary information for this function.If you refuse to provide this feature that may cause you, but it does not affect your browsing, searching, and playback function of your video, please consider it carefully before providing.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the matching results of your mobile phone number and account number and verification code/account password to meet the requirements of the real -name system of the network."}
{"task": "rw_26.jsonl", "id": 46381, "text": "At the same time, you can also fill in or supplement your gender, nickname, avatar, birthday, personality signature information during the registration or subsequent process. If you fail to fill in or follow the follow -up, change or change this kind of information, it may affect (including inability to not be impossibleGet) The content, advertisements, etc., which we are interested in based on your user portrait information, will not affect the normal use of registration and membership functions (such as opening).", "label": ["Important", "First Party Collection Information"], "rewrite": "You can fill in or supplement your gender, nickname, avatar, birthday, personalized signature information during the registration or subsequent process."}
{"task": "rw_26.jsonl", "id": 46382, "text": "It should be noted that some of our platforms support users to log in with account numbers (such as WeChat/Weibo/QQ and other accounts) for login. If users log in with the account of a third -party platformThe relevant information (including: user name, nickname, avatar, specifically your authorization content shall prevail) and authentication information (sensitive personal information) under the third -party account.", "label": ["Important", "First Party Collection Information"], "rewrite": "If the user logs in with an account of a third -party platform, collect information and authentication information under the third -party account authorized by the user."}
{"task": "rw_26.jsonl", "id": 46383, "text": "We collect this information to provide users with account login services and ensure user account security and prevent security risks.", "label": ["Important", "Usage"], "rewrite": "The information collected by the user's third -party account to ensure account security and prevent security risks."}
{"task": "rw_26.jsonl", "id": 46384, "text": "If the user refuses to authorize such information, the user will not be able to log in to our platform with an account on the third -party platform, but it will not affect the normal use of other products and services provided by our users.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46385, "text": "You know and agree that for your one or more contact information you provided in the process of using products and/or servicesSend multiple types of notifications to one or more of them, for user messages, authentication, security verification and other purposes;", "label": ["Important", "Usage"], "rewrite": "During the operation, you may send a multi -type notification to the contact information you provided, for user messages, authentication, security verification and other uses."}
{"task": "rw_26.jsonl", "id": 46386, "text": "In addition, we may also use the mobile phone number and emails collected in the aforementioned process to use SMS, telephone, and mail to provide you with commercial information such as advertising and business activities that you may be interestedDon't worry, if you are unwilling to accept the commercial information, you can withdraw the booking method provided by mobile phone text messages and emails, or you can directly contact us to copy.", "label": ["Important", "Usage"], "rewrite": "The collection of mobile phone numbers and emails through text messages, telephones, and emails may be used as advertising and business activities to you. You can use the withdrawal method provided by mobile phone text messages, the withdrawal method provided by the email, or contact us with a withdrawal with us."}
{"task": "rw_26.jsonl", "id": 46387, "text": "2. Search function", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46388, "text": "When users use the search function, we need to collect some relevant information, such as: search words (including voice information), search time, browsing records and time, and the number of interaction with them.", "label": ["Important", "First Party Collection Information"], "rewrite": "When users use the search function, collect information related to search."}
{"task": "rw_26.jsonl", "id": 46389, "text": "In addition, in order to facilitate your faster search, jump from links and fields shared from third parties to mango TV and avoid manual operation paste, we provide you with the convenient function of \"displaying the recent copy of the clipboard\".It may enter the corresponding interface in the mango TVApp through various types of sharing links. This function is opened by default. When you use the search function, we will show you the latest copy of the clipboard on the search page in order for you to do it for you for youQuickly provide what you need.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the search function, you show you the latest replication information on the clipboard, so that you can search quickly."}
{"task": "rw_26.jsonl", "id": 46390, "text": "Please know that we will only display the latest copy of your clipplane board, and we will not collect your clipboard behavior and will not upload the aforementioned information to our server.", "label": ["Important", "First Party Collection Information"], "rewrite": "It will only display the latest copy of your clipplane board."}
{"task": "rw_26.jsonl", "id": 46391, "text": "Only when you actively fill in the relevant information in the search box and click the search, we will collect the information in order to achieve the search function.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46392, "text": "In addition, in order to provide you with a specific service you need, when you start our products or access a specific page, we will read your clipboard content to determine whether there is a related order code (such as invitation code, member rights code)Information, only when the clipboard has information such as the previous passage code, we will collect the order code to do the cloud verification and feedback the content you need or bind the relevant rights.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you start our products or access a specific page, if there is a password code for the clipboard, collect the order of the code to do the cloud check and give you feedback."}
{"task": "rw_26.jsonl", "id": 46393, "text": "Please rest assured that we will not store other information about your clipboard, and the separate clipboard information cannot identify your specific identity.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46394, "text": "We collect this information to provide users with the required content and the services that may be more interested in, while optimizing our products and services.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the shear information to provide users with the required content and the service that may be more interested in."}
{"task": "rw_26.jsonl", "id": 46395, "text": "Content browsing or playback function", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46396, "text": "When users browse/play/download functions and services with audio and video, novels, etc., in order to better show you the content, understand the adaptability of our products or services to different hardware equipment, and ensure the safety of the user's operation environment.We need to collect some of your information, including the following personal information: device model, equipment name, equipment logo, browser type and settings, language settings, operating systems and application versions, login IP address, access network method, network quality of network quality, network qualityData, mobile network information (including operator names), product version number, log information (such as operation logs, service logs).", "label": ["Important", "First Party Collection Information"], "rewrite": "When users browse/play/download functions and services with audio and video, novels, etc., collect your equipment information, network information, log information, etc."}
{"task": "rw_26.jsonl", "id": 46397, "text": "We collect this information to provide you with the core audio and video display and playback services. Such information is a necessary information for this feature. If you refuse to provide the above permissions, it may cause you to be unable to use our products and services.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your equipment information, network information, log information, etc. to provide you with audio and video display and playback services."}
{"task": "rw_26.jsonl", "id": 46398, "text": "Advertising service or recommendation function", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46399, "text": "We will collect your personal Internet records (including your products and/or services when we use our audio and video browsing, searching, playing, communicating and interactive, ordering, and participation in us).Your basic information information (such as your nickname, gender, birthday, region, etc.), equipment information, personalized labels you actively choose (only applicable to audio and video content recommendations), geographical location information, order information, and other authorized you have authorizedPersonal information (including some information collected by your partners on the partner platform after obtaining your authorization in accordance with the law), extract your preference features, recommend more audio and video content, information and information with youDemand more matched push, advertising and other commercial information, optimization we show and search results, improve our recommendation mechanism, etc.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your personal Internet records and combine other personal information authorized by you to extract your preference characteristics to personalized recommendations for you."}
{"task": "rw_26.jsonl", "id": 46400, "text": "Please understand that in order to satisfy the various personalized advertising services of the homepage, we need to obtain your phone permissions before you enter the homepage and collect your device information (IMEI number).", "label": ["Important", "First Party Collection Information"], "rewrite": "Take your phone permissions and collect your device information to provide personalized advertising services."}
{"task": "rw_26.jsonl", "id": 46401, "text": "Some of our content will be recommended to you according to your geographical location information (for example: according to your general geographical location information corresponding to/or districts and counties to show you the local content of your area (city, district, county, etc.)Items", "label": ["Important", "Usage"], "rewrite": "Recommend local content to you based on your geographical information."}
{"task": "rw_26.jsonl", "id": 46402, "text": "According to your precise geographical information information, it is displayed to you, recommend your nearby user works, etc.).", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46403, "text": "If you refuse to authorize us to obtain your location permissions, we will not recommend to you based on the geographical information obtained through your location permissions, but it will not affect the normal use of your other functions.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46404, "text": "In the process of recommending content to you, we strive to use advanced technologies to properly protect your privacy.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46405, "text": "We will use de -identification technology and recommendation algorithms based on machine learning, model predictions, etc. to recommend you more suitable for you according to the calculation results.", "label": ["Important", "Usage"], "rewrite": "Adopt de -identification technology and recommendation algorithms based on machine learning, model prediction, etc., recommend you more suitable for you according to the calculation results."}
{"task": "rw_26.jsonl", "id": 46406, "text": "And our recommendation algorithm does not identify the true identity of a specific natural person.", "label": ["Important", "Usage"], "rewrite": "Our recommendation algorithm does not identify the true identity of a specific natural person."}
{"task": "rw_26.jsonl", "id": 46407, "text": "You can manage personalized content recommendation and procedural/personalized advertising recommendations according to the \"My-Settings-Privacy Settings\" path.", "label": ["Edit/Control", "Important"], "rewrite": "You can manage personalized content recommendation and procedural/personalized advertising recommendations according to the \"My-Settings-Privacy Settings\" path."}
{"task": "rw_26.jsonl", "id": 46408, "text": "Partners who provide data services (including online advertising monitoring, data statistics, data analysis, etc.): In order to maintain/improve our products/services and provide you with better content, we may share with designated partners who provide the serviceYour relevant information (such as: video playback records, advertising display records, terminal models, geographical location information, equipment information, etc.). For your information security, we are currently only cooperating with partners who have signed strict data security and confidentiality agreements.Including: Iri Consulting Group, etc.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share your relevant information with the designated partners who provide data services and sign a security confidentiality agreement with them."}
{"task": "rw_26.jsonl", "id": 46409, "text": "Unless you get your consent, we will not share your personal identity information with it;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Unless you get your consent, we will not share your personal identity information with partners who provide data services."}
{"task": "rw_26.jsonl", "id": 46410, "text": "Other business partners: for example: partners who entrust us to promote and advertise.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46411, "text": "You have authorized us to share the analysis/statistical information of indirect user portraits, de -identification or anonymous processing formed by partners who entrust us to promote and advertise.Or decision suggestions, increase the effective touch rate of advertising, and learn more about user needs.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "You have authorized us to have an analysis/statistical information after the indirect user portrait, de -identification or anonymous processing formed by sharing the collection of personal information with partners."}
{"task": "rw_26.jsonl", "id": 46412, "text": "But we promise: without your consent, we will not share with them personal information that can recognize your identity;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Without your consent, we will not share with the promotion and advertising service partner to recognize your personal information."}
{"task": "rw_26.jsonl", "id": 46413, "text": "Regarding cookie, we or our third -party partners may collect your information through cookies or class technology, including your device information, browsing information, click information, and store these information as a log information to remember yourIdentity analysis, what you use to use our service.", "label": ["Important", "First Party Collection Information"], "rewrite": "You may collect your information through cookie or class technology and store it as a log information to remember your identity."}
{"task": "rw_26.jsonl", "id": 46414, "text": "You can use the browser to set the use of refusal or management of cookies or similar technologies.", "label": ["Important", "Edit/Control"], "rewrite": "You can use the browser to set the use of refusal or management of cookies or similar technologies."}
{"task": "rw_26.jsonl", "id": 46415, "text": "You authorize and agree that we will collect your personal information and network behavior data, and share it with our third -party service providers (such as third -party advertising monitoring service providers), and agree to use this information to optimize advertising and improve users.Experience and related services.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "You have authorized and agreed to share your personal information and network behavior data we collected, and share it with our third -party service providers to optimize advertising, enhance user experience and related services."}
{"task": "rw_26.jsonl", "id": 46416, "text": "Video recommendations, advertising recommendations, literary recommendations, live broadcast recommendations, product recommendations, service content recommendations and related recommendations are our core business functions of our products and/or services. In the process, we need to collect your products and//Or some information in the service, including the following personal information: the content you watch, the words you searched (including voice information), the number of browsing content and advertisements, the number of interaction with them, your like/share/comment/interactive/interactiveObjects, we collect this information to recommend the service content that is better in real time and you may be more interested in, such as: Recommended TV series, movies, variety shows, advertising, etc. that you may like.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect some of your information in our products and/or services, thinking that you recommend the service content that is better and more interested in in real time."}
{"task": "rw_26.jsonl", "id": 46417, "text": "5. Recording video and voice search functions", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46418, "text": "When users use recording video, voice search, screening hall, live host voice, short video voice reviews, etc., we will visit the user's device recording related permissions, and we need to collect the user's voice information, voice interaction information (personal information).", "label": ["Permission Acquisition", "Important"], "rewrite": "When users use recording videos, voice search, screening halls, etc., we will access the user's device recording related permissions to collect users' voice information and voice interaction information."}
{"task": "rw_26.jsonl", "id": 46419, "text": "This kind of information is a necessary information for this function. If the user refuses to provide, it will only make the user unable to use the function, but it does not affect the user's normal use of products and/or services of the user.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46420, "text": "At the same time, users can also turn on/cancel the permissions at any time (such as Apple mobile phone: mobile phone system settings -privacy -microphone -mango TV).", "label": ["Important", "Edit/Control"], "rewrite": "Users can open/cancel the permissions through related functions (such as Apple mobile phone: mobile phone system settings -privacy -microphone -mango TV)."}
{"task": "rw_26.jsonl", "id": 46421, "text": "When the user opens this permission, it is deemed to be authorized by the user to access, obtain, collect, and use the user's personal information;", "label": ["Permission Acquisition", "Important"], "rewrite": "The user's opening of the device recording authority is deemed to be authorized by the user to access, obtain, collect, and use the user's personal information."}
{"task": "rw_26.jsonl", "id": 46422, "text": "But when the user cancels the authorization, we will no longer collect the information, and we will no longer provide the user with the above -mentioned services;", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46423, "text": "However, unless the user deletes the user's personal information in accordance with the law, the cancellation behavior of the user will not affect the processing and storage of our personal information based on the user's previous authorization.", "label": ["Permission Acquisition", "Important", "Risk"], "rewrite": "The cancellation of authorization will not affect the processing and storage of personal information based on authorization."}
{"task": "rw_26.jsonl", "id": 46424, "text": "6. Release information function", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46425, "text": "If users choose to upload videos or photos, play barrage, comment, or leave a message in the community, posting services, we will access the user’s mobile album permissions after the user's consent is facilitated to upload videos and pictures.Function settings open/cancel this permissions (such as Apple mobile phone: mobile phone system settings -privacy -camera -mango TV).", "label": ["Permission Acquisition", "Important", "Edit/Control"], "rewrite": "After the user's consent, access the user's mobile phone album permissions in order to facilitate the user uploaded videos and pictures. The user can set the relevant function settings to open/cancel the permission."}
{"task": "rw_26.jsonl", "id": 46426, "text": "When the user opens this permission, it is deemed to be authorized by the user to access, obtain, collect, and use the user's personal information;", "label": ["Permission Acquisition", "Important"], "rewrite": "The user's entry authority to turn on the mobile phone album is deemed to be authorized by the user to access, obtain, collect, and use the user's personal information."}
{"task": "rw_26.jsonl", "id": 46427, "text": "When the user cancel the authorization, we will no longer collect the information, and we will no longer provide the user with the above -mentioned services;", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46428, "text": "However, unless the user deletes the user's personal information in accordance with the law, the cancellation behavior of the user will not affect the processing and storage of our personal information based on the user's previous authorization.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46429, "text": "In addition to providing the above information, creation and registration account, the following information may also be provided: necessary identity information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46430, "text": "For users who upload junk advertisements, junk videos, or violations, in order to ensure the safety of content and avoid suspicious upload accounts to disturb our platform users and audiences, purify the network space, our platform may pass product functions through product functions., Extra the aforementioned user uploading ID numbers, ID cards, and photos of the same frame for additional information collection and certification. It is necessary to know that the card number, ID card, and the same frame of the same frame are sensitive personal information. If the user refuses to refuseProvided, we have the right to temporarily close the needs of these users.", "label": ["Important", "First Party Collection Information"], "rewrite": "For users who upload junk advertising, garbage videos, or violations, users need to upload an additional information collection and certification of ID numbers, ID cards, and their own frames."}
{"task": "rw_26.jsonl", "id": 46431, "text": "Secondly, the content information provided when using our service (including not limited to comments, barrage, community and other content information).", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46432, "text": "For example, the information released by users on our platform and our platform.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46433, "text": "The above information is necessary for users to upload and release videos, photos, and information on our platform.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46434, "text": "No need to upload or publish on our platform, no need to provide the above information.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46435, "text": "Do not provide the above information that does not prevent users from using the core function of \"Mango TV\".", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46436, "text": "7. Sign in, appointment and other push functions", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46437, "text": "When users use sign -in, appointment reminder, online reminder and other functions, we need to collect user personal calendar information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When users use sign -in, appointment reminder, online reminder and other functions, we need to collect user personal calendar information."}
{"task": "rw_26.jsonl", "id": 46438, "text": "If the function is refused to affect the use of this function, but does not affect other functions of normal use of products and services.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46439, "text": "At the same time, users can also open/cancel the permissions at any time through relevant functional settings, such as \"Apple mobile phone, mobile phone system settings -privacy -calendar -mango TV.", "label": ["Important", "Edit/Control"], "rewrite": "Users can set up/cancel the authority of reading calendar content through related functions."}
{"task": "rw_26.jsonl", "id": 46440, "text": "Opening this permission is deemed to be authorized to access, obtain, collect, and use user -related personal information;", "label": ["Important", "Edit/Control"], "rewrite": "The opening of the calendar authority is deemed to authorize us to access, obtain, collect, and use user -related personal information."}
{"task": "rw_26.jsonl", "id": 46441, "text": "But after closing, we will no longer collect this information, and we can no longer provide users with the above -mentioned services;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46442, "text": "However, unless users delete personal information in accordance with the law, the cancellation behavior of users will not affect the processing and storage of our personal information based on previous authorization.", "label": ["Data Retention", "Important"], "rewrite": "The cancellation of authorization will not affect the processing and storage of personal information based on authorization."}
{"task": "rw_26.jsonl", "id": 46443, "text": "8. Place order and payment function", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46444, "text": "When users buy or obtain goods and services on the \"Mango TV\" platform, including opening/renewal VIP, paid purchase on -demand, opening joint members, buying digital collections, game payment, etc.Information, such as: trading goods or service information, the name of the consignee, the receipt address and the contact number (sensitive personal information), the statement status, etc. In addition, we may also collect some other information related to the order, such as: Order number, transaction amount, payment method (sensitive personal information), we collect this information to successfully complete transactions, ensure user transaction security, query order information, provide customer service and after -sales service.", "label": ["Important", "First Party Collection Information"], "rewrite": "When a user purchase or obtains goods and services on the \"Mango TV\" platform, the user's order information is collected so that the transaction can be completed smoothly."}
{"task": "rw_26.jsonl", "id": 46445, "text": "After the order is successfully placed, if the product provided by a third -party seller or the product needs a third -party distribution, in order to complete the delivery and distribution of the goods in order to smoothly, safe, and accurately, the merchant and third -party distribution companies are inevitable within the delivery and distribution links.The ground will be known to related distribution information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If a third party provides goods or commodity distribution services, it will inevitably know the relevant distribution information during the delivery and delivery session."}
{"task": "rw_26.jsonl", "id": 46446, "text": "We promise to users that we will ensure the security of personal information with the greatest efforts. We will strictly require merchants and third -party distribution companies to keep the personal information of users, and only learn and use only with the purpose of distribution. We must not leak or do any other use.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Merchants and third -party distribution companies are required to keep their personal information confidential, only to learn and use only with the purpose of distribution, and shall not be used as other uses."}
{"task": "rw_26.jsonl", "id": 46447, "text": "9. identity authentication function", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46448, "text": "When users enter the game, publish works as a large mango creator, digital collection transactions, use mango wallets and red envelopes, or other services that need to be authenticated, in order to meet the relevant legal regulations and regulatory requirements, ensure the authenticity of the user's identity, realize anti -countermeasuresThe need for risk control, guarantee systems and services such as fraud, and providing services.The unique device identifier (IMEI code), network equipment hardware address (MAC), communication operator and belonging, mobile phone number, international mobile device recognition code (IMEI) (sensitive personal information), etc.", "label": ["Important", "First Party Collection Information"], "rewrite": "When users enter the services that need to be authenticated, collect the identity information, mobile phone number, ID card -related information, bank card, unique device identifier, network equipment hardware address, communication operator and belonging place, mobile phone number, international mobile device, international mobile equipment, international mobile devices, and international mobile devicesIdentification code and so on."}
{"task": "rw_26.jsonl", "id": 46449, "text": "We collected this information for the user's true and effective platform and the user's capital trading, user's funding security, etc. Biometric information, ID cards, bank card information, IMEI are sensitive personal information. We will only be in specific scenarios and this.Obtain and use within the scope of the policy, we will treat and carefully handle the above information (including high -intensity encryption protection, etc.). This kind of information is a necessary information for this function. If you refuse to provideThe recharge and withdrawal functions of wallets and red envelopes do not affect the normal use of the function of grabbing red envelopes.", "label": ["Important", "Data Security", "Usage"], "rewrite": "Collect information about user identity certification to protect the capital transactions of the platform and the user, and the security of the user's funds."}
{"task": "rw_26.jsonl", "id": 46450, "text": "When you conduct digital collection transactions, in order to meet the requirements of blockchain information services, anti -money laundering, and relevant laws and regulations on relevant laws and regulations, we will collect your real identity information, including your real name, ID number and face recognition informationEssence", "label": ["Important", "First Party Collection Information"], "rewrite": "When you conduct digital collection transactions, collect your true identity information."}
{"task": "rw_26.jsonl", "id": 46451, "text": "At the same time, in order to help you quickly complete the real -name authentication and risk control verification, etc., the relevant real -name authentication information (including name, ID card -related information, mobile phone number) (sensitive personal information) you once provided in our products and/or servicesYou agree that we can automatically pre -fill all the aforementioned information on other pages that need your real -name authentication. You know and recognize that we only assist in filling in and not directly transmit it.Provide itself to the corresponding service system.", "label": ["Important", "First Party Collection Information"], "rewrite": "You agree that we can automatically pre -fill the real -name authentication information on other pages that need your real -name authentication so that you can quickly complete the real -name authentication."}
{"task": "rw_26.jsonl", "id": 46452, "text": "Please note that third -party services (such as games operated by third -party operations and free traffic services for third -party telecommunications operators) may also require you to authenticate and collect your identity information. At this time, Mango TV will not collect your collection of youthese messages.", "label": ["Important", "First Party Collection Information"], "rewrite": "Third -party services may also require you to authenticate and collect your identity information."}
{"task": "rw_26.jsonl", "id": 46453, "text": "We recommend that you carefully identify the provider of actual services and read the relevant privacy policies or personal information processing rules in detail before using any third -party service.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46454, "text": "10. Operator cooperate free traffic function", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46455, "text": "When you choose to order the free flow products, to watch the mango TV content free of charge for the mango TV content that we cooperate with the operator, such as the \"let me watch the video package\" with China Mobile, and the Mango cooperation with China UnicomCard, WO+products, mango pass to cooperate with China Telecom, we will receive the device -related information (including the unique device identifier (IMEI code), network equipment hardware address (MAC), communication operators and homeland, place of ownership, and place of ownership.Mobile phone numbers, international mobile device recognition codes (IMSI)) and other related information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you choose to order the free flow product and collect the equipment related information you use."}
{"task": "rw_26.jsonl", "id": 46456, "text": "11. Game function", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46457, "text": "Operation information, etc., so that you can view your game history, and at the same time for customer service complaint processing and other game security and functional analysis.", "label": ["Important", "First Party Collection Information"], "rewrite": "When users use Mango fun game services, collect the user's game log information, including login logs, items logs, character logs, game -to -game information, operating information, etc."}
{"task": "rw_26.jsonl", "id": 46458, "text": "In order to enhance the user's game experience, we may synchronize the aforementioned game log information to the subsequent version of the game.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46459, "text": "In order to maintain the normal operation of the basic function of the game, ensure your normal use of our game products and services, optimize the performance of game products and services, improve your game experience and ensure your account security, we will collect your personal common equipment information (For example: hardware model, device MAC address, IMEI, IMSI, Android-ID), login IP address, product version number, language mode, network type and other information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect information such as your personal common equipment information, login IP address, product version number, language mode, network type, etc., so that the game can run normally."}
{"task": "rw_26.jsonl", "id": 46460, "text": "When you use the consumption function of the game product, we will collect information such as your recharge records (including trading products or service information, transaction amount, payment method, order number, payment results), consumer use records and other information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the consumption function of the game product, we will collect information such as your recharge records and consumer use records."}
{"task": "rw_26.jsonl", "id": 46461, "text": "We collect this information to help you successfully complete transactions, ensure your transaction security, query order information, provide customer service and after -sales service.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46462, "text": "Recharge records and consumer use records are sensitive personal information, which is a necessary information to realize the consumption function of game products.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46463, "text": "If you refuse to provide the above information, it may make you unable to complete the transaction.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46464, "text": "Customer service, other user response functions", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46465, "text": "When users contact our customer service or use other users to respond to functions (including: propose the after -sales application of our products and/or services, exercise your relevant personal information control, other customer complaints and needs), for the user’s account and systemSecurity, we may need users to provide account information first and match the previous personal information with the user to verify your user identity.", "label": ["Important", "First Party Collection Information"], "rewrite": "When the user uses the user's response function, the user needs to provide account information first for authentication."}
{"task": "rw_26.jsonl", "id": 46466, "text": "When users use customer service or other users to respond, we may also need to collect your sensitive personal information: contact information (the phone number/email address used by the user when contacts us or other contact information provided by the user to us), A communication information with us (including text/picture/audio and video/call records), and other necessary information associated with user needs.", "label": ["Important", "First Party Collection Information"], "rewrite": "When users use customer service or other users to respond, collect user contact information, user communication information with us, and other necessary information associated with user needs."}
{"task": "rw_26.jsonl", "id": 46467, "text": "We collect this information to investigate the facts and help users solve the problem. Such information is a necessary information for this function. If the user refuses to provide users who may not use our customer service and other user response mechanisms.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect the user's contact information, the user's communication information, and other necessary information associated with our user needs to investigate the facts and help the user solve the problem."}
{"task": "rw_26.jsonl", "id": 46468, "text": "Market promotion and news notice", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46469, "text": "(1) Event participation", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46470, "text": "When you participate in our activities, such as drawing, quiz, answering, and questionnaires, you may need to submit relevant information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you participate in our activities, you may need to submit relevant information."}
{"task": "rw_26.jsonl", "id": 46471, "text": "For example: In order to receive rewards, you need to provide necessary personal information related to receiving prizes (for example: those involved in offline sending, need to provide the consignee information;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46472, "text": "Those involved in real -name certification, such as the purchase of tickets for amusement parks, need to provide information -related information).", "label": ["Important", "First Party Collection Information"], "rewrite": "Those who involve real -name certifications need to provide information related to ID cards."}
{"task": "rw_26.jsonl", "id": 46473, "text": "In specific activities, we will read your clipboard content to determine whether there is a related oral order code (such as invitation code, member rights code) information. Only when the clipboard has the aforementioned informationAfter the verification, I will report to you what you need or bind related rights.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In a specific activity, read your clipboard content to determine whether there is a related oral order information."}
{"task": "rw_26.jsonl", "id": 46474, "text": "Please rest assured that we will not collect and store other information about your clipboard, and the separate clipboard information cannot identify your specific identity.", "label": ["Important", "First Party Collection Information"], "rewrite": "It will not collect or store other information of your clipboard, and the separate clipboard information cannot identify your specific identity."}
{"task": "rw_26.jsonl", "id": 46475, "text": "(2) Marketing promotion and message notification", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46476, "text": "For your contact information (such as contact telephone number, contact mailbox) you provided during the use process, we may send one or more of them in operation, for user message notification, identity verification, securityVerification, user use experience research and other uses.", "label": ["Important", "Usage"], "rewrite": "Use your contact information to send notifications during operation."}
{"task": "rw_26.jsonl", "id": 46477, "text": "After your authorization consent, we may provide you with commercial information such as advertising, business activities such as SMS, telephone and/or mail.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46478, "text": "If you do not want to receive our commercial information, you can be withdrawing through the withdrawal method provided by SMS and email (for example: you can reply to the marketing SMS that we send to you by replying to \"TD\").", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46479, "text": "14. Operation and product security guarantee function", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46480, "text": "We need to collect some of your information to ensure your accounts and system security when using our products and/or services, and assist in improving the security and reliability of our products and/services to prevent any harm to users, mango TVBrowse records, network usage habits, service failure information, and sensitive personal information: transaction information, member real -name certification information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect some of your information to ensure your account and system security when using our products and/or services."}
{"task": "rw_26.jsonl", "id": 46481, "text": "We will comprehensively judge your account, account and transaction risk, authentication, customer service, testing and prevention of security incidents, fraud monitoring, archiving and backup purposes based on the above information, and take necessary records, audit, analysis, disposal measures in accordance with the lawOnce we detect or suspected account security risks, we will use relevant information for security verification and risk exclusion to ensure the security of the products and services we provide to you to ensure that your rights and interests are not infringed.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "Judgment your account, account and transaction risk, and authentication based on your equipment information, network information, etc."}
{"task": "rw_26.jsonl", "id": 46482, "text": "At the same time, when account or system security issues occur, we will collect this information to optimize our products and services.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46483, "text": "In addition, in order to ensure the safety of your equipment operation environment and provide our products and/or services, prevent malicious procedures and anti -cheating, we will obtain the installation or being installed on your device after this \"Personal Information Protection Policy\" is being installed or in your deviceThe necessary application/software list information (including application/software source, application/software overall operation, collapse, frequency, etc.).", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "We will obtain the necessary application/software list information on your device after you agree with this policy to ensure the safety of your equipment operation environment."}
{"task": "rw_26.jsonl", "id": 46484, "text": "Please know that separate application/software list information cannot identify your specific identity.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46485, "text": "(2) You can choose to provide personal information independently include:", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46486, "text": "1. Additional business functions based on equipment calendar permissions", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46487, "text": "When you use social product star rooms, you will get your device calendar authority when you make an appointment for the star airborne reminder, the rice ball star airborne appointment, the membership activities of the member activities and the membership channel, the live broadcast appointment, the channel-the upcoming the online sector appointment, and collect youCalendar information.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "When you use the social product star room, we will obtain your equipment calendar authority and collect your calendar information."}
{"task": "rw_26.jsonl", "id": 46488, "text": "This kind of information is a necessary information for this function. If you refuse to provide, you will only make you unable to use this function, but it does not affect other functions of your normal use of products and/or services.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46489, "text": "The permissions of the calendar are a settings on the mango TV, and you can manage it through the privacy setting page.", "label": ["Important", "Edit/Control"], "rewrite": "You can manage the calendar authority through the privacy setting page."}
{"task": "rw_26.jsonl", "id": 46490, "text": "At the same time, you can set the author through the related functional settings page [Mango TV-Settings-Privacy Settings] to cancel the authorization. If you open this permission, you can see that you can access, obtain, collect, and use your personal information;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "You can set the calendar authorization through the relevant function setting page [Mango TV-Settings-Privacy Settings]. Opening is deemed to be authorized access, acquisition, collection, and use of your personal information."}
{"task": "rw_26.jsonl", "id": 46491, "text": "When you cancel the authorization, we will no longer collect the information, and we will no longer provide you with the above -mentioned services;", "label": ["Important", "Edit/Control"], "rewrite": "After canceling the authorization, we will no longer collect this information, and we can no longer provide you with the above -mentioned services."}
{"task": "rw_26.jsonl", "id": 46492, "text": "But unless you delete your personal information in accordance with the law, your cancellation behavior will not affect the processing and storage of our personal information based on your previous authorization.", "label": ["Data Retention", "Permission Acquisition", "Important"], "rewrite": "The cancellation of authorization will not affect the processing and storage of personal information based on authorization."}
{"task": "rw_26.jsonl", "id": 46493, "text": "2. Additional business functions based on equipment storage permissions", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46494, "text": "When you use live broadcast posters, video cache, skin bags, log storage, web offline bags, APP upgrades, user avatar display, changes, sharing, self -built channel sharing, self -built channel replacement background map, screenshot screenshot, screen recording screen recording screenPictures, video materials support preservation, rice ball dynamics/video preservation, comment picture/video preservation, upload video uploading video, upload cover map, Da Mang personal homepage, creators update personal top background maps, on -demand poster sharing, sharing of on -demand posters, sharingWhen downloading advertising materials and downloading customer target APK package, we will obtain your device storage permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use live broadcast posters, video cache, skin bags, etc., we will obtain your device storage permissions."}
{"task": "rw_26.jsonl", "id": 46495, "text": "This kind of information is a necessary information for this function. If you refuse to provide, you will only make you unable to use this function, but it does not affect other functions of your normal use of products and/or services.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46496, "text": "3. Additional business functions based on equipment album permissions", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46497, "text": "When you upload/update account avatar, map search drama, graphic/video production and release, comment, posting, opinion feedback and other business functions, we will need to obtain your equipment album authority and collect the pictures and video content you provideInformation (personal information).", "label": ["Permission Acquisition", "Important"], "rewrite": "When you upload/update account avatar, map search drama, graphic/video production and release and other business functions, we will obtain your equipment album authority and collect the pictures and video content information you provide."}
{"task": "rw_26.jsonl", "id": 46498, "text": "This kind of information is a necessary information for this function. If you refuse to provide, you will only make you unable to use this function, but it does not affect other functions of your normal use of products and/or services.", "label": ["First Party Collection Information", "Permission Acquisition"], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46499, "text": "Album permissions are a settings on your device, you can manage it through the device settings page.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46500, "text": "At the same time, you can also open/cancel the permissions through the relevant function settings on the product, for example: the path of \"mobile phone mango TVApp\" is: my - setting -privacy settings.", "label": ["Edit/Control", "Important"], "rewrite": "You can also cancel the camera authority through the \"My - Settings -Privacy Settings\" of the mobile phone mango TVAPP."}
{"task": "rw_26.jsonl", "id": 46501, "text": "If you turn on this permission, you deepen that you authorize us to access, obtain, collect, and use your personal information;", "label": ["Important", "Edit/Control"], "rewrite": "Opening the camera permissions is deemed that you authorize us to access, obtain, collect, and use your personal information."}
{"task": "rw_26.jsonl", "id": 46502, "text": "When you cancel the authorization, we will no longer collect the information, and we will no longer provide you with the above -mentioned services;", "label": ["First Party Collection Information", "Permission Acquisition"], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46503, "text": "But unless you delete your personal information in accordance with the law, your cancellation behavior will not affect the processing and storage of our personal information based on your previous authorization.", "label": ["Data Retention", "Permission Acquisition"], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46504, "text": "4. Additional business functions based on equipment camera permissions", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46505, "text": "When your shooting function, upload/update account avatar, sweeping, graphic/video production and release, live broadcast, review, space -separated gesture, eye protection mode and other business functionsCollect the pictures and video content information (personal information) you provide.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "When you use the business functions such as shooting, uploading/updating account avatars, sweeping, we will obtain your device camera permissions and collect the pictures and video content information you provide."}
{"task": "rw_26.jsonl", "id": 46506, "text": "This kind of information is a necessary information for this function. If you refuse to provide, you will only make you unable to use this function, but it does not affect other functions of your normal use of products and/or services.", "label": ["First Party Collection Information", "Permission Acquisition"], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46507, "text": "Camera permissions are a settings on your device. You can manage it through the device settings page.", "label": ["Edit/Control", "Important"], "rewrite": "You can manage the camera permissions through the device."}
{"task": "rw_26.jsonl", "id": 46508, "text": "At the same time, you can also open/cancel the permissions through the relevant function settings on the product, for example: the path of \"mobile phone mango TVApp\" is: my - setting -privacy settings.", "label": ["Important", "Edit/Control"], "rewrite": "You can open/cancel the camera permissions through the mobile phone mango TVApp's \"My - Settings -Privacy Settings\"."}
{"task": "rw_26.jsonl", "id": 46509, "text": "If you turn on this permission, you deepen that you authorize us to access, obtain, collect, and use your personal information;", "label": ["Important", "Edit/Control"], "rewrite": "If you turn on the camera permissions, you can authorize us to access, obtain, collect, and use your personal information."}
{"task": "rw_26.jsonl", "id": 46510, "text": "When you cancel the authorization, we will no longer collect the information, and we will no longer provide you with the above -mentioned services;", "label": ["First Party Collection Information", "Permission Acquisition"], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46511, "text": "But unless you delete your personal information in accordance with the law, your cancellation behavior will not affect the processing and storage of our personal information based on your previous authorization.", "label": ["Data Retention", "Permission Acquisition"], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46512, "text": "5. Additional business functions based on location permissions", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46513, "text": "In our specific services, we need to apply for your location permissions, and collect your location information after you authorize, including \"Ming Duke Script Kill\", \"McITY Ticket\", \"My Wallet-Mobile Recovery\", \"\"The service scenario of the Mangmeng chat room \", the Android side uses the digital person's currency payment, and the service scenario that will use position permissions according to business needs.", "label": ["Permission Acquisition", "Important"], "rewrite": "In our specific services, you need to obtain your location permissions and collect your location information, including \"Detective Script Kill\" and \"McITY Tickets\"."}
{"task": "rw_26.jsonl", "id": 46514, "text": "Please pay special attention, the Mango TV homepage contains personalized advertising content. In order to display the personalized advertising content of the homepage, we will obtain your location permissions when you enter the homepage.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "Get your location permissions when you enter your homepage to show the personalized advertising content of the homepage."}
{"task": "rw_26.jsonl", "id": 46515, "text": "The location permissions are a settings on your device. You can manage it through the device settings page.", "label": ["Important", "Edit/Control"], "rewrite": "You can set the location permissions through the device setting page."}
{"task": "rw_26.jsonl", "id": 46516, "text": "At the same time, you can also open/cancel the permissions through the relevant function settings on the product, for example: the path of \"mobile phone mango TVApp\" is: my - setting -privacy settings.", "label": ["Edit/Control", "Important"], "rewrite": "You can open/cancel the position permissions through the mobile phone mango TVApp: \"Mine Settings -Privacy Settings\"."}
{"task": "rw_26.jsonl", "id": 46517, "text": "If you turn on this permission, you deepen that you authorize us to access, obtain, collect, and use your personal information;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46518, "text": "But when you cancel the authorization, we will no longer collect this information, nor can it provide you with the above -mentioned services;", "label": ["First Party Collection Information", "Permission Acquisition"], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46519, "text": "But unless you delete your personal information in accordance with the law, your cancellation behavior will not affect the processing and storage of our personal information based on your previous authorization.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46520, "text": "6. Attracted business functions based on equipment microphone rights", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46521, "text": "When you use video recording, live broadcast, communication with online customer service, we will need to obtain your equipment microphone rights and collect your voice information and voice interaction information (personal information).", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "When you use video recording, live broadcast, communication with online customer service, you need to obtain your device microphone rights and collect your voice information and voice interaction information."}
{"task": "rw_26.jsonl", "id": 46522, "text": "This kind of information is a necessary information for this function. If you refuse to provide, you will only make you unable to use this function, but it does not affect other functions of your normal use of products and/or services.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46523, "text": "The microphone right is a settings on your device. You can manage it through the device settings page.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46524, "text": "At the same time, you can also open/cancel the permissions through the relevant function settings on the product, for example: the path of \"mobile phone mango TVApp\" is: my - setting -privacy settings.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46525, "text": "If you turn on this permission, you deepen that you authorize us to access, obtain, collect, and use your personal information;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46526, "text": "But when you cancel the authorization, we will no longer collect this information, nor can it provide you with the above -mentioned services;", "label": ["First Party Collection Information", "Permission Acquisition"], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46527, "text": "But unless you delete your personal information in accordance with the law, your cancellation behavior will not affect the processing and storage of our personal information based on your previous authorization.", "label": ["Data Retention", "Permission Acquisition"], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46528, "text": "7. Third -party indirect collection user information", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46529, "text": "The personal information you provided to a third party, or your personal information collected by the outside third party, cannot obtain it, and will not use unconventional methods (such as: malicious intervention of the opponent's series APP data) to obtain your personal information with software programs without authorizationEssence", "label": ["Important", "First Party Collection Information"], "rewrite": "We cannot get your personal information you provided to a third party, or your personal information collected by the external third party."}
{"task": "rw_26.jsonl", "id": 46530, "text": "If your personal information needs to be collected indirectly (such as sharing, etc.) due to the need for business development, and we will directly or unite to provide you with products or services directly or united. This scene includes you log in to us directly through a third -party account.When products and/or services, the account information (including avatars, nicknames), which we obtained from third parties, and some of our products/services are provided by business partners or we are provided with our business partners.The necessary/reasonable business is smoothly carried out, and some of your information collected by some business partners, other parties provided information about you when using our products and/or services (including the content related to your release to you, Including reviews, dynamics, pictures, photos, video, equipment information, geographical location information, etc.).", "label": ["Important", "First Party Collection Information"], "rewrite": "Our part of the information collected by some business partners indirectly provided information about you when using our products and/or services when using our products and/or services."}
{"task": "rw_26.jsonl", "id": 46531, "text": "At the same time, our professional security team carry out security reinforcement of personal information (including sensitive information reporting, sensitive information encryption storage, access permissions control, etc.).", "label": ["Important", "Data Security"], "rewrite": "Professional security teams make security reinforcements on personal information."}
{"task": "rw_26.jsonl", "id": 46532, "text": "We will use more than our personal information obtained from our personal information that are the same protection means and measures that are the same protection means and measures.", "label": ["Important", "Data Security"], "rewrite": "We will use more than our personal information obtained from our personal information that are the same protection means and measures that are the same protection means and measures."}
{"task": "rw_26.jsonl", "id": 46533, "text": "8. Personalized recommendation function", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46534, "text": "In order to provide more quality and more suitable products and services for users, and allow users to have better products and services to use the experience, under the premise of compliance with relevant laws and regulations, we may provide users with or ourThe personal information of the users collected by the product and service, combined with other information alone or combined with other information in a gathering, analyzing, or personalized manner, in order to provide personalized recommendations, including providing users with relevant personalized information, obtaining users to obtain usersWhen agreeing, share information with our partners so that they can send information about their products and services to users.", "label": ["Important", "Usage"], "rewrite": "We may use the information provided by the user to collect, analyze or personalize it alone or combine with other information to facilitate personalized recommendations."}
{"task": "rw_26.jsonl", "id": 46535, "text": "In order to push you the content that you may be most interesting, we will use your historical viewing record information to push you the video that you may be most interested in.If you are pushed, you can cancel the authorization through the relevant function setting page [Mine-Settings-Privacy Settings].", "label": ["Edit/Control", "Usage", "Important"], "rewrite": "Use your historical viewing record information to push you the videos you may be most interested in. You can set the page [My-Settings-Privacy Settings] through the relevant function settings."}
{"task": "rw_26.jsonl", "id": 46536, "text": "We may collect personal information when using our products and service when using our products and services, such as search records (including voice information), watching history, collecting records, watching duration, order information, IP address, device information (suchEquipment MAC address), access time, biased behavior, interest preferences, the number of times to watch advertisements, the number of interaction with them, the object you like/share/comment/interactiveSome information of other services are combined with recommendation algorithm modeling, programmatic advertising recommendation algorithm modeling, user behavior analysis and formation of user portraits to help us understand how users can access and use our products and services, maintenance, and maintenance, and maintenance, and maintenance, maintenance, and maintenance, and maintenance, and maintenance, and maintenance, and maintenance, and maintenance, and maintenance, and maintenance, and maintenance, and maintenance, and maintenance, and maintenance, and maintenance, and maintenance, and maintenance,,, maintenance and maintenance, and maintenance,, we haveImprove our products and services or provide personalized services/directional push to users, for example: recommending \"guessing you like\" video content and other related personalized information (our personalized information may be based on the information system and algorithmInternal automation decision mechanism is made);", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect the personal information of users when using our products and service to conduct user portraits to understand customers, maintain improvement services, or provide personalized services/directional push to users."}
{"task": "rw_26.jsonl", "id": 46537, "text": "Or make other responses to users, and at the same time, we also provide users with the exit mechanism of related targeted push.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46538, "text": "Including: In order to meet the location of recommending localized video services, the local news information, and advertising service positioning users, we will access the accurate location information of the user. You should know that the precise location information belongs to your sensitive personal information. Such information belongs to this function.The necessary information, if you refuse to provide this feature that may cause you to use us.", "label": ["Important", "First Party Collection Information"], "rewrite": "Visit the accurate location information of users to meet the recommendation of localized video services, news information, and advertising services."}
{"task": "rw_26.jsonl", "id": 46539, "text": "Users can authorize the geographical location information provided to our users (users know and agree, in some specific business scenarios, in order to improve business processing capabilities, reduce costs, or other aspects, we may use capable third -party positioning SDK to come to come to come to come to come to come to come to SDK to come to come to come to come to come to come to SDK.Get user -related information, such as using \"Advertising\" SDK to obtain user IMEI information.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "Users can authorize the geographical location information provided to our users so that we recommend the latest news in the area or more suitable for the user's service content to the user."}
{"task": "rw_26.jsonl", "id": 46540, "text": "However, without the consent of the user, we will not take the initiative to transmit the aforementioned information to the third party, so that we can recommend the latest news in the area or the service content of the user, such as the user decided to withdraw from our location information based on the location informationFor personalized recommendation/directional push, users can cancel the authorization through the relevant function setting page;", "label": ["Important", "Edit/Control"], "rewrite": "If the user decides to withdraw from our personalized recommendation/directional push based on position information, the user can cancel the authorization through the relevant function settings page."}
{"task": "rw_26.jsonl", "id": 46541, "text": "Users can authorize us to push users on the mobile terminal to push users more interested in related content. If the user wants us to stop pushing, you can set the page [My-Settings-Privacy Settings] through the relevant function.", "label": ["Important", "Edit/Control"], "rewrite": "Users can authorize us to push the content through the \"Message\", or to set the page [Mine-Settings-Privacy Settings] through the relevant function settings."}
{"task": "rw_26.jsonl", "id": 46542, "text": "And when the user exits personalized recommendation/directional push mode, we will delete or anonymous processing of information such as automatic recognition user device identification code (the user registration information is not limited).", "label": ["Data Retention", "Important"], "rewrite": "When the user exits personalized recommendation/directional push mode, we will delete or processes the information such as automatic recognition user device recognition code."}
{"task": "rw_26.jsonl", "id": 46543, "text": "At the same time, we may collect some other reasonable uses when using our products and other information when using our products to/or services, including: investigating questionnaire recovery, failure feedback, and the relevant information we get when users interact with us for research and development and improvement.Comprehensive statistics, data analysis or processing, other purposes that are approved or authorized by the user, compliance with laws or other reasonable purposes, such as the red envelope obtained by users in specific marketing activities.Obligations, so we need to collect user names and ID information (sensitive personal information) according to law.", "label": ["Important", "Usage"], "rewrite": "We may collect other reasonable purposes such as questionnaires and other information when using our products and/or services."}
{"task": "rw_26.jsonl", "id": 46544, "text": "9. Additional functions based on album permissions", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46545, "text": "When you use business functions such as reviews, barrage, video sharing, posts, posts, we will need to obtain your equipment album authority and collect the graphic and video content information (personal information) you provided.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "When you use business functions such as reviews, barrage, video sharing, posts, etc., we will need to obtain your equipment album authority and collect the graphic and video content information you provide."}
{"task": "rw_26.jsonl", "id": 46546, "text": "This kind of information is a necessary information for this function. If you refuse to provide, you will only make you unable to use this function, but it does not affect other functions of your normal use of products and/or services.", "label": ["First Party Collection Information", "Permission Acquisition"], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46547, "text": "Album permissions are a settings on your device, you can manage it through the device settings page.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46548, "text": "At the same time, you can set the page through the relevant functional settings (such as: Apple mobile phone -settings -privacy -positioning service -Mango TV) to cancel the authorization. If you open this permission, it deemed that you can access, obtain, collect, and use your use of your authority.These personal information;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46549, "text": "When you cancel the authorization, we will no longer collect the information, and we will no longer provide you with the above -mentioned services;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46550, "text": "But unless you delete your personal information in accordance with the law, your cancellation behavior will not affect the processing and storage of our personal information based on your previous authorization.", "label": ["Data Retention", "Permission Acquisition"], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46551, "text": "(3) Others", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46552, "text": "As described above, if a function or product/service that needs to collect your personal information cannot be explained in this \"Mango TV Personal Information Protection Policy\", or we are beyond the collection of your personal information, weThe purpose of the purpose and the scope of direct or reasonable correlation, we will use the \"Mango TV Personal Information Protection Policy\", page prompts, pop -ups, message notifications, website announcements or other facilitates you by collecting and using your personal information.The way you know will explain to you separately, and provide you with the way of self -choice consent, and collect and use it after obtaining your consent.", "label": ["Important", "First Party Collection Information"], "rewrite": "If we exceed the scope of the explanation range and use your personal information, we will explain to you and provide you with the way you choose to consent, and collect and use it after obtaining your consent."}
{"task": "rw_26.jsonl", "id": 46553, "text": "The user fully understands and agree that the personal information we collected and used in the following circumstances does not require the user's authorization consent, and we may not respond to the correction/modification, deletion, cancellation, withdrawal consent, and request information of the application households.The following aspects:", "label": ["Important", "First Party Collection Information"], "rewrite": "In the following circumstances, the personal information collected and used does not require the authorization consent of the user, and we may not respond to the requests of correction/modification, deletion, cancellation, withdrawal consent, and requesting information by the application households."}
{"task": "rw_26.jsonl", "id": 46554, "text": "(1) In order to establish and fulfill the contract as a party as a party, or to implement human resource management in accordance with the labor rules and regulations formulated in accordance with the law and the collective contract signed in accordance with the law;", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to establish and fulfill the contract as a party as a party, or to implement the collection and use information necessary for human resource management in accordance with the laws and regulations formulated in accordance with the law and the collective contract signed in accordance with the law, there is no need to solicit authorization."}
{"task": "rw_26.jsonl", "id": 46555, "text": "(2) To fulfill the statutory duties or the requirements of the statutory volunteer;", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to fulfill the statutory duties or the collection and usage information necessary for the statutory volunteer, there is no need to solicit authorization consent."}
{"task": "rw_26.jsonl", "id": 46556, "text": "(3) In order to deal with emergencies, or in urgent situations to protect the health and property safety of natural people;", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to cope with emergencies, or in urgent cases to protect the life and health of natural persons and the necessary collection and use information, no need to solicit authorization."}
{"task": "rw_26.jsonl", "id": 46557, "text": "(4) Implement news reports and public opinion supervision such as public interests, and deal with personal information within a reasonable scope;", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to implement news reports and public opinion supervision, deal with personal information within a reasonable scope without soliciting authorization consent."}
{"task": "rw_26.jsonl", "id": 46558, "text": "(5) Process individuals' self -disclosure or other legal personal information in accordance with the provisions of this Law;", "label": ["Important", "First Party Collection Information"], "rewrite": "In accordance with the provisions of this Law, handle individuals' self -disclosure or other personal information that have been legal and disclosed within a reasonable range, without requiring authorization consent."}
{"task": "rw_26.jsonl", "id": 46559, "text": "(6) Other circumstances stipulated in laws and administrative regulations.", "label": ["Important", "First Party Collection Information"], "rewrite": "Other collection and use information stipulated in laws and regulations does not need to solicit authorization."}
{"task": "rw_26.jsonl", "id": 46560, "text": "3. How do we store and collect user information", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46561, "text": "1. We will store user information in a secure way, including local storage (such as using APP for data cache), database and server logs.", "label": ["Data Retention", "Important"], "rewrite": "Store user information in a secure way, including local storage, database and server logs."}
{"task": "rw_26.jsonl", "id": 46562, "text": "2. Under normal circumstances, we will only store the user's personal information within the time necessary for the service purpose or under the conditions of laws and regulations.", "label": ["Data Retention", "Important"], "rewrite": "Generally, your personal information is retained within the time limit required to achieve service purposes, unless the law has other requirements."}
{"task": "rw_26.jsonl", "id": 46563, "text": "Users can choose to delete the personal information and generate the personal information provided and generated by the \"Mango TV\" service when using the \"Mango TV\" service. If the user chooses to delete the above information, we will also delete the corresponding personal information accordingly.", "label": ["Important", "Edit/Control"], "rewrite": "Users can choose to delete history, watch orders, subscriptions, etc."}
{"task": "rw_26.jsonl", "id": 46564, "text": "3. Storage location: We store your personal information in the territory of the People's Republic of China in accordance with the provisions of laws and regulations.", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in domestic operations will be stored in China."}
{"task": "rw_26.jsonl", "id": 46565, "text": "At present, we do not have a scenario that stores your personal information or provide personal information overseas for the time being.", "label": ["Data Retention", "Important"], "rewrite": "There are currently no scenarios that store your personal information or provide personal information overseas."}
{"task": "rw_26.jsonl", "id": 46566, "text": "In the future, if we need to transmit or store cross -border transmission in the future, we will inform the relevant parties that the purpose of information outbound, receiving party, security guarantee measures and security risks, and obtain the consent of users and regulators.", "label": ["Data Retention", "Important"], "rewrite": "If you need to transmit or store cross -border transmission, it will inform the relevant parties the purpose of the information outbound, receiving party, security guarantee measures and security risks, and obtain the consent of the user and regulatory authorities."}
{"task": "rw_26.jsonl", "id": 46567, "text": "4. When our products or services stop operation, we will notify users in the form of push notifications and announcements to stop collecting your personal information and delete the user's personal information or perform anonymous processing within the reasonable period.Except for laws and regulations.", "label": ["Data Retention", "Important"], "rewrite": "When stopping operation, we will make an announcement notice and delete or processes your personal information."}
{"task": "rw_26.jsonl", "id": 46568, "text": "4. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46569, "text": "1. When the user did not refuse to accept Cookie, \"Mango TV\" will set or use cookies on the user's computer, and the data information will be anonymous in order to log in or use the \"Mango TV that depends on cookies.\"Platform service or function to provide users with more thoughtful personalized services and promotion services.", "label": ["Data Retention", "Important", "Usage"], "rewrite": "With the user's failure to accept Cookie, \"Mango TV\" will set or use cookies on the user's computer, and the data information is anonymous."}
{"task": "rw_26.jsonl", "id": 46570, "text": "2. If the user's browser allows, the user can reject cookies and/or similar technologies through the browser settings to manage, (part/all);", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46571, "text": "Or delete Cookie and/or similar technologies that have been stored in users, mobile devices, or other devices that have been stored in users, so as to achieve personal information that we cannot track all or partially to track users.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46572, "text": "If the user needs to learn more about how to change the browser settings, please check the relevant setting page of the browser used by the user.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46573, "text": "You understand and know: Some of our products/services can only be realized by using cookies or similar technologies. If the user refuses to use or deletes, the user may not be able to use our related products and/or services that cannot pass it or cannot pass the service or cannot pass it through.Our products and/or services obtain the best service experience, and may also have a certain impact on user information protection and account security.", "label": ["Edit/Control", "Important"], "rewrite": "If a user refuses to use or deletes cookie, it may not be able to use our related products and/or services normally or get the best service experience."}
{"task": "rw_26.jsonl", "id": 46574, "text": "Fifth, how can we share, transfer, and publicly disclose the collection of user information", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46575, "text": "(1) Sharing", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46576, "text": "We will attach importance to the protection of your personal information. Your personal information is an important basis and component of our products or services. For your personal information, we only described in this \"Mango TV Personal Information Protection Policy\"Objectives and scope are collected and used in accordance with the requirements of laws and regulations, and are strictly confidential. We will not share your personal information with third -party companies, organizations and individuals other than Mango TV, unless there is the following or more situations:", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "We will not share your personal information with third -party companies, organizations and individuals other than Mango TV, unless there is the following or more situations:"}
{"task": "rw_26.jsonl", "id": 46577, "text": "1. Based on your own requirements, or get your explicit authorization or consent in advance;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Based on your own requirements, or obtained your explicit authorization or consent in advance, you may share your personal information."}
{"task": "rw_26.jsonl", "id": 46578, "text": "2. What is related to the obligations stipulated in the performance of our law and regulations;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "What is related to our obligations stipulated in our law and regulations may share your personal information."}
{"task": "rw_26.jsonl", "id": 46579, "text": "3. Directly related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Directly related to national security and national defense security may share your personal information."}
{"task": "rw_26.jsonl", "id": 46580, "text": "4. Directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Directly related to criminal investigation, prosecution, trial and judgment execution may share your personal information."}
{"task": "rw_26.jsonl", "id": 46581, "text": "5. Your personal information that you disclose to the public yourself;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "May share your personal information that you disclose to the public yourself."}
{"task": "rw_26.jsonl", "id": 46582, "text": "6. Collect personal information from legal disclosure information, such as through legal news reports, government information disclosure and other channels;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "May share personal information collected from legal and disclosed information."}
{"task": "rw_26.jsonl", "id": 46583, "text": "7. In the scope of legal requirements or permits, it is necessary to provide your personal information to a third party in order to protect the interests of Mango TV and its users or the public.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the scope of legal requirements or permission, it is necessary to provide your personal information to a third party in order to protect the interests of mango TV and its users or the public."}
{"task": "rw_26.jsonl", "id": 46584, "text": "8. In order to facilitate us to provide you with a service based on the mango TV associated account, or recommend the information that may be interested in, protect the human property of related companies or other users or the public from the provision of mango TV applications or servicesPersonal information may be shared between our affiliated companies.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share your personal information with related companies to recommend information to you or protect the security of personal property of all parties."}
{"task": "rw_26.jsonl", "id": 46585, "text": "We will only share the necessary personal information, and this sharing is also restricted by the purpose of this policy.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46586, "text": "If related companies want to change the purpose of personal information, we will solicit your authorization consent again;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If related companies want to change the purpose of personal information, they will solicit your authorization consent again."}
{"task": "rw_26.jsonl", "id": 46587, "text": "9. The necessary sharing of third -party business partners.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46588, "text": "You understand and agree that in order to smoothly carry out the necessary/reasonable business, meet your requirements, fulfill our obligations in related service agreements or in this policy, exercise our rights or comply with legal regulations, we may need to ask some businessPartners (third -party service providers, contractors, agents, advertising partners, application developers, etc., such as providing us with a map service supplier for location services) to share your personal information, we promise to require third parties to follow us in accordance with our according to our as us.Explanation, personal information protection policies, and other related confidentiality and security measures to handle the above information for us and use it for the following uses:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may need to share your personal information from some business partners as you provide services."}
{"task": "rw_26.jsonl", "id": 46589, "text": "Our business partners include:", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46590, "text": "(1) Service provider for our products and/or service functions: including: payment institutions that provide payment services, operators that provide one -click login service, third -party distribution company and other service providers, we share informationThe purpose is to achieve the function of our products and/or services, so that you can use it normally;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share personal information with service providers with products and/or service provision functions to realize the functions of products and/or services."}
{"task": "rw_26.jsonl", "id": 46591, "text": "(2) Third -party merchants of our platform: In order to realize the needs of your purchase of products or services (including enjoying after -sales service), we will share your order information and transaction -related information to our platform's third -party merchants;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share your order information and transaction -related information with a third -party merchant of the platform to meet your needs for your purchase of products or services."}
{"task": "rw_26.jsonl", "id": 46592, "text": "(3) Suppliers who provide technology and consulting services.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46593, "text": "We may share your personal information with a third party that supports us to provide services.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share your personal information with a third party that supports us to provide services."}
{"task": "rw_26.jsonl", "id": 46594, "text": "These institutions include institutions that provide us with infrastructure technology services, data processing, credit approval and customer service.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46595, "text": "But we require these service providers to use your information for the purpose of providing us for us, not to use your information for their own interests.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46596, "text": "(4) Partners of advertising and analysis information promotion: In order to maintain/improve our product/service and provide you with better content, we may share your relevant information with designated partners who provide the service (including: including::Video playback records, advertising display records, terminal models, equipment information (such as Android-ID, Mac fields, your city and other related information).", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share your relevant information with designated partners with advertising and analysis information promotion categories, to maintain/improve our products/services, and provide you with better content."}
{"task": "rw_26.jsonl", "id": 46597, "text": "But unless you get your permission, we will not share your personal identity information (referring to information that can identify your identity, such as names) to share with partners who provide advertising and analysis services.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Unless you get your permission, we will not share your personal identity information with partners who provide advertising and analyzing services."}
{"task": "rw_26.jsonl", "id": 46598, "text": "For advertising and analytical information promotion partners, we may provide it with information about its advertising coverage and effectiveness without providing your personal identity information, or we will make this information anonymousRecognize your personal.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46599, "text": "We will get your Mac field in the background state for advertising anti -cheating detection.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will get your Mac field in the background state for advertising anti -cheating detection."}
{"task": "rw_26.jsonl", "id": 46600, "text": "For the partners who analyze the data, in order to better analyze the usage of Mango TV users, we may provide it with data, regional distribution, and active situations of mango TV users, but we will only provide these partners with unsatisfactory personal identity identity.Statistics information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may provide statistical information that cannot recognize personal identity to the number of mango TV users, regional distribution, and active conditions to analyze data partners."}
{"task": "rw_26.jsonl", "id": 46601, "text": "We promise: without your consent, we will not share with them personal information that can recognize your identity;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Without your consent, we will not share with the partners of analyzing data to recognize your identity personal information."}
{"task": "rw_26.jsonl", "id": 46602, "text": "(5) Partners who provide a certain service with us, for example, we have carried out marketing activities with our partners. In order to provide you with normal service and meet your service needs, we will obtain your authorization separately, and you will be in yourAfter authorization, synchronize your relevant information (specifically your authorization content) to the partner.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share your personal information with a partner with us a service."}
{"task": "rw_26.jsonl", "id": 46603, "text": "(6) Partners who provide us with installation package reinforcement services, such as strengthening our applications for 360 to avoid security vulnerabilities, we will share your personal information with 360, including IMEI information and personal common devices;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share your personal information with a partner who provides us with installation package reinforcement services."}
{"task": "rw_26.jsonl", "id": 46604, "text": "In order to realize the \"application piracy detection\" function, 360 will use the application list and activation situation you have installed;", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46605, "text": "In order to achieve the \"collapse log analysis\", when you use our products to collapse, 360 will use your mobile phone system kernel version, current system time, abnormal type and content.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46606, "text": "(7) Third -party SDK service provider: Our products may include third -party SDKs or other similar applications. If you use such services provided by third parties on our platform, you agreeTo deal with your information, we will make the fonts weighing the sensitive information collected by the third party. Please consider it carefully when authorizing the third party to use such information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Our products may contain third -party SDKs or other similar applications, and you agree that you will directly collect and process your information."}
{"task": "rw_26.jsonl", "id": 46607, "text": "You can click on the \"Sharing Information List with the Third Party\" to learn more about the specific information of the third -party SDK or other similar applications.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Click \"Sharing Information List with Third Party\" to learn more about the specific information of third -party SDK or other similar applications."}
{"task": "rw_26.jsonl", "id": 46608, "text": "The aforementioned service providers collect and handle information such as information such as their own privacy clauses, not applicable to this policy.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46609, "text": "However, we will also strive to review the business access qualifications of the third party and strive to require the legal compliance and security of these service providers.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46610, "text": "In order to ensure your information security to the greatest extent, we strongly recommend that you carefully read your privacy clauses before using any third -party SDK service.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46611, "text": "In order to protect your legitimate rights and interests, if you find that there are risks of such SDK or other similar applications, it is recommended that you immediately terminate the relevant operations and get in touch with us in a timely manner;", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46612, "text": "The above -mentioned shared information is de -identified, and a third party who accepts the information sharing cannot re -identify the identity of the information.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46613, "text": "In some cases, only by sharing your personal information can we realize the core functions of our products and/or services, or provide the services you need, or deal with your disputes or disputes with others:", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46614, "text": "(1) It shared according to the relevant protocols (eg:: online protocol, platform rules, etc.) or legal documents;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share your personal information based on the relevant agreements or legal documents you signed with us."}
{"task": "rw_26.jsonl", "id": 46615, "text": "(2) The relevant agreement between you and other third parties;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "It meets your personal information about your agreed with other third parties."}
{"task": "rw_26.jsonl", "id": 46616, "text": "(3) Share based on reasonable business habits, such as: winning/winners and other information in joint marketing activities with third parties, so that they can distribute prizes/gifts to you in time;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Your personal information based on reasonable business habits."}
{"task": "rw_26.jsonl", "id": 46617, "text": "When we accept the diligence, wait;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46618, "text": "(4) Based on academic research, for example: to share with academic institutions with academic institutions for the purpose of academic research.With your consent, we will not share with them personal information that can identify your identity);", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Use your personal information based on academic research."}
{"task": "rw_26.jsonl", "id": 46619, "text": "When academic research institutions are necessary to carry out statistics or academic research based on public interests, and to provide academic research or description results, the personal information contained in the results is anonymous;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46620, "text": "(5) The requirements of the authority, the needs of litigation disputes, and other situations required by laws and regulations to be shared.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The requirements of the authority, the needs of litigation disputes, laws and regulations, etc. are shared by other needs."}
{"task": "rw_26.jsonl", "id": 46621, "text": "You can share your personal information or other information based on the mango TV platform (including unspecified objects), but the information leakage and use of information caused by your sharing,Corresponding legal responsibility.", "label": ["Important"], "rewrite": "The information leakage and use caused by your shared behavior requires your own legal responsibility."}
{"task": "rw_26.jsonl", "id": 46622, "text": "We will only share your personal information for legal, correct, necessary, specific, and clear purposes, and only share the necessary personal information.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46623, "text": "When we share information with business partners, we will protect your personal information in various ways, including but not limited to: (1) If you have the above -mentioned directors and we need to authorize the consent, we will tell you before sharing to youThe purpose and type of shared information (if you involve your sensitive personal information, we will also inform you the content involved) and sharing after obtaining your authorization consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When sharing information with business partners, we will protect your personal information in various ways, including obtaining your authorization consent."}
{"task": "rw_26.jsonl", "id": 46624, "text": "(2) Our security team will make security assessment and processing of the output form, circulation, use, etc. of information data.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Our security team will make security assessment and processing on the output form, circulation, and use of shared information and data."}
{"task": "rw_26.jsonl", "id": 46625, "text": "Please know that even if you have obtained your authorization consent, we will only share your personal information for legal, fair, necessary, specific, and clear goals, and try to treat personal information in the shared content as anonymous.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Even if you have obtained your authorization consent, we will only share your personal information for the legal, correct, necessary, specific, and clear goals, and try to be anonymous to the personal information in the shared content."}
{"task": "rw_26.jsonl", "id": 46626, "text": "You understand and know that the information after anonymous processing cannot be directed and identified, and it is no longer a personal information in the legal sense. Its processing, use, sharing, and transfer no need to obtain your authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The information after anonymous processing cannot point to and identify you. It is no longer a personal information in the legal sense and does not need to obtain your authorization consent."}
{"task": "rw_26.jsonl", "id": 46627, "text": "(2) Transfer", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46628, "text": "Transfer refers to the process of transferring personal information control to other companies, organizations or individuals.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46629, "text": "In principle, we will not transfer your personal information to other companies, organizations, and individuals, except the following situations: except:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In principle, we will not transfer your personal information to other companies, organizations, and individuals, except the following situations: except:"}
{"task": "rw_26.jsonl", "id": 46630, "text": "1. Based on your own requirements, or get your clear consent or authorization in advance;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Based on your own requirements, or get your clear consent or authorization in advance, you may transfer your personal information."}
{"task": "rw_26.jsonl", "id": 46631, "text": "2. What is related to the obligations stipulated in the performance of our law and regulations;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "What is related to our obligations stipulated in our law and regulations may transfer your personal information."}
{"task": "rw_26.jsonl", "id": 46632, "text": "3. Directly related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Directly related to national security and national defense security may transfer your personal information."}
{"task": "rw_26.jsonl", "id": 46633, "text": "4. Directly related to public safety, public health, and major public interests;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Directly related to public safety, public health, and major public interests may transfer your personal information."}
{"task": "rw_26.jsonl", "id": 46634, "text": "5. Directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Directly related to criminal investigation, prosecution, trial and judgment execution may transfer your personal information."}
{"task": "rw_26.jsonl", "id": 46635, "text": "6. Out of maintaining major legitimate rights and interests of your or other individuals, but it is difficult to get my consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Out of maintaining major legitimate rights and interests such as life and property of your or other individuals, but it is difficult to get my consent, you may transfer your personal information."}
{"task": "rw_26.jsonl", "id": 46636, "text": "7. Your personal information you disclose to the public by yourself;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You may transfer your personal information that you disclose to the public by yourself."}
{"task": "rw_26.jsonl", "id": 46637, "text": "8. Collect personal information from legal disclosure information, such as through legal news reports, government information disclosure and other channels;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Personal information collected from legal and disclosed information may be transferred."}
{"task": "rw_26.jsonl", "id": 46638, "text": "9. The company's merger, acquisition or bankruptcy liquidation, and the transfer of operating subjects.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The company's merger, acquisition or bankruptcy liquidation, transfer personal information when the operating subject is changed."}
{"task": "rw_26.jsonl", "id": 46639, "text": "10. Other circumstances stipulated in laws and regulations.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Other situations prescribed by laws and regulations may transfer personal information."}
{"task": "rw_26.jsonl", "id": 46640, "text": "If we do mergers, acquisitions, reorganization, separation, bankruptcy, asset transfer or similar transactions, and your personal information may be transferred as part of such transactions, we will ask new holders to continue to follow and fulfill the \"\"All the contents of the Mango TV Personal Information Protection Policy (including the purpose, rules of use, security measures, etc.), otherwise we will ask it to re -obtain your explicit authorization consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When involving mergers, acquisitions, or bankruptcy liquidation, if personal information transfer is involved, it will be required to continue to be bound by the policy, otherwise it will request that it will re -solicit authorization consent."}
{"task": "rw_26.jsonl", "id": 46641, "text": "If you have the above reasons to be transferred, we will inform you the purpose and type of the transfer information before the transfer (if you involve your sensitive personal information, we will also inform you the content of the sensitive information involved) and we will be inAfter obtaining your consent, transfer, but the laws and regulations have other provisions or except for the other policy.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will inform you the purpose and type of information that the transfer information will be informed before the transfer, and then transferred after obtaining your explicit consent, but the laws and regulations are otherwise stipulated or except for this policy."}
{"task": "rw_26.jsonl", "id": 46642, "text": "(3) Public disclosure", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46643, "text": "In principle, we will not disclose any of your personal information, except the following situations: except:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not disclose any of your personal information, except the following situations:"}
{"task": "rw_26.jsonl", "id": 46644, "text": "1. In the case of obtaining clear consent: After obtaining the user's explicit consent, we will transfer the user's personal information to other parties;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After obtaining the user's consent, we will transfer the user's personal information to the other parties."}
{"task": "rw_26.jsonl", "id": 46645, "text": "2. In the case of merging, acquisition or bankruptcy liquidation in our platform service provider, or other cases involving mergers, acquisitions or bankruptcy liquidation, if you involve personal information transfer, we will ask for new companies holding personal information, companies that hold personal information,Organization continues to be subject to this policy, otherwise we will ask the company, organization, and individuals to re -solicit authorization and consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When involving mergers, acquisitions, or bankruptcy liquidation, if personal information transfer is involved, it will be required to continue to be bound by the policy, otherwise it will request that it will re -solicit authorization consent."}
{"task": "rw_26.jsonl", "id": 46646, "text": "3. It is related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Release personal information related to national security and national defense security."}
{"task": "rw_26.jsonl", "id": 46647, "text": "4. Related to public safety, public health, and major public interests;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Public personal information related to public safety, public health, and major public interests."}
{"task": "rw_26.jsonl", "id": 46648, "text": "5. It is related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Public personal information related to criminal investigation, prosecution, trial, and execution of judgment."}
{"task": "rw_26.jsonl", "id": 46649, "text": "6. Out of maintaining major legitimate rights and interests of personal life, property, etc., it is difficult to get my consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The disclosure of personal information is that it is difficult to obtain my consent out of the major legitimate rights and interests such as maintaining personal life and property."}
{"task": "rw_26.jsonl", "id": 46650, "text": "7. Personal information disclosed to the public by themselves;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Personal information that users disclose to the public by themselves."}
{"task": "rw_26.jsonl", "id": 46651, "text": "8. Collect personal information from legal public information, such as legal news reports and government information disclosure.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Personal information collected from the information disclosed in legal public."}
{"task": "rw_26.jsonl", "id": 46652, "text": "6. How do we guarantee the user information security collected", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46653, "text": "\"Mango TV\" has always attached great importance to protecting users' personal information security. To this end, we have adopted multi -level protection measures such as security technical measures and supporting organizational structures and management systems that meet industry standards to maximize user information.Risk of damage, misuse, non -authorized access, non -authorized disclosure and changes.", "label": ["Important", "Data Security"], "rewrite": "A multi -level personal information security protection measures such as security technical measures and supporting organizational structures and management systems that meet industry standards are adopted."}
{"task": "rw_26.jsonl", "id": 46654, "text": "include:", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46655, "text": "1. In terms of data security transmission, password technologies such as transport layer security protocols are adopted to prevent the transmission link from being sniffed and eavesdropping risks through HTTPS and other methods.", "label": ["Important", "Data Security"], "rewrite": "The password technology such as the transport layer security protocol is used to prevent the transmission link from being sniffed and eavesdropping the risk through HTTPS and other methods."}
{"task": "rw_26.jsonl", "id": 46656, "text": "2. In terms of data security storage, the data is categorized and disposed of and adopted additional security protection measures such as independent, encrypted storage and other sensitive personal information;", "label": ["Important", "Data Security"], "rewrite": "Data are classified and disposed of and adopt additional security protection measures such as independent, encrypted storage and other sensitive personal information."}
{"task": "rw_26.jsonl", "id": 46657, "text": "3. In terms of data access and use security control, implement strict data permissions control mechanisms, adopt multiple identity authentication technology, and monitor the behavior that can handle users' information to avoid data from illegal access and unauthorized use;", "label": ["Important", "Data Security"], "rewrite": "Adopt multiple identity authentication technology and monitor the behavior that can process users to avoid data from illegal access and unauthorized use."}
{"task": "rw_26.jsonl", "id": 46658, "text": "4. Establish a complete audit mechanism, monitor and audit the full process of the data life cycle, and prevent users from encountering unauthorized interviews, public disclosure, use, modification, artificial or unexpected damage or loss;", "label": ["Important", "Data Security"], "rewrite": "Monitor and audit the full process of the data life cycle to prevent users from being interviewed and publicly disclosed in unauthorized personal information."}
{"task": "rw_26.jsonl", "id": 46659, "text": "5. Establish a dedicated personal information protection responsibility department, establish a related internal control management process, and adopt the principle of minimizing authority for staff who may contact the information of the user;", "label": ["Important", "Data Security"], "rewrite": "Establish a dedicated personal information protection responsibility department to establish a related internal control management process, and adopt the principle of minimizing authority for staff who may contact information."}
{"task": "rw_26.jsonl", "id": 46660, "text": "6. Establish a management system such as data classification and grading system, business data secure use specifications, and data cooperation specifications to ensure the disposal of users' information to meet the relevant regulations and security requirements of laws and regulations in collecting, transmission, use, storage, transfer, and destruction;", "label": ["Important", "Data Security"], "rewrite": "Establish a management system such as data classification hierarchical system, business data secure use specifications, and data cooperation specifications."}
{"task": "rw_26.jsonl", "id": 46661, "text": "7. Guarantee of cooperation agreement clauses:", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46662, "text": "(1) Before we indirectly collect your personal information from the third party, we will clearly require the third party to collect and handle personal information after the consent of your consent, and we useThe information will not exceed the scope of your authorization consent. We will also require third parties to make a commitment to the legality and compliance of the source of personal information at the level of the written agreement. If the third party violates the behavior, we will clearly ask the third partyTake the corresponding legal responsibility;", "label": ["Important", "First Party Collection Information", "Data Security"], "rewrite": "Before we indirectly collect your personal information from a third party, we will ask the third party to obtain your explicit consent in writing, and the use information does not exceed the scope of your authorization."}
{"task": "rw_26.jsonl", "id": 46663, "text": "(2) Before we share your personal information with business partners, we will strictly require partners' information protection obligations and responsibilities, and ask business partners to sign a protection agreement on data security before cooperation. Once the business partners haveAny violation of the agreement will bear the corresponding legal responsibility;", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Before we share your personal information with business partners, partners are required to sign a data security protection agreement."}
{"task": "rw_26.jsonl", "id": 46664, "text": "(3) The contents of other cooperation agreements are clearly agreed.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46665, "text": "8. Other feasible security organizations and management measures", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46666, "text": "(1) Before we indirectly collect user information from a third party, we will clearly require the third party to collect and process personal information in writing in writing (such as cooperation agreements and commitments) to request the third party after obtaining the consent of the user.At the level of the written agreement, the third party requires a commitment to make a commitment to the legality and compliance of the source of personal information. If the third party violates the behavior, we will clearly ask the other party to bear the corresponding legal responsibility;", "label": ["Important", "First Party Collection Information"], "rewrite": "Before we indirectly collect the user's personal information from the third party, we will require the third party to make the third party in writing that the user's consent and promise the legitimacy and compliance of the information source."}
{"task": "rw_26.jsonl", "id": 46667, "text": "(2) Before we share user information from business partners, we will strictly require partners' information protection obligations and responsibilities. To this end, our legal department also specifically amended the \"data security and confidentiality of data security and confidentiality between business partners.The Agreement \"and required business partners to sign before the cooperation. The agreement strictly agreed that the user information confidentiality obligations of business partners, including information storage, use, and circulation, etc., all meet our management and control requirements.Audit, once any violation, will bear the corresponding legal liability;", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Before we share the personal information of users with business partners, we will sign a confidentiality agreement with them and ask them to bear the obligation and responsibility of information protection."}
{"task": "rw_26.jsonl", "id": 46668, "text": "(3) We have established a reasonable, effective, scientific and sound safety emergency response system, clarifying the classification and grading standards of cyber security incidents, safety emergency response organizations and responsibilities, and formulating an appropriate emergency response plan based on different types and levels of security events., Clearly regulate the report process and emergency response process of safety events.", "label": ["Important", "Data Security"], "rewrite": "Establish a security emergency response system to clarify the classification and grading standards of cyber security incidents, security emergency response organizations and responsibilities, reporting processes and emergency response disposal processes of safety events."}
{"task": "rw_26.jsonl", "id": 46669, "text": "At the same time, we also have the \"Mango TV\" safety emergency response center. The safety technology and operation team is responsible for maintenance, which facilitates time and effective response, dispose of various security vulnerabilities and emergencies, and combines relevant departments to trace the source and strikes of safety events;", "label": ["Important", "Data Security"], "rewrite": "Safety technology and operation teams are responsible for maintaining the \"Mango TV\" Safety Emergency response center to facilitate handling various types of security vulnerabilities and emergencies."}
{"task": "rw_26.jsonl", "id": 46670, "text": "Formulate remedial measures and combined relevant departments to trace the source and crack down.", "label": ["Important", "Data Security"], "rewrite": "Establish a special emergency response team to launch a safety plan for different security events."}
{"task": "rw_26.jsonl", "id": 46671, "text": "At the same time, we will inform you in a timely manner in accordance with the requirements of laws and regulations: the basic situation and possible impact of security incidents, the disposal measures we have adopted or we are going to take, the suggestions that you can prevent and reduce risks, and remedy your remedy measures, etc.Essence", "label": ["Important", "Data Security"], "rewrite": "If a personal information security incident occurs, we will inform your basic situation, possible impact, disposal measures, independent prevention suggestions, etc."}
{"task": "rw_26.jsonl", "id": 46672, "text": "At the same time, we will inform you that the incident -related situation is in the form of email, letter, telephone, push notification, etc. When it is difficult to inform the subject of personal information one by one, we will publish an announcement in a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "The relevant situation of security incidents will be informed by mail, letter, telephone, push notification, etc. When it is difficult to inform one by one, it will issue an announcement."}
{"task": "rw_26.jsonl", "id": 46673, "text": "At the same time, we will also actively report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "Report the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities."}
{"task": "rw_26.jsonl", "id": 46674, "text": "Please know and understand that the Internet is not an absolute security environment. We strongly recommend to help us ensure the security of users through security methods and complex passwords.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46675, "text": "If you find your own personal information leakage, especially the user's own account or password leak, please contact us according to the contact information provided at the end of this policy, so that we can take corresponding measures to protect the user's personal information security.", "label": ["Important", "Data Security"], "rewrite": "If the personal information discovered, please contact our customer service immediately."}
{"task": "rw_26.jsonl", "id": 46676, "text": "Seven, how do users manage their own information", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46677, "text": "1. \"Mango TV\" in accordance with the requirements of the \"Personal Information Protection Law of the People's Republic of China\", through providing convenient methods, you can access, correct and delete your account information at any time, and other individuals provided by users when using our servicesInformation can also withdraw the consent of your personal information before, and you can also cancel your registered account.", "label": ["Important", "Edit/Control"], "rewrite": "You can access, correct and delete your account information at any time, and withdraw authorization, cancel your account, etc."}
{"task": "rw_26.jsonl", "id": 46678, "text": "You can access and manage user personal information in the following ways.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46679, "text": "2. Visit personal information -if you want to access or edit the personal basic information and payment information in the account, change passwords, add security information or close accounts, etc., you can log in to the account number to execute this category through \"Settings -Account and Security\"operate;", "label": ["Important", "Edit/Control"], "rewrite": "You can log in to the account number to access or edit personal basic information information and payment information and payment information, change passwords, add security information or close accounts such as \"Settings -Account and Security\"."}
{"task": "rw_26.jsonl", "id": 46680, "text": "For example, you can log in to the mobile phone, \"Settings -Account and Security\" query, modify your personal information, privacy settings, security settings, and modify your personal registration information.", "label": ["Important", "Edit/Control"], "rewrite": "Log in to the mobile phone \"Settings -Account and Security\" query, modify your personal information, privacy settings, security settings, and modify your personal registration information."}
{"task": "rw_26.jsonl", "id": 46681, "text": "3. Delete personal information -you can delete your personal information you filled in by \"Settings -Account and Security -My Information\".", "label": ["Important", "Edit/Control"], "rewrite": "You can delete your personal information you filled in by \"Settings -Account and Security -My Information\"."}
{"task": "rw_26.jsonl", "id": 46682, "text": "In the following circumstances, users can make a request to delete personal information:", "label": ["Edit/Control", "Important"], "rewrite": "In the following circumstances, users can make a request to delete personal information:"}
{"task": "rw_26.jsonl", "id": 46683, "text": "(1) We violate the provisions of laws and administrative regulations or have a agreement with you, collect, store, use, transfer, and disclose personal information of user;", "label": ["Important", "Edit/Control"], "rewrite": "If we violate the provisions of laws and administrative regulations or to collect, store, use, transfer, and disclose personal information of user information, you can ask for deletion of personal information."}
{"task": "rw_26.jsonl", "id": 46684, "text": "(2) Our scope or necessary period of collection, storage, use, transfer, and disclosure of personal information of user information;", "label": ["Important", "Edit/Control"], "rewrite": "If we are beyond the scope or necessary period of collection, storage, use, transfer, and disclosure of personal information of user information, you can ask for deletion of personal information."}
{"task": "rw_26.jsonl", "id": 46685, "text": "(3) We collected and used the user's personal information, but we did not obtain a clear consent or the user withdrew the consent;", "label": ["Edit/Control", "Important"], "rewrite": "If we collect and use the user's personal information, but if we have not obtained a clear consent or the user withdraws, you can ask for deleting personal information."}
{"task": "rw_26.jsonl", "id": 46686, "text": "(4) The user no longer uses our products or services, or the user actively canceled the account;", "label": ["Important", "Edit/Control"], "rewrite": "If the user no longer uses our products or services, or the user actively cancels the account, you can ask for deleting personal information."}
{"task": "rw_26.jsonl", "id": 46687, "text": "(5) We no longer provide products or services for users;", "label": ["Important", "Edit/Control"], "rewrite": "If we no longer provide products or services for users, you can ask for deletion of personal information."}
{"task": "rw_26.jsonl", "id": 46688, "text": "(6) Other circumstances stipulated in laws and regulations.", "label": ["Important", "Edit/Control"], "rewrite": "You can request to delete personal information as stipulated in laws and regulations."}
{"task": "rw_26.jsonl", "id": 46689, "text": "4. List of personal information main body-if you need to cancel the account of Mango TV, you can implement it through \"setting-account number and security-cancellation account\".", "label": ["Important", "Edit/Control"], "rewrite": "You can cancel the account of the mango TV through \"Settings-Account and Security-Logging out\"."}
{"task": "rw_26.jsonl", "id": 46690, "text": "You can also contact our platform customer service. After verifying the user identity, the customer service will release the user's mobile phone number and mailbox to achieve the effect of cancellation. Account cancellation is not exit and log in. After you click the cancellation of the account buttonPlease read the \"Account Logging off\" and confirm that you understand the impact of account cancellation before confirming the cancellation.", "label": ["Important", "Edit/Control"], "rewrite": "You can contact our platform customer service. After verifying the user identity, customer service will release the user's mobile phone number and mailbox to achieve the effect of cancellation."}
{"task": "rw_26.jsonl", "id": 46691, "text": "5. After the user actively cancels the account, we will stop providing products or services, delete user personal information according to the requirements of applicable laws, or make them anonymous processing.", "label": ["Data Retention", "Important", "Edit/Control"], "rewrite": "After canceling the account, we will stop providing products or services, delete user information, or make it anonymous processing."}
{"task": "rw_26.jsonl", "id": 46692, "text": "If the user has a video uploaded on our platform before canceling the account, if you do not want the relevant videos to continue to spread on our platform, please delete it yourself.", "label": ["Important", "Edit/Control"], "rewrite": "If the user has a video uploaded on our platform before canceling the account, please delete it by itself."}
{"task": "rw_26.jsonl", "id": 46693, "text": "If you do not choose to delete, it will be deemed to agree that such videos will continue to authorize our platform to spread information networks.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "If the user does not choose to delete the uploaded videos, it is deemed to agree that such videos will continue to authorize our platform to spread the information network."}
{"task": "rw_26.jsonl", "id": 46694, "text": "If the user chooses not to delete the relevant uploaded videos, after canceling the account, these videos will be anonymous desensitization processing during the display on our platform.", "label": ["Data Retention", "Important"], "rewrite": "If the user choose not to delete the relevant uploaded videos, after canceling the account, these videos will be anonymous desensitization."}
{"task": "rw_26.jsonl", "id": 46695, "text": "6. You have the right to get your personal information copy in accordance with laws and regulations or national standards. You can send emails to [privacy@mgtv.com] to contact us.", "label": ["Important", "Contact Information", "Edit/Control"], "rewrite": "Send an email to [privacy@mgtv.com] contact us to get your personal information copy."}
{"task": "rw_26.jsonl", "id": 46696, "text": "After verifying your identity, we will reply to you within 15 working days to help solve your problems.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46697, "text": "7. Personalized display/push", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46698, "text": "Personalized recommendation advertising is a general advertising technology, which is based on your own behavior data in the application. It can greatly enhance the correlation between advertising content and interest preferences.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46699, "text": "In order to recommend high -quality personalized screen advertisements to you, we will request access to your mobile phone status, location, and storage permissions in the process of using Mango TV., Location and storage authority related functions.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "In order to recommend personalized screen ads to you, we will ask for your mobile phone status, location, and storage permissions, and you can refuse to authorize."}
{"task": "rw_26.jsonl", "id": 46700, "text": "Please rest assured that we will only use your behavior data within your authorization range and will not leak out.", "label": ["Permission Acquisition", "Important"], "rewrite": "We will only use your behavior data within your authorization range and will not leak out."}
{"task": "rw_26.jsonl", "id": 46701, "text": "If you don't want to receive personalized display or advertising push after passing the algorithm automatic decision, you can pass the convenient management path [Mine-Settings-Privacy Settings] from the Lord to choose whether to accept this type of advertisement.", "label": ["Edit/Control", "Important"], "rewrite": "You can choose whether to accept personalized display or advertising push through [Mine-Settings-Privacy Settings]."}
{"task": "rw_26.jsonl", "id": 46702, "text": "After you refuse to accept the push service, we will delete or anonymous processing of your personal information collected to achieve personalized push, and to provide you with business functions, no longer push based on your personal information.", "label": ["Important", "Usage"], "rewrite": "After you refuse to recommend personalized advertising services, you can delete or treat your personal information collected to achieve personalized push."}
{"task": "rw_26.jsonl", "id": 46703, "text": "But please understand that after you turn off a personalized display/push, the number of advertisements on the platform will not decrease, but the degree of advertising will be reduced.", "label": ["Important", "Usage"], "rewrite": "After closing the personalized display/push, the number of advertisements on the platform will not decrease, but the degree of advertising will be reduced."}
{"task": "rw_26.jsonl", "id": 46704, "text": "8. Withdraw your authorization consent", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46705, "text": "Please understand that each business function often needs to open part of the authority and collect the necessary personal information to achieve it. For the management of your personal information, and the management of equipment permissions, you can provide it through equipment system permissions or Article 10 of this policy.Contact us to withdraw from consent, or operate by yourself through the following ways:", "label": ["Edit/Control", "Important"], "rewrite": "For the collection, use of your personal information and the management of equipment permissions, you can withdraw your consent through the device system permissions or contact us, or operate yourself by yourself."}
{"task": "rw_26.jsonl", "id": 46706, "text": "(1) When you want to withdraw the authorization of storage, telephone, location information, camera, microphone, and calendar functions, the withdrawal path is [My - Settings -Privacy Settings];", "label": ["Important", "Edit/Control"], "rewrite": "When you want to withdraw the authorization of storage, telephone, location information, camera, microphone, and calendar functions, the withdrawal path is [My - Settings -Privacy Settings]."}
{"task": "rw_26.jsonl", "id": 46707, "text": "(2) When you want to withdraw the authorization of Touchid, and, Faceid, the lifting path is [My - Account and Security -Touch, ID/FACE, ID].", "label": ["Important", "Edit/Control"], "rewrite": "When you want to withdraw the authorization of Touchid and FACEID, the lifting path is [Mine -Settings -Account and Security — Touch ID/FACE ID]."}
{"task": "rw_26.jsonl", "id": 46708, "text": "After you withdraw your consent, we will no longer process the corresponding personal information, but please understand that when you withdraw your consent or authorization, we cannot continue to provide you with specific functions and/or services corresponding to the withdrawal consent or authorization.", "label": ["Important", "Edit/Control"], "rewrite": "After you withdraw your consent, we will no longer process the corresponding personal information, and we will no longer continue to provide corresponding functions or services."}
{"task": "rw_26.jsonl", "id": 46709, "text": "The decision you withdraw from consent will not affect personal information processing based on your authorization.", "label": ["Edit/Control", "Important"], "rewrite": "The decision to withdraw consent will not affect the personal information processing that was previously authorized."}
{"task": "rw_26.jsonl", "id": 46710, "text": "9. Protection of personal information of dead users", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46711, "text": "In order to their own legal and legitimate interests, the close relatives of the dead users can exercise, copy, correct, delete, delete, delete, etc. of the relevant personal information of the dead users through the \"How to contact us\" contact information in Article 10Rights, except for other arrangements for death users.", "label": ["Specific Audiences", "Important"], "rewrite": "For the close relatives of the dead users, for their own legal and legitimate interests, they can contact us to exercise their rights to the relevant personal information of the dead users, except for other arrangements during their lifetime."}
{"task": "rw_26.jsonl", "id": 46712, "text": "You understand and confirm that in order to fully protect the personal information rights and interests of the dead users, the close relatives who apply for the right to exercise the rights of this article need to submit the identity document, death certificate document, application, application, application, application, and application according to the specified process or customer service prompts of the personal information protection team.The person's identity document, the proof of the relative relationship of the applicant and the death user, and provide the types and purpose of the right to apply for exercise.", "label": ["Specific Audiences", "Important"], "rewrite": "A close relatives who apply for the right to exercise their rights need to submit identity documents, death certification documents, applicants' identity documents, applicants and relative relationship documents, and provide the types of rights and purposes of applications."}
{"task": "rw_26.jsonl", "id": 46713, "text": "We will provide corresponding services to users and their close relatives after verification, except for laws and regulations and this rule.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46714, "text": "10. respond to your above request", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46715, "text": "To ensure safety, we may first ask you to verify your identity before processing your request.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46716, "text": "For your request, in principle, we will reply to your request and reply to you within the fifteen working days after verifying your user identity to help solve your problems.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46717, "text": "For your reasonable request, we do not charge fees in principle.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46718, "text": "However, we will charge a certain cost fee depending on the situation for requests that repeat and beyond a reasonable limit.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46719, "text": "For those who are contrary to laws and regulations, repetition for no adults, too much technical means (such as need to develop new systems or fundamentally change the current practice), bring risks or very unrealistic requests to others' legitimate rights and interests, we may give itreject.", "label": ["Important", "Edit/Control"], "rewrite": "We may refuse to repeat for unseen, need too much technical means, bring risks or very unrealistic requests to others' legitimate rights and interests."}
{"task": "rw_26.jsonl", "id": 46720, "text": "In the following circumstances, in accordance with the requirements of laws and regulations, we will not be able to respond to your request:", "label": ["Important", "Edit/Control"], "rewrite": "In the following circumstances, in accordance with the requirements of laws and regulations, we will not be able to respond to your request:"}
{"task": "rw_26.jsonl", "id": 46721, "text": "(1) Related to the obligations stipulated in the performance of our laws and regulations;", "label": ["Important", "Edit/Control"], "rewrite": "If your request is related to the obligations stipulated in our laws and regulations, it may not be responding."}
{"task": "rw_26.jsonl", "id": 46722, "text": "(2) Directly related to national security and national defense security;", "label": ["Edit/Control", "Important"], "rewrite": "If your request is directly related to national security and national defense security, you may not be responded."}
{"task": "rw_26.jsonl", "id": 46723, "text": "(3) Directly related to public safety, public health, and major public interests;", "label": ["Important", "Edit/Control"], "rewrite": "Your request is directly related to public safety, public health, and major public interests and may not be responded."}
{"task": "rw_26.jsonl", "id": 46724, "text": "(4) Directly related to criminal investigation, prosecution, trial and judgment execution;", "label": ["Important", "Edit/Control"], "rewrite": "Your request is related to criminal investigation, prosecution, and trial, and may not be responded."}
{"task": "rw_26.jsonl", "id": 46725, "text": "(5) We have sufficient evidence that you have subjective malicious or abuse of rights;", "label": ["Important", "Edit/Control"], "rewrite": "If we have sufficient evidence that the subject of personal information has subjective malice or abuse of rights, we may not be able to respond to requests."}
{"task": "rw_26.jsonl", "id": 46726, "text": "(6) For major legitimate rights and interests such as maintaining your or other individuals, but it is difficult to get the consent of my authorization;", "label": ["Important", "Edit/Control"], "rewrite": "Out of the major legitimate rights and interests of the life and property of personal information subjects or other individuals, but it is difficult to get my consent, we may not be able to respond to the request."}
{"task": "rw_26.jsonl", "id": 46727, "text": "(7) In response to your request, the legitimate rights and interests of you or other individuals and organizations are seriously damaged;", "label": ["Important", "Edit/Control"], "rewrite": "We may not be able to respond to requests that exceed the storage range, exceed the reasonable limit, or the legitimate rights and interests of personal information subjects or other individuals and organizations will be seriously damaged."}
{"task": "rw_26.jsonl", "id": 46728, "text": "(8) Involved in business secrets.", "label": ["Important", "Edit/Control"], "rewrite": "We may not be able to respond."}
{"task": "rw_26.jsonl", "id": 46729, "text": "If you have further requirements or any questions, opinions or suggestions on your own rights as the main right of the data, you can contact us and exercise your relevant rights through the \"contact us\" section in this policy.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46730, "text": "8. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46731, "text": "1. Before using our services under the age of 14, a minor should read and read and agree to the \"Mango TV Personal Information Protection Policy\" under the guardian's supervision and guidance.Items", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a child under the age of 14, please read the privacy policy with your guardian and provide information under the consent and guidance of the guardian."}
{"task": "rw_26.jsonl", "id": 46732, "text": "2. Minors who have reached the age of 14 should submit personal information under the guidance of and guardian's guidance with their guardians at the age of 14.", "label": ["Specific Audiences", "Important"], "rewrite": "Subsidies who have reached the age of 14 should submit personal information under the guidance of and guardian's guidance with the guardian."}
{"task": "rw_26.jsonl", "id": 46733, "text": "3. In accordance with the provisions of relevant national laws and regulations, we protect personal information of minors, and will only collect, use, or publicly disclose personal information of minors with the consent of laws and guardians.", "label": ["Specific Audiences", "Important"], "rewrite": "We will only collect, use, or publicly disclose personal information of minors when the laws permit and the guardian clearly agree."}
{"task": "rw_26.jsonl", "id": 46734, "text": "If we find the personal information of minors without obtaining the consent of the guardian in advance, we will try to delete relevant data as soon as possible.", "label": ["Specific Audiences", "First Party Collection Information", "Important"], "rewrite": "If the personal information of minors was collected without the consent of the legal guardian, he would try to delete relevant information as soon as possible."}
{"task": "rw_26.jsonl", "id": 46735, "text": "4. Regarding the collection, use, storage, and protection rules of the personal information of minors under the age of 14, we have developed a special terms. Please the guardian read carefullyProtection Rules.", "label": ["Specific Audiences", "Important"], "rewrite": "Regarding the collection, use, storage, and protection rules of minors under the age of 14, the guardian is requested to read the \"Personal Information Protection Rules for Mango TV\"."}
{"task": "rw_26.jsonl", "id": 46736, "text": "Nine, the revision and update of this policy", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46737, "text": "1. \"Mango TV\" has the right to modify personal information protection policies and announce it through our platform or notify the user through our platform before revising. In this case, please read the new version of personal information protection policies and explicitly explicitly show usAuthorized.", "label": ["Policy Change", "Important"], "rewrite": "Please read the new version of the personal information protection policy and authorize us."}
{"task": "rw_26.jsonl", "id": 46738, "text": "If you click on the button such as \"Agreement\" and continue to use our services, it means the constraints of personal information protection policies of our platform that have been revised.", "label": ["Policy Change", "Important"], "rewrite": "If you click on the button such as \"Agreement\" and continue to use our services, it means the constraints of personal information protection policies of our platform that have been revised."}
{"task": "rw_26.jsonl", "id": 46739, "text": "2. Without the user's clear consent, we will not restrict the rights of users in accordance with the rights that they should enjoy in accordance with this policy.", "label": ["Important"], "rewrite": "Without the user's explicit consent, we will not limit the rights that users should enjoy in accordance with this policy."}
{"task": "rw_26.jsonl", "id": 46740, "text": "We will publish any changes and updates made on personal information protection policies on the \"Mango TV\" special link.", "label": ["Policy Change", "Important"], "rewrite": "We will publish any changes and updates made on personal information protection policies on the \"Mango TV\" special link."}
{"task": "rw_26.jsonl", "id": 46741, "text": "3. For major changes, we will also provide a more significant notice.", "label": ["Policy Change", "Important"], "rewrite": "For major changes, we will also provide a more significant notice."}
{"task": "rw_26.jsonl", "id": 46742, "text": "The major changes in this policy include, but not limited to:", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46743, "text": "(1) Our service model has changed significantly.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46744, "text": "Such as the purpose of handling personal information, the type of personal information, the use of personal information, etc.;", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46745, "text": "(2) We have changed significantly in control and other aspects.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46746, "text": "Change of the owner caused by mergers and acquisitions and reorganizations;", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46747, "text": "(3) The main object of personal information sharing, transfer or public disclosure changes;", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46748, "text": "(4) The right to participate in personal information processing and its exercise methods have changed significantly;", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46749, "text": "(5) When we are responsible for handling the responsibility departments, contact methods and complaint channels of personal information security;", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46750, "text": "(6) Evaluation report on personal information security impact indicates that there is a high risk.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46751, "text": "10. Contact us", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46752, "text": "1. If the user has any complaints and suggestions on Mango TV, please contact our customer service mailbox: service@mgtv.com;", "label": ["Important", "Contact Information"], "rewrite": "Customer service mailbox: service@mgtv.com."}
{"task": "rw_26.jsonl", "id": 46753, "text": "Artificial customer service channel: 4009770707;", "label": ["Important", "Contact Information"], "rewrite": "Artificial customer service channel: 4009770707."}
{"task": "rw_26.jsonl", "id": 46754, "text": "2. We will review the issues involved as soon as possible and reply within 15 days after verifying the user's user identity;", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46755, "text": "3. Our contact address is: Kaifu District, Changsha City, Hunan Province, Xiyu Building in the West of Hunan International Convention and Exhibition Center, Mango TV;", "label": ["Important", "Contact Information"], "rewrite": "The contact address is: Kaifu District, Changsha City, Hunan Province, Xiyu Building, West Affiliated Hunan International Convention and Exhibition Center, Mango TV."}
{"task": "rw_26.jsonl", "id": 46756, "text": "Postal code: 410000, contact number: 0731-82871680;", "label": ["Important", "Contact Information"], "rewrite": "Postal code: 410000, contact number: 0731-82871680."}
{"task": "rw_26.jsonl", "id": 46757, "text": "4. We have set up a special personal information protection team. If you have any questions about personal information protection policies, data security and personal information, please send emails to mailbox: privacy@mgtv.com, we will reply within 15 days.", "label": ["Important", "Contact Information"], "rewrite": "Special personal information protection team, mailbox: privacy@mgtv.com."}
{"task": "rw_26.jsonl", "id": 46758, "text": "11. Other related information", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46759, "text": "1. \"Mango TV Personal Information Protection Policy\" is a unified application of general user information privacy clauses that are uniformly applicable to the \"Mango TV\". Among them, the user rights and information security guarantee measures specified in are suitable for \"Mango TV\" users.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46760, "text": "For example, the \"Mango TV Personal Information Protection Policy\" is inconsistent or contradictory with the privacy protection guidance of specific products or services. Please refer to the protection guidance of specific products or services.", "label": [], "rewrite": []}
{"task": "rw_26.jsonl", "id": 46761, "text": "2. If the user continues to use the \"Mango TV\" services, it is deemed to accept the change of this \"Mango TV Personal Information Protection Policy\".", "label": ["Policy Change", "Important"], "rewrite": "If users continue to use the services provided by Mango TV, they are deemed to accept changes in this \"Mango TV Personal Information Protection Policy\"."}
{"task": "rw_26.jsonl", "id": 46762, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
