{"task": "rw_29.jsonl", "id": 47249, "text": "Recent update date: 2022-04-11", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47250, "text": "Dear 12306 users (\"user\" or \"you\"): We updated the Privacy Policy.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47251, "text": "The updated version adds the information that the shortcut refund service needs to provide.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47252, "text": "Welcome to visit 12306!", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47253, "text": "12306 reminds you: 12306 network is an important window for railway service customers. It is operated by the China Railway Science Research Institute Group Co., Ltd. and the headquarters is located at No. 2 Dali Shushu Road, Haidian District, Beijing.", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47254, "text": "This privacy policy is closely related to the use of 12306 products or services on the 12306 network (hereinafter referred to as \"service\"). Please carefully read and confirm that you have fully understood and agree with the privacy policy, especially the thickened or lower line.Content.", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47255, "text": "12306 knows the importance of personal privacy and will do its best to protect your personal information security and reliable.", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47256, "text": "We are committed to maintaining your trust in us, abiding by the following principles, and protecting your personal information: the principles of consistency and responsibility, the principles of clear purpose, the principles of consent, the principle of minimum necessary necessary, the principles of safety, the principles of subject participation, and the principle of openness and transparency.", "label": ["Important", "Data Security"], "rewrite": "Adhere to the following principles, protect your personal information: the principles of consistent power and responsibility, the principles of clear purpose, the principle of selection consent, the principle of minimum necessary necessary, the principle of safety, the principle of subject participation, the principle of openness and transparency, etc."}
{"task": "rw_29.jsonl", "id": 47257, "text": "We will also take corresponding security protection measures to protect your personal information in accordance with the mature safety standards of the industry.", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47258, "text": "The personal information we collected during your use of the 12306 network will be used only in this \"Privacy Policy\".", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47259, "text": "Article 8 of this privacy policy specifies the personal information protection of minors. If you are the legal guardian of minor users, please carefully read the terms of the protection of minors and choose whether to agree with the privacy policy.At the same time, please educate and guide minors to enhance personal information protection awareness and ability. If without your consent, do not provide any personal information to any product and service provider;", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47260, "text": "If you are a minor user, use our products and services to obtain your legal guardian's consent or provide information to us.", "label": ["Specific Audiences", "Important"], "rewrite": "Minor users should use products and services or provide information on the premise of obtaining the consent of the legal guardian."}
{"task": "rw_29.jsonl", "id": 47261, "text": "In order to comply with the \"Provisions on the Protection of Children's Personal Information Network\", we have further stipulated personal information protection measures under the age of 14.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47262, "text": "This privacy policy will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47263, "text": "1. How to collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47264, "text": "2. How to share, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47265, "text": "3. How to save your personal information", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47266, "text": "4. Use of cookies", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47267, "text": "5. Personal sensitive information prompt", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47268, "text": "6. Personal information security", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47269, "text": "7. The disposal of personal information security incident", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47270, "text": "8. Protection of personal information of minors", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47271, "text": "9. Your personal information rights", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47272, "text": "10. Change of this privacy policy", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47273, "text": "11. How to contact us", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47274, "text": "1. How to collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47275, "text": "You understand and agree:", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47276, "text": "In order to bring you a better product and service experience, we are continuously working hard to improve our technology. Then we may launch new or optimized functions from time to time, and we may need to collect, use new personal information or change personal informationPurpose or method.", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47277, "text": "In this regard, we will explain to you by updating this privacy policy or through pop -ups or page prompts, etc. The collection purpose, scope and usage method of personal information, and collect and use your personal information after obtaining your consent.", "label": ["Usage", "Data Security", "First Party Collection Information"], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47278, "text": "\"Personal information\" refers to a variety of information that can be recorded alone or with other information to identify a specific natural person's identity or reflects the activity of specific natural persons alone with other information.", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47279, "text": "\"Personal sensitive information\" refers to personal information once leaked, illegally provided or abuses the security of people's body and property, and it is easy to lead to personal information such as personal reputation, physical and mental health damage or discriminatory treatment.", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47280, "text": "The contents of the above personal information and personal sensitive information are contained in Appendix A (Data Appendix A)-Personal Information Example and Appendix B (Data Material Appendix) -The content of personal sensitive information.", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47281, "text": "(1) Collect and use the basic functions of your personal information", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47282, "text": "Our services include some basic functions. These functions include the functions necessary for realizing online ticket purchase, improving the functions necessary for our services and ensuring the functions necessary for transaction security.", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47283, "text": "We need to collect, save, and use the following personal information to achieve these basic functions.", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47284, "text": "If you do not provide relevant information, you will not be able to enjoy the services we provide, please know, if necessary, we may verify the identity information you provided to the issuer authorSafe, the basic functions of various items and the types of personal information they need are as follows:", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47285, "text": "(1) Register as our user and log in", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47286, "text": "• If you register as our user, you need to create a username and password, which facilitates us to provide you with ticket purchase and other services, and provide names, gender, state/region, certificate type, certificate number, certificate of certificate, date of birth, and and with and withThe only mobile phone number, SMS verification code, e -mail, and passenger type that corresponds to the identity information and can be contacted.", "label": ["Important", "First Party Collection Information"], "rewrite": "You need to create a username and password, which facilitates us to provide you with ticket purchase and other services, and provide names, gender, national/region, certificate type, certificate number, document validity period, date of birth, and contact with identity information.The only mobile phone number, SMS verification code, e -mail, passenger type."}
{"task": "rw_29.jsonl", "id": 47287, "text": "• If you need to log in with face ID or fingerprint recognition, you need to provide your biometric information (face information/fingerprint information), but please know, we only receive the results of the terminal verification you use, and we will not collect it.Your biometric information (face information/fingerprint information).", "label": ["Important", "First Party Collection Information"], "rewrite": "If you need to log in with face ID or fingerprint recognition, you need to provide your biometric information (face information/fingerprint information)."}
{"task": "rw_29.jsonl", "id": 47288, "text": "• If you only use information services such as browsing websites, querying the remaining tickets, and stopping the station, you do not need to register as our user or provide the above information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47289, "text": "(2) Provide you ticket purchase service", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47290, "text": "• If you choose to book a ticket service, you need to provide the name of the passenger, the type of document, the certificate number, the type of passenger, the mobile phone number and email.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you choose to book a ticket service, you need to provide the name of the passenger, the type of document, the certificate number, the type of passenger, the mobile phone number and the email address."}
{"task": "rw_29.jsonl", "id": 47291, "text": "If you book tickets for others, you need to provide the aforementioned personal information of the actual ordering person.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you book tickets for others, you need to provide the aforementioned personal information of the actual ordering person."}
{"task": "rw_29.jsonl", "id": 47292, "text": "Once the ordering behavior is completed, it is deemed to be the actual subscriber also agreed to accept this \"Privacy Policy\".", "label": ["Policy Change", "Important", "Risk"], "rewrite": "Once the ordering behavior is completed, it is deemed to be the actual subscriber also agreed to accept this \"Privacy Policy\"."}
{"task": "rw_29.jsonl", "id": 47293, "text": "Therefore, before you apply for products or services for others, you need to ensure that you have obtained its authorization consent.", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47294, "text": "(3) Make sure your transaction security", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47295, "text": "In order to improve the safety of services you and our partners provide services, ensure the safety of the operation environment and the abnormal state of identifying the registered account, better protect the safety of personal property of you or other users or the public, and better prevent the fishing website of the fishing website., Fraud, cyber vulnerabilities, computer viruses, network attacks, network invasion and other security risks, and more accurately identify the cases that violate the laws and regulations of the People's Republic of China or the relevant agreement rules of the 12306 network.Equipment information, location information, log information, and information of our partners obtained your authorization or shared in accordance with the law to comprehensively judge your account and transaction risk, conduct authentication, test and prevent security incidents, and take necessary records, audit, audit, audit, audit, audit, audit, audit, auditing, auditing, auditing, and auditing in accordance with the lawAnalysis and disposal measures.", "label": ["Important", "Data Security", "Usage"], "rewrite": "We may use or integrate your user information, transaction information, equipment information, location information, log information, and information of our partners to obtain your authorization or sharing according to law to comprehensively judge your account and transaction risk."}
{"task": "rw_29.jsonl", "id": 47296, "text": "(2) Collect and use your personal information extension function", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47297, "text": "• In order to make the services you enjoy more convenient or enrich your experience, we provide the following expansion functions, and the following functions may collect and use your personal information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47298, "text": "If you do not provide these personal information, you can still use the basic features listed in Article (1).", "label": ["Important", "First Party Collection Information"], "rewrite": "If you do not provide these personal information, you can still use the basic features listed in Article (1)."}
{"task": "rw_29.jsonl", "id": 47299, "text": "These extensions and the types of personal information they need are as follows:", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47300, "text": "(1) To facilitate your use of products or services", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47301, "text": "The only software and hardware feature information such as the device identifier, the MAC address of the device, and the application of the installation list) to provide you with security guarantee.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We will receive and record the device -related information you use based on the specific permissions you granted in the software installation and use."}
{"task": "rw_29.jsonl", "id": 47302, "text": "Please understand that when you switch the application to the device background run, due to network abnormalities or system reasons, the information collection behavior generated by your previous application may not be stopped immediately, resulting in a short -term background information collection behavior.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47303, "text": "(B) Location information: Refers to the positioning function of your device and using the relevant services provided by our location, according to your current information, such as IP address, GPS location, and Wi-Fi access points that can provide relevant information,Sensor information such as Bluetooth and base stations, open position permissions, which is convenient to automatically increase the current station of the city in the \"recent commonly used\" stations, and facilitate the nearby sales points nearby.Positioning nearby hotels is convenient to locate the current city during the reservation of air -rail transportation. It is convenient to locate the current station when booking railwater connection. It is convenient to locate the current position when using traffic information services. It is convenientEssence", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "Will collect your location information."}
{"task": "rw_29.jsonl", "id": 47304, "text": "(C) Log Information: When you use the products or services provided by our website or client, provide convenient services to you, and we will automatically collect your service usage of our services as a network log preservation.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will receive and record the device related information you use according to the specific permissions you granted in the software installation and use"}
{"task": "rw_29.jsonl", "id": 47305, "text": "Used for operation analysis and reporting of performance security vulnerabilities.", "label": ["Usage"], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47306, "text": "For example, your search, etc.", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47307, "text": "Please note that separate equipment information, log information, and location information cannot identify specific natural person status.", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47308, "text": "If we use this type of non -personal information with other information to identify a specific natural person or use it with personal information, during the combination of use, such non -personal information will be regarded as personal information, except for obtaining your authorization.Or in addition to laws and regulations, we will handle this type of personal information in accordance with this privacy policy.", "label": ["Usage", "Data Security"], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47309, "text": "(2) Provide you with a specific product or service you buy or use", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47310, "text": "If you order any product or service for others, you may need to provide personal information of the actual ordering person.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you order products or services for others, you need to provide personal information of the actual ordering person."}
{"task": "rw_29.jsonl", "id": 47311, "text": "Once the ordering behavior is completed, it is deemed to be the actual subscriber also agreed to accept this \"Privacy Policy\".", "label": ["Policy Change", "Important", "Risk"], "rewrite": "Once the ordering behavior is completed, it is deemed to be the actual subscriber also agreed to accept this \"Privacy Policy\"."}
{"task": "rw_29.jsonl", "id": 47312, "text": "Therefore, before you apply for products or services for others, you need to ensure that you have obtained its authorization consent.", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47313, "text": "• If you choose the \"non -ticket candidate\" service, you need to provide face information and complete the consistency test of the person's certificate or activate the \"railway smooth\" member.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Select the \"ticketless alternate\" service, you need to provide face information and complete the consistency verification of people's certificate."}
{"task": "rw_29.jsonl", "id": 47314, "text": "• If you choose to “apply for a temporary car identity certificate” service, you need to provide the applicant's name, certificate type, certificate number, face information and complete the consistency test of the person's certificate.", "label": ["Important", "First Party Collection Information"], "rewrite": "Selecting the \"Application for Temporary Train Certificate\" service, the applicant's name, certificate type, document number, face information and face information must be provided, and the consistency verification of the person's certificate is completed."}
{"task": "rw_29.jsonl", "id": 47315, "text": "• If you choose the \"Fast Recommendation\" service, you need to provide the name of the refunder, the type of document, the certificate number, and the mobile phone number.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you choose the \"Quick Refund\" service, you need to provide the name of the refunder, the type of document, the certificate number, and the mobile phone number."}
{"task": "rw_29.jsonl", "id": 47316, "text": "• If you choose the \"ordering and specialty products\" service, you need to provide the consignee's name, mobile phone number, ride date, travement, carriage and seat information.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you choose the \"ordering and specialty products\" service, you need to provide the consignee's name, mobile phone number, ride date, trains, carriages and seat information."}
{"task": "rw_29.jsonl", "id": 47317, "text": "• If you choose the \"Express Ticket\" service, you need to provide the recipient's name, mobile phone number and address information.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you choose the \"Express Ticket\" service, you need to provide the recipient's name, mobile phone number and address information."}
{"task": "rw_29.jsonl", "id": 47318, "text": "• If you choose the \"Out of the Station Guide\" service, you need to provide a contact phone number.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you choose the \"Out of the Station Guide\" service, you need to provide a contact phone number."}
{"task": "rw_29.jsonl", "id": 47319, "text": "• If you choose the \"Lounge Hall · Transfer\" service, you need to provide the service date and departure information of the selection of reservations.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you choose the \"Resting Hall · Transfer\" service, you need to provide the service date and departure information selected by the reservation."}
{"task": "rw_29.jsonl", "id": 47320, "text": "• If you choose the \"hotel\" service, you need to provide the name of the resident and mobile phone number.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you choose the \"hotel\" service, you need to provide the names of the resident and mobile phone number."}
{"task": "rw_29.jsonl", "id": 47321, "text": "The room types provided by some hotels are the identity card room. When booking the room type, you need to check the customer's ID information, that is, you need to provide your ID number when you pre -pre -pre -room type.", "label": ["Important", "First Party Collection Information"], "rewrite": "Identification information needs to be provided when booking an ID card."}
{"task": "rw_29.jsonl", "id": 47322, "text": "• If you choose the \"car\" service, you need to provide the name of the passenger (selected) and the mobile phone number.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you choose the \"car\" service, you need to provide the name of the passenger (selected) and the mobile phone number."}
{"task": "rw_29.jsonl", "id": 47323, "text": "• If you choose the \"Poverty Alleviation Mall\" service, you need to provide the consignee's name, mobile phone number and address information.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you choose the \"Poverty Alleviation Mall\" service, you need to provide the consignee's name, mobile phone number and address information."}
{"task": "rw_29.jsonl", "id": 47324, "text": "• If you choose the \"Travel Insurance\" service, you need to provide the insured name, certificate type, certificate number, and mobile phone number;", "label": ["Important", "First Party Collection Information"], "rewrite": "If you choose the \"Travel Insurance\" service, you need to provide the insured name, certificate type, certificate number, and mobile phone number."}
{"task": "rw_29.jsonl", "id": 47325, "text": "When applying for others, it is necessary to provide the name, certificate type, and document number of the insured person.", "label": ["Important", "First Party Collection Information"], "rewrite": "When applying for others, it is necessary to provide the name, certificate type, and document number of the insured person."}
{"task": "rw_29.jsonl", "id": 47326, "text": "• If you choose the \"car ticket\" service, you need to provide information on the departure cities, arrived in the city, and the date of the ride.", "label": ["Important", "First Party Collection Information"], "rewrite": "When choosing a \"car ticket\" service, you need to provide information on the departure cities of the passenger, the city, and the date of the ride."}
{"task": "rw_29.jsonl", "id": 47327, "text": "• If you choose the \"Credit Card\" service, you need to provide the applicant's name, certificate number, mobile phone number, contact name, mobile phone number.", "label": ["Important", "First Party Collection Information"], "rewrite": "To select the \"Credit Card\" service, the applicant's name, certificate number, mobile phone number, contact name, and mobile phone number need to be provided."}
{"task": "rw_29.jsonl", "id": 47328, "text": "• If you choose the \"Air Ticket (including the Air Terminal Transport)\" service, the passenger's name, gender, certificate type, certificate number, date of birth, mobile phone number, email address.", "label": ["Important", "First Party Collection Information"], "rewrite": "Selecting the \"Air Ticket (Including Railway Union)\" service, the name, gender, certificate type, certificate number, date of birth, mobile phone number, email address of the passenger's name, gender, certificate type, certificate number, birth date, mobile number, mobile phone number, and email address."}
{"task": "rw_29.jsonl", "id": 47329, "text": "• If you choose the \"Iron Water Union Transport\" service, you need to provide the departure city, the date of the city and the date of the ride, the name of the passenger, the type of document, the certificate number, the contact number of the contact person;", "label": ["Important", "First Party Collection Information"], "rewrite": "Selecting the \"Iron and Water Union Transport\" service, you need to provide the departure city, the city and the date information of the ride, the name of the passenger, the type of document, the certificate number, the contact mobile phone number."}
{"task": "rw_29.jsonl", "id": 47330, "text": "When checking the ticket, if you choose to use the QR code check, you need to provide your face information and complete the consistency test of the person's certificate.", "label": ["Important", "First Party Collection Information"], "rewrite": "When checking the ticket, if you choose to use the QR code check, you need to provide your face information and complete the consistency test of the person's certificate."}
{"task": "rw_29.jsonl", "id": 47331, "text": "• To show the order information of your account, we will collect the order information you generated during the use of our service to show you and facilitate the management of your order.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect the order information you generated during the use of our service to show you and facilitate the management of your order."}
{"task": "rw_29.jsonl", "id": 47332, "text": "• When you contact us, we may save information such as your communication/call records and content or the contact information you left, so that you can contact you or help you solve the problem, or record the related issues, the results and results of the results and resultsEssence", "label": ["Important", "First Party Collection Information"], "rewrite": "We may save information such as your communication/call records and content or the contact information you left in order to contact you or help you solve the problem."}
{"task": "rw_29.jsonl", "id": 47333, "text": "• To facilitate your travel, we may send you a notification text message to you, mainly including electronic ticket -related information and destination services.", "label": ["Important", "Usage"], "rewrite": "We may send you a schedule notification SMS, mainly including electronic ticket -related information and destination services."}
{"task": "rw_29.jsonl", "id": 47334, "text": "• You can use the products or services provided by our and business partners through the link entrance provided by the 12306 network. When you use the above services through our products or services, you authorize us to receiveSummarize and analyze that we confirm that its source is legal or authorized to agree to your personal information or transaction information to us.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47335, "text": "Before you use the service provided by a third party, please make sure you have fully understood the rules of personal information collection and use of the third party. If you encounter problems, please consult the company's customer service.", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47336, "text": "• The above extension function may require you to turn on the access of your device in your device:", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47337, "text": "(A) Camera/camera permissions: If you need to use scanning car ticket QR codes and face authentication functions, please turn on the camera use permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you need to use the two -dimensional code and face verification function of scanning the car ticket, please turn on the camera's use permissions."}
{"task": "rw_29.jsonl", "id": 47338, "text": "(B) Album/Picture Library permission: If you need to use saving and sharing train information functions, please open the album permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you need to use saving and sharing train information functions, please turn on the album authority."}
{"task": "rw_29.jsonl", "id": 47339, "text": "(C) Push permissions: If you need to receive the message and SMS sent to your APP that you send to you, please turn on the push permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you need to receive the message and SMS sent to your app to your app, please open the push authority."}
{"task": "rw_29.jsonl", "id": 47340, "text": "You can choose to receive notification messages via WeChat or Alipay. You need to provide and authorize us to use the corresponding third -party account information so that we can provide push notification services based on your choice.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "You need to provide and authorize us to use the corresponding third -party account information so that we can provide push notification services based on your choice."}
{"task": "rw_29.jsonl", "id": 47341, "text": "Please note that when you turn on these permissions, it means that you authorize us to collect and use these personal information to achieve the above functions. If you close the authority, it means that you have canceled these authorization. We will no longer continue to collect and use your personal informationIt is also impossible to provide you with the above functions corresponding to these authorization.", "label": ["First Party Collection Information", "Risk"], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47342, "text": "The decision to close permissions will not affect the processing of personal information based on your authorization.", "label": ["Permission Acquisition", "Important"], "rewrite": "The decision to close permissions will not affect the processing of personal information based on your authorization."}
{"task": "rw_29.jsonl", "id": 47343, "text": "(3) Other uses", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47344, "text": "We may study, statistical analysis and prediction of collected information to improve the content and layout of 12306, provide product or service support for business decisions, and improve our products and services.Machine learning or model algorithm training;", "label": ["Important", "Usage"], "rewrite": "We may study, statistical analysis and prediction of collected information."}
{"task": "rw_29.jsonl", "id": 47345, "text": "In order to realize specific advertising service functions, we will collect the client's rough location information, equipment information, advertising display and click data for advertising, monitoring attribution and data statistics.", "label": ["Important", "Usage"], "rewrite": "We will collect the rough location information, equipment information, advertising display and click data of the client for advertising, monitoring attribution and data statistics."}
{"task": "rw_29.jsonl", "id": 47346, "text": "(3) Exceptions of obtaining authorization consent", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47347, "text": "According to the relevant laws and regulations and national standards of the People's Republic of China, collecting your personal information in the following situations does not need to obtain your authorization consent:", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In the following circumstances, collect your personal information without obtaining your authorization consent:"}
{"task": "rw_29.jsonl", "id": 47348, "text": "1) What is related to the obligations stipulated in the performance of our laws and regulations;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting personal information related to obligations stipulated in laws and regulations does not require consent."}
{"task": "rw_29.jsonl", "id": 47349, "text": "2) Directly related to the national security and national defense security of the People's Republic of China;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting personal information directly related to the national security and national defense security of the People's Republic of China without soliciting consent."}
{"task": "rw_29.jsonl", "id": 47350, "text": "3) Directly related to public safety, public health, and major public interests;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect personal information directly related to public safety, public health, and major public interests without soliciting consent."}
{"task": "rw_29.jsonl", "id": 47351, "text": "4) Directly related to criminal investigation, prosecution, trial and judgment execution;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect direct personal information related to criminal investigation, prosecution, trial, and execution of judgment without asking for consent."}
{"task": "rw_29.jsonl", "id": 47352, "text": "5) For major legitimate rights and interests such as maintaining your or other individuals, but it is difficult to get my consent;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting major legitimate rights and interests such as life and property, but it is difficult to obtain personal information that I agree, without asking for consent."}
{"task": "rw_29.jsonl", "id": 47353, "text": "6) The personal information collected is publicly disclosed to the public by yourself;", "label": ["Important", "First Party Collection Information"], "rewrite": "The collected personal information is made to the public by itself without asking for consent."}
{"task": "rw_29.jsonl", "id": 47354, "text": "7) Signing and fulfilling the contract according to your requirements;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting the personal information necessary for the signing and performing the contract without soliciting consent."}
{"task": "rw_29.jsonl", "id": 47355, "text": "8) Your personal information collected from the information disclosed by legal publicly disclosed, such as legal news reports, government information disclosure and other channels;", "label": ["Important", "First Party Collection Information"], "rewrite": "If your personal information collected in the legal disclosure information, you do not need to ask for consent."}
{"task": "rw_29.jsonl", "id": 47356, "text": "9) Maintenance The safe and stable operation of the product or service is necessary, such as discovering and disposing of products or services.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting personal information necessary for the safe and stable operation of products or services, there is no need to solicit consent."}
{"task": "rw_29.jsonl", "id": 47357, "text": "10) As an academic research institution, it is necessary to carry out statistics or academic research institutes for public interests, and when it provides academic research or description results, it is identified to identify the personal information contained in the results.", "label": ["Important", "First Party Collection Information"], "rewrite": "Academic research institutions, due to public interests to carry out statistics or academic research institutes. When providing results, the personal information contained in the results is identified to identify it without asking for consent."}
{"task": "rw_29.jsonl", "id": 47358, "text": "2. How to share, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47359, "text": "(1) Sharing", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47360, "text": "According to your choice and authorization or in accordance with the exception of \"sharing, transfer, and public disclosure of personal information, the consent of authorization in advance\", we may share your order information, account information, contact information, and location information to the third partyTo ensure the smooth completion of the services provided for you.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share your order information, account information, contact information, and location information to a third party."}
{"task": "rw_29.jsonl", "id": 47361, "text": "But we will only share your personal information for legal, correct, necessary, specific, and clear purposes, and only share the necessary personal information for providing services.", "label": ["Third Party Sharing/ Disclosure", "Data Security"], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47362, "text": "Our partners have no right to use the personal information they shared for any other purpose.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47363, "text": "Our partners include suppliers, third -party merchants, and institutions of products or technical services in this privacy policy.Travel insurance, car tickets and other services.", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47364, "text": "The purpose of our sharing of this information is to achieve the functions and/or service functions you choose to use. For example: we must share your mobile phone number with the online car rental company to contact you in time and successfully take it;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We must share your mobile phone number with the online car company to contact you in time and successfully ride."}
{"task": "rw_29.jsonl", "id": 47365, "text": "Or we need to share your order number and order amount with a third -party payment institution to achieve your confirmation of your payment instructions and complete the payment, etc.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We need to share your order number and order amount with third -party payment institutions to achieve your confirmation of your payment instructions and complete payment."}
{"task": "rw_29.jsonl", "id": 47366, "text": "Or we must share your order information and necessary information related to transactions with third -party merchants to realize your needs for purchasing products or services from it, and enable you to complete the subsequent after -sales service for you;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We must share your order information and necessary information related to transactions with third -party merchants."}
{"task": "rw_29.jsonl", "id": 47367, "text": "Or you authorize banks, credit reporting agencies, and other third directions to inquire and collect your information. We will share your information from third parties within the scope of laws and regulations and regulatory policies and your authorization scope of the third party.Confirm the legality of the authorized personal information sources with the third party, and deal with your personal information on the premise of compliance with laws and regulations and regulatory policies.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will share your information from third parties within the scope of laws and regulations and regulatory policies and your authorization of third parties."}
{"task": "rw_29.jsonl", "id": 47368, "text": "In order to receive information push, use services provided by third -party platforms, use third -party payment, use map services, and use face recognition functions, we will embed the software tool development package (SDK) or similar other in our application in our application.Applications, we use these SDKs through the operating system to provide interface calls. You can click here to check the names and categories of these third -party SDKs, providers, and collecting personal information.Please make sure you have fully understood the personal information collection and use rules of the third party. If you encounter problems, please consult the company's customer service.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In our application, we will embed the software tool development package (SDK) or other applications of authorized partners. We use these SDKs to provide interface calls through the operating system."}
{"task": "rw_29.jsonl", "id": 47369, "text": "If you want to learn more about the privacy policy or development document link of a third -party SDK in detail, click here.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you want to learn more about the privacy policy or development document link of a third -party SDK in detail, click here."}
{"task": "rw_29.jsonl", "id": 47370, "text": "Please note that the developer's document or privacy policy page in the above link is produced and published by the corresponding SDK development/provider. Related SDK development/provider will likeFor changes or adjustments, please refer to the contents of the latest links and link webpages announced by related SDK development/providers.", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47371, "text": "Since some SDK development/providers have not provided online documents, we cannot provide links to all third -party SDK development documents.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "We cannot provide links to all third -party SDK development documents."}
{"task": "rw_29.jsonl", "id": 47372, "text": "In some cases, we will also be entrusted to handle your personal information. As a recipient, we usually include:", "label": ["Usage"], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47373, "text": "• Entrust our promotion partners.", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47374, "text": "Sometimes we provide services to other companies to provide promotional promotion services to user groups using our products and/or services.", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47375, "text": "After you agree, we will provide these partners with information about its promotion coverage and effectiveness without providing your personal identity information, or we will summarize this information so that it will not recognize you.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "After you agree, we will provide these partners with information about its promotion coverage and effectiveness without providing your personal identity information, or we will summarize this information so that it will not recognize you."}
{"task": "rw_29.jsonl", "id": 47376, "text": "For example, we can inform how many people of the commissioner have seen their promotional information or purchased the commissioner's products after seeing the information, or provide them with statistical information that cannot recognize personal identity to help them understand their audience or customers.", "label": ["Usage", "Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47377, "text": "For companies and organizations we share with our personal information, we will sign a strict confidentiality agreement with them, asking them to handle personal information in accordance with our privacy policies and other related confidentiality and security measures.", "label": ["Third Party Sharing/ Disclosure", "Data Security"], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47378, "text": "Our partners have no right to use the personal information they shared for any other purpose. If you want to change the purpose of the processing of personal information, you will once again solicit your authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Our partners have no right to use the personal information they shared for any other purpose. If you want to change the purpose of the processing of personal information, you will once again solicit your authorization consent."}
{"task": "rw_29.jsonl", "id": 47379, "text": "If we share the personal information of children with third parties, we will conduct security assessments and use encryption, anonymous, and identifying processing to ensure children's information security.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Data Security", "Important"], "rewrite": "If we share the personal information of children with third parties, we will conduct security assessments and use encryption, anonymous, and identifying processing to ensure children's information security."}
{"task": "rw_29.jsonl", "id": 47380, "text": "(2) Transfer", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47381, "text": "Except for the situation in which the \"sharing, transfer, and public disclosure of personal information, the exception to obtain authorization in advance\", we will not transfer your personal information to any company, organization and individual.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47382, "text": "When involving acquisitions, mergers, reorganizations, bankruptcy or similar transactions, if personal information is transferred, we will inform you the relevant situation and require new companies and organizations that hold your personal information to continue to be subject to this privacy policy.For the purpose of changing personal information, we will ask the company and the organization to reconcile your authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If the acquisition, merger, etc. involve the transfer of personal information, we will tell you the relevant situation and ask the new holder to continue to be subject to the privacy policy."}
{"task": "rw_29.jsonl", "id": 47383, "text": "If bankruptcy and unsecured party, we will delete your personal information in compliance with the law.", "label": ["Important", "Cessation of Operations"], "rewrite": "If bankruptcy and unsecured party, we will delete your personal information in compliance with the law."}
{"task": "rw_29.jsonl", "id": 47384, "text": "(3) Public disclosure", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47385, "text": "We will only disclose your personal information in the following situation:", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47386, "text": "• In the case of your clear consent or active choice, we may publicly disclose the personal information you specified;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "With your clear consent or active choice, we may publicly disclose your personal information."}
{"task": "rw_29.jsonl", "id": 47387, "text": "• In accordance with the requirements of the laws and regulations of the People's Republic of China, the requirements of mandatory administrative law enforcement or judicial requirements, we may disclose your personal information as required.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In accordance with the requirements of the laws and regulations of the People's Republic of China, the mandatory administrative law enforcement or judicial requirements that must provide your personal information, we may disclose your personal information as required."}
{"task": "rw_29.jsonl", "id": 47388, "text": "Under the premise of compliance with laws and regulations, when we receive a request for the above disclosure information, we ask we must issue corresponding legal documents such as tickets or investigation letters.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Under the premise of compliance with laws and regulations, when we receive a request to the above disclosure, we require a corresponding legal document."}
{"task": "rw_29.jsonl", "id": 47389, "text": "(4) Sharing, transfer, and public disclosure of disclosure of personal information.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47390, "text": "According to the relevant laws and regulations and national standards of the People's Republic of China, in the following circumstances, sharing, transfer, and publicly disclose your personal information without obtaining your authorization consent in advance:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the following circumstances, sharing, transfer, and publicly disclose your personal information without obtaining your authorization consent in advance:"}
{"task": "rw_29.jsonl", "id": 47391, "text": "1) What is related to the obligations stipulated in the performance of our laws and regulations;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Sharing personal information related to the obligations stipulated in our laws and regulations does not need to solicit consent."}
{"task": "rw_29.jsonl", "id": 47392, "text": "2) Directly related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Personal information directly related to national security and national defense security does not need to solicit consent."}
{"task": "rw_29.jsonl", "id": 47393, "text": "3) Directly related to public safety, public health, and major public interests;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Personal information directly related to public safety, public health, and direct public interests does not need to solicit consent."}
{"task": "rw_29.jsonl", "id": 47394, "text": "4) Directly related to criminal investigation, prosecution, trial and judgment execution;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Direct related personal information such as criminal investigation, prosecution, trial and judgment execution does not need to solicit consent."}
{"task": "rw_29.jsonl", "id": 47395, "text": "5) For major legitimate rights and interests such as maintaining your or other individuals, but it is difficult to get your authorization consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "It shared major legitimate rights and interests such as life and property, but it is difficult to get personal information that I have authorized, and no consent is required."}
{"task": "rw_29.jsonl", "id": 47396, "text": "6) The personal information involved is the personal information that you disclose to the public by yourself;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The personal information involved is your personal information that you disclose to the public yourself without asking for consent."}
{"task": "rw_29.jsonl", "id": 47397, "text": "7) Signing and fulfilling the contract according to your requirements;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The personal information necessary for sharing and performance of the contract does not need to ask for consent."}
{"task": "rw_29.jsonl", "id": 47398, "text": "8) Collect personal information from legal public information, such as legal news reports and government information disclosure.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you collect personal information from the legal disclosure information, you do not need to ask for consent."}
{"task": "rw_29.jsonl", "id": 47399, "text": "9) Maintain the necessary and stable operations of our products or services, such as discovery and disposal of products or services.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The personal information necessary for sharing the safe and stable operation of products or services does not require consent."}
{"task": "rw_29.jsonl", "id": 47400, "text": "According to the laws and regulations of the People's Republic of China, sharing and transferred personal information that is identified by the transfer, and ensure that the data receiver cannot restore and re -identify the subject of personal information, which is not shared, transferred, and publicly disclosed in personal information.The preservation and processing of class data will not be notified to you separately and obtain your consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Enjoy and transfer personal information that has been identified by the identification processing, and ensure that the data receiver cannot restore and re -identify the subject of personal information, it does not belong to the external sharing, transfer and public disclosure of personal information.get agreement."}
{"task": "rw_29.jsonl", "id": 47401, "text": "3. How to save your personal information", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47402, "text": "Even if you visit our website from outside China or countries, please note that your information will be stored in mainland China and processed in mainland China.", "label": ["Data Retention", "Important"], "rewrite": "Even if you visit our website from outside China or countries, your information will be stored in mainland China and processed in mainland China."}
{"task": "rw_29.jsonl", "id": 47403, "text": "Generally speaking, we only retain your personal information for the shortest time to achieve the above purposes.", "label": ["Data Retention", "Important"], "rewrite": "We only retain your personal information for the shortest time to achieve the above purposes."}
{"task": "rw_29.jsonl", "id": 47404, "text": "After exceeding the storage period, we will delete or processes your personal information.", "label": ["Data Retention", "Important"], "rewrite": "After exceeding the storage period, we will delete or processes your personal information."}
{"task": "rw_29.jsonl", "id": 47405, "text": "If we stop operating the 12306 network products or services, we will stop the activities of continuing to collect your personal information in time, notify you in the form of notification of operations in the form of one -one -one -one -one -one -one -one -one -one -one -one -servicePersonal information is deleted or anonymous.", "label": ["Important", "Cessation of Operations"], "rewrite": "If we stop operating the 12306 network products or services, we will stop collecting your personal information activities and notify you in time, and delete or processes the personal information we hold."}
{"task": "rw_29.jsonl", "id": 47406, "text": "4. Use of cookies", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47407, "text": "Cookie is a text file that web server placed on your access device, which will help you call information during subsequent access and simplify the process of recording your personal information.", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47408, "text": "You have the right to accept or reject cookies. If the browser automatically receives cookies, you can modify the browser settings according to your needs to reject cookies.", "label": ["Important", "Edit/Control"], "rewrite": "You have the right to accept or reject cookies. If the browser automatically receives cookies, you can modify the browser settings according to your needs to reject cookies."}
{"task": "rw_29.jsonl", "id": 47409, "text": "Please note that if you choose to reject Cookie, then you may not fully experience the service provided by 12306.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47410, "text": "5. Personal sensitive information prompt", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47411, "text": "12306 here reminds you that the content and information uploaded or published in the products and services you provided for you may involve your personal sensitive information.", "label": ["Important", "First Party Collection Information"], "rewrite": "The content and information you uploaded or published in the products and services you provided for you may involve your personal sensitive information."}
{"task": "rw_29.jsonl", "id": 47412, "text": "Including but not limited to the document number, personal biometric information (face information, fingerprint information), itinerary information, and personal information of children under 14 years of age (inclusive).", "label": ["First Party Collection Information", "Specific Audiences"], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47413, "text": "Therefore, you need to consider carefully before using the products or services we provide for you.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47414, "text": "You agree that these personal sensitive information will be processed in accordance with the purpose and method of clarifying this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47415, "text": "6. Personal information security", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47416, "text": "(1) 12306 attaches great importance to information security and set up a special responsible team.", "label": ["Important", "Data Security"], "rewrite": "12306 attaches great importance to information security and has established a special responsible team."}
{"task": "rw_29.jsonl", "id": 47417, "text": "We strive to provide you with information protection, adopt appropriate management, technical and physical security measures, and establish a information security security system that is compatible with business development with reference to domestic and foreign information security standards and best practices.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47418, "text": "Access control, SSL (Secure, Socket, Layer) encrypted transmission for encrypted storage, sensitive information desensitization display, etc.", "label": ["Important", "Data Security"], "rewrite": "From the perspective of the life cycle of data, we have established security protection measures at various aspects such as data collection, storage, display, processing, use, and destruction. Different control measures are taken according to the level of information sensitivity."}
{"task": "rw_29.jsonl", "id": 47419, "text": "We have adopted our industry standards, reasonable and feasible security protection measures to protect your personal information security, use encrypted technology to improve the security of personal information, and use a trusted protection mechanism to prevent personal information from being maliciously attacked, prevent personal information from being affected by personal information.Unauthorized access, public disclosure, use, modification, damage or loss.", "label": ["Important", "Data Security"], "rewrite": "We have adopted our industry standards, reasonable and feasible security protection measures to protect your personal information security, and use encrypted technology to improve the security of personal information."}
{"task": "rw_29.jsonl", "id": 47420, "text": "(3) We deployed the access control mechanism to make every effort to ensure that only authorized personnel can access personal information.", "label": ["Important", "Data Security"], "rewrite": "We have adopted the security measures that meet industry standards, reasonable and feasible security measures to protect your personal information security, and use encrypted technology to improve the security of personal information"}
{"task": "rw_29.jsonl", "id": 47421, "text": "We have also adopted strict management of employees who may contact your information, can monitor their operations, establish an approval mechanism for data access, internal and external transmission, desensitization, and decryption.wait.", "label": ["Important", "Data Security"], "rewrite": "We have also adopted strict management of employees who may contact your information, can monitor their operations, establish an approval mechanism for data access, internal and external transmission, desensitization, and decryption.wait."}
{"task": "rw_29.jsonl", "id": 47422, "text": "At the same time, we also regularly provide information security training for employees, asking employees to form a good operating habit in daily work to enhance the awareness of data protection.", "label": ["Important", "Data Security"], "rewrite": "We will regularly conduct information security training for employees."}
{"task": "rw_29.jsonl", "id": 47423, "text": "(4) Despite the aforementioned security measures, please also understand that there is no \"comprehensive security measures\" on the Internet.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47424, "text": "We will provide corresponding security measures in accordance with existing technology to protect your information and provide reasonable security guarantees. We will try our best to make your information from being leaked, damaged or lost.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47425, "text": "(5) Your account has a security protection function. Please keep your account and password information properly. Do not inform others or other websites of the password. If you find your personal information leakage, especially your account number and password leakage,Please contact our customer service immediately so that we can take corresponding measures.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47426, "text": "(6) Please save or back up other information such as your text, pictures in time. You need to understand and accept it. The system and communication network you use to access our services may beEssence", "label": ["Data Security"], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47427, "text": "7. The disposal of personal information security incident", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47428, "text": "After unfortunately a personal information security incident, we will start emergency plans to prevent the expansion of security incidents. We will inform you the basic situation and possible impact of the security incident in accordance with the requirements of the laws and regulations of the People's Republic of China.Disposal measures, suggestions that can prevent and reduce risks, remedy measures, etc.", "label": ["Important", "Data Security"], "rewrite": "After unfortunately a personal information security incident, we will start emergency plans to prevent the expansion of security incidents and inform you the basic situation and possible impact, disposal measures, suggestions, remedial measures, etc. to you."}
{"task": "rw_29.jsonl", "id": 47429, "text": "When the incident is related to the event, we will inform you by mail, telephone, push notification, etc. When it is difficult to inform the subject of personal information one by one, we will publish an announcement in a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "When the incident is related to the event, we will inform you by mail, telephone, push notification, etc. When it is difficult to inform the subject of personal information one by one, we will publish an announcement in a reasonable and effective way."}
{"task": "rw_29.jsonl", "id": 47430, "text": "At the same time, we will also actively report the disposal of information security incidents in accordance with the requirements of the regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "We will also actively report the disposal of information security incidents in accordance with the requirements of the regulatory authorities."}
{"task": "rw_29.jsonl", "id": 47431, "text": "8. Protection of personal information of minors", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47432, "text": "In accordance with relevant laws and regulations of the People's Republic of China, minors under the age of 18 are minors, and minors under the age of 14 are children.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47433, "text": "The 12306 network is mainly for adults. Without the consent of parents or guardians, minors, especially children under the age of 14, should not create their own personal information main account.", "label": ["Specific Audiences", "Important"], "rewrite": "Without the consent of parents or guardians, minors, especially children under the age of 14, should not create their own personal information main account."}
{"task": "rw_29.jsonl", "id": 47434, "text": "If you are the guardian of minors, we remind you to perform the supervisor's duties correctly and protect personal information security of minors.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47435, "text": "If the minors you monitor use our services, you should guide and monitor correctly.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47436, "text": "If you are a minor, before using the 12306 network service, please carefully read the privacy policy with the accompaniment and help of your parents or guardians, and use our service or to us with the consent of his parents or guardians.provide information.", "label": ["Specific Audiences", "Important"], "rewrite": "Minors, before using the 12306 network service, please read this privacy policy with the accompaniment and help of parents or guardians, and use our services or provide information to us with the consent of their parents or guardians."}
{"task": "rw_29.jsonl", "id": 47437, "text": "Regarding the consent of our parents or guardians to collect minors, especially the personal information of children, we will only use the laws and regulations, the parents or guardians clearly agree or protect the minors., Share, transfer or disclose this information.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Important"], "rewrite": "We will only use, share, transfer, or disclose this information if the laws and regulations are allowed, parents or guardians to clearly agree or protect minors."}
{"task": "rw_29.jsonl", "id": 47438, "text": "If we find that we collect their personal information without the consent of our parents or guardians in advance, we will try to delete relevant data as soon as possible.", "label": ["Specific Audiences", "Important"], "rewrite": "If we find that we collect their personal information without the consent of our parents or guardians in advance, we will try to delete relevant data as soon as possible."}
{"task": "rw_29.jsonl", "id": 47439, "text": "For children's personal information, we will further take the following measures:", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47440, "text": "(1) For the collected children's personal information, in addition to complying with the agreement on user information on this privacy policy, we will also adhere to the principles of legitimate necessity, knowledge consent, clear purpose, security, and use according to law.The requirements of laws and regulations such as information network protection storage, use, and disclosure, and will not exceed the period required for the purpose of collecting and using the purpose of collection and use. After expiry, we will delete or processes the personal information of children.", "label": ["Data Retention", "Specific Audiences", "Data Security", "Important"], "rewrite": "For the collected personal information of the children, we will adhere to the principles of legitimate necessity, consent, clear purpose, security guarantee, and use according to law, and strictly follow the requirements of laws and regulations such as the Protection of Children's Personal Information Networks to store, use, and disclose them."}
{"task": "rw_29.jsonl", "id": 47441, "text": "(2) When you choose to use 12306 related services as a guardian for the guardian, we may need to collect personal information of children's guardianship for you to perform related services to you.", "label": ["Specific Audiences", "First Party Collection Information", "Important"], "rewrite": "When you choose to use the 12306 related services as a guardian for the guardian, we may need to collect personal information of the guardian child."}
{"task": "rw_29.jsonl", "id": 47442, "text": "If you need to collect your personal information to you in the specific service, we will obtain your authorization consent in advance and inform you the purpose and purpose of collecting.", "label": ["Specific Audiences", "Data Security", "Important"], "rewrite": "If you need to collect your personal information to you in the specific service, we will obtain your authorization consent in advance and inform you the purpose and purpose of collecting."}
{"task": "rw_29.jsonl", "id": 47443, "text": "If you do not provide the aforementioned information, you will not be able to enjoy the related services we provide.", "label": ["First Party Collection Information", "Specific Audiences"], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47444, "text": "As a guardian, you should correctly fulfill your duties of guardianship and protect your personal information security.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47445, "text": "If the child needs to register or use our products and/or services, you should properly guide and guard.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47446, "text": "(3) Children or their guardians have the right to access and correct the personal information of children at any time, and they can also ask us to correct and delete.", "label": ["Specific Audiences", "Important", "Edit/Control"], "rewrite": "Children or their guardians have the right to access and correct the personal information of children at any time, and they can also ask us to correct and delete."}
{"task": "rw_29.jsonl", "id": 47447, "text": "We designate a special person in charge of the protection of personal information of children. If you have any opinions, suggestions or complaints, and reports on your personal information related to child information, please contact us through the contact information stated in this privacy policy.", "label": ["Specific Audiences", "Contact Information", "Important"], "rewrite": "If you have any opinions, suggestions or complaints, and reports on your personal information related to children, please contact us through the contact information listed in this privacy policy."}
{"task": "rw_29.jsonl", "id": 47448, "text": "We will help you in time.", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47449, "text": "9. Your personal information rights", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47450, "text": "We attach great importance to your attention to personal information and do our best to protect your rights to your personal information, except for laws and regulations.", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47451, "text": "To ensure safety, we may need to provide a written request or prove your identity in other ways. Generally, we will accept your request within 15 working days after receiving your feedback and verifying your identity.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47452, "text": "For your reasonable requests, we do not charge fees in principle, but we will charge a certain cost fee as required for multiple repeated and more reasonable limit.", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47453, "text": "We may refuse to reject those who have no repetition, need too much technical means, bring risks or very unrealistic requests to others.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47454, "text": "(1) You can log in to \"My 12306\" at any time, enter functional modules such as personal center, common information to access, correct, and delete your account information, including personal data, authority settings, security settings, commonly used contacts, passwords, mailboxes, mailboxes, Delivery address, etc.", "label": ["Important", "Edit/Control"], "rewrite": "You can log in to \"My 12306\" at any time and enter functional modules such as personal centers, common information to access, correct, and delete your account information."}
{"task": "rw_29.jsonl", "id": 47455, "text": "(2) You can cancel the 12306 network account through the following path:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47456, "text": "1) You can cancel the account by logging in to 12306, APP. The specific path is: click, \"My\" -click the button on the top right of the page -click \"Logging\";", "label": ["Important", "Edit/Control"], "rewrite": "You can cancel the account by logging in to the 12306 APP. The specific path is: click \"My\" -click the button on the top right of the page -click \"Logging\"."}
{"task": "rw_29.jsonl", "id": 47457, "text": "2) The original valid ID card filled in when carrying the registration, and to the nearby railway station window for cancellation.", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47458, "text": "After canceling the 12306 web account, we will stop providing you with it, and will delete your personal information according to the requirements of applicable laws, or to deal with it anonymous.", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "After canceling the 12306 web account, we will stop providing you with it, and will delete your personal information according to the requirements of the applicable laws, or make anonymous processing it."}
{"task": "rw_29.jsonl", "id": 47459, "text": "(3) You can withdraw your authorization by closing the device function.", "label": ["Important", "Edit/Control"], "rewrite": "You can withdraw your authorization by closing the device function."}
{"task": "rw_29.jsonl", "id": 47460, "text": "You can also withdraw all the authorization of your personal information by canceling the account.", "label": ["Edit/Control", "Important"], "rewrite": "You can also withdraw all the authorization of your personal information by canceling the account."}
{"task": "rw_29.jsonl", "id": 47461, "text": "(4) In the following circumstances, in accordance with the requirements of laws and regulations and national standards, we will not be able to respond to your request:", "label": ["Important", "Edit/Control"], "rewrite": "In the following circumstances, in accordance with the requirements of laws and regulations and national standards, we will not be able to respond to your request:"}
{"task": "rw_29.jsonl", "id": 47462, "text": "1), related to our obligations stipulated in the law and regulations of our law and regulations;", "label": ["Edit/Control", "Important"], "rewrite": "Those who are related to our obligations stipulated in our laws and regulations cannot respond to requests."}
{"task": "rw_29.jsonl", "id": 47463, "text": "2) Directly related to national security and national defense security;", "label": ["Important", "Edit/Control"], "rewrite": "Directly related to national security and national defense security cannot respond to requests."}
{"task": "rw_29.jsonl", "id": 47464, "text": "3) Directly related to public safety, public health, and major public interests;", "label": ["Important", "Edit/Control"], "rewrite": "Those who are directly related to public safety, public health, and major public interests cannot respond to requests."}
{"task": "rw_29.jsonl", "id": 47465, "text": "4), directly related to criminal investigation, prosecution, trial, and execution judgment;", "label": ["Important", "Edit/Control"], "rewrite": "Those who are directly related to criminal investigation, prosecution, trial, and execution judgments cannot respond to requests."}
{"task": "rw_29.jsonl", "id": 47466, "text": "5), there is sufficient evidence that you have subjective malice or abuse of rights;", "label": ["Important", "Edit/Control"], "rewrite": "If there is sufficient evidence that you have subjective malicious or abuse of rights, you cannot respond to the request."}
{"task": "rw_29.jsonl", "id": 47467, "text": "6) For major legitimate rights and interests such as maintaining your or other individuals, but it is difficult to get your authorization consent;", "label": ["Important", "Edit/Control"], "rewrite": "Maintaining major legitimate rights and interests such as life, property, etc., but it is difficult to get personal information that you have authorized, and you cannot respond to your request."}
{"task": "rw_29.jsonl", "id": 47468, "text": "7), responding to your request will cause the legitimate rights and interests of you or other individuals and organizations to be seriously damaged;", "label": ["Edit/Control", "Important"], "rewrite": "In response to your request, if the legitimate rights and interests of you or other individuals and organizations are seriously damaged, the request cannot be responded."}
{"task": "rw_29.jsonl", "id": 47469, "text": "8), involved business secrets.", "label": ["Important", "Edit/Control"], "rewrite": "Those who involve business secrets cannot respond to requests."}
{"task": "rw_29.jsonl", "id": 47470, "text": "10. Change of this privacy policy", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47471, "text": "The content of this privacy policy may be updated from time to time to adapt to the development of law, technology or business.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47472, "text": "The updated privacy policy will be announced on the 12306 website, and major changes will be informed of users in a suitable form such as website announcement and user notification.", "label": ["Policy Change", "Important"], "rewrite": "The updated privacy policy will be announced on the 12306 website, and major changes will be informed of users in a suitable form such as website announcement and user notification."}
{"task": "rw_29.jsonl", "id": 47473, "text": "The major changes in this privacy policy include:", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47474, "text": "(1) Our service model has changed significantly, such as the purpose of handling personal information, the type of personal information, the use of personal information, etc.;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47475, "text": "(2) We have undergone major changes in the aspects of ownership structure and organizational structure, such as changes in the owner caused by business adjustments, bankruptcy mergers and acquisitions, etc.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47476, "text": "(3) The main object of personal information sharing, transfer or public disclosure changes;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47477, "text": "(4) The right to participate in personal information processing and its exercise methods have changed significantly;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47478, "text": "(5) When we are responsible for handling the responsibility departments, contact methods and complaint channels of personal information security;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47479, "text": "(6) Evaluation report on personal information security impact indicates that there is a high risk.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47480, "text": "When you use our website, you can review our privacy policies at any time so that you can understand its modification.", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47481, "text": "You can check the latest update date of this privacy policy on the \"recent update\" date at the top of the privacy notice.", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47482, "text": "11. How to contact us", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47483, "text": "You can contact us through the following ways. Generally, we will accept and process your requests on personal information within 15 working days.", "label": ["Important", "Contact Information"], "rewrite": "Under normal circumstances, we will accept and process your requests on personal information within 15 working days."}
{"task": "rw_29.jsonl", "id": 47484, "text": "Tel: 12306", "label": ["Important", "Contact Information"], "rewrite": "Tel: 12306."}
{"task": "rw_29.jsonl", "id": 47485, "text": "Email: kyfw@12306.cn", "label": ["Important", "Contact Information"], "rewrite": "Email: kyfw@12306.cn."}
{"task": "rw_29.jsonl", "id": 47486, "text": "If you are not satisfied with our reply and believe that our personal information processing behavior has harm your legitimate rights and interests, you can complain to the 12306 customer service, or to complain to the public security organs or online information, telecommunications, markets and other regulatory authorities orThe report was reported, or a lawsuit was filed to the people's court with jurisdictions in the residence of the defendant.", "label": [], "rewrite": []}
{"task": "rw_29.jsonl", "id": 47487, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
