{"task": "rw_25.jsonl", "id": 45931, "text": "Baidu Library Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 45932, "text": "You are welcome to use the services provided by Baidu Library!", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 45933, "text": "Baidu (this privacy policy refers to Beijing Baidu Net News Technology Co., Ltd., also known as \"we\") attaches great importance to your privacy protection and personal information protection.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 45934, "text": "This privacy policy is suitable for access and use of various services provided by Baidu Library in any way.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 45935, "text": "You can implement information query, document browsing, audio, watching videos, voice speed memo, picture transfers, document introduction, shopping/payment, social and concern, download files, login/registration Baidu account and other services(The following is collectively referred to as \"Baidu Library Products or Services\").", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 45936, "text": "We will only handle personal information you need to use products or services.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 45937, "text": "This privacy policy is suitable for you through the Baidu library web page, mobile terminals (including but not limited to APP, applet), software development tool packs (SDK) for third -party websites and applications, and application programming interfaces (API), etc.Let's access and use our products and services.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 45938, "text": "Baidu library includes but not limited to multiple application versions such as iOS and Android. Please choose a version that matches the installed terminal equipment when using the Baidu library.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 45939, "text": "The personal information that Baidu Library may get depends on the Baidu Library application version you use, the specific type/version of the terminal equipment you use, and the functions you use.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 45940, "text": "This privacy policy aims to help you understand which personal information we will collect, why these personal information is collected, what these personal information will use what these personal information do and how to protect these personal information.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 45941, "text": "We will follow your personal information in accordance with your personal information, but we will not collect all your personal information in a compulsory binding method just because you authorize the consent of the privacy policy.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will not collect all your personal information in a compulsory binding method just because you authorize your consent of the privacy policy."}
{"task": "rw_25.jsonl", "id": 45942, "text": "We will solicit your separate consent in strict accordance with the requirements of laws and regulations.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 45943, "text": "In addition to this privacy policy, we may also explain the rules of our personal information through product page notifications, pop -ups prompts, information push, etc.The specific rules have the same effect as the privacy policy.", "label": ["Important"], "rewrite": "In addition to this privacy policy, we may also explain the rules of handling your personal information through product page notifications, pop -ups prompts, and information push."}
{"task": "rw_25.jsonl", "id": 45944, "text": "Unless laws and administrative regulations have other provisions, in response to how we handle your personal information, you have the right to know and decide, and have the right to restrict or reject us or other parties to deal with your personal information;", "label": ["Important"], "rewrite": "You enjoy the right to know and decide, have the right to restrict or reject us or other parties to deal with your personal information."}
{"task": "rw_25.jsonl", "id": 45945, "text": "At the same time, you have the right to ask us to explain to the personal information processing rules we provide.", "label": ["Important"], "rewrite": "You have the right to ask us to explain the personal information processing rules we provide."}
{"task": "rw_25.jsonl", "id": 45946, "text": "Please read and understand the privacy policy carefully before using Baidu Library and related products and services to make appropriate choices.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 45947, "text": "This privacy policy will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 45948, "text": "1. The information we collect and the corresponding purpose of the use", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 45949, "text": "2. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 45950, "text": "3. How do we share, transfer, open disclosure, and entrust your personal information", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 45951, "text": "4. How do we save and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 45952, "text": "5. Your rights", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 45953, "text": "6. How do we deal with the personal information of minors", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 45954, "text": "7. How to cross -border transfer of your personal information", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 45955, "text": "8. How to update this policy", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 45956, "text": "9. How to contact us", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 45957, "text": "We know the importance of personal information to you, and also know that effective protection for your information is the cornerstone of our business healthy and sustainable development.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 45958, "text": "Thank you for your use and trust in Baidu Library!", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 45959, "text": "We are committed to maintaining your trust in us, abiding by the following principles, and protecting your personal information: the principles of consistency and responsibility, the principles of clear purpose, the principle of choice, at least the principle of safety, the principles of safety, the principle of subject participation, the principle of openness and transparency, etc.Essence", "label": ["Important"], "rewrite": "We abide by the principles of consistent and responsibilities, the principles of clear purpose, the principle of consent, the minimum principles, the principles of ensuring safety, the principles of subject participation, and the principle of openness and transparency to protect your personal information."}
{"task": "rw_25.jsonl", "id": 45960, "text": "We solemnly promise that we will take corresponding security protection measures to protect your personal information in accordance with the mature safety standards of the industry.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 45961, "text": "1. The information we collect and the corresponding purpose of the use", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 45962, "text": "We will follow the principles of legitimate, correct, and necessary to collect and use your personal information.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 45963, "text": "Specifically, we collect and process your personal information for your corresponding business functions.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 45964, "text": "In the corresponding features, if you provide personal information of others, please make sure that you have obtained the authorization of the relevant subject, we reserved the right to check the legal source of these personal information at any time.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you provide personal information of others, please make sure that you have obtained the authorization of the relevant subject."}
{"task": "rw_25.jsonl", "id": 45965, "text": "You need to provide us with personal information for us to realize the basic business functions of Baidu Library.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_25.jsonl", "id": 45966, "text": "In order to achieve the necessary personal information necessary for the information necessary for basic business functions, if you refuse to provide these necessary personal information, we will not be able to provide you with the basic business functions and corresponding services.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_25.jsonl", "id": 45967, "text": "In addition to basic business functions, you can choose to provide us with some personal information for us to expand business functions of Baidu Library.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_25.jsonl", "id": 45968, "text": "We will tell you the purpose of use and based on your authorization consent or realize the necessary purpose of expanding business functions you choose to process these personal information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_25.jsonl", "id": 45969, "text": "You refuse to provide such expansion business functions, which will not affect your basic business functions, but if you refuse to provide personal information necessary for implementing the function of expanding business functions, we will not be able to provide you with expanded business functions.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_25.jsonl", "id": 45970, "text": "To facilitate your understanding, we will be listed below to the business functions, processing purposes and personal information of the provided:", "label": ["Important", "First Party Collection Information"], "rewrite": "We will be listed below for the business functions, processing purposes, and personal information that we provide:"}
{"task": "rw_25.jsonl", "id": 45971, "text": "1.1. Search, browse", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 45972, "text": "You can use the Baidu Library's search and browsing service without logging in to Baidu account.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can use the Baidu Library's search and browsing service without logging in to Baidu account."}
{"task": "rw_25.jsonl", "id": 45973, "text": "In order to fulfill the cyber security guarantee obligations stipulated in laws and regulations, the management responsibility of Internet information content, and the more content that shows the correlation and what you may be interested in, our server will automatically record your activity information according to law, including the following:", "label": ["Important", "First Party Collection Information"], "rewrite": "Our servers will automatically record your activity information according to law to fulfill the obligations of cyber security, the management responsibility of Internet information content, and the more content that shows correlation and the content you may be interested in."}
{"task": "rw_25.jsonl", "id": 45974, "text": "(1) Search keyword information you entered;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_25.jsonl", "id": 45975, "text": "(2) Your browsing records, your collection, attention, reviews, likes, reposting and other operating behavior records;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_25.jsonl", "id": 45976, "text": "(3) Your device information;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_25.jsonl", "id": 45977, "text": "(4) The error information, feedback and review information you posted;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_25.jsonl", "id": 45978, "text": "(5) Other logs of your logs;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_25.jsonl", "id": 45979, "text": "We may also use the aforementioned information to bring you more convenient search and information flow services to continuously improve Baidu's library products and services.", "label": ["Important", "Usage"], "rewrite": "The collection of your collection information is used to search and information flow services and continuously improve Baidu's library products and services."}
{"task": "rw_25.jsonl", "id": 45980, "text": "For this purpose, we may also use the browser network storage and other mechanisms (including HTML5) and application data cache to collect information on your device and perform local storage.", "label": ["Data Retention", "Important", "First Party Collection Information"], "rewrite": "We may also use browser network storage and other mechanisms and application data cache to collect information on your device and perform local storage."}
{"task": "rw_25.jsonl", "id": 45981, "text": "1.2. Register and log in to account", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 45982, "text": "You can create a Baidu general account with your mobile phone number, and you can improve your account information.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 45983, "text": "(1) When registering and logging in to Baidu general account, you need to provide us with your mobile phone number.", "label": ["Important", "First Party Collection Information"], "rewrite": "When registering and logging in to Baidu general account, you need to provide us with a mobile phone number."}
{"task": "rw_25.jsonl", "id": 45984, "text": "You can choose to set the account name, avatar, login password, account binding mailbox.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can choose to set the account name, avatar, login password, account binding mailbox."}
{"task": "rw_25.jsonl", "id": 45985, "text": "(2) You can also log in to Baidu Library with a third -party account (such as WeChat, Weibo, QQ).", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_25.jsonl", "id": 45986, "text": "At this point, you will authorize the Baidu Library to read the public information registered in the third -party account (including your nickname, avatar, and other information you authorize).", "label": ["Important", "First Party Collection Information"], "rewrite": "When logging in with a third -party account, you will authorize Baidu Library to read the public information you register in the third -party account."}
{"task": "rw_25.jsonl", "id": 45987, "text": "(3) In order to meet the compulsory requirements of laws and regulations, for providing products or services, or based on your needs for enhanced account protection levels, when you use some services of Baidu Library or if you have further needs, you needProvide your real name, ID number, and face information to complete the real -name authentication of the account number.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use some services in Baidu Library or you have further needs, you need to provide your real name, ID number, face information to complete the real -name authentication of the account number."}
{"task": "rw_25.jsonl", "id": 45988, "text": "If you do not register your account or log in to Baidu Library, it will not hinder most of the business functions of the Baidu Library, but it may affect the business functions you need to use by real -name authentication.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you do not register your account and log in to Baidu Library, it will not hinder you use most of the business functions of Baidu Library."}
{"task": "rw_25.jsonl", "id": 45989, "text": "In order to verify the accuracy and integrity of the information, or to ensure your account security, we may make your corresponding information preserved by the agencies or government agencies allowed by the real -name information and laws and regulations provided to BaiduComparison test.", "label": ["Important", "Usage"], "rewrite": "We may compare and verify the real -name information provided by Baidu with your corresponding information preserved by the authority."}
{"task": "rw_25.jsonl", "id": 45990, "text": "(4), you can choose whether to log in to the Baidu library by yourself. If you choose the login method, the operator will process your mobile phone number information.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you choose the \"One -click login\" method, the operator will process your mobile phone number information."}
{"task": "rw_25.jsonl", "id": 45991, "text": "1.3. Release and interaction", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 45992, "text": "(1) When you publish dynamics, documents, audio and video, we will collect your publishing information and behavior information and display your nicknames, avatars, publishing content and information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you publish dynamics, documents, audio and video, etc., we will collect the information and behavioral information you published, and display your nickname, avatar, publishing content and information."}
{"task": "rw_25.jsonl", "id": 45993, "text": "(2) When you use posts, audio and video, or other release forms, we will apply for the camera, photos, and recording authority of your equipment system.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use posts, audio and video, or other release forms, we will apply for the camera, photos, and recording authority of your device system."}
{"task": "rw_25.jsonl", "id": 45994, "text": "If you refuse to authorize, you will not be able to use the corresponding function, but it does not affect other functions that you can achieve based on the above permissions without affecting your normal use of Baidu library.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_25.jsonl", "id": 45995, "text": "(3) When you pay attention to or share your account, or browse, collecting, following attention, comments, likes, and reposting, we will collect your aforementioned information and display the content published by the corresponding content publisher, or recommend it to you to recommend youYou may be interested in similar content or content publishers.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you pay attention or share your account, or browse, collecting, following attention, comments, likes, and reposting, we will collect your information and display it, or recommend the content for you."}
{"task": "rw_25.jsonl", "id": 45996, "text": "(4) When you make information sharing or receive information, we will read the password in the shear plate to achieve the jump of the information content.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you share or receive the information of the shared information, we will read the password in the shear plate to achieve the jump of the information content."}
{"task": "rw_25.jsonl", "id": 45997, "text": "(5) In principle, the information you choose to publish publicly will be visible to all users. If you involve your personal information and even sensitive personal information, please consider it carefully.", "label": ["Important", "First Party Collection Information"], "rewrite": "In principle, the information you choose to publish publicly will be visible to all users, please consider it carefully."}
{"task": "rw_25.jsonl", "id": 45998, "text": "If your personal information involves the personal information of others, you need to obtain the consent of others before disclosure.", "label": ["Important", "First Party Collection Information"], "rewrite": "If your personal information involves the personal information of others, you need to obtain the consent of others before disclosure."}
{"task": "rw_25.jsonl", "id": 45999, "text": "1.4.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46000, "text": "Baidu Library provides you with map transfers and voice transfer services.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46001, "text": "(1) If you use the graph to the text service, we will apply for the camera and album permissions of your equipment system.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you use a picture to transfer text services, we will apply for the camera and album permissions of your device system."}
{"task": "rw_25.jsonl", "id": 46002, "text": "After you have authorized consent, we will collect your picture information to convert your picture information into text.", "label": ["Permission Acquisition", "Important"], "rewrite": "After your authorization consent, collect your picture information to convert the picture information into text."}
{"task": "rw_25.jsonl", "id": 46003, "text": "(2) If you use voice transfer services, we will apply for the microphone rights of your equipment system.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you use voice transfer services, we will apply for the microphone rights of your device system."}
{"task": "rw_25.jsonl", "id": 46004, "text": "After you have authorized consent, we will collect your voice information to convert your voice information into text.", "label": ["Permission Acquisition", "Important"], "rewrite": "After your authorization consent, collect your voice information to convert voice information into text."}
{"task": "rw_25.jsonl", "id": 46005, "text": "(3), you can obtain your camera, album, microphone and other permissions by canceling the system authorized Baidu Library APP at any time to stop the collection of your information. After thatServices or functions, or cannot achieve the effects of the relevant services based on picture information and voice information, but it will not affect other business functions that can be realized based on the above permissions that are not based on the above permissions.", "label": ["Important", "Edit/Control"], "rewrite": "You can obtain your camera, album, microphone and other rights by canceling the system authorized Baidu Library APP to stop the collection of information, but the response service cannot be used."}
{"task": "rw_25.jsonl", "id": 46006, "text": "1.5. New service and functional operation and customer service processing", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46007, "text": "Baidu Library will launch operating activities for newly launched services and functions from time to time. For example, the new service launched needs to handle your personal information or apply for equipment system permissions, and before with your authorization consent, we will get your consent separately, of whichIf it involves the processing of sensitive personal information, we will get your separate consent.", "label": ["Permission Acquisition", "Important"], "rewrite": "If the new service launched needs to handle your personal information or apply for equipment system permissions, and before your authorization consent, we will get your consent separately."}
{"task": "rw_25.jsonl", "id": 46008, "text": "If you participate in related operating activities, we may collect but not be limited to your identity information, contact information, and trading account information through the operating activity interface to get in touch with you and send operation rewards to you.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you participate in operating activities, you may collect your identity information, contact information, and trading account information in order to contact you and issue operational rewards."}
{"task": "rw_25.jsonl", "id": 46009, "text": "If you do not participate in related operating activities, you do not need to provide the aforementioned information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46010, "text": "If you have questions about the products and services we provide or need customer service intervention for disputes, in order to verify your identity and position your problem, you may need to provide your identity information for verification.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you have any questions about the service or need customer service to deal with disputes, you may need to provide your identity information for verification."}
{"task": "rw_25.jsonl", "id": 46011, "text": "In order to ensure the quality of the call and ensure that the dispute is properly resolved, we may save your communication records with us, including call records, related information you provided by your disputes, and contact information you use or provided.", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to ensure the quality of calls and ensure that the dispute is properly resolved, you may save your communication records with us."}
{"task": "rw_25.jsonl", "id": 46012, "text": "1.6. News notice", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46013, "text": "Please know and agree that for your contact information (for example: contact telephone number) provided in the process of using the product and/or service, we may send one or more types of notifications to one or more in operation.Used for user messages, authentication, security verification, and user experience survey.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may send multiple types of notifications to one or more of you in your operation."}
{"task": "rw_25.jsonl", "id": 46014, "text": "In addition, we may also provide you with commercial information such as services, functions, or activities that may be interested in. If you do not want to accept this information, you can refund the withdrawal method provided in the phone SMSYou can also contact us directly to the withdrawal.", "label": ["Important"], "rewrite": "You can withdraw bips through the withdrawal method provided in mobile phone text messages, or you can directly contact us to contact us with the withdrawal of commercial information."}
{"task": "rw_25.jsonl", "id": 46015, "text": "1.7. To ensure service security, optimization and improve service purposes", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46016, "text": "When you use the Baidu library, in order to ensure your normal use of Baidu library services, more accurately positioning and solving the problems you encountered when using Baidu library service, improve and optimize the service experience of Baidu library, ensure your account security, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, and prevent, prevent, and prevent.Discovering and investigating fraud, hazards, security, illegal or violation of our agreements, policies or rules to protect the legitimate rights and interests of you, our affiliated companies, partners and the public, we will collect your equipment information,Log information and other information related to the login environment.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the Baidu library, we will collect your equipment information, log information, and other information related to the login environment to protect the security and protect the legitimate rights and interests of all parties."}
{"task": "rw_25.jsonl", "id": 46017, "text": "Please understand that when you will switch to the equipment background in the device screen to run, due to some device models and system reasons, the information collection behavior that you used to use the Baidu library related functions may not stop immediately, which will lead to it, which will lead to it, which will lead to a result.Better information collection behavior.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "When you will switch to the equipment background in the device screen, the information collection behavior may not be stopped immediately."}
{"task": "rw_25.jsonl", "id": 46018, "text": "1.8. Information convergence and personalized recommendation", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46019, "text": "(1) Gathering and integration: You agree that we will converge, identify and analyze, data portrait or further processing of personal information provided by you in this service through our own or subject technology technology, and form a variety of types and different types and different types of different types.The granularity can reflect the label information of your behavioral habits, hobbies, or credit status (hereinafter referred to as \"label information\"). We will use the label information for personalized recommendations in specific scenarios and purposes, push you to youInformation displayed by personalized display.", "label": ["Important", "Usage"], "rewrite": "You agree that we will bring the personal information you actively or passively provided in this service to converge, identify and analyze, data portrait or further processing to form label information for personalized recommendations."}
{"task": "rw_25.jsonl", "id": 46020, "text": "In addition to the information in this service to gather integration, we may associate and converge for the information collected from your various devices so that we can provide you with consistent services on these devices.", "label": ["Important", "Usage"], "rewrite": "From the information collected from your various devices, we may associate and gather them."}
{"task": "rw_25.jsonl", "id": 46021, "text": "For example, we may associate your device information or phone number with your Baidu account.", "label": ["Important", "Usage"], "rewrite": "We may associate your device information or phone number with your Baidu account."}
{"task": "rw_25.jsonl", "id": 46022, "text": "In the case of ensuring that personal information is under the control of the same business entity and does not change the data security guarantee capabilities and management level, it provides you with a consistent experience. You may actively or passively provided in this service mayCultivate and integrate the personal information provided by your active or passively in other product services you operate, and may form label information after further processing.middle.", "label": ["Important", "Usage"], "rewrite": "The information you provide in this service may be converged with the information you provided in our other services, and may be used to provide services together after forming label information."}
{"task": "rw_25.jsonl", "id": 46023, "text": "Such information that converges and fusion does not include information that can directly identify your personal identity, and we will guarantee the security processing of information after the fusion.", "label": ["Important", "Usage"], "rewrite": "The information that gathers integration does not include information that can directly identify your personal identity."}
{"task": "rw_25.jsonl", "id": 46024, "text": "(2) Personalized recommendation: We will use the label information and your search and browsing in the Baidu library, so that you can recommend you to be more interested and related.", "label": ["Important", "Usage"], "rewrite": "We will make personalized recommendations based on label information and your search and browsing in the Baidu library."}
{"task": "rw_25.jsonl", "id": 46025, "text": "In the personalized recommendation service, we will provide you with convenient rejection methods at the same time. We have established an independent control mechanism for personal information (such as labels, portrait dimensions, etc.) that users rely on personalized display to ensure that you regulate personalized display of personalized displayAffairs of correlation.", "label": ["Important", "Usage"], "rewrite": "In personalized recommendation services, you can regulate the degree of correlation with personalized display."}
{"task": "rw_25.jsonl", "id": 46026, "text": "For details, please refer to this policy [5.9. Exhibition and control of personalized content].", "label": ["Important", "Usage"], "rewrite": "For details, please refer to this policy [5.9. Exhibition and control of personalized content]."}
{"task": "rw_25.jsonl", "id": 46027, "text": "1.9. Indirect collection information", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46028, "text": "In order to provide you with reasonable needs such as the quality and personalization of products/services or improvement of product services, or for consideration of product and service safety, we may follow the Baidu platform, or based on your effective authorization or based on your effective authorization or based on your effective authorization.Reception companies, partners and other trusted third -party suppliers receive your personal information and other information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may receive your personal information and other information from the Baidu platform, affiliates, partners and other trusted third -party suppliers."}
{"task": "rw_25.jsonl", "id": 46029, "text": "We will ask the personal information provider in advance to explain the source of personal information and confirm the legality of the source of their personal information. At the same time, we will understand the scope of the authorization consent of the personal information processing of the personal information provider.If the personal information processing activity is performed beyond the scope of obtained authorization consent, we will obtain your explicit consent within the reasonable period of obtaining personal information or before processing personal information, or the provider of the personal information provided by your explicit statement by your explicit statement.agree", "label": ["Important", "First Party Collection Information"], "rewrite": "We will ask the personal information provider to explain the source of personal information in advance, confirm the legality of the source of the source of personal information, and obtain your explicit consent when exceeding the scope of the authorization."}
{"task": "rw_25.jsonl", "id": 46030, "text": "1.10. Exception of obtaining authorization in advance", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46031, "text": "Please note: In the following circumstances, collecting or using personal information does not need to obtain your authorization consent in advance:", "label": ["Important", "First Party Collection Information"], "rewrite": "In the following circumstances, collecting or using personal information does not need to obtain your authorization consent in advance:"}
{"task": "rw_25.jsonl", "id": 46032, "text": "(1), directly related to national security and national defense security;", "label": ["Important", "First Party Collection Information"], "rewrite": "The collection and use information directly related to national security and national defense security does not need to solicit authorization consent."}
{"task": "rw_25.jsonl", "id": 46033, "text": "(2) It is necessary for the contract to establish and fulfill the person as a party;", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to establish and fulfill the collection and use information necessary for the person as a party as a party, there is no need to solicit authorization consent."}
{"task": "rw_25.jsonl", "id": 46034, "text": "(3), must be performed to fulfill statutory duties or statutory volunteers;", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to fulfill the statutory duties or the collection and usage information necessary for the statutory volunteer, there is no need to solicit authorization consent."}
{"task": "rw_25.jsonl", "id": 46035, "text": "(4) In order to cope with emergencies, or in urgent situations, it is necessary to protect the health and property safety of natural people;", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to cope with emergencies, or in urgent cases to protect the life and health of natural persons and the necessary collection and use information, no need to solicit authorization."}
{"task": "rw_25.jsonl", "id": 46036, "text": "(5) directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Important", "First Party Collection Information"], "rewrite": "Directly related to the collection and usage information such as criminal investigation, prosecution, trial, and judgment execution does not need to solicit authorization consent."}
{"task": "rw_25.jsonl", "id": 46037, "text": "(6) For the major legitimate rights and interests of the life and property of you or other individuals, but it is difficult to get my consent;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting and using information out of major legitimate rights and interests such as maintaining your life and property of your or other individuals, but it is difficult to obtain your consent, and no authorization consent is required."}
{"task": "rw_25.jsonl", "id": 46038, "text": "(7), collect your own or other legal personal information in accordance with the provisions of laws and regulations;", "label": ["Important", "First Party Collection Information"], "rewrite": "In accordance with laws and regulations, personal information is processed by individuals or other legal disclosure within a reasonable range, and no authorization consent is required."}
{"task": "rw_25.jsonl", "id": 46039, "text": "(8), collect your personal information from legal public information in accordance with the provisions of laws and regulations, such as legal news reports, government information disclosure and other channels;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting your personal information from the legal and publicly disclosed information in accordance with the provisions of laws and regulations in accordance with the provisions of laws and regulations, without requiring authorization consent."}
{"task": "rw_25.jsonl", "id": 46040, "text": "(9), implement news reports, public opinion supervision and other behaviors for public interests, and handle personal information within a reasonable range;", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to implement news reports and public opinion supervision, deal with personal information within a reasonable scope without soliciting authorization consent."}
{"task": "rw_25.jsonl", "id": 46041, "text": "(10), when academic research institutions are necessary to carry out statistics or academic research based on public interests, and to provide academic research or description results, the personal information contained in the result is to identify", "label": ["Important", "First Party Collection Information"], "rewrite": "When academic research institutions are necessary to carry out statistics or academic research based on public interests, and provide academic research or description results, they can identify the personal information contained in the results without requiring the consent of authorization."}
{"task": "rw_25.jsonl", "id": 46042, "text": "(11), other circumstances stipulated in laws and regulations.", "label": ["Important", "First Party Collection Information"], "rewrite": "Other collection and use information stipulated in laws and regulations does not need to solicit authorization."}
{"task": "rw_25.jsonl", "id": 46043, "text": "1.11. Anonymous processing of personal information", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46044, "text": "Under the premise of not disclosing public information and providing your personal information, Baidu has the right to excavate, analyze and use the user database after anonymous processing (including commercial use), and has the right to count the product/service usage andShare statistical information after anonymous processing with the public/third parties.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Under the premise of not disclosing and providing your personal information, Baidu has the right to dig, analyze and use, and share the anonymous user database."}
{"task": "rw_25.jsonl", "id": 46045, "text": "1.12.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46046, "text": "In the process of providing services, in order to ensure that you can use the product function normally, we will apply for the following system equipment permissions of your device to the system. Before the application, we will consult your consent. You can choose \"allowed\" or \"prohibited\" permissions to apply.", "label": ["Permission Acquisition", "Important"], "rewrite": "We apply for the following system equipment permissions from the system. We will consult your consent before applying. You can choose \"allowing\" or \"prohibited\" permissions to apply."}
{"task": "rw_25.jsonl", "id": 46047, "text": "After your authorization, we will turn on the relevant authority. You can cancel the authorization in the system at any time. You cancel the authorization that will cause you to unable to use related business functions, but it will not cause you to use other business functions.", "label": ["Permission Acquisition", "Important"], "rewrite": "You can cancel authorization at any time, but it will cause you to be unable to use related business functions."}
{"task": "rw_25.jsonl", "id": 46048, "text": "The calls of various business functions on system privacy rights are as follows:", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46049, "text": "You can use the Baidu Library, [My-Settings-System Power] to check the contact limits and close the corresponding permissions.", "label": ["Important", "Edit/Control"], "rewrite": "You can check the contact limits and close the corresponding permissions through [My-Settings-System Power]."}
{"task": "rw_25.jsonl", "id": 46050, "text": "In different devices, the right display method and closing method may be different. For details, please refer to the device and system developer instructions or guidance.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46051, "text": "1.13. Other purposes you agree", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46052, "text": "When we want to use other purposes that the information is not stated in this privacy policy, we will solicit your consent in advance.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46053, "text": "When we want to use the information collected based on specific purposes for other purposes, we will solicit your consent in advance.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46054, "text": "2. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46055, "text": "Cookie and anonymous identifier tool.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46056, "text": "Cookie is a mechanism that supports the server (or script) to store and retrieve information on the client.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46057, "text": "When you use the Baidu library product or service, we will send one or more cookie or anonymous identifiers to your device.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46058, "text": "When you interact with the Baidu Library service, we allow cookie or anonymous identifiers to send to Baidu's server.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46059, "text": "Cookie usually contains identifiers, site names, and some numbers and characters.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46060, "text": "Using Cookie technology, Baidu can understand your habits, remember your preferences, save your steps to enter duplicate information, provide you with more thoughtful personalized services, or help you judge the security of your account.", "label": ["Important", "Usage"], "rewrite": "Use cookie technology to learn about your habits, remember your preferences, and save your steps to enter duplicate information."}
{"task": "rw_25.jsonl", "id": 46061, "text": "Cookie can also help us statistical traffic information, analyze the effectiveness of page design and advertising.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46062, "text": "We will not use Cookie for any purpose outside the purpose of this policy.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46063, "text": "You can manage or delete Cookie according to your preferences.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46064, "text": "For details, see aboutcookies.org.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46065, "text": "You can clear all the functions saved on the computer, cookies, and most of the network browsers have the functions of stopping, cookies.", "label": ["Important"], "rewrite": "You can clear all the cookies saved on the computer."}
{"task": "rw_25.jsonl", "id": 46066, "text": "But if you do this, you need to change the user settings when you visit our website, but you may not be able to log in or use the services or functions provided by Baidu that depend on Cookie because of these modifications.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46067, "text": "3. How do we share, transfer, publicly disclose, entrust your personal information and the third parties to be accessed", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46068, "text": "Some of our services will be provided by authorized partners. Only in order to achieve the purpose of the privacy policy, we may share some of your personal information with our partners to provide better customer service and user experience.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share some of your personal information with our partners to provide better customer service and user experience."}
{"task": "rw_25.jsonl", "id": 46069, "text": "We will only share your personal information for legal, correct, necessary, specific, and clear purposes, and only share the personal information necessary for providing services.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only share your personal information for legal, correct, necessary, specific, and clear purposes, and only share the personal information necessary for providing services."}
{"task": "rw_25.jsonl", "id": 46070, "text": "In addition to obtaining additional authorization or laws and regulations, our partners have no right to use the personal information shared on any other purpose.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In addition to obtaining additional authorization or laws and regulations, our partners have no right to use the personal information shared on any other purpose."}
{"task": "rw_25.jsonl", "id": 46071, "text": "3.1. Sharing", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46072, "text": "Unless you have a separate consent or in accordance with other laws and regulations, we will not share your personal information from a third party other than Baidu, except for the processing that cannot be identified and cannot be restored.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Unless you agree with or in accordance with other laws and regulations, we will not share your personal information from a third party other than Baidu, except for being able to identify specific individuals and cannot be restored."}
{"task": "rw_25.jsonl", "id": 46073, "text": "Companies, organizations and individuals who share personal information with us, we will investigate their data security environment, sign strict confidentiality agreement with them, and ask them to take confidentiality and security measures in accordance with the law to handle personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Companies, organizations and individuals who share personal information with us, we will investigate their data security environment, sign strict confidentiality agreement with them, and ask them to take confidentiality and security measures in accordance with the law to handle personal information."}
{"task": "rw_25.jsonl", "id": 46074, "text": "In the following circumstances, we may share your personal information with the following third parties:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the following circumstances, we may share your personal information with the following third parties:"}
{"task": "rw_25.jsonl", "id": 46075, "text": "3.1.1. Third -party products or service providers", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46076, "text": "Baidu Library is connected to a wealth of third -party services.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46077, "text": "When you use a third -party service connected to the Baidu Library, you may need to submit your personal information.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "When you use a third -party service connected to the Baidu Library, you may need to submit your personal information."}
{"task": "rw_25.jsonl", "id": 46078, "text": "We will provide your personal information based on your effective authorization or in the case of a contract that must be established or fulfilled as a party as a party.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will provide your personal information based on your effective authorization or in the case of a contract that must be established or fulfilled as a party as a party."}
{"task": "rw_25.jsonl", "id": 46079, "text": "Regarding how to collect and use your personal information on third -party services, it is recommended that you refer to the relevant service agreements and privacy policies of third -party services.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46080, "text": "(1) When you participate in the marketing activities or service content provided by a third party, you may need you to provide information such as the service required for the service needs.When providing marketing activities or service content, share your personal information from a third party to ensure that third parties can provide you smoothly or to fulfill you in time.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "When you participate in the marketing activities or service content provided by a third party, you need to provide information such as account nickname, avatar, name, contact information and other information to third parties."}
{"task": "rw_25.jsonl", "id": 46081, "text": "In the case of providing you with marketing activities or service content, if you refuse to share, third parties will not be able to provide you with services or reject your participation.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46082, "text": "(2), the receipt address: When you generate a transaction with a third party in the Baidu Library-Member Mall, and the third party obtains your contact information, the receiving address is necessary for providing product services, we will \"receive the goods\" receiving the goodsThe address information filled in the function and the contact information you provided to provide you with a third party that provides you with products or services;", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "When you have a transaction with a third party and your contact information is obtained by a third party, and the receiving address is necessary for providing product services, we will provide this information to the third party."}
{"task": "rw_25.jsonl", "id": 46083, "text": "When a third party obtains your invoice information is necessary for providing product services, we will provide the invoice information you filled in in the \"Order List\" function to a third party that provides you with products or services.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "When a third party obtains your invoice information is necessary for providing product services, we will provide the invoice information to the third party."}
{"task": "rw_25.jsonl", "id": 46084, "text": "3.1.2 Related company or the use of the same account system", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46085, "text": "We have highly consistent data security security measures and management levels between our affiliated companies or the use of the same account system.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46086, "text": "In order to provide you with a service experience that provides you, improves your product security and convenience, and guarantee consistency, under the premise of following the legal requirements, we will share your individuals between the related company or the same account system userinformation.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will share your personal information between the related companies or the use of the same account system and provide services together."}
{"task": "rw_25.jsonl", "id": 46087, "text": "In this case, we will only share the necessary personal information. If we share your sensitive personal information or the purpose of changing the use and processing of personal information, we will solicit your authorization consent again.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only share the necessary personal information with related parties, such as sharing sensitive personal information or the purpose of changing the use and processing of personal information, and will solicit your authorization consent again."}
{"task": "rw_25.jsonl", "id": 46088, "text": "For the use party of the same account system, in order to fulfill the supervision requirements, ensure account security, conduct consistent display, and contact you, based on your effective authorization, we may share your account information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Based on your effective authorization, we may share your account information."}
{"task": "rw_25.jsonl", "id": 46089, "text": "3.1.3 You take the initiative to choose a third party that share with you personal information", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46090, "text": "You can use Baidu's sharing function to share with Baidu friends, QQ friends, WeChat friends, Weibo friends, including but not limited to information content and search results you are interested in.", "label": ["Important"], "rewrite": "You can use Baidu's sharing function to share with Baidu friends, QQ friends, WeChat friends, Weibo friends."}
{"task": "rw_25.jsonl", "id": 46091, "text": "Please fully consider the reputation of the information receiving person before using the third -party service or sharing function, and suggest that you check the personal information processing rules (such as privacy policies) you use to use the social network or third -party service providerProcess your information for prudent decisions.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46092, "text": "3.2. Transfer", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46093, "text": "We will not transfer your personal information to any company, organization and individual except Baidu Company, except the following situations: except:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not transfer your personal information to any company, organization and individual except Baidu Company, except the following situations: except:"}
{"task": "rw_25.jsonl", "id": 46094, "text": "(1), get your clear authorization or consent in advance;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Get your clear authorization or consent in advance, you may transfer your personal information to the outside world."}
{"task": "rw_25.jsonl", "id": 46095, "text": "(2), meet the requirements of laws and regulations, legal procedures or government requirements or judicial rulings;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Meeting the requirements of laws and regulations, legal procedures or government requirements or judicial rulings, may transfer your personal information to the outside world."}
{"task": "rw_25.jsonl", "id": 46096, "text": "(3) If we or our affiliate companies involve transactions such as mergers, separation, liquidation, assets, or business, your personal information may be transferred as part of such transactions. We will ensure that these informationThe confidentiality during the transfer, the name or name and contact information of the receiver that the receiver will be told you, and the most likely to ensure that the new company holding your personal information and the organization will continue to be subject to this privacy policy. Otherwise, we will ask the company to ask the company to ask the company, Organize the consent of authorization to you.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When involving mergers, acquisitions, or bankruptcy liquidation, if personal information transfer is involved, it will be required to continue to be bound by the policy, otherwise it will request that it will re -solicit authorization consent."}
{"task": "rw_25.jsonl", "id": 46097, "text": "3.3 Public disclosure", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46098, "text": "We will only publicly disclose your personal information in the following circumstances:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only publicly disclose your personal information in the following circumstances:"}
{"task": "rw_25.jsonl", "id": 46099, "text": "(1), get your alone consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Getting your individual consent may disclose your personal information publicly."}
{"task": "rw_25.jsonl", "id": 46100, "text": "(2), under the requirements of the mandatory requirements of laws and regulations, legal procedures, litigation or government authorities;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Based on laws and regulations, legal procedures, litigation, or the mandatory requirements of government authorities, your personal information may be disclosed publicly."}
{"task": "rw_25.jsonl", "id": 46101, "text": "(3) In the announcement of illegal accounts and illegal acts, we will disclose information about relevant accounts. This information will inevitably include related certification information and violations of account numbers.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When a punishment announcement of illegal accounts and violations, we will disclose information about the relevant account."}
{"task": "rw_25.jsonl", "id": 46102, "text": "3.4 Sharing, transfer, and public disclosure of personal information.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46103, "text": "In the following circumstances, sharing, transfer, and publicly disclose personal information without obtaining the authorization of the subject of personal information in advance:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the following circumstances, sharing, transfer, and publicly disclose personal information without obtaining the authorization of the subject of personal information in advance:"}
{"task": "rw_25.jsonl", "id": 46104, "text": "(1), directly related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The sharing or disclosure directly related to national security and national defense security does not require authorization."}
{"task": "rw_25.jsonl", "id": 46105, "text": "(2) It is necessary for the contract to establish and fulfill the person as a party;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to establish and fulfill the sharing, transfer or disclosure of the contract as a party as a party, no authorization is required."}
{"task": "rw_25.jsonl", "id": 46106, "text": "(3), must be performed to fulfill statutory duties or statutory volunteers;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to fulfill the shared, transferred or disclosed by the statutory duties or the necessary sharing, transfer, or disclosure necessary for the statutory duty, no authorization is required."}
{"task": "rw_25.jsonl", "id": 46107, "text": "(4) Directly related to public safety, public health, and major public interests.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Sharing or disclosure directly related to public safety, public health and major public interests does not need to be authorized."}
{"task": "rw_25.jsonl", "id": 46108, "text": "For example: to deal with emergencies, or in urgent situations to protect the health and property security of natural people;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to cope with emergencies, or in urgent situations to protect the health of natural people and the must -sharing, transfer or disclosure of property security, no authorization is required."}
{"task": "rw_25.jsonl", "id": 46109, "text": "(5) Directly related to criminal investigation, prosecution, trial and judgment execution;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Sharing or disclosure related to criminal investigation, prosecution, trial, and judgment execution does not need to be authorized."}
{"task": "rw_25.jsonl", "id": 46110, "text": "(6) For the major legitimate rights and interests of the life, property of the subject of personal information or other individuals, it is difficult to get my consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Out of the major legitimate rights and interests of the life and property of the subject of personal information or other individuals, it is difficult to get shared or disclosed by my consent, and there is no need to solicit."}
{"task": "rw_25.jsonl", "id": 46111, "text": "(7) In accordance with the provisions of laws and regulations, handle individuals' self -disclosure or other legal personal information within a reasonable scope, such as: legal news reports, government information disclosure and other channels;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In accordance with the provisions of laws and regulations, handle individuals' self -disclosure or other legitimate personal information within a reasonable scope without authorization."}
{"task": "rw_25.jsonl", "id": 46112, "text": "(8), laws and administrative regulations are otherwise stipulated.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The sharing or disclosure of other laws and regulations and other regulations does not need to be authorized."}
{"task": "rw_25.jsonl", "id": 46113, "text": "3.5. The third -party software development tool package (SDK) we connect", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46114, "text": "In order to adapt to the use of Baidu library and third -party platform services on different mobile phone devices to achieve your mobile phone device identity authentication, mobile phone equipment security, receiving information push, login in third -party platform account, sharing information through third -party platforms, and payment security. BaiduThe library is connected to a third -party SDK.", "label": ["Important"], "rewrite": "Baidu library access to third -party SDK."}
{"task": "rw_25.jsonl", "id": 46115, "text": "The above -mentioned third -party SDK providers include mobile phone equipment manufacturers, social platforms, communication operators and third -party payment institutions.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46116, "text": "Some third -party SDKs may call your device permissions and get your relevant information so that you can use the corresponding functions normally on different mobile phone devices or third -party platforms.", "label": ["Permission Acquisition", "Important"], "rewrite": "Some third -party SDKs may call your equipment permissions and get your relevant information for you to use."}
{"task": "rw_25.jsonl", "id": 46117, "text": "Different third -party SDKs may have different types of equipment permissions and the information obtained. It may include getting your location, reading/writing your external memory card, reading your mobile phone status and identity, viewing WLAN connection, retrieval is currently inRunning application/Bluetooth information.", "label": ["Permission Acquisition", "Important"], "rewrite": "Different third -party SDKs call the types of equipment permissions and the information obtained may be different."}
{"task": "rw_25.jsonl", "id": 46118, "text": "Regarding the type of equipment permissions for third -party SDK, and how to collect and use your personal information, it is recommended that you refer to the relevant service agreement and privacy policy of the third -party SDK.", "label": ["Permission Acquisition", "Important"], "rewrite": "It is recommended that you refer to the related service agreement and privacy policy of third -party SDK."}
{"task": "rw_25.jsonl", "id": 46119, "text": "If you want to learn more about the third -party SDK of our access, please read the third -party SDK description.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46120, "text": "3.6 Entrusted processing and common treatment", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46121, "text": "In order to provide you better, we may entrust third -party partners to process your personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to provide you better, we may entrust third -party partners to process your personal information."}
{"task": "rw_25.jsonl", "id": 46122, "text": "We will only entrust third -party partners to handle your information for legal, correct, necessary, specific, and clear purposes.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only entrust third -party partners to handle your information for legal, correct, necessary, specific, and clear purposes."}
{"task": "rw_25.jsonl", "id": 46123, "text": "We will strictly restrict the information processing purpose of the trustee and require the trustees to take full data security guarantee methods.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will strictly restrict the information processing purpose of the trustee and require the trustees to take full data security guarantee methods."}
{"task": "rw_25.jsonl", "id": 46124, "text": "If a third -party partner uses your information for our unreasonable purpose, it will obtain your consent separately.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If a third -party partner uses your information for our unreasonable purpose, it will obtain your consent separately."}
{"task": "rw_25.jsonl", "id": 46125, "text": "Our authorized partners include authorized partners of advertising and analytical services.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46126, "text": "We will entrust these partners to deal with information about advertising, advertising effects, and advertising reaching rates related to the safety technology of the industry.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We commissioned partners to handle information related to advertising, advertising effects, and advertising reach."}
{"task": "rw_25.jsonl", "id": 46127, "text": "Without your effective authorization, we will not commission the third -party partner for information that can directly identify your personal identity.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Without your effective authorization, we will not commission the third -party partner for information that can directly identify your personal identity."}
{"task": "rw_25.jsonl", "id": 46128, "text": "If you actively leave your contact information, address information and other personal information for specific third -party partners to contact you, it will directly process your personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you actively leave your personal information for specific third -party partners to contact you, it will directly process your personal information."}
{"task": "rw_25.jsonl", "id": 46129, "text": "In the joint processing scenario, we will also sign relevant agreements with the requirements of the partner in accordance with the requirements of the laws and regulations and fulfill the relevant personal information protection obligations.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will sign the relevant agreement with the partners and fulfill the relevant personal information protection obligations."}
{"task": "rw_25.jsonl", "id": 46130, "text": "4. How do we save and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46131, "text": "4.1. Save period", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46132, "text": "We will save your personal information within the time limit for providing the service, but the laws and regulations have other regulations on the period of preservation, you agree to retain longer periods, ensure the safety and quality of services, achieve disputed purpose, and technically difficult to achieve technically achieved the purpose of solving disputes.Under the circumstances, after the foregoing period of preservation expires, we will extend the storage period in accordance with the law, according to law, or within a reasonable range.", "label": ["Data Retention", "Important"], "rewrite": "Generally, your personal information is retained within the time limit required to achieve service purposes, unless the law has other requirements."}
{"task": "rw_25.jsonl", "id": 46133, "text": "After exceeding the storage period, we will delete your personal information or perform anonymous processing in accordance with the law.", "label": ["Data Retention", "Important"], "rewrite": "After exceeding the storage period, we will delete your personal information or perform anonymous processing in accordance with the law."}
{"task": "rw_25.jsonl", "id": 46134, "text": "4.2. Save area", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46135, "text": "In principle, the personal information we collected and generated in the territory of the People's Republic of China will be stored in the territory of the People's Republic of China.", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in domestic operations will be stored in China."}
{"task": "rw_25.jsonl", "id": 46136, "text": "If your personal information may be transferred to the overseas jurisdiction of your country or the country/region, or by the interview from these jurisdictions, we will strictly fulfill the obligations stipulated in the laws and regulations and obtain you in accordance with the laws and regulations.Agree alone.", "label": ["Data Retention", "Important"], "rewrite": "If your information is transferred cross -border, we will strictly fulfill the obligations stipulated in the laws and regulations and obtain your separate consent in advance in accordance with the law."}
{"task": "rw_25.jsonl", "id": 46137, "text": "There may be different data protection laws in such jurisdictions, and no relevant laws are set up.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46138, "text": "In such circumstances, we will transmit your personal information in accordance with the provisions of the current laws of China, and will ensure that your personal information is sufficiently protected in the People's Republic of China.", "label": ["Data Retention", "Important"], "rewrite": "We will transmit your personal information in accordance with the provisions of the current laws of Chinese and ensure that your personal information is sufficiently protected in the territory."}
{"task": "rw_25.jsonl", "id": 46139, "text": "For example, we will ask you to agree to cross -border transfer of personal information, or implement security measures such as data to identify data before cross -border data transfer.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "We will ask you to agree to cross -border transfer of personal information, or implement security measures such as data to identify data before cross -border data transfer."}
{"task": "rw_25.jsonl", "id": 46140, "text": "4.3. Safety measures", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46141, "text": "(1), we will collect, use, store and transmit user information with the \"minimum\" principle, and inform you the purpose and scope of the relevant information through user agreements and privacy policies.", "label": ["Important", "Data Security"], "rewrite": "We will collect, use, store, and transmit user information with the \"minimization\" principle, and inform the purpose and scope of the use of information."}
{"task": "rw_25.jsonl", "id": 46142, "text": "(2) We attach great importance to information security.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46143, "text": "We have set up a specialized team responsible for research and development and application of multiple security technologies and procedures. We will conduct a security background review of the person in charge of safety management and key safety positions. We have established a comprehensive information security management system and internal security incident disposal mechanismwait.", "label": ["Important", "Data Security"], "rewrite": "The establishment of a specialized team is responsible for the research and development and application of multiple security technologies and procedures, the safety background review of the person in charge of safety management and key safety positions, establishing a sound information security management system and internal security incident disposal mechanism."}
{"task": "rw_25.jsonl", "id": 46144, "text": "We will adopt appropriate security measures and technical means to storage and protect your personal information that meets industry standards to prevent your information from being lost, being disclosed, use, damage, lost or leaked by unauthorized access, public disclosure, use, damage, loss, or leakage.", "label": ["Important", "Data Security"], "rewrite": "Take security measures and technical means to store and protect your personal information to prevent your information from being lost, being interviewed, publicly disclosed, used, damaged, lost, or leaked."}
{"task": "rw_25.jsonl", "id": 46145, "text": "We will take all reasonable and feasible measures to protect your personal information.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46146, "text": "We will use encryption technology to ensure the confidentiality of the data;", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46147, "text": "We will use a trusted protection mechanism to prevent data from being maliciously attacked.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46148, "text": "(3), we will conduct data security consciousness training and assessment of data security, and strengthen employees' awareness of protecting the importance of personal information.", "label": ["Important", "Data Security"], "rewrite": "Perform data security training and assessment of employees, and strengthen employees' understanding of the importance of personal information."}
{"task": "rw_25.jsonl", "id": 46149, "text": "We will perform identity authentication and authority control to employees who handle personal information, and sign a confidentiality agreement with employees and partners who are in contact with your personal information to clarify job responsibilities and code of conduct to ensure that only authorized personnel can access personal information.", "label": ["Important", "Data Security"], "rewrite": "The employees who handle personal information have identified authentication and permission control and signed a confidentiality agreement with them."}
{"task": "rw_25.jsonl", "id": 46150, "text": "If there is an act of violating the confidentiality agreement, it will be immediately terminated with the cooperative relationship with Baidu, and will be held accountable for relevant legal responsibilities. It also puts forward confidentiality requirements for personnel in contact with personal information when leaving the post.", "label": ["Important", "Data Security"], "rewrite": "Persons who violate the confidentiality agreement will be held legal and responsible, and put forward confidentiality requirements for those who come into contact with personal information when they leave."}
{"task": "rw_25.jsonl", "id": 46151, "text": "(4) We remind you that the Internet is not an absolutely secure environment. When you interact with other users through the third -party social software, emails, SMS, etc. in the Baidu libraryWhether the three -party software's transmission of information is completely encrypted to ensure the security of your personal information.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46152, "text": "(5) We also ask you to understand that due to the technical restrictions and rapid development of the Internet industry, and various malicious attack methods that may exist, even if we do our best to strengthen security measures, it is impossible to ensure 100 % security of information.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46153, "text": "Please understand that the system and communication network you used when using our products and/or services may have security problems in other links other than our control.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46154, "text": "(6) According to our security management system, personal information leakage, damage or loss incidents are listed as the most major security incidents. Once the company is launched, the company's highest -level emergency plan will occur.The department formed a joint emergency response team treatment.", "label": ["Important", "Data Security"], "rewrite": "A joint emergency response team such as the Ministry of Security, the Ministry of Public Affairs, and the Ministry of Legal Affairs handles personal information security incidents."}
{"task": "rw_25.jsonl", "id": 46155, "text": "4.4. Safety event notice", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46156, "text": "(1), we will formulate emergency plans for cyber security incidents, timely dispose of security risks such as system vulnerabilities, computer viruses, cyber attacks, and network invasion. When incidents that harm to cyber security occur, we will immediately start the emergency plan and take corresponding remedies.The measures report to the relevant authorities in accordance with regulations.", "label": ["Important", "Data Security"], "rewrite": "When incidents that are harmful to network security, we will immediately launch an emergency plan, take corresponding remedial measures, and report to the relevant authorities in accordance with regulations."}
{"task": "rw_25.jsonl", "id": 46157, "text": "(2) Personal information leakage, damage, and loss belong to the company -level super -large security incident. We will be responsible for regularly organizing working group members to conduct safety plan exercises to prevent such security incidents from occur.", "label": ["Important", "Data Security"], "rewrite": "We will be responsible for regularly organizing working group members to conduct safety plan drills."}
{"task": "rw_25.jsonl", "id": 46158, "text": "Once unfortunately, we will start emergency plans in accordance with the highest priority to form an emergency emergency group to trace the causes and reduce losses in the shortest time.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46159, "text": "(3) After the personal information security incident occurs unfortunately, we will inform you the basic situation and possible impact of the security incident in accordance with the requirements of the laws and regulations.Suggestions for risks, remedy measures, etc.", "label": ["Important", "Data Security"], "rewrite": "If a personal information security incident occurs, we will inform your basic situation, possible impact, disposal measures, independent prevention suggestions, etc."}
{"task": "rw_25.jsonl", "id": 46160, "text": "We will promptly tell you the incident -related situation in the site notification, SMS notification, telephone, email, etc. Informing you, it is difficult to inform you one by one, we will publish a reasonable and effective way to publish an announcement.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46161, "text": "At the same time, we will also actively report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "Report the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities."}
{"task": "rw_25.jsonl", "id": 46162, "text": "Please understand that according to the provisions of laws and regulations, if the measures we take can effectively avoid information leakage, tampering, and loss, causing harm, unless the regulatory authorities ask you to notify you, we can choose not to notify you information security incidents.", "label": ["Important", "Data Security"], "rewrite": "If it can effectively avoid information leakage, tampering, or loss, we can choose not to notify you the information security incident, unless the regulatory authorities have other requirements."}
{"task": "rw_25.jsonl", "id": 46163, "text": "5. Your rights", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46164, "text": "In accordance with China's relevant laws, regulations, standards, and the practice of other countries and regions, we guarantee that you exercise the following rights on your personal information. If you have doubts about your rights or claims, you can also use [8. How to contact how to contactThe way we] get in touch with us:", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46165, "text": "5.1. Review right", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46166, "text": "In principle, you can check your personal information in the following ways:", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46167, "text": "(1) Account Information: You can log in to passport.baidu.com or visit [Mine],-, [Settings], [Account Management], access or edit your personal information information (including Dan but but but butNot limited to gender, birthday, blood type, address, marriage status, degree of education, education experience, occupation, mobile phone number, secret mailbox, work unit, avatar).", "label": ["Important", "Edit/Control"], "rewrite": "You can log in to passport.baidu.com or visit [Mine] - [Settings] - [Account Management] to visit or edit your personal information information."}
{"task": "rw_25.jsonl", "id": 46168, "text": "(2) Access information (browsing records and consumption records): You can visit your documentation record, collection records, download records and certification records on the library web page [Personal Center]-[My Documents];", "label": ["Edit/Control", "Important"], "rewrite": "You can visit your document upload records, collection records, download records and certification records on the documentation of the library on the library webpage."}
{"task": "rw_25.jsonl", "id": 46169, "text": "You can visit your video upload records on the library on the library web page [Personal Center]-[Video Course];", "label": ["Important", "Edit/Control"], "rewrite": "You can visit your video upload record on the video of the library on the end of the library web."}
{"task": "rw_25.jsonl", "id": 46170, "text": "You can visit your consumption records (my order]-[My Order]-[My Order]-[My Order].", "label": ["Important", "Edit/Control"], "rewrite": "You can visit your consumption record at the [Personal Center]-[My Order]-[My Order]."}
{"task": "rw_25.jsonl", "id": 46171, "text": "(3) Access order information (member information, order records, settlement information, member exchange records): You can access your member information on the end of the library web page [Personal Center]-[My VIP];", "label": ["Important", "Edit/Control"], "rewrite": "You can visit your membership information on the end of the library webpage [Personal Center]-[My VIP]."}
{"task": "rw_25.jsonl", "id": 46172, "text": "You can access your order record at the end of the library web page [Personal Center]-[My Order]", "label": ["Edit/Control", "Important"], "rewrite": "You can visit your order record at the [Personal Center]-[My Order]-[My Order]."}
{"task": "rw_25.jsonl", "id": 46173, "text": "You can visit your settlement record at the end of the library web page [Personal Center]-[Settlement Center]", "label": ["Important", "Edit/Control"], "rewrite": "You can visit your settlement record at the [Personal Center]-[Settlement Center]."}
{"task": "rw_25.jsonl", "id": 46174, "text": "You can check your VIP redemption code, voucher, VIP gift card exchange record on the end of the library webpage.", "label": ["Important", "Edit/Control"], "rewrite": "You can check your VIP redemption code, voucher, VIP gift card exchange record on the end of the library webpage."}
{"task": "rw_25.jsonl", "id": 46175, "text": "5.2. Correction and replenishment", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46176, "text": "When you find that there are errors or incomplete personal information that we processed, you have the right to verify your identity and correct your identity without affecting the objectivity and accuracy of the information.The information is correct or supplemented. You can use [Mine],-, [Settings], [Account Management] in the Baidu Library to make corrections or supplements, or use feedback and errorsSubmit to us.", "label": ["Important", "Edit/Control"], "rewrite": "You can submit your more correct or supplementary application through [Mine] - [Settings] - [Account Management] to submit your more correct or supplementary application through feedback and error reporting."}
{"task": "rw_25.jsonl", "id": 46177, "text": "5.3. Delete right", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46178, "text": "In the following circumstances, you can make a request to delete personal information:", "label": ["Important", "Edit/Control"], "rewrite": "In the following circumstances, you can make a request to delete personal information to us: (1) If we violate laws and regulations or deal with your personal information with your agreement;It is no longer necessary to achieve the purpose of the treatment; (3) If we stop providing products or services, or the storage period has expired; (4) If you withdraw consent."}
{"task": "rw_25.jsonl", "id": 46179, "text": "(1) If we violate laws and regulations or process your personal information with your agreed;", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46180, "text": "(2) If our processing purpose has been achieved, unable to achieve or for the purpose of the treatment, it is no longer necessary;", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46181, "text": "(3) If we stop providing products or services, or the storage period has expired;", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46182, "text": "(4) If you withdraw your consent;", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46183, "text": "(5) Other circumstances stipulated in laws and administrative regulations.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46184, "text": "When you delete the information from our services, we may not immediately delete the corresponding information in the backup system, but will delete these information when the backup is updated.", "label": ["Important", "Risk"], "rewrite": "Delete the information you require delete in the backup update."}
{"task": "rw_25.jsonl", "id": 46185, "text": "Please know and understand that if the preservation period stipulated in laws and administrative regulations or the explanation of this privacy policy has not been expired, or delete personal information is difficult to achieve from technically, we will stop except storage and adopting necessary security measures.deal with.", "label": ["Data Retention", "Important"], "rewrite": "Our personal information that has not yet expired or technically difficult to delete the specified preservation period is processed except for storage and adopting necessary security measures until we can be deleted or achieved anonymous."}
{"task": "rw_25.jsonl", "id": 46186, "text": "5.4. Withdrawal consent", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46187, "text": "Each business function requires some basic personal information to complete.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46188, "text": "For the collection and use of additional personal information, you can give or withdraw your authorization consent at any time.", "label": ["Important", "First Party Collection Information"], "rewrite": "For the collection and use of additional personal information, you can give or withdraw your authorization consent at any time."}
{"task": "rw_25.jsonl", "id": 46189, "text": "(1), you can log in to passport.baidu.com to relieve the binding relationship between Baidu account and third -party account.", "label": ["Important"], "rewrite": "You can log in to passport.baidu.com to relieve the binding relationship between Baidu account and third -party account."}
{"task": "rw_25.jsonl", "id": 46190, "text": "(2), you can directly turn off the system permissions such as [storage, camera, microphone, notification] in the device system, change the consent range or withdraw your authority.", "label": ["Important", "Edit/Control"], "rewrite": "You can directly turn off the system permissions such as [storage, camera, microphone, notification], change the scope of consent or withdraw your permissions."}
{"task": "rw_25.jsonl", "id": 46191, "text": "(3) When you withdraw your consent, we cannot continue to provide you with the service corresponding to the withdrawal consent, and we will no longer use your corresponding personal information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you withdraw your consent, you cannot continue to provide the corresponding service, and you will no longer use your corresponding personal information."}
{"task": "rw_25.jsonl", "id": 46192, "text": "But your decision to withdraw consent will not affect personal information processing based on your consent.", "label": ["Important", "First Party Collection Information"], "rewrite": "Withdrawal of consent will not affect personal information processing based on your consent."}
{"task": "rw_25.jsonl", "id": 46193, "text": "5.5. List of cancellation", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46194, "text": "You can cancel the previously registered account.", "label": ["Edit/Control", "Important"], "rewrite": "You can cancel the previously registered account."}
{"task": "rw_25.jsonl", "id": 46195, "text": "You can log in to passport.baidu.com and cancel your Baidu account.", "label": ["Important", "Edit/Control"], "rewrite": "You can log in to passport.baidu.com and cancel your Baidu account."}
{"task": "rw_25.jsonl", "id": 46196, "text": "(1), you can also cancel your account number in Baidu Library through the following path: [Mine],-, [Settings],-, [Account Management]-[Account Logging up].", "label": ["Important", "Edit/Control"], "rewrite": "You can also cancel your account in Baidu Library through the following path: [Mine] - [Settings] - [Account Management] - [Account Logging up]."}
{"task": "rw_25.jsonl", "id": 46197, "text": "(2) Once you cancel the Baidu account, you will not be able to use the services of Baidu's entire line of user products, so please do it carefully.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46198, "text": "In order to protect the legitimate rights and interests of you or others, we will determine whether you support your cancellation request for the use of Baidu's products.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46199, "text": "For example, if you have unsolved manuscript fees in Baidu's experience, or you have unprepared glutinous rice storage cards in Baidu Nuomi, or there are information in your network disk, we will not immediately support your request.", "label": ["Important"], "rewrite": "If you have unsubscribed manuscript fees, unmarked glutinous rice storage cards or information on the network disk, we will not immediately support your cancellation request."}
{"task": "rw_25.jsonl", "id": 46200, "text": "In addition to other provisions of laws and regulations, we will stop providing you with products and services and delete your personal information according to your requirements.", "label": ["Important"], "rewrite": "After canceling the account, we will stop providing products and services and delete personal information as required."}
{"task": "rw_25.jsonl", "id": 46201, "text": "(3), if you only need to remove the traces of your use in the Baidu library, you can refer to the following path implementation: [Mine],-, [Settings],-, [Account Management]-, [Account Logistics].", "label": ["Edit/Control", "Important"], "rewrite": "You can use [Mine] - [Settings] - [Account Management] - [Account Logging up] Clear your traces of use in Baidu Library."}
{"task": "rw_25.jsonl", "id": 46202, "text": "(4) When you authorize to log in to Baidu Library through a third -party account (such as WeChat, Weibo, QQ, etc.), you need to apply for a cancellation account with a third party.", "label": ["Important", "Edit/Control"], "rewrite": "When you authorize to log in to Baidu Library through a third -party account, you need to apply for a cancellation account with a third party."}
{"task": "rw_25.jsonl", "id": 46203, "text": "5.6. Copy power and the right to carry", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46204, "text": "You have the right to copy your personal information we collected.", "label": ["Edit/Control", "Important"], "rewrite": "You have the right to copy your personal information we collected."}
{"task": "rw_25.jsonl", "id": 46205, "text": "Under the conditions stipulated by laws and regulations, instructions and conditions stipulated by the national network information department at the same time, if technology is feasible, you can also ask us to transfer your personal information to other subjects you designated.", "label": ["Important", "Edit/Control"], "rewrite": "If technology is feasible, you can ask us to transfer your personal information to other subjects you designated."}
{"task": "rw_25.jsonl", "id": 46206, "text": "5.7. Know the product and service in advance to stop operating rights", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46207, "text": "Baidu Library is willing to accompany you. If Baidu Library products stop operating due to special reasons, we will notify the homepage or in -site letter or send you an inner product or in -site service during a reasonable period.You will stop the collection of your personal information, and at the same time, you will delete or processes your personal information that has been collected in accordance with the law.", "label": ["Important", "Cessation of Operations"], "rewrite": "When stopping operations, we will notify you to stop collecting your personal information and delete or delete your personal information."}
{"task": "rw_25.jsonl", "id": 46208, "text": "5.8. Get the right to explain", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46209, "text": "You have the right to ask us to explain the personal information processing rules.", "label": ["Important"], "rewrite": "You have the right to ask us to explain the personal information processing rules."}
{"task": "rw_25.jsonl", "id": 46210, "text": "You can get in contact with us through the contact information in part 8", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46211, "text": "5.9. Show and control of personalized content", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46212, "text": "5.9.1. Exhibition and control of personalized content", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46213, "text": "If you don't want to receive related personalized content for you based on your interest preferences, you can use [Mine]-[Settings]-[Privacy Settings]-[Recommended settings]-[Personalized recommendation] Close personalized content recommendation recommendation recommendationEssence", "label": ["Important", "Edit/Control"], "rewrite": "You can use [Mine]-[Settings]-[Privacy Settings]-[Recommended settings]-[Personalized recommendation] Close personalized content recommendation."}
{"task": "rw_25.jsonl", "id": 46214, "text": "When you choose to close the personalized content recommendation, you cannot enjoy personalized recommendation services. We will show you the content based on non -personalized factors such as content heat. You may see what you are not interested in or even dislikes.Experience may be affected.", "label": ["Important"], "rewrite": "When you choose to close the recommendation of personalized content, we will show you the content based on non -personalized factors such as content heat."}
{"task": "rw_25.jsonl", "id": 46215, "text": "5.10. Exception of rights exercise", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46216, "text": "In the following circumstances, we may not be able to respond to your inspection, correction and supplementation, deletion, copying, and request for carrying, knowing, knowing, and deciding:", "label": ["Important", "Edit/Control"], "rewrite": "In the following circumstances, we may not be able to respond to your inspection, correction and supplementation, deletion, copying, and request for carrying, knowing, knowing, and deciding:"}
{"task": "rw_25.jsonl", "id": 46217, "text": "(1), directly related to national security and national defense security;", "label": ["Edit/Control", "Important"], "rewrite": "If your request is directly related to national security and national defense security, you may not be responded."}
{"task": "rw_25.jsonl", "id": 46218, "text": "(2) Directly related to public safety, public health, and major public interests;", "label": ["Important", "Edit/Control"], "rewrite": "Your request is directly related to public safety, public health, and major public interests and may not be responded."}
{"task": "rw_25.jsonl", "id": 46219, "text": "(3), directly related to criminal investigation, prosecution, trial, and execution judgment;", "label": ["Important", "Edit/Control"], "rewrite": "Your request is related to criminal investigation, prosecution, and trial, and may not be responded."}
{"task": "rw_25.jsonl", "id": 46220, "text": "(4), we have sufficient evidence that you have subjective malice or abuse of rights (such as your request will endanger public safety and the legitimate rights and interests of others, or your request exceeds the scope of general technical means and commercial costs);", "label": ["Important", "Edit/Control"], "rewrite": "If we have sufficient evidence that the subject of personal information has subjective malice or abuse of rights, we may not be able to respond to requests."}
{"task": "rw_25.jsonl", "id": 46221, "text": "(5) In response to the request of the subject of personal information, the legitimate rights and interests of you or other individuals and organizations will be severely damaged;", "label": ["Important", "Edit/Control"], "rewrite": "We may not be able to respond to requests that exceed the storage range, exceed the reasonable limit, or the legitimate rights and interests of personal information subjects or other individuals and organizations will be seriously damaged."}
{"task": "rw_25.jsonl", "id": 46222, "text": "(6), involved business secrets;", "label": ["Important", "Edit/Control"], "rewrite": "We may not be able to respond."}
{"task": "rw_25.jsonl", "id": 46223, "text": "(7) There are other provisions of laws and administrative regulations.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46224, "text": "5.11. How to respond to your rights request", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46225, "text": "To ensure safety, you may need to provide a written request or prove your identity in other ways.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46226, "text": "We may ask you to verify your identity first, and then process your request.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46227, "text": "After verification, we will respond within 15 working days.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46228, "text": "If you are not satisfied, you can also contact us through [Customer Service Hotline: 4009217005].", "label": ["Important", "Contact Information"], "rewrite": "Customer service hotline: 4009217005."}
{"task": "rw_25.jsonl", "id": 46229, "text": "For your reasonable request, we do not charge fees in principle, but we will charge a certain cost fee depending on the request that repeats and beyond the reasonable limit.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46230, "text": "For those who have no repetition and need too much technical means (for example, need to develop new systems or fundamentally change the current practice), bring risks to others' legitimate rights and interests or very unrealistic (for example, information involved in backup tapes)We may refuse.", "label": ["Important"], "rewrite": "We may refuse to repeat for unseen, need too much technical means, bring risks or very unrealistic requests to others' legitimate rights and interests."}
{"task": "rw_25.jsonl", "id": 46231, "text": "6. How do we deal with the personal information of minors", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46232, "text": "Baidu attaches great importance to the protection of minors' information.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46233, "text": "Our products and services are mainly adults.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46234, "text": "We will only process minor personal information under the consent of laws and regulations, parents or other guardians.", "label": ["Specific Audiences", "Important"], "rewrite": "We will only process minor personal information under the consent of laws and regulations, parents or other guardians."}
{"task": "rw_25.jsonl", "id": 46235, "text": "If you are a minor under the age of 14, before using Baidu's library products and services, you should ask your parents or other guardians to read it carefully, or carefully read the privacy under the supervision and guidance of your parents or other guardians under the guidance and guidancePolicies and the \"Professional Information Protection Statement on Baidu Children\", and use our products and services under the consent of your parents or other guardians, or provide us with information.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a child under the age of 14, please read privacy policies with your guardian and use services or information under the consent and guidance of the guardian."}
{"task": "rw_25.jsonl", "id": 46236, "text": "If we find personal information of minors under the age of 14 without the consent of parents or other guardians who can be proven in advance, we will take measures to delete relevant information as soon as possible.", "label": ["Specific Audiences", "First Party Collection Information", "Important"], "rewrite": "If the personal information of minors was collected without the consent of the legal guardian, he would try to delete relevant information as soon as possible."}
{"task": "rw_25.jsonl", "id": 46237, "text": "If the guardian has reason to believe that we have collected the personal information of the minor without the consent of the guardian, please contact us through the [customer service hotline: 4009217005], and we will take measures to delete relevant data as soon as possible.", "label": ["Specific Audiences", "Important"], "rewrite": "If the guardian finds that we have collected personal information of minors without obtaining consent, please contact us to delete."}
{"task": "rw_25.jsonl", "id": 46238, "text": "7. Revision of privacy policy", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46239, "text": "Our privacy policy may change.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46240, "text": "Without your clear consent, we will not reduce the rights you should enjoy in accordance with this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46241, "text": "We will post any changes to this privacy policy on this page.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46242, "text": "For major changes, we will notify you in the main exposure page or in -site exposure pages or in -site letters or sending emails or other appropriate ways to reach you.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46243, "text": "If you do not agree with such changes, please stop using Baidu library products and services immediately.", "label": ["Important"], "rewrite": "If you do not agree with the change of privacy policy, please stop using Baidu Library products and services immediately."}
{"task": "rw_25.jsonl", "id": 46244, "text": "The major changes in this policy include, but not limited to:", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46245, "text": "(1) Our service model has changed significantly.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46246, "text": "Such as the purpose of handling personal information, the type of personal information, the use of personal information, etc.;", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46247, "text": "(2) We have undergone major changes in the aspects of ownership structure and organizational structure.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46248, "text": "Such as changes caused by business adjustments, bankruptcy mergers and acquisitions, etc.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46249, "text": "(3) The main objects provided, transferred or disclosed to the outside world change;", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46250, "text": "(4) The right to participate in personal information processing and its exercise methods have changed significantly;", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46251, "text": "(5) When we are responsible for handling the responsibility departments, contact methods and complaint channels of personal information security;", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46252, "text": "(6) Evaluation report on personal information security impact indicates that there is a high risk.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46253, "text": "If there is no such thing as a privacy policy, the \"Baidu Privacy Protection Statement\" shall prevail.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46254, "text": "8. How to contact us", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46255, "text": "The growth of Baidu Library is inseparable from the joint efforts of users of all parties. We are very grateful for your contribution to the update and feedback of Baidu Library data.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46256, "text": "You can use the mobile terminal [Mine]-[Settings]-[Help and feedback], web page [Homepage], [More]-[Feedback of Opinion] Feedback your suggestions for Baidu Library and what you encountered during useThe question is to help us optimize product functions and services, and make more users use our products and services more conveniently.", "label": ["Important", "Contact Information"], "rewrite": "You can feedback through the mobile terminal [Mine]-[Settings]-[Help and Feedback], web page [Homepage], [More]-[Feedback of Opinions]."}
{"task": "rw_25.jsonl", "id": 46257, "text": "You can contact us through personal information protection problem feedback platform (http://help.baidu.com/personalinFormation).", "label": ["Important", "Contact Information"], "rewrite": "You can contact us through personal information protection problem feedback platform (http://help.baidu.com/personalinFormation)."}
{"task": "rw_25.jsonl", "id": 46258, "text": "You can also contact us by contacting us as follows:", "label": ["Important", "Contact Information"], "rewrite": "You can also contact us by contacting us as follows:"}
{"task": "rw_25.jsonl", "id": 46259, "text": "No. 10, Shangdi Street, Haidian District, Beijing, China", "label": ["Important", "Contact Information"], "rewrite": "No. 10, Shangdi Street, Haidian District, Beijing, China"}
{"task": "rw_25.jsonl", "id": 46260, "text": "Beijing Baidu Net News Technology Co., Ltd., Ministry of Legal Affairs", "label": ["Important", "Contact Information"], "rewrite": "Beijing Baidu Net News Technology Co., Ltd. Legal Affairs Department"}
{"task": "rw_25.jsonl", "id": 46261, "text": "Postal code: 100085", "label": ["Important", "Contact Information"], "rewrite": "Postal code: 100085"}
{"task": "rw_25.jsonl", "id": 46262, "text": "In order to ensure our efficient handling of your problems and feedback to you in time, you need to submit identity certificates, effective contact information and written requests and related evidence. We will verify your identity to deal with your request.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46263, "text": "If you are not satisfied with our response, especially if you think our personal information processing behavior harms your legitimate rights and interests, you can also seek solutions through the following external channels: a lawsuit with the Beijing People's Court of Beijing.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46264, "text": "Attachment: term explanation", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46265, "text": "Personal information refers to the various information related to the recognized or recognizable natural person recorded in electronics or other methods, excluding information after anonymous processing.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46266, "text": "Personal information includes names, date of birth, ID number, personal biometric information, address, communication and communication contact information, communication records and content, account password, property information, credit information, travel information, accommodation information, health and physiological information, transactions, transactions, transactionsInformation, etc.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46267, "text": "Personal sensitive information refers to personal information that can easily cause the personality and dignity of natural persons to be infringed or harmed by personal and property security, including biometrics, religious beliefs, specific identities, medical health, financial accounts, trajectory trajectory and other information.And personal information under minor at the age of 14.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46268, "text": "Device refers to devices that can be used to use Baidu products and/or services, such as desktop devices, tablets or smartphones.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46269, "text": "Equipment information includes device attribute information you use to install and run the Baidu library equipment (such as hardware models, operating system versions, international mobile device identity code IMEI, network device hardware address MAC, anonymous device logo OAID, Android ID and so on.Equipment identifier), device connection information (telecommunications operator, WIFI information), and equipment status information (device application installation list, equipment sensor information).", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46270, "text": "Log information refers to the requests that our server automatically records your requests when visiting Baidu Library, such as your IP address, the type of browser and the language of the use of hardware equipment, the version of the operating system, the information of the network operator, the information of the network operatorThe date, time, and length of your access to the service are provided, formed or reserved when you use our products or services.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46271, "text": "Cookie refers to a mechanism that supports the server (or script) to store and retrieve information on the client. By adding a simple and persistent client state to expand the web -based client/server application.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46272, "text": "The server sends a status information while returning the HTTP object to the client, and is stored by the client.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46273, "text": "The state information shows the effective URL range in this state.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46274, "text": "Since then, the HTTP request within this range initiated by the client will return the current value of the status information from the client to the server. This state information is called Cookie.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46275, "text": "User portraits refer to analysis or predictions of personal characteristics of a certain natural person through collecting, gathering, and analyzing personal information, such as their occupations, economy, health, education, personal preferences, credit, behavior, etc., to form their personal characteristic modelEssence", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46276, "text": "Use personal information of specific natural persons to form a characteristic model of the natural person, called direct user portraits.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46277, "text": "The use of personal information from specific natural persons, such as the data of its group, forms a characteristic model of the natural person, called indirect user portraits.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46278, "text": "Decoration refers to the process of processing personal information, so that it cannot recognize a specific natural person without using additional information.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46279, "text": "Anonymous refers to the process that the personal information subject cannot be recognized by the technical processing of personal information, and the processing information cannot be restored.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46280, "text": "The information obtained by personal information after anonymous processing does not belong to personal information.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46281, "text": "Baidu platform refers to the special channels or platform services of Baidu Company (including Baidu search, Baidu APP and derivative version, Baidu Encyclopedia, Baidu Tieba, Baidu mobile assistant and other Baidu products https://www.baidu.com/more/) and other websites, programs, services, tools and clients.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46282, "text": "A related company refers to the single name or collective name of the operator of Baidu Library Beijing Baidu Net News Technology Co., Ltd. and other companies that have related relationships with Baidu.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46283, "text": "\"Related relationship\" refers to the subject (including individuals, companies, partnerships, organizations, or other entities), that is, the subject that directly or indirectly controls, or the subject that controls it directly or indirectlyMaster controlled by the same subject.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46284, "text": "The aforementioned \"control\" means that through holding voting rights, contracts or other methods, directly or indirectly have the power or other relationships that instructions or instructions that to instructions to make instructions by others.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46285, "text": "Thank you again for your trust and use of Baidu Library!", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46286, "text": "Beijing Baidu Net News Technology Co., Ltd.", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46287, "text": "Update date: February 28, 2022", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46288, "text": "Effective date: February 28, 2022", "label": [], "rewrite": []}
{"task": "rw_25.jsonl", "id": 46289, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
