{"task": "rw_27.jsonl", "id": 46764, "text": "Traffic Management 12123 Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46765, "text": "Release date: June 30, 2021", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46766, "text": "Effective date: June 30, 2021", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46767, "text": "\"Traffic Management 12123\" is the official client of the Internet Transportation Safety Comprehensive Service Management Platform provided by the Institute of Traffic Management Sciences (hereinafter referred to as \"us\").", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46768, "text": "We attach great importance to your personal information and privacy protection, and will protect your personal information and privacy security in accordance with the requirements of laws and regulations.", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46769, "text": "Through this \"Privacy Policy\", we will explain to you how we collect and use your relevant personal information, and to provide you with relevant measures that provide you with access, correction, delete and protect these information in order to better protect your rights and interests.", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46770, "text": "This policy will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46771, "text": "How do we collect and use personal information", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46772, "text": "How do we use cookie equal similar technologies", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46773, "text": "Fingerprint/Face Data Related", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46774, "text": "How do we share, transfer, and publicly disclose personal information", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46775, "text": "How do we store and protect personal information", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46776, "text": "How do we manage personal information", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46777, "text": "Third -party service", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46778, "text": "age limit", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46779, "text": "Notice and revision", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46780, "text": "contact us", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46781, "text": "[Special Tips] Please read and fully understand this \"Privacy Policy\" before using the services we provided, especially the terms of the thick body logo and make appropriate choices.", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46782, "text": "When you use or continue to use our services, you agree that you agree that we will process your relevant information in accordance with this privacy policy.", "label": ["Policy Change", "Important"], "rewrite": "When you use or continue to use our services, you agree that you agree with this privacy policy."}
{"task": "rw_27.jsonl", "id": 46783, "text": "1. How do we collect and use personal information", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46784, "text": "You may need to provide your personal information in the process of using the traffic management 12123 business.", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46785, "text": "This is not required to provide us with personal information, but in some cases, we need to collect some of your information to help you become our users, provide you with good services, optimize your user experience, and provide security guarantee.", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46786, "text": "(1) We collect and obtain your information through the following channels:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46787, "text": "1.When you are registered with the 12123 user account, we will collect your certificate type, identity certificate, name, mobile phone number, registered provincial and cities, and log in to the password.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you are registered with the 12123 user account, you collect your certificate type, identity certificate, name, mobile phone number, registered province and city, login password."}
{"task": "rw_27.jsonl", "id": 46788, "text": "Collecting this information is to help you create an account. If you refuse to provide this information, it will affect your registration.", "label": ["Important", "Usage"], "rewrite": "Collect your information to register your account."}
{"task": "rw_27.jsonl", "id": 46789, "text": "During the registration process, we will provide real -person certification to you and obtain your avatar photo information to confirm that the registration information is associated with you.", "label": ["Important", "First Party Collection Information"], "rewrite": "During the registration process, obtain your avatar photo information for practical authentication."}
{"task": "rw_27.jsonl", "id": 46790, "text": "2.During the process of handling the motor vehicle business, the relevant individual and vehicle information needed by the collection business.", "label": ["Important", "First Party Collection Information"], "rewrite": "During the process of handling the motor vehicle business, the relevant information such as vehicle information, car purchase invoices, vehicle insurance, and mailing address required by collecting business are collected."}
{"task": "rw_27.jsonl", "id": 46791, "text": "Such as applying for motor vehicle filing, pre -selected motor vehicle number plates, inspection and reservation, replacement of receivables, replacement of the launch license, motor vehicle suspension application, application for inspection exemption signs, and mobile vehicle transfer applicationInformation, car purchase invoice, vehicle insurance, mailing address and other related information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46792, "text": "3.During the driver's license business, the relevant personal information required by the business office is collected.", "label": ["Important", "First Party Collection Information"], "rewrite": "During the driving license business process, the personal photos, contact information, and mailing address of the collection business need to collect the business office."}
{"task": "rw_27.jsonl", "id": 46793, "text": "Such as applying for examination appointments, examination fees, payment of driving -increasing driving, replacement of driving licenses, extension of the driver's license, submitting driving license photo, driving license application application, driving license examination business and other services, you need to provide you with an individualPhotos, contact information, mailing address and other related information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46794, "text": "4.In the process of road traffic accidents, you need to collect relevant business information such as the identity information of you and the other party's driving license, motor vehicle information, and the photos of the accident.", "label": ["Important", "First Party Collection Information"], "rewrite": "In the process of road traffic accidents, you need to collect relevant business information such as the identity information of you and the other party's driving license, motor vehicle information, and the photos of the accident."}
{"task": "rw_27.jsonl", "id": 46795, "text": "5.In the process of handling full score examination, you need to collect your studies photos to confirm that you participate in online learning.", "label": ["Important", "First Party Collection Information"], "rewrite": "In the process of handling full score examination, you need to collect your studies."}
{"task": "rw_27.jsonl", "id": 46796, "text": "6.According to business needs, other businesses need to collect your relevant personal information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46797, "text": "(2) Information collected by third parties", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46798, "text": "1.Equipment and application information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46799, "text": "Equipment resolution, package name, equipment settings, process and software list, unique device identifier, software and hardware feature information), and the location related information of the device.", "label": ["Permission Acquisition", "Important"], "rewrite": "According to the specific permissions granted in the software installation and use, receive and record the relevant information and the relevant information of the equipment you use."}
{"task": "rw_27.jsonl", "id": 46800, "text": "2.Log information.", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46801, "text": "When you handle our business, we may automatically collect the detailed usage in your operation and save it as a network log.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you handle our business, collect the detailed usage in your operation and save it as a network log."}
{"task": "rw_27.jsonl", "id": 46802, "text": "3.location information.", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46803, "text": "When you handle accidents, one -click on the service, the map service provider will collect your current location information to determine the specific location of the business.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you handle accidents, one -click on the service, the map service provider will collect your current location information."}
{"task": "rw_27.jsonl", "id": 46804, "text": "4.Message push service.", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46805, "text": "If you use some mobile phone manufacturers (such as Xiaomi, Huawei, VIVO, OPPO and other brands), mobile phone use traffic management 12123, the above -mentioned mobile phone manufacturer Push, SDK we needParameters such as mobile phone models, system types, system versions, device screen size, system installation application information are used to achieve push for our product information. For specific situations, please see the privacy policy or related statement of the SDK operator.", "label": ["Important", "First Party Collection Information"], "rewrite": "Mobile phone manufacturers Push SDK needs to collect parameters such as mobile phone models, system types, system versions, device screen size, system installation application information, and other parameters to achieve information push."}
{"task": "rw_27.jsonl", "id": 46806, "text": "5.Real certification service.", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46807, "text": "When registering and updating the validity period of ID cards, not my own motor vehicle, user information appeal, full -scale examination education, and processing that requires face -to -face signing, we will collect your solid avatar photos, together with personal names, identity certification numbers, ID card validity period validity periodFor information, submit a credit identity certification platform for the Ministry of Public Security to determine your authenticity.", "label": ["Important", "First Party Collection Information"], "rewrite": "When registering and renewing the validity period of ID cards, not your own motor vehicle, user information appeal, full -scale examination education, and processing required for face -to -face signing, collect your real person's avatar photos, along with personal names, identity certification numbers, ID card validity period and other information, To verify the identity."}
{"task": "rw_27.jsonl", "id": 46808, "text": "6.Third party payment.", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46809, "text": "When you apply for examination fees, license certificates, and transportation fines for traffic violations, the third -party online payment platforms built on their own need to provide the required payment information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When applying for examination fees, license certificates, and transportation of traffic violations, the third -party online payment platform needs to collect payment information."}
{"task": "rw_27.jsonl", "id": 46810, "text": "7.Safety control.", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46811, "text": "Time to update time, Ro.Boot.Bootloader, IMEI, mobile phone MAC address, Androidid, number of power supply, whether SIM card, instruction architecture, screen width, network connection type, USB debugging mode, gravity sensing detection, power acquisition, charging status, charging statusThe application information installed by the system is uploaded to the server to ensure your account security.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the APP service, you need to collect your mobile phone device information encryption and upload to the server to ensure your account security."}
{"task": "rw_27.jsonl", "id": 46812, "text": "It should be specifically stated that when third -party service providers access API and SDK through the traffic management 12123, they may collect, use and store your relevant data or information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When a third -party service provider provides you, it may collect, use and store your relevant data or information."}
{"task": "rw_27.jsonl", "id": 46813, "text": "We strictly fulfill the responsibility and obligations stipulated in the \"Cyber Security Law\" and \"Personal Information Security Standards\", be responsible for the personal information security obtained, take effective measures to strengthen the protection of personal information, and strictly follow the encryption and transmission of trustworthy controls.", "label": ["Important", "Data Security"], "rewrite": "Take effective measures to strengthen the protection of personal information, and strictly follow the encryption methods of credible controls."}
{"task": "rw_27.jsonl", "id": 46814, "text": "Follow the principles of legal, legitimate, and necessary, and do not collect personal information that has nothing to do with the service provided;", "label": ["Important", "Data Security"], "rewrite": "Follow the principles of legal, correctness, and necessary, and do not collect personal information that has nothing to do with the service provided."}
{"task": "rw_27.jsonl", "id": 46815, "text": "When collecting personal information, it is easy to understand and simply display the rules of collection and use of personal information, and the subject of personal information is self -selected.", "label": ["Important", "First Party Collection Information"], "rewrite": "It is easy to understand and simply display the rules of personal information collection and use, and the individual information subject has independently selected consent."}
{"task": "rw_27.jsonl", "id": 46816, "text": "Before deciding whether to use such services, please fully understand his personal information and privacy protection strategies from third -party service providers, or contact your business users to learn more information.", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46817, "text": "(3) Security security service", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46818, "text": "In order to improve the security of your service with our and partners, protect your personal and property security for exemption, better prevent security risks such as fishing websites, fraud, network vulnerabilities, computer viruses, cyber attacks, and network invasion.Land identification that violates laws and regulations or the relevant agreement rules of the traffic management 12123, we may collect, use, or integrate your account information, equipment information, log information, and our related units and partners to obtain information that you authorize or shared in accordance with laws, come to come, come to come.Comprehensively judge your account risk, verify, test and prevent security incidents, and take necessary analysis and disposal measures in accordance with the law.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect, use, or integrate your account information, equipment information, log information, and information shared by your authorization or sharing according to law for risk prevention, and take necessary analysis and disposal measures."}
{"task": "rw_27.jsonl", "id": 46819, "text": "(4) Exception of authorization consent", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46820, "text": "According to relevant laws and regulations and national standards, collecting and using your personal information in the following situations do not need to obtain your authorization consent:", "label": ["Important", "First Party Collection Information"], "rewrite": "According to relevant laws and regulations and national standards, collecting and using your personal information in the following situations do not need to obtain your authorization consent:"}
{"task": "rw_27.jsonl", "id": 46821, "text": "1.Related to national security and national defense security;", "label": ["Important", "First Party Collection Information"], "rewrite": "The collection and use information directly related to national security and national defense security does not need to solicit authorization consent."}
{"task": "rw_27.jsonl", "id": 46822, "text": "2.Related to public safety, public health, and major public interests;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collection and use information related to public safety, public health, and major public interests does not need to solicit authorization consent."}
{"task": "rw_27.jsonl", "id": 46823, "text": "3.Related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collection and use information related to criminal investigation, prosecution, trial and judgment implementation does not need to solicit authorization consent."}
{"task": "rw_27.jsonl", "id": 46824, "text": "4.For major legitimate rights and interests of the life, property of the main body or other individuals, it is difficult to get your consent;", "label": ["Important", "First Party Collection Information"], "rewrite": "Out of major legitimate rights and interests such as the main body of the information of the information or other individuals, but it is difficult to get the collection and use information you agree with, no need to solicit authorization consent."}
{"task": "rw_27.jsonl", "id": 46825, "text": "5.The collected information is made by your own public to the public;", "label": ["Important", "First Party Collection Information"], "rewrite": "The collected information is publicly disclosed to the public by itself without asking for authorization consent."}
{"task": "rw_27.jsonl", "id": 46826, "text": "6.Collect information from the legal public disclosure information, such as legal news reports, government information disclosure and other channels;", "label": ["Important", "First Party Collection Information"], "rewrite": "If the information is collected from the legal publicly disclosed information, no authorization consent is required."}
{"task": "rw_27.jsonl", "id": 46827, "text": "7.Signing the contract according to your requirements;", "label": ["Important", "First Party Collection Information"], "rewrite": "The collection and usage information necessary for signing the contract according to your request does not need to solicit authorization consent."}
{"task": "rw_27.jsonl", "id": 46828, "text": "8.It is necessary to maintain the safe and stable operation of the traffic management 12123, such as the failure of discovering and disposing of products or services;", "label": ["Important", "First Party Collection Information"], "rewrite": "The collection and use information necessary for the safe and stable operation of the traffic management 12123 does not need to solicit authorization consent."}
{"task": "rw_27.jsonl", "id": 46829, "text": "9.It is necessary for legal news reports;", "label": ["Important", "First Party Collection Information"], "rewrite": "The necessary collection and use information for legal news reports does not need to solicit authorization consent."}
{"task": "rw_27.jsonl", "id": 46830, "text": "10.When academic research institutions are necessary to carry out statistics or academic research based on public interests, and to provide academic research or description results, the information contained in the results is identified by", "label": ["Important", "First Party Collection Information"], "rewrite": "When academic research institutions are necessary to carry out statistics or academic research in public interests, and provide academic research or description results, the information contained in the results is identified to identify the information, and no authorization consent is required."}
{"task": "rw_27.jsonl", "id": 46831, "text": "11.Other circumstances stipulated in laws and regulations.", "label": ["Important", "First Party Collection Information"], "rewrite": "Other collection and use information stipulated in laws and regulations does not need to solicit authorization."}
{"task": "rw_27.jsonl", "id": 46832, "text": "2. How do we use cookie equivalent technologies", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46833, "text": "In order to make you a convenient and smooth access experience, when you use the traffic management 12123 and related services, we may be used to identify your identity through the Cookie small data files in your terminal device.Steps of information, or help judge your account security status.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the traffic management 12123 and related services, you may use the cookie small data file to identify your identity."}
{"task": "rw_27.jsonl", "id": 46834, "text": "We will not use the information collected above for any purpose outside of the purpose of this privacy policy.", "label": ["Important", "Usage"], "rewrite": "The information collected by Cookie is not used in any purpose outside the purpose of this privacy policy."}
{"task": "rw_27.jsonl", "id": 46835, "text": "Please understand that some of our services can only be implemented by using \"cookie\".", "label": ["Important", "First Party Collection Information"], "rewrite": "Some of our services can only be implemented by using \"cookie\"."}
{"task": "rw_27.jsonl", "id": 46836, "text": "Cookie allows us to provide you better and faster.", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46837, "text": "Of course, you can clear the cookies file file or your browser or browser additional service permit on the mobile phone 12123 mobile phone, and you can set the degree of cookies in the browser, but this move may affect your safe access in some cases.Communications 12123 related websites and services provided by related platforms.", "label": ["Important", "Edit/Control"], "rewrite": "You can remove the cookie data file on the traffic tube 12123 mobile phone, or set the degree of cookies in the browser."}
{"task": "rw_27.jsonl", "id": 46838, "text": "3. Fingerprint/face data related", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46839, "text": "(1) In order to conveniently your login operation, we provide fingerprint/face ID fast login function.", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46840, "text": "1.After the login is successful, you can choose whether to use the fingerprint/face ID of the mobile phone to use the quick login.", "label": ["Important", "Edit/Control"], "rewrite": "You can choose whether to use your mobile phone's fingerprint/face ID to enable quickly."}
{"task": "rw_27.jsonl", "id": 46841, "text": "2.The fingerprint/facial ID information used by quickly logging in is stored in your mobile phone operating system.", "label": ["Data Retention", "Important"], "rewrite": "The fingerprint/facial ID information used by quickly logging in is stored in the mobile phone operating system."}
{"task": "rw_27.jsonl", "id": 46842, "text": "We can only verify through the system, and we do not obtain information about fingerprint/face ID, and at the same time we will not upload any fingerprint/face ID information to the server.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will not obtain information about fingerprint/face ID, and at the same time we will not upload any fingerprint/face ID information to the service end."}
{"task": "rw_27.jsonl", "id": 46843, "text": "(2) To effectively identify your true identity and ensure your personal traffic management information security, we will apply for user registration, find passwords, or replace equipment to replace the motor vehicle number plate, driving license, driving license and online learning, etc.In the business, collect your on -site face information for identity authentication.", "label": ["Important", "First Party Collection Information"], "rewrite": "In your business registration, retrieve password, or replace the device to replace the motor vehicle number plate, driving license, driver's license and online learning, collect your on -site face information for identity authentication."}
{"task": "rw_27.jsonl", "id": 46844, "text": "1.Before collecting face information, we will prompt in advance and get your consent confirmation.", "label": ["Important", "First Party Collection Information"], "rewrite": "Before collecting face information, we will prompt in advance and get your consent confirmation."}
{"task": "rw_27.jsonl", "id": 46845, "text": "2.When authentication, we will verify the comparison of the collected resident ID numbers, names, and facial information with the information you reserved.", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46846, "text": "3.We will protect your information in accordance with industry traffic standards and efforts to adopt reasonable physical, electronics and management security measures, and do our best to make your and your final user's information from being leaked, damaged or lost.", "label": ["Important", "Data Security"], "rewrite": "Take security measures to protect your information to avoid your information leakage, damage or loss."}
{"task": "rw_27.jsonl", "id": 46847, "text": "4.We will not share your face information data from any third party.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not share your face information data from any third party."}
{"task": "rw_27.jsonl", "id": 46848, "text": "4. How do we share, transfer, and publicly disclose personal information", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46849, "text": "(1) Sharing", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46850, "text": "1.We follow the provisions of laws and regulations and strictly restrict the sharing of information. Except for the following situations, without your consent, we will not share your personal information with any third party:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Except for the following situations, without your consent, we will not share your personal information with any third party:"}
{"task": "rw_27.jsonl", "id": 46851, "text": "(1), get your clear consent or authorization in advance;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Get your clear consent or authorization in advance may share your personal information with a third party."}
{"task": "rw_27.jsonl", "id": 46852, "text": "(2) Provided according to the requirements of applicable laws and regulations, legal procedures, mandatory administrative or judicial requirements.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Provide your personal information according to the requirements of applicable laws and regulations, legal procedures, mandatory administrative or judicial requirements."}
{"task": "rw_27.jsonl", "id": 46853, "text": "2.In order to be able to provide our services better, we may share your information with partners and other third parties to achieve the core functions you need or provide services you need, such as message push, map navigation, real -person certification, accidents, accidents, accidents, accidents, accidentsQuick claims, etc.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "May share your information from a third party to achieve the core function you need or provide the services you need."}
{"task": "rw_27.jsonl", "id": 46854, "text": "But we will only share the necessary personal information and be restricted by the purpose declared in this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46855, "text": "3.Realize safety and statistical analysis.", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46856, "text": "Analyze the usage of our services and enhance the experience of user use. It may be statistically data with related parties or third -party shared products (collapse, flashback).", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Use your information to analyze the use of our service and improve the experience of user use."}
{"task": "rw_27.jsonl", "id": 46857, "text": "4.We share your personal information from your partners and third -party sharing:", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46858, "text": "Remarks: Equipment information includes IMEI, Mac, Serial, SIM cards, device models, operating systems, unique device identifiers, device resolution, etc.", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46859, "text": "We will only share your information for legal, correct, necessary, specific, and clear purposes.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only share your information for legal, correct, necessary, specific, and clear purposes."}
{"task": "rw_27.jsonl", "id": 46860, "text": "For companies, organizations, and individuals that share information with us, we will sign a strict confidentiality agreement with them, asking them to handle information in accordance with our instructions, \"Privacy Policy\" and any other related confidentiality and security measures.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will sign a confidentiality agreement with the shared information party to ask them to process information in accordance with the agreed confidentiality and security measures."}
{"task": "rw_27.jsonl", "id": 46861, "text": "(2) Transfer", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46862, "text": "We will not transfer your personal information to any company, organization and individual, except the following situations: except:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not transfer your personal information to any company, organization and individual, except the following situations: except:"}
{"task": "rw_27.jsonl", "id": 46863, "text": "1.Get your clear consent in advance;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Get your clear consent in advance, you may transfer your personal information."}
{"task": "rw_27.jsonl", "id": 46864, "text": "2.According to laws and regulations or mandatory administrative or judicial requirements.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "According to laws and regulations or mandatory administrative or judicial requirements, your personal information may be transferred."}
{"task": "rw_27.jsonl", "id": 46865, "text": "(3) Public disclosure", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46866, "text": "We will not publicly disclose the personal information collected to the outside world, and will only disclose your information only in the following situations:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not publicly disclose the personal information collected to the outside world, and will only disclose your information only in the following situations:"}
{"task": "rw_27.jsonl", "id": 46867, "text": "1.Get your clear consent or authorization in advance;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Get your clear consent or authorization in advance, you may disclose your personal information."}
{"task": "rw_27.jsonl", "id": 46868, "text": "2.In accordance with the requirements of laws and regulations, mandatory administrative law enforcement or judicial requirements that must provide your personal information, we may disclose your personal information according to the types and disclosure methods required.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In accordance with the requirements of laws and regulations, mandatory administrative law enforcement or judicial requirements that must provide your personal information, we may disclose your personal information publicly."}
{"task": "rw_27.jsonl", "id": 46869, "text": "(4) According to relevant laws and regulations and national standards, the following situations will share, transfer, and publicly disclose your personal information in accordance with the law without obtaining your consent:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "According to relevant laws and regulations and national standards, the following circumstances we will share, transfer, and publicly disclose your personal information in accordance with the law without obtaining your consent:"}
{"task": "rw_27.jsonl", "id": 46870, "text": "1.Directly related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The sharing or disclosure directly related to national security and national defense security does not require authorization."}
{"task": "rw_27.jsonl", "id": 46871, "text": "2.Directly related to public safety, public health, and major public interests;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Sharing or disclosure directly related to public safety, public health and major public interests does not need to be authorized."}
{"task": "rw_27.jsonl", "id": 46872, "text": "3.Directly related to criminal investigation, prosecution, trial, and execution of judgment;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Sharing or disclosure related to criminal investigation, prosecution, trial, and judgment execution does not need to be authorized."}
{"task": "rw_27.jsonl", "id": 46873, "text": "4.It is difficult to obtain your consent for maintaining major legitimate rights and interests such as life and property of you or other individuals;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Out of the major legitimate rights and interests of the life and property of the subject of personal information or other individuals, it is difficult to get shared or disclosed by my consent, and there is no need to solicit."}
{"task": "rw_27.jsonl", "id": 46874, "text": "5.Personal information that you disclose to the public by yourself;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The collected personal information is the sharing or disclosure of the subject of the personal information to the public by themselves without authorization."}
{"task": "rw_27.jsonl", "id": 46875, "text": "6.Personal information collected from legal publicly disclosed information, such as legal news reports, government information disclosure and other channels.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you collect personal information from the legal disclosure information, no authorization is required."}
{"task": "rw_27.jsonl", "id": 46876, "text": "5. How do we store and protect personal information", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46877, "text": "(1) Storage location", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46878, "text": "In accordance with the provisions of laws and regulations, we will store your personal information collected and generated during the domestic operation process in the territory of the People's Republic of China.", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in domestic operations will be stored in China."}
{"task": "rw_27.jsonl", "id": 46879, "text": "(2) Storage period", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46880, "text": "Generally speaking, we only retain your information during the purpose of the purpose of the Privacy Policy and the time limit required by laws and regulations.", "label": ["Data Retention", "Important"], "rewrite": "Generally, your personal information is retained within the time limit required to achieve service purposes, unless the law has other requirements."}
{"task": "rw_27.jsonl", "id": 46881, "text": "When our products or services are stopped, we will notify you in the form of push notifications, announcements, etc., and delete or deal with your personal information within a reasonable period.", "label": ["Important", "Cessation of Operations"], "rewrite": "When stopping operation, we will make an announcement notice and delete or processes your personal information."}
{"task": "rw_27.jsonl", "id": 46882, "text": "(3) Information protection", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46883, "text": "1.In order to ensure your information security, we will adopt security protection measures that meet the industry standards, including establishing reasonable institutional specifications and security technologies to prevent your information from being accessed and modified by unauthorizeduse.", "label": ["Important", "Data Security"], "rewrite": "Use security measures that meet industry standards to ensure your information security."}
{"task": "rw_27.jsonl", "id": 46884, "text": "2.Network services have adopted a variety of encryption technologies, such as: encrypted transmission, information encryption storage, and strict restrictions on data centers through network security layer software (SSL).", "label": ["Important", "Data Security"], "rewrite": "Network services have adopted a variety of encryption technologies."}
{"task": "rw_27.jsonl", "id": 46885, "text": "3.We only allow authorized personnel to access your information and set up strict access control and monitoring mechanisms for this.", "label": ["Important", "Data Security"], "rewrite": "Only authorized personnel can access your information and set up strict access to control and monitoring mechanisms for this."}
{"task": "rw_27.jsonl", "id": 46886, "text": "At the same time, all personnel who may be exposed to your information fulfill the corresponding confidentiality obligations.", "label": ["Important", "Data Security"], "rewrite": "All personnel who may be exposed to your information fulfill the corresponding confidentiality obligations."}
{"task": "rw_27.jsonl", "id": 46887, "text": "4.The Internet environment is not 100 % security. Please keep your login account and other identity elements.", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46888, "text": "We will adopt various security measures within a reasonable level to ensure the security of any information sent to us.", "label": ["Important", "Data Security"], "rewrite": "Take various security measures to ensure the security of any information sent to us."}
{"task": "rw_27.jsonl", "id": 46889, "text": "5.If the personal information security incident occurs unfortunately, we will inform you in accordance with the requirements of the laws and regulations, inform you in a timely manner, push notification, announcement and other forms: the basic situation and possible impact of security events, we have already taken the disposal measures that we are going to take,You can independently prevent and reduce risk suggestions, and remedy your remedy.", "label": ["Important", "Data Security"], "rewrite": "If a personal information security incident occurs, we will inform your basic situation, possible impact, disposal measures, independent prevention suggestions, etc."}
{"task": "rw_27.jsonl", "id": 46890, "text": "We will also report to the disposal of personal information security incidents in accordance with the requirements of laws and regulations and regulators.", "label": ["Important", "Data Security"], "rewrite": "Report the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities."}
{"task": "rw_27.jsonl", "id": 46891, "text": "6. Visit and manage personal information", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46892, "text": "During your use of traffic management 12123, in order to easily inquire and manage your information, while ensuring your right to cancel your account, we provide the corresponding operation on the client. For details, you can refer to the following guidelines:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46893, "text": "(1) Manage your information", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46894, "text": "Log in to traffic management 12123 mobile client, you can enter the personal information interface by clicking on the \"My\" in the upper right corner of the homepage. You can view personal avatars, registration time, real -person authentication status, ID information, mobile phone number, email address, mailing address, mailing address, mailing address, mailing address, mailing address, mailing address, mailing address, mailing address, mailing address, mailing address, mailing address, mailing address, mailing address, mailing address, mailing address, mailing address, mailing address, mailing address, mailing address, mailing address, mailing address, mailing address, mailing address, mailing address, mailing address, mailing address, mailing address, mailing address, mailing address, mailing address, mailing address, mailing address, mailing address, mailing address, mailing address, mailing address, mailing address, mailing address, mailing address, mailing address, mailing address, mailing address, mailing address, mailing address, mailing address, mailing address, and mailing address,Postal code and other information, click the corresponding option to modify.", "label": ["Important", "Edit/Control"], "rewrite": "By clicking on the \"My\" in the upper right corner of the 12123 mobile client, entering the personal information interface, you can view information such as personal avatars, registration time, real -person authentication status, ID card information, mobile phone number, email address, mailing address, postal code and other information, etc.Click the corresponding option to modify it."}
{"task": "rw_27.jsonl", "id": 46895, "text": "For your personal information security, personal ID number and mobile phone number will be displayed.", "label": ["Important", "Data Security"], "rewrite": "The personal ID number and mobile phone number will be desensitized."}
{"task": "rw_27.jsonl", "id": 46896, "text": "You can also use the Internet traffic safety comprehensive service management platform (hereinafter referred to as \"Internet platform\") https://gab.122.gov.cn and select the registration of the local Internet platform. The account password is the same as the login traffic management 12123 client.", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46897, "text": "After entering the homepage, you can click on the left directory to view and handle related business. Enter \"user information management\" to view and modify user personal information.", "label": ["Important", "Edit/Control"], "rewrite": "After entering the homepage, you can click on the left directory to view and handle related business. Enter \"user information management\" to view and modify user personal information."}
{"task": "rw_27.jsonl", "id": 46898, "text": "(2) User account management", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46899, "text": "Log in to traffic management 12123 mobile client, enter \"mine\", click \"set\" in the upper right corner, you can perform login password modification, gesture password modification, delete account number, stop account number, account migration.", "label": ["Important", "Edit/Control"], "rewrite": "Log in to traffic management 12123 mobile client, enter \"mine\", click \"set\" in the upper right corner, you can perform login password modification, gesture password modification, delete account number, stop account number, account migration."}
{"task": "rw_27.jsonl", "id": 46900, "text": "You can also access the Internet platform https://gab.122.gov.cn and select the registration of the local Internet platform. The account password is the same as the login traffic management 12123 client, enter the user information management interface, and perform the corresponding operation.", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46901, "text": "(3) When you access, modify and delete relevant information, for consideration of security and identification or in accordance with laws and regulations and regulatory regulations, we may ask you to verify your identity through mobile phone text messages or face scanning to ensure the account numberSafety.", "label": ["Important", "Edit/Control"], "rewrite": "When you visit, modify and delete related information, you are required to verify your identity through mobile phone text messages or face scanning to ensure account security."}
{"task": "rw_27.jsonl", "id": 46902, "text": "If you find that we collect and use your personal information, violate the provisions of laws and regulations or the agreement between the two parties, you can feedback from the opinions of the mobile client or dial the consultation phone directly, asking to delete the corresponding information.", "label": ["Important", "Edit/Control"], "rewrite": "If you find that we collect or use your personal information, illegal laws and regulations or agreements, you can feedback or call the consultation phone request to delete."}
{"task": "rw_27.jsonl", "id": 46903, "text": "(4) In accordance with relevant laws and regulations and national standards, in the following circumstances, we may not be able to respond to your request:", "label": ["Important", "Edit/Control"], "rewrite": "According to relevant laws and regulations and national standards, in the following situations, we may not be able to respond to your request:"}
{"task": "rw_27.jsonl", "id": 46904, "text": "1.Directly related to national security and national defense security;", "label": ["Edit/Control", "Important"], "rewrite": "If your request is directly related to national security and national defense security, you may not be responded."}
{"task": "rw_27.jsonl", "id": 46905, "text": "2.Directly related to public safety, public health, and major public interests;", "label": ["Important", "Edit/Control"], "rewrite": "Your request is directly related to public safety, public health, and major public interests and may not be responded."}
{"task": "rw_27.jsonl", "id": 46906, "text": "3.Directly related to criminal investigation, prosecution, trial, and execution judgment;", "label": ["Important", "Edit/Control"], "rewrite": "Your request is related to criminal investigation, prosecution, and trial, and may not be responded."}
{"task": "rw_27.jsonl", "id": 46907, "text": "4.There is sufficient evidence that you have subjective malicious or abuse of rights;", "label": ["Edit/Control", "Important"], "rewrite": "Personal information controller has sufficient evidence to indicate that the subject of personal information has subjective malice or abuse of rights, and may not respond to the request."}
{"task": "rw_27.jsonl", "id": 46908, "text": "5.Response your request will cause serious damage to the legitimate rights and interests of other individuals and organizations;", "label": ["Important", "Edit/Control"], "rewrite": "We may not be able to respond to the request that the legitimate rights and interests of personal information subjects or other individuals and organizations are seriously damaged."}
{"task": "rw_27.jsonl", "id": 46909, "text": "6.Involved in business secrets.", "label": ["Important", "Edit/Control"], "rewrite": "We may not be able to respond."}
{"task": "rw_27.jsonl", "id": 46910, "text": "7. Third -party service", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46911, "text": "The third -party social media or other services we access, including Sina Weibo, WeChat QQ and other sharing functions, Baidu Maps and Message Push Service, as well as news push services such as Huawei, Xiaomi, OPPO, vivoOperation.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The third -party social media or other services we access are operated by related third parties."}
{"task": "rw_27.jsonl", "id": 46912, "text": "During use, third -party service providers may collect, use and store your relevant data or information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Third -party service providers may collect, use and store your relevant data or information."}
{"task": "rw_27.jsonl", "id": 46913, "text": "Before you decide to use this type of service, you must be constrained by the third party's own service terms and information protection statements (not this \"Privacy Policy\"). Please read the terms carefully.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46914, "text": "This \"Privacy Policy\" is only applicable to any information we collected, and does not apply to any third -party service or third -party information use rules, and we do not responsibility for any third party's use of information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "We do not have any responsibility for any third party's information."}
{"task": "rw_27.jsonl", "id": 46915, "text": "8. Age restriction", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46916, "text": "We are a platform to provide comprehensive public security traffic safety services. Our services are mainly facing adults 18 years old and above.", "label": ["Specific Audiences", "Important"], "rewrite": "Services are mainly facing adults 18 years old and over."}
{"task": "rw_27.jsonl", "id": 46917, "text": "If you are a minor, you should read and decide whether to agree with your parents or other guardians under the guidance of your parents or other guardians.", "label": ["Specific Audiences", "Important"], "rewrite": "Minors should read and decide whether to agree with the privacy policy under the guidance of the guardian."}
{"task": "rw_27.jsonl", "id": 46918, "text": "We will protect personal information of minors in accordance with the requirements of relevant national laws and regulations.", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46919, "text": "9. Notification and revision", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46920, "text": "In order to provide better services, we will modify the terms of the Privacy Policy in a timely manner, which modify these part of the privacy policy.", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46921, "text": "Without your clear consent, we will not reduce the rights you should enjoy based on the current privacy policy that take effect.", "label": ["Policy Change", "Important"], "rewrite": "We will not reduce the rights you should enjoy based on the current privacy policy that takes effect."}
{"task": "rw_27.jsonl", "id": 46922, "text": "For major changes, we will inform you the updated content and services through the announcement of the 12123 announcement, push notification or other appropriate ways.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46923, "text": "When registering as our user, you can check the latest version of \"Privacy Policy\", or you can view it in the traffic management 12123 client \"My  Settings  About\", so that you can understand the latest personal information protection policy in time.", "label": ["Important"], "rewrite": "When you register as our user, you can also view the latest version of \"Privacy Policy\" in the 12123 client \"My  Settings  About\"."}
{"task": "rw_27.jsonl", "id": 46924, "text": "10. Contact us", "label": [], "rewrite": []}
{"task": "rw_27.jsonl", "id": 46925, "text": "(1) If you have any questions, opinions or suggestions on our personal information processing methods, or if you have any questions, opinions or suggestions on this \"Privacy Policy\" and your personal information, you can access https://gab.122.Gov.cn also selects the Internet platform to obtain the corresponding contact information.", "label": ["Important", "Contact Information"], "rewrite": "You can access https://gab.122.gov.cn and select the Internet platform to obtain the corresponding contact information."}
{"task": "rw_27.jsonl", "id": 46926, "text": "For areas that have opened 12123 voice services, you can dial the 12123 voice number. When you call the different place number, you need to add the area code.", "label": ["Important", "Contact Information"], "rewrite": "You can call the 12123 voice number to contact us."}
{"task": "rw_27.jsonl", "id": 46927, "text": "(2) If you have any questions, opinions or suggestions on the content of this privacy policy, you can contact us through the 12123 client \"Service Center  Feedback of Opinions or Consultation\".", "label": ["Important", "Contact Information"], "rewrite": "You can contact us through traffic management 12123 client \"service center  feedback or consultation telephone\"."}
{"task": "rw_27.jsonl", "id": 46928, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
