{"task": "rw_28.jsonl", "id": 46929, "text": "Personal information protection policy", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 46930, "text": "Release date of this version: March 7, 2022", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 46931, "text": "Effective date: March 7, 2022", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 46932, "text": "Woning and Banking Rong E (hereinafter referred to as \"Rong E Bank\") is a professional online financial service platform provided by Industrial and Commercial Bank of China Co., Ltd. (hereinafter referred to as \"Own\")., URL: https://mybank.icbc.com.cn) and mobile (personal mobile banking, APP name: Industrial and Commercial Bank of China).", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 46933, "text": "In order to explain how to collect, use, store, and share your personal information and what rights you enjoy, our bank will explain to you through this policy. The main points are as follows:", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 46934, "text": "Ⅰ. Our bank will explain to collect your personal information types and its purpose so that you can understand the personal information category, reasons and collection methods collected by our trip for a specific function.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 46935, "text": "Ⅱ. When you use certain functions, our guilty will collect some of your personal sensitive information after obtaining your explicit consent, such as your address book, biometric information, etc., refusing to provide this information will affect your normal use of your use will affect your normal useRelated features.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 46936, "text": "III. Railway e -line will not actively share or transfer your personal information and third parties. If there are other sharing or transfer your personal information, our bank will obtain your explicit consent.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_28.jsonl", "id": 46937, "text": "Mingxian agrees that you actively make paper or electronic forms in writing and orally, or make sure a positive movements, and make a clear authorization of your personal information.Check and take the initiative to click \"Agree\", \"Register\", \"Send\", \"Dial\", actively fill in or provide).", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 46938, "text": "In this policy, our bank believes that there is a significant relationship with your rights and personal sensitive information, and our bank uses rough characters to mark it to remind you that you pay special attention.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 46939, "text": "If you click or \"agree\" and confirm the submission of this policy, you are deemed that you agree with this policy and agree that our bank will collect, use, store and share your personal information in accordance with this policy.", "label": ["Policy Change", "Important"], "rewrite": "You are deemed that you agree with this policy for clicking or checking this policy."}
{"task": "rw_28.jsonl", "id": 46940, "text": "We know the importance of personal information to you and will try our best to protect your personal information security.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 46941, "text": "We are committed to maintaining your trust in our trip, adhere to the following principles to protect your personal information: the principles of consistency and responsibility, the principles of clear purpose, the principle of choice consent, the minimum necessary principles, the principles of safety, the principle of subject participation, the principle of openness and transparency, etc.Essence", "label": ["Data Security"], "rewrite": []}
{"task": "rw_28.jsonl", "id": 46942, "text": "At the same time, our bank promises to take corresponding security measures in accordance with the law to protect your personal information.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 46943, "text": "If you want to know more detailed information of this policy, please read the corresponding chapters as follows:", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 46944, "text": "1. How does our trip collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 46945, "text": "2. How does our trip use cookie technology", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 46946, "text": "3. How does our trip store and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 46947, "text": "4. How can our bank share, transfer and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 46948, "text": "5. How do you manage your personal information", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 46949, "text": "6. How to deal with the information of minors for our trip", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 46950, "text": "7. How to update this policy", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 46951, "text": "8. How to contact me", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 46952, "text": "1. How does our trip collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 46953, "text": "Personal information is a variety of information related to the recognized or recognizable natural person recorded in electronics or other methods, excluding information after anonymous processing.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 46954, "text": "Sensitive personal information is personal information that can easily cause the personality dignity of natural persons to be infringed or harmed by personal and property security, including biometrics, religious beliefs, specific identities, medical health, financial accounts, trajectory trajectory, etc.And personal information of minors under the age of 14.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 46955, "text": "(1) How does our trip collect your personal information", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 46956, "text": "In order to provide you with and ensure your security of your melting E -line account, in the process of using the line of E -E -line, the mellow Eye collects the information you actively enter or due to service during the use service process:", "label": ["Important", "First Party Collection Information"], "rewrite": "During your use, Rong E will collect your active input or information generated by the service."}
{"task": "rw_28.jsonl", "id": 46957, "text": "1. When you register the E -line, according to laws and regulations and regulatory requirements, you need to provide or authorize our bank to collect the necessary personal information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_28.jsonl", "id": 46958, "text": "If you refuse to provide it, you will not be able to use the corresponding function or service.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_28.jsonl", "id": 46959, "text": "(1) When you use the ICBC card to register E -Ri, our bank will collect your mobile phone number, ID information, bank card number, and verify your bank card password to help you complete the e -line registration registration.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the ICBC card to register and fade the E line, our bank will collect your mobile phone number, ID information, bank card number, and verify your bank card password."}
{"task": "rw_28.jsonl", "id": 46960, "text": "If you are already registered customers of Industrial and Commercial Bank of China or Rong E, Rong E, Rong E Buy, E Buy, E Life Customer, you can use the electronic bank to register the mobile phone number/user name/card (account) number to log in to Rong Ewan, Our bank will collect the login information you provided and verify the information to verify the information.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you use the electronic bank to register the mobile phone number/username/card (account) number number, log in to the melody, and collect your login information to verify and check."}
{"task": "rw_28.jsonl", "id": 46961, "text": "(2) When you use other cards to register and fade the E line, our bank will collect your card number, name, gender, mobile phone number, certificate number, certificate type, certificate validity period, contact address, occupation, nationality, and citizenship, and at the same time, it will be at the same time.Your name, certificate type, certificate number, and other card number are sent to China UnionPay or the People's Bank of the People's Bank of China for information inquiry and verification to help you complete the E -line registration.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use other bank cards to register and melted E line, our bank will collect your card number, name, gender, mobile phone number, certificate number, certificate type, certificate validity period, and other information for inquiry and verification."}
{"task": "rw_28.jsonl", "id": 46962, "text": "(3) When you register the E -E -line, our bank will collect your face information for identity authentication, which may send your face information to the Ministry of Public Security system for verification and accept the verification results.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you register the E -E line, our bank will collect your face information for identity authentication."}
{"task": "rw_28.jsonl", "id": 46963, "text": "After your explicit consent and identity authentication, your face information will be stored in the background database of our information system.", "label": ["Data Retention", "Important"], "rewrite": "Your face information will be stored in the background database after your explicit consent and identity authentication."}
{"task": "rw_28.jsonl", "id": 46964, "text": "If you refuse to authorize our bank to collect your face information, our bank may not be able to register for you.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_28.jsonl", "id": 46965, "text": "2. When you use the Rong E function or service, you may need to provide or authorize our bank to collect the personal information required for the corresponding services.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_28.jsonl", "id": 46966, "text": "If you refuse to provide it, you may not be able to use the corresponding function or service.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_28.jsonl", "id": 46967, "text": "(1) When you log in to Rong E, our bank will conduct effective verification of the effective verification of the face information or bank card withdrawal password of the login mobile phone number, login password or gesture password.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you log in to Rong E, our bank will check the login mobile phone number, login password or gesture password."}
{"task": "rw_28.jsonl", "id": 46968, "text": "If you forget that you need to reset the login password, our bank will verify your identity information according to the needs of your selected scene, including mobile phone numbers, names, certificates type, certificate number, bank card number, bank card withdrawal password, face information.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you reset the login password, our bank will verify your identity information based on the scene."}
{"task": "rw_28.jsonl", "id": 46969, "text": "Our bank will also collect equipment information for hardware binding and login security reinforcement.", "label": ["Important", "First Party Collection Information"], "rewrite": "Our club collects device information for hardware binding and login security reinforcement."}
{"task": "rw_28.jsonl", "id": 46970, "text": "If you do not provide the above information, you will not be able to log in or find your password, but this will not affect your available functions or services available if you do not log in.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_28.jsonl", "id": 46971, "text": "(2) In order to allow you to use the login service more secure and conveniently, if your device and the mobile version of Rong Ewan mobile support your fingerprint/face brushing function, you can choose to log in to Rong E mobile terminal through the fingerprint/brushing function.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 46972, "text": "You need to enter your fingerprint/facial information on your device. When you make your fingerprint/brush your face logging in the Mixing E mobile terminal, you need to complete your fingerprint/face verification on your device.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_28.jsonl", "id": 46973, "text": "Our bank only receives the verification results and does not collect your fingerprint/face information. Its information is only saved and processed on the device that you authorize to collect fingerprint/facial information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you perform your fingerprint/brush face logging in the e -line mobile terminal, our line receives the verification results and does not collect your fingerprint/face information."}
{"task": "rw_28.jsonl", "id": 46974, "text": "If you don't want to log in with your fingerprint/face, you can still log in in other ways.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 46975, "text": "You can open or close the fingerprint/brushing face login function through the \"My-Settings-Login Management-Fingerprint/Brush Login\".", "label": ["Edit/Control", "Important"], "rewrite": "You can open or close the fingerprint/brushing face login function through the \"My-Settings-Login Management-Fingerprint/Brush Login\"."}
{"task": "rw_28.jsonl", "id": 46976, "text": "(3) In order to allow you to use the login service more secure and conveniently, if your melting e -line mobile version supports sound pattern login function, you can choose to log in to the mobile terminal of Rong Ewan e -line, and our bank will collect your soundAfter your explicit consent and identity authentication, your voiceprint information will be encrypted in the backstage database of our information system.", "label": ["Data Retention", "Important", "First Party Collection Information"], "rewrite": "If you choose to log in to the moving end of the Rong E line through the sound pattern, our bank will collect your sound texture information. After your explicit consent and identity authentication, the sound line information is encrypted and stored in the background database of our information system."}
{"task": "rw_28.jsonl", "id": 46977, "text": "If you refuse to authorize our line to collect your sound lines, our bank will not be able to provide you with sound pattern login service, and you can still log in in other ways.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_28.jsonl", "id": 46978, "text": "You can open or turn off the sound pattern login function by \"My-Settings-Login Management-Sound Login\".", "label": ["Important", "Edit/Control"], "rewrite": "You can open or close the sound pattern login function by \"My-Settings-Login Management-Sound Login\" by Rong E mobile terminal."}
{"task": "rw_28.jsonl", "id": 46979, "text": "(4) When you need to verify your identity or auxiliary certification scenarios when you register, log in, log in, cancel the electronic banking, or make a transaction such as functional opening, inquiries, changes, etc., you are due to maintaining your information, account security, and risk control.Or, when laws and regulations and regulatory regulations must be verified by customer identity verification, our guild is required to perform identity verification through face recognition.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you need to verify your identity or auxiliary authentication scenarios, we will ask you to perform your identity verification through face recognition."}
{"task": "rw_28.jsonl", "id": 46980, "text": "If you are a minor, your guardian needs to complete the verification through face recognition.", "label": ["Specific Audiences", "Important"], "rewrite": "Minors need to be verified by the guardian through face recognition."}
{"task": "rw_28.jsonl", "id": 46981, "text": "If you refuse to authorize our bank to collect your face information, our bank may not be able to provide you with products or services that need to be used after face recognition and authentication.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_28.jsonl", "id": 46982, "text": "When face recognition, our travel will collect your face information. Through live testing and face comparison technologies, you will verify your true identity.Face information retained by channel authorization, or inquire and use your identity information and face photo information through the authorized organs (including but not limited to the People's Bank of China, the Ministry of Public Security and its authorized agencies).", "label": ["Important", "First Party Collection Information"], "rewrite": "When face recognition, our travel will collect your face information to verify your true identity."}
{"task": "rw_28.jsonl", "id": 46983, "text": "When necessary, our bank will send your face information to the above agencies for verification and accept the verification results.", "label": ["Important", "Risk"], "rewrite": "When necessary, our bank will send your face information to the authority to verify and receive the verification results."}
{"task": "rw_28.jsonl", "id": 46984, "text": "After face recognition verification, your face information will be archived in our system as a transaction -retained information information.", "label": ["Data Retention", "Important"], "rewrite": "After the face recognition verification, your face information will be stored in our system as a transaction -retained information information."}
{"task": "rw_28.jsonl", "id": 46985, "text": "If you do not provide face information for collection and verification, our bank will not be able to provide you with products or services that must be verified by face recognition verification based on business nature and risk control.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_28.jsonl", "id": 46986, "text": "You can still choose other certification methods provided by our bank to complete your identity verification, or consult the business through other channels such as the counterclocking of our outlets and smart terminals.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 46987, "text": "You can authorize our bank to save your face information to our information library to achieve 7*24 -hour face recognition authentication services.", "label": ["Permission Acquisition", "Important"], "rewrite": "You can authorize our bank to save your face information to the information library to achieve 7*24 -hour face recognition certification services."}
{"task": "rw_28.jsonl", "id": 46988, "text": "After your explicit consent and identity authentication, your face information will be encrypted to store the face recognition information library of our pedestrian.", "label": ["Data Retention", "Important"], "rewrite": "Your face information will be stored in the information library after your consent and identity authentication."}
{"task": "rw_28.jsonl", "id": 46989, "text": "You can log in to Rong E mobile terminal, open, terminate face recognition services or update your face information on \"My-Personal Information-Face recognition service\".", "label": ["Important", "Edit/Control"], "rewrite": "You can open, terminate face recognition services or update face information in \"My-Personal Information-Face recognition service\"."}
{"task": "rw_28.jsonl", "id": 46990, "text": "(5) In order to allow you to use transfer and payment services more secure and conveniently, if your device and Rong E mobile terminal version support fingerprint/facial features. For some brands or models, you can choose to open your fingerprint/Brush your face payment function.", "label": ["Important", "Edit/Control"], "rewrite": "You can choose to open your fingerprint/face -brushing payment function."}
{"task": "rw_28.jsonl", "id": 46991, "text": "You need to enter your fingerprint/face information on your device. When you make fingerprint/face payment, you need to complete your fingerprint/face verification on your device.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 46992, "text": "Our bank only receives the verification results and does not collect your fingerprint/face information. Its information is only saved and processed on the device that you authorize to collect fingerprint/facial information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you make fingerprint/face payment, our bank only receives the verification results and does not collect fingerprint/face information."}
{"task": "rw_28.jsonl", "id": 46993, "text": "If you don't want to pay with your fingerprint/face, you can still transfer and pay in other ways.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 46994, "text": "You can open or close the fingerprint/face-brushing payment function by \"ICBC E Payment-Safety Management-Fingerprint Payment/Face Payment\" on the mobile terminal.", "label": ["Edit/Control", "Important"], "rewrite": "You can open or close the fingerprint/face-brushing payment function through the \"ICBC E Payment-Security Management-Fingerprint Payment/Face Payment\"."}
{"task": "rw_28.jsonl", "id": 46995, "text": "(6) When you pass the third party to log in to the Rongyan mobile terminal, our bank may obtain the account information (avatar, nickname, region, gender) of your authorized sharing from third parties (such as WeChat, Alipay, Apple), and inAfter you agree with this policy, you will bind your third -party account with your Rong E account, so that you can log in to and use our bank's product or service through a third -party account.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When you log in to the Rongyan mobile terminal through a third party, our bank may obtain the account information you authorized shared from a third party and binded account binding."}
{"task": "rw_28.jsonl", "id": 46996, "text": "You can open or close the above-mentioned third-party authorized login function by \"My-Settings-Login Management\", and you can query the history of the third-party account binding history.", "label": ["Important", "Edit/Control"], "rewrite": "You can open or close the third-party authorized login function by opening or closing the third-party account by the \"My-Settings-Login Management\" of Rong E mobile terminal and query the history of the third-party account."}
{"task": "rw_28.jsonl", "id": 46997, "text": "(7) When you use the real -name authentication service provided by Rong E, our bank will verify your name, certificate type, certificate number, bank card number/account number, face information according to the needs of your selected scene, and may verify the account number by verifying the account number/Code password method to verify the effectiveness of relevant information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the real -name authentication service provided by Rong E, our bank will verify your personal information based on the scene needs."}
{"task": "rw_28.jsonl", "id": 46998, "text": "If you do not provide the above information, our bank will not be able to provide you with products or services that you need to use after real -name authentication, but this does not affect other functions of your normal use of Rong E.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_28.jsonl", "id": 46999, "text": "(8) When you use the ICBC Merchants and Rong Ewan Mobile Message Services, our bank will collect your account information and transaction information in order to send you account fund changes and related transaction notifications in time;", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the ICBC Merchant and Rong E mobile news service, our bank will collect your account information and transaction information."}
{"task": "rw_28.jsonl", "id": 47000, "text": "Our bank may also collect information from our bank's partners and authorize the information that you can share with it in order to provide you with corresponding message notification services.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Our bank may collect information that you can share with partners in order to provide message notification services."}
{"task": "rw_28.jsonl", "id": 47001, "text": "(9) When you use the search service provided by Rong E, our bank will collect your search keyword information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the search service provided by Rong E line, our bank will collect your search keyword information."}
{"task": "rw_28.jsonl", "id": 47002, "text": "When searching keyword information cannot identify your personal identity alone, the information does not belong to your personal information, and our bank can use it for other purposes;", "label": ["Important"], "rewrite": "When searching keyword information cannot identify your personal identity alone, our bank can use other purposes."}
{"task": "rw_28.jsonl", "id": 47003, "text": "Only when the search keyword information is used with your other information and can identify your personal identity, during the combination of use, our bank will use your search keyword information as your personal information to protect it.", "label": ["Important", "Risk"], "rewrite": "Only when the search keyword information is used in combination with your other information and can recognize your personal identity, our bank will protect it as a personal information."}
{"task": "rw_28.jsonl", "id": 47004, "text": "(10) When you use outlets, weather services, etc. When geographical location -based functions, our bank will collect your geographical location information to provide you with the corresponding service at your location.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use outlets to make appointments, weather services, etc., our bank will collect your geographical location information."}
{"task": "rw_28.jsonl", "id": 47005, "text": "If you refuse to provide this information, you will not be able to use the above features, but this does not affect other functions of your normal use of Rong E.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47006, "text": "(11) When you use your mobile phone number transfer, recharge fee, remittance SMS notification, etc., our bank only obtains the contact information you clicked from the address book, and the encrypted transmission is performed to prevent malicious interception.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "When you use the function involved in the address book, our bank only obtains the contact information you clicked from the address book and perform encrypted transmission."}
{"task": "rw_28.jsonl", "id": 47007, "text": "The above information is personal sensitive information.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47008, "text": "If you refuse to provide the above information, you can choose to manually enter the contact information to continue using the above features, which will not affect other functions of your normal use of Rong E.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47009, "text": "(12) When you use the collection and payment functions such as transfer remittances, ICBC E, Code Payment, etc., you need to provide information such as the mobile phone number, name, bank card number/account number of bank cards, and you may need to provide your name, Mobile phone number, certificate type and document number, etc., in order to verify the identity and payment services using the above functions.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the transfer of transfer remittances, ICBC E -payment, code scanning payment, etc., you need to provide information from the receiver, and you may need to provide your information to authenticate and use the payment function."}
{"task": "rw_28.jsonl", "id": 47010, "text": "In addition, our bank will collect your related receivable transactions for your inquiry.", "label": ["Important", "First Party Collection Information"], "rewrite": "Our bank will collect your related receivable transactions to facilitate your inquiry."}
{"task": "rw_28.jsonl", "id": 47011, "text": "The relevant matters are implemented according to the \"Industrial and Commercial Bank of China Electronic Bank Personal Customer Service Agreement\" that you agree to sign when you add a bank card.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47012, "text": "The above information is a personal sensitive information. If you refuse to provide this information, it will only make you unable to use the above features, but it does not affect other functions of your normal use of Rong E.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47013, "text": "When you do payment management through the mobile terminal of the e -line, it will verify your payment password such as opening code scan payment.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47014, "text": "You can modify your payment password through the \"ICBC E Payment-Security Management\" by Rong E mobile.", "label": ["Edit/Control", "Important"], "rewrite": "You can modify your payment password through the \"ICBC E-Payment-Safety Management\" by Rong E mobile."}
{"task": "rw_28.jsonl", "id": 47015, "text": "To ensure the security of your account funds, you need to verify your user identity when you enter the security management function to modify the payment password and provide the original payment password.", "label": ["Important", "First Party Collection Information"], "rewrite": "You need to verify your user identity when you enter the security management function to modify the payment password and provide the original payment password."}
{"task": "rw_28.jsonl", "id": 47016, "text": "(13) When you use the functions such as Rong E to buy goods and the service of merchant services in Rong E, you need to fill in information such as the consignee's name, receiving address and mobile phone number on the order page. At the same time, the order is the orderZhonghui contains the order number, the product or service information you purchased, the amount you should pay, and the payment method.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use Rong E to buy goods and the service of the merchant service, you need to provide the consignee information. At the same time, the order will contain the order number, the product or service information you buyMethod and other information."}
{"task": "rw_28.jsonl", "id": 47017, "text": "When you book air tickets, train tickets, movie tickets, hotels and other businesses, you may also need to be based on national laws and regulations, regulatory requirements or service providers (including ticket sellers, hotels, travel agencies and its authorized agents and basic telecommunications operationsThe requirements of business, mobile resale operators, etc.) provide your real -name information. These real -name information may include your identity information (such as your ID card, officer card, passport, driver's license, etc.Number), your own name, phone number, etc.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you book tickets, train tickets, movie tickets, hotels and other businesses, you need to provide real -name information."}
{"task": "rw_28.jsonl", "id": 47018, "text": "These orders may include information such as your itinerary, hotel address.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47019, "text": "All the above information constitutes your order information. Our bank will use your order information to perform your identity verification, determine transactions, pay settlement, complete distribution, query orders for you, and provide customer service consultation and after -sales service;", "label": ["Important", "Usage"], "rewrite": "Our bank will use your order information to perform your identity verification, determine transactions, pay settlement, complete distribution, etc."}
{"task": "rw_28.jsonl", "id": 47020, "text": "Our bank will also use your order information to determine whether your transaction is abnormal to protect your transaction security.", "label": ["Important", "Usage"], "rewrite": "Our bank uses your order information to determine whether your transaction is abnormal to protect your transaction security."}
{"task": "rw_28.jsonl", "id": 47021, "text": "After placing an order, you can choose to use the ICBC card or other card payment.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47022, "text": "After you place an order and choose the payment to pay or complete the payment online, Rong E purchased merchant and third -party distribution companies will complete the order of orders for you.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47023, "text": "Rong E buying merchant households, third -party distribution companies, after -sales service, etc. can use your order information to think that you provide goods or services.", "label": ["Important", "Usage"], "rewrite": "Rong E buying merchant households, third -party distribution companies, after -sales service, etc. can use your order information to think that you provide goods or services."}
{"task": "rw_28.jsonl", "id": 47024, "text": "Our telephone customer service and after -sales function will use your account information and order information.", "label": ["Important", "Usage"], "rewrite": "Telephone customer service and after -sales function will use your account information and order information."}
{"task": "rw_28.jsonl", "id": 47025, "text": "To ensure your account security, our call center customer service and online customer service will use your account information to verify your identity with you.", "label": ["Important", "Usage"], "rewrite": "Call Center customer service and online customer service will use your account information to verify your identity with you."}
{"task": "rw_28.jsonl", "id": 47026, "text": "When you need our bank to provide customer service and after -sales service related to your order information, our bank will check your order information.", "label": ["Important", "Usage"], "rewrite": "When you need our bank to provide customer service and after -sales service related to order information, our bank will check your order information."}
{"task": "rw_28.jsonl", "id": 47027, "text": "You may provide other information except the above information when communicating with our customer service staff, such as: when you ask our bank to change the delivery address, contact or contact number.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect other information provided when communicating with customer service personnel."}
{"task": "rw_28.jsonl", "id": 47028, "text": "(14) When you use the \"check\" function of the Rong E mobile terminal, we will protect the photos information you know and agree to provide, store on the background server, and not store it on the local mobile phone.", "label": ["Data Retention", "Important"], "rewrite": "When you use the \"Check\" function of the Rong E mobile terminal, we will protect the photos information you know and agree with it and store it on the background server."}
{"task": "rw_28.jsonl", "id": 47029, "text": "Once you delete or remove the photos stored in the \"Handle\", the server will no longer be saved.", "label": ["Data Retention", "Important"], "rewrite": "Once you delete or remove the photos stored in the \"Handle\", the server will no longer be saved."}
{"task": "rw_28.jsonl", "id": 47030, "text": "Our bank will not collect photos you stored in \"casual check\".", "label": ["Important", "First Party Collection Information"], "rewrite": "Our bank will not collect photos you stored in \"casual check\"."}
{"task": "rw_28.jsonl", "id": 47031, "text": "Except for the requirements of the state's rights or other agreed situations, we will not provide any third party/others.", "label": ["Important"], "rewrite": "Except for the requirements of the state's rights or other agreed situations, we will not provide your information to any third party/others."}
{"task": "rw_28.jsonl", "id": 47032, "text": "(15) When you use the \"cloud protection tube\" function of the Rong E mobile terminal, our guild will protect the personal information you know and agree with it, store it on the background server, and not store it on the local mobile phone.", "label": ["Data Retention", "Important"], "rewrite": "When you use the \"cloud protection\" function of the Rong E mobile terminal, our guild will be protected by the personal information you know and agree to provide it on the background server."}
{"task": "rw_28.jsonl", "id": 47033, "text": "You can put different information such as photos (such as PNG), files (such as PDF) into \"cloud security tube\", and the specific type is based on the actual support of \"cloud protection tube\", and through the \"login password+face\" verification unlocking and unlocking and unlocking and unlocking and unlocking and unlocking and unlocking and unlocking and unlockingCryptive storage, transmission and other technical solutions to protect your file security.", "label": ["Important", "Data Security"], "rewrite": "The information in \"Cloud Insurance\" can be protected through the \"login password+face\" verification unlocking and technical solutions such as encrypted storage and transmission."}
{"task": "rw_28.jsonl", "id": 47034, "text": "Once you delete or remove the information in the \"Cloud Insurance\", the server will no longer be preserved.", "label": ["Data Retention", "Important"], "rewrite": "Once you delete or remove the information in the \"Cloud Insurance\", the server will no longer be preserved."}
{"task": "rw_28.jsonl", "id": 47035, "text": "Our bank will not collect the information you store in \"Cloud Insurance Management\".", "label": ["Important", "First Party Collection Information"], "rewrite": "Our bank will not collect the information you store in \"Cloud Insurance Management\"."}
{"task": "rw_28.jsonl", "id": 47036, "text": "Except for the requirements of the state's rights or other agreed situations, we will not provide any third party/others.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47037, "text": "Any content you upload and storage shall comply with the provisions of relevant national laws, regulations, rules, and regulations, and shall not contain the following content: A. Reaction, pornography, violence, etc.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47038, "text": "b. False, harassment, insult, intimidation, intimidation, harm, provocation, vulgarity information;", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47039, "text": "c. Infringement of information about patent rights, copyrights, copyrights, trademark rights, reputation rights or any other legitimate rights and interests of any other third -party.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47040, "text": "You should ensure that the upload content has not infringed the intellectual property rights of others.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47041, "text": "If you are a third -party work, you should obtain a third -party license or have not obtained a third -party license but have the right to legally use third -party works.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47042, "text": "Except for laws and regulations and regulatory requirements, the pre -license of the third -party works has not been obtained by the third -party work, and you must not use third -party works in any way.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47043, "text": "(16) When you start the mobile terminal of Rong E, our bank will have the conditions to read your mobile phone cutting plate content (only continuous numbers appear on the mobile phone cutting plate and the system is judged by the system as a bank account.), Used to ask if you need to transfer to this bank account. If you confirm the transfer and log in to the E -line, the page will jump to the transfer remittance function and automatically fill in the read number part to the receiving account input box.Simplify your operation.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you start the Rong E mobile terminal, our bank will have the conditions to read the contents of your mobile phone cutting board to ask if you need to transfer it to this bank account."}
{"task": "rw_28.jsonl", "id": 47044, "text": "In order to effectively ensure your personal information security, we only read the continuous numbers appearing on the shear plate, do not read other content, and read the contents of the client local (only the latest one is stored, without leaving history without leaving historyRecord), not upload to our server.", "label": ["Data Retention", "Important", "First Party Collection Information"], "rewrite": "We only read the continuous numbers appearing on the shear plate, do not read other content, and read the content stored on the client."}
{"task": "rw_28.jsonl", "id": 47045, "text": "(17) When you log in or transaction certification at the melting desktop end of the e -line, the password input control or expansion program provided by our bank will collect the login password or credit card CVV code you entered in the line of desktop ends in the e -line of the E line.And the encryption protection of it is uploaded to our server to enhance the security of the password input;", "label": ["Important", "Data Security"], "rewrite": "When you log in or transaction certification on the desktop end of Rong E line, our bank will collect the login password or credit card CVV code you entered, and upload it to our line server after encrypted protection."}
{"task": "rw_28.jsonl", "id": 47046, "text": "The U -Shield control or U -Shield expansion program provided by our bank will collect your U shield password and transaction information when using the U shield authentication on the desktop end of the e -line, and upload it to the server of our bank to enhance the password to enhance the password to enhance the password to enhance the passwordInput and transaction certification security.", "label": ["Important", "First Party Collection Information"], "rewrite": "The U -Shield control or U -Shield expansion program provided by our bank will collect transaction information when used, and upload it to our server after encrypted protection."}
{"task": "rw_28.jsonl", "id": 47047, "text": "The above information is a personal sensitive information. If you refuse to provide the information, you will not be able to log in or log in after logging in, but this will not affect other functions or services of your normal use of Ring E.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47048, "text": "(18) When you use Rong E mobile terminal to reset the debit card password, release the debit card loss, modify the mobile phone number, etc., we will handle your business through audio and video calls.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47049, "text": "In order to ensure that I do it, our bank needs to obtain personal information such as the bank card number, mobile phone number, ID information and relevant certification materials you provided in order to verify your authenticity of remote video reviewers.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the function that requires remote video review, our bank will obtain personal information such as the bank card number, mobile phone number, ID card information and related certification materials you provided in order to verify the identity."}
{"task": "rw_28.jsonl", "id": 47050, "text": "Our bank will synchronize all the audio and video information in the process of business processing, including dialogue audio and video videos interaction between customers interact with the seats as a transaction -retaining information.", "label": ["Data Retention", "Important"], "rewrite": "Our bank will synchronize all the audio and video information in the process of processing the business as a transaction -retaining information."}
{"task": "rw_28.jsonl", "id": 47051, "text": "(19) When you use Rong E mobile terminals to explain the same screen, during the screen sharing opening process, our bank will obtain the screen recording and screen screening video of your remote seat personnel with our bank, which may include you may include youThe device is displaying or played bank accounts, transaction information, photos, audio, video, and notification messages. The above information is only used for the voucher of the service process of the same screen.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use Rong E mobile terminals with screen explanation functions, our bank will get your call recording and shared screen recording video."}
{"task": "rw_28.jsonl", "id": 47052, "text": "(20) When you use Rong E's pension planning and calculation function, our bank may need to collect information such as your birth year, working hours, monthly salary, etc., in order to calculate the gap in pension funding for you.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use Rong E's pension planning and calculation function, you need to collect information such as birth, monthly month, work hours, monthly salary to calculate the gap in pension funds."}
{"task": "rw_28.jsonl", "id": 47053, "text": "3. When you use Rong E line services, in order to maintain the normal operation of the service, optimize our travel experience and ensure your account security, our bank may collect the following basic information, including your equipment model, operating system, equipment, equipment, equipment, equipment, equipmentThe only logo (Android is Android, ID, iOS is IDFV), Rong E Xing Mobile Edition number, login IP address, device MAC address, type and status of access to the networkInduction, touch screen induction, etc.), operation logs, system parameters, application authority, installation application information or process information, service log information that is running (such as the information you searched, viewed in the e -line, the introduction of the website, the service failure information information, the service failure information informationWait), this information is the basic information that you need to collect services for you to ensure your normal use of our service.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the Rong E line service, collect the basic information necessary for you to provide you."}
{"task": "rw_28.jsonl", "id": 47054, "text": "4. In order to provide you with more accurate, personality and convenient services, improve service experience, improve service quality, or prevent risks, our bank will collect information provided by your feedback suggestions or reports, collect your participation in the questionnaire survey to the direction of the questionnaire survey.The information that our travel feedback is collected by the category, method and operation information of your melting e -line function or service, and your personal information on our bank. Our will be able to statistics and analysis of this information, and will to you according to the above information.Provide corresponding services or products.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Our bank will collect information provided by your feedback suggestions or reports, information involved in questionnaires, information, and personal information that uses E -line function or service, and statistics and analysis of these information."}
{"task": "rw_28.jsonl", "id": 47055, "text": "5. When you use the services provided by a third party in Rong E, the third party may obtain your nickname and avatar public information through Rong E line;", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the services provided by a third party in Rong E, third parties may get public information such as your nicknames and avatars."}
{"task": "rw_28.jsonl", "id": 47056, "text": "If you have explicitly agreed that the third party can get your geographical location information, our bank will grant the third party to obtain the terminal geographic location information interface, which can obtain your specific location information through this interface;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you have explicitly agreed that the third party can get your geographical location information, our bank will award the third party to obtain the terminal geographic location information interface."}
{"task": "rw_28.jsonl", "id": 47057, "text": "After your explicit consent, the third party can get your mobile phone number and other information;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After your explicit consent, the third party can obtain your mobile phone number and other information."}
{"task": "rw_28.jsonl", "id": 47058, "text": "For the relevant information provided to the third party when you use the service provided by a third party, our bank will be regarded as you allow the third party to obtain the above -mentioned information;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For related information you proactively provided to third parties, you will be deemed to allow third parties to obtain such information."}
{"task": "rw_28.jsonl", "id": 47059, "text": "For the information that you generate when using the third -party service, you and the third party should agree on the collection and use of the above information according to law.", "label": ["Important"], "rewrite": "You and the third party agreed to collect and use the information generated when using the third -party service."}
{"task": "rw_28.jsonl", "id": 47060, "text": "If you refuse to collect, use, or pass the above information when providing services, it may cause you to be unable to use the corresponding service of third parties in the Rong E line, but this does not affect other functions of your use of Rong E.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47061, "text": "6. In the following circumstances, you can choose whether to authorize our bank to collect and use your personal information:", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47062, "text": "(1) Based on the function of camera (camera): you can use services such as code scanning, QR code recognition, bank card recognition, ID card recognition, face recognition, interpretation of the same screen, remote video review and other services.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47063, "text": "(2) Functions based on album (picture library): You can use avatars upload, electronic return preservation, QR code recognition, bank card and ID card recognition.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47064, "text": "(3) Function based on geographical location: You can turn on the positioning service for network financial transaction risk control, improve the accuracy of querying nearby outlets, and obtain preferential merchant information.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47065, "text": "(4) Function based on microphone: You can use audio U shields, sound line recognition, voice search, voice transfers, voice wake -up, interpretation of the same screen, remote video audit and other services.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47066, "text": "(5) Bluetooth -based function: You can use Bluetooth U Shields and other services.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47067, "text": "(6) FACE ID: You can use login, payment and other services.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47068, "text": "(7) Storage -based functions: For mobile banking login, my customer service, sweeping, login avatar picture saving, the same screen explanation, etc., provide client upgrade related information.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47069, "text": "(8) Based on the function of the phone: used to read basic information such as mobile phone device ID, and identify the device to bind information to ensure the security of customers' transactions during logging in and paying.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47070, "text": "When you use audio and video audit services and the same screen explanation function of functions such as forgetting passwords, account loss or hanging on the same screen, you need to confirm the telephone status to avoid abnormal states such as entering audio and video communication during the call process.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47071, "text": "(9) Function based on NFC: You can use services such as cloud flash payment, industrial banking butler.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47072, "text": "(10) Function based on address book: You can use mobile phone number transfer, call recharge, remittance SMS notification and other services.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47073, "text": "(11) Fingerprint -based functions: You can use fingerprint login, fingerprint login settings and other services.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47074, "text": "(12) Function based on the shear plate: You can use the cloud passage to identify and transfer the quick jump function. The background of our system does not save your shear plate content.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47075, "text": "(13) Function based on screen records: You can use the same screen explanation service.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47076, "text": "The above features may require you to turn on your camera (camera), album (picture library), geographical location (location information), microphone, Bluetooth, FACE, storage space, telephone, NFC, communication, communication, communication, communication, communication, communicationThe access permissions of recording, fingerprints, shear plates, and screen screening screens to achieve the collection and use of information involved in these functions.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "When you use the functions such as code scanning, quick transfer, and explanation of the same screen, our bank will obtain your camera, album, geographical location, microphone, Bluetooth, FACE ID, storage space, telephone, NFC, address book, fingerprint, shear, cuttingThe access to the screen and the screen screen records to achieve the collection and use of information involved in these functions."}
{"task": "rw_28.jsonl", "id": 47077, "text": "Please note that when you turn on these permissions, it means that you can authorize our bank to collect and use this information to implement the above functions. If you cancel these authorization, our bank will no longer continue to collect and use your information, and you cannot do it for you for youProvide the above functions corresponding to these authorization.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "The opening of one authority means that the authorization is authorized to collect and use the relevant information to provide corresponding services. Close the authority to cancel the authorization representative, and no longer continue to collect and use relevant information based on the corresponding permissions."}
{"task": "rw_28.jsonl", "id": 47078, "text": "7. In the process of providing you to you, our bank's system may also provide you with a software development tool package (referred to as \"SDK\") provided by a third -party service provider. The third -party service provider will collect your necessary information.If you refuse to provide relevant information or permissions, you will not be able to use related functions.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Our system may also provide you with SDK provided by a third -party service provider, collecting your necessary information by third -party service providers."}
{"task": "rw_28.jsonl", "id": 47079, "text": "Specifically include the following:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47080, "text": "(1) Social Security Card SDK: When you apply for an electronic social security card function, you need to collect your name, ID number, mobile phone number, mobile phone system version, mobile phone model, network status information, and encrypted to the Ministry of Human Resources and Social SecurityThe system is used to generate electronic social security cards.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "When you apply for an electronic social security card function, you need to collect your name, ID number, mobile phone number, mobile phone system version, mobile phone model, network status information, and encrypted to transmit them to the Ministry of Human Resources and Social Security."}
{"task": "rw_28.jsonl", "id": 47081, "text": "(2) Web card SDK: When you use the online functional voucher of the resident ID card, you need to collect related information such as your name, ID number, and ID card validity period to generate network certificates.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "When you use the online functional voucher of the resident ID card, you need to collect related information such as your name, ID number, and ID card validity period to generate network certificates."}
{"task": "rw_28.jsonl", "id": 47082, "text": "(3) Huawei push SDK: In order to push the message to you in a timely manner, we use Huawei to push the SDK. The SDK needs to get your mobile phone IMEI, AAID, Token, TOPIC subscription relationship, and equipment group relationship information for the realizationWing mobile terminal push service.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Huawei pushes SDK to obtain your mobile phonei, AAID, token, Topic subscription relationship, equipment group relationship information, to achieve push services."}
{"task": "rw_28.jsonl", "id": 47083, "text": "(4) Xiaomi push SDK: In order to push the message to you in time, I used Xiaomi to push the SDK. The SDK needs to get your mobile phone IMEI, AAID, VAID, Android, ID, MID, device model and other information for realizationRong E mobile terminal push service.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Xiaomi Push SDK needs to get information such as your mobile phone IMEI, AAID, VAID, Android ID, MID, equipment models and other information for push services."}
{"task": "rw_28.jsonl", "id": 47084, "text": "(5) OPPO push SDK: In order to push the message to you in a timely manner, we use OPPO to push SDK. The SDK needs to get your mobile phone IMEI, Serial, Number, IMSI, User, ID, Android, Google, Advertising, AdvertisingID, mobile phone region settings, device models, mobile phone power, mobile phone operating system versions and languages and other information are used to realize the moving service push service.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "OPPO pushes SDK to get your mobile phone IMEI, Serial Number, IMSI, User ID, Android ID and other information for mobile push services."}
{"task": "rw_28.jsonl", "id": 47085, "text": "(6) vivo push SDK: In order to push the message to you in a timely manner, we use vivo to push the SDK. The SDK needs to get your mobile phone IMEI, Serial, Number, IMSI, Android, ID, system settings and other information for realizationRong E mobile terminal push service.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Vivo pushes SDK to obtain information about your mobile phone IMEI, Serial Number, IMSI, Android ID, system settings and other information for push services."}
{"task": "rw_28.jsonl", "id": 47086, "text": "(7) Baidu Map SDK: In order to provide you with location -based services, we use Baidu Map SDK. This SDK needs to get your mobile phone IMEI, IMSI, hardware model, operating system version, device configuration, MAC address, latitude and longitude information information, Used to implement the positioning function.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Baidu Map SDK needs to obtain your mobile phone IMEI, IMSI, hardware model, operating system version, device configuration, MAC address, latitude and longitude information, to achieve positioning functions."}
{"task": "rw_28.jsonl", "id": 47087, "text": "(8) WeChat SDK: In order to provide you with WeChat authorized login to log in to Rong Ring's service, our bank uses WeChat SDK. This SDK needs to obtain the account information (avatar, nickname, region, gender) you authorized shared from WeChat, and use it.Bind your WeChat account with your Rong E account, so that you can log in to and use the product or service of Rong E through the WeChat account.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "WeChat SDK needs to obtain the account information of your authorized sharing from WeChat, for your WeChat account to bind to your Rong E account."}
{"task": "rw_28.jsonl", "id": 47088, "text": "(9) Alipay SDK: In order to provide you with the service of Alipay authorized to log in to Rong Ring's mobile terminal, we use the Alipay SDK. The SDK needs to obtain the account information (avatar, nickname, region) you authorized from Alipay for yourThe Alipay account is bound to your Rong E account, so you can log in to the product or service of Rong E through the Alipay account.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Alipay SDK needs to obtain the account information of your authorized sharing from Alipay, for your Alipay account to bind to your Rong E account account."}
{"task": "rw_28.jsonl", "id": 47089, "text": "GPS and login IP address -related device information for equipment fraud risk recognition.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "The same shield SDK needs to obtain your mobile phone IMEI, MAC address, device type, device model, system type, GPS, and login IP address related device information for device fraud risk recognition."}
{"task": "rw_28.jsonl", "id": 47090, "text": "(11) Byte SDK (involved in Android only): In order to reduce the size of the mobile application of the mellow E line, the resources are updated by dynamically.Read and write external memory permissions, and use it to obtain network status, determine whether it is in line with resource download timing and download new features.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "Byte beating SDK needs to read the phone status of the mobile phone, read, and write to the external memory permissions. It is used to obtain the network status and determine whether it is in line with resource download timing and download new features."}
{"task": "rw_28.jsonl", "id": 47091, "text": "(12) Borui SDK (Android): In order to improve the stability of the mobile application application of melting e -line, we use the Borui SDK. The SDK needs to get your Android, ID, CPU, device model, mobile phone system version, version of the mobile phone system, version, version of the mobile phone system, version of the mobile phone system, version of the mobile phone system, version version, version version, mobile phone system version, version version, version version, mobile phone system version, version of the mobile phone system, version version, version of the mobile phone system, version,Mobile phone power, network status, internal application, click records, rough positions, etc., involve reading telephone status and accepted rough location permissions to achieve performance monitoring and optimization of network requests and collapse of the application.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "Borui SDK needs to obtain information such as your Android ID, CPU, device model, mobile phone system version, mobile phone power, network status, internal click records, rough positions, etc.Application of network requests, collapse and other performance monitoring and optimization."}
{"task": "rw_28.jsonl", "id": 47092, "text": "Electricity, network status, click records, rough positions, etc. are used to achieve performance monitoring and optimization of network requests, collapse and other performance monitoring and optimization of applications.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Borui SDK needs to obtain information such as your mobile phone IDFV, CPU, device model, and mobile phone system versions to achieve performance monitoring and optimization of network requests and collapse of the application."}
{"task": "rw_28.jsonl", "id": 47093, "text": "(14) Page Statistics SDK (JS component): In order to statistical part -time customer visits to the customer's marketing advertisement and event page, we used Baidu Statistics SDK and Friend League+(webmaster statistics) SDK. This SDK needs to needGet your device's unique logo (Android is Android, ID, iOS as IDFV) and the area information of the network IP to achieve relevant statistics of PV (page views) and UV (independent visitors).", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Baidu Statistics SDK and Friend League+SDK obtain the unique logo of your device and the regional information of the network IP to achieve relevant data statistics of PV and UVs."}
{"task": "rw_28.jsonl", "id": 47094, "text": "8. Please understand that the functions and services provided by you are constantly updated and developed. If a function or service is not stated in this policy and collected your personal information, our bank will use page prompts and interactive interaction.Process, website announcement and other methods will explain to you the content, scope and purpose of information collection, use, and obtain your authorization consent before use.", "label": ["Important", "First Party Collection Information"], "rewrite": "If a function or service is not stated in this policy and collected your personal information, our bank will explain to you separately and obtain your authorization consent before use."}
{"task": "rw_28.jsonl", "id": 47095, "text": "Authorization consent means that you have a clear authorization of your personal information, including authorization through active behavior (that is, explicit consent), or to authorize through negative inaction (such as you are being in the information collection area, you are being being quiltI did not leave the area after the information was collected).", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47096, "text": "(2) How do I use your personal information", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47097, "text": "1. In order to provide you with better services, our bank may use your financial information for marketing, user experience improvement or market research.", "label": ["Important", "Usage"], "rewrite": "Our bank may use your financial information for marketing, user experience improvement, or market survey."}
{"task": "rw_28.jsonl", "id": 47098, "text": "For example, telephone, SMS, 5G messages, intelligent services, clients, emails, WeChat, Rong E or other instant messaging tools and other methods to send products and services, marketing, user experience improvement and market research.", "label": ["Important", "Usage"], "rewrite": "Use your information to send you information to you through instant messaging tools."}
{"task": "rw_28.jsonl", "id": 47099, "text": "If you disagree with the above authorization, you can call the 95588 customer service hotline or adjust or unsubscribe through other methods specified in our bank.", "label": ["Important"], "rewrite": "You can call the 95588 customer service hotline or adjust the information through other methods."}
{"task": "rw_28.jsonl", "id": 47100, "text": "Regardless of whether you agree with the above authorization, our bank will continue to provide high -quality services, which will not affect the reminder information such as risk prompts, service status notifications, business processing progress, repayment prompts to you.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47101, "text": "After you agree, if you need to change the authorization, you can dial the 95588 service hotline or adjust or unsubscribe through other methods specified by Industrial and Commercial Bank of China.", "label": ["Permission Acquisition", "Contact Information"], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47102, "text": "2. In order to ensure the security of service and help us travel better to understand the operation of Rong E, our bank may record the relevant information about the operation of Rong E, for example, the frequency of the Rong E line, the collapse data, the overall usage, and the performance of the performance, the performance, the performance, and the performanceData, etc.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Our bank may record the relevant information about the operation of the melting E to ensure service safety."}
{"task": "rw_28.jsonl", "id": 47103, "text": "Our bank will not combine the information stored in the analysis software with any personal identity information you entered in Rong E.", "label": ["Important"], "rewrite": "Our bank will not combine the information stored in the analysis software with any personal identity information you entered."}
{"task": "rw_28.jsonl", "id": 47104, "text": "3. After collecting your personal information, our bank may identify your information and data through technical means.", "label": ["Important", "Data Security"], "rewrite": "You may use technical means to identify the information and data."}
{"task": "rw_28.jsonl", "id": 47105, "text": "The information after the identification processing will not be able to directly identify the subject of personal information. You agree that our bank will analyze and use it to identify the data.", "label": ["Important", "Usage"], "rewrite": "You agree to analyze and use the dealerized data and use it."}
{"task": "rw_28.jsonl", "id": 47106, "text": "4. In order to provide you with a better experience, our bank may be based on your identity information, transaction information, equipment information, and service logs.Portrait and user risk rating are used to show the recommended content of intelligent voice search and recommendation of investment wealth management products.", "label": ["Important", "Usage"], "rewrite": "After the information is identified, the user portrait and user risk rating based on the characteristic labels are extracted to show the recommended content of smart voice search and recommendation of wealth management products."}
{"task": "rw_28.jsonl", "id": 47107, "text": "At the same time, in order to ensure the autonomy of your receiving information, our bank also provides the display content that is not based on personalized recommendation algorithms. You can click on the \"Settings-Personalization Recommendation\" on the Rong E mobile terminal.Recommended \"option.", "label": ["Important", "Edit/Control"], "rewrite": "You can click to close the \"Personalized Recommendation\" option in the \"My-Settings-Personalized Recommendation\" on the Rong E mobile terminal."}
{"task": "rw_28.jsonl", "id": 47108, "text": "After closing personalized recommendations, intelligent voice search and investment wealth management products will not display the recommendation content.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47109, "text": "(3) Exceptions of obtaining authorization consent", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47110, "text": "According to relevant laws and regulations, regulatory requirements, and national standards, in the following circumstances, the national authority or regulatory authority requires our bank to provide, or for the purpose of fully protecting your rights and rightsIn other reasonable circumstances, our bank does not have to solicit your authorization consent:", "label": ["Important", "First Party Collection Information"], "rewrite": "According to relevant laws and regulations, regulatory requirements, and national standards, in the following situations, we do not have to solicit your authorization consent:"}
{"task": "rw_28.jsonl", "id": 47111, "text": "1. In order to establish and fulfill the contract as a party as a party, or to implement human resources management in accordance with the labor rules and regulations and collective contracts signed in accordance with the law according to law;", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to establish or fulfill the person's contract for the individual as a party, or to collect and use information necessary for human resource management in accordance with the collective contract, no need to solicit authorization."}
{"task": "rw_28.jsonl", "id": 47112, "text": "2. To fulfill the statutory duties or the requirements of the statutory volunteer;", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to fulfill the statutory duties or the collection and usage information necessary for the statutory volunteer, there is no need to solicit authorization consent."}
{"task": "rw_28.jsonl", "id": 47113, "text": "3. In order to deal with emergencies, or in urgent situations, it is necessary to protect the health and property security of natural people in emergencies;", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to cope with emergencies, or in urgent cases to protect the life and health of natural persons and the necessary collection and use information, no need to solicit authorization."}
{"task": "rw_28.jsonl", "id": 47114, "text": "4. Implement news reports and public opinion supervision in public interests, and handle personal information within a reasonable range;", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to implement news reports and public opinion supervision, deal with personal information within a reasonable scope without soliciting authorization consent."}
{"task": "rw_28.jsonl", "id": 47115, "text": "5. Treatment of personal information that individuals are disclosed or other legally disclosed within a reasonable range in accordance with the provisions of this Law;", "label": ["Important", "First Party Collection Information"], "rewrite": "In accordance with laws and regulations, personal information is processed by individuals or other legal disclosure within a reasonable range, and no authorization consent is required."}
{"task": "rw_28.jsonl", "id": 47116, "text": "6. Other circumstances stipulated in laws and administrative regulations.", "label": ["Important", "First Party Collection Information"], "rewrite": "Other collection and use information stipulated in laws and regulations does not need to solicit authorization."}
{"task": "rw_28.jsonl", "id": 47117, "text": "2. How does our trip use cookie technology", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47118, "text": "To ensure the normal operation of the service, our will store small data files named Cookie on your computer or mobile devices.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47119, "text": "Cookie usually contains identifiers, site names, and some numbers and characters.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47120, "text": "With the help of Cookie, our background server can effectively allocate the access of Rong E mobile terminals in order to provide better services.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47121, "text": "Our bank will not use Cookie for any purpose outside of the purpose of this policy.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47122, "text": "You can manage or delete Cookie according to your preferences.", "label": ["Important", "Edit/Control"], "rewrite": "You can manage or delete Cookie according to your preferences."}
{"task": "rw_28.jsonl", "id": 47123, "text": "You can clear all the cookies saved on the computer, and most of the network browsers have the function of preventing cookies.", "label": ["Important", "Edit/Control"], "rewrite": "You can remove all the cookies saved on the computer through the browser."}
{"task": "rw_28.jsonl", "id": 47124, "text": "But if you do this, you need to change the user settings when you visit our website.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47125, "text": "3. How does our trip store and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47126, "text": "(1) Storage", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47127, "text": "1. Our guild will store personal information collected and generated in the People's Republic of China in accordance with laws and regulations and regulatory requirements.", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in domestic operations will be stored in China."}
{"task": "rw_28.jsonl", "id": 47128, "text": "However, in order to handle cross -border business (such as cross -border remittances, study abroad remittances, etc.) and get your authorization consent, some of your personal information (such as the name of the remittance, address, contact number, transfer account, and the name of the payee, the name of the payee, the name of the payee,Detailed address, etc.) will be transmitted overseas as part of the transaction information.", "label": ["Data Retention", "Important"], "rewrite": "To handle cross -border business, after you have authorized consent, your personal information will be transmitted overseas as part of the transaction information."}
{"task": "rw_28.jsonl", "id": 47129, "text": "In this case, our bank will take effective measures to protect your information security. For example, data such as customer names, remittance accounts, and remittance addresses in the cross -border remittance business are protected by encrypted transmission.", "label": ["Important", "Data Security"], "rewrite": "Our bank will take measures to protect information security in cross -border business."}
{"task": "rw_28.jsonl", "id": 47130, "text": "2. Our bank only retains your personal information during the time limit for the purpose of this policy, laws and regulations and regulatory requirements, such as:", "label": ["Data Retention", "Important"], "rewrite": "Reserves your personal information within the time limit required for the service purpose, unless the law has other requirements."}
{"task": "rw_28.jsonl", "id": 47131, "text": "Mobile phone number: When you need to use Rong E line service, our bank needs to keep your mobile phone number all the time to ensure that you use the service normally. When you cancel the Rongyan account, our bank will delete the corresponding information;", "label": ["Data Retention", "Important"], "rewrite": "When you need to use Rong E line service, our bank needs to keep your mobile phone number."}
{"task": "rw_28.jsonl", "id": 47132, "text": "User avatar: When you set up your avatar, our guild has always saved your avatar for login page display.", "label": ["Data Retention", "Important"], "rewrite": "When you set the avatar, our guild has always saved your avatar for login page display."}
{"task": "rw_28.jsonl", "id": 47133, "text": "When you choose to restore the silent avatar, our bank will delete the avatar information you set;", "label": ["Data Retention", "Important"], "rewrite": "When you choose to restore the silent avatar, our bank will delete the avatar information you set."}
{"task": "rw_28.jsonl", "id": 47134, "text": "Log in to the area: When you log in, our will record the registered location information of your card as the login area to ensure that your normally uses the e -line service.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you log in, our guild records the registration information of your card as a login area."}
{"task": "rw_28.jsonl", "id": 47135, "text": "This information is deleted as the APP is uninstalled.", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47136, "text": "\"Cloud Insurance Management\" storage information: When you use the \"Cloud Insurance Management\" service,", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47137, "text": "(1) Our bank will encrypt the information stored in \"Cloud Insurance Management\" to ensure the confidentiality of information from technically;", "label": ["Important", "Data Security"], "rewrite": "When you use the \"Cloud Insurance Management\" service, our bank will encrypt the information stored in \"Cloud Insurance\"."}
{"task": "rw_28.jsonl", "id": 47138, "text": "(2) Our bank will store the information you stored in \"Cloud Insurance\", and store it through our background server to ensure the security of data and data. Even in special circumstances such as server disasterYou don't lose your data;", "label": ["Data Retention", "Important"], "rewrite": "Our bank will store the information you stored in \"Cloud Insurance\" and storage through our background server."}
{"task": "rw_28.jsonl", "id": 47139, "text": "(3) When you operate the data of \"Cloud Insurance\" independently, the data stored in our line will change simultaneously.", "label": ["Data Retention", "Important"], "rewrite": "When you operate the \"Cloud Insurance\" data independently, the data stored data will change simultaneously."}
{"task": "rw_28.jsonl", "id": 47140, "text": "If the data is deleted due to your mistakes, the data stored in our trip will be deleted simultaneously;", "label": ["Data Retention", "Important"], "rewrite": "If the data is deleted due to your mistakes, the data stored data will be deleted simultaneously."}
{"task": "rw_28.jsonl", "id": 47141, "text": "(4) The content you store in \"Cloud Insurance Management\" can only be viewed by the \"login password+face\" verification to check the editor. You should not transfer or use your account, password or borrowing others;", "label": ["Important", "Data Security"], "rewrite": "The content you stored in \"Cloud Insurance\" can only be viewed by the \"login password+face\" verification unlocking."}
{"task": "rw_28.jsonl", "id": 47142, "text": "(5) Our bank does not take any active censorship for the content of you stored in \"Cloud Insurance Management\", and the staff cannot view any content you store;", "label": ["Data Retention", "Important"], "rewrite": "Our bank does not do any active censorship in the content of \"Cloud Insurance Management\", and the staff cannot view it."}
{"task": "rw_28.jsonl", "id": 47143, "text": "(6) Our bank will not provide you with content stored in the \"cloud protection management\" without your consent, unless there is the following situations:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When our trip without your consent, I will not provide you with the content stored in the \"cloud protection management\" to the third party, unless there is the following situations:"}
{"task": "rw_28.jsonl", "id": 47144, "text": "a. In accordance with the relevant provisions of the law, or the requirements of administrative and judicial institutions, disclose to third parties or administrative or judicial institutions;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "According to the relevant provisions of the law, or the requirements of administrative and judicial institutions, disclose to third parties or administrative and judicial institutions that it may provide content to third parties."}
{"task": "rw_28.jsonl", "id": 47145, "text": "b. In emergency situations, in order to protect the rights and interests of you and the public;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Under emergencies, it may provide content to third parties for protecting the rights and interests of you and the public."}
{"task": "rw_28.jsonl", "id": 47146, "text": "c. Involved in national security;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The situation involved in national security may provide content to third parties."}
{"task": "rw_28.jsonl", "id": 47147, "text": "D. Other situations that need to be disclosed, edited or disclosed in accordance with the law.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47148, "text": "(2) Protection", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47149, "text": "1. Our bank will comply with relevant laws and regulations to take necessary measures to ensure the security of personal information to prevent personal information from being illegally accessed, copied, modified, transmitted, destroyed, processed or used by unexpected and unauthorized conditions.", "label": ["Important", "Data Security"], "rewrite": "Our travel takes necessary measures to prevent illegal access to, copying, modifying, transmitting, destruction, processing or use by accidental and unauthorized personal information."}
{"task": "rw_28.jsonl", "id": 47150, "text": "For example, information encryption storage, using encrypted technology for information transmission, de -identification processing information, database locks and other means to protect your personal information.", "label": ["Important", "Data Security"], "rewrite": "Our bank will adopt information encryption storage, use encrypted technology for information transmission, de -identifying information, database locks and other means to protect personal information."}
{"task": "rw_28.jsonl", "id": 47151, "text": "2. We establish a supporting management system, internal control mechanism, and processes to ensure your information security.", "label": ["Important", "Data Security"], "rewrite": "Our bank establishes a supporting management system, internal control mechanism and process to ensure information security."}
{"task": "rw_28.jsonl", "id": 47152, "text": "For example, strictly restricting information access permissions, system monitoring of information access and processing behavior, and requesting relevant staff to sign a confidentiality agreement, etc.", "label": ["Important", "Data Security"], "rewrite": "Establish strict restrictions on information access permissions, systematically monitor information on information access and processing behavior, and request relevant staff to sign a confidentiality agreement."}
{"task": "rw_28.jsonl", "id": 47153, "text": "3. If security incidents such as personal information leakage occur, our bank will start emergency plans to prevent the expansion of security incidents, and to inform you in a timely manner to push the incident situation to inform the subject of the personal information one by one.Our will be informing a reasonable and effective way such as announcement.", "label": ["Important", "Data Security"], "rewrite": "The relevant situation of security incidents will be informed by mail, letter, telephone, push notification, etc. When it is difficult to inform one by one, it will issue an announcement."}
{"task": "rw_28.jsonl", "id": 47154, "text": "4. The Internet environment is not 100 % security. Our bank will try to ensure the security of any information you send to my travel.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47155, "text": "If the physical, technical, or management protection facilities of our travel are damaged, the information is caused by unauthorized access, public disclosure, tampering, or destruction, resulting in damage to your legitimate rights and interests. Our bank will bear the corresponding legal responsibility.", "label": ["Important", "Data Security"], "rewrite": "Our bank will bear legal responsibility for the consequences of physical, technical, or management protection facilities."}
{"task": "rw_28.jsonl", "id": 47156, "text": "4. How can our bank share, transfer and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47157, "text": "(1) Sharing and transfer", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47158, "text": "Our bank will not share or transfer your personal information from any other companies, organizations and individuals, except for the following situations:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Our bank will not share or transfer your personal information from any other companies, organizations and individuals, except for the following situations:"}
{"task": "rw_28.jsonl", "id": 47159, "text": "1. Get your explicit consent in advance.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Get your explicit consent in advance to share and transfer your personal information."}
{"task": "rw_28.jsonl", "id": 47160, "text": "2. If the business needs to share your personal information outside and transfer your personal information, our bank will tell you the purpose of sharing and transfer personal information, the name or name of the data receiver, the type of processing method, and the type of personal informationGet your authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you need to share and transfer your personal information to the outside world, our bank will inform the purpose of enjoying and transferring personal information, the situation of the data receiver and obtain your authorization consent in advance."}
{"task": "rw_28.jsonl", "id": 47161, "text": "Involving sensitive information, our bank will also inform the type of sensitive information, the identity of the data receiver, and the data security ability of the data receiver, and obtain your explicit consent.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Our bank will also inform the type of sensitive information, the identity of the data receiver, and the data security ability of the data receiver, and obtain your explicit consent."}
{"task": "rw_28.jsonl", "id": 47162, "text": "3. Our bank may provide some basic information of your partner (push service or mobile device manufacturer), including your equipment model, the unique logo of the device (Android, ID, iOS as IDFV), device status information, network information, network information, network information, networkEquipment hardware address MAC, etc., in order to send financial service reminders and related transaction notices to your mobile devices in time.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Our bank may provide partners with part of your basic information in order to send you notifications."}
{"task": "rw_28.jsonl", "id": 47163, "text": "After your authorization consent, a third party can obtain your above personal information.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47164, "text": "4. Our bank may provide you with location -based services. Third -party location providers may collect some of your basic information based on your authorization and setting of the system positioning, including your device model and the unique logo (Android (Android (Android (Android (Android (Android (Android (Android (Android (Android (AndroidIt is Android, ID, iOS as IDFV), IMEI IMEI Ido Identity Code, and Mac address MAC, network device hardware address.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Third -party location providers may collect some of your basic information based on your authorization, including your equipment model, the unique logo of the device, IMEI IMEI, and network device hardware address MAC."}
{"task": "rw_28.jsonl", "id": 47165, "text": "After your authorization consent, a third party can obtain your above personal information.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47166, "text": "5. According to laws and regulations and business practices, in similar transactions such as mergers, acquisitions, and asset transfer in our bank, if personal information is transferred, our guild requires new companies and organizations that hold your personal information to continue to be subject to this policy.The restrictions, otherwise our bank will ask the company and the organization to re -solicit authorization to you.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When involving mergers, acquisitions, or bankruptcy liquidation, if personal information transfer is involved, it will be required to continue to be bound by the policy, otherwise it will request that it will re -solicit authorization consent."}
{"task": "rw_28.jsonl", "id": 47167, "text": "6. Please understand that our bank may share your personal information to the outside world in accordance with the provisions of laws and regulations, or in accordance with the mandatory requirements of the government authority.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Our bank may share your personal information to the outside world in accordance with the provisions of laws and regulations, or in accordance with the mandatory requirements of the government authority."}
{"task": "rw_28.jsonl", "id": 47168, "text": "Our bank will conduct strict security testing of the application interface (API) and software tool development package (SDK) that the partner obtains personal information, and strictly agreed to strict data protection measures with the partner, so that it will be based on the purpose of our bank's entrustment.Service description, this policy, and any other related confidentiality and security measures to handle personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Our bank will conduct security detection on the API and SDKs of the partner, and requires it to deal with it with the agreed data protection measures."}
{"task": "rw_28.jsonl", "id": 47169, "text": "(2) Public disclosure", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47170, "text": "1. Our bank will not publicly disclose the personal information collected to the outside world. If it must be disclosed, our bank will tell you the purpose of the public disclosure, the type of disclosure information, the type of data receiver, and the possible sensitive information involved, and obtain it, and obtain it, and obtain it, and obtain it.Your explicit consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Our bank will not disclose the personal information collected to the outside world. If you need to disclose the details you will disclose and obtain your explicit consent."}
{"task": "rw_28.jsonl", "id": 47171, "text": "2. Please understand that under the circumstances of legal, legal procedures, litigation or government authorities, our bank may disclose your personal information publicly.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "With the compulsory requirements of legal, legal procedures, litigation, or government authorities, our bank may disclose your personal information publicly."}
{"task": "rw_28.jsonl", "id": 47172, "text": "(3) Exceptions of obtaining authorization consent", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47173, "text": "According to relevant laws and regulations, regulatory requirements, and national standards, in the following circumstances, our bank may share, transfer, and openly disclose personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "According to relevant laws and regulations, regulatory requirements, and national standards, in the following circumstances, our bank may share, transfer, and openly disclose personal information."}
{"task": "rw_28.jsonl", "id": 47174, "text": "1. In order to establish and fulfill the contract as a party as a party, or to implement human resources management in accordance with the labor rules and regulations and collective contracts signed in accordance with the law according to law;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to establish or fulfill the person's contract as a party, or sharing, transfer or disclosed the need to implement human resource management in accordance with the collective contract, no authorization is required."}
{"task": "rw_28.jsonl", "id": 47175, "text": "2. To fulfill the statutory duties or the requirements of the statutory volunteer;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to fulfill the shared, transferred or disclosed by the statutory duties or the necessary sharing, transfer, or disclosure necessary for the statutory duty, no authorization is required."}
{"task": "rw_28.jsonl", "id": 47176, "text": "3. In order to deal with emergencies, or in urgent situations, it is necessary to protect the health and property security of natural people in emergencies;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to cope with emergencies, or in urgent situations to protect the health of natural people and the must -sharing, transfer or disclosure of property security, no authorization is required."}
{"task": "rw_28.jsonl", "id": 47177, "text": "4. Implement news reports and public opinion supervision in public interests, and handle personal information within a reasonable range;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to implement news reports and supervision of public opinion, the sharing, transfer or disclosure of personal information is handled within a reasonable scope without authorization."}
{"task": "rw_28.jsonl", "id": 47178, "text": "5. Treatment of personal information that individuals are disclosed or other legally disclosed within a reasonable range in accordance with the provisions of this Law;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In accordance with the provisions of this Law, handle individuals' self -disclosure or other personal information that have been legally disclosed within a reasonable scope without authorization."}
{"task": "rw_28.jsonl", "id": 47179, "text": "6. Other circumstances stipulated in laws and administrative regulations.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The sharing or disclosure of other laws and regulations and other regulations does not need to be authorized."}
{"task": "rw_28.jsonl", "id": 47180, "text": "5. How do you manage your personal information", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47181, "text": "In accordance with the relevant laws and regulations and regulatory regulations of the People's Republic of China, our bank guarantees your personal information to exercise the following rights:", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47182, "text": "(1) Visit, correct and update your personal information", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47183, "text": "You have the right, except for other regulations through the E -line access, correction, and updating your personal information.", "label": ["Edit/Control", "Important"], "rewrite": "You have the right, except for other regulations through the E -line access, correction, and updating your personal information."}
{"task": "rw_28.jsonl", "id": 47184, "text": "Before you modify your personal information, our trip will verify your identity.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47185, "text": "1. During your use of Rong E, you have the right to modify or update your personal information independently.", "label": ["Edit/Control", "Important"], "rewrite": "During your use of Rong E, you have the right to modify or update your personal information independently."}
{"task": "rw_28.jsonl", "id": 47186, "text": "Before you modify your personal information, our trip will verify your identity.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47187, "text": "You need to log in to Rong E line. After logging in, you can check and modify your basic information in \"My-Personal Information\", including modifying the avatar, mobile phone number, contact address, etc.;", "label": ["Important", "Edit/Control"], "rewrite": "After logging in, you can check and modify your basic information in \"My-Personal Information\", including modifying avatars, mobile phone numbers, contact addresses, etc."}
{"task": "rw_28.jsonl", "id": 47188, "text": "Or check and modify your relevant security settings in the \"Security Center\", such as changing third -party protocols and opening account security locks.", "label": ["Edit/Control", "Important"], "rewrite": "You can query and modify your relevant security settings in the \"Security Center\", such as changing third -party protocols and opening account security locks."}
{"task": "rw_28.jsonl", "id": 47189, "text": "Among them, for the modification of mobile phone number information, if you register a user for our electronic bank, you can enter the \"My-Personal Information-Mobile Number\" function or \"Security Center-Mobile Number Management\" after logging in to Rong Ring's mobile terminalModify the mobile phone number. After the modification is successful, you can use the new mobile phone number to log in the Rixing E line again.", "label": ["Important", "Edit/Control"], "rewrite": "You can modify the mobile phone number in the \"My-Personal Information-Mobile Number\" function or \"Security Center-Mobile phone number management\" after logging in to the mobile terminal of the Rong Ring."}
{"task": "rw_28.jsonl", "id": 47190, "text": "2. You can log in to Rong E mobile terminal, manage binding bank cards in \"My Account\", or check related transaction details through \"ICBC E Payment-Payment Details\" and \"Security Center-E Payment Safety Management\"And modify the payment password, turn on or turn off the small amount -free payment.", "label": ["Important", "Edit/Control"], "rewrite": "You can log in to the mobile terminal of Rong Ewan, manage the binding bank card in \"My Account\", or query related transaction details and modification through the \"ICBC E Payment-Payment Details\" and \"Safety Center-E Payment Security Management\"Payment password, turn or close small amount -free payment."}
{"task": "rw_28.jsonl", "id": 47191, "text": "The modification or update of our personal information will take real -time or real -time actual effects.", "label": ["Important"], "rewrite": "The modification or update of personal information will take effect in real -time or quasi -real -time."}
{"task": "rw_28.jsonl", "id": 47192, "text": "(2) Delete your personal information", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47193, "text": "In the following circumstances, you can make a request to delete personal information from our bank:", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47194, "text": "1. If our behavior of collecting and using personal information violates the provisions of laws and regulations or violates your agreement;", "label": ["Important", "Edit/Control"], "rewrite": "If our behavior of collecting and using personal information violates the provisions of laws and regulations or violates your agreement, you can apply for delete information."}
{"task": "rw_28.jsonl", "id": 47195, "text": "2. If our behavior shared and transferred personal information to a third party violates the provisions of laws and regulations or violates your agreement with you;", "label": ["Edit/Control", "Important"], "rewrite": "If our behavior shared and transferred personal information to a third party violates the provisions of laws and regulations or violates your agreement, you can apply for delete information."}
{"task": "rw_28.jsonl", "id": 47196, "text": "3. If our bank publicly discloses personal information, it violates the provisions of laws and regulations or violates your agreement;", "label": ["Important", "Edit/Control"], "rewrite": "If our bank's public disclosure of personal information violates the provisions of laws and regulations or violates your agreement, you can ask for deletion of information."}
{"task": "rw_28.jsonl", "id": 47197, "text": "4. If you no longer use our product or service, or cancel your account;", "label": ["Edit/Control", "Important"], "rewrite": "If you no longer use our products or services, or cancel your account, you can ask for delete information."}
{"task": "rw_28.jsonl", "id": 47198, "text": "5. If our trip no longer provides you with products or services, or the personal information preservation period stipulated by laws and administrative regulations has expired;", "label": ["Edit/Control", "Important"], "rewrite": "If our bank will no longer provide you with products or services, or the personal information preservation period stipulated in laws and administrative regulations has expired, you can ask for deletion of information."}
{"task": "rw_28.jsonl", "id": 47199, "text": "6. If our personal information processing purpose has been achieved, unable to achieve, or for the purpose of processing the treatment, it is no longer necessary;", "label": ["Important", "Edit/Control"], "rewrite": "If our bank has achieved the purpose of your personal information processing, it is not necessary to achieve or achieve the purpose of processing, you can ask for delete information."}
{"task": "rw_28.jsonl", "id": 47200, "text": "7. If you withdraw the authorization consent to our bank's collection of personal information;", "label": ["Important", "Edit/Control"], "rewrite": "If you withdraw the authorization consent to our bank to collect personal information, you can ask for deletion of information."}
{"task": "rw_28.jsonl", "id": 47201, "text": "8. Other circumstances stipulated in laws and administrative regulations.", "label": ["Important", "Edit/Control"], "rewrite": "Others stipulated in laws and administrative regulations can request to delete personal information."}
{"task": "rw_28.jsonl", "id": 47202, "text": "Our bank will complete the verification and processing within 15 working days from the day of receiving your application.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47203, "text": "If our bank decides to respond to your deletion request, our bank will also notify the third parties to obtain your personal information from our bank, asking them to delete them in time, unless the laws and regulations have other regulations, or these entities have obtained your independent authorization.", "label": ["Important", "Edit/Control"], "rewrite": "Our bank will also require a third party to obtain your personal information from our bank to respond to your deletion request, unless laws and regulations have other provisions, or you are authorized separately."}
{"task": "rw_28.jsonl", "id": 47204, "text": "When you delete the information from our line, our bank may not immediately delete the corresponding information in the backup system, but it will delete these information when the backup is updated.", "label": ["Important", "Risk"], "rewrite": "Delete the information you require delete in the backup update."}
{"task": "rw_28.jsonl", "id": 47205, "text": "(3) Change the scope of your authorization consent", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47206, "text": "Each business function requires some basic personal information to complete.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47207, "text": "For personal information (such as geographical location information, address book contact information, etc.) collected and used for the product and service experience, you can \"set\" in the mobile phone system according to the different brands and models of the mobile phone.Service permissions, contact human rights, dial-call permissions, etc., give or revoke your authorization consent at any time, can also be authorized through the \"my-settings-system permissions\" of the mobile terminal of the e-line.", "label": ["Important", "Edit/Control"], "rewrite": "You can give or withdrawing the authorization consent at any time by opening or closing the location service authority, reading contact human rights, dialing call permissions, etc., or through the \"Settings-System-System-System-System-System-System-System-System-System-System-System-System-SystemPermission \"authorization management."}
{"task": "rw_28.jsonl", "id": 47208, "text": "You can stop your personal information by closing some functions of melting e -line lines or refusing to provide relevant personal information when using some functions or services to obtain your personal information.", "label": ["Edit/Control", "Important"], "rewrite": "You can refuse to provide personal information by closing some functions of melting e -line lines or refusing to provide relevant personal information when using some functions or services."}
{"task": "rw_28.jsonl", "id": 47209, "text": "The above method may cause our bank or related third parties to be unable to provide you with corresponding services.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47210, "text": "(4) Profile accounts for personal information main body", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47211, "text": "If you register a user for our electronic banking, you can ask for your own electronic banking account through our counter, smart device, electronic banking channels (Rong E line desktop end, Rong E mobile terminal).", "label": ["Edit/Control", "Important"], "rewrite": "If you register a user for our electronic banking, you can cancel the electronic bank account through our counter, smart device, and electronic banking channels."}
{"task": "rw_28.jsonl", "id": 47212, "text": "After canceling the electronic bank account, your Rong E account accounts simultaneously.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47213, "text": "The way to cancel the electronic banking by the mobile terminal of the e -line of e -line is as follows:", "label": ["Important", "Edit/Control"], "rewrite": "The way to cancel the electronic banking by the mobile terminal of the e -line of e -line is as follows:"}
{"task": "rw_28.jsonl", "id": 47214, "text": "(1) Log in to cancel the electronic banking: You can start the mobile terminal of Rong E, click \"Login\" in the upper left corner, click \"Encountered a problem\"-\"Logging out Electronic Bank\" in the login pageCode, name, certificate type, certificate number, face face recognition authentication, enter the card withdrawal password of the card listing card list of melting E -line, and can cancel the electronic bank after passing the above information verification.", "label": ["Important", "Edit/Control"], "rewrite": "Log in to cancel the electronic banking: You can start the mobile terminal of Rong E, click \"Log in\" in the upper left corner, click \"Encountered a problem\"-\"Logging out of the electronic bank\" in the login page, enter the registered mobile phone number verification code and name of Rong E line., Certificate type, certificate number, face face recognition and authentication, enter the card withdrawal password of the card list of the registered card of the e -line E -line, and can cancel the electronic bank after passing the above information verification."}
{"task": "rw_28.jsonl", "id": 47215, "text": "(2) Log in to log out of electronic banks: You can start the mobile terminal of Rong E, click \"My\"-\"Settings\"-\"Logging out Electronic Bank\", after logging in to Rong E, click \"I want to cancel\"Recognize and authentication, you can cancel the electronic bank after passing the certification.", "label": ["Important", "Edit/Control"], "rewrite": "Log in to cancel the electronic banking: You can start the moving end of the Railway Ewan, click \"My\"-\"Settings\"-\"Logging out the electronic bank\", after logging in to Rong E, click \"I want to cancel\", after the face recognition certification is passed,You can cancel the electronic banking."}
{"task": "rw_28.jsonl", "id": 47216, "text": "If you are not a registered user of the electronic banking, you can choose to uninstall or stop using the Rong E mobile terminal to prevent our bank from getting your personal information.", "label": ["Important", "Edit/Control"], "rewrite": "Non -OR e -bank registered users can choose to uninstall or stop using the mobile terminal of the melting e -line to prevent personal information from obtaining it."}
{"task": "rw_28.jsonl", "id": 47217, "text": "Your behavior of canceling the electronic bank account is irreversible. Once you cancel your electronic bank account, your Railing E account will be canceled simultaneously. Our bank will no longer collect your personal information through the mobile terminal of the e -line of E and will delete the relevant relatedAll the information of your melting account account (for example, the relevant information you stored in the \"Cloud Insurance Management\" will be deleted simultaneously after the electronic bank account and the Rong Ring account are canceled).Except for regulations.", "label": ["Important", "Edit/Control"], "rewrite": "After the cancellation of the electronic bank account, the Rong E Bank account will be canceled simultaneously, no longer collect personal information through the mobile terminal of the e -line, and delete all information of the bank account of Rong E units unless laws, regulations or regulators have other requirements."}
{"task": "rw_28.jsonl", "id": 47218, "text": "Please note that when the registered users of our electronic banks only delete the Mixing E mobile terminal in the mobile phone device, our bank will not log out of your mellow E account account, and all information about your melting e -account will not delete.", "label": ["Important", "Edit/Control"], "rewrite": "Only delete the mobile terminal of the e -line, and all the information of the e -line account will not be deleted."}
{"task": "rw_28.jsonl", "id": 47219, "text": "You still need to cancel your electronic bank account to achieve the above goals.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47220, "text": "When you cancel the Railing E -Run account, it will deemed that you have withdrawn the consent of this policy, and our bank will no longer collect corresponding personal information.", "label": ["Important", "Edit/Control"], "rewrite": "Logging into the Ringxian account is deemed to be consent to this policy."}
{"task": "rw_28.jsonl", "id": 47221, "text": "But your decision to withdraw consent will not affect personal information collection based on your authorization.", "label": ["Permission Acquisition", "Important", "Risk"], "rewrite": "Withdrawal authorization will not affect personal information processing based on previous authorization."}
{"task": "rw_28.jsonl", "id": 47222, "text": "(5) Responsive your above request", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47223, "text": "To ensure safety, our bank may need to provide a written request or prove your identity in other ways.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47224, "text": "Our travel may verify your identity first, and then process your request.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47225, "text": "Under normal circumstances, our bank will complete the verification and processing within 15 working days after verifying your identity.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47226, "text": "Please understand that we do n’t support the current technical means and may bring risks to others' legitimate rights and interests, and our bank may refuse.", "label": ["Important"], "rewrite": "Our bank may refuse requests that do not support the current technical means and may bring risks to others' legitimate rights and interests."}
{"task": "rw_28.jsonl", "id": 47227, "text": "Although there are above, in accordance with relevant laws and regulations, regulatory requirements, etc., the following circumstances may not respond to your request:", "label": ["Important"], "rewrite": "Although there are above, in accordance with relevant laws and regulations, regulatory requirements, etc., the following circumstances may not respond to your request:"}
{"task": "rw_28.jsonl", "id": 47228, "text": "1. In order to establish and fulfill the contract as a party as a party, or to implement human resources management in accordance with the labor rules and regulations and collective contracts signed in accordance with the law according to law;", "label": ["Important", "Edit/Control"], "rewrite": "In order to establish and fulfill the person's contract as a party as a party, or to implement human resource management in accordance with the labor rules and regulations and collective contracts signed in accordance with the law, it may not be able to respond to your personal information request."}
{"task": "rw_28.jsonl", "id": 47229, "text": "2. To fulfill the statutory duties or the requirements of the statutory volunteer;", "label": ["Important", "Edit/Control"], "rewrite": "In order to fulfill the legal duties or the necessary volunteers, you may not be able to respond to your personal information request."}
{"task": "rw_28.jsonl", "id": 47230, "text": "3. In order to deal with emergencies, or in urgent situations, it is necessary to protect the health and property security of natural people in emergencies;", "label": ["Edit/Control", "Important"], "rewrite": "In order to cope with emergencies, or in urgent situations, it is necessary to protect your personal information request for protecting the health and property security of natural persons."}
{"task": "rw_28.jsonl", "id": 47231, "text": "4. Implement news reports and public opinion supervision in public interests, and handle personal information within a reasonable range;", "label": ["Important", "Edit/Control"], "rewrite": "For the implementation of news reports and public opinion supervision for public interests, handling personal information within a reasonable range may not respond to your request."}
{"task": "rw_28.jsonl", "id": 47232, "text": "5. Treatment of personal information that individuals are disclosed or other legally disclosed within a reasonable range in accordance with the provisions of this Law;", "label": ["Important", "Edit/Control"], "rewrite": "In accordance with the provisions of this Law, it may not be able to respond to your personal information request within a reasonable scope or other legal disclosure of personal information."}
{"task": "rw_28.jsonl", "id": 47233, "text": "6. Other circumstances stipulated in laws and administrative regulations.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47234, "text": "6. How to deal with the information of minors for our trip", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47235, "text": "Without the consent of the guardian, minors may not create their own user account.", "label": ["Specific Audiences", "Important"], "rewrite": "Without the consent of the guardian, minors may not create their own user account."}
{"task": "rw_28.jsonl", "id": 47236, "text": "If you are a minor, please read this policy carefully, and use our service to use our bank's service or provide information to our bank under the premise of obtaining your consent.", "label": ["Specific Audiences", "Important"], "rewrite": "Minors shall use our bank's service or provide information to our bank under the premise of obtaining the consent of the guardian."}
{"task": "rw_28.jsonl", "id": 47237, "text": "Our bank will only use or share your personal information when the laws and regulations and regulatory requirements are allowed, the guardian explicitly agrees or protects minors.", "label": ["Specific Audiences", "Important"], "rewrite": "Our bank will only use or share your personal information when the laws and regulations and regulatory requirements are allowed, the guardian explicitly agrees or protects minors."}
{"task": "rw_28.jsonl", "id": 47238, "text": "7. How to update this policy", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47239, "text": "Due to business needs or laws and regulations and regulatory requirements, our bank will revise this policy in a timely manner.", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47240, "text": "When this policy is changed, our bank will issue an updated version of this policy on the desktop end and mobile end of the e -line of e -line, and it will push the notification notice, pop -up window form or website announcement before changing content.Ware notify you so that you can understand the latest content of this policy in time.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47241, "text": "You know and confirm that if you do not agree with the content of this policy, you should immediately stop using Rong E line services and cancel related accounts. Our bank will stop collecting your personal information;", "label": ["Policy Change", "Important"], "rewrite": "If you do not agree with the update of this policy, you should immediately stop using the Railing E -line service and cancel related accounts."}
{"task": "rw_28.jsonl", "id": 47242, "text": "If you agree with the content of this policy and continue to use the E -E -line service, you are deemed that you have fully read, understand and accept the updated policy, and agree to collect, use, store, and share you in accordance with the updated policy.Related personal information.", "label": ["Policy Change", "Important", "Risk"], "rewrite": "You agree with the update of this policy and continue to use the E -line service, which is deemed that you accept the updated policy."}
{"task": "rw_28.jsonl", "id": 47243, "text": "8. How to contact me", "label": [], "rewrite": []}
{"task": "rw_28.jsonl", "id": 47244, "text": "If you have any opinions, suggestions or questions about this policy, you can contact our bank to contact our bank's customer service channel to contact our bank through the 95588 telephone customer service and \"My Customer Service\".Opinions, suggestions, and related issues, in general, our bank will accept and deal with it within 15 working days from the day when your problem is received.", "label": ["Important", "Contact Information"], "rewrite": "You can contact our travel channel to contact our bank through the 95588 telephone customer service, \"My Customer Service\" and other customer service channels."}
{"task": "rw_28.jsonl", "id": 47245, "text": "Company Name: Industrial and Commercial Bank of China Co., Ltd.", "label": ["Important", "Contact Information"], "rewrite": "Company Name: Industrial and Commercial Bank of China Co., Ltd."}
{"task": "rw_28.jsonl", "id": 47246, "text": "Registration address: No. 55, Fuxingmen, Xicheng District, Beijing.", "label": ["Important", "Contact Information"], "rewrite": "Registration address: No. 55, Fuxingmen, Xicheng District, Beijing."}
{"task": "rw_28.jsonl", "id": 47247, "text": "Personal information protection email address: data_protection@icbc.com.cn.", "label": ["Important", "Contact Information"], "rewrite": "Personal information protection email address: data_protection@icbc.com.cn."}
{"task": "rw_28.jsonl", "id": 47248, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
