{"task": "rw_22.jsonl", "id": 45038, "text": "Meituan Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45039, "text": "download", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45040, "text": "Meituan Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45041, "text": "Update date: March 14, 2022", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45042, "text": "Effective date: March 21, 2022", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45043, "text": "Meituan (following or \"we\") pays great attention to protecting the personal information and privacy of users (\"you\"). We know the importance of personal information to you, and will take the laws and regulations and the industry's mature security standards.Corresponding security measures to protect your personal information.", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45044, "text": "We hope to clearly introduce you how to deal with your personal information and protect you when using our products/services through this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45045, "text": "This policy will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45046, "text": "1. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45047, "text": "2. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45048, "text": "3. How can we share, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45049, "text": "4. How do we save and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45050, "text": "5. How do you manage your personal information", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45051, "text": "6. Protection of personal information of minors", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45052, "text": "7. Notification and revision", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45053, "text": "8. How to contact us", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45054, "text": "Nine, Appendix", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45055, "text": "[Special Tips] Please read and fully understand this \"Privacy Policy\" (the key content has bolded the fonts, please pay special attention to the use of the products/services we provided by us.", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45056, "text": "Once you use or continue to use our products/services, it means that you agree that we will process your relevant information in accordance with this privacy policy.", "label": ["Policy Change", "Important", "Risk"], "rewrite": "When you use or continue to use our products/services, it means to process your relevant information in accordance with this privacy policy."}
{"task": "rw_22.jsonl", "id": 45057, "text": "If you have any questions about this privacy policy, you can contact us through the way how to contact us in this privacy policy).", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45058, "text": "Meituan's product/service is the product/service provided by Beijing San Kuang Technology Co., Ltd. (registered address: 1202-34, 12th floor 1202-34, No. 27, Zhongguancun Street, Haidian District, Beijing) and its related parties provided to you through the following channels:Including but not limited to clients such as Meituan website (www.meituan.com, www.dianping.com), Meituan App/Public Review APP and other clients, as well as related WeChat open platform accounts or applets.", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45059, "text": "For certain specific products/services, we will also formulate a separate privacy policy to explain the special policies of these products/services.", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45060, "text": "If the relevant privacy policy is inconsistent with the privacy policy, the specific privacy policy is applicable.", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45061, "text": "The Meituan and its related parties referred to this policy refer to the only name or collective name of Beijing San Kuang Technology Co., Ltd., Beijing San Kuang Online Technology Co., Ltd. and the existing and/or future related related related companies.", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45062, "text": "Please note that this policy is not applicable to other third -party products/services connected by your products/services (\"Other third parties\", including your trading counterparty, any third -party website, and third -party service providerWait), please refer to the privacy policy or similar statement of the third party.", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45063, "text": "1. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45064, "text": "When you use our products/services, you need/you can choose to authorize us to collect and use personal information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45065, "text": "1. In order to provide you with the basic functions of our product/service, you need to authorize us to collect and use the necessary information. If you refuse to provide the necessary information, you will not be able to use our product/service normally;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45066, "text": "2. In order to provide you with the expansion function of our product/service, you can choose to authorize us to collect and use information. If you refuse to provide the aforementioned information, you will not be able to use related additional functions normally or to achieve the functional effects we intend to achieve, But it does not affect your basic functions of using our products/services normally.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45067, "text": "(1) You need to authorize us to collect and use personal information.", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45068, "text": "We will follow the principles of legitimate, legal, and necessary, and use your personal information for the following purposes described in this policy.", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45069, "text": "1. Help you become our user", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45070, "text": "In order to comply with the requirements of laws and regulations, and to provide you with more convenient services, when you are registered as a US group user, you need to provide at least mobile phone numbers to create Meituan account and improve the relevant network identity information (such as avatars, nicknames, nicknamesAnd login password, etc.);", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you register as a Meituan user, you need to provide mobile phone numbers to create Meituan account and improve network identification information."}
{"task": "rw_22.jsonl", "id": 45071, "text": "If you only need to use browsing, search and other functions, you don't need to register as our users and provide the above information.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can use browsing, search and other functions without registering as a user."}
{"task": "rw_22.jsonl", "id": 45072, "text": "In the process of providing account information, if you are willing to add additional personal information, it will help us provide you with more personalized services: including your gender, birthday, residence, hometown, preferences, family information, etc.Essence", "label": ["Important", "First Party Collection Information"], "rewrite": "You can add personal information such as gender, birthday, residence, hometown, etc., so that we can provide personalized services."}
{"task": "rw_22.jsonl", "id": 45073, "text": "If you do not provide such information, it will not affect your basic functions of Meituan services.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45074, "text": "If you choose to log in with a third -party account, we will obtain the account information you shared (such as avatars, nicknames, regions, gender and other information, etc.) from third parties to your Meituan account for quick login. We willAccording to the agreement with the third party, use your personal information on the premise of complied with relevant regulations.", "label": ["Important", "First Party Collection Information"], "rewrite": "When registering and logging in with a third -party account, access and collect your personal information after your authorization, and bind it."}
{"task": "rw_22.jsonl", "id": 45075, "text": "2. Provide you with geographic location -based information display", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45076, "text": "In order to provide you with the display and search service of the surrounding food, drinking, and travel information, and improve our service performance, efficiency and functions, we authorize us to collect relevant information you generate in the process of using our service, including:", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect the relevant information that you generate in the process of using our service, thinking that you provide information display and search services."}
{"task": "rw_22.jsonl", "id": 45077, "text": "(1) Location information.", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45078, "text": "When you authorize the positioning function of the mobile device with the system and use the service -based services, we will collect and use your location information to recommend the surrounding life services (for example, you do not need to enter the geographical location where you can enterRelated services, estimated the actual distance between the merchant and you facilitates you to make consumer decisions, recommend the service category and preferential information of nearby for you).", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect and use your location information to recommend your surrounding life services."}
{"task": "rw_22.jsonl", "id": 45079, "text": "Sensor information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Use IP addresses, GPS Bluetooth and base stations, sensor information and other technologies to obtain your location information."}
{"task": "rw_22.jsonl", "id": 45080, "text": "You may also contain corresponding geographical information in the information provided by the service, such as the area information set in the account information or the picture of the picture you uploaded, the geographical mark information in the video.", "label": ["Important", "First Party Collection Information"], "rewrite": "You may also contain corresponding geographical information in the information provided in the service."}
{"task": "rw_22.jsonl", "id": 45081, "text": "You can turn off the positioning service in the mobile device system to stop our collection of information on your location, but it may not be able to use the services we provide for you based on geographical location, or to achieve the expected effect of related services.", "label": ["Edit/Control", "Important"], "rewrite": "You can close the positioning service to stop our collection of information on your location."}
{"task": "rw_22.jsonl", "id": 45082, "text": "(2) Log information.", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45083, "text": "When you use the products/services we provide, we will collect information from browsing, searching, clicking, collecting, collecting, trading, after -sales, attention, sharing, release and other information as related online logs, including you, including youThe IP address, the type of browser, the language used, the version of the operating system, the date and time of access, the telecommunications operator, and the network request.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the products/services we provide, collect your browsing, search and other information as related online logs."}
{"task": "rw_22.jsonl", "id": 45084, "text": "(3) Sensor information.", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45085, "text": "When you use our product/service process, we may collect your sensor information to adapt your device status or identify your actions when you choose to participate in the event.It will be used in specific scenarios.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use our products/service, collect your sensor information to adapt to your device status."}
{"task": "rw_22.jsonl", "id": 45086, "text": "For example, in the \"sweeping\" scene, judge the dark environment through the light sensor to show you whether to choose to turn on the flash or adjust the brightness;", "label": ["Important", "First Party Collection Information"], "rewrite": "In the \"sweeping\" scenario, the dark environment is judged by light sensor in order to show whether to choose to turn on the flash or adjust the brightness."}
{"task": "rw_22.jsonl", "id": 45087, "text": "For another example, when you play videos or participate in interactive activities, adapt to the horizontal and vertical screen status of the device through sensors such as gravity, acceleration, gyroscope, etc. or show you the next interactive scenario.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you play videos or participate in interactive activities, you can adapt to the horizontal and vertical screen status through sensors such as gravity, acceleration, gyroscope."}
{"task": "rw_22.jsonl", "id": 45088, "text": "3. Provide you with reservation, ordering, order management functions", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45089, "text": "When you book/place orders, leisure and entertainment, life services, attractions, movie tickets, beautiful people, sports fitness, marriage, parent -child, pet, medical and other services such as it areInformation (name, gender, phone number, etc.), address information (such as house administration services), service preferences (such as the number of dining people, etc.), etc.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you book/place orders for food, leisure and entertainment, life services and other services on Meituan, you need to provide contact information, address information, service preferences, etc. according to the service type."}
{"task": "rw_22.jsonl", "id": 45090, "text": "You booked/placed an order ticket, train ticket, car ticket, hotel, attraction tickets, homestay travel, medical treatment, student exclusive specialty services such as mobile phone cards or visas, or you may need to be based on services such asRelevant laws and regulations and relevant parties (tickets, hotels, travel agencies, and its agents, etc.) provide your real -name identity information (including but not limited to your ID card, officer card, passport, driver's license, student ID, etc.Certificate photos, photocopies, numbers, etc.), contact information (name, gender, phone number, etc.), email address (for confirmation order information, etc.), personal photos (for first diagnosis, etc.)Contact person information and so on.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you book/order air tickets, train tickets, car tickets and other businesses on Meituan, you may need to provide your real -name identity information, contact information, email address, personal photos, etc."}
{"task": "rw_22.jsonl", "id": 45091, "text": "To show you the order information of your account and facilitate the management of your order information, we will collect the order information you generate during the use of our service.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect the order information you generated during our service, show you order information and facilitate your management of order information."}
{"task": "rw_22.jsonl", "id": 45092, "text": "In the order you generated on Meituan, you will include your identity information, contact information, itinerary information, accommodation information, payment information, etc. These are all sensitive information. Please be careful to display or provide them outside.When displaying order information, try to identify the processing on the basis of ensuring information availability.", "label": ["Important", "Data Security"], "rewrite": "Your Meituan order may include your identity information, contact information, itinerary information, accommodation information, and payment information. Please provide it with caution. We will try to identify it and display it."}
{"task": "rw_22.jsonl", "id": 45093, "text": "4. Provide you with collection, attention, sharing, and recommendation functions", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45094, "text": "In order to facilitate your management of your own preferences, find users or communities with common hobbies, get a easier access experience, and share with friends and third parties.You can also share information with third parties through functional components. We will collect the log information you generated in the use of the above functions to display, realize online management, initiate sharing, and recommend to you with common hobbies on your personal homepage.User and other.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to facilitate your management of your own preferences, you can collect/follow/join the merchant/user/tribe you are interested in sharing information with a third party. We will collect the log information generated during your use process."}
{"task": "rw_22.jsonl", "id": 45095, "text": "5. Provide you with the function of distribution, post -post, and leg running", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45096, "text": "When you use the corresponding features on Meituan involving delivery (such as takeaway delivery)/replacement (such as invoice mail)/running legs (such as help buying and helping) services, you need to provide the name of the collection/consignee's name and gender (with gender (with gender (use it with gender (use it with gender (use it with gender (use it.When the delivery staff contacts you, such as Ms. Liu, such as Ms. Liu), mobile phone number, receiving address, house number, etc., it can be facilitated that your order can be delivered and completed safely and accurately.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the corresponding features to involve distribution/post -mail/leg running service, you need to provide the name, gender, mobile phone number, receiving address, house number, etc."}
{"task": "rw_22.jsonl", "id": 45097, "text": "You can also choose to add labels (such as home, company, etc.) for common addresses, so that they can be found in the future.", "label": ["Important", "Edit/Control"], "rewrite": "You can also choose to add labels to common addresses in order to facilitate the future search and use."}
{"task": "rw_22.jsonl", "id": 45098, "text": "6. Provide you with information release functions such as writing reviews, strategies, punch cards", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45099, "text": "When you actively evaluate the merchant's products/services or publish other contents (such as sharing information, status, sign -in, strategy and other information), we will collect the information you published and show your nickname, avatar and releaseContent, etc.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect or publish other contents of the merchant's products/services, and show your nicknames, avatars and publishing content."}
{"task": "rw_22.jsonl", "id": 45100, "text": "If you choose to publish the evaluation information in anonymous way, we will not show your nickname and avatar.", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45101, "text": "7. Provide you for travel services", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45102, "text": "When you use a taxi service on Meituan, we may also collect your itinerary information. For specific information collection and use rules, please refer to the \"Meituan Taxi Privacy Policy\" in the attachment.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use a taxi and wait for travel services, we may also collect your itinerary information."}
{"task": "rw_22.jsonl", "id": 45103, "text": "When you use a bicycle service on Meituan, we may also collect your cycling information. For specific information collection and use rules, please refer to the \"Bicycle Service Privacy Policy\" in the attachment.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use a bicycle service, we may also collect your cycling information."}
{"task": "rw_22.jsonl", "id": 45104, "text": "8. Help you complete the payment", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45105, "text": "When you pay for order on Meituan, you can choose Meituan and its related parties (such as Meituan Pay) or Meituan's third -party cooperation agencies (such as WeChat Pay, QQ Wallet, Apple, Pay, Alipay and other partners) and other partners)Pay the service provided.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you pay for order, you can choose the services provided by the Meituan and its affiliates for payment."}
{"task": "rw_22.jsonl", "id": 45106, "text": "We need to collect your Meituan order information, reconciliation information and other legal requirements and share it with these cooperation agencies to confirm your payment instructions and help you complete the payment.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "We need to collect your Meituan order information, reconciliation information and other necessary information and share it with cooperation agencies to confirm your payment instructions and help you complete the payment."}
{"task": "rw_22.jsonl", "id": 45107, "text": "If the software version and hardware device you use support fingerprint or face ID payment, you can also choose to open or close the corresponding fingerprint or face ID payment function in the payment settings. We will provide the corresponding options during your payment process. At the same time, you will alsoYou can choose to pay for other methods such as passwords, SMS verification codes.", "label": ["Edit/Control", "Important"], "rewrite": "You can choose to open or close the corresponding fingerprint or face ID payment function in the payment settings."}
{"task": "rw_22.jsonl", "id": 45108, "text": "During the payment process, we only collect the verification results without collecting your fingerprint or face ID information directly.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "We only collect the verification results without collecting your fingerprint or face ID information directly."}
{"task": "rw_22.jsonl", "id": 45109, "text": "9. Provide you/display payment, loan, financial management, insurance and other financial products/services", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45110, "text": "When you use the financial product/service provided/displayed on the Meituan, we may also collect your ID information (including shadow prints), bank card information, etc. For specific information collection and useSpecific service protocol/file/rules and the \"Meituan Financial Privacy Policy\" in the attachment.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use financial products/services, we may also collect your ID information, bank card information, etc."}
{"task": "rw_22.jsonl", "id": 45111, "text": "10. Provide you with live service", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45112, "text": "When you open the live broadcast service, according to the requirements of laws and regulations, you may need to conduct real -name authentication through \"face recognition\" to verify your identity.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you open a live broadcast service, you may need to perform real -name authentication through the \"face recognition\" method to verify your identity."}
{"task": "rw_22.jsonl", "id": 45113, "text": "In the process of real -name authentication, we and third -party certification agencies that provide certification services need you to provide real names, ID numbers and facial feature value information.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "In the process of real -name authentication, you need to provide the real name, ID number and facial feature value information."}
{"task": "rw_22.jsonl", "id": 45114, "text": "This information is for the purpose stipulated in the real -name certification and laws and regulations. It will not be used as other purposes without authorization.", "label": ["Important", "Usage"], "rewrite": "Your real name, ID number and facial feature value information are only for real -name authentication and laws and regulations, and will not be used as other purposes without authorization."}
{"task": "rw_22.jsonl", "id": 45115, "text": "At the same time, it is reminded that this information is personal sensitive information. You can refuse to provide it, refuse to provide provision of the live broadcast function that may affect opening, but it will not affect the normal use of other functions of Meituan.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45116, "text": "In addition, when you use the live broadcast service, we will collect your live audio and video information and show your nickname, avatar and live information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use live broadcast services, we will collect your live audio and video information and show your nickname, avatar and live information."}
{"task": "rw_22.jsonl", "id": 45117, "text": "In order to complete the normal service of the live broadcast function, we will also ask you to authorize the camera and microphone rights.", "label": ["Permission Acquisition", "Important"], "rewrite": "In order to complete the normal service of the live broadcast function, we will also ask you to authorize the camera and microphone rights."}
{"task": "rw_22.jsonl", "id": 45118, "text": "If you refuse to provide authorization, you will not be able to use this function, but it will not affect your normal use of other functions of Meituan.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45119, "text": "11. Provide you with customer service and after -sales service", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45120, "text": "When you get in touch with our customer service, our system may record the communication records between you and the customer service, and use your account information to verify the identity;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you get in touch with customer service, the system may record your communication records and use your account information to verify your identity."}
{"task": "rw_22.jsonl", "id": 45121, "text": "When you need us to provide a customer service related to your order, we may check your relevant order information in order to give you appropriate help and processing;", "label": ["Important", "Usage"], "rewrite": "When you need a customer -related customer service, we may check your relevant order information to give you help and processing."}
{"task": "rw_22.jsonl", "id": 45122, "text": "When you need customer service to help you modify the relevant information (such as delivery address, contact information, etc.), you may also need to provide other information outside the above information to complete the modification.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you need customer service to help you modify the relevant information, you may also need to provide additional information to complete the modification."}
{"task": "rw_22.jsonl", "id": 45123, "text": "In order to ensure the service experience and processing service disputes, when you call or answer the number of the number protection (privacy) during the performance of the order, the call information of you and the rider may be recorded.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you call or answer your number protection during the performance of the order, the call information between you and the bus and riding may be recorded."}
{"task": "rw_22.jsonl", "id": 45124, "text": "The collection and use rules of the above information are as follows, or see the prompt content in the order page.", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45125, "text": "(1) After authorization, when you have a service dispute with the merchant and the rider, the platform can retrieve and use recording information as the basis for the reference of the dispute.", "label": ["Important", "Usage"], "rewrite": "After authorization, when you have a service dispute with the merchant and the rider, the platform can retrieve and use recording information as a reference for resolving disputes."}
{"task": "rw_22.jsonl", "id": 45126, "text": "(2) The platform will effectively ensure the privacy and security of the two parties. The recording will be uploaded to the Meituan server to save, and all parties cannot download, retrieve or play recording by themselves;", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "The call recording of you and the merchant will be uploaded to the Meituan server to save, and all parties cannot download, retrieve or play recording by themselves."}
{"task": "rw_22.jsonl", "id": 45127, "text": "Except for the following circumstances, the platform will not provide the recording to anyone (including the master of the call, the name of the call): a.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Except for the following circumstances, the platform will not provide the recording to anyone: a. The authority has the right to retrieve it according to legal procedures;"}
{"task": "rw_22.jsonl", "id": 45128, "text": "b. The recording of the legal documents issued by the judicial organs was retrieved according to law.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45129, "text": "(3) After 7 days of preservation, the recording will automatically delete permanently. In case of bad reviews, complaints, disputes that have not been completed, the platform will appropriately extend the periodic of the recording preservation.", "label": ["Data Retention", "Important"], "rewrite": "After 7 days of preservation, the recording will automatically delete permanently. If there are poor reviews, complaints, disputes that have not been handled, etc., the preservation period is appropriately extended."}
{"task": "rw_22.jsonl", "id": 45130, "text": "12. Provide you with security guarantee", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45131, "text": "In order to ensure your account security, transaction security, and system operation security, to meet the requirements of laws and regulations and our agreement rules, in the process of accessing and using our products/service, you will obtain your device information, network information, network information, network information, network information, networkStatus information, including the device model, hardware serial number, device MAC address, unique device recognition code (such as IMEI/Android/IDFA/Openudid/Guid/OAID, SIM card IMSI, ICCID information and other device identifiers),Software characteristics such as mobile application list, WIFI status, telecommunications operator and other software.", "label": ["Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "In the process of visiting and using our products/service, you authorize us to obtain your equipment information and network status information."}
{"task": "rw_22.jsonl", "id": 45132, "text": "Without your authorization, we will not obtain the above information in advance.", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45133, "text": "In order to improve the security of the services you provide, and to prevent fraud and Trojan virus more accurately, we may use or integrate your personal information, as well as our related parties and partners to obtain information you authorize or shared according to law.Based on your habits and common software information, you can comprehensively judge your account number and transaction risk, including verifying your identity, preventing, discovering, and investigating possible security risks such as fraud, network virus, and cyber attacks that violate us or related party agreements,Policies or rules to protect the legitimate rights and interests of you, other users, or we or related parties, and record some links (\"url\") that we think are risky.", "label": ["Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "We may use or integrate your personal information and information that you authorize or shared according to law to improve the security of the service."}
{"task": "rw_22.jsonl", "id": 45134, "text": "13. We may collect personal information indirectly", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45135, "text": "In order to complete the identity verification, ensure account security, confirm the status of transaction and provide you with after -sales and dispute resolution, we may obtain your personal information from a third party after you authorize (such as the transaction objects and transactions you choose directly involved directly involved directly involvedThe third -party information system, payment institutions, etc. The transactions, payment, ticketing, hotel booking, takeaway booking and other information related to the progress of transaction progress in order to facilitate us to handle your order and ensure the smooth completion of the service, or better better wayPreventing malicious behaviors such as fraud and ordering).", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to complete the identity verification, ensure account security, confirm the status of transaction and provide you with the purpose of after -sales and dispute resolution, we may obtain your personal information from a third party after authorization."}
{"task": "rw_22.jsonl", "id": 45136, "text": "In accordance with the requirements of the laws and regulations and the agreement with the third party, after you have authorized, you will get your relevant information from the related parties and partners of the Meituan, and use your information to confirm the legitimacy of the source of the information.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "After you have authorized, you can get your relevant information from the related parties and partners of Meituan, and use your information to confirm the legitimacy of the source of the information."}
{"task": "rw_22.jsonl", "id": 45137, "text": "(2) You can choose to authorize us to collect and use personal information.", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45138, "text": "In order to provide you with personalized and convenient services, you can choose to use the expansion function we provide. We will collect and use the following information in accordance with the laws and regulations and the following information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45139, "text": "This kind of information will be collected in the specific functions and business scenarios you choose. If you do not provide this information, it will not affect your basic functions.", "label": ["Important", "First Party Collection Information"], "rewrite": "The information required for the expansion function will be collected in the specific functions and business scenarios you choose."}
{"task": "rw_22.jsonl", "id": 45140, "text": "1. Expansion function based on camera authorization", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45141, "text": "You can choose to turn on the system of the system, authorize Meituan to visit your camera by using the functions of taking pictures, recording videos, scanning code, so that you can publish content \"sweeping\", or by taking photos or recording videos, etc.If you need to record and publish sound videos, you need to turn on the microphone right.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "\"Cleaning\", or publishing the content by posing by taking photos or recording video, you need to turn on the camera permission, recording and publishing sound videos need to turn on microphone permission."}
{"task": "rw_22.jsonl", "id": 45142, "text": "You can also click the authorized flash when scanning the code (simple flash information does not belong to personal information) so that you can better scan the code when the light is dim.", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45143, "text": "You can close the camera function in the system permissions. Once you close it, you may not be able to achieve the code scanning function, or you cannot review or interact with the pictures, videos and other methods, but it will not affect your basic functions that enjoy the service of Meituan.", "label": ["Important", "Edit/Control"], "rewrite": "You can close the camera function in the system permissions."}
{"task": "rw_22.jsonl", "id": 45144, "text": "2. Expansion function based on album authorization", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45145, "text": "You can choose to open the system of the system (storage permissions in some models), and authorize us to access your album through actively uploading pictures, videos, etc., so that you can publish content by uploading photos or uploading videos.", "label": ["Permission Acquisition", "Important"], "rewrite": "Open the system's album permissions so that you can publish content through uploading photos or uploading videos."}
{"task": "rw_22.jsonl", "id": 45146, "text": "We will collect the above information you choose to upload. You can close it in the system permissions. Once you close it, you may not be able to replace the avatars and publish a picture review by uploading pictures, videos, etc., but it will not affect youEnjoy the basic functions of Meituan services.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45147, "text": "3. Development function based on microphone authorization", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45148, "text": "You can choose to turn on the system of microphone and use voice technology to achieve voice interaction functions such as voice search and smart order.", "label": ["Permission Acquisition", "Important"], "rewrite": "You can choose to turn on the system's microphone permission to use voice technology to achieve voice interaction functions such as voice search and smart order."}
{"task": "rw_22.jsonl", "id": 45149, "text": "We will collect the voice information you entered in the process of using intelligent voice technology for machine recognition, online interaction and meet your needs for searching or ordering (for example, you are using the \"smart order\" function of Meituan takeawayWhen \"holding and talking\" function, we will search, display and place orders according to your needs).", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect the voice information entered in the process of using intelligent voice technology for machine recognition, online interaction and meet your needs for search or ordering."}
{"task": "rw_22.jsonl", "id": 45150, "text": "You can close this function in the system permissions. Once you close it, you may not be able to achieve online voice interactive function, but it will not affect your basic functions of enjoying the service of Meituan.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45151, "text": "4. Expansion function based on address book authorization", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45152, "text": "You can authorize the address book to use our service to create communication and sharing functions, and allow Meituan to obtain the address book information and public information (avatar, nickname, etc.) in your mobile phone or other third -party social platforms, so that you and your address book will beThe contact person who also authorizes the opening of this function can share the relevant content (avatar, nickname, evaluation information, etc.) on Meituan to achieve interactive functions.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can authorize the address book to use our service to create communication and sharing functions to achieve interactive functions."}
{"task": "rw_22.jsonl", "id": 45153, "text": "You can also authorize us to read your address book information to book services for others without having to manually enter it, such as making mobile phone bills for others to recharge.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can authorize us to read your address book information to book services for others without having to manually enter it."}
{"task": "rw_22.jsonl", "id": 45154, "text": "You can close this function in the system permissions. Once you close it, you may not be able to achieve an interactive function based on the address book, but it will not affect your basic functions of enjoying the service of Meituan.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45155, "text": "5. Development function based on friends recommended", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45156, "text": "We may also recommend you friends or recommend you to your friends or recommend you to other users based on your authorized address book information, equipment information, friends relationships, and log information to help you expand your social circle.", "label": ["Important", "Usage"], "rewrite": "It may be based on your authorized address book information, device information, friends relationship, log information to recommend friends or recommend you to other users."}
{"task": "rw_22.jsonl", "id": 45157, "text": "You can turn off or lift the relationship between friends in privacy settings, or you can manage the scope of the viewing of others (such as people who follow, fans, nicknames displayed when sharing).", "label": ["Important", "Edit/Control"], "rewrite": "You can turn off or lift your friend relationship in privacy settings, or you can manage the scope of viewing others."}
{"task": "rw_22.jsonl", "id": 45158, "text": "Once you close it, you may not be able to share and communicate with your friends in Meituan, but it will not affect your basic function of enjoying the service of Meituan.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45159, "text": "6. Expansion function based on calendar authorization", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45160, "text": "When you use live subscriptions, list release, schedule reminder, spike activity reminder, sign -in reminder and other functions, we will apply for your device calendar authority.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use live subscriptions, list release, schedule reminder, spike activity reminder, sign -in reminder and other functions, we will apply for your device calendar authority."}
{"task": "rw_22.jsonl", "id": 45161, "text": "After you start the relevant permissions, we will access your calendar to help you make an appointment or adjust the reservation live subscription, list release booking, itinerary reminder, spike activity reminder, and sign -in reminder.Remind you.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "After you start the relevant permissions, we will access your calendar to help you make an appointment or adjust the time you have reserved."}
{"task": "rw_22.jsonl", "id": 45162, "text": "Rejecting authorization will not be able to use the appointment service, but it will not affect the normal use of other functions of Meituan.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45163, "text": "7. Expansion function based on exercise and fitness authorization", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45164, "text": "When you use the step statistics, make money by walking, find a car, find a car, find a car point, we will apply for your exercise and fitness permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use the step statistics, make money by walking, find a car, find a car, find a car point, we will apply for your exercise and fitness permissions."}
{"task": "rw_22.jsonl", "id": 45165, "text": "After you turn on the relevant permissions, we will access your exercise and fitness permissions to help you complete the number of step statistics, walking to make money, riding a car, finding a car point, and other functions.", "label": ["Important", "Usage"], "rewrite": "We will access your exercise and fitness authority to help you complete the number of steps statistics, walking to make money, riding a car, and finding a car point."}
{"task": "rw_22.jsonl", "id": 45166, "text": "Refusaling will not be able to use the above services, but it will not affect the normal use of other functions of Meituan.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45167, "text": "8. Expansion function based on shear -based authorization", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45168, "text": "In the case of sharing or receiving information, participating in activities, we need to visit your scissor permissions locally to read the passwords, sharing codes, and links contained in it to achieve jumping, sharing, activity linkage, etc.Function or service.", "label": ["Important", "First Party Collection Information"], "rewrite": "Visit your scissors permissions and read the passwords, sharing codes, and links contained in it to achieve functions or services such as jumping, sharing, and activity linkage."}
{"task": "rw_22.jsonl", "id": 45169, "text": "We will upload our server only when the contents of the shear board belong to the US group jumping, sharing, and activity linkage.", "label": ["Data Retention", "Important"], "rewrite": "Only when the contents of the shear plate are identified locally belonging to the instructions of Meituan jumping, sharing, and activity linkage, the server will be uploaded."}
{"task": "rw_22.jsonl", "id": 45170, "text": "In addition, we will not upload other information about your cut plate to our server.", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45171, "text": "The system of some mobile phone devices prompts the application (APP) to read the shear plate, but the system prompts that it cannot be distinguished or uploaded by local processing or uploading, and due to the differences in statistical methods, the possibility of misunderstanding is not ruled out.", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45172, "text": "Therefore, if you find similar prompts and have questions, please contact us so that we can locate the problem.", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45173, "text": "(3) Others", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45174, "text": "You can book various products/services for others through Meituan and provide information about the actual service receiver. Earlier, please make sure that you have obtained the authorization of the relevant person.", "label": ["Important", "First Party Collection Information"], "rewrite": "When booking various products/services for others, the actual service of the actual service is required to receive the relevant information of the person."}
{"task": "rw_22.jsonl", "id": 45175, "text": "If we use other purposes that the information is not stated in this policy, or the information collected based on specific purposes for other purposes, it will solicit your authorization consent alone.", "label": ["Important", "Data Security", "Usage"], "rewrite": "If we use other purposes that the information is not stated in this policy, or the information collected based on specific purposes for other purposes, it will solicit your authorization consent alone."}
{"task": "rw_22.jsonl", "id": 45176, "text": "(4) Exception of consent", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45177, "text": "Please know that in the following situations, we do not need to obtain your authorization consent if we collect or use personal information:", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In the following circumstances, we do not need to obtain your authorization consent if we collect or use personal information:"}
{"task": "rw_22.jsonl", "id": 45178, "text": "1. In order to establish and fulfill the contract as a party as a party, or to implement human resources management in accordance with the labor rules and regulations and collective contracts signed in accordance with the law in accordance with the law;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to establish and fulfill the contract as a party as a party, or to implement the collection and use information necessary for human resource management in accordance with the laws and regulations formulated in accordance with the law and the collective contract signed in accordance with the law, there is no need to solicit authorization."}
{"task": "rw_22.jsonl", "id": 45179, "text": "2. In order to fulfill the statutory responsibility or the requirements of the legal volunteer;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to fulfill the statutory duties or the collection and usage information necessary for the statutory volunteer, there is no need to solicit authorization consent."}
{"task": "rw_22.jsonl", "id": 45180, "text": "3. In order to cope with emergencies, or in urgent situations, it is necessary to protect the health and property safety of natural people in emergency;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to cope with emergencies, or in urgent cases to protect the life and health of natural persons and the necessary collection and use information, no need to solicit authorization."}
{"task": "rw_22.jsonl", "id": 45181, "text": "4. Implement news reports and public opinion supervision for public interests, and handle personal information within a reasonable range;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "For public interests to implement news reports and public opinion supervision, and handle personal information within a reasonable scope, there is no need to solicit authorization consent."}
{"task": "rw_22.jsonl", "id": 45182, "text": "5. Treatment of personal information that individuals are disclosed or other legally disclosed in accordance with the provisions of this Law;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In accordance with the provisions of this Law, handle individuals' self -disclosure or other personal information that have been legal and disclosed within a reasonable range, without requiring authorization consent."}
{"task": "rw_22.jsonl", "id": 45183, "text": "6. Other circumstances stipulated in laws and regulations.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Other collection and use information stipulated in laws and regulations does not need to solicit authorization."}
{"task": "rw_22.jsonl", "id": 45184, "text": "Please note that it is not personal information that cannot be recognized or unable to identify your identity or directly establish contact with you alone.", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45185, "text": "If we will be unable to connect with any specific individuals to combine with other information to identify the personal identity of natural people, or use it with personal information, such information will be regarded as personal information during the combination of use.", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45186, "text": "(5) Use rules of personal information", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45187, "text": "In order to meet your personalized needs and maintain and improve our product or service quality, we will use the following information in accordance with the laws and regulations and according to your specific authorization:", "label": ["Usage"], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45188, "text": "1. We may collect your order information, browsing and searching information, behavioral preferences (such as the dietary habits, dining environment requirements, travel plans, common passengers/hotel/car rental information, flight compartment, luggage and ticket optionsFor information), location information, etc., and combining the information provided by your service on a certain service on the Meituan, comprehensively statistics and analysis to form user portraits to recommend or displayProduct/service information you may be interested in, or show you personalized third -party promotion information through the system.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your order information, browsing and searching information, behavioral preferences, location information, etc., and conduct comprehensive statistics and analysis to form user portraits and are used for personalized recommendations."}
{"task": "rw_22.jsonl", "id": 45189, "text": "Including push message notifications to you on the APP page, provide you with intelligent recommendations. Through SMS, APP, email, etc. to send you push messages, promote information or display commercial advertisements, provide you with a telephone return, provide you with information consulting or other services or information consultationInvite you to participate in customers related to services, products or functions.", "label": ["Usage"], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45190, "text": "For example, the information collected when you use our service to show you personalized content or advertisements to you in another service.", "label": ["Important", "Usage"], "rewrite": "Use the information collected when using a service to show you personalized content or advertisements to you in another service."}
{"task": "rw_22.jsonl", "id": 45191, "text": "2. We may collect the information you provided to us when participating in the product/service survey, as well as the relevant information provided by your related parties and our partners, so that you can track the order situation and initiate user complaints to launch user complaintsAnd we optimize the quality and process of customer service.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect the information provided by you when participating in the product/service survey, so that you can track the order situation and initiate user complaints."}
{"task": "rw_22.jsonl", "id": 45192, "text": "3. We may use the personal information collected in the business to statistical analysis and improvement operations, and use information that has been identified and cannot recognize your identity and cannot be restored to establish a database and commercialize.", "label": ["Important", "Usage"], "rewrite": "Personal information collected in the business may be used for statistical analysis and improvement of operations, and anonymous personal information is used to establish databases and commercialize."}
{"task": "rw_22.jsonl", "id": 45193, "text": "For example, statistical analysis is performed through your location, preferences, etc., so as to improve our product, service or marketing plan;", "label": ["Important", "Usage"], "rewrite": "Once your location, preferences, etc., statistical analysis and improvement of products, services or marketing plans."}
{"task": "rw_22.jsonl", "id": 45194, "text": "Another example is the technical transformation, network maintenance, failure elimination, internal policy and process formulation, and generating internal reports carried out for improvement of our system.", "label": ["Usage"], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45195, "text": "(6) Equipment rights adjustment", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45196, "text": "In order to ensure the normal implementation of the relevant business functions, we need to call the corresponding permissions according to the specific use scenarios, and inquire with you before calling. Please refer to the table below for specific authority calling instructions:", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45197, "text": "Meituan permissions list", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45198, "text": "You can select the closing part or all permissions in the setting of the device, which may cause the corresponding business functions to be unable to achieve or achieve the expected effect.", "label": ["Edit/Control", "Important"], "rewrite": "You can select the closing part or all permissions in the settings of the device."}
{"task": "rw_22.jsonl", "id": 45199, "text": "2. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45200, "text": "(1) Use of cookies", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45201, "text": "In order to ensure the normal and efficient operation of the website, get a easier access experience for you, and recommend the content you may be interested in, we will store small data files named Cookie on your device terminal/system.", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45202, "text": "Cookie will help you call your information when visiting our website in follow -up, simplify your process of filling in your personal information (such as one -click login, etc.);", "label": ["Important", "Usage"], "rewrite": "Cookie is used to simplify the process."}
{"task": "rw_22.jsonl", "id": 45203, "text": "Provide you with a preference for safe shopping;", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45204, "text": "Help you optimize the selection and interaction of advertising;", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45205, "text": "Protect your data security and so on.", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45206, "text": "We will not use Cookie for any purpose except the purpose of this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45207, "text": "You can manage or delete according to your preferences, cookies.", "label": ["Important", "Edit/Control"], "rewrite": "You can manage or delete Cookie according to your preferences."}
{"task": "rw_22.jsonl", "id": 45208, "text": "You can remove all the cookies saved on your computer or mobile device, and you have the right to accept or refuse cookies.", "label": ["Important", "Edit/Control"], "rewrite": "You can remove all the cookies saved on your computer or mobile device, and you have the right to accept or refuse cookies."}
{"task": "rw_22.jsonl", "id": 45209, "text": "Most browsers will automatically accept cookies, but you can usually modify the browser settings according to your needs to reject cookies;", "label": ["Important", "Edit/Control"], "rewrite": "You can modify the browser settings according to your needs to reject cookies."}
{"task": "rw_22.jsonl", "id": 45210, "text": "In addition, you can also remove all Cookie stored in the software.", "label": ["Important", "Edit/Control"], "rewrite": "You can remove all the cookies stored in the software."}
{"task": "rw_22.jsonl", "id": 45211, "text": "But you may not fully experience some convenience and security service functions.", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45212, "text": "(2) The use of network beacon and similar technologies", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45213, "text": "In addition to Cookie, we often include other similar technologies such as electronic images (called \"single pixels\" GIF files or \"network Beacon\") on the webpage. They can help the website calculate the users of webpages or access certain cookies.", "label": ["Important", "First Party Collection Information"], "rewrite": "Similar cookies can help websites to calculate users on webs or access certain cookies."}
{"task": "rw_22.jsonl", "id": 45214, "text": "We use the network beacon method::", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45215, "text": "1. We use the network beacon on our website, calculate the number of user access, and access the Cookie identification registered users by accessing Cookie.", "label": ["Important", "First Party Collection Information"], "rewrite": "Use the network Beacon to calculate the number of user access and access the Cookie identification registered users by accessing Cookie."}
{"task": "rw_22.jsonl", "id": 45216, "text": "2. We can provide personalized services on our website through the cookie information we get.", "label": ["Important", "First Party Collection Information"], "rewrite": "Provide personalized services by obtained cookie information."}
{"task": "rw_22.jsonl", "id": 45217, "text": "3. How can we share, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45218, "text": "(1) Sharing", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45219, "text": "When we provide products/services to you, we will take strict security measures. We will not share your personal information with any company, organization and personal information other than Meituan in the product/service we have completed.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not share your personal information with any company, organization, and individuals other than Meituan in the products/services we have completed."}
{"task": "rw_22.jsonl", "id": 45220, "text": "But please know that most of the products/services we provide cannot be completed alone, so we may share or entrust them to handle some of your personal information with our related companies and other partners to ensure and optimize usThe product/service provided for you, this situation includes:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share or entrust them to process some of your personal information to ensure service provision."}
{"task": "rw_22.jsonl", "id": 45221, "text": "1. Provide platform services.", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45222, "text": "We may provide you with products/services as an e -commerce platform. If you use the products/services provided by merchants or other partners on our platform, we may share your necessary personal information with the corresponding product/service provider, So that you can use the corresponding browsing, ordering, trading, payment and other functions normally.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "As an e -commerce platform, we may share your necessary personal information with the supplier of the corresponding product/service, so that you can use functions such as browsing, ordering, trading, payment, etc."}
{"task": "rw_22.jsonl", "id": 45223, "text": "2. Provide unified management services.", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45224, "text": "If you log in and use our account to log in and use the products/services provided by our affiliated companies and other third parties, we may share your personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you log in to our account and use the product/services provided by the third party, we may share your personal information."}
{"task": "rw_22.jsonl", "id": 45225, "text": "We will only share the necessary personal information in order to provide you with consistent services and unified management, such as checking orders and managing in our products/services.The purpose will once again solicit your authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will only share the necessary personal information in order to provide you with consistent services and unified management, and change the purpose of use will solicit your authorization consent again."}
{"task": "rw_22.jsonl", "id": 45226, "text": "3. Provide necessary cooperation services.", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45227, "text": "In order to achieve the purpose of this policy, some of our services will be provided by business partners.", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45228, "text": "To ensure the successful completion of the services provided for you, we may share your personal information with our partners, including suppliers, service partners, and third -party merchants in distribution business, technical services, payment services, financial business services, etc.It may include your contact information, order information, payment information, address information, etc.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share your personal information with our partners in order to complete the service."}
{"task": "rw_22.jsonl", "id": 45229, "text": "For example, when you use our takeaway service, we must share your orders and distribution information with distribution service partners to ensure the safe and accurate delivery of the order;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We share your orders and distribution information with distribution service partners to ensure the safe and accurate delivery of takeaway orders."}
{"task": "rw_22.jsonl", "id": 45230, "text": "Another example is we need to share your order number and order amount with a third -party payment institution to achieve confirmation of your payment instructions and complete the payment;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We need to share your order number and order amount with third -party payment institutions to achieve confirmation of your payment instructions and complete payment."}
{"task": "rw_22.jsonl", "id": 45231, "text": "Share your order information and necessary transaction information with third -party merchants so that they can provide you with goods, services and after -sales.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We share your order information and necessary transaction information with third -party merchants so that they can provide you with goods, services and after -sales."}
{"task": "rw_22.jsonl", "id": 45232, "text": "Among them, your contact information and address information are personal sensitive information. We will strive to protect your personal information by taking appropriate measures such as \"number protection\" and \"hiding\" on documents.", "label": ["Important", "Data Security"], "rewrite": "By adopting appropriate measures such as \"number protection\" and \"hiding\" on documents, we will do their best to protect your personal information."}
{"task": "rw_22.jsonl", "id": 45233, "text": "4. Safe security and optimization services.", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45234, "text": "In order to ensure your safety when using our products/services and optimize our services, we may share your necessary information with our relevant partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share your necessary information with our relevant partners to ensure service security and optimize services."}
{"task": "rw_22.jsonl", "id": 45235, "text": "Safety guarantee service.", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45236, "text": "In order to ensure your account security and avoid risks such as fraud, network virus, and cyber attacks, we may use partners to share with our security guarantee partnersSoftware information and other to comprehensively judge your account number and transaction risk to prevent the occurrence of security incidents.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share your necessary device information, log information, and your usage habits and common software information with your partners to ensure your account security and prevent security incidents."}
{"task": "rw_22.jsonl", "id": 45237, "text": "Statistics and optimization services.", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45238, "text": "After authorization, we may share information with partners who provide advertising promotion and statistical analysis. It is used to analyze the above information and provide advertising exposure monitoring or service decisions to provide you with better serviceEssence", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share information with advertising partners for its gathering analysis of information and provide advertising exposure monitoring or service decisions."}
{"task": "rw_22.jsonl", "id": 45239, "text": "But we will only provide information such as the coverage, effectiveness, and statistical categories of advertising promotion to these partners without sharing personal information that can identify your identity, otherwise we will identify this information to avoid your identity to your identity.Identification.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We only provide advertising partners with information such as advertising promotion, validity, and statistics, without sharing personal information that can identify identity."}
{"task": "rw_22.jsonl", "id": 45240, "text": "5. Secondary check service.", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45241, "text": "The secondary inspection service of the mobile phone number in this business is provided by a third -party China Telecom operator, China Unicom operator, and Chinese mobile operators. To ensure your account security, we may put your mobile phone number and mobile phone number in Meituan Meituan.The binding time (accurate to the sky) is provided to such service providers.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The second -time inspection service of the mobile phone number is provided by a third -party Chinese telecommunications operator, China Unicom operator, and Chinese mobile operators."}
{"task": "rw_22.jsonl", "id": 45242, "text": "6. Provided based on statutory situations.", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45243, "text": "In accordance with the provisions of laws and regulations, the need for litigation disputes, the relevant agreements you signed with us (including the electronic agreement and platform rules signed online) or legal documents, or when the administrative, judicial authorities have the right to make requirements in accordance with the law, we may shareYour personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In accordance with the provisions of laws and regulations, the need for litigation disputes, the relevant agreements or legal documents you signed with us, or the administrative, judicial authorities such as administrative, judicial authorities, etc., we may share your personal information."}
{"task": "rw_22.jsonl", "id": 45244, "text": "7. In addition to the above situations, if we share your personal information for any other companies, organizations, and individuals, we will solicit your clear consent or authorization again.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "In addition to the above situations, if you share your personal information for any other companies, organizations, and individuals, you will solicit your clear consent or authorization again."}
{"task": "rw_22.jsonl", "id": 45245, "text": "We will use the application interface (API), software tool development package (SDK) to share the necessary data sharing with third parties. Different versions of third -party SDKs will be different, generally including third -party account login, sharing, third -partyPayment category, map navigation category, manufacturer push, statistical categories, etc., we will conduct strict security testing and agreed data protection measures for third parties.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will share the necessary data sharing with third parties through application interfaces and software tool development packages."}
{"task": "rw_22.jsonl", "id": 45246, "text": "Meituan and third -party share personal information list", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45247, "text": "Please know that we will only share your personal information for legal, correct, necessary, specific, and clear purposes. For companies, organizations, and individuals that shared personal information for us to realize the purpose of this policy, we, weIt will sign strict information protection and confidentiality agreement with them, asking them to abide by the agreement and take relevant security measures to protect your personal information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will only share your personal information for legal, correct, necessary, specific, and clear purposes, and sign information protection and confidentiality agreements with the shared party."}
{"task": "rw_22.jsonl", "id": 45248, "text": "(2) Transfer", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45249, "text": "With the development of our business, we and our affiliated parties may conduct merger, acquisition, reorganization, asset transfer or similar transactions. If the transfer of personal information, we will ask companies and organizations that give your personal information to continue to acceptThe constraints of this privacy policy, otherwise, we will ask the company and the organization to solicit your authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "When involving mergers, acquisitions, or bankruptcy liquidation, if personal information transfer is involved, it will be required to continue to be bound by the policy, otherwise it will request that it will re -solicit authorization consent."}
{"task": "rw_22.jsonl", "id": 45250, "text": "Except for the above situations, we will not transfer your personal information without your clear consent.", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45251, "text": "(3) Public disclosure", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45252, "text": "We will only disclose your personal information only under the following circumstances and adopt the premise that we meet the industry standards:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only disclose your personal information only under the following circumstances and adopt the premise that we meet the industry standards:"}
{"task": "rw_22.jsonl", "id": 45253, "text": "1. According to your needs, disclose the personal information you specified under your clear consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "According to your needs, disclose your personal information you specified under the disclosure of your clear consent."}
{"task": "rw_22.jsonl", "id": 45254, "text": "2. When the requirements of laws and regulations, mandatory administrative law enforcement or judicial requirements must provide your personal information, we may disclose your personal information according to the types of personal information and disclosure required.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In accordance with the requirements of laws and regulations, mandatory administrative law enforcement or judicial requirements that must provide your personal information, we may disclose your personal information publicly."}
{"task": "rw_22.jsonl", "id": 45255, "text": "Under the premise of compliance with laws and regulations, when we receive a request for the above disclosure information, we ask we must issue corresponding legal documents such as tickets or investigation letters.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When we receive a request to disclose the information required by the authority, we ask we must issue corresponding legal documents."}
{"task": "rw_22.jsonl", "id": 45256, "text": "Please note that when you use our service, you voluntarily publish or even publicly shared information may involve your personal information and even personal sensitive information, such as your transaction information, and you choose to upload texts containing personal information when evaluatingVarious forms of information such as pictures or videos.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The information you voluntarily publish or even publicly shared may involve your personal information and even personal sensitive information of you or others."}
{"task": "rw_22.jsonl", "id": 45257, "text": "When using our services, please consider whether to publish or even share relevant information.", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45258, "text": "(4) Sharing, transfer, and public disclosure of disclosure of personal information.", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45259, "text": "In the following circumstances, sharing, transfer, and publicly disclose your personal information without obtaining your authorization consent in advance:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the following circumstances, sharing, transfer, and publicly disclose your personal information without obtaining your authorization consent in advance:"}
{"task": "rw_22.jsonl", "id": 45260, "text": "1. It is related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The sharing or disclosure directly related to national security and national defense security does not require authorization."}
{"task": "rw_22.jsonl", "id": 45261, "text": "2. Related to public safety, public health, and major public interests;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Sharing or disclosure directly related to public safety, public health and major public interests does not need to be authorized."}
{"task": "rw_22.jsonl", "id": 45262, "text": "3. It is related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Sharing or disclosure related to criminal investigation, prosecution, trial, and judgment execution does not need to be authorized."}
{"task": "rw_22.jsonl", "id": 45263, "text": "4. For major legitimate rights and interests such as maintaining your or other individuals, but it is difficult to get my consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Out of the major legitimate rights and interests of the life and property of the subject of personal information or other individuals, it is difficult to get shared or disclosed by my consent, and there is no need to solicit."}
{"task": "rw_22.jsonl", "id": 45264, "text": "5. Other situations that safeguard public interests, such as your credit evaluation information needs to be public/shared;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Other sharing, transfer or disclosure of public interests do not need to be authorized."}
{"task": "rw_22.jsonl", "id": 45265, "text": "6. Personal information that you disclose to the public by yourself;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Sharing, transfer or disclose personal information that you disclose to the public yourself without authorization."}
{"task": "rw_22.jsonl", "id": 45266, "text": "7. Collect personal information from legal public information, such as legal news reports and government information disclosure.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you collect personal information from the legal and public information, you do not need to solicit authorization, but you clearly refuse or processed the information to infringe your major interests."}
{"task": "rw_22.jsonl", "id": 45267, "text": "But you clearly reject or deal with this information that infringes your major interests;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45268, "text": "8. Other situations where other regulations can be obtained without authorization.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The sharing or disclosure of other laws and regulations and other regulations does not need to be authorized."}
{"task": "rw_22.jsonl", "id": 45269, "text": "According to the law, sharing, transfer, and publicly disclose personal information that is identified by de -identification processing, and ensure that the data receiver cannot restore and re -identify the subject of personal information. We will not notify you separately and obtain it to youYour consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share, transfer, and publicly disclose personal information that has been identified by de -identified processing, and ensure that the data receiver cannot restore and re -identify the subject of personal information, no need to notify you and obtain your consent."}
{"task": "rw_22.jsonl", "id": 45270, "text": "4. How do we save and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45271, "text": "(1) Preservation of personal information", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45272, "text": "1. Storage period: We will only retain your personal information within the time limit required for the purpose of the cost of reaching the cost of the cost, unless laws and regulations have compulsory retention requirements, such as the \"E -Commerce Law of the People's Republic of China\" requires commodity and service information, and service information, and service information,The preservation time of transaction information is not less than three years from the date of the transaction.", "label": ["Data Retention", "Important"], "rewrite": "Generally, your personal information is retained within the time limit required to achieve service purposes, unless the law has other requirements."}
{"task": "rw_22.jsonl", "id": 45273, "text": "We judge the storage period of personal information mainly refer to the following standards and based on the elders: to complete the transaction purpose related to your transaction, maintain the corresponding transactions and business records to cope with your possible inquiries or complaints;", "label": ["Data Retention", "Important"], "rewrite": "The storage period of personal information is mainly referred to the following standards and the elders are based on the elders: to complete the transaction purpose related to your transaction, maintain the corresponding transactions and business records to cope with your possible inquiries or complaints."}
{"task": "rw_22.jsonl", "id": 45274, "text": "Make sure we provide you with service safety and quality;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45275, "text": "Do you agree to a longer retention period;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45276, "text": "Whether there are other special agreement or laws and regulations on the retention period.", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45277, "text": "After exceeding the reservation period, we will delete your personal information according to the requirements of the applicable law, or make it anonymous processing.", "label": ["Data Retention", "Important"], "rewrite": "After exceeding the storage period, your personal information will be deleted or anonymous, except for other provisions of laws and regulations."}
{"task": "rw_22.jsonl", "id": 45278, "text": "When you actively cancel your account, we will process data processing according to the requirements of laws and regulations.", "label": ["Edit/Control", "Important"], "rewrite": "When you actively cancel your account, we will process data processing according to the requirements of laws and regulations."}
{"task": "rw_22.jsonl", "id": 45279, "text": "2. Save the area: The personal information we collected and generated in the territory of the People's Republic of China will be stored in China, except for the following situations:", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in domestic operations will be stored in China."}
{"task": "rw_22.jsonl", "id": 45280, "text": "(1) The laws and regulations are clearly stipulated;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45281, "text": "(2) Get your authorization consent alone;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45282, "text": "(3) Personal behaviors such as cross -border reservation, ordering, and transactions you initiated (such as purchasing international air tickets, booking international hotels, etc.).", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45283, "text": "In the above situation, we will perform the corresponding processes and obligations in accordance with the requirements of laws and regulations, and require the data receiver to handle personal information in accordance with the privacy policies and other related security and confidentiality measures.", "label": ["Important", "Data Security"], "rewrite": "If we need to store personal information abroad, we will perform the corresponding processes and obligations in accordance with the requirements of laws and regulations, and require the data receiver to handle personal information in accordance with the privacy policy and other related security and confidentiality measures."}
{"task": "rw_22.jsonl", "id": 45284, "text": "3. Termination operation: If the termination operation and other circumstances, we will notify you at least 30 days in advance, and will deal with your personal information according to the requirements of laws and regulations after terminating operations.", "label": ["Important", "Cessation of Operations"], "rewrite": "If the operation is terminated, we will notify you 30 days in advance and deal with your personal information according to the requirements of laws and regulations."}
{"task": "rw_22.jsonl", "id": 45285, "text": "(2) Protection measures for personal information", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45286, "text": "1. Data security measures", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45287, "text": "In order to ensure your information security, we strive to take various physical, electronics and management security measures that meet industry standards to protect your personal information, and establish data classification hierarchical systems, data security management specifications, and data security development specifications to manage specifications to manage specificationsStorage and use of personal information.", "label": ["Important", "Data Security"], "rewrite": "Adopt various physical, electronic and management security measures to protect your personal information, and establish a data classification hierarchical system, data security management specifications, and data security development specifications to manage the storage and use of personal information."}
{"task": "rw_22.jsonl", "id": 45288, "text": "Meituan's confidentiality agreement, monitoring, and auditing mechanism through information contacts to comprehensively control the data to prevent your personal information from being unauthorized, publicly disclosed, used, modified, damaged, or lost.", "label": ["Important", "Data Security"], "rewrite": "Through information -contact confidentiality agreement, monitoring and auditing mechanisms, the data is comprehensively securely controlled to protect personal information security."}
{"task": "rw_22.jsonl", "id": 45289, "text": "For example, when you exchange data (such as credit card information) between your browser and \"service\" (such as credit card information);", "label": ["Important", "Data Security"], "rewrite": "SSL encryption protection technology is used when you exchange data between your browser and \"service\"."}
{"task": "rw_22.jsonl", "id": 45290, "text": "At the same time, the website itself provides HTTPS security browsing methods;", "label": ["Important", "Data Security"], "rewrite": "Provide the website itself to provide HTTPS security browsing methods."}
{"task": "rw_22.jsonl", "id": 45291, "text": "Use encryption technology to ensure the confidentiality of data;", "label": ["Important", "Data Security"], "rewrite": "Use encryption technology to ensure the confidentiality of data."}
{"task": "rw_22.jsonl", "id": 45292, "text": "Using a trusted protection mechanism to prevent data from being maliciously attacked;", "label": ["Important", "Data Security"], "rewrite": "Using a trusted protection mechanism to prevent data from being maliciously attacked."}
{"task": "rw_22.jsonl", "id": 45293, "text": "Deploy the access control mechanism to ensure that only authorized personnel can access personal information;", "label": ["Important", "Data Security"], "rewrite": "Deploy the access control mechanism to ensure that only authorized personnel can access personal information."}
{"task": "rw_22.jsonl", "id": 45294, "text": "As well as holding safety and privacy protection training courses to strengthen employees' awareness of protecting the importance of personal information.", "label": ["Important", "Data Security"], "rewrite": "Organize safety and privacy protection training courses to strengthen employees' awareness of protecting the importance of personal information."}
{"task": "rw_22.jsonl", "id": 45295, "text": "2. Safety certification", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45296, "text": "We have passed the certification qualifications such as the international certification of data security certification of the Ministry of Public Security's information security level protection, ISO27001 information security certification, the third -party payment industry (PCI, DSS) data security standard international certification and other certification qualifications.Establish a good coordination and communication mechanism, timely resist and dispose of various information security threats, and provide a comprehensive guarantee for your information security.", "label": ["Important", "Data Security"], "rewrite": "We have passed the certification qualifications such as the third -party information security standard for the protection of information security level protection, ISO27001 information security certification, and international certification in the third -party payment industry."}
{"task": "rw_22.jsonl", "id": 45297, "text": "3. Please know and understand that the Internet is not an absolute security environment. We strongly recommend that you help us ensure your account security through security methods and complex passwords.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45298, "text": "If you find your personal information disclosure, especially your account or password, please contact us according to the contact information provided in this privacy policy in order to take corresponding measures.", "label": ["Important", "Data Security"], "rewrite": "If the personal information discovered, please contact our customer service immediately."}
{"task": "rw_22.jsonl", "id": 45299, "text": "4. Safety events", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45300, "text": "After unfortunately a personal information security incident, we will immediately set up a special emergency group to start emergency plans to prevent the expansion of security incidents. We will inform you in a timely manner in accordance with the requirements of laws and regulations: the basic situation and possible impact of security incidents, we have adopted the impact of the security incident, we have adopted it.It may take disposal measures, suggestions that you can prevent and reduce risks, and remedy measures for your remedy.", "label": ["Important", "Data Security"], "rewrite": "If a personal information security incident occurs, we will inform your basic situation, possible impact, disposal measures, independent prevention suggestions, etc."}
{"task": "rw_22.jsonl", "id": 45301, "text": "We will promptly inform you that the incident -related situation is informing the email, letter, telephone, push notification, etc. When it is difficult to inform the subject of personal information one by one, we will publish an announcement in a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "The relevant situation of security incidents will be informed by mail, letter, telephone, push notification, etc. When it is difficult to inform one by one, it will issue an announcement."}
{"task": "rw_22.jsonl", "id": 45302, "text": "At the same time, we will also actively report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "Report the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities."}
{"task": "rw_22.jsonl", "id": 45303, "text": "5. How do you manage your personal information", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45304, "text": "You have the following rights to your personal information.", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45305, "text": "According to the requirements of laws and regulations, in specific circumstances, in addition to your other arrangements, your close relatives can exercise the following rights for your relevant personal information for your own legal and legitimate interests.", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45306, "text": "(1) You have the right to access, correct, and delete your personal information, except for the exception stipulated in laws and regulations.", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45307, "text": "You can manage your information through the following ways:", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45308, "text": "Personal information inspection and management: You can click \"Settings\"-\"Privacy Management\" through \"My\" -Coustone in the upper right corner to check and manage personal information.", "label": ["Important", "Edit/Control"], "rewrite": "You can enter \"Settings\"-\"Privacy Management\" through the upper right corner of \"Mine\" to check and manage personal information."}
{"task": "rw_22.jsonl", "id": 45309, "text": "Account Information -You can access it through the \"My\" page, correct the personal information and account information in your account (except identity authentication information), payment information, account binding information, etc. You can also change your password, add security information, add security informationOr the unbinding of third -party accounts and bank cards, you can perform such operations in settings by accessing webpages and APPs.", "label": ["Edit/Control", "Important"], "rewrite": "You can access your personal information and account information, payment information, account binding information, etc. through the \"My\" page, you can also change your password, add security information, or solve the solution of a third -party account and bank card.Tied."}
{"task": "rw_22.jsonl", "id": 45310, "text": "Address Information-You can add, change, and delete your delivery address information at any time by accessing \"My\"-\"Settings\"-\"Personal Information\"-\"Personal Information\"-\"Receiving Address\" by visiting Meituan APP pageName, gender, delivery address, phone number, etc.).", "label": ["Important", "Edit/Control"], "rewrite": "You can add, change, and delete your delivery address information at any time by visiting the \"My\"-\"Settings\"-\"Personal Information\"-\"Personal Information\"-\"Receiving address\" on the Meituan APP page."}
{"task": "rw_22.jsonl", "id": 45311, "text": "Search Browse information -You can access or clear your search history, view and modify your interests, and manage other data by searching for deletion, \"My\" - \"Footprint\" and other methods.", "label": ["Important", "Edit/Control"], "rewrite": "You can access or clear your search historical records, viewing and modifying interests and managing other data by searching for deletion, \"My\" - \"Footprint\" and other methods."}
{"task": "rw_22.jsonl", "id": 45312, "text": "Order information -You can visit the \"My Order\" page through the \"My\" page to view all the orders that have been completed, to be paid, after -sales, and evaluated.", "label": ["Important", "Edit/Control"], "rewrite": "You can visit the \"My Order\" page through the \"My\" page to view all the orders that have been completed, payable, after -sales, and evaluation."}
{"task": "rw_22.jsonl", "id": 45313, "text": "You can choose to delete the completed order information, but this may cause us to accurately provide corresponding after -sales services according to your purchase information.", "label": ["Important", "Edit/Control"], "rewrite": "You can choose to delete the completed order information."}
{"task": "rw_22.jsonl", "id": 45314, "text": "Evaluation information-You can access \"My Order\"-\"To Evaluation\"-\"My Evaluation\" through the \"My\" page to access, increase, correct, and delete your evaluation content.", "label": ["Important", "Edit/Control"], "rewrite": "You can access, increase, correct, and delete your evaluation content through \"My Order\"-\"To Evaluation\"-\"My Evaluation\"."}
{"task": "rw_22.jsonl", "id": 45315, "text": "Please know that according to the requirements of the laws and regulations and the technical conditions of different information, we may not be able to completely delete the corresponding information you want to delete immediately from the system. Prior to this, we will only store and storage the corresponding information according to the requirements of the regulations and regulations.Take the necessary safety protection measures.", "label": ["Important", "Edit/Control"], "rewrite": "If the requirements of different information and the technical conditions of different information cannot be respond to your deletion requirements immediately, we will only store and take the necessary safety protection measures."}
{"task": "rw_22.jsonl", "id": 45316, "text": "If you cannot manage these personal information through the above links, you can contact us at any time through the feedback method provided in this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45317, "text": "We will reply to your access request within 15 days.", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45318, "text": "(2) Change the scope of your authorization consent or withdraw authorization", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45319, "text": "You can change the consent range or withdraw your authorization by deleting information in Meituan APP, changing privacy settings, or closing equipment permissions in the system or withdrawing your authorization.", "label": ["Important", "Edit/Control"], "rewrite": "You can change the consent range or withdraw authorization by deleting information in Meituan APP, changing privacy settings, or closing equipment permissions in the system or withdrawing authorization."}
{"task": "rw_22.jsonl", "id": 45320, "text": "You can operate management and withdraw your system authorization in the upper right corner to enter \"Settings\"-\"Privacy Management\"-\"System permissions Management\".", "label": ["Important", "Edit/Control"], "rewrite": "You can operate management and withdraw your system authorization in the upper right corner to enter \"Settings\"-\"Privacy Management\"-\"System permissions Management\"."}
{"task": "rw_22.jsonl", "id": 45321, "text": "Please understand that when you perform the above operations, we will not be able to continue to provide you with the service corresponding to the withdrawal consent or authorization, but it will not affect the personal information processing that has been developed based on your authorization.", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45322, "text": "(3) Logging out the account", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45323, "text": "You have the right to cancel your Meituan account. You can operate online operations online by accessing the app \"My\"-\"Account and Security\"-\"Logging out\".", "label": ["Important", "Edit/Control"], "rewrite": "You can perform online operations by accessing the app \"Settings\"-\"Account and Security\"-\"Logging out\" in the upper right corner of the APP \"My\" page."}
{"task": "rw_22.jsonl", "id": 45324, "text": "After you successfully cancel, in addition to laws and regulations and corresponding national standards, we will delete your personal information or make anonymous processing.", "label": ["Important", "Edit/Control"], "rewrite": "After cancellation, your personal information will be deleted or anonymous, unless laws and regulations are provided."}
{"task": "rw_22.jsonl", "id": 45325, "text": "If you cannot access, correct or delete your personal information and cancel your account in the above method, or if you think that the US group has a violation of laws to collect and use your personal information, you can use our customer service or through this privacy policy through this privacy policyOther ways are provided to get in touch with us.", "label": ["Important", "Edit/Control"], "rewrite": "If you are unable to access, correct or delete your personal information and cancel your account in the above way, or think that there are illegal collection and use information, you can contact us."}
{"task": "rw_22.jsonl", "id": 45326, "text": "In order to ensure safety, we may need to provide the corresponding way to prove the legitimacy of your identity and request. We will answer your request within 15 days after receiving your feedback and verifying your identity.", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45327, "text": "For your reasonable request, we do not charge fees in principle, but we will charge a certain cost fee depending on the request that repeats and beyond the reasonable limit.", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45328, "text": "For those who have no repetition and need too much technical means (for example, need to develop new systems or fundamentally change the current practice), bring risks to others' legitimate rights and interests or very unrealistic (for example, information involved in backup tapes)We may refuse.", "label": ["Important", "Data Security"], "rewrite": "We may refuse to repeat for unseen, need too much technical means, bring risks or very unrealistic requests to others' legitimate rights and interests."}
{"task": "rw_22.jsonl", "id": 45329, "text": "(4) Autonomous management control marketing information and directional push", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45330, "text": "Message push -if you don't want to receive message notifications on the APP page, you can refuse to receive message notifications when installing the APP for the first time, or turn off the corresponding notification function in the \"Notice\" center in the mobile operating system.", "label": ["Edit/Control", "Important"], "rewrite": "You can refuse to receive message notifications when installing the APP for the first time, or turn off the corresponding notification function in the \"Notice\" center in the mobile operating system."}
{"task": "rw_22.jsonl", "id": 45331, "text": "Personalized recommendation -If you do not want to use our intelligent recommendation service, you can choose to sort according to the way of distance, praise, price, etc. without your personal characteristics.Do not want to watch \"\" functions such as \"such as\" functions for precise feedback and real -time shutdown;", "label": ["Important", "Edit/Control"], "rewrite": "You can choose to sort in the way you do not follow your personal characteristics in accordance with the distance, praise, price, etc., or you can accurately feedback and close personalized recommendations in real time in the recommendation information page."}
{"task": "rw_22.jsonl", "id": 45332, "text": "You can also perform independent management control in the \"My\" page \"Settings\"-\"Privacy Management\"-\"Personalized Content Recommendation\".", "label": ["Important", "Edit/Control"], "rewrite": "You can perform independent management control in the \"My\" page \"Settings\"-\"Privacy Management\"-\"Personalized Content Recommendation\"."}
{"task": "rw_22.jsonl", "id": 45333, "text": "Personalized advertisements-If you do not want to receive personalized advertisements, you can control the switch by yourself in the \"My\" page \"Settings\"-\"Privacy Management\"-\"Personalized Advertising Recommendation\".Advertising correlations will be reduced, but advertisements will not disappear.", "label": ["Important", "Edit/Control"], "rewrite": "You can control the personalized advertising switch yourself in the \"My\" page \"Settings\"-\"Privacy Management\"-\"Personalized Advertising Recommendation\"."}
{"task": "rw_22.jsonl", "id": 45334, "text": "Promotion/return visits -If you do not want to receive our promotion text messages or telephone return visits, you can withdraw through the corresponding withdrawal function in the information, or explicitly reject it during the telephone return visit.", "label": ["Important", "Edit/Control"], "rewrite": "If you do not want to receive our promotional SMS or telephone return visits, you can withdraw bips through the corresponding withdrawal function in the information, or explicitly reject it during the telephone return visit."}
{"task": "rw_22.jsonl", "id": 45335, "text": "6. Protection of personal information of minors", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45336, "text": "Meituan attaches great importance to the protection of personal information of minors.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45337, "text": "Our websites and services are mainly adults.", "label": ["Specific Audiences", "Important"], "rewrite": "Our websites and services are mainly adults."}
{"task": "rw_22.jsonl", "id": 45338, "text": "If you are a minor, it is recommended that you ask your parents or guardians to read this privacy policy carefully and the \"Privacy Policy of the Minor Privacy\" that we specially formulate, and use us on the premise of obtaining your parents or guardians' consent.Service or information to us.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a minor, please use services or provide information with the consent of the guardian."}
{"task": "rw_22.jsonl", "id": 45339, "text": "For the case where parents or guardians agree to use our products or services to collect personal information of minors, we will only use, share, transfer, transfer, transfer, transfer, transfer, transfer, and transfer they are clearly agreed or protected by laws or guardians.Or disclose this information.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Important"], "rewrite": "We will only use, share, transfer or disclose minors' information for laws and regulations, parents or guardians clearly agree or protect minors."}
{"task": "rw_22.jsonl", "id": 45340, "text": "If we find that we collect the personal information of minors without the consent of the parents or the legal guardian who can be confirmed in advance, we will try to take appropriate processing of relevant data as soon as possible.", "label": ["Specific Audiences", "Important"], "rewrite": "If the personal information of minors was collected without the consent of the legal guardian, he would try to delete relevant information as soon as possible."}
{"task": "rw_22.jsonl", "id": 45341, "text": "7. Notification and revision", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45342, "text": "In order to provide you with better services, our business will change from time to time, and this privacy policy will be adjusted.If our contact information is changed, we will update it in time.", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45343, "text": "Without your clear consent, we will not reduce the rights you should enjoy in accordance with the privacy policy.", "label": ["Policy Change", "Important"], "rewrite": "Without your clear consent, we will not reduce the rights you should enjoy in accordance with the privacy policy."}
{"task": "rw_22.jsonl", "id": 45344, "text": "We will send a update version on our website and mobile terminals or remind you to update the relevant content in other ways. Please also visit us to understand the latest privacy policy in time.", "label": ["Policy Change", "Important"], "rewrite": "We will send a update version on our website and mobile terminal or remind you of the update of related content in other ways."}
{"task": "rw_22.jsonl", "id": 45345, "text": "In the foregoing, if you continue to use our services, you will agree to accept the revised policy and be bound.", "label": ["Policy Change", "Important", "Risk"], "rewrite": "If you continue to use our services, you agree to accept the revised policy and be bound."}
{"task": "rw_22.jsonl", "id": 45346, "text": "8. How to contact us", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45347, "text": "You can contact us in the following ways, we will answer your request within 15 days;", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45348, "text": "1. You can contact us through Meituan website (such as www.meituan.com, www.dianping.com)/APP.", "label": ["Important", "Contact Information"], "rewrite": "You can contact us through the online contact information/customer service system provided on the Meituan website/APP."}
{"task": "rw_22.jsonl", "id": 45349, "text": "2. You can contact Meituan's customer service phone to feedback (Meituan.com: 10107888;", "label": ["Important", "Contact Information"], "rewrite": "Customer service phone: Meituan 10107888; Public Comment Network: 10100011."}
{"task": "rw_22.jsonl", "id": 45350, "text": "Public Comment Network: 10100011).", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45351, "text": "3. We have also set up a special personal information protection team. You can contact our personal information protection person in charge of mailbox, privacy@meituan.com, or you can also send a letter to the following address:, Wangjing East Road, Wangjing District, Chaoyang District, BeijingNo. 4 Hengji Weiye Building No. 2 Privacy Protection Center (closed), postcode:, 100102.", "label": ["Important", "Contact Information"], "rewrite": "Personal Information Protection Personal Email PRIVACY@meituan.com; Address: Privacy Protection Center (closed), 2nd floor of Block C, No. 4 Hengji Building, No. 4 Wangjing East Road, Chaoyang District, Beijing, Zip Code: 100102."}
{"task": "rw_22.jsonl", "id": 45352, "text": "Nine, Appendix:", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45353, "text": "1. Personal information: Various information related to recognized or recognized natural persons recorded in electronics or other methods, excluding information after anonymous processing.", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45354, "text": "Personal information that may involve in this privacy policy includes, but not limited to: personal information (including name, phone number, gender, address, birthday, birthday, etc.);", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45355, "text": "Personal identity information (including ID cards, officers, passports, driving licenses, etc.);", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45356, "text": "Network identity identification information (including system accounts, IP addresses, mailbox addresses, and the answer to the aforementioned password, password, password protection);", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45357, "text": "Personal property information (including bank accounts, transactions and consumption records, credit records, and virtual property information, etc.);", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45358, "text": "Personal health and physiological information (including diseases, medical records, history, etc.);", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45359, "text": "Contact information (including address book information, friends list, etc.);", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45360, "text": "Personal Internet records (including website browsing records, click records, etc.);", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45361, "text": "Personal device information (including information that describes the basic situation of individual equipment such as the unique device identification code);", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45362, "text": "Personal location information (including the trajectory, precise positioning information, accommodation information, etc.).", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45363, "text": "2. Sensitive personal information: It refers to personal information that can easily cause the personality and dignity of natural people to be violated or harmed by personal and property security once leaked or illegally used.", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45364, "text": "Personal sensitive information that may be involved in this privacy policy includes: personal identity certification information (including ID cards, officers, passports, driving licenses, student IDs, etc.);", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45365, "text": "Personal property information (bank account, transaction and consumption records, credit records, virtual property information, etc.);", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45366, "text": "Other information (whereabouts, address book information, accommodation information, accurate positioning information, medical health information, biometric information, etc.);", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45367, "text": "Under 14 years old, minor information.", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45368, "text": "3. Meituan: The \"Meituan\" referred to in this policy refers to all companies under Meituan and its affiliated companies (including Meituan.com, Public Comment, Mobike and other platforms that have established companies and the future.Established).", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45369, "text": "Popular comment: Refers to the life service information platform under the Meituan of Shanghai Hantao Information Consulting Co., Ltd., including but not limited to the popular Internet platforms such as Public Comment Network, Public Comment Client, and Public Comment Mini Program.", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45370, "text": "4. Related company: refers to Meituan related companies disclosed by Meituan's latest listed company annual report.", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45371, "text": "5. Related account number: You can use the same mobile phone number to log in to the product/services provided by Meituan, and authorize the use of your Meituan account information (such as avatar, nickname, receiving address), so that we can to you based on related accounts to youProvide consistent services and unified management.", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45372, "text": "appendix:", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45373, "text": "\"Meituan Taxi Privacy Policy\"", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45374, "text": "\"Bicycle Service Privacy Policy\"", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45375, "text": "\"Meituan Financial Privacy Policy\"", "label": [], "rewrite": []}
{"task": "rw_22.jsonl", "id": 45376, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
