{"task": "rw_2.jsonl", "id": 36989, "text": "Policies of privacy privacy", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 36990, "text": "Effective date: August 23, 2022", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 36991, "text": "Update date: August 23, 2022", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 36992, "text": "【introduction】", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 36993, "text": "You are welcome to use our products and services!", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 36994, "text": "We know the importance of personal information to you. Your trust is very important to us. We will strictly abide by laws and regulations to take corresponding security protection measures to protect your personal information security and controlling.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 36995, "text": "Based on this, the Nailing Service Provider (or \"We\") formulates this \"Nail Privacy Policy\" (hereinafter referred to as \"this policy\"/\"this privacy policy\") to help you fully understand the use of our products and services in your products and services.In the process, how will we collect, use, share, store, and protect your personal information, as well as how you can manage your personal information so that you can make better choices.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 36996, "text": "Before you start using our products and services, please read and understand this policy carefully. In particular, we should focus on reading the clauses we logging in the threatening of the body/coarse body to ensure that you fully understand and agree to use it before starting to use.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 36997, "text": "The professional vocabulary involved in this policy, we try to explain to you in a concise and popular expression in order to facilitate your understanding.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 36998, "text": "If you have any questions, opinions or suggestions on the content of this policy, you can contact us through the contact information at the end of this policy.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 36999, "text": "You agree that the privacy policy said that you have understood the functions provided by the application, and the necessary personal information required for functional operation, and give corresponding collection and use authorization, but it does not mean that you have agreed to open up additional functions and handle non -necessary personal information.The opening, processing non -necessary personal information and processing sensitive personal information, we will solicit your consent separately according to your actual usage.", "label": ["Policy Change", "Important"], "rewrite": "You agree that the privacy policy indicates that it is authorized to collect and use the necessary personal information, but it does not mean that it will agree to start the additional functions and handle unnecessary personal information. This will solicit your consent separately according to the actual usage."}
{"task": "rw_2.jsonl", "id": 37000, "text": "This privacy policy will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37001, "text": "1. Scope of application", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37002, "text": "2. Information collection and use", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37003, "text": "3. Provide information to the outside world", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37004, "text": "Fourth, your rights", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37005, "text": "5. Storage of information", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37006, "text": "6. Policy update", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37007, "text": "7. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37008, "text": "Eight, contact us", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37009, "text": "Appendix: Related Definition", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37010, "text": "1. Scope of application", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37011, "text": "This policy is applicable to the various products and services provided by you provided by Dingtalk.com, AliWork.com, Nail Software, Nail Smart Hardware, and new forms that appeared with technology development.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37012, "text": "If the affiliated company has a privacy policy for the products or services it provides you, the corresponding privacy policy is applicable to the corresponding products or services.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37013, "text": "In addition to the relevant information collection and use activities described in this policy, this policy is not applicable to the third -party service providers of nails and other services provided by other third directions. Other services are suitable for the personal information collection and use rules that they explain to you.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37014, "text": "When you install a third -party SaaS application and mini program, the use of personal information/corporate control data that such a third -party SaaS is organized by you or your organization is specifically explained to you.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37015, "text": "2. Information collection and use", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37016, "text": "When you use our products/services, the personal information we need/may need to collect and use includes the following:", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37017, "text": "1. In order to realize the basic functions of providing you with our products and/or services, you must authorize us to collect and use the necessary information.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37018, "text": "If you refuse to provide the corresponding information, you will not be able to use our products and/or services normally;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37019, "text": "2. In order to provide you with additional functions to our products and/or services, you can choose to agree or disagree with the information we collected and used alone.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37020, "text": "If you refuse to provide it, you will not be able to use related additional functions normally or cannot achieve the functional effects we intend to achieve, which will not affect your basic functions.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37021, "text": "We are here to remind you that we are committed to creating a variety of products and services to meet your needs.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37022, "text": "Because there are many types and services we provide to you, and there are differences in the scope of the specific product/service selected by different users, the basic/additional functions and the personal information types and scope of personal information and use will be different. Please use specific ones.Product/service function shall prevail.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37023, "text": "The specific feature scenarios we will provide you include::", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37024, "text": "(1) Help you become our user and account management", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37025, "text": "1. Register becomes a personal user", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37026, "text": "(1) Basic user service", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37027, "text": "In order to register as a personal user of Dingding, use nails as non -office services as an end user without an enterprise organization, such as IM chat (instant messaging), creation group, conference calls, video conferences, online telephones, DING messages, personal nail disks, personal nails, personal nails, personal nails, personal nails, personal nails, personal nails, personal nails, personal nails, personal nails, personal nails, personal nails, personal nails, personal nails, personal nails, personal nails, personal nails, personal nails, personal nails, personal nails, personal nails, personal nails, personal nails, personal nails, personal nails, personal nails, personal nails, personal nails, personal nails, personal nails, personal nails, personal nails, personal nails, personal nails, personal nails, personal nails, personal nails, personal nails, personal nails, personal nails, personal nails.To achieve communication functions, you need to submit your mobile phone number and password to register and create a nail account, otherwise you will not be able to use nail services.", "label": ["Important", "First Party Collection Information"], "rewrite": "You need to submit your mobile phone number and password to register and create a nail account to use the nail service."}
{"task": "rw_2.jsonl", "id": 37028, "text": "If you only need to use the nail software, function and service introduction displayed by browsing and searching the nail website, you don't need to register as a nail user and provide the above information.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you only need to use nail software, features, and service introduction displayed by browsing and searching for nails, you don't need to register and provide information."}
{"task": "rw_2.jsonl", "id": 37029, "text": "In order to ensure that we are providing services for you, we may need you to provide your ID information or facial information for real -name authentication, and verify your identity according to the above information provided by you.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may need you to provide your ID information or facial information for real -name authentication."}
{"task": "rw_2.jsonl", "id": 37030, "text": "If there is a scenario that needs to determine your necessary identity (including protecting the rights and interests of minors in accordance with the law, cracking down on telecommunications network fraud, deducting taxes and fees for you, the relevant subjects in administrative law enforcement or judicial litigation), you authorize us to obtain your correspondenceThe necessary authentication information of the account is used for the above items.", "label": ["Important", "First Party Collection Information"], "rewrite": "If there is a scene that needs to determine your necessary identity according to law, you authorize us to obtain the necessary certification information for the above items."}
{"task": "rw_2.jsonl", "id": 37031, "text": "We will determine your current level based on your nail account usage and the account level calculation rules set by the platform, and provide you with the basic equity corresponding to the corresponding account level.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37032, "text": "(2) Additional user service", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37033, "text": "Improve information: You can independently improve the basic information of names, avatars, nicknames, gender, birthday, work, and corporate mailboxes. The nicknames and avatars you set will be displayed publicly.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You can independently improve the basic information, and the nicknames and avatars you set will be displayed publicly."}
{"task": "rw_2.jsonl", "id": 37034, "text": "Real -person certification: You can submit the corresponding ID information or facial information according to the certification requirements to complete the real -person authentication. When the real -person authentication of the facial information, we need to obtain your light sensor data to determine whether the light source is sufficient.", "label": ["Important", "First Party Collection Information"], "rewrite": "When the facial information is authenticated, we need to obtain your light sensor data."}
{"task": "rw_2.jsonl", "id": 37035, "text": "Authorized login: We may provide your account information (avatar, nickname, and other pages prompt information) to third parties after you agree, so that you can easily implement the registration of third -party accounts or directly log in.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may provide your account information to the third party with a separate consent, so that you can easily implement the registration of a third -party account or directly log in to the third party."}
{"task": "rw_2.jsonl", "id": 37036, "text": "In addition, we may obtain your third -party account information from a third party based on your individual consent, and bind it with your nail account, so that you can log in to the third party and use our products and/or or/or or/or or or.Serve.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "We may obtain your third -party account information from a third party and bind it with your nail account."}
{"task": "rw_2.jsonl", "id": 37037, "text": "We will use your relevant information within the scope of the authorization you agree with.", "label": ["Permission Acquisition", "Important"], "rewrite": "We will use your relevant information within the scope of the authorization you agree with."}
{"task": "rw_2.jsonl", "id": 37038, "text": "Other additional services: If you apply for registration as a developer, service provider, or other role -certified roles, you need to provide us with identity information and/or corporate related information for us to obtain qualifications for your identity and other membership characters to qualify for qualifications.Verification, registration, publicity and other purposes we have clearly informed.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you apply for a role in registering an additional identity authentication, you need to actively provide us with identity information and/or corporate related information to be used for identity verification, registration, publicity, and other purposes we have clearly informed."}
{"task": "rw_2.jsonl", "id": 37039, "text": "If you use the nail wallet function, you need to meet the actual authentication when using the live broadcast function as an anchor.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37040, "text": "2. Register becomes a personal user of the Dingxin Student No.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37041, "text": "In order to open the use of nail student numbers to become nail registered students, so that we can provide you with services, classroom review homework, check -in online learning, growth diary service, IM chat (including single chat and family groups, class groups),Based on their parents/guardians based on their nail education home schools and family groups, parents will apply for their children through their own nail accounts based on their own nail accounts, based on the name of the child's school/class, name, and parental name information., Manage and use the Nail Student Number.", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to open the use of nail student numbers to become nail registered students, parents will apply, manage and use the student number for their children through their own nail account account."}
{"task": "rw_2.jsonl", "id": 37042, "text": "After registering as a nail user, students and parents can independently improve the basic information of students' nicknames, avatars, gender, birthdays, and regions.", "label": ["Important", "First Party Collection Information"], "rewrite": "After registering as a nail user, students and parents can independently improve the basic information of students' nicknames, avatars, gender, birthdays, and regions."}
{"task": "rw_2.jsonl", "id": 37043, "text": "3. Registration becomes a nail enterprise/organization user", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37044, "text": "(1) Basic enterprise/organization service", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37045, "text": "In order to register as a nail enterprise/organization user to realize the digital transformation and upgrading of enterprise organizations, you need to provide your enterprise/organization name creation of nail enterprises/organization accounts, otherwise you will not be able to use nail services based on corporate organization management behavior.", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to register as a nail enterprise/organization user, you need to provide your enterprise/organization name to create a nail enterprise/organization account."}
{"task": "rw_2.jsonl", "id": 37046, "text": "(2) Additional enterprise/organization services", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37047, "text": "Improve information: After registering as a nail enterprise organization user, you can further provide the location, industry type, and personnel scale information of the enterprise/organization (based on page prompts).", "label": ["Important", "First Party Collection Information"], "rewrite": "After registering as a nail enterprise organization user, you can further provide information about the location of the enterprise/organization, the industry type, and the scale of personnel."}
{"task": "rw_2.jsonl", "id": 37048, "text": "Enterprise/Organization Certification: If you need to obtain more equity or services, as an enterprise/organization administrator, you need to submit specific information and data to complete the enterprise/organization certification (including business licenses, unified social credit code, enterprise organizations, enterprise organizations, corporate organizationsName, address, identity information of legal representatives, basic information of certification letter).", "label": ["Important", "First Party Collection Information"], "rewrite": "As an enterprise/organization administrator, you need to submit specific information and data to complete the enterprise/organization certification on behalf of the enterprise/organization to obtain more rights or services."}
{"task": "rw_2.jsonl", "id": 37049, "text": "If you are the legal representative of the enterprise, you need to certify that you are a nail enterprise/organization that you are the legal representative, and you need to provide us with the business license/organization code certificate of the enterprise, and the legal representative ID card information so that we can add it to youTo the organizational structure organized by related nail enterprises.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you are the legal representative of the enterprise, you need to certify that you are to join your nail enterprise/organization as the legal representative, you need to provide the enterprise's business license/organization code certificate, and the legal representative ID information."}
{"task": "rw_2.jsonl", "id": 37050, "text": "You understand and agree that you need to ensure that you have obtained its authorization consent before providing the aforementioned personal information to the actual relevant personnel.", "label": ["Important", "First Party Collection Information"], "rewrite": "You understand and agree that you have obtained its authorization consent before providing the actual relevant personnel of the actual relevant personnel."}
{"task": "rw_2.jsonl", "id": 37051, "text": "(2) Provide you with online communication and collaborative office services", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37052, "text": "1. Instant communication", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37053, "text": "When you use nails for instant messaging chat, we need to record your chat information, voice call status information (non -call content) to achieve information transmission and interaction, and synchronize it into all your login devices.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use nails for instant messaging chat, we need to record your chat information, voice call status information to achieve information transmission and interaction, and synchronize them into all your login devices."}
{"task": "rw_2.jsonl", "id": 37054, "text": "When other users send Ding messages to you, we will send information or call your registered mobile phone number and login device to achieve information reaching.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37055, "text": "In order to avoid missed Ding calls or your business organization of office telephones, you can authorize to write the aforementioned number to your mobile phone address book. If you refuse to authorize, it will cause the phone number to not be stored, but it will not affect your use message, Enterprise Organization Office Telephone Services.", "label": ["Permission Acquisition", "Important"], "rewrite": "To avoid missing the Ding phone or your business organization, you can authorize to write the aforementioned number to your mobile phone address book."}
{"task": "rw_2.jsonl", "id": 37056, "text": "If you need to send voice information, voice/video calls, and send instant photos/videos, you need to authorize nails to get the microphone/camera permissions of your equipment. When making audio and video calls, we will get your distance sensor for soImplement the automatic screen.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you need to send voice information, voice/video calls, and send instant photos/videos, you need to authorize nails to get the microphone/camera permissions of your device, and get your distance sensor when you make audio and video calls."}
{"task": "rw_2.jsonl", "id": 37057, "text": "If you need to send photos and files to the other party, you need to authorize nails to obtain the album/file storage permissions of your device.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you need to send photos and files to the other party, you need to authorize nails to obtain the album/file storage permissions of your device."}
{"task": "rw_2.jsonl", "id": 37058, "text": "To facilitate your acceptance of voice information, to provide you with a voice transfer function, you can close the function through \"Settings-General-Voice Automatic Transfer text\".", "label": ["Important", "Edit/Control"], "rewrite": "Ding Nail provides you with a voice-to-text function, you can turn off the function through \"Settings-Universal-Voice Automatic Transfer text\"."}
{"task": "rw_2.jsonl", "id": 37059, "text": "When you use instant messaging services, you need to share your location information from the other party, and you will get your location information to send and display your location.Assist your position.", "label": ["Permission Acquisition", "Risk", "Important", "First Party Collection Information", "Usage"], "rewrite": "When you use instant messaging services, you need to share your location information from the other party. We will get your acceleration sensor, gyroscope sensor, and rotating vector sensor to help judge your location."}
{"task": "rw_2.jsonl", "id": 37060, "text": "2. Add friends", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37061, "text": "You can add friends by building groups, scanning code, exchangeing electronic business cards, and mobile phone address book.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37062, "text": "If you need us to recommend the contact person in your mobile phone address book, so that you can add a nail friend, you need to authorize us to visit and collect your mobile phone address information. We promise to obtain mobile phone communication at the lowest frequencyRecord information;", "label": ["Permission Acquisition", "Important"], "rewrite": "If you need us to recommend a registered contact person in your mobile phone address book, you need to authorize us to access and collect your mobile phone address book information."}
{"task": "rw_2.jsonl", "id": 37063, "text": "In the nails, we may recommend interested people who are interested in according to your friend relationship, organizational relationship, and your interactive behavior relationship with other users.", "label": ["Usage"], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37064, "text": "3. Online document collaboration", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37065, "text": "At the same time as the online documentation cooperation, in order to make the parties participating in the editor know the edited and modified information, the nails will show your avatar, nickname and modification traces, and for the historical version of the document to view the document.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "At the same time as the online documentation association, nails will show your avatars, nicknames and modification traces, and for the historical version of the document to view the document."}
{"task": "rw_2.jsonl", "id": 37066, "text": "You can set the document permissions.", "label": ["Important", "Edit/Control"], "rewrite": "You can set the document permissions."}
{"task": "rw_2.jsonl", "id": 37067, "text": "4. Audio and video conference", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37068, "text": "You can use the audio and video conference function provided by the nails. To use the audio and video conference function, you need to authorize the camera/microphone rights of our device. If you refuse to authorize, you will not be able to use this function.", "label": ["Permission Acquisition", "Important"], "rewrite": "To use the audio and video conference function, you need to authorize the camera/microphone right of our device."}
{"task": "rw_2.jsonl", "id": 37069, "text": "You can also use the \"Nail Flash\" function in the audio and video conference to perform audio and video conference voice -to -text functions to improve the efficiency of the meeting. When using the \"Nail Flash\", Nailing will record the content of the speech in the meeting.", "label": ["Important", "First Party Collection Information"], "rewrite": "When using \"Nail Flash\", Ding Nail will record the content of the speech in the meeting."}
{"task": "rw_2.jsonl", "id": 37070, "text": "Please know, the host of the audio and video conference can choose to recording the meeting and share it with other participants.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37071, "text": "When conducting audio and video conferences, we will get your magnetic field sensor, distance sensor, acceleration sensor, light sensor to achieve automatic screen, horizontal screen vertical screen rotation screen, and rotating screens, and the horizontal screen rotation screen, and", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "When conducting audio and video conferences, we will get your magnetic field sensor, distance sensor, acceleration sensor, light sensor to achieve automatic screen and horizontal screen vertical screen rotation screen."}
{"task": "rw_2.jsonl", "id": 37072, "text": "5. Calendar schedule", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37073, "text": "You can add your own schedule and incident notification through the function of the nail calendar, accept or send the conference invitation, and subscribe to the schedule information provided by the third party.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37074, "text": "You can set the permissions of your calendar arrangement.", "label": ["Important", "Edit/Control"], "rewrite": "You can set the permissions of your calendar arrangement."}
{"task": "rw_2.jsonl", "id": 37075, "text": "In order to use the calendar and schedule function, you can authorize us to obtain the calendar authority of your device. If you refuse to authorize, the schedule and the schedule in the device in the nail software will not be able to synchronize, but it will not affect your use of the nail calendar schedule.", "label": ["Permission Acquisition", "Important", "Edit/Control"], "rewrite": "In order to use the calendar schedule, you can authorize us to obtain the calendar authority of your device."}
{"task": "rw_2.jsonl", "id": 37076, "text": "6. Software search", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37077, "text": "You can use the nail search function to search information including chat history, contacts, documents, departments, and function names.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37078, "text": "In order to show you product or service information, we will collect your interaction and search records when using nails, through algorithm model prediction and matching information you may want to search.", "label": ["Important", "First Party Collection Information"], "rewrite": "To show you product or service information, we will collect your interaction and search records when using nails."}
{"task": "rw_2.jsonl", "id": 37079, "text": "If you want to delete \"Guess you want\", you can delete in the \"search box-guess you want to find\".", "label": ["Important", "Edit/Control"], "rewrite": "If you want to delete \"Guess you want\", you can delete in the \"search box-guess you want to find\"."}
{"task": "rw_2.jsonl", "id": 37080, "text": "7. Pickings and check -in attendance attendance", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37081, "text": "Your enterprise/organization can use nails to check in and sign in, including face, geographical location, and Bluetooth punching.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37082, "text": "If your business/organization chooses a face -to -face punching function, you need your face photos as a comparison of the characteristic value of the face, your face photo information is processed by your business/organization;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If your business/organization chooses a face -to -face punch function, your face photo information is processed by your business/organization."}
{"task": "rw_2.jsonl", "id": 37083, "text": "If your business/organization selects geographical punching in geographical location, nailing will collect your GPS location information or WIFI access point for recording, we will get your acceleration sensor, gyroscope sensor, rotating vector sensor in order to help judge your locationItems", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "If your business/organization selects geographical check -in, we will get your acceleration sensor, gyroscope sensor, and rotating vector sensor to help judge your location."}
{"task": "rw_2.jsonl", "id": 37084, "text": "If your business/organization choose Bluetooth punch, nails will collect Bluetooth information of your device.", "label": ["Important", "First Party Collection Information"], "rewrite": "If your business/organization choose Bluetooth punch, nails will collect Bluetooth information of your device."}
{"task": "rw_2.jsonl", "id": 37085, "text": "In order to prevent check -in in check -in, nails will obtain your software installation list information on your device side and confirm whether there are cheating software on the device side.", "label": ["Important", "First Party Collection Information"], "rewrite": "To prevent check -in in check -in, nails will get your software installation list information on your device."}
{"task": "rw_2.jsonl", "id": 37086, "text": "8. News notice", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37087, "text": "In the process of using nail services, we may send you messages to you through phone, SMS, Push messages, and work notifications.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37088, "text": "You can choose to unsubscribe SMS and close the message in \"Settings-New Message-System Account Notification Settings\".", "label": ["Important", "Edit/Control"], "rewrite": "You can choose to unsubscribe SMS and close the message in \"Settings-New Message-System Account Notification Settings\"."}
{"task": "rw_2.jsonl", "id": 37089, "text": "9. Sports", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37090, "text": "You can use the nail movement function to count information including steps, and to use the movement of the motion, you need to authorize the nails to obtain the sports health information of your equipment.", "label": ["Permission Acquisition", "Important"], "rewrite": "In order to use the movement function, you need to authorize the nails to get the sports health information of your equipment."}
{"task": "rw_2.jsonl", "id": 37091, "text": "(3) Realize the function of corporate organization control data", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37092, "text": "1. Personal registration account join the data control ownership of enterprise organizations", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37093, "text": "If you are an end user, use your personal mobile phone number to register the nail account and join the corporate organization, have corporate organization identity and use nail service as a nail enterprise organization to choose to open, manage the nail service as an online mobile office, communication and communication and communication and communication and communication and communication.In the collaborative tool, we will record the information and data submitted or generated during the process of using the nail -related functions/application (hereinafter referred to as \"corporate organization control data\") according to the administrator's configuration, operation and instructionsMay include:", "label": ["Important", "First Party Collection Information"], "rewrite": "If you are an end user, use your personal mobile phone number to register the nail account and join the enterprise organization, and we will record the information and data submitted or generated during the application of the nail -related functions/application process according to the configuration, operation and instructions of the administratorEssence"}
{"task": "rw_2.jsonl", "id": 37094, "text": "1) Your enterprise organization is assigned to you, including positions, affiliated departments, main industries, office mailbox accounts, office telephone information, and your attendance, approval, sign -in, log function to complete the daily operation and management of the enterprise organization.Or it generates fingerprint bottom diagrams, fingerprint characteristics, face recognition bottom diagrams, facial features, sign -in face photos, geographical location information, including attendance check -in information, approval records, release log information, schedule information, and nail file information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37095, "text": "Among them, for enterprise organizations to purchase and deploy and use their own brand hardware, including nailing fingerprint recognition attendance machine, nail face recognition attendance machine, nailing smart front desk, and three -party intelligent hardware of embedded nail services to achieveSmart access control products for fingerprint/face recognition service, you agree that the company will enter the fingerprint or face photos through the nail client or hardware device based on the purpose of the company for or managing it.Face special value can be used to achieve online fingerprint recognition or face recognition services.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Risk"], "rewrite": "You agree that the company will arrange your fingerprints or face photos based on the purpose of nailing or hardware equipment for the purpose of or management, so that hardware can realize online fingerprint recognition or face recognition services."}
{"task": "rw_2.jsonl", "id": 37096, "text": "2) You can use nail services or purchase order transaction information when using third -party application services to show you and facilitate you to manage orders.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your order transaction information so that you can show you and facilitate your management of orders."}
{"task": "rw_2.jsonl", "id": 37097, "text": "For example, you are a administrator to buy nail self -operated application services or trading information in the nail application market.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37098, "text": "3) If your enterprise organization administrator chooses to open, manage and use nails, including corporate address book, smart personnel services, digital connection services, you need to provide identity information (name, ID information, household registration) in accordance with the requirements of enterprise organization users., Enterprise job information (department, position, rank), labor contract status information, enterprise and personal contact information (mobile phone, fixed phone, mailbox), enterprise and personal contact address (family address, office address), academic qualifications (school school information (school school (school school) (school school, Professional, academic qualifications), salary issuance bank card information, emergency contact information and/or your external business contact business card information, and other enterprise organizations submit or ask the enterprise that you are provided to you to allocate to you or your personal informationEssence", "label": ["Important", "First Party Collection Information"], "rewrite": "If your enterprise organization administrator chooses to open, manage, and uses nailing services, you need to provide personal information such as identity information, corporate job information, labor contract status information, enterprise and your personal contact information in accordance with the requirements of enterprise organization users."}
{"task": "rw_2.jsonl", "id": 37099, "text": "4) If your child is located to open, manage, and use the related application services of nailing education, you need to provide you as parents including contact information (name, mobile phone number, contact address), and related children's identitySchools (names, face photos), class information (grades, classes) upload and submit or school organization requires you to provide you with information or other personal information of the school/class where related children are located.", "label": ["Specific Audiences", "Important", "First Party Collection Information"], "rewrite": "If your child's school chooses to open, manage, and uses the application service of the Education Education Edition, you need to provide your personal information as a parent according to the requirements of the school."}
{"task": "rw_2.jsonl", "id": 37100, "text": "5) Other data submitted by enterprise organizations include data from your personal information, such as the address book information of Ding Ding Enterprise (including the employment information, contact information, and personal identity information of enterprise organization users).", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37101, "text": "6) Other data authorized by enterprise organization end users explicitly agreed to agree to enterprise organization control, including services with both individual user service attributes and corporate user service attributes, such as to do, schedule, and ordinary group chat (specifically referring to ordinary groups (general groups refer to ordinary groupsThere are communication groups of existing enterprise organizations and non -enterprise organization members), and data generated by uploading, entry, publishing, transmission, and storage behavior;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect other data that is authorized by enterprise organization end users."}
{"task": "rw_2.jsonl", "id": 37102, "text": "On the contrary, if the above -mentioned service scenarios that have both the personal user service attributes and the business organization attributes of the enterprise organize the user service attributes, without the consent of the end user, will not share your above data to the enterprise organization user or its administrator.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If there are both personal user service attributes and the service scenarios that organize user service attributes, without the consent of the end user, the nail platform will not share it with enterprise organizations or their administrators."}
{"task": "rw_2.jsonl", "id": 37103, "text": "2. Personal use of the data control ownership of the exclusive account of the enterprise", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37104, "text": "Ding Nail Certification Enterprise Organization User Based on Human Resources Management, Information Security Management, and Enterprise Organization Management, the administrator serves the exclusive domain account (\"exclusive account\") of the end user through the exclusive account number of the nails in orderOffice, communication and collaborative services, the exclusive account is owned by the person unit;", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37105, "text": "You use the exclusive account number and nail service uploading, enrollment, publishing, transmission, storage, and other data and data generated by other exclusive accounts to control data for enterprise organizations.", "label": ["Important", "Risk"], "rewrite": "You use the exclusive account number and nail service uploading, enrollment, publishing, transmission, storage, and other data and data generated by other exclusive accounts to control data for enterprise organizations."}
{"task": "rw_2.jsonl", "id": 37106, "text": "You understand and agree that corporate organization users control the data controlled by the above -mentioned enterprises. We only open, manage, and use the above application services to process nail enterprises to control data or your personal information based on the instructions of the enterprise organization.", "label": ["Important"], "rewrite": "Enterprise organization users are managers controlled by enterprises."}
{"task": "rw_2.jsonl", "id": 37107, "text": "Enterprise organization users upload the communication information, class address book, and other individual users who require the organization of the enterprise organization to submit smart personnel information and external business contact information, and ensure that they have obtained a clear consent of the personal user of Pin Nail in advance, And only collect the ultimate user information necessary for corporate operation and management, and have fully informed the purpose, scope and use of end users' related data collection.", "label": ["Important", "First Party Collection Information"], "rewrite": "Before an enterprise organizes users uploaded the smart personnel information and the information of external business contact information, the enterprise organization should ensure that it has obtained the clear consent of the individual users in advance, and only collects the necessary information."}
{"task": "rw_2.jsonl", "id": 37108, "text": "For enterprise organization users use nails as online mobile office, communication and collaborative tools, as end users, you can understand and agree that users have the right to establish and fulfill your contract with you as a contract for a party as a party, or pass it through the party, or through the party, or through the party, or through the party, or through the party, or through the party, or through the party, or through the party, or through the party, or through the party, or through the party, or through the party, or through the party, or through the party, or through the party, or through the party, or through the party, or through the party, or through the party, or through the party, or through the party, or through the party, or through the party, or through the party, or through the parties, or through the party, or through, or through the party as a party, or through the contract, or through the party, you must pass it.The labor rules and regulations formulated in accordance with the law and the collective contracts signed in accordance with the law must implement human resources management. They have the right to deal with the personal information processing as a representative of the enterprise, and handle your personal information as an end user, including the entrustment of the entrustment to the opening of the administrator's opening, management and management and management and management and management and management and management and management and management and management.With the use of nail services to realize the purpose and scope of online mobile office, communication and collaboration, deal with your personal information based on reasonable necessity.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "As an end user, you understand and agree that enterprise organizations have the right to organize users based on corporate organizations with you and fulfill your contract as a party, or implement human resources management institutes through labor rules and regulations and collective contracts signed in accordance with the law according to law and collective contracts signed according to law.Need to deal with your personal information as an end user."}
{"task": "rw_2.jsonl", "id": 37109, "text": "(4) Provide you with collection, purchase, attention and sharing functions", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37110, "text": "In the process of using nails, you can choose to collect documents, text, pictures, videos that are interested in, establish a attention relationship with the service window and check number you are interested in, and use the functional components we provide to the third party.Share information.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37111, "text": "In the process of using the above functions, we will collect service log information including your collection, attention, and sharing history to achieve the above functions and other purposes we clearly notify.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect service log information including your collection, concerns, and sharing history."}
{"task": "rw_2.jsonl", "id": 37112, "text": "You can check or manage your collection information in the collection clip.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37113, "text": "(5) Help you use payment and wallet functions", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37114, "text": "In order to use a nail wallet, transfer, send red envelopes, and complete order payment, you need to bind the Alipay account and choose the payment method.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37115, "text": "We will put your nail platform account member name, the corresponding Alipay account member name, order payment related information, order security related equipment information, and other necessary information required by other anti -money laundering laws through the Alipay software tools embedded in the website or clientDevelopment packages (software tool development packages referred to as \"SDK\" in this policy) and other security methods shared with Alipay.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "We will share your membership name, the corresponding Alipay account member name, order payment related information, and the necessary information required by other anti -money laundering laws to share with Alipay."}
{"task": "rw_2.jsonl", "id": 37116, "text": "If you choose to provide you with a payment service by other financial institutions, we will also share your bank card payment, which is valid for the bank card, and share the necessary information of bank card payment with the corresponding financial institutions you choose.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will also share your necessary information including bank card number and validity period, and share the necessary information of bank card payment with the corresponding financial institutions you choose."}
{"task": "rw_2.jsonl", "id": 37117, "text": "In order to allow us to learn and confirm your payment progress and status in a timely manner, and to provide you with service after -sales and dispute solutions, you agree that we can collect the transaction objects, Alipay or other financial institutions you choose.information.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "You agree that we can collect and pay the progress related information from the transaction objects you choose, Alipay or other financial institutions you choose to learn about your payment progress and status."}
{"task": "rw_2.jsonl", "id": 37118, "text": "You can check the Alipay account information bound by your nail account or apply for replacing the bound Alipay account.", "label": ["Important", "Edit/Control"], "rewrite": "You can check the Alipay account information bound to the nail account or apply for replacement of the bound Alipay account."}
{"task": "rw_2.jsonl", "id": 37119, "text": "(6) show you personalized content and services", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37120, "text": "To show you the content or service that meets your needs more, we will collect and use device information when you use your access or using a nail website or a client (including equipment identifiers (IMEI, IDFA, Android, ID, MAC, OAID, IMSI and other device -related information), application information (application crash information, notification switch status, application installation list and other application related information), equipment parameters and system information (device type, device model, operating system and hardware -related information), related information), related informationEquipment network environment information (IP address, WIFI information, base station information and other network -related information), service log information (browse records, click to view records, search query records, collectors, pay attention to sharing information, publish information, IP address, browsing, browsingType types, telecommunications operators, language, access date and time), the basic information you submitted, the information you are organized (such as industry, roles), predict your preference characteristics through algorithm models, match the content you may be interested inOr service.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We will collect and use the device information, application information, equipment parameters and system information when you use your access or using the nail website or client to predict your preference characteristics and match the content or service you may be interested in."}
{"task": "rw_2.jsonl", "id": 37121, "text": "If you want to close the personalized content we push you, you can close it in \"Settings-Privacy-Personalized Content Recommendation\".", "label": ["Important", "Edit/Control"], "rewrite": "You can turn off personalized content push in \"Settings-Privacy-Personalized Content Recommendation\"."}
{"task": "rw_2.jsonl", "id": 37122, "text": "(7) Customer service and dispute handling", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37123, "text": "When you contact us or propose the application for sale, after -sales, and dispute dispute handling, in order to ensure your account and system security, we need you to provide the necessary personal information to verify your user identity.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you contact us or propose the application for sale, after -sales, and dispute dispute handling, we need you to provide the necessary personal information to verify your user identity."}
{"task": "rw_2.jsonl", "id": 37124, "text": "In order to facilitate the treatment plan and results of helping you solve the problem or record related issues as soon as possible, we may save your communication, communication/call records and related content (including account information, work order information, to prove to prove to prove it to proveOther information provided by related facts, or contact information you leave).", "label": ["Important", "First Party Collection Information"], "rewrite": "We may save your communication, communication/call records and related content in order to help you solve the problem."}
{"task": "rw_2.jsonl", "id": 37125, "text": "If you consult, complain or provide suggestions for the specific work order, we will use your account information and work order information.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you consult, complain or provide suggestions for the specific work order, we will use your account information and work order information."}
{"task": "rw_2.jsonl", "id": 37126, "text": "In order to provide reasonable needs of services and improve service quality, other information we may also use, including the relevant information you provided when you contact the customer service, the questionnaire answering information you sent to us during the questionnaire survey.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may also use the relevant information provided when you contact the customer service, and you participate in the questionnaire answer information sent by the questionnaire."}
{"task": "rw_2.jsonl", "id": 37127, "text": "(8) Provide you with information disclosure release functions for comments and Q & A", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37128, "text": "You can use the nail service windows, nails, nailing corporate squares, announcement, comments, typical customer cases, live broadcast and other information release functions of the information release function, including as nail users, which can publish informationText/video/live content, links, publishing and Q & A content, and as a third -party application service provider manager publishing goods and/or service related information and store -related information at the Nailing Application Center.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You can publish information through the information release function we provided for you."}
{"task": "rw_2.jsonl", "id": 37129, "text": "When you are paying attention to users or accounts in nails, we will show you the content of the corresponding publisher. When you publish, comment, like, forward it or recommend it, we will collect your aforementioned information to you for yourFriends show the corresponding content.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "When you pay attention to the user or account in the nail, we will show the content of the corresponding content publisher. When you publish, comment, like, repost or recommend it, we will collect your aforementioned information and show your friends to displayEssence"}
{"task": "rw_2.jsonl", "id": 37130, "text": "We may judge whether you can enjoy the corresponding information release function authority based on your account type and network log information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may judge whether you can enjoy the corresponding information release function authority based on your account type and network log information."}
{"task": "rw_2.jsonl", "id": 37131, "text": "At the same time, based on the requirements of laws and regulations, we will show the recent IP territorial information on the recent IP of the account in the nails, service windows and similar functions.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will show the recent IP territory information of the information publishing an account in Nailing, service windows and similar functions."}
{"task": "rw_2.jsonl", "id": 37132, "text": "Please note that the information you publish may involve your or other people's personal information and even sensitive personal information. If you choose to upload pictures containing personal information when evaluating.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "The information you publish may involve your or other people's personal information and even sensitive personal information."}
{"task": "rw_2.jsonl", "id": 37133, "text": "Please consider whether to share or even publicly share relevant information when using our services.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37134, "text": "If you involve the personal information of others in your public release, you need to obtain the consent of others before the release.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "If you involve the personal information of others in your public release, you need to obtain the consent of others before the release."}
{"task": "rw_2.jsonl", "id": 37135, "text": "(9) Provide you with security", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37136, "text": "In order to fulfill the legal obligations to ensure cybersecurity, improve the security of your use of us and our affiliates and partners, protect the safety of personal property of you or other users or the public, and better prevent fishing websites, fraud, andNetwork vulnerabilities, computer viruses, cyber attacks, network invasion risks, and more accurately identify the cases of violating laws and regulations or related agreements and rules.Service log information, and may use or integrate your account information, transaction information, equipment information, service log information, and information that our affiliated companies and partners obtain your authorization or sharing according to law (Among them, we may be in the application background operation period of the application background period.Collect MAC address, IMEI, and other device identifiers for risk verification) to comprehensively judge your accounts and transaction risks, conduct authentication, test and prevent security incidents, and take necessary records, audit, analysis, and disposal measures in accordance with the law.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37137, "text": "In the iOS device, you can choose to open the security password lock in the security center, and we will call the Face-ID authentication method of the device according to the actual situation.", "label": ["Edit/Control", "Important"], "rewrite": "We will call the Face-ID authentication method of the device according to the actual situation."}
{"task": "rw_2.jsonl", "id": 37138, "text": "(10) Other additional services provided for you", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37139, "text": "1. Additional services based on system permissions", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37140, "text": "In order to provide you with more convenient, better, and personalized products and/or services, and strive to improve your experience, we may collect and use your personal information by opening system permissions in the following additional services.For example, the convenient operation of nails is achieved through Siri voice assistant in iOS devices.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "We may collect and use your personal information in the additional service provided to you."}
{"task": "rw_2.jsonl", "id": 37141, "text": "If you do not agree to start the relevant permissions, it will not affect your basic services to use nails, but you may not get the user experience brought by these additional services to you.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37142, "text": "You can decide these permissions to open or close at any time.", "label": ["Important", "Edit/Control"], "rewrite": "You can decide these permissions to open or close at any time."}
{"task": "rw_2.jsonl", "id": 37143, "text": "Please note that you can start the right of permissions. It means that you can collect and use relevant personal information to provide you with corresponding services. You turn off any authority. It means that you have canceled the authorization. We will no longer continue to collect and use related authority based on the corresponding permissions.Personal information cannot continue to provide you with the service corresponding to the permissions.", "label": ["Edit/Control", "Risk", "Usage", "Important"], "rewrite": "The opening of one authority means that the authorization is authorized to collect and use the relevant information to provide corresponding services. Close the authority to cancel the authorization representative, and no longer continue to collect and use relevant information based on the corresponding permissions."}
{"task": "rw_2.jsonl", "id": 37144, "text": "The decision of your closure authority will not affect the collection and use of information based on your authorization.", "label": ["Permission Acquisition", "Edit/Control", "Risk", "Important"], "rewrite": "The decision of your closure authority will not affect the collection and use of information based on your authorization."}
{"task": "rw_2.jsonl", "id": 37145, "text": "You can, click here to view the \"Application of Application and Usage\".", "label": ["Permission Acquisition", "Important"], "rewrite": "You can click here to view \"Application Power Application and Use Instructions\"."}
{"task": "rw_2.jsonl", "id": 37146, "text": "2. Cookie and services of similar technologies", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37147, "text": "Cookie and similar device information identification technology are commonly used in the Internet.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37148, "text": "When you use our service, we may use related technologies to send one or more, cookie, or anonymous identifiers (hereinafter referred to as \"Cookie\") to collect, identify and store your access, use this product, use this productInformation about time.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may use cookies or anonymous identifiers to collect, identify and store information when you access and use this product."}
{"task": "rw_2.jsonl", "id": 37149, "text": "We promise that cookies will not be used for any other purposes other than the purpose of this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37150, "text": "We use Cookie to ensure the safety and efficient operation of products and services. It can make us confirm the security status of your account and transaction, check the related abnormal conditions of collapse and delay, and help you save the steps of filling in your form and entering search content.And process.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37151, "text": "At the same time, we may use, cookie, show you the information or function you may be interested in, and optimize your choice of advertising.", "label": ["Important", "Usage"], "rewrite": "We may use Cookie to show you the information or functions you may be interested in."}
{"task": "rw_2.jsonl", "id": 37152, "text": "Most browsers provide users with the function of removing the browser cache data. You can perform the corresponding data clearing operation, or you can modify the degree of acceptance of cookies or reject our cookies.", "label": ["Edit/Control", "Important"], "rewrite": "You can perform the corresponding data clearing operation, or you can modify the degree of acceptance of Cookie or reject our cookies."}
{"task": "rw_2.jsonl", "id": 37153, "text": "You may not be able to use services or corresponding functions that depend on cookies because of these modifications.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37154, "text": "(11) Other rules of collecting and using personal information", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37155, "text": "1. If the information you provide contains personal information of other users, you need to ensure that you have obtained legal authorization before providing these personal information to the nails.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Before providing information with personal information containing other users, you need to ensure that you have obtained legal authorization."}
{"task": "rw_2.jsonl", "id": 37156, "text": "2. If we use information for other purposes that are not stated in this policy, or use information collected based on specific purposes for other purposes, we will get your consent in advance.", "label": ["Important", "Usage"], "rewrite": "If we use information for unreasonable uses, we will get your consent in advance."}
{"task": "rw_2.jsonl", "id": 37157, "text": "3. Under the premise of the processing of security encryption technology, we will use the collected data for machine learning and algorithm model training to better provide you with services.", "label": ["Important", "Data Security", "Usage"], "rewrite": "We will use the collected data to train machine learning, algorithm model training to better provide you with services."}
{"task": "rw_2.jsonl", "id": 37158, "text": "You can, click here to view the nail algorithm service description.", "label": ["Important", "Usage"], "rewrite": "You can click here to view the Nailing algorithm service description."}
{"task": "rw_2.jsonl", "id": 37159, "text": "4. In order to achieve the service purpose of third -party applets, nails will help third -party applets get your shear information.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Nailing will help third -party applets get your shear information."}
{"task": "rw_2.jsonl", "id": 37160, "text": "3. Provide information to the outside world", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37161, "text": "(1) Sharing", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37162, "text": "We will not share your personal information with companies, organizations and individuals other than Nail Technology Co., Ltd., except the following situations:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not share your personal information with companies, organizations and individuals other than Nail Technology Co., Ltd., except the following situations:"}
{"task": "rw_2.jsonl", "id": 37163, "text": "1. Perform the sharing necessary for the legal obligations: we may share your personal information in accordance with the requirements of laws and regulations, litigation, and disputes in accordance with the requirements of administrative and judicial organs in accordance with the requirements of administrative and judicial organs in accordance with the law, and other legal obligations.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share your personal information in accordance with the requirements of laws and regulations, litigation, and disputes, or in accordance with the requirements put forward by administrative and judicial organs in accordance with the law, as well as other legal obligations."}
{"task": "rw_2.jsonl", "id": 37164, "text": "2. Sharing your consent: After getting your clear consent, we will share your personal information with other parties.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After getting your clear consent, we will share your personal information with other parties."}
{"task": "rw_2.jsonl", "id": 37165, "text": "3. In order to set up and fulfill your sharing in the case of your contract as a party: if you buy goods or services through nails, we will share the necessary information related to transaction information in your order information according to your choice.Related goods or services providers to realize your needs of transactions, distribution and after -sales service.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You buy goods or services by nailing, and we will share the necessary information related to transactions in your order information to related products or services according to your choice."}
{"task": "rw_2.jsonl", "id": 37166, "text": "4. Sharing with affiliated companies: In order to facilitate us to provide some services to you with affiliates, provide you with products and services based on nail accounts, recommend information that you may be interested inPersonal property of the company or other users or other users or the public is exempted, and your personal information may be shared with our affiliated company and/or the designated service provider.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "To facilitate us to provide some services with related companies, your personal information may be shared with our affiliated companies and/or its designated service providers."}
{"task": "rw_2.jsonl", "id": 37167, "text": "We will only share the necessary personal information and be restricted by the purpose declared in this policy. If we share your sensitive personal information or the purpose of changing personal information to change personal information, we will solicit your authorization consent again.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If we share your sensitive personal information or related companies to change the purpose of the use and processing of personal information, we will solicit your authorization consent again."}
{"task": "rw_2.jsonl", "id": 37168, "text": "You can, click here to view the cooperation in cooperation with the third -party data.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You can click here to view the cooperation in cooperation with third -party data."}
{"task": "rw_2.jsonl", "id": 37169, "text": "Please note that when you use our service, you voluntarily share or even publicly share information, which may involve your or other people's personal information and even sensitive personal information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "When you use our service, you voluntarily shared or even publicly shared information, which may involve personal information of you or others and even sensitive personal information."}
{"task": "rw_2.jsonl", "id": 37170, "text": "Please consider and make a decision more cautiously.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37171, "text": "(2) Entrusted processing", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37172, "text": "We may entrust a partner to handle your personal information in order to authorize partners to represent you to provide you with certain services or fulfilling functions.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may entrust a partner to handle your personal information in order to authorize partners to provide some services or fulfilling functions on behalf of us."}
{"task": "rw_2.jsonl", "id": 37173, "text": "We will only entrust their information for the legal, correct, necessary, specific, and clear goals of this policy statement. We can authorize partners to only contact the information required by their duties, and we will ask for the agreement to request that it must not be requiredThis information is used for any other purpose beyond the scope of commission.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Authorized partners can only come into contact with the information required for their duties, and we will require it to use the agreement that it must not use the information for any other goal beyond the scope of entrustment."}
{"task": "rw_2.jsonl", "id": 37174, "text": "If the authorized partner will use your information for our unreasonable purpose, it will obtain your consent alone.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If the authorized partner will use your information for our unreasonable purpose, it will obtain your consent alone."}
{"task": "rw_2.jsonl", "id": 37175, "text": "At present, our authorized partners include the following types:", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37176, "text": "1. Authorized partners of advertising and analysis of service.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37177, "text": "Under the premise of using industry -universal security technology, we will entrust these partners to handle information about advertising, coverage, and effectiveness related to advertising.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will entrust partners to handle information about advertising, coverage and effectiveness related to advertising, coverage, and effectiveness under the premise of using industry -universal security technology."}
{"task": "rw_2.jsonl", "id": 37178, "text": "We will not commission your personal identity information to commission partners.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37179, "text": "2. Suppliers, service providers and other partners.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37180, "text": "We entrust the information to the suppliers, service providers and other partners who support our business to handle it. These support for the technical infrastructure services that we are entrusted to provide, analyze the usage methods of our services, provide customer service, pay conveniently, or perform academic academic academicsResearch and investigation.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We entrust the information to the suppliers, service providers and other partners who support our business."}
{"task": "rw_2.jsonl", "id": 37181, "text": "In order to ensure the stable operation and functional implementation of our client, so that you can use and enjoy more services and functions. Our application will embed the SDK or other similar applications of authorized partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Our applications are embedded in SDK or other similar applications of authorized partners."}
{"task": "rw_2.jsonl", "id": 37182, "text": "We will strictly test the application interface (API) and software tool development package (SDK) of the authorized partners to obtain relevant information, and strict data protection measures with the authorized partners, so that it will be in accordance with this policy and any other any otherRelated confidentiality and security measures to handle personal information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will test the excuses of authorized partners to obtain relevant information for security testing and strict data protection measures with them."}
{"task": "rw_2.jsonl", "id": 37183, "text": "You can, click here to view the details we access.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You can click here to view the details we access."}
{"task": "rw_2.jsonl", "id": 37184, "text": "(3) Transfer", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37185, "text": "If we need to transfer personal information for the reasons for merging, separation, dissolution, and declaration of bankruptcy, we will inform you the name or name and contact information of the receiver.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you need to transfer personal information for the reasons for merging, separation, dissolution, and declaration of bankruptcy, we will inform you the name or name and contact information of the receiver."}
{"task": "rw_2.jsonl", "id": 37186, "text": "The receiver will continue to fulfill this policy and other legal obligations.", "label": ["Usage"], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37187, "text": "If the receiver changes the original treatment purpose and method of processing, you will re -obtain your consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If the receiver changes the original treatment purpose and method of processing, you will re -obtain your consent."}
{"task": "rw_2.jsonl", "id": 37188, "text": "(4) Public disclosure", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37189, "text": "We will only publicly disclose your personal information in the following circumstances:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only publicly disclose your personal information in the following circumstances:"}
{"task": "rw_2.jsonl", "id": 37190, "text": "1. Based on your active choice and other individual consent, we may publicly disclose your personal information;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Based on your active choice and other individual consent, we may publicly disclose your personal information."}
{"task": "rw_2.jsonl", "id": 37191, "text": "2. If we determine that you have violated laws and regulations or serious violations of the relevant agreements and rules of the nail platform, or to protect the security of personal property of the nail platform users or the public, we may disclose your personal information, includingRelated violations and measures that have taken the nail platform have taken you.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you determine your violation of laws and regulations or seriously violate platform rules, or to protect the safety of personal property of all parties, we may disclose personal information about you."}
{"task": "rw_2.jsonl", "id": 37192, "text": "Fourth, your rights", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37193, "text": "You can provide data rights requests to Ding Ding in the \"My-Settings-Security Center-Data Rights\" in the nail app. You can also check and manage your information through the following ways. We will be in compliance with laws and regulations.Response your request:", "label": ["Important", "Edit/Control"], "rewrite": "You can provide data rights requests to Ding Ding in the \"My-Settings-Security Center-Data Rights\" in the Nailing APP."}
{"task": "rw_2.jsonl", "id": 37194, "text": "(1) Review, correct and supplement", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37195, "text": "You have the right to check, correct and supplement your information through the following ways:", "label": ["Edit/Control", "Important"], "rewrite": "You have the right to check, correct and supplement your information through the following ways:"}
{"task": "rw_2.jsonl", "id": 37196, "text": "1. Nailing Enterprise Organization users: Open the official homepage of Dingtalk.com, select the \"Enterprise Login\" in the upper right corner to scan the QR code through nails to select the corporate organization and enter the passwordOA.DINGTALK.COM) can inquire and correct corporate organization control information, including address book information, invitation SMS settings, modifying the login password, replacing the supervisor, and setting up the child administrator.", "label": ["Important", "Edit/Control"], "rewrite": "Ding Ding Enterprise Organization Users: Open the official homepage of Dingtalk (Dingtalk.com), select the \"Enterprise Login\" in the upper right corner to scan the two -dimensional code through the nails to select the corporate organization and enter the password, and log in to the \"nail enterprise management background\" (OA.Dingtalk.com) can inquire and correct corporate organization control information."}
{"task": "rw_2.jsonl", "id": 37197, "text": "You can also choose to open or close the basic application of nails, third-party applications or self-built applications through the \"workbench-application management\".", "label": ["Important", "Edit/Control"], "rewrite": "You can choose to open or close the basic application of nails, third-party applications or self-built applications through the \"workbench-application management\"."}
{"task": "rw_2.jsonl", "id": 37198, "text": "2. Personal user: (1) Log in to the mobile client of the nail, and can query, correct personal information and personal account-related information by operating \"My-Settings-My Information\":Gender, birthday, region, and title information and complete personal real -person certification (face entry or ID information).", "label": ["Important", "Edit/Control"], "rewrite": "Personal user: (1) Log in to the mobile phone client, and use the operation of \"My-Settings-My Information\" can query and correct personal information and personal account-related information."}
{"task": "rw_2.jsonl", "id": 37199, "text": "(2) Log in to the mobile client, and seek online help through the following path \"My-customer service and help-online service\" to help you inquire, correct or supplement your information.", "label": ["Important", "Edit/Control"], "rewrite": "(2) Log in to the mobile client, and seek online help through the following path \"My-customer service and help-online service\" to help you inquire, correct or supplement your information."}
{"task": "rw_2.jsonl", "id": 37200, "text": "(2) Delete", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37201, "text": "You can delete your information through the path of \"(1), correct, and supplement your information\" column, or apply for a cancellation account to delete all your information.", "label": ["Important", "Edit/Control"], "rewrite": "You can delete your information through the path of \"(1), correct, and supplement your information\" column, or apply for a cancellation account to delete all your information."}
{"task": "rw_2.jsonl", "id": 37202, "text": "In the following circumstances, you can make a request to delete personal information to us by contacting customer service:", "label": ["Important"], "rewrite": "In the following circumstances, you can make a request to delete personal information to us by contacting customer service:"}
{"task": "rw_2.jsonl", "id": 37203, "text": "1. If our behavior of handling personal information violates laws and regulations;", "label": ["Important", "Edit/Control"], "rewrite": "If our behavior of handling personal information violates laws and regulations, you can ask for deletion of information."}
{"task": "rw_2.jsonl", "id": 37204, "text": "2. If we collect and use your personal information, it has not obtained your clear consent;", "label": ["Important", "Edit/Control"], "rewrite": "If we collect and use your personal information, but not obtain your clear consent, you can ask for deletion of information."}
{"task": "rw_2.jsonl", "id": 37205, "text": "3. If our behavior of handling personal information seriously violates your agreement;", "label": ["Important", "Edit/Control"], "rewrite": "If our behavior of handling personal information seriously violates your agreement, you can ask for deletion of information."}
{"task": "rw_2.jsonl", "id": 37206, "text": "4. If our treatment purpose has been achieved, cannot be achieved or is not necessary for the purpose of the treatment;", "label": ["Important", "Edit/Control"], "rewrite": "If our processing purpose has been achieved, unable to achieve, or is not necessary for the purpose of processing, you can ask for deletion of information."}
{"task": "rw_2.jsonl", "id": 37207, "text": "5. If we stop providing products or services, or the storage period has expired.", "label": ["Important", "Edit/Control"], "rewrite": "If we stop providing products or services, or the storage period has expired, you can ask for deletion of information."}
{"task": "rw_2.jsonl", "id": 37208, "text": "If we decide to respond to your deletion request, we will also notify the subject of your personal information from our personal information as much as possible at the same time, and ask them to delete it in time (unless laws and regulations have other regulations, or these subjects have independently obtained your authorization)Essence", "label": ["Important", "Edit/Control"], "rewrite": "If we decide to respond to your deletion request, we will also notify the main body of your personal information from us at the same time as much as possible and ask them to delete them in time."}
{"task": "rw_2.jsonl", "id": 37209, "text": "When you or we assisted you to delete the relevant information, because of the applicable legal and security technical restrictions, we may not be able to immediately delete the corresponding information from the backup system.Treatment until the backup can be removed or achieved anonymous.", "label": ["Edit/Control", "Data Security", "Important"], "rewrite": "We store your personal information securely and restrict any further processing of it until the backup can be removed or achieved anonymous."}
{"task": "rw_2.jsonl", "id": 37210, "text": "(3) Change the scope of authorization", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37211, "text": "You can change or withdraw the scope of your personal information in the following ways or withdrawn or process your personal information:", "label": ["Important", "Edit/Control"], "rewrite": "You can change or withdraw the scope of your personal information in the following ways or withdrawn or process your personal information:"}
{"task": "rw_2.jsonl", "id": 37212, "text": "1. Enterprise organization users: You can open the \"enterprise login\" in the upper right corner by opening the \"Enterprise Login\" by opening the two -dimensional code through the \"Dingtalk.com) of Dingtalk.com.(OA.DINGTALK.com), select or close the basic application of nails, third-party applications or self-built applications through \"Workbage-Application Management\".", "label": ["Edit/Control", "Important"], "rewrite": "1. Enterprise organization users: You can open the \"enterprise login\" in the upper right corner by opening the \"Enterprise Login\" by opening the two -dimensional code through the \"Dingtalk.com) of Dingtalk.com.(OA.DINGTALK.com), select or close the basic application of nails, third-party applications or self-built applications through \"Workbage-Application Management\"."}
{"task": "rw_2.jsonl", "id": 37213, "text": "2. Personal user: You can set up in the mobile client, through \"My-Settings-Privacy\", or contact Nailing customer service, or change your intelligent mobile device settingsAgree (you can change and recover your authorization in the mobile client app \"Settings-Privacy\").", "label": ["Important", "Edit/Control"], "rewrite": "2. Personal user: You can give or recover the authorization consent in the method of logging in to the mobile client, through the \"My-Settings-Privacy\" settings, or contact your smart mobile device settings."}
{"task": "rw_2.jsonl", "id": 37214, "text": "For the authorization that you cannot directly set through the above method, you can modify it through customer service contact, but please note that for some types of personal information, the information necessary for some types of personal information or the obligations required by our law and regulations mustFor information, we may not be able to respond to your request to change the scope of authorization.", "label": ["Edit/Control", "Important"], "rewrite": "For the authorization that you cannot directly set through the above method, you can modify it through customer service contact."}
{"task": "rw_2.jsonl", "id": 37215, "text": "When you withdraw authorization, we will no longer process the corresponding personal information.", "label": ["Important", "Edit/Control"], "rewrite": "When you withdraw authorization, we will no longer process the corresponding personal information."}
{"task": "rw_2.jsonl", "id": 37216, "text": "But your decision to withdraw authorization will not affect our personal information processing based on your previous authorization.", "label": ["Permission Acquisition", "Edit/Control", "Risk", "Important"], "rewrite": "Your decision to withdraw authorization will not affect personal information processing based on your authorization."}
{"task": "rw_2.jsonl", "id": 37217, "text": "(4) Logging out the account", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37218, "text": "You can apply for a cancellation of your account in the following ways:", "label": ["Edit/Control", "Important"], "rewrite": "You can apply for a cancellation of your account in the following ways:"}
{"task": "rw_2.jsonl", "id": 37219, "text": "1. Nailing Enterprise Organization users: You can log in to the latest version of Ding Ding Client, through the mobile phone-workbench-Enterprise Management-More Settings-Disbanding Enterprise Process, according to the interface prompt operation;", "label": ["Important", "Edit/Control"], "rewrite": "1. Nailing Enterprise Organization users: You can log in to the latest version of Dingbing Client, through the mobile phone-workbench-Enterprise Management-Other Settings-Disbanding Enterprise Process, and operate according to the interface prompts."}
{"task": "rw_2.jsonl", "id": 37220, "text": "You can also use Dingtalk.com-Enterprise Login-Settings-Disding the Enterprise Process and operate according to the interface prompt.", "label": ["Important", "Edit/Control"], "rewrite": "You can use Dingtalk.com-Enterprise Login-Settings-Disding the Enterprise Process and operate according to the interface prompt."}
{"task": "rw_2.jsonl", "id": 37221, "text": "2. Personal user: You can log in to the latest version of the Nail Client, nail on my-Settings-Security Center-Account Settings-more-cancel the nail account process through the mobile phone end, and the operation can be operated according to the interface prompt.", "label": ["Important", "Edit/Control"], "rewrite": "2. Personal user: You can log in to the latest version of the Nail Client, nail on my-Settings-Security Center-Account Settings-more-cancel the nail account process through the mobile phone end, and the operation can be operated according to the interface prompt."}
{"task": "rw_2.jsonl", "id": 37222, "text": "Please note that Nailing only supports the application for cancellation on the mobile phone. After your active cancellation of the account, we will stop providing you with products or services and delete or deal with your personal information according to the requirements of applicable laws.", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "After you take the initiative to cancel your account, we will stop providing you with products or services and delete or process your personal information."}
{"task": "rw_2.jsonl", "id": 37223, "text": "(5) Automatic decision -making of constraint information systems", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37224, "text": "In certain business functions, we may make decisions only based on the non -artificial automatic decision mechanism, including the algorithm.", "label": ["Important", "Usage"], "rewrite": "We may make a decision based on the non -artificial automatic decision mechanism, including the algorithm."}
{"task": "rw_2.jsonl", "id": 37225, "text": "If these decisions affect your legitimate rights and interests, you can contact us through customer service.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37226, "text": "(6) In response to your above request", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37227, "text": "For your or your guardians, close relatives, and other authority to make the above requests to us, and your relevant personal information rights stipulated in the laws of the People's Republic of China and other applicable laws, you can contact us through customer service or directly to us to usPersonal information protection full -time departments initiated complaints.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37228, "text": "We will make a reply within 15 days.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37229, "text": "To ensure your account security and your personal information security, when you make a request to us, we may verify your identity (such as adding account verification, requesting you to provide written requests or other reasonable ways), and then process youRequest.", "label": ["Important", "Edit/Control"], "rewrite": "We may verify your identity first, and then process your request."}
{"task": "rw_2.jsonl", "id": 37230, "text": "For your reasonable request, we do not charge fees in principle, but we will charge a certain fee as appropriate for requests that repeat and beyond the reasonable limit.", "label": ["Important", "Edit/Control"], "rewrite": "Reasonable requests are not charged in principle without charging and exceeding the reasonable limit."}
{"task": "rw_2.jsonl", "id": 37231, "text": "For information that is not directly associated with your identity, the information that is repeatedly applied without reasonable reasons, or you need too many technical means (if you need to develop a new system or change the current convention fundamentally), bring risks to others' legitimate rights or notIn actual requests, we may refuse.", "label": ["Important", "Edit/Control"], "rewrite": "We may refuse to repeat for unseen, need too much technical means, bring risks or very unrealistic requests to others' legitimate rights and interests."}
{"task": "rw_2.jsonl", "id": 37232, "text": "5. Storage of information", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37233, "text": "(1) Storage period", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37234, "text": "We will only retain your personal information within the time limit required for the cost of reaching the cost policy, unless the law has compulsory retention requirements, such as the \"E -Commerce Law\" requires that goods and service information and transaction information preservation time is required.It's not less than three years.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "Generally, your personal information is retained within the time limit required to achieve service purposes, unless the law has other requirements."}
{"task": "rw_2.jsonl", "id": 37235, "text": "We judge the storage period of personal information mainly based on the following standards:", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37236, "text": "1. Complete your related transaction purpose, maintain the corresponding transactions and business records to cope with your possible inquiries or complaints;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37237, "text": "2. Ensure that we provide you with service safety and quality;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37238, "text": "3. Do you agree to a longer retention period;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37239, "text": "4. According to the relevant needs of the timeliness of litigation;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37240, "text": "5. Whether there are other special agreement or laws and regulations on the retention period.", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37241, "text": "After exceeding the reservation period, we will delete or deal with your personal information according to the requirements of the applicable law.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "After exceeding the storage period, your personal information will be deleted or anonymous."}
{"task": "rw_2.jsonl", "id": 37242, "text": "(2) Storage location", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37243, "text": "The personal information we collected and generated in the operation of the People's Republic of China will be stored in China.", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in domestic operations will be stored in China."}
{"task": "rw_2.jsonl", "id": 37244, "text": "In the following circumstances, we will provide your personal information to possible overseas entities after fulfilling the obligations stipulated in the law:", "label": ["Data Retention", "Important", "Risk"], "rewrite": "In the following circumstances, we will provide your personal information to possible overseas entities after fulfilling the obligations stipulated by the law: 1. The applicable laws have clearly stipulated;E -commerce transactions and other types of contracts are required."}
{"task": "rw_2.jsonl", "id": 37245, "text": "1. Applicable laws have clear regulations;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37246, "text": "2. Get your individual consent;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37247, "text": "3. As a cross -border e -commerce transaction and other types of contracts for one party, you are necessary for the establishment and other types of contracts.", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37248, "text": "In response to the above situations, we will protect your personal information security in accordance with this policy.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37249, "text": "(3) Storage safety", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37250, "text": "1. Data protection technical measures", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37251, "text": "We have adopted our information that meets industry standards, reasonable and feasible security measures to protect your information, and prevent personal information from being disclosed, used, modified, damaged or lost by unauthorized access, publicly disclosed, used, modified, damaged, or lost.", "label": ["Important", "Data Security"], "rewrite": "Take security measures to protect your information to prevent personal information from being unauthorized, disclosed, use, modified, damaged or lost."}
{"task": "rw_2.jsonl", "id": 37252, "text": "We will use encrypted technology to improve the security of personal information. When you exchange data between your browser and the server, the SSL protocol is encrypted and protected. We provide the HTTPS protocol security browsing method;", "label": ["Important", "Data Security"], "rewrite": "Using encryption technology to improve the security of personal information, when switching data between browsers and servers is protected by SSL protocols."}
{"task": "rw_2.jsonl", "id": 37253, "text": "We will use a trusted protection mechanism to prevent personal information from being maliciously attacked;", "label": ["Important", "Data Security"], "rewrite": "We will use a trusted protection mechanism to prevent personal information from being maliciously attacked."}
{"task": "rw_2.jsonl", "id": 37254, "text": "We will deploy the access control mechanism to make every effort to ensure that only authorized personnel can access personal information.", "label": ["Important", "Data Security"], "rewrite": "We will deploy the access control mechanism to ensure that only authorized personnel can access personal information."}
{"task": "rw_2.jsonl", "id": 37255, "text": "At present, our important information systems have been protected by network security level protection, ISO27001: 2013 information security management system standard certification, 27018: 2014 public cloud personal information protection management system certification, SOC3 service audit report.", "label": ["Important", "Data Security"], "rewrite": "Our important information system has been protected by network security level, ISO27001: 2013 information security management system standard certification, 27018: 2014 public cloud personal information protection management system certification, SOC3 service audit report."}
{"task": "rw_2.jsonl", "id": 37256, "text": "2. Measures for data protection management organization", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37257, "text": "We have established a data security management system that is advanced in the industry with data as the core and the data security management system around the data life cycle, and improves the security of personal information from organizational construction, institutional design, personnel management and product technology.", "label": ["Important", "Data Security"], "rewrite": "Establish a data security management system to improve the security of personal information from organizational construction, system design, personnel management and product technology."}
{"task": "rw_2.jsonl", "id": 37258, "text": "We have set up a full -time department for personal information protection and designated a special person to be responsible for the protection of personal information.", "label": ["Important", "Data Security"], "rewrite": "Set up a full -time department for personal information protection and designate a special person to be responsible for the protection of personal information."}
{"task": "rw_2.jsonl", "id": 37259, "text": "Through training courses and examinations, we have continuously strengthened employees' awareness of protecting the importance of personal information.", "label": ["Important", "Data Security"], "rewrite": "Through training courses and examinations, employees have continuously strengthened employees' awareness of protecting the importance of personal information."}
{"task": "rw_2.jsonl", "id": 37260, "text": "3. Response of personal information security incident", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37261, "text": "If our physical, technical, or management protection facilities are damaged, and the information is caused by unauthorized access, public disclosure, tampering or destruction, and damage to your legitimate rights and interests, we will launch an emergency plan in time and take reasonable and necessary measures.In order to reduce the impact on your personal.", "label": ["Important", "Data Security"], "rewrite": "We will launch an emergency plan in time and take reasonable and necessary measures to deal with personal information security incidents."}
{"task": "rw_2.jsonl", "id": 37262, "text": "If a personal information security incident occurs, we will also inform you the basic situation and possible impact of the security incident in accordance with the requirements of the laws and regulations.Remedy.", "label": ["Important", "Data Security"], "rewrite": "If a personal information security incident occurs, we will inform your basic situation, possible impact, disposal measures, independent prevention suggestions, etc."}
{"task": "rw_2.jsonl", "id": 37263, "text": "We will inform you in SMS, telephone, push notification, and other reasonable channels that it is difficult to inform one by one. We will publish an announcement in a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "The relevant situation of security incidents will be informed by mail, letter, telephone, push notification, etc. When it is difficult to inform one by one, it will issue an announcement."}
{"task": "rw_2.jsonl", "id": 37264, "text": "At the same time, we will also report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "Report the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities."}
{"task": "rw_2.jsonl", "id": 37265, "text": "4. Prevention of account security risk", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37266, "text": "When using the nail platform service, you inevitably disclose your personal information from the other party or the potential transaction of the transaction, such as contact or contact address.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37267, "text": "In addition, you can also establish communication, exchange information or analysis content with our services.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37268, "text": "Please protect your personal information properly, provides others only under the necessary circumstances, and do not trust the transaction through other trading tools to avoid the stolen information or even encounter telecommunications network fraud.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37269, "text": "If you are worried about your personal information, especially your account or password, please contact our customer service immediately so that we can take corresponding measures based on your application.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37270, "text": "You can also independently perform \"account settings\", \"freezing and thawing\", \"privacy switch\" in \"My-Settings-Security Center\", and submitting fraud complaints.", "label": ["Important", "Edit/Control"], "rewrite": "You can independently perform \"account settings\", \"freezing and thawing\", \"privacy switch\", and submit fraud complaints in \"My-Settings-Security Center\"."}
{"task": "rw_2.jsonl", "id": 37271, "text": "6. Policy update", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37272, "text": "In order to bring you a better product and service experience, we continue to strive to improve our products, services and technology.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37273, "text": "When the new service and business processes change, we may update our privacy policy to inform you of specific changes.", "label": ["Policy Change", "Important"], "rewrite": "When the new service and business processes are changed, our privacy policy will be updated to inform you of the specific changes."}
{"task": "rw_2.jsonl", "id": 37274, "text": "But without your clear consent, we will not limit your rights you enjoy in accordance with this policy.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37275, "text": "For major changes, we will also provide more significant notifications (including we will notify the notification through the red dot or provide you with a pop -up window).", "label": ["Policy Change", "Important"], "rewrite": "For major changes, we will provide a more significant notice."}
{"task": "rw_2.jsonl", "id": 37276, "text": "The major changes referred to this policy include:", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37277, "text": "1. The business model of the product has changed significantly.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37278, "text": "Such as the purpose of handling personal information, the type of personal information, and the use of personal information;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37279, "text": "2. The main body of the privacy policy caused by business adjustment and transaction mergers and acquisitions, and the new subject receiving party changes the original processing purpose and method of treatment;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37280, "text": "3. The main object of personal information sharing or public disclosure changes;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37281, "text": "4. User personal information rights and their exercise methods have changed significantly;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37282, "text": "5. When dealing with the person in charge of the person in charge of the personal information protection and the change of complaint channels;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37283, "text": "6. Personal information protection assessment report shows that the existence of products has a significant impact on personal rights.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37284, "text": "We will also archive the old version of this policy on the special page of Dingbing for you.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37285, "text": "7. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37286, "text": "In digital office/learning, communication and collaborative activities, we predecessors you have the corresponding civil behavior capabilities.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37287, "text": "If you are a minor, we ask you to ask your parents or other guardians to read this policy carefully, and use our services or provide information to us under the consent of your parents or other guardians.", "label": ["Specific Audiences", "Important"], "rewrite": "Minors should use services or provide information on the premise of obtaining your parents or other guardians."}
{"task": "rw_2.jsonl", "id": 37288, "text": "If you are under 14 years of age, before you use our service, you and your guardian should carefully read the \"Instructions for the use of Nailing Nail Conservation Models\", \"Personal Information Protection Rules and Personal Information Protection Rules and Personal Information Protection Rules and Personal Information Protection Rules of Children.Instructions for the guardian to ensure that after obtaining the consent of the guardian, you can use our services under the guidance of the guardian to ensure that you are safe when using our services and trading.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are under the age of 14, you can use our services under the guidance of the guardian after obtaining the consent of the guardian."}
{"task": "rw_2.jsonl", "id": 37289, "text": "If you are a child's parents or other guardians, please pay attention to whether the child uses our service after obtaining your authorization consent.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a child's parents or other guardians, please pay attention to whether the child uses our service after obtaining your authorization consent."}
{"task": "rw_2.jsonl", "id": 37290, "text": "If you have any questions about your child's personal information, please contact our personal information protection department.", "label": ["Specific Audiences", "Contact Information"], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37291, "text": "Eight, contact us", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37292, "text": "You can contact us in the following ways. We will reply to your request within 15 days:", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37293, "text": "1. If you have any questions, opinions or suggestions on the content of this policy, you can contact us through my-customer service and help-online service;", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37294, "text": "2. We have also set up a full-time department for personal information protection. You can use [dingtalkteam@alibaba-inc.com] to contact it (please indicate that it is related to the [Nailing Platform] and explain the specific facts), office address: HangzhouBuilding 5, Park Park, No. 959, Gao Education Road, Wuchang Street, Yuhang District, Shi.", "label": ["Important", "Contact Information"], "rewrite": "Email: dingtalkteam@alibaba-disc.com; office address: No. 5 Park Park Park, No. 959, Wuchang Street, Wuchang Street, Yuhang District, Hangzhou."}
{"task": "rw_2.jsonl", "id": 37295, "text": "It should be noted that we may not reply to the issue that has nothing to do with the right to this policy or your personal information.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37296, "text": "If you are not satisfied with our reply, especially if you think our personal information processing behavior has harm your legitimate rights and interests, you can also seek solutions by filed a lawsuit to a court with jurisdiction in the place of residence in the defendant.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37297, "text": "Appendix: Related Definition", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37298, "text": "Nailing: Finger nail (domain name: dingtalk.com, aliwork.com) website and nail client.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37299, "text": "Nailing Service Provider: Fingering the Internet information and software technology service providers of Ding Ding Software Nail Technology Co., Ltd. and Nail (China) Information Technology Co., Ltd..", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37300, "text": "Nailing Enterprise Organization Service: Refers to the organizer representative of the administrator to create a nail enterprise organizational structure, and invite organizational members to download and register as a nail end user.The organizational digitalization and business digitalization of the enterprise, such as nailing smart personnel application services, nailing smart office application services, nail conference calls, corporate group chat, and nail service windows.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37301, "text": "User Organization users: Refers to the organized by an enterprise organized by an enterprise to organize the establishment of a nail enterprise organizational structure, inviting members of the organization to download, register the nail account or configure the exclusive account for the end user to complete the nailing enterpriseAfter the establishment of the organization, the enterprise organizes authorized administrators to allocate, open, manage, and use the use of nails to conduct online mobile office, communication and collaborative users.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37302, "text": "Nailing enterprise group nails and weaving users include nail certification enterprise organizations and non -certified enterprise organizations.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37303, "text": "Dingling enterprises organize users including legal persons, government agencies, other organizations, partnerships or individual industrial and commercial households.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37304, "text": "User Organization of Nail Certification Enterprise Organization: Refers to identify and verify the information and information submitted by the enterprise organization and its administrator or the legal representative through nailing or entrusted by the third -party audit agency.Organize users.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37305, "text": "The enterprise organization that completes the nail certification, the nails will determine the user's certification account name according to the qualified material submitted by the user, clarify the identity of the legal person and the subject of illegal persons (\"bright photos\"), generate certification logos and certification information, open the authentication enterprise exclusive exclusive exclusive enterprise excitementrights and interests.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37306, "text": "There is no doubt that nailing has the right to decide that the certified enterprise organization requires annual review certification or actively requests re -certification.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37307, "text": "If the authentication enterprise organizes the user certification information change, it is obliged to apply for change certification from the Ding Ding by itself.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37308, "text": "Dipping Enterprise Organization Manager: Refers to the authorized or designated by the nail enterprise to organize the user's authorization or designated, and the operation authority of the nail enterprise organization user management platform system, representing the company's personal user who organizes the opening, managing and using nail services.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37309, "text": "Enterprise Organization End users: Refers to the invitation, independent application, or being invited by the members of the enterprise organization, or the invitation of the members of the enterprise, and only the administrator's operation consent, and the organization members of the enterprise organization of the enterprise organization of the enterprise, referred to as the \"end user\".", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37310, "text": "When an enterprise user invites you to access its working platform as an end user, you will receive an invitation and you can choose whether to join the business user.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37311, "text": "Personal user: Refers to registering the nail account number through the mobile phone number and verification code, or using a third -party account to authorize the nails with a third -party account allowed by the nails.Users who use nail services with nail services.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37312, "text": "Personal information processor: Fingers that personal users or certified enterprises organize users in the use of nail services for online mobile office, communication and collaboration, they have the right to determine the organization or individual of personal information processing purposes and methods.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37313, "text": "Specifically, in the personal user service scenarios of Ding Ding, the nail is a personal information processing.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37314, "text": "At the same time, at the same time, the user's user and their administrators and end users use nail services to mobile office, communication and cooperation, and the end user personal information processor related to nail service is a nail enterprise organization.Users who use nail services for online mobile office, communication and cooperation at the same time, enrollment, transmission, storage, sharing, or generating the trustees who control the data to control data, according to the administrator's operation and configuration instructionsEnd user personal information) Type processing, storage, use, processing, transmission, provision, openness, and deletion of data.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37315, "text": "Enterprise organization control data: refers to the information and data submitted or generated during the process of using the user and its end users during the nail service, including the information submitted by the business user and its administrator or the request for the end userIn order to complete the work needs and meet the information of the daily management needs of enterprises, the information submitted to the enterprise users by the end user is specifically related to the relevant agreement on the control data of the enterprise organization. See the \"Policies of Nailing Privacy Policy\" about the control data of the enterprise organization.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37316, "text": "Related Company: Refers to the affiliated company of Nailing Service Provider, the latest listed company's annual report of Alibaba Group Holding Limited.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37317, "text": "Alipay: Refers to the main Alipay (China) Network Technology Co., Ltd. providing Alipay services.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37318, "text": "Personal information: Various information related to recognized or recognized natural persons recorded in electronics or other ways, excluding information after anonymous processing.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37319, "text": "Sensitive personal information: Once sensitive personal information is leaked or illegally, it is easy to lead to personal information that is harmful to natural person's personality dignity or personality and property security.Track information, and personal information of minors under the age of 14.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37320, "text": "Child: Refers to minors under the age of 14.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37321, "text": "Equipment information: Including device identifiers (IMEI, IDFA, Android ID, Mac, OAID, IMSI and other device -related information), application information (application crash information, notification switch status, application installation list, and other application related information), equipment parameters), equipment parametersAnd system information (device type, device model, operating system and hardware -related information), device network environment information (IP address, WIFI information, base station information and other network -related information).", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37322, "text": "The actual collection of the product shall prevail.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37323, "text": "Service log information: Including browsing records, click to view records, search query records, collection, transactions, after -sales, follow -up information, publishing information, and IP address, browser type, telecommunications operator, use language, access date and time.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37324, "text": "Decoration: Refers to the process of personal information processing, so that it cannot recognize specific natural persons without using additional information.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37325, "text": "Anonymous: Refers to the process that personal information cannot identify specific natural persons and cannot recover.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37326, "text": "Personal information deletion: Refers to removing personal information in a system involved in daily business functions, so that it keeps them from being retrieved and accessed.", "label": [], "rewrite": []}
{"task": "rw_2.jsonl", "id": 37327, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
