{"task": "rw_35.jsonl", "id": 49114, "text": "Cloud Flash Payment Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49115, "text": "1. This policy is applicable to users who register and use the Cloud Flash Pay App (except Hong Kong, Macao and Taiwan).", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49116, "text": "2. This policy is only applicable to China UnionPay Co., Ltd. (\"We\" or \"UnionPay\") to operate UnionPay Cloud Flash Pay APP to provide related products and services.", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49117, "text": "Update date: July 6, 2022", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49118, "text": "Effective date: July 11, 2022", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49119, "text": "If you have any questions, opinions or suggestions, please contact us through the following contact information:", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49120, "text": "Contact number: 95516", "label": ["Important", "Contact Information"], "rewrite": "Contact number: 95516"}
{"task": "rw_35.jsonl", "id": 49121, "text": "Email: Privacy@unionPay.com", "label": ["Important", "Contact Information"], "rewrite": "Email: Privacy@unionPay.com"}
{"task": "rw_35.jsonl", "id": 49122, "text": "Contact address: APP data support and governance team of Yunli Pay Department, No. 1699, Pudong New District, Shanghai, China", "label": ["Important", "Contact Information"], "rewrite": "Contact address: APP data support and governance team of Yunli Pay Department, No. 1699, Pudong New District, Shanghai, China"}
{"task": "rw_35.jsonl", "id": 49123, "text": "This policy will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49124, "text": "■ Collection and use of personal information", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49125, "text": "■ Personal information security management method", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49126, "text": "■ Protection and response of user rights", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49127, "text": "■ Protection of personal information of minors", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49128, "text": "■ Special reminder of sensitive personal information", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49129, "text": "■ Special processing rules for cross -border information", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49130, "text": "■ Cookie and similar technology applications", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49131, "text": "■ Protection of the personal information of the old users", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49132, "text": "■ Policy update method", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49133, "text": "■ appendix", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49134, "text": "We know the importance of personal information to you, and we will do our best to protect your personal information. Thank you for your trust in us.", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49135, "text": "We promise that in accordance with the mature security standards of the industry, we will take corresponding security protection measures to protect your personal information, and try our best to explain and inform you with easy -to -understand text expressions.The terms of major relationships are used to ask your attention in a thick manner.", "label": ["Important", "Data Security"], "rewrite": "Take corresponding security measures to protect your personal information and clearly inform the inform."}
{"task": "rw_35.jsonl", "id": 49136, "text": "We strongly recommend that you read and fully understand all the contents of this policy before using our service.", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49137, "text": "We will provide you with cloud flash payment app products and services based on your choice.", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49138, "text": "This policy is suitable for collecting, used, stored, storage and provides your personal information in the people's Republic of China (for the purpose of this privacy policy, except for Hong Kong, Australia, and Taiwan regions).", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49139, "text": "If you check \"I have read and agree\" and confirm the submission, it is deemed that you agree with this policy and authorize us to process your personal information in accordance with the provisions of this policy.", "label": ["Policy Change", "Important"], "rewrite": "If you checked \"I have read and agree\" and confirmed the submission, it is deemed to agree with this policy."}
{"task": "rw_35.jsonl", "id": 49140, "text": "1. Collection and use of personal information", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49141, "text": "(1) What information do we collect you", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49142, "text": "• Basic information, names, family addresses, phone numbers, occupations, nations, gender, age, nationality.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your basic information, including name, family address, phone number, occupation, ethnic, gender, age, nationality."}
{"task": "rw_35.jsonl", "id": 49143, "text": "• ID information issued by relevant government departments, such as ID cards, passports, Taiwan compatriots, driving licenses, military official cards, etc., to conduct real -name management of users.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your ID information for real -name management."}
{"task": "rw_35.jsonl", "id": 49144, "text": "• Personal financial identification information, (login password, query password, transaction password, dynamic password, SMS verification code, security problem, card CVN2).", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your personal financial identification information."}
{"task": "rw_35.jsonl", "id": 49145, "text": "Personal financial identification information is sensitive personal information.", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49146, "text": "• Biometric information, facial pictures, facial features, dynamic videos, fingerprints.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your biometric information, including facial pictures, facial features, dynamic videos, fingerprints."}
{"task": "rw_35.jsonl", "id": 49147, "text": "Biometric information is sensitive personal information.", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49148, "text": "• Bank card information, such as card issuing bank name, bank card type (debit card, credit card), UnionPay card level (general card, gold card, platinum card, diamond card) or other bank card information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your bank card information."}
{"task": "rw_35.jsonl", "id": 49149, "text": "Bank card information is sensitive personal information.", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49150, "text": "• Payment transaction information, use the transaction information promoted by cloud flash payment, such as transaction amount, transaction time, trading location, merchant name, merchant number, terminal number, acceptance agency, etc.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect information on transactions that you use cloud flash payments, such as transaction amount, transaction time, trading location, etc."}
{"task": "rw_35.jsonl", "id": 49151, "text": "Some payment transaction information is sensitive personal information.", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49152, "text": "• Use information, information about your activities and logs of product use and product use and browsing, such as in service, app, start information (time, place), including browsing historical records, search historical records, collection records, software use, software useRecords, product interaction, collapse information, performance and other diagnostic information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect information about your activities and product use and browsing logs."}
{"task": "rw_35.jsonl", "id": 49153, "text": "• Account information, your cloud flash payment account details, including cloud flash payment registration mobile phone number, email address, registered device, account status and registration time.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect details of your cloud flash payment account."}
{"task": "rw_35.jsonl", "id": 49154, "text": "GUID, SIM card IMSI information, etc., describes information about the basic situation of individuals.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect data that can be used to identify your device."}
{"task": "rw_35.jsonl", "id": 49155, "text": "• Location information, accurate location, general location, IP address.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your location information."}
{"task": "rw_35.jsonl", "id": 49156, "text": "Accurate location information is sensitive personal information.", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49157, "text": "• Other information you provide to us, such as the interactive content you submitted through the online customer service.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect other information you provide, such as interactive content."}
{"task": "rw_35.jsonl", "id": 49158, "text": "• Permanent information, authority information in the device, including address book information, location information, camera, mobile phone album, etc.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the permission information in your device."}
{"task": "rw_35.jsonl", "id": 49159, "text": "If you are an iOS system, click the path to \"setting-privacy\" in your device. If you are an Android system, click the path to \"Settings-Privacy-Permanent Management\" in your device.", "label": ["Important", "Edit/Control"], "rewrite": "Privacy management through \"Settings-Privacy\" (IOS system) or \"setting-privacy-permissions\" (Android system) in the device."}
{"task": "rw_35.jsonl", "id": 49160, "text": "Each related business function may open the item of the access permissions of your device. You can click here to query, and you can click here to query.", "label": ["Important", "Edit/Control"], "rewrite": "You can click here to query the device access permissions."}
{"task": "rw_35.jsonl", "id": 49161, "text": "(2) The purpose of your personal information", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49162, "text": "• Support for our services. We will collect the necessary personal information to support our services. The collected information may be used for the improvement of product or service, for auditing or data analysis.Diagnosis, etc.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collecting the necessary personal information to provide support for services, such as internal purposes such as product or service improvement, auditing or data analysis, or for fault diagnosis."}
{"task": "rw_35.jsonl", "id": 49163, "text": "• Processing your payment transactions to complete payment. For example, we need to collect your identity information, and the bank card information will issue a payment instruction to the payment bank.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your information to complete payment."}
{"task": "rw_35.jsonl", "id": 49164, "text": "• Communicate with you to carry out marketing of our products and services, such as notifying you to receive discounts, use rights, and participate in draws.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your information for marketing for our products and services."}
{"task": "rw_35.jsonl", "id": 49165, "text": "Sometimes we may use personal information to send important notices such as collecting and displaying your real -time payment dynamics.", "label": ["Important", "Usage"], "rewrite": "Use personal information to send important notice, such as displaying real -time payment dynamics."}
{"task": "rw_35.jsonl", "id": 49166, "text": "• Security and anti -fraud, in order to ensure the stability of services, while protecting your account property security, preventing losses and preventing fraud.", "label": ["Important", "Usage"], "rewrite": "Use your information for service security and anti -fraud."}
{"task": "rw_35.jsonl", "id": 49167, "text": "• Treatment of complaint disputes, in conjunction with the disputes you have during use, such as notifications of judicial requests and consumer rights protection departments.", "label": ["Important", "Usage"], "rewrite": "Use your information to process your disputes during use."}
{"task": "rw_35.jsonl", "id": 49168, "text": "• Comply with the law to comply with the application of applicable law -such as anti -money laundering compliance obligations or complying with the requirements of industry supervision reports.", "label": ["Important", "Usage"], "rewrite": "Use your information to obey the law."}
{"task": "rw_35.jsonl", "id": 49169, "text": "• Improve services to provide you with smoother and more convenient services.", "label": ["Important", "Usage"], "rewrite": "In order to provide you with a smoother and convenient service to use your information."}
{"task": "rw_35.jsonl", "id": 49170, "text": "For example, analysis software flickering and collapse.", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49171, "text": "(3) Basic business functions and expansion business functions", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49172, "text": "Cloud Flash Pay APP is a comprehensive payment application software that integrates bank card functions and management. We mainly provides the basic business functions that you provide around account registration, login, payment, bank card management, query bank discounts, points management, etc.At the same time, you can also use our expansion business functions such as shopping entertainment, wealth management, cloud flash payment applets, etc.", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49173, "text": "Our collection and use of information will follow the legitimacy foundation expressed in laws and regulations.", "label": ["Usage", "Data Security", "First Party Collection Information"], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49174, "text": "The basic business functions we provide need to rely on the necessary information to run. The necessary information refersWe provide or allow us to collect and use the necessary personal information. If you disagree, you will not be able to use our basic product services.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect the personal information necessary for the normal operation of APP basic functional services."}
{"task": "rw_35.jsonl", "id": 49175, "text": "For the details of the personal information processing of basic business functions, please refer to attachment 1 for details.", "label": ["Important", "First Party Collection Information"], "rewrite": "For details of the personal information processing of basic business functions, please refer to attachment 1 for details."}
{"task": "rw_35.jsonl", "id": 49176, "text": "You choose to use the expansion business function provided by the Cloud Flash Pay App, you need to provide or allow us to collect the corresponding personal information for the use of products and services. If you do not agree, do not affect the use of our basic business functions.Function collection details, see Annex II for details.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your active personal information for expanding the use of products and services."}
{"task": "rw_35.jsonl", "id": 49177, "text": "(4) How can we entrust, provide, transfer, and disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49178, "text": "1. Entrust processing", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49179, "text": "Part of the modules and functions of Yunli Pay Mall services in the Cloud Flash Pay APP are by Shanghai Rong Digital Information Technology Co., Ltd. (registered address/common office address: China (Shanghai) Free Trade Zone Maji Road No. 2, Room 08Contact information: [, 021-60606711]) Provide.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Part of the modules and functions of Yunli Pay Mall services are provided by Shanghai Rong Digital Information Technology Co., Ltd."}
{"task": "rw_35.jsonl", "id": 49180, "text": "We have signed strict data processing agreements with them, asking them to handle your personal information in accordance with our requirements, this policy, and any other related confidentiality and security measures. Without your authorization and our consent, they will not entrust other other to othersWe will take the necessary measures to supervise the personal information processing activities.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Signing a data processing agreement with the trustee, asking them to handle personal information as required. Without your authorization and our consent, they will not be transferred and will be supervised on personal information processing."}
{"task": "rw_35.jsonl", "id": 49181, "text": "2. Provide to the outside world", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49182, "text": "Unless you get your consent, we will not provide your personal information to any company, organization, and individual other than UnionPay. After you agree, we will only provide your personal information in legal, correct, necessary, and clear purposes to provide your personal informationAnd only provide the necessary personal information of the service, except for other provisions of laws and regulations.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We provide your necessary personal information for your legal, correct, necessary, and clear purpose after you agree."}
{"task": "rw_35.jsonl", "id": 49183, "text": "For companies and organizations we provide personal information, we will sign strict data processing agreements with them, asking themOrganization provides data security capabilities and information security qualifications (such as level protection evaluation, information security management system, etc.).", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "For companies and organizations we provide personal information, we will sign an agreement with them, asking them to process personal information as agreed, and ask them to provide data security capabilities and information security qualification descriptions."}
{"task": "rw_35.jsonl", "id": 49184, "text": "We may provide you with personal information to it in accordance with the provisions of laws and regulations, or in accordance with the mandatory requirements of the government authority.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "It may provide you with personal information to it in accordance with laws and regulations, or in accordance with the mandatory requirements of the government authority."}
{"task": "rw_35.jsonl", "id": 49185, "text": "We may provide your personal information to the following partners:", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49186, "text": "• Our service providers and business partners", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49188, "text": "These supports include providing us with infrastructure technology services, payment services, and data processing.", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49189, "text": "•Affiliates", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49190, "text": "We may provide your personal information to our affiliated companies. We will only provide necessary personal information and will obtain your consent separately. At the same time, the personal information generated by your affiliated company service and page will be provided according to the affiliated company.Privacy policy promises you to protect it.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "When you may provide your personal information to the affiliate company, you will only provide necessary personal information and obtain a separate consent. At the same time, it will be protected by the privacy policy of the affiliated company."}
{"task": "rw_35.jsonl", "id": 49187, "text": "We may provide your personal information to service providers and business partners who support our functions.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Personal information may be provided to service providers and business partners with supporting functions."}
{"task": "rw_35.jsonl", "id": 49191, "text": "• The third party you authorize", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49192, "text": "We may provide your personal information to others you specified in accordance with your instructions or if you agree, such as you log in to the platform operated by others using the account information you spent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Provide your personal information to others you specified according to your instructions or you agree."}
{"task": "rw_35.jsonl", "id": 49193, "text": "The above -mentioned scenarios, information fields, frequency, receiver, purpose, etc. can be queried here.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You can click here to query by the scenarios, information fields, frequency, receiving party, purpose, etc."}
{"task": "rw_35.jsonl", "id": 49194, "text": "3. Transfer", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49195, "text": "If you need to transfer your personal information, we will tell you the name or name and contact information of the receiver.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you need to transfer your personal information for reasons involving mergers, separation, dissolution, and declaration of bankruptcy, we will tell you the name or name and contact information of the receiver."}
{"task": "rw_35.jsonl", "id": 49196, "text": "At the same time, the company and organizations that hold your personal information will continue to handle your personal information in accordance with this policy. Otherwise, we will ask the company and the organization to reconcile your authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "The receiver of personal information is required to process personal information in accordance with this policy, otherwise it will re -solicit authorization consent."}
{"task": "rw_35.jsonl", "id": 49197, "text": "4. Public public", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49198, "text": "Based on the legitimacy of laws and regulations, our personal information is made public under the necessary situation.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Personal information based on the necessary situation based on the basis of legitimacy."}
{"task": "rw_35.jsonl", "id": 49199, "text": "If you need to make it public, we will inform you of the purpose of the public, the type of personal information, the types of sensitive personal information involved, and obtain your individual consent.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Public personal information will inform the purpose of the public, the type of personal information, the type of sensitive personal information involved, and obtain your separate consent."}
{"task": "rw_35.jsonl", "id": 49200, "text": "5. Reminder on the third direction you collect information", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49201, "text": "Cloud Flash Pay contains third -party products and services. Before using the third -party product and service, you need to jump to the corresponding cloud flashes applet or third -party page.", "label": ["Important"], "rewrite": "Before using the third -party products and services in cloud flash payment, you need to jump to the corresponding cloud flash payment applet or third -party page."}
{"task": "rw_35.jsonl", "id": 49202, "text": "The third -party services you use will be constrained by third -party service terms and privacy policies (rather than this policy). You need to carefully read its terms and decide whether to accept it.", "label": ["Important"], "rewrite": "The use of third -party services is restricted by its service terms and privacy policies (rather than this policy), and you need to decide whether to accept it."}
{"task": "rw_35.jsonl", "id": 49203, "text": "This privacy policy is only applicable to our personal information that we need to provide you with the need to provide you with cloud flash payment APP products and services. The behavior of third -party processing your personal information is responsible for itself.", "label": ["Important", "Risk"], "rewrite": "The behavior of third -party processing your personal information is responsible for itself."}
{"task": "rw_35.jsonl", "id": 49204, "text": "If you have objections to third parties using your personal information or discover the risks of these third -party development applications or pages, we recommend that you terminate related operations to protect your legitimate rights and interests, you can also negotiate with the corresponding third -party consultation solvingWe will provide help as much as possible.", "label": ["Important", "Risk"], "rewrite": "If you have any objection to your personal information or discover risks for third parties, it is recommended that you stop operating."}
{"task": "rw_35.jsonl", "id": 49205, "text": "If UnionPay violates the provisions of laws and regulations in this process and causes losses to you, UnionPay will bear the corresponding responsibilities caused by it.", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49206, "text": "Specific third -party types and processing personal information types are as follows:", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49207, "text": "• Third -party SDK service provider", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49208, "text": "Our products include third -party SDKs. If you use related services on our platform, you know that it directly collects and handle your personal information. We will restrict this class of third parties strictly in accordance with the principles of legal, correctness, and necessary principlesYou can use, click here to check the third -party SDK service contained in our products.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Our products include the third -party SDK to collect your personal information when you use your service, and we will restrict it."}
{"task": "rw_35.jsonl", "id": 49209, "text": "• Other third parties", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49210, "text": "The function of the Cloud Flash APP applet provides access services to a third party, which will assume management responsibilities for your personal information on its platform.", "label": ["Important", "Risk"], "rewrite": "The third parties accessed in the Cloud Flash Pay APP applet assume management responsibilities for your personal information."}
{"task": "rw_35.jsonl", "id": 49211, "text": "You can pass here to view our third party access list.", "label": ["Important"], "rewrite": "You can click here to view our third -party access list."}
{"task": "rw_35.jsonl", "id": 49212, "text": "Second, the security management method of personal information", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49213, "text": "1. Storage", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49214, "text": "• Storage location, in accordance with relevant laws and regulations, we will store your personal information collected and generated during the operation of the people's Republic of China in China.", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in domestic operations will be stored in China."}
{"task": "rw_35.jsonl", "id": 49215, "text": "• The storage period, we only retain your personal information within the time limit for the purpose of providing you with the purpose of the cloud flash payment APP product and service or a reasonable period or a reasonable period or a time limit for regulatory regulations. For example, according to the \"bank card organization and funds and fundsThe provisions of the Clearance Center Anti -Money Laundering and Anti -Terrorism Financing Guidelines \", after you cancel the user of the Cloud Flash Pay App, we will save your personal identity information for 5 years in accordance with laws and regulations or regulatory regulations.In the core business system, your personal identity information and liquidation business data are preserved for 15 years. After the above -mentioned storage period expires, we will delete or anonymous processing of your personal identity information and transaction information.", "label": ["Data Retention", "Important"], "rewrite": "Stay your personal information only within the required and reasonable period of providing services or laws and regulations and the time limit stipulated in regulatory regulations."}
{"task": "rw_35.jsonl", "id": 49216, "text": "2. Safety qualifications", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49217, "text": "We have obtained the following certification: our core business system has passed the level 4 certification of the information system level protection of the People's Republic of China, and the cloud flash payment business system has passed the third -level certification of the information system level protection of the People's Republic of China.", "label": ["Important", "Data Security"], "rewrite": "The core business system has passed the four -level certification of the information system level protection of the People's Republic of China, and the cloud flash payment business system has passed the third -level certification of the information system level protection of the People's Republic of China."}
{"task": "rw_35.jsonl", "id": 49218, "text": "Our Cloud Flash Pay APP has obtained a Security Certificate of Mobile Internet Application (APP) issued by the China Network Security Review Technology and Certification Center.", "label": ["Important", "Data Security"], "rewrite": "Cloud Flash Pay APP obtained a security certification certificate for mobile Internet applications (APP)."}
{"task": "rw_35.jsonl", "id": 49219, "text": "3. Internal management measures", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49220, "text": "We have adopted a variety of protection methods such as internal management systems and technical guarantee measures to protect your personal information. Specifically, it includes but not limited to:", "label": ["Important", "Data Security"], "rewrite": "Protect your personal information in many aspects of internal management system and technical guarantee measures."}
{"task": "rw_35.jsonl", "id": 49221, "text": "• The degree of sensitivity and type of personal information has been adopted, and the classification system is classified, and the authority restrictions are limited to user permissions, use scenarios permissions, use authorization permissions, and hierarchical approval mechanisms according to the classification and classification results.", "label": ["Important", "Data Security"], "rewrite": "The classification and grading system is adopted, and permissions restrictions on the user's authority, the authority of the use of the scenario, the authorization authority, and the grading approval mechanism are based on the classification and classification results."}
{"task": "rw_35.jsonl", "id": 49222, "text": "• Regular security audit, we use the audit mechanism to conduct a comprehensive verification and control of the effectiveness of privacy policies and related procedures and data security.", "label": ["Important", "Data Security"], "rewrite": "Through the audit mechanism, the effectiveness of privacy policies and related regulations and data security are comprehensively checked and controlled."}
{"task": "rw_35.jsonl", "id": 49223, "text": "• In terms of mechanism guarantee, we have set up a personal information protection team to conduct an evaluation of personal information protection for personal information collection, use, provision, and commission processing.Awareness strengthens publicity and organizes all staff every year to participate in the compliance test.", "label": ["Important", "Data Security"], "rewrite": "Carry out the influence evaluation of personal information protection, and train employees to organize compliance examinations."}
{"task": "rw_35.jsonl", "id": 49224, "text": "• When you correct, delete your personal information, or cancel your account, your personal information involved in the backup system will be processed in accordance with the requirements of the regulations.", "label": ["Important", "Data Security"], "rewrite": "After you correct, delete your personal information or cancel your account, the personal information in the backup system is processed in accordance with regulations."}
{"task": "rw_35.jsonl", "id": 49225, "text": "4. Technical guarantee", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49227, "text": "• We have developed relevant information security incident emergency plans, and regularly organize internal personnel to conduct emergency response training and emergency drills, so that they can master job duties and emergency disposal strategies and procedures.", "label": ["Important", "Data Security"], "rewrite": "Formulate emergency plans for information security incidents, and regularly organize emergency response training and emergency drills."}
{"task": "rw_35.jsonl", "id": 49228, "text": "• After unfortunately a personal information security incident, we will inform you in a timely manner in accordance with the requirements of laws and regulations: the basic situation and possible impact of security incidents, we have taken the disposal measures we have or will take, you can take it alone to prevent and reduce the riskSuggestions, remedy measures, etc.", "label": ["Important", "Data Security"], "rewrite": "If a personal information security incident occurs, we will inform your basic situation, possible impact, disposal measures, independent prevention suggestions, etc."}
{"task": "rw_35.jsonl", "id": 49229, "text": "We will timely inform you that the incident -related situation is promoted by the APP, sending mail/short message, and telephone. When it is difficult to inform the subject of personal information one by one, we will publish a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "The relevant situation of security incidents will be informed by mail, letter, telephone, push notification, etc. When it is difficult to inform one by one, it will issue an announcement."}
{"task": "rw_35.jsonl", "id": 49230, "text": "At the same time, we will also actively report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "Report the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities."}
{"task": "rw_35.jsonl", "id": 49231, "text": "If your legitimate rights and interests are damaged, we will bear the corresponding legal responsibility.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49232, "text": "Third, the protection and response of user rights", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49233, "text": "We guarantee your right to exercise your personal information:", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49234, "text": "(1) Query and access your personal information", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49235, "text": "You can access, check your name, ID information (mask), or contact us through the customer service hotline 95516 through the Cloud Flash App, except for the exception stipulated in the laws and regulations.", "label": ["Important", "Edit/Control"], "rewrite": "Visit the \"My-Personal Center\" interview, check the name, ID information (mask), or contact us through the customer service hotline, except for the laws and regulations."}
{"task": "rw_35.jsonl", "id": 49236, "text": "Click to view the relevant path.", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49237, "text": "(2) Correct your personal information", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49238, "text": "When you find that we have the wrong personal information about your personal information, you have the right to ask us to make corrections. You can make a need to correct personal information through customer service hotline 95516.", "label": ["Important", "Edit/Control"], "rewrite": "You can make a need to correct personal information through customer service hotline 95516."}
{"task": "rw_35.jsonl", "id": 49226, "text": "In terms of technical guarantee measures, we adopted it during storage, irreversible encryption storage, isolation storage, and adopted during information display and download, removed the processing, and adopted it during transmission.Data medium isolation transmission, and other technical measures to ensure your personal information security.", "label": ["Important", "Data Security"], "rewrite": "During the storage, irreversible encryption storage and isolation storage were taken. During the information display and download, it was identified as a de -identified processing. During transmission, technical measures such as dedicated line transmission, encryption transmission, key and data medium isolation transmission were adopted to ensure individuals to ensure individualsinformation security."}
{"task": "rw_35.jsonl", "id": 49239, "text": "Click to view the relevant path.", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49240, "text": "(3) Transfer your personal information", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49241, "text": "When you have the need to transfer your personal information in the Cloud Flash Pay App and meet the conditions stipulated by the online information department, you have the right to ask us to provide information transfer.Information transfer needs.", "label": ["Important", "Edit/Control"], "rewrite": "You can ask for information transfer, and you can make specific needs by calling customer service telephone 95516."}
{"task": "rw_35.jsonl", "id": 49242, "text": "(4) Delete your personal information", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49243, "text": "You can directly call the customer service call 95516 to make the need to delete personal information. Except for laws and regulations:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49244, "text": "(1) If we deal with personal information, we have not obtained your consent or violated the agreement with you;", "label": ["Important", "Edit/Control"], "rewrite": "If the behavior of handling personal information has not obtained consent or violated the agreement, you can ask for deletion."}
{"task": "rw_35.jsonl", "id": 49245, "text": "(2) If our behavior of handling personal information violates laws and regulations;", "label": ["Important", "Edit/Control"], "rewrite": "If our behavior of handling personal information violates laws and regulations, you can ask for deletion."}
{"task": "rw_35.jsonl", "id": 49246, "text": "(3) If you no longer use our products or services, or you cancel your account, or your personal information storage period has expired;", "label": ["Edit/Control", "Important"], "rewrite": "If you no longer use products or services, or cancel your account, or your personal information storage period has expired, you can ask for deletion."}
{"task": "rw_35.jsonl", "id": 49247, "text": "(4) Our personal information purpose has been achieved, unable to achieve or to achieve the purpose of processing (such as bankruptcy, stop operation, etc.), and will inform you in time;", "label": ["Important", "Edit/Control"], "rewrite": "The purpose of handling personal information has been achieved, unable to achieve or to achieve the purpose of processing. You will inform you in a timely manner that you can ask for deletion of personal information."}
{"task": "rw_35.jsonl", "id": 49248, "text": "(5) You withdraw your authorization consent from us.", "label": ["Important", "Edit/Control"], "rewrite": "You withdraw your authorization consent to us, you can ask for deleting personal information."}
{"task": "rw_35.jsonl", "id": 49249, "text": "(5) Withdrawing the scope of your authorization consent", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49250, "text": "1. You can withdraw all the authorization of your personal information by canceling the cloud flash payment app account.", "label": ["Important", "Edit/Control"], "rewrite": "You can withdraw all the authorization of personal information by canceling the cloud flash payment app account."}
{"task": "rw_35.jsonl", "id": 49251, "text": "2. You can change the scope of authorization consent through the following path:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49252, "text": "(1) Account management of third parties: \"My-Settings-Privacy Settings-Account Authorization\";", "label": ["Important", "Edit/Control"], "rewrite": "It can be managed by third-party account management through \"My-Settings-Privacy Settings-Account Authorization\"."}
{"task": "rw_35.jsonl", "id": 49253, "text": "(2) System permissions management: \"Mine-Settings-Privacy Settings-Power Management\".", "label": ["Important", "Edit/Control"], "rewrite": "System permissions management can be performed through \"My-Settings-Privacy Settings-Permanent Management\"."}
{"task": "rw_35.jsonl", "id": 49254, "text": "3. Please understand that each business function requires some basic personal information to be completed. When you withdraw consent or authorization, we cannot continue to provide you with the service corresponding to the withdrawal consent or authorization, and no longer handle your corresponding correspondencepersonal information.", "label": ["Important", "Edit/Control"], "rewrite": "After withdrawal consent or authorization, the corresponding services will no longer be provided, and the relevant information will not be processed."}
{"task": "rw_35.jsonl", "id": 49255, "text": "But your decision to withdraw consent or authorization will not affect personal information processing based on your authorization.", "label": ["Important", "Risk"], "rewrite": "Withdrawal authorization will not affect personal information processing based on previous authorization."}
{"task": "rw_35.jsonl", "id": 49256, "text": "(6) Logging out your account", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49257, "text": "When you meet the agreed cancellation conditions, you can cancel the previously registered account at any time. The specific path is \"My → Settings → Security Center → Logging out the account\".", "label": ["Edit/Control", "Important"], "rewrite": "You can cancel the account through \"My → Settings → Safety Center → Logging out\" at any time."}
{"task": "rw_35.jsonl", "id": 49258, "text": "The system will perform risk recognition based on your current environment. Through, face recognition, or, or, SMS, add, log in to the password, and cancel the operation. If it is not successful due to special reasonsLogging out.", "label": ["Important", "Edit/Control"], "rewrite": "Through face recognition, the SMS plus login password is used for cancellation operations. When the cancellation fails, you can contact artificial customer service to cancel."}
{"task": "rw_35.jsonl", "id": 49259, "text": "(7) Get your personal information copy", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49260, "text": "You have the right to obtain a copy of your personal information type.", "label": ["Important", "Edit/Control"], "rewrite": "You have the right to obtain a copy of your personal information type."}
{"task": "rw_35.jsonl", "id": 49261, "text": "You can obtain a copy of the cloud flash payment privacy policy you confirmed by dialing 95516 artificial customer service to understand your personal information usage in the Cloud Flash Pay App.", "label": ["Edit/Control", "Important"], "rewrite": "You can obtain a copy of the cloud flash payment privacy policy you confirmed through artificial customer service."}
{"task": "rw_35.jsonl", "id": 49262, "text": "(8) Use the use of automated decision -making", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49263, "text": "1. The automated decision -making service we provides you refers to automatic analysis and decision -making using the relevant information you allow us to process, using computer programs to automate your preferences and habits.", "label": ["Important", "Usage"], "rewrite": "Use the relevant information you allow you to process, and use computer programs to automate analysis and decision -making on your preferences and habits."}
{"task": "rw_35.jsonl", "id": 49264, "text": "We will not make any decisions that can have a significant impact on you without using only algorithms or analysis procedures and without providing opportunities for manual censorship.", "label": ["Important", "Usage"], "rewrite": "It will not make decisions that will have a significant impact without using only algorithms or analysis procedures without providing opportunities for manual censorship."}
{"task": "rw_35.jsonl", "id": 49265, "text": "2. To provide you with more convenient and more information display, search and push services that are more convenient and more in line with your personalized needs, we will extract your preferences according to your equipment information, service log information, regional information, browsing records, etc.Based on the indirect portrait of the characteristic label output, it is used to provide you with accurate information display and push services. You can also turn off the automated decision -making function related to \"Personalized Advertising Tracking\".", "label": ["Important", "Usage"], "rewrite": "According to your device information, service log information, regional information, browsing, click to recording and extract the preferences to the indirect output indirect portrait portrait to provide accurate information display and push services."}
{"task": "rw_35.jsonl", "id": 49266, "text": "3. You can turn off the automation decision -making function through the following path:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49267, "text": "(1) Open/close personalized display settings: \"Mine-Settings-Privacy Settings- [Personalized Recommendation Settings]\";", "label": ["Important", "Edit/Control"], "rewrite": "Open/close personalized display settings: \"Mine-Settings-Privacy Settings- [Personalized Recommendation Settings]\"."}
{"task": "rw_35.jsonl", "id": 49268, "text": "(2) Open/turn off personalized advertising tracking settings: \"Mine-Settings-Privacy Settings-Advertising Power Management\".", "label": ["Important", "Edit/Control"], "rewrite": "Open/close personalized advertising tracking settings: \"Mine-Settings-Privacy Settings-Advertising Power Management\"."}
{"task": "rw_35.jsonl", "id": 49269, "text": "(9) In response to your above request", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49270, "text": "Any questions, suggestions, opinions, and complaints can be contacted by our customer service submission by dialing the customer service hotline 95516, or through the \"my → online customer service\" submission to ensure security, we will deal with it after the necessary authentication is approved.In addition to other provisions of laws and regulations, in general, we will complete the processing within 15 working days.", "label": ["Important", "Contact Information"], "rewrite": "It can be submitted by dialing customer service hotline 95516 or \"My → Online Customer Service\". We will process it after the necessary authentication is passed."}
{"task": "rw_35.jsonl", "id": 49271, "text": "4. Protection and protection of personal information of minors", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49272, "text": "1. Our products, websites and services are mainly for adults.", "label": ["Specific Audiences", "Important"], "rewrite": "Our products, websites and services are mainly adults."}
{"task": "rw_35.jsonl", "id": 49273, "text": "If you are a minor who is 14 years old and under 18 years of age, before registering and using cloud flash payment, it is recommended that under the guidance of your parents or other guardians, we will understand the content of this policy and consent.The People's Republic of China provides relevant laws and regulations to protect personal information of minors.", "label": ["Specific Audiences", "Important"], "rewrite": "It is recommended that minors who are 14 years old and under 18 years of age have obtained the consent of the guardian before registering and using the cloud flash payment."}
{"task": "rw_35.jsonl", "id": 49274, "text": "2., if you are a child under the age of 14, you want to register and use cloud flashing, you should inform your parents or other guardians to obtain the consent of your parents or legal guardians in advance, and your parents or your parents orThe legal guardian helps you complete the product or service registration process.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a child under the age of 14, please register and use cloud flash pay under the guidance of the guardian after the guardian agrees."}
{"task": "rw_35.jsonl", "id": 49275, "text": "Considering the particularity of personal financial information, all the payment functions of the Cloud Flash Pay App are not open to children under the age of 14.", "label": ["Specific Audiences", "Important"], "rewrite": "All payment functions of the Cloud Pay App are not open to children under the age of 14."}
{"task": "rw_35.jsonl", "id": 49276, "text": "In addition, we use children's personal information as sensitive personal information, and we have produced separate \"Guidelines for Privacy Protection for Children for Children for Children\" in accordance with laws and regulations.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49277, "text": "3. If you are a parent or guardian of a minor (child) under the age of 14, when you have questions about the information processing of the minors you monitor, please go through this policy or \"Cloud Flash Fu Children's personal privacy privacy.Conservation Guidelines, the agreed contact information contacts us.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are parents or guardians who are under the age of 14, you can contact us when you have questions about information processing."}
{"task": "rw_35.jsonl", "id": 49278, "text": "5. Special reminder of sensitive personal information", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49279, "text": "1. We collect and use your sensitive personal information in accordance with the legitimacy of laws and regulations.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49280, "text": "We only have a specific purpose and adequate necessity to provide you with a specific purpose and adequate need to provide you with strict protection measures to deal with your sensitive personal information.", "label": ["Important", "Data Security"], "rewrite": "Only with specific purposes and adequate necessity to provide cloud flash payment products and services, and process your sensitive personal information when taking protection measures."}
{"task": "rw_35.jsonl", "id": 49281, "text": "2. The sensitive personal information we collected to you include biometric information, specific identity information, financial account information, and personal information of children under the age of 14.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect sensitive personal information including biometric information, specific identity information, financial account information, and personal information under the age of 14."}
{"task": "rw_35.jsonl", "id": 49282, "text": "For example, in the business nuclear scenario, the rules of triggering face use are the necessary time according to the necessary time of the business function. We will ask you to provide you with face information to verify your identity. If you refuse to agree, you will not be able to use it.This business function.", "label": ["Important", "First Party Collection Information"], "rewrite": "Triggering the rules of face use as the necessary time for business functions, the collection of face information will be collected."}
{"task": "rw_35.jsonl", "id": 49283, "text": "3. Special processing requirements for sensitive personal information, such as biometric information, we will obtain you before using services, agree with you alone, and inform you, sensitive personal information, and use rules.", "label": ["Important", "Data Security"], "rewrite": "We will inform and obtain a separate consent before using the services involving sensitive personal information."}
{"task": "rw_35.jsonl", "id": 49284, "text": "In terms of transmission and storage sensitive personal information, we will adopt security measures such as encryption. At the same time, we will store your biometric information separately from your personal identity information, and in principle, you will not store your original biometric information.Summary information to store your biometric information.", "label": ["Important", "Data Security"], "rewrite": "For sensitive personal information, security measures such as encryption will be taken to store biometric information separately from personal identity information, and in principle, the original biometric information is not stored."}
{"task": "rw_35.jsonl", "id": 49285, "text": "In addition, we will not retain your personal financial identification information.", "label": ["Important", "Data Security"], "rewrite": "Do not retain personal financial identification information."}
{"task": "rw_35.jsonl", "id": 49286, "text": "6. Special processing rules for cross -border information", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49287, "text": "• The personal information we collected and generated in the operation of the People's Republic of China is stored in China.", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in domestic operations will be stored in China."}
{"task": "rw_35.jsonl", "id": 49288, "text": "• Our Cloud Flash Payment APP supports the completion of the UnionPay card cross -border payment service. Under this service, we will use you to pay for the validity period of the mobile phone number, bank card number, CVN2, and bank card.The related company provided by the processing company is located in the country. In order to complete the necessity of cross -border transactions of bank cards, it needs to transmit your relevant personal information to overseas cooperation agencies.The contact information provided by the policy communicates with us.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "In cross -border payment services, affiliated companies will provide you with mobile phone numbers, bank card numbers, CVN2, and bank cards that you use to pay to overseas partners."}
{"task": "rw_35.jsonl", "id": 49289, "text": "• In addition, our overseas service of Cloud Flash Payment APP is mainly provided by related companies and their cooperative third parties, involving the business situation of transmitting information to overseas partners. You can click here to view details.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The overseas services of Yunli Pay App are mainly provided by related companies and their cooperation in cooperation, involving the business situation of transmitting information to overseas partners. You can click here to view details."}
{"task": "rw_35.jsonl", "id": 49290, "text": "• If we transmit your personal information directly to overseas, we will inform you that the names or names, contact information, processing purpose, processing method, personal information types, and the way you exercise related rights to the overseas receiving partyAnd procedures and other matters, and get your individual consent.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "When you transmit your personal information directly to your overseas, you will inform you of the relevant matters of the overseas receiving party and get your separate consent."}
{"task": "rw_35.jsonl", "id": 49291, "text": "We will conduct security assessments on your personal information before leaving the country in accordance with domestic laws and regulations.", "label": ["Important", "Data Security"], "rewrite": "Personal information will carry out security assessment before leaving the country."}
{"task": "rw_35.jsonl", "id": 49292, "text": "At the same time, when related conditions are available, we will set up contracts with overseas receiving parties in accordance with the security assessment of the State Cyber Information Department, the personal information protection certification of professional institutions or in accordance with the standard contracts formulated by the national network information department in accordance with the national network information department.Cross -border transmission work.", "label": ["Important", "Data Security"], "rewrite": "When related conditions are available, we will set up contracts to conduct personal information cross -border transmission in accordance with security assessment, personal information protection certification or standard contracts."}
{"task": "rw_35.jsonl", "id": 49293, "text": "7. Cookie and similar technology applications", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49294, "text": "To ensure that you get a smoother and easier experience, when you use the cloud flash payment APP and related services, we may recognize your identity through the small data file \"Cookie\", Or assist in judging the security status of your account.", "label": ["Important", "First Party Collection Information"], "rewrite": "Identify your identity with a small data file \"Cookie\" so that you can use or assist in judging the security status of your account."}
{"task": "rw_35.jsonl", "id": 49295, "text": "Cookie, usually contains identifiers, site names, and some numbers and characters. With the help of, cookies, websites can store data such as your preferences or products in the shopping basket.", "label": ["Important", "First Party Collection Information"], "rewrite": "Websites can use cookies to store data such as your preferences or goods in shopping baskets."}
{"task": "rw_35.jsonl", "id": 49296, "text": "We will also use Cookie to transmit device logo to facilitate your participation in the marketing activities of the Cloud Flash Pay App.", "label": ["Important", "First Party Collection Information"], "rewrite": "With the help of cookie transmission equipment, it is convenient for you to participate in the marketing activities of the Cloud Flash Pay App."}
{"task": "rw_35.jsonl", "id": 49297, "text": "In addition to Cookie, we also use electronic image technology (web beacon) at the same time.", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49298, "text": "We may use Web, Beacon to count the data accessible anonymous access to calculate the number of user access, stay time, page address, display settings, etc., so that you can enjoy more personalized services, and these statistical information is notIncluding your personal information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Statistically, the data visited by Web Beacon can be statistically visited, but it does not include personal information."}
{"task": "rw_35.jsonl", "id": 49299, "text": "8. Protection of the personal information of the old users", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49300, "text": "After the death of Yunlu users, as a close relative, for your own legal and legitimate interests, you can contact us through the contact information of this privacy policy to exercise, copy, correct, delete the personal information generated by the dead users in the Cloud Flash Pay APP.Waiting for rights.", "label": ["Edit/Control", "Specific Audiences", "Important"], "rewrite": "The close relatives of the old users can contact us to exercise the rights of inspection, replication, correction, deletion, etc. for our personal information for their own legal and legitimate interests."}
{"task": "rw_35.jsonl", "id": 49301, "text": "Special reminder, if you query the account information of Yunli Payment User Bank Card, please contact the bank card account bank.", "label": ["Edit/Control", "Specific Audiences", "Important"], "rewrite": "Query the information of the cloud flash payment user bank card account, you need to contact the bank card account bank."}
{"task": "rw_35.jsonl", "id": 49302, "text": "At the same time, in order to fully protect the personal information rights and interests of the dead users, we will verify the relevant materials, such as the identity document certification, death certificate document, the applicant's identity document, the applicant and the relative relationship of the user.", "label": ["Specific Audiences", "Important"], "rewrite": "In order to protect the personal information rights and interests of the dead users, the relevant materials of applicants who exercise the rights of personal information will be verified."}
{"task": "rw_35.jsonl", "id": 49303, "text": "Nine, policy updates", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49304, "text": "Our privacy policy will be changed according to product updates and laws and regulations.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49305, "text": "When this policy has changed significantly, we will notify you in time in time to adopt pop -up reminder, message push, email notification, or issuing announcement of the UnionPay official website.", "label": ["Policy Change", "Important"], "rewrite": "After the privacy policy is updated, you will adopt a pop -up reminder, message push, email notification or issuing announcement of the UnionPay official website in time."}
{"task": "rw_35.jsonl", "id": 49306, "text": "• The service scope and mode we provide are major changes;", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49307, "text": "• major changes in our business entity, organizational structure, and ownership structure;", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49308, "text": "• The main object of your personal information provided, transferred or disclosed the main object of the outside world changes;", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49309, "text": "• The right to participate in personal information processing and its exercise methods have changed significantly;", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49310, "text": "• We are responsible for the responsibility department of personal information security and their contact information and complaint channels;", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49311, "text": "• Others may have a significant impact on your personal information rights and interests.", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49312, "text": "You can check this policy through \"My → Settings → Privacy Settings → Privacy Policy\".", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49313, "text": "If you have any questions, opinions or suggestions on this privacy policy or your personal information, please pass the \"My → Online Customer Service\" mailbox by dialing the customer service hotline 95516, or contact it with various methods and other methods and other methods and other methods and other methods and other methods.We contact.", "label": ["Important", "Contact Information"], "rewrite": "Customer service hotline: 95516; mailbox: privacy@unionPay.com."}
{"task": "rw_35.jsonl", "id": 49314, "text": "Under normal circumstances, we will complete the treatment within 15 working days.", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49315, "text": "If you are dissatisfied with our response, you can negotiate friendly first and communicate again. You have the right to seek solutions through the Shanghai Pudong New District People's Court or regulatory agency.", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49316, "text": "Note: The update date of the \"Privacy Policy\" version is July 6, 2022", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49317, "text": "• The update content of this version of \"Privacy Policy\" is mainly as follows:", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49318, "text": "1. Update the third -party SDK situation table", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49319, "text": "2. Supplementary dispute solution description", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49320, "text": "3. Increase authority related appendix", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49321, "text": "And other expressive text adjustments.", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49322, "text": "We will also archive the privacy policy of the previous version for you.", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49323, "text": "10. Appendix", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49324, "text": "The special terms and keywords involved in this policy include:", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49326, "text": "2. Sensitive personal information refers to personal information that can easily cause the personality and dignity of natural people to be violated or harmed by personal and property security, including biometrics, religious beliefs, specific identities, medical health, financial accounts, and whereabouts of their lives.Such information, and personal information under minority at the age of 14.", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49327, "text": "3. UnionPay card refers to the issuance of technical standards and business specifications in accordance with UnionPay (China UnionPay and UnionPay International). The BIN number is allocated or managed by UnionPay, or the card surface with a \"UnionPay\" logo payment card, and the corresponding paid card corresponding to the payment card.Payment account.", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49328, "text": "4. Related Company: Under this privacy policy, our affiliated company refers to UnionPay International Co., Ltd., the address of Building 2-7, Building B, No. 6, Dongfang Road, Pudong New District, Shanghai, China, contact information 021-20265666, mailbox UPIDATAPRIVACY@UNIONPAYINTL.com.", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49329, "text": "5. Legality foundation: The legitimate foundation of all the processing links of your personal information under this privacy policy refers to the situation listed in Article 13 of the Personal Information Protection Law.", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49330, "text": "6. Necessary information: The necessary information refers to the personal information necessary to ensure the normal operation of the basic functional services of the app. Lack of the information app will not be able to achieve basic functional services.", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49331, "text": "7. Automated decision -making: Refers to automatic analysis through computer programs, evaluating personal behavior habits, hobbies or economic, healthy, credit conditions, etc., and make decisions.", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49332, "text": "8. Devitization: Refers to the process of personal information processing, so that it cannot recognize the process of specific natural person without using additional information.", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49325, "text": "1. Personal information refers to the various information related to the recognized or recognizable natural person recorded in electronics or other ways, excluding information after anonymous processing.", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49333, "text": "9. SDK: Software DEVELOPMENT KIT, software tool development package, a embedded technical tool for providing interfaces or collecting information for a function.", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49334, "text": "10. Cookies: a technical tool that records user ID, browsing information, and staying for a long time.", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49335, "text": "11. Web Beacon: The network beacon is a picture of 1 pixel size hidden in any webpage element or email. It is often used to collect data such as online habits of target computer users and write these data into cookies.", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49336, "text": "12. Registration in the country: For the purpose of this privacy policy, it refers to the registration of mobile phone numbers provided by communication operators in the country (except for Hong Kong, Macao, and Taiwan regions).", "label": [], "rewrite": []}
{"task": "rw_35.jsonl", "id": 49337, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
