{"task": "rw_39.jsonl", "id": 50457, "text": "China Mobile Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50458, "text": "China Mobile (hereinafter referred to as \"we\") attaches great importance to the protection of users' privacy and personal information security. We will take corresponding security protection measures in accordance with the requirements of laws and regulations to try our best to protect your personal information security and controlling.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50459, "text": "We hope to explain to you how to collect, use, store, and share your personal information, and how you can exercise your user rights through \"Privacy Policy\"), and how you can exercise your user rights.", "label": [], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50460, "text": "Please read and fully understand all the contents of this \"Privacy Policy\" before using this website. During the reading process, if you have any questions, opinions or suggestions on the content of this policy, please contact us.", "label": [], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50461, "text": "It should be specifically explained that this policy is not applicable to the products or services provided to you by third -party relying on this website, nor is it suitable for products or services that have independently set privacy policies in this website.", "label": [], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50462, "text": "This privacy policy will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50463, "text": "1. How do we collect and use your personal information.", "label": [], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50464, "text": "2. How do we use cookies and similar technologies.", "label": [], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50465, "text": "3. How do we share, transfer, and publicly disclose your personal information.", "label": [], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50466, "text": "4. How do we protect and save your personal information.", "label": [], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50467, "text": "5. Your rights.", "label": [], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50468, "text": "6. How do we deal with personal information of minors.", "label": [], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50469, "text": "7. How can your personal information be transferred globally.", "label": [], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50470, "text": "8. How to update this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50471, "text": "9. How to contact us.", "label": [], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50472, "text": "1. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50473, "text": "Personal information refers to a variety of information that can identify specific natural persons or reflects the activity of specific natural persons in a single or other information with other information.", "label": [], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50474, "text": "(1) To ensure your normal use of the products or services of this website, we need to collect, store and use the following information related to you:", "label": ["Important", "First Party Collection Information"], "rewrite": "To ensure that you use the products or services of this website normally, we need to collect, store and use relevant information."}
{"task": "rw_39.jsonl", "id": 50475, "text": "1. The information you provide", "label": [], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50476, "text": "When you register as our user or use our services, the relevant personal information provided to us, including your [name (name), gender, age, address, phone number, email address, ID number, payment related to payment relatedBank information and contact information].", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you register as a user or use service, collect the relevant personal information of the name, gender, age, address and other related personal information you provided."}
{"task": "rw_39.jsonl", "id": 50477, "text": "The above information you provide will continue to authorize us to use it during your use of this website.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "The information you provide when you register will continue to authorize us to use it during your use of this website."}
{"task": "rw_39.jsonl", "id": 50478, "text": "When you cancel your account, we will stop using the above information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you cancel your account, you will stop using information."}
{"task": "rw_39.jsonl", "id": 50479, "text": "2. The information you generate during the service process", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50480, "text": "When you use the service we provide, we may automatically collect the following information:", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the services we provide, we may automatically collect log information, location information, etc."}
{"task": "rw_39.jsonl", "id": 50481, "text": "(1) Log information", "label": [], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50482, "text": "It means that when you use our service, the system may automatically collect technical information through cookies or other methods, including:", "label": ["Important", "First Party Collection Information"], "rewrite": "It means that when you use our service, the system may automatically collect technical information."}
{"task": "rw_39.jsonl", "id": 50483, "text": "A. Device or software information, such as your mobile device, web browser, or the configuration information provided by other programs you use to access our services, your IP address and the version and device recognition code used by your mobile deviceEssence", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you access the service, collect your device or software information."}
{"task": "rw_39.jsonl", "id": 50484, "text": "B. You search and browse information when using our service, such as search keywords, access pages you use, and other information you are provided when you use our service.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect the information you searched and browsed when using our service."}
{"task": "rw_39.jsonl", "id": 50485, "text": "(2) Location information", "label": [], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50486, "text": "Refers to the information of your location when you open the device positioning function and use the relevant services provided by our position. For example, when you use our services through mobile devices with positioning functions, we collect it through GPS or WIFI and other methods.Your geographical information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you turn on the device positioning function and use related services, collect information about your location."}
{"task": "rw_39.jsonl", "id": 50487, "text": "(3) Order information", "label": [], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50488, "text": "Refers to the records that you recharge and pay for it through this website, apply for business or purchase goods, such as the booking relationship records, consumption records, bank card numbers, family address and ID card information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collecting your recharge, handling business or purchasing products through this website is a record of generating."}
{"task": "rw_39.jsonl", "id": 50489, "text": "(4) Mobile account information", "label": [], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50490, "text": "Refers to your mobile phone login account, for example, when you choose to log in to our service with your mobile account, we will get your mobile account related information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you choose to use a mobile account login service, we will get your mobile phone account related information."}
{"task": "rw_39.jsonl", "id": 50491, "text": "3. Information shared by third parties", "label": [], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50492, "text": "To provide you with services, we may get your relevant information from third -party sources such as affiliated companies and business partners.", "label": ["Important", "First Party Collection Information"], "rewrite": "To provide you with services, we may get your relevant information from the source of the third party."}
{"task": "rw_39.jsonl", "id": 50493, "text": "For example, when you order our products through our affiliated company and business partner website, the booking information you provide to it may be transferred to us so that we can handle your order.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you order our products through our affiliated company and business partner website, the booking information you provide to it may be transferred to us."}
{"task": "rw_39.jsonl", "id": 50494, "text": "We will use your information according to the agreement with the third party and the legitimacy of the source of personal information, and use your information in accordance with relevant laws, regulations and third parties.", "label": ["Important", "First Party Collection Information"], "rewrite": "After confirming the legality of the source of personal information, we use your information in accordance with relevant laws, regulations and third parties."}
{"task": "rw_39.jsonl", "id": 50495, "text": "(2) We may use your personal information for the following purpose:", "label": [], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50496, "text": "1. Provide you with services", "label": [], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50497, "text": "(1) When we provide services, it is used for authentication, customer service, security precautions, fraud monitoring, archiving and backup purposes to ensure the safety of the products and services we provide to you.", "label": ["Important", "Usage"], "rewrite": "When we provide services, your information will be used for authentication, customer service, security defense, fraud monitoring, archiving and backup purposes."}
{"task": "rw_39.jsonl", "id": 50498, "text": "(2) According to information and data analysis, help us design new services and improve our existing services.", "label": ["Important", "Usage"], "rewrite": "Through information and data analysis, help design new services and improve existing services."}
{"task": "rw_39.jsonl", "id": 50499, "text": "(3) Make us better understand how you use our services, so asUsers make other responses.", "label": ["Important", "Usage"], "rewrite": "Use your information to make us better understand how you use our services, thereby meeting your personalized needs targeted."}
{"task": "rw_39.jsonl", "id": 50500, "text": "(4) Provide your attention or related advertisements with you to replace ads that are universal. When you use our services, we may use your information to send you email, text message or push notification. If you don’t want to receive itThis information can be canceled according to our relevant prompts.", "label": ["Important", "Usage"], "rewrite": "When you use our service, we may use your information to send you email, text message or push notification to you."}
{"task": "rw_39.jsonl", "id": 50501, "text": "(5) Evaluate the effects of advertising and other promotion and promotion activities in our services and improve them.", "label": ["Important", "Usage"], "rewrite": "Use your information to evaluate the effects of advertising and other promotion and promotion activities in our services and improve it."}
{"task": "rw_39.jsonl", "id": 50502, "text": "(6) Software authentication or management software upgrade.", "label": [], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50503, "text": "(7) Let you participate in investigations about our products and services.", "label": [], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50504, "text": "2. After collecting your personal information, we will identify the data through technical means, and the information of the identification processing will not be able to identify the subject.", "label": ["Important", "Usage"], "rewrite": "The collected data is identified by technical means, and the information that is identified by the identification processing will not be able to identify the subject."}
{"task": "rw_39.jsonl", "id": 50505, "text": "Please understand and agree that in this case, we have the right to use the information that has been identified;", "label": ["Important", "Usage"], "rewrite": "In this case, we have the right to use information that has been identified."}
{"task": "rw_39.jsonl", "id": 50506, "text": "And on the premise of compliance with relevant laws and regulations, we have the right to analyze and utilize the user database including your personal information.", "label": ["Important", "Usage"], "rewrite": "Under the premise of compliance with relevant laws and regulations, the user database, including your personal information, is analyzed and utilized."}
{"task": "rw_39.jsonl", "id": 50507, "text": "3. When we want to use information for other purposes that are not stated in this policy, we will solicit your consent in advance.", "label": ["Important", "Data Security", "Usage"], "rewrite": "When we want to use other purposes that the information is not stated in this policy, we will solicit your consent in advance."}
{"task": "rw_39.jsonl", "id": 50508, "text": "4. You fully know that in the following situations, we do not need to obtain your authorization consent using personal information:", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "You fully know that in the following situations, we use personal information to obtain your authorization consent:"}
{"task": "rw_39.jsonl", "id": 50509, "text": "(1) When related to national security and national defense security.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The collection and use information directly related to national security and national defense security does not need to solicit authorization consent."}
{"task": "rw_39.jsonl", "id": 50510, "text": "(2) Causes of public safety, public health, and major public interests.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When the public safety, public health, and major public interests are collected, the use information is collected without authorization consent."}
{"task": "rw_39.jsonl", "id": 50511, "text": "(3) Crime investigation, prosecution, trial and judgment implementation.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The collection and use information of criminal investigation, prosecution, trial, and judgment is not required to solicit authorization consent."}
{"task": "rw_39.jsonl", "id": 50512, "text": "(4) For the safety and property of the subject of personal information or other individuals, it is difficult to get my consent.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Out of maintaining the safety and property of personal information subjects or other individuals, it is difficult to get the use of information without obtaining my consent without asking for the consent of authorization."}
{"task": "rw_39.jsonl", "id": 50513, "text": "(5) The collected personal information is the information that the personal information is made to the public by themselves.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The collected personal information is the information that the subject of the personal information disclosure to the public by itself, and there is no need to solicit authorization consent."}
{"task": "rw_39.jsonl", "id": 50514, "text": "(6) Your personal information collected from legal publicly disclosed information, such as legal news reports and government information disclosure.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Your personal information collected from the legal disclosure information does not need to solicit authorization consent."}
{"task": "rw_39.jsonl", "id": 50515, "text": "(7) Signing the contract according to your requirements.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The collection and usage information necessary for signing the contract according to your request does not need to solicit authorization consent."}
{"task": "rw_39.jsonl", "id": 50516, "text": "(8) The necessary and stable operation of the products and/or services provided by maintenance, such as discovering and disposing of products and/or services.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The collection and use information necessary for the safe and stable operation of the products provided with/or service provided is not required to solicit authorization consent."}
{"task": "rw_39.jsonl", "id": 50517, "text": "(9) It is necessary for legal news reports.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The necessary collection and use information for legal news reports does not need to solicit authorization consent."}
{"task": "rw_39.jsonl", "id": 50518, "text": "(10) Academic research institutions are necessary for statistics or academic research based on public interests, and when they provide academic research or description results, they are identified as identified by the personal information contained in the results.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When academic research institutions are necessary to carry out statistics or academic research in public interests, and provide academic research or description results, they can identify the personal information contained in the results, and collect the use information without authorization consent."}
{"task": "rw_39.jsonl", "id": 50519, "text": "(11) Other circumstances stipulated in laws and regulations.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Other collection and use information stipulated in laws and regulations does not need to solicit authorization."}
{"task": "rw_39.jsonl", "id": 50520, "text": "2. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50521, "text": "To ensure the normal operation of the website, we will store small data files named Cookie on your computer or mobile device.", "label": [], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50522, "text": "Cookie usually contains identifiers, site names, and some numbers and characters.", "label": [], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50523, "text": "With the help of Cookie, the website can store data such as your preferences or products in the shopping basket, so that you can still remember your options or shopping basket data when jumping between different pages and avoid repeated input.", "label": ["Important", "First Party Collection Information"], "rewrite": "The website can store data such as Cookie to store your preferences or products in the shopping basket."}
{"task": "rw_39.jsonl", "id": 50524, "text": "We will not use any uses beyond the purpose of this policy.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will not use Cookie for any purpose outside the purpose of this policy."}
{"task": "rw_39.jsonl", "id": 50525, "text": "You can manage or delete according to your preferences, cookies.", "label": ["Important", "Edit/Control"], "rewrite": "You can manage or delete Cookie according to your preferences."}
{"task": "rw_39.jsonl", "id": 50526, "text": "See AboutCookies.org for details.", "label": [], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50527, "text": "You can clear all the preserved, cookie by removing the browser cache.", "label": ["Important", "Edit/Control"], "rewrite": "You can clear all cookies saved by removing the browser cache."}
{"task": "rw_39.jsonl", "id": 50528, "text": "3. How can we share, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50529, "text": "(1) Sharing", "label": [], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50530, "text": "We will not share your personal information with any companies, organizations and individuals other than China Mobile, except the following situations:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not share your personal information with any companies, organizations and individuals other than China Mobile, except the following situations:"}
{"task": "rw_39.jsonl", "id": 50531, "text": "1. After getting your clear consent, we will share your personal information with other parties.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After getting your clear consent, we will share your personal information with other parties."}
{"task": "rw_39.jsonl", "id": 50532, "text": "2. We may share your personal information to the outside world in accordance with the provisions of laws and regulations, or in accordance with the mandatory requirements of the government authority.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share your personal information to the outside world in accordance with the provisions of laws and regulations, or in accordance with the mandatory requirements of government authorities."}
{"task": "rw_39.jsonl", "id": 50533, "text": "3. Share with our affiliates: Your personal information may be shared with our affiliated company.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Your personal information may be shared with our affiliated companies."}
{"task": "rw_39.jsonl", "id": 50534, "text": "We will only share the necessary personal information and be restricted by the purpose declared in the privacy policy.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We only share the necessary personal information and are subject to the purpose of the privacy policy."}
{"task": "rw_39.jsonl", "id": 50535, "text": "If related companies want to change the purpose of personal information, they will solicit your authorization consent again.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If related companies want to change the purpose of personal information, they will solicit your authorization consent again."}
{"task": "rw_39.jsonl", "id": 50536, "text": "Our affiliated companies include the legal heirs, institutions, or the above -mentioned companies or institutions that are controlled, controlled or controlled by China Mobile now or in the future.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50537, "text": "Among them, \"control\" refers to the ability to directly or indirectly affect the company's management, whether it is a method that is identified by the ownership, the shares of the voting right, the contract, or the other by the people's court.", "label": [], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50538, "text": "4. Authorized partners sharing: In order to achieve the purpose of this policy, some of our services will be provided by authorized partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Some of our services will be provided by authorized partners to achieve the purpose of this policy statement."}
{"task": "rw_39.jsonl", "id": 50539, "text": "We may share some of your personal information with our partners to provide better customer service and user experience.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share some of your personal information with our partners to provide better customer service and user experience."}
{"task": "rw_39.jsonl", "id": 50540, "text": "For example, when you buy goods or ordering business through our website, we must share your personal information with logistics service providers to arrange delivery or arrange partners to provide services.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share your personal information with logistics service providers can arrange delivery, or arrange partners to provide services."}
{"task": "rw_39.jsonl", "id": 50541, "text": "We will only share your personal information for legal, correct, necessary, specific, and clear purposes, and only share the personal information necessary for providing services.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Share your personal information only for legal, correct, necessary, specific, and clear purposes, and only share the personal information necessary for providing services."}
{"task": "rw_39.jsonl", "id": 50542, "text": "Our partners have no right to use the personal information they shared for any other purpose.", "label": ["Important", "Data Security"], "rewrite": "Our partners have no right to use the personal information they shared for any other purpose."}
{"task": "rw_39.jsonl", "id": 50543, "text": "At present, our authorized partners include the following three types:", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50544, "text": "1. Suppliers, service providers and other partners.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50545, "text": "We send your order information to the necessary information related to transactions to the suppliers, service providers and other partners that support our business.Effectiveness, providing customer service, convenient payment, or conducting academic research and investigation.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We send your order information to the necessary information related to transactions to suppliers, service providers and other partners."}
{"task": "rw_39.jsonl", "id": 50546, "text": "2. Third -party merchants.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50547, "text": "We must share the necessary information related to transactions in your order information with third -party merchants to realize your needs for purchasing goods or services from it and prompt it to complete the subsequent after -sales service.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We must share your necessary information with the necessary information with third -party merchants to realize your needs for purchasing goods or services."}
{"task": "rw_39.jsonl", "id": 50548, "text": "3. Authorized partners of advertising and analysis of service.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50549, "text": "Unless you get your permission, we will not make your personal identity information (referring to information that can identify your identity, including name or email, you can contact you or identify your identity through this information) and provide advertising and analysis services.Share partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Unless you get your permission, we will not share your personal identity information with partners who provide advertising and analyzing services."}
{"task": "rw_39.jsonl", "id": 50550, "text": "However, we may share the user portrait formed by your information with partners who provide advertising and analysis services to help increase the effective touch rate of advertising and service information without identifying your personal premise.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We may use the user portrait formed by your information to share with partners who provide advertising and analysis services."}
{"task": "rw_39.jsonl", "id": 50551, "text": "Companies, organizations and individuals who share personal information with us, we will sign the corresponding confidentiality agreement with them, asking them to handle personal information in accordance with our instructions, privacy policies, and any other related confidentiality and security measures.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will sign a confidentiality agreement with shared partners to request them to handle personal information in accordance with our instructions, privacy policies, and other confidentiality and security measures."}
{"task": "rw_39.jsonl", "id": 50552, "text": "(2) Transfer", "label": [], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50553, "text": "Except for the following situations, we will not transfer your personal information to any company, organization and individual.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Except for the following situations, we will not transfer your personal information to any company, organization and individual."}
{"task": "rw_39.jsonl", "id": 50554, "text": "1. After getting your clear authorization, we will transfer your personal information to the third party authorized by you.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After getting your clear authorization, we will transfer your personal information to the third party authorized by you."}
{"task": "rw_39.jsonl", "id": 50555, "text": "2. When merging, acquisition or bankruptcy liquidation on this website, if it involves the transfer of personal information, we will ask new companies to continue to receive, manage, use, and transfer your information according to this privacy policy.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When the merger, acquisition or bankruptcy liquidation involves the transfer of personal information, we will require the contractor to continue to receive, manage, use, and transfer personal information in accordance with the privacy policy."}
{"task": "rw_39.jsonl", "id": 50556, "text": "If consensus cannot be reached, we will ask new companies to reconcile with you.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Following the continued constraints of this policy, you will re -solicitting your authorization consent."}
{"task": "rw_39.jsonl", "id": 50557, "text": "(3) Public disclosure", "label": [], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50558, "text": "We will only publicly disclose your personal information in the following circumstances:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only publicly disclose your personal information in the following circumstances:"}
{"task": "rw_39.jsonl", "id": 50559, "text": "1. After getting your clear consent, disclose your personal information according to your authorization.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After getting your clear consent, disclose your personal information according to your authorization."}
{"task": "rw_39.jsonl", "id": 50560, "text": "2. In the case of compulsory requirements of legal, legal procedures or government authorities, we may disclose your personal information as required.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the case of compulsory requirements of legal, legal procedures or government authorities, we may disclose your personal information as required."}
{"task": "rw_39.jsonl", "id": 50561, "text": "4. How do we protect and save your personal information", "label": [], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50562, "text": "(1) How do we protect your personal information", "label": [], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50563, "text": "1. We will strictly follow the \"Decision of the Cyber Security Law\", \"The Standing Committee of the National People's Congress on Strengthening the Protection of Network Information\", \"Regulations on the Protection of Personal Information Protection of Telecom and Internet User\"The \"Regulations on the Registration of True Information Registration of Telephone Users\" (Order No. 25 of the Ministry of Industry and Information Technology) and other laws and regulations, establish an information security guarantee system, and adopt various security protection technical measures within a reasonable security range (including identity identification, identity identification, identity identification, identity identification, identity identification, identity identification, identity,Data encryption, access control, etc.) and other necessary measures to protect your personal information security.", "label": ["Important", "Data Security"], "rewrite": "Establish an information security guarantee system in strict accordance with the requirements of laws and regulations, and take various security protection technical measures and other necessary measures to protect your personal information security."}
{"task": "rw_39.jsonl", "id": 50564, "text": "We strive to ensure user information security to prevent information loss, improper use, unauthorized access or disclosure.", "label": ["Important", "Data Security"], "rewrite": "Strive to ensure user information security to prevent information loss, improper use, unauthorized access or disclosure."}
{"task": "rw_39.jsonl", "id": 50565, "text": "2. We will only retain your personal information within the time limit of the purpose of this policy, except for the requirements of national policies and regulations or allowing the reserved period.", "label": ["Data Retention", "Important"], "rewrite": "Generally, your personal information is retained within the time limit required to achieve service purposes, unless the law has other requirements."}
{"task": "rw_39.jsonl", "id": 50566, "text": "3. Please understand: The Internet environment is not 100 % security. We will try our best to ensure the security of your personal information. However, due to the technical restrictions and various malicious means, even if we can do our best to strengthen security measures, it will not be possible.It may always guarantee that the information is 100 % safe.", "label": ["Important", "Data Security"], "rewrite": "Although there are security measures, it is impossible to fully guarantee that there is no security problem."}
{"task": "rw_39.jsonl", "id": 50567, "text": "After unfortunately a personal information security incident, we will inform you in a timely manner in accordance with the requirements of the laws and regulations, through mail, telephone, push notice, and announcement.The disposal measures, your advice that can prevent and reduce risk, and remedy your remedy.", "label": ["Important", "Data Security"], "rewrite": "If a personal information security incident occurs, we will inform your basic situation, possible impact, disposal measures, independent prevention suggestions, etc."}
{"task": "rw_39.jsonl", "id": 50568, "text": "(2) How do we save your personal information", "label": [], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50569, "text": "1. Location of information storage", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50570, "text": "We will store personal information collected in China in China in accordance with laws and regulations, and there is no overseas collection of user information.", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in domestic operations will be stored in China."}
{"task": "rw_39.jsonl", "id": 50571, "text": "2. The time limit for information storage", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50572, "text": "We promise that the storage time of your personal information is always within a reasonable and necessary period. We store user information according to business needs and user information beyond the preservation period. China Mobile will do anonymous processing.", "label": ["Data Retention", "Important"], "rewrite": "After exceeding the storage period, your personal information will be deleted or anonymous."}
{"task": "rw_39.jsonl", "id": 50573, "text": "When our products or services stop operation, we will notify you in the form of push notifications and announcements, and delete your personal information or perform anonymous processing within a reasonable period.", "label": ["Data Retention", "Important"], "rewrite": "When stopping operations, we will notify and delete or processes your personal information."}
{"task": "rw_39.jsonl", "id": 50574, "text": "Note: Except that the laws and regulations cannot be deleted or cannot be treated anonymous.", "label": ["Data Retention", "Important"], "rewrite": "Except that laws and regulations cannot be deleted or can not be treated anonymous."}
{"task": "rw_39.jsonl", "id": 50575, "text": "5. Your rights", "label": [], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50576, "text": "1. Query and correct your personal information", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50577, "text": "You log in to this website to use China Mobile's mobile phone number. This website only shows the mobile phone number and the personal information provided by your mobile phone number on the network.And the cancellation operation of the mobile phone number must be processed to China Mobile's physical business hall.", "label": ["Important", "Edit/Control"], "rewrite": "If you need to apply for a personal information change, deletion and cancellation of mobile phone numbers when the mobile phone number is registered, you need to go to China Mobile's physical business hall to handle it."}
{"task": "rw_39.jsonl", "id": 50578, "text": "2. In the following circumstances, you can make a request to delete personal information:", "label": ["Important", "Edit/Control"], "rewrite": "In the following circumstances, you can make a request to delete personal information:"}
{"task": "rw_39.jsonl", "id": 50579, "text": "(1) If we deal with personal information, we violate laws and regulations.", "label": ["Important", "Edit/Control"], "rewrite": "If our behavior of handling personal information violates laws and regulations, you can make a request to delete personal information."}
{"task": "rw_39.jsonl", "id": 50580, "text": "(2) If we collect and use your personal information, it has not obtained your consent.", "label": ["Important", "Edit/Control"], "rewrite": "If we collect and use your personal information but not obtain your consent, you can make a request to delete personal information."}
{"task": "rw_39.jsonl", "id": 50581, "text": "(3) If our handling of personal information is violated with you.", "label": ["Important", "Edit/Control"], "rewrite": "If our behavior of handling personal information violates your agreement, you can make a request to delete personal information."}
{"task": "rw_39.jsonl", "id": 50582, "text": "(4) If you no longer use our products or services, or you cancel your account.", "label": ["Important", "Edit/Control"], "rewrite": "If you no longer use our products or services, or if you cancel your account, you can make a request to delete information."}
{"task": "rw_39.jsonl", "id": 50583, "text": "(5) If we no longer provide products or services for you.", "label": ["Edit/Control", "Important"], "rewrite": "If we no longer provide you with products or services, you can make a request to delete personal information."}
{"task": "rw_39.jsonl", "id": 50584, "text": "When you delete the information from our services, we may not immediately delete the corresponding information in the backup system, but will delete these information when the backup is updated.", "label": ["Important", "Edit/Control"], "rewrite": "When you delete information from our services, we will delete the information in the backup system when the backup is updated."}
{"task": "rw_39.jsonl", "id": 50585, "text": "3. After you cancel your account, we will stop providing you with products or services and delete your personal information according to your requirements.", "label": ["Important", "Edit/Control"], "rewrite": "After the account is canceled, it will stop providing products or services and delete personal information, except for other regulations."}
{"task": "rw_39.jsonl", "id": 50586, "text": "4. Exception", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50587, "text": "Please fully understand and agree that in the following circumstances, we may not respond to the request for the correction/modification, deletion, cancellation, withdrawal of consent, and requesting information for your proposal:", "label": ["Edit/Control", "Important"], "rewrite": "In the following circumstances, we may not respond to the requests that you have proposed correction/modification, delete, cancel, withdraw consent, and obtain information:"}
{"task": "rw_39.jsonl", "id": 50588, "text": "(1) Conditions related to national security and national defense security.", "label": ["Edit/Control", "Important"], "rewrite": "If your request is directly related to national security and national defense security, you may not be responded."}
{"task": "rw_39.jsonl", "id": 50589, "text": "(2) Causes related to public safety, public health, and major public interests.", "label": ["Important", "Edit/Control"], "rewrite": "Your request is directly related to public safety, public health, and major public interests and may not be responded."}
{"task": "rw_39.jsonl", "id": 50590, "text": "(3) Crime investigation, prosecution, trial, and execution judgment.", "label": ["Important", "Edit/Control"], "rewrite": "Your request is related to criminal investigation, prosecution, and trial, and may not be responded."}
{"task": "rw_39.jsonl", "id": 50591, "text": "(4) There are sufficient evidence that the subject of personal information has subjective malice or abuse of rights.", "label": ["Edit/Control", "Important"], "rewrite": "Personal information controller has sufficient evidence to indicate that the subject of personal information has subjective malice or abuse of rights, and may not respond to the request."}
{"task": "rw_39.jsonl", "id": 50592, "text": "(5) Response your request will cause serious damage to the legitimate rights and interests of you or other individuals and organizations.", "label": ["Important", "Edit/Control"], "rewrite": "We may not be able to respond to requests that exceed the storage range, exceed the reasonable limit, or the legitimate rights and interests of personal information subjects or other individuals and organizations will be seriously damaged."}
{"task": "rw_39.jsonl", "id": 50593, "text": "(6) Causes of business secrets.", "label": ["Important", "Edit/Control"], "rewrite": "We may not be able to respond."}
{"task": "rw_39.jsonl", "id": 50594, "text": "(7) Other circumstances stipulated in laws and regulations.", "label": ["Important", "Edit/Control"], "rewrite": "Others stipulated in laws and regulations that make your requests unsure."}
{"task": "rw_39.jsonl", "id": 50595, "text": "6. How do we deal with the personal information of minors", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50596, "text": "(1) We attach great importance to protecting personal information of minors.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50597, "text": "If you are a minor, you should obtain the written consent of your parents or legal guardians before using our service.", "label": ["Specific Audiences", "Important"], "rewrite": "Minors should obtain written consent of the guardian in advance before using services."}
{"task": "rw_39.jsonl", "id": 50598, "text": "We will protect personal information of minors in accordance with relevant national laws and regulations.", "label": ["Specific Audiences", "Important"], "rewrite": "We will protect personal information of minors in accordance with relevant national laws and regulations."}
{"task": "rw_39.jsonl", "id": 50599, "text": "(2) For the personal information of minors collected by parents or legal guardians, we will only use or publicly use the consent of legal permission, parents or legal guardians to protect the minors, or publicize them.Discover relevant information.", "label": ["Specific Audiences", "Important"], "rewrite": "We will only use or publicly disclose information collected by legal permission, parents or legal guardians to clearly consent, protect minors."}
{"task": "rw_39.jsonl", "id": 50600, "text": "(3) If we find the personal information of minors without the consent of parents who have obtained minors or legal guardians in advance, we will delete relevant data as soon as possible.", "label": ["Specific Audiences", "Important"], "rewrite": "If the personal information of minors was collected without the consent of the legal guardian, he would try to delete relevant information as soon as possible."}
{"task": "rw_39.jsonl", "id": 50601, "text": "7. How can your personal information be transferred globally", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50602, "text": "In principle, the personal information we collected and generated in the territory of the People's Republic of China will be stored in the territory of the People's Republic of China.", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in domestic operations will be stored in China."}
{"task": "rw_39.jsonl", "id": 50603, "text": "If you need to transfer your personal information abroad, we will obtain your authorization consent separately. In this case, we will follow this policy to make your personal information sufficiently protected.", "label": ["Data Retention", "Important"], "rewrite": "If your personal information is out of the country, you will get your authorization consent separately."}
{"task": "rw_39.jsonl", "id": 50604, "text": "8. How to update this privacy policy", "label": [], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50605, "text": "Our privacy policy may change.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50606, "text": "Without your consent, we will not reduce the personal privacy right you should enjoy.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50607, "text": "We will publish any changes to this policy in the form of a notice.", "label": ["Policy Change", "Important"], "rewrite": "We will publish any changes to this policy in the form of a notice."}
{"task": "rw_39.jsonl", "id": 50608, "text": "In this case, if you continue to use our services, it means you agree to accept the restrictions of the revised privacy policy.", "label": ["Policy Change", "Important", "Risk"], "rewrite": "If you continue to use our services, you agree to accept the restrictions of the revised privacy policy."}
{"task": "rw_39.jsonl", "id": 50609, "text": "Nine, how to contact us", "label": [], "rewrite": []}
{"task": "rw_39.jsonl", "id": 50610, "text": "If you have any questions, opinions, suggestions, or complaints about this privacy policy, you can call customer service calls 10086 at any time, and contact us through online customer service and other methods of this website. We will actively verify, handle and answer as soon as possible.", "label": ["Important", "Contact Information"], "rewrite": "You can contact us by dialing customer service calls 10086 and online customer service through this website."}
{"task": "rw_39.jsonl", "id": 50611, "text": "Contact number: 10086", "label": ["Important", "Contact Information"], "rewrite": "Contact number: 10086"}
{"task": "rw_39.jsonl", "id": 50612, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
