{"task": "rw_37.jsonl", "id": 49648, "text": "Bank of China Co., Ltd. Mobile Banking Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49649, "text": "Updated in this version: May 29, 2022", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49650, "text": "Effective time of this version: May 29, 2022", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49651, "text": "Bank of China Co., Ltd. (hereinafter referred to as \"My Here\") knows the importance of personal information to you and will try its best to protect your personal information security.", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49652, "text": "We are committed to maintaining your trust in our trip, adhere to the following principles to protect your personal information: the principles of consistent power and responsibility, the principles of clear purpose, the principles of consent, the principles of necessity, the principle of safety, and the principle of openness and transparency.", "label": ["Important", "Data Security"], "rewrite": "Our bank will abide by the following principles to protect your personal information: the principles of consistent power and responsibility, the principles of clear purpose, the principle of consent, the principles of necessity, the principle of safety, and the principle of openness and transparency."}
{"task": "rw_37.jsonl", "id": 49653, "text": "At the same time, our bank promises to take corresponding security measures in accordance with the law to protect your personal information.", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49654, "text": "\"Privacy Policy of Bank of China Co., Ltd.\" (hereinafter referred to as \"Privacy Policy\") will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49655, "text": "1. How does our trip collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49656, "text": "2. How does our trip use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49657, "text": "3. How can our bank share, transfer and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49658, "text": "4. How does our trip store and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49659, "text": "5. How do our bank give you the right to manage personal information", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49660, "text": "6. How to deal with minors information", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49661, "text": "7. Application and update of this policy", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49662, "text": "8. How to contact me", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49663, "text": "1. How does our trip collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49664, "text": "Personal information refers to a variety of information that can identify specific natural persons or reflects the activity of specific natural persons in a single or other information with other information.", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49665, "text": "Personal information includes names, birthdays, ID numbers, personal biometric information, communication and communication contact information, address, account information, property status, trajectory trajectory, etc.", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49666, "text": "Once leaked or illegally used, it is easy to cause personal information of natural person's personality dignity or harmfulness of personal and property security, including information such as biometrics, religious beliefs, specific identities, medical and health, financial accounts, trajectory trajectory and other informationPersonal information of minors for four years.", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49667, "text": "(1) How to collect information", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49668, "text": "In order to provide you with mobile banking services and ensure your account number and service security, in the process of using your mobile phone service, our bank will collect the information you actively enter or use the service during the use of the service:", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Our travel will collect information you actively enter or due to service during the use of services."}
{"task": "rw_37.jsonl", "id": 49669, "text": "1. When you open mobile banking services at the outlets or online self -service, in accordance with laws and regulations and regulatory requirements, our bank will collect your personal basic information, identity information, account information, property information, communication information, biometric information, and biometric information.Help you complete your mobile banking registration. If you refuse to provide this information, you may not be able to open mobile banks or cannot use our travel services normally.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you open a mobile banking service, our bank will collect your personal information, identity information, account information, property information, communication information, communication information, biometric information to register for you."}
{"task": "rw_37.jsonl", "id": 49670, "text": "2. When you use mobile banking functions or services, for example, in the following situations, you may need to provide or authorize our bank to collect the user information required for the corresponding services.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use mobile banking functions or services, you may need to provide or authorize our bank to collect user information required for the corresponding services."}
{"task": "rw_37.jsonl", "id": 49671, "text": "If you refuse to provide some functions or services, you may not be able to use some functions or services, but this does not affect other functions or services of your normal use of mobile banking.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49672, "text": "(1) When you log in to mobile banking, our bank will verify the validity of the login mobile phone number, login password or gesture password. If you forget the login password and need to reset it, we need to verify your identity information, including mobile phone number, name, ID type, ID number, card number, card password, and security tool information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you log in to your mobile banking, our bank will check the effective verification of the login mobile phone number, login password or gesture password."}
{"task": "rw_37.jsonl", "id": 49673, "text": "Our bank will also collect equipment information for hardware binding and login security reinforcement.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Our club collects device information for hardware binding and login security reinforcement."}
{"task": "rw_37.jsonl", "id": 49674, "text": "If you do not provide the above information, you will not be able to log in or find your password, but this will not affect your available functions or services available if you do not log in.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49675, "text": "For certain brands or models of mobile terminals, you can choose fingerprint/face recognition authentication method based on the local biological characteristics of the device. The information is processed by the mobile terminal, and our bank will not leave your mobile terminal biological feature information.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "You can choose the fingerprint/face recognition authentication method based on the local biological characteristics of the device."}
{"task": "rw_37.jsonl", "id": 49676, "text": "You can open or close the fingerprint/face recognition function through the mobile banking \"My-Security Center and Settings\".", "label": ["Important", "Edit/Control"], "rewrite": "You can open or close the fingerprint/face recognition function through the mobile banking \"My-Security Center and Settings\"."}
{"task": "rw_37.jsonl", "id": 49677, "text": "When you start a mobile banking, the mobile banking will read the content of your mobile phone cutting board conditions and ask if you need to transfer the transfer to this bank.The number is automatically filled in the account field to simplify your operation.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "When you start a mobile banking, mobile banking will read the content of your mobile phone cutting board conditions and ask if you need to transfer the bank account."}
{"task": "rw_37.jsonl", "id": 49678, "text": "When you copy the product sharing password, the mobile banking will read the contents of the shear plate and show the bomb frame. If you click to view, you will jump to the corresponding product page.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you copy the product sharing password, the mobile banking will read the contents of the shear plate and show the bomb frame."}
{"task": "rw_37.jsonl", "id": 49679, "text": "The content read is only stored in the client and will not be transmitted to the background server.", "label": ["Important", "First Party Collection Information"], "rewrite": "The content read is only stored in the client and will not be transmitted to the background server."}
{"task": "rw_37.jsonl", "id": 49680, "text": "If you disagree, it does not affect your normal use of other functions.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49681, "text": "(2) If you choose to transfer, self -service associations, reset your password, and authentication through face recognition functions in mobile banking, you need to provide your face image information to our bank.In the database.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If you choose to transfer, self -service associations, reset your password, and authentication through face recognition functions, you need to provide your face image information to our bank. Our bank will be stored in the background database of our information system."}
{"task": "rw_37.jsonl", "id": 49682, "text": "If you do not provide the above information, our bank will not be able to provide you with products or services that need to be used after face recognition authentication.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49683, "text": "(3) When you use your mobile phone number transfer and call recharge involving the address book, our bank only obtains the contact information you chose from the address book;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use your mobile phone number transfer and call recharge involving the address book, our bank only obtains the contact information you chose from the address book."}
{"task": "rw_37.jsonl", "id": 49684, "text": "If you use the phone bill recharge function through voice navigation, our bank will read all the address book content to match the name and mobile phone number.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If you use the phone bill recharge function through voice navigation, our bank will read all the address book content to match the name and mobile phone number."}
{"task": "rw_37.jsonl", "id": 49685, "text": "The contents read above are only used for the operation and local use of mobile phones, and will not be left in the background of our bank.", "label": ["Important", "First Party Collection Information"], "rewrite": "The contents of the reading address of the read are only used for the time of the operation and the local use of the mobile phone, and will not be left in the background."}
{"task": "rw_37.jsonl", "id": 49686, "text": "If you do not need to use the above features, you can not provide this information, and it will not affect other functions of your use of mobile banking normally.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49687, "text": "You can select your mobile phone number without passing the address book.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49688, "text": "(4) When you use transfer remittances, mobile banking payment, QR code payment function, you need to provide the name of the receipt, bank card number/account number, account opening bank, capital use information, and may need to provide your name, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone, mobile phone.Numbers, certificates type and document numbers information to verify the identity and payment services using the above functions.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use transfer remittances, mobile banking payment, two -dimensional code payment function, you need to provide the name of the receipt, the bank card number/account, the account opening bank, the use of funds, and may need to provide your personal identity information."}
{"task": "rw_37.jsonl", "id": 49689, "text": "When you use the cross -border remittance function, our bank will collect the name, address, contact phone number, postcode, transfer account number, and the name of the payee, the country, the detailed address, and the receipt account.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the cross -border remittance function, our bank will collect the name, address, contact phone number, postcode, transfer account number, and the name of the payee, the country, the detailed address, and the receipt account."}
{"task": "rw_37.jsonl", "id": 49690, "text": "When you use BOC Study Abroad for remittances, you will also collect international students' names, international students ID numbers, and relevant certification materials for studying abroad.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use BOC Study Abroad, you need to provide international students' names, international students ID numbers, and materials related to studying abroad."}
{"task": "rw_37.jsonl", "id": 49691, "text": "When you use the function of studying abroad in Xilian, you will also collect information on the name, address, and study number of student students;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the function of studying abroad in Xilian, you need to provide information on student names, addresses, and international students."}
{"task": "rw_37.jsonl", "id": 49692, "text": "When using the Western Union remittance function, you will also collect your birth countries/regions, regions/regions, provinces and cities, postal codes, and professional information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the Western Union remittance function, you need to provide your birth country/region, certificate issuance country/region, province and city, postal code, occupational information."}
{"task": "rw_37.jsonl", "id": 49693, "text": "When you use the Hong Kong and Macau tuition payment function, you will collect student names, detailed addresses, and attachment information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the Hong Kong and Macau tuition payment function, you will collect student names, detailed addresses, and attachment information."}
{"task": "rw_37.jsonl", "id": 49694, "text": "In addition, our bank will collect your related receivable transactions for your inquiry.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Our bank will collect your related receivable transactions to facilitate your inquiry."}
{"task": "rw_37.jsonl", "id": 49695, "text": "If you refuse to provide this information, it will only make you unable to use the above features, but it does not affect other functions of your normal use of mobile banking.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49696, "text": "Our bank will also collect your transaction information to form a list of payee lists or remittance templates to simplify your transfer operation. You can not choose to automatically save it as a commonly used payee.delete.", "label": ["Edit/Control", "First Party Collection Information", "Usage", "Important"], "rewrite": "Our bank will collect your trading information to form a list of payee or remittance template."}
{"task": "rw_37.jsonl", "id": 49697, "text": "(5) When you use life services, outlets, cash cash appointments, and some third -party services, our bank will collect your geographical location information, the purpose is to provide you with the corresponding service at your location.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use life services, outlets, reservations for foreign currency cash, and some third -party services, our bank will collect your geographical location information."}
{"task": "rw_37.jsonl", "id": 49698, "text": "If you refuse to provide this information, it will affect your experience of using the above features, but this does not affect other functions of your normal use of mobile banking.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49699, "text": "(6) When you use the loan application function, our bank will collect your name, ID number, mobile phone number, location of the household registration, address, property information, housing information, contact information, and third -party institutions.After confirming the legitimacy of the personal information source of third -party institutions, the use of third -party institutions information on the premise of compliance with relevant laws and regulations and regulatory regulations.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the loan application function, our bank will collect your name, ID number, mobile phone number, location of the household registration, address, property information, housing information, contact information, and third -party institutions to evaluate your loan qualification."}
{"task": "rw_37.jsonl", "id": 49700, "text": "If you refuse to provide this information, you will not be able to use the above features, but this will not affect other functions of your use of mobile banking.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49701, "text": "(7) When you use investment and wealth management functions, our bank will collect your name, bank card number/account information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use investment and wealth management functions, our bank will collect your name, bank card number/account information."}
{"task": "rw_37.jsonl", "id": 49702, "text": "When you use the insurance function, you may collect your address, marriage status, occupation, communication method, vehicle information, housing information, health information, etc. for the formation of insurance policies;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the insurance function, you may collect your address, marriage status, occupation, communication method, vehicle information, housing information, health information, etc. for formulas."}
{"task": "rw_37.jsonl", "id": 49703, "text": "It may be a list of information formation of the insurer and the insurer that you enter, so that you can quickly insure the insurance next time, you can choose to delete it from the insured list;", "label": ["Edit/Control", "First Party Collection Information", "Usage", "Important"], "rewrite": "It may be a list of information formation of the insured and the insurer that you enter, so that you can quickly insure the insurance next time,"}
{"task": "rw_37.jsonl", "id": 49704, "text": "It is also possible to collect photos of identity documents of insured, insured, and beneficiaries for identity recognition and data preservation;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Photos of identity documents of the insured, insured, and beneficiary may be collected for identity recognition and data preservation."}
{"task": "rw_37.jsonl", "id": 49705, "text": "If you buy wealth management or insurance, our bank will also collect your transaction behavior on the product sales page according to regulatory requirements (including operating trajectory, content filled or selected) for recording the sales process for recoveable management.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If you buy wealth management or insurance, you need to collect your trading behavior on the product sales page."}
{"task": "rw_37.jsonl", "id": 49706, "text": "If you refuse to provide the above information, you will not be able to use the above features, but this will not affect other functions of your normal use of mobile banking.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49707, "text": "(8) When you use the online dual -recording function, you may need to provide face image information for identity identification. According to regulatory requirements, our bank will collect your audio and video information and simultaneously recording the product sales process.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the online dual -record function, you may need to provide face image information for identity identification."}
{"task": "rw_37.jsonl", "id": 49708, "text": "If you refuse to provide this information, you will not be able to use the above features, but this will not affect other functions of your use of mobile banking.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49709, "text": "(9) When you use the credit query function, our bank will check your credit report to the financial credit information basic database according to your ID number. Our bank will feed you the results of the inquiry results through the electronic banking system., Use, cut or disclose the query results.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the credit query function, our bank will check your credit report to the financial credit information basic database according to your ID number."}
{"task": "rw_37.jsonl", "id": 49710, "text": "Our bank receives 7 naturally inquiries in the credit report query results. Your credit report query results will be automatically deleted.", "label": ["Data Retention", "Important", "First Party Collection Information"], "rewrite": "The results of your credit report inquiry will be automatically deleted in the 7 naturally in the future."}
{"task": "rw_37.jsonl", "id": 49711, "text": "If you refuse to provide this information, you will not be able to use the above features, but this will not affect other functions of your use of mobile banking.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49712, "text": "(10) When you use SMS notifications and message push services, our bank will collect your mobile phone number, equipment information, account information and transaction information in order to send you account fund changes and related transaction notifications to you in time.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use SMS notifications and message push services, our bank will collect your mobile phone number, device information, account information and transaction information."}
{"task": "rw_37.jsonl", "id": 49713, "text": "If you do not provide the above information, you will not be able to use such notice and message services.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49714, "text": "(11) When you use the SIM shield, mobile shield, mobile phone trading code, and BOC E as a security certification tool, our bank will collect your mobile phone number, mobile phone equipment information, send a mobile phone trading code to your signing mobile phone number, verify the transaction password, For security tool verification.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the SIM shield, mobile shield, mobile phone trading code, and BOC E as a security certification tool, our bank will collect your mobile phone number and mobile phone equipment information for security verification."}
{"task": "rw_37.jsonl", "id": 49715, "text": "When you use the iOS system to receive the mobile phone transaction code, the mobile phone system will automatically read the verification code and return to the system keyboard.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the iOS system to receive the mobile phone transaction code, the mobile phone system will automatically read the verification code and return to the system keyboard."}
{"task": "rw_37.jsonl", "id": 49716, "text": "If you do not provide the above information, you will not be able to use such security certification tools.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49717, "text": "(12) You can also open online personal II, III electronic accounts and railway E cartoon accounts through \"online registration\" or \"my-> security and settings-> online account opening\". You need to provide us with your name to us, Mobile phone number, ID number, binding account account (card number), binding account type (whether it is Class I or a credit card account) to handle the business.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "You open online personal II, III electronic accounts, and railway E cartoon accounts. You need to provide your name, mobile phone number, ID number, binding account account, and binding account type."}
{"task": "rw_37.jsonl", "id": 49718, "text": "If you refuse to provide this information, you will not be able to use the above features, but this will not affect other functions of your use of mobile banking.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49719, "text": "(13) When you use the commemorative currency reservation function, our bank will collect your identity information, communication information, and business processing information for you to make appointments.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the commemorative currency reservation function, our bank will collect your identity information, communication information, and business processing information for you to register for your appointment."}
{"task": "rw_37.jsonl", "id": 49720, "text": "At the same time, our bank will collect your geographical information, the purpose is to provide you with the corresponding service at your location.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Our bank will collect your geographical information to provide you with the corresponding service you are located."}
{"task": "rw_37.jsonl", "id": 49721, "text": "If you refuse to provide the above information, you will not be able to use the above features, but this will not affect other functions of your normal use of mobile banking.", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49722, "text": "(14) When you use the phone bill recharge function, our bank will collect your recharge number, online banking customer number, and submit to the phone bill recharge service provider to recharge for you. In addition, our bank will collect your phone bill rechargeable rechargeThe transaction record is for your inquiry.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the phone bill recharge function, our bank will collect your recharge number, online banking customer number, and submit to the phone bill recharge service provider for your recharge and query."}
{"task": "rw_37.jsonl", "id": 49723, "text": "If you refuse to provide the above information, you will not be able to use the above features, but this will not affect other functions of your normal use of mobile banking.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49724, "text": "(15) When you use the living payment function to pay public undertakings, administrative undertakings, education and training, public transportation and other fees, our bank will collect the necessary personal information according to the required payment items, which may include names, ID numbers, mobile phone numbers, and payment of paymentAccount number, customer number, payment code, payment user number, payment amount information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the living payment function to pay the cost of public, administrative undertakings, education and training, public transportation, etc., our bank will collect necessary personal information including names and ID numbers."}
{"task": "rw_37.jsonl", "id": 49725, "text": "If you refuse to provide the above information, you will not be able to use this function, but it will not affect your other functions.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49726, "text": "When you apply for a service -to -contract payment (commission deduction) service, our bank will collect your name, ID number, bank card number (account), mobile phone number and payment user number information, and the payment user number and the bank card number (Account) binding in order to deduct from your authorized binding account after getting your to -pay bill.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you apply for a signing payment service, our bank will collect information such as your name, ID number, bank card number and other information."}
{"task": "rw_37.jsonl", "id": 49727, "text": "Our bank also verifies the bank card number (account) password, SMS verification code, dynamic password, mobile phone shield, BOC E -shield method to verify the effectiveness of your information on our bank., To ensure successfully obtaining your to -payment bill.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Our bank also verifies the validity verification of your relevant information by verifying the bank card number (account) password, SMS verification code, dynamic password, mobile phone shield, and BOC e -shield method."}
{"task": "rw_37.jsonl", "id": 49728, "text": "(16) When you use equity services, online precious metal sales systems, and integration mall services, our bank will need to obtain your name, ID number, contact information information. You also need to fill in the equity appointment information and receive goods in the order pagePeople name, receiving address and mobile phone number information. At the same time, the order will indicate the order number, the product or service information you purchased, the amount you should pay and the payment method information.Essence", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use equity services, online precious metal sales systems, and integral mall services, our bank will need to obtain your name, ID number, contact information information, and fill in the equity appointment information on the order page, the name of the consignee, and the receipt of the goodsAddress and mobile phone number information."}
{"task": "rw_37.jsonl", "id": 49729, "text": "When you book air tickets, train tickets, movie tickets, hotels and other businesses, you may also need to be based on national laws and regulations, regulatory requirements or service providers (including ticket sellers, hotels, travel agencies and its authorized agents and basic telecommunications operationsThe requirements of business, mobile resale operators, etc.) provide your real -name information. These real -name information may include your identity information (such as your resident ID card, officer card, passport, driver's license, Hong Kong and Macao residential residence permits, residents in Taiwan residents, residents in Taiwan residents livingCertificate such as copying or number of your identity), your own photos, names, and phone numbers.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you book tickets, train tickets, movie tickets, hotels and other businesses, you need to provide real -name information."}
{"task": "rw_37.jsonl", "id": 49730, "text": "These orders may include information such as your itinerary, hotel address.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49731, "text": "All the above information constitutes your order information. We will use your order information to perform your identity verification, determine transactions, payment settlement, complete distribution, query orders for you, and provide customer service consultation and after -sales service;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We will use your order information to perform your identity verification, determine transactions, payment settlement, complete distribution, query orders for you, and provide customer service consultation and after -sales service."}
{"task": "rw_37.jsonl", "id": 49732, "text": "We will also use your order information to determine whether your transaction is abnormal to protect your transaction security.", "label": ["Important", "Usage"], "rewrite": "We will use your order information to determine whether your transaction is abnormal to protect your transaction security."}
{"task": "rw_37.jsonl", "id": 49733, "text": "After placing an order, you can choose to use the Bank of China to pay or pay for other cards.", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49734, "text": "After you place an order and choose the payment to pay or complete the payment online, the merchant and third -party distribution companies will complete the delivery of the order for you.", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49735, "text": "You agree here that merchants, third -party distribution companies, after -sales service, etc. can use your order information to provide you with goods or services.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You agree that merchants and third -party distribution companies, after -sales service, etc. can use your order information to think that you provide goods or services."}
{"task": "rw_37.jsonl", "id": 49736, "text": "(17) When you use the revenue records, my bills, monthly bills, and annual billing functions, our bank will follow the asset overview of your previous natural monthly/previous natural yearSettings and your functional use in mobile banking are classified and statistics, so that you can more intuitive understanding of the revenue and expenditure and the previous natural month/previous natural annual related assets.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use revenue records, my bills, monthly bills, and annual billing functions, we will statistics based on your asset conditions, account details, and usage."}
{"task": "rw_37.jsonl", "id": 49737, "text": "If you refuse to provide this information, you will not be able to use the above features, but this will not affect other functions of your use of mobile banking.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49738, "text": "(18) When you use a credit card application function, our bank will collect names, mobile phone numbers, identity documents, age, company names, position positions, income, contact information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use a credit card application function, our bank will collect names, mobile phone numbers, identity documents, age, company names, position positions, income, contact information."}
{"task": "rw_37.jsonl", "id": 49739, "text": "If you refuse to provide the above information, you will not be able to use the above features, but this will not affect other functions of your normal use of mobile banking.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49740, "text": "3. When you use mobile banking services, in order to maintain the normal operation of the service and ensure your transaction security, we will collect your geographical location information, electronic equipment information (including device models, operating systems, and unique device identifiers (iOS system system (iOS system (IOS system systemFor UUID, Android systems as IMEI or Android, ID), login IP address, method, type and status, network quality data of access networks), the category and method of operating log information, the use of mobile banking functions or services, and you are in youThe user information of our bank analyzes this information based on the purpose of preventing electronic bank fraud or the requirements of the authority.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use mobile banking services, we will collect information such as geographical location information, electronic equipment information to prevent fraud and analyze."}
{"task": "rw_37.jsonl", "id": 49741, "text": "In the case of possible risks, in order to verify your identity, our bank may collect the bank card number (account) password, SMS verification code, dynamic passage code, face image information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to verify your identity, our bank may collect bank card numbers and passwords, SMS verification codes, dynamic passage codes, and face image information."}
{"task": "rw_37.jsonl", "id": 49742, "text": "If you do not agree to provide the aforementioned information, you may not be able to pass the risk control verification of the transaction.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49743, "text": "4. In order to provide you with better products and services, we may need to collect the following information.", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49744, "text": "If you refuse to provide the following information, it does not affect your basic business functions of our travel normally, but our bank cannot provide you with certain specific extensions and services.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49745, "text": "(1) Promotional activity function", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49746, "text": "When you participate in the promotion activities, our bank may collect information on the bank card number/account number/account number and corresponding user identification, age, mobile phone number, WeChat steps, financial assets, and financial assets that are bound to the WeChat Bank of ChinaJudgment of conditions and activities meet the standards, or you may also collect information such as your name, bank card number, identity document number, mobile phone number, mobile phone number, mailing address, transaction amount and other information for marketing activities related to prize distribution, tax return, identity recognition and other marketing activities.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you participate in the promotion activities, our bank may collect information such as the bank card number/account number/account number and corresponding user logo, age, mobile phone number, WeChat steps, financial assets, etc."}
{"task": "rw_37.jsonl", "id": 49747, "text": "If you refuse to provide this information, you will not be able to use the above features, but this will not affect other functions of your normal use of mobile banking.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49748, "text": "(2) I want to leave a message function", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49749, "text": "In order to improve the user experience and provide better service quality, we provide the \"I want to leave a message\" function. You can enter this feature through \"My-About Us\". This function will collect your contact information and your message contentEssence", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "You can enter the \"I want to leave a message\" through \"My-About Us\", which will collect your contact information and your message content."}
{"task": "rw_37.jsonl", "id": 49750, "text": "If you refuse to provide this information, you will not be able to use the above features, but this will not affect other functions of your use of mobile banking.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49751, "text": "(3) Search function", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49752, "text": "When you use the search service provided by a mobile banking, our bank will collect your search keyword information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the search service provided by a mobile banking, our bank will collect your search keyword information."}
{"task": "rw_37.jsonl", "id": 49753, "text": "When searching keyword information cannot identify your personal identity alone, the information does not belong to your user information, and our bank can use it for other purposes;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When searching keyword information cannot identify your personal identity alone, our bank can use other purposes."}
{"task": "rw_37.jsonl", "id": 49754, "text": "When searching keyword information with your other information can identify your personal identity, our bank will use your search keyword information as your user information during the combination period to protect it.", "label": ["Important", "Data Security"], "rewrite": "When searching keyword information with your other information can identify your personal identity, our bank will protect it."}
{"task": "rw_37.jsonl", "id": 49755, "text": "(4) Personalized service", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49756, "text": "In order to provide you with more accurate, personality and convenient services to enhance the service experience, our bank will analyze this information based on your customer's basic information, click operation information, position information, asset information, and to show you personalityRecommended functional recommendations, investment wealth management products recommendation.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Our bank will analyze this information based on your basic information, click operation information, position information, asset information, and analyze this information to show you personalized recommendations."}
{"task": "rw_37.jsonl", "id": 49757, "text": "At the same time, in order to ensure the autonomy of receiving information, our bank also provides the display content that is not based on personalized recommendation algorithms. You can enter the \"My-Security and Settings-Personalized Settings\" menu and close \"personalized recommendation\",\"Homepage Customization\" switch settings.", "label": ["Important", "Edit/Control"], "rewrite": "You can enter the \"Safety and Settings-Personalized Settings\" menu and turn off \"personalized recommendation\" and \"homepage customization\" switch settings."}
{"task": "rw_37.jsonl", "id": 49758, "text": "5. When you use the services provided by a third party in a mobile banking, in order to ensure that you can use the services and rights provided by the third party normally, after your explicit consent, the third party may obtain your name, gender, certificateTypes, documents, mobile phone numbers, current positions, and user logos, affiliated institutions numbers, and information generated by the internal system generated by the mobile banking date bank;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When you use the services provided by a third party in a mobile banking, the third party may obtain your name, gender, certificate type, certificate number, mobile phone number and other information after your consent."}
{"task": "rw_37.jsonl", "id": 49759, "text": "For related information provided by your third -party service after jumping for third -party services, such as actively entering information, allowing the positioning information, opening the mobile phone camera to get photos, identifying information through OCR, and selecting pictures in the mobile phone album, our bank will be regarded as you as youAllow the third party to obtain the above -mentioned information;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "For the relevant information that you take the initiative to provide a third party after jumping for a third -party service, our bank will be deemed that you allow the third party to obtain the above -mentioned information."}
{"task": "rw_37.jsonl", "id": 49760, "text": "For the information that you generate when using the third -party service, you and the third party should agree on the collection and use of the above information according to law.", "label": ["Policy Change", "Important", "Risk"], "rewrite": "For the information that you generate when using the third -party service, you and the third party should agree on the collection and use of the above information according to law."}
{"task": "rw_37.jsonl", "id": 49761, "text": "Third -party services may also directly use the system permissions that have explicitly informs you and obtain your authorization consent.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49762, "text": "You can check the authorized application, authorization time and authorized personal information content in the \"Security Center and Settings-Third Party Authorization Management\" of mobile banking, and you can also lift the authorization through this function.", "label": ["Important"], "rewrite": "You can check the authorized authority in the \"Security Center and Settings-Third Party Authorization Management\" of mobile banking and can be lolicically lit."}
{"task": "rw_37.jsonl", "id": 49763, "text": "If you refuse to collect, use or pass the above information when providing services, it may cause you to be unable to use the corresponding service of third parties in mobile banking, but this does not affect other functions of your mobile banking.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49764, "text": "After the withdrawal authorization, we cannot continue to provide you with the service corresponding to the withdrawal authorization, and we will no longer process your corresponding information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49765, "text": "But your decision to withdraw authorization will not affect the information processing based on your authorization.", "label": ["Important", "First Party Collection Information"], "rewrite": "Your decision to withdraw authorization will not affect information processing based on previous authorization."}
{"task": "rw_37.jsonl", "id": 49766, "text": "When you jump to the \"BOBO Speaking Machine\" function through a mobile banking, third -party service providers will collect your sound information to provide you with sound re -engraving services. Sound information will be transmitted and saved in third -party servers.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "When you jump to the \"BOBO Speaking Machine\" function through a mobile banking, third -party service providers will collect and save your sound information to provide you with sound re -engraving services."}
{"task": "rw_37.jsonl", "id": 49767, "text": "If you refuse to provide the above information, you will not be able to use this function, but it will not affect your other functions.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49768, "text": "6. In the following functions, you can choose to authorize our bank to use your personal information or permissions:", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "In the following functions, you can choose to authorize our bank to use your personal information or permissions:"}
{"task": "rw_37.jsonl", "id": 49769, "text": "Enjoy rights and interests, my rights and interests.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "Camera permissions can be used to identify QR codes, face recognition certification, take pictures, sweep, ETC, online account opening, foreign currency pass, online customer service, online recording, enjoyment of rights and interests, my rights and interests, my rights and interestsEssence"}
{"task": "rw_37.jsonl", "id": 49770, "text": "(2) Album and file storage: for file cache, identify QR code, face recognition authentication, take photos, sweep, ETC, online account setting function, foreign currency pass, online customer service, sharing function, Enjoy rights and interests, my rights.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "Album and file storage permissions are used for file cache, identify QR codes, face recognition certification, camera recognition card number, sweeping, ETC, online account setting function, foreign currency pass, online customer service, sharing function, enjoymentRights and interests, my rights and interests."}
{"task": "rw_37.jsonl", "id": 49771, "text": "(3) Mobile phone equipment permissions: used to obtain equipment identification information, for device binding, mobile shield opening, message push, risk control.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "Mobile phone equipment permissions are used to obtain equipment recognition information, for device binding, mobile shield opening, message push, risk control."}
{"task": "rw_37.jsonl", "id": 49772, "text": "(4) Microphone: For face recognition, BOC E -Shun (audio key), voice awakening, voice assistant, voice search, online dual records, BOBO voucher machines, exclusive rights, my rights and interests.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "Microphicism is used for face recognition, BOC E -Shun (audio key), voice awakening, voice assistant, voice search, online dual records, BOBO vocal machines, exclusive rights, my rights and interests."}
{"task": "rw_37.jsonl", "id": 49773, "text": "(5) Fingerprint/Facial Hardware: For fingerprint recognition and face recognition login function.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "Fingerprint/face hardware permissions are used for fingerprint recognition and facial recognition login function."}
{"task": "rw_37.jsonl", "id": 49774, "text": "(6) Address: Used for transfer and call recharge function.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "Communication recording permissions are used for transfer and call recharge functions."}
{"task": "rw_37.jsonl", "id": 49775, "text": "(7) Geographical location: used for trading risk control, outlets, reservation queues, foreign currency cash appointments, living payment, branch characteristics services, BOC E -shield (Bluetooth KEY), exclusive rights and interests, my rights and interests.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "Geographical location authority is used for transaction risk control, outlets, reservation queues, foreign currency cash appointments, living payment, branch characteristics services, BOC E -shield (Bluetooth KEY), exclusive rights, and my rights."}
{"task": "rw_37.jsonl", "id": 49776, "text": "(8) Bluetooth: BOC E (Bluetooth Key).", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "Bluetooth permissions are used for BOC E -Shield (Bluetooth Key)."}
{"task": "rw_37.jsonl", "id": 49777, "text": "(9) Network communication: used to communicate with the server.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "Network communication permissions are used to communicate with the server."}
{"task": "rw_37.jsonl", "id": 49778, "text": "(10) Notification permissions: for message push reminder function.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "The notification permissions are used for message push reminder function."}
{"task": "rw_37.jsonl", "id": 49779, "text": "(11) Siri: For Siri evoking function.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "Siri is used for Siri's evoking function."}
{"task": "rw_37.jsonl", "id": 49780, "text": "(12) Storage permissions: Used for credit card bills, online customer service, foreign currency pass, sweeping, BOC E -shield (Bluetooth Key), enjoyment of rights and interests, my rights and interests.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "Storage permissions are used for credit card bills, online customer service, foreign currency pass, sweeping, BOC E -shield (Bluetooth Key), exclusive rights, my rights and interests."}
{"task": "rw_37.jsonl", "id": 49781, "text": "(13) NFC: Chongqing Livable Card.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "NFC is used in Chongqing Livable Card."}
{"task": "rw_37.jsonl", "id": 49782, "text": "The above features may require you to turn on your camera (camera), album (picture library), geographical location (location information), microphone, Bluetooth, FACE ID, storage space, telephone, SMS, NFC, NFC, NFC, NFC, NFC, NFC, NFC, NFC, NFCThe access authority of the address book to achieve the collection and use of information involved in these functions.", "label": ["Usage", "First Party Collection Information", "Permission Acquisition"], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49783, "text": "Please note that when you turn on these permissions, it means that you can authorize our bank to collect and use this information to implement the above functions. If you cancel these authorization, our bank will no longer continue to collect and use your information, and you cannot do it for you for youProvide the above functions corresponding to these authorization.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "The opening of one authority means that the authorization is authorized to collect and use the relevant information to provide corresponding services. Close the authority to cancel the authorization representative, and no longer continue to collect and use relevant information based on the corresponding permissions."}
{"task": "rw_37.jsonl", "id": 49784, "text": "7. In the process of providing you to you, our system may also collect the following information through a third -party SDK. If you do not provide the following information, you will not be able to use such services.", "label": ["Important", "First Party Collection Information"], "rewrite": "Our system may also collect information through third -party SDK."}
{"task": "rw_37.jsonl", "id": 49785, "text": "(1) Electronic Social Security Card SDK: When you apply for an electronic social security card function, we use the SDK of the human resources and social security department to collect your name and ID number to transmit it to the human social department system for generating electronic social securityCard.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "When you apply for an electronic social security card function, our bank uses the SDK of the human resources and social security department to collect your name and ID number to transfer it to the human social department system for generating electronic social security cards."}
{"task": "rw_37.jsonl", "id": 49786, "text": "(2) UnionPay travel SDK: When you use UnionPay ride code, we use UnionPay's SDK to collect your online banking customer number, geographical location information and transmit it to the UnionPay system for generating a two -dimensional code.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "When you use UnionPay ride code, we use UnionPay's SDK to collect your online banking customer number, geographical location information and transmit it to the UnionPay system for generating a two -dimensional code."}
{"task": "rw_37.jsonl", "id": 49787, "text": "(3) Safety control SDK: We use Tencent's security risk control SDK. When you use the Android version of the client, collect your mobile phone equipment information including Boot, ID, Android, ID, Dummy, Mac, P2P, MACMobile phone type, current network type, system API level, software version number of equipment, versions of device display, Build parameters, mobile phone models, device drivers, screen size, system version, memory capacity, storage capacity, equipment host addressCPU maximum frequency, CPU nuclear number, CPU model, common software list of simulator, common files of simulator, installed software list, GPRSIP, GPRS network type, WIFI, BSSID, first -time use, current program path, host package name, host certificate certificateSignature, host SDKMD5, the device includes the number of token, the last time token status, the last time token value, the sessionid, execution time, abnormal log, protocol type, UI process stack top Activity name, the above information encryption is stored in the background of our line to ensure the backgroundYour transaction is safe.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We used Tencent's security risk control SDK to collect mobile phone equipment information and store them in the background."}
{"task": "rw_37.jsonl", "id": 49788, "text": "It has used disk size, time zone, overall memory size, mobile phone system time, equipment system, equipment name, system version, equipment model, equipment resolution, screen brightness, battery charging status, CPU core quantity, national information, local language information, whether to whetherConnected to mobile network logos, whether to connect to WIFI network identification, network models used, operator name, mobile network national code, mobile network national mobile code, mobile network code, device screen width, device screen height, whether the device is an emulator identification, Whether the device is jailbroken, WiFi Bssid, APP version number, SDK version number, Appid, whether to use VPN logo, proxy information IP and port, the above information encryption is stored in the background of our line to ensure you to ensure youTrading is safe.", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49789, "text": "(4) Mobile shield SDK: When you open and use the mobile shield service, we use the mobile phone shield SDK of Shanghai crowd network security technology Co., Ltd. to collect your device information. For the Android version of the client, the information includes the Android device number, Equipment unique identification, equipment model, equipment name, equipment serial number, motherboard model, MAC address, CPU architecture, CPU number, compile version, whether root and hook, system version;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you open and use your mobile shield service, use the mobile shield SDK to collect your device information."}
{"task": "rw_37.jsonl", "id": 49790, "text": "For the iOS version of the client, information includes UUID, device models, device names, whether ROOT, system version, CPU architecture, MAC address.", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49791, "text": "The above information is stored in the background of our line for equipment recognition and mobile phone shield security certification.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The information collected by the mobile phone shield SDK is stored in the background of our line for equipment recognition and mobile phone shield security certification."}
{"task": "rw_37.jsonl", "id": 49792, "text": "(5) Face recognition SDK: In order to provide you with face recognition service, we use Yuncong Technology's face recognition SDK. The SDK needs to obtain your face information to achieve face recognition function.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "We use Yun Cong Technology's face recognition SDK to obtain your face information for the face recognition function."}
{"task": "rw_37.jsonl", "id": 49793, "text": "(6) Voice recognition SDK: In order to provide you with voice text recognition services, we use the HKUST Xunfei's voice recognition SDK. The SDK needs to obtain your voice information to achieve voice recognition and voice search function.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "We use HKUST Xunfei's voice recognition SDK to obtain your voice information to achieve voice recognition and voice search function."}
{"task": "rw_37.jsonl", "id": 49794, "text": "(7) WeChat login SDK: When you log in with WeChat account, we use Tencent's WeChat login SDK. This SDK needs to obtain account information (avatar, nickname, region, gender) you authorized shared from WeChat for integration for integrationWeChat account login function.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "We use Tencent's WeChat login SDK to obtain the account information (avatar, nickname, region, gender) of your authorized sharing from WeChat to integrate WeChat account login functions."}
{"task": "rw_37.jsonl", "id": 49795, "text": "(8) Fingerprint authentication SDK: In order to provide you with fingerprint -based authentication services, we use the national certification SDK. The SDK needs to obtain the fingerprint authentication results of your device to achieve fingerprint authentication function.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We use the national certification SDK to obtain the fingerprint authentication results of your equipment to achieve fingerprint authentication function."}
{"task": "rw_37.jsonl", "id": 49796, "text": "(9) Tencent Positioning SDK: In order to provide you with location -based services, we use Tencent Positioning SDK. The above SDK needs to obtain your location information for the positioning function.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "We use Tencent Positioning SDK to obtain your location information for the positioning function."}
{"task": "rw_37.jsonl", "id": 49797, "text": "For the Android version of the client, in addition to the above SDK, the following third -party SDK involves the following third -party SDK:", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49798, "text": "(10) Push message push SDK: In order to push the notice to you in time, we used the message of Zhejiang Daily Interactive Co., Ltd. to push the SDK.Push service.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "We use the message of Zhejiang Daily Interactive Co., Ltd. to push SDK to obtain your equipment brand, model, and system version information to achieve message push services."}
{"task": "rw_37.jsonl", "id": 49799, "text": "(11) Huawei push SDK: In order to push the message to you in a timely manner, we use Huawei to push the SDK. The SDK needs to obtain AAID (application anonymous logo), apply token, TOPIC subscription relationship, and equipment storage information for the realization of Huawei mobile phones to realize Huawei mobile phonesThe mobile push service.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "Our bank uses Huawei push SDK to obtain AAID (anonymous logo), use Token, TOPIC subscription relationship, and equipment storage information to achieve the mobile push service of Huawei mobile phones."}
{"task": "rw_37.jsonl", "id": 49800, "text": "(12) Xiaomi push SDK: In order to push the message notification to you in time, I used Xiaomi to push the SDK. The SDK needs to obtain the unique logo (IMEI number), device model, network type, device storage, AAID (application anonymous identification (anonymous identifier)) Information is used to realize the mobile push service of Xiaomi mobile phone.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "Our travel uses Xiaomi Push SDK to obtain the unique logo (IMEI), device models, network types, device storage, AAID (anonymous logo) information for Xiaomi to achieve the mobile push service of Xiaomi mobile phone."}
{"task": "rw_37.jsonl", "id": 49801, "text": "(13) Meizu push SDK: In order to push the message to you in time, we use Meizu push SDK. The SDK needs to obtain the unique logo (IMEI number), device model, IP, address, MAC, address, location information, and location information of the SDK.Used to realize the mobile push service of Meizu mobile phone.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "Our travel uses Meizu push SDK to obtain the unique logo (IMEI number), device model, IP address, MAC address, and location information of the Meizu terminal to achieve the mobile push service of Meizu mobile phone."}
{"task": "rw_37.jsonl", "id": 49802, "text": "(14) vivo push SDK: In order to push the message to you in time, we use vivo push SDK. The SDK needs to obtain device storage information to achieve the mobile push service of the vivo mobile phone.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "Our travel uses vivo push SDK to take device storage information to achieve the mobile push service of the vivo mobile phone."}
{"task": "rw_37.jsonl", "id": 49803, "text": "(15) Cloud Flash Pay SDK: When you use the cloud flash payment function, we use UnionPay's Cloud Flash Pay SDK to collect your IMEI, Android, ID device information, which is only used for the client key generation, and it is not transmitted.To the background.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "We use UnionPay's cloud flash payment SDK to collect your IMEI and Android ID device information. It is only used for client density to generate and does not transmit it to the background."}
{"task": "rw_37.jsonl", "id": 49804, "text": "If you collect or use your information outside the above situation, we will ask your consent in advance and fully inform you the purpose, method, and scope of information collection and use.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "We will ask your consent in advance and fully inform you the purpose, methods, and scope of information collection and use, and then collect and use your information."}
{"task": "rw_37.jsonl", "id": 49805, "text": "(2) How to use information", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49806, "text": "1. Use the financial products or services of our bank and use it when improving these products or services.", "label": ["Important", "Usage"], "rewrite": "Provide you the financial products or services of our travel, and use collected information to improve these products or services."}
{"task": "rw_37.jsonl", "id": 49807, "text": "2. During our trip to you, you authorize our bank to continue to collect and use your information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "During our trip to you to provide you with financial services, you authorize our bank to continue to collect and use your information."}
{"task": "rw_37.jsonl", "id": 49808, "text": "When you cancel the service, we will stop collecting your relevant personal information, but our guild will continue to use your relevant personal information collected in the areas of business information archiving, auditing, regulatory investigation, performing anti -money laundering and sanctions regulations.", "label": ["Important", "First Party Collection Information"], "rewrite": "After cancellation, you will stop collecting your personal information, but you may continue to use the previous personal information due to archiving, auditing, etc."}
{"task": "rw_37.jsonl", "id": 49809, "text": "3. In order to improve your product or service experience, or to prevent risks, our bank will summarize, analyze, and process the service usage, but this information will not include any identity information information.", "label": ["Important", "Usage"], "rewrite": "Our travel will summarize, analyze, and process the service usage to enhance your product or service experience, or to prevent risks."}
{"task": "rw_37.jsonl", "id": 49810, "text": "4. In order to let you know the situation of using our bank's financial products or services or to make you more understanding our service, our bank will send you a service status notification and the commercial information of related products or services.", "label": ["Important", "Usage"], "rewrite": "Our bank will send you a service status notification and commercial information about related products or services."}
{"task": "rw_37.jsonl", "id": 49811, "text": "5. What you authorize and other purposes that are allowed by the law.", "label": ["Usage"], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49812, "text": "(3) Exceptions of obtaining authorization consent", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49813, "text": "According to relevant laws and regulations, regulatory requirements, and national standards, in the following circumstances, our bank may collect and use your relevant personal information without asking for your authorization consent:", "label": ["Important", "First Party Collection Information"], "rewrite": "According to relevant laws and regulations, regulatory requirements, and national standards, in the following circumstances, our bank may collect and use your relevant personal information without asking for your authorization consent:"}
{"task": "rw_37.jsonl", "id": 49814, "text": "1. Directly related to national security and national defense security;", "label": ["Important", "First Party Collection Information"], "rewrite": "The collection and use information directly related to national security and national defense security does not need to solicit authorization consent."}
{"task": "rw_37.jsonl", "id": 49815, "text": "2. Directly related to public safety, public health, and major public interests;", "label": ["Important", "First Party Collection Information"], "rewrite": "The collection and use information directly related to public safety, public health, and major public interests does not need to solicit authorization consent."}
{"task": "rw_37.jsonl", "id": 49816, "text": "3. Directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Important", "First Party Collection Information"], "rewrite": "Direct related collection and use information such as criminal investigation, prosecution, trial and judgment execution does not need to solicit authorization consent."}
{"task": "rw_37.jsonl", "id": 49817, "text": "4. For major legitimate rights and interests such as maintaining your or other individuals, but it is difficult to get your consent;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting the use information out of major legitimate rights and interests such as maintaining your life and property of your or other individuals, but it is difficult to get your consent, and you do not need to solicit authorization."}
{"task": "rw_37.jsonl", "id": 49818, "text": "5. The personal information you collected is publicly disclosed to the public by yourself;", "label": ["Important", "First Party Collection Information"], "rewrite": "The collected personal information is publicly disclosed to the public by itself, and there is no need to solicit authorization consent."}
{"task": "rw_37.jsonl", "id": 49819, "text": "6. Collect personal information from the information disclosed by legal and publicly disclosed, such as legal news reports and government information disclosure;", "label": ["Important", "First Party Collection Information"], "rewrite": "If you collect personal information from the legal disclosure information, you do not need to solicit authorization consent."}
{"task": "rw_37.jsonl", "id": 49820, "text": "7. Signing and fulfilling the contract according to your requirements;", "label": ["Important", "First Party Collection Information"], "rewrite": "According to your request to sign and perform the collection and use information necessary for the contract, no authorization consent is required."}
{"task": "rw_37.jsonl", "id": 49821, "text": "8. It is necessary to maintain the safe and stable operation of the products or services provided by maintenance, such as the failure of discovering and disposing of products or services;", "label": ["Important", "First Party Collection Information"], "rewrite": "The collection and use information necessary for the safe and stable operation of the products or services provided by the products provided does not need to solicit authorization consent."}
{"task": "rw_37.jsonl", "id": 49822, "text": "9. When the public interest is necessary to carry out statistics or academic research, and when it provides academic research or description results, the personal information contained in the result is identified by", "label": ["Important", "First Party Collection Information"], "rewrite": "When the public interest is required to carry out statistics or academic research, and the results of academic research or descriptions are provided, the personal information contained in the results is identified to identify it without soliciting authorization consent."}
{"task": "rw_37.jsonl", "id": 49823, "text": "10. In order to fulfill anti -money laundering and sanctions;", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to fulfill the collection and use information of anti -money laundering and sanctions, no authorization consent is required."}
{"task": "rw_37.jsonl", "id": 49824, "text": "11. Other circumstances stipulated in laws and regulations and regulatory requirements.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49825, "text": "2. How can our trip use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49826, "text": "(1) Cookie", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49827, "text": "To ensure the normal operation of the service, our will store small data files named Cookie on your computer or mobile devices.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49828, "text": "Cookie usually contains identifiers, site names, and some numbers and characters.", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49829, "text": "With Cookie, the website can store your preference data.", "label": ["Important", "First Party Collection Information"], "rewrite": "With Cookie, the website can store your preference data."}
{"task": "rw_37.jsonl", "id": 49830, "text": "Our bank will not use Cookie for any purpose outside of the purpose of this policy.", "label": ["Important", "First Party Collection Information"], "rewrite": "Our bank will not use Cookie for any purpose outside of the purpose of this policy."}
{"task": "rw_37.jsonl", "id": 49831, "text": "You can manage or delete Cookie according to your preferences.", "label": ["Important", "Edit/Control"], "rewrite": "You can manage or delete Cookie according to your preferences."}
{"task": "rw_37.jsonl", "id": 49832, "text": "You can clear all the cookies saved on the computer, and most of the network browsers have the function of preventing cookies.", "label": ["Important", "Edit/Control"], "rewrite": "You can clear all the cookies saved on the computer."}
{"task": "rw_37.jsonl", "id": 49833, "text": "But if you do this, you need to change the user settings when you visit the APP of our trip.", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49834, "text": "(2) Do Not Track (Do not track)", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49835, "text": "Many network browsers have the Do not track function, which can release the DO Not Track request to the website.", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49836, "text": "At present, the major Internet standard organization has not yet established relevant policies to stipulate how websites should respond to such requests.", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49837, "text": "But if your browser enables Do, Not, Track, then all our websites will respect your choice.", "label": ["Important", "Edit/Control"], "rewrite": "You can enable Do Not Track."}
{"task": "rw_37.jsonl", "id": 49838, "text": "3. How can our bank share, transfer and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49839, "text": "(1) Sharing and transfer", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49840, "text": "1. Unless you get your clear consent or authorization, our bank will not share or transfer your personal information from any other companies, organizations and individuals.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Unless you get your clear consent or authorization, our bank will not share or transfer your personal information from any other companies, organizations and individuals."}
{"task": "rw_37.jsonl", "id": 49841, "text": "2. If the business needs to share or transfer your personal information to the outside world, we will inform you that the types of sharing or transfer of personal information, the name of the data receiver, the processing purpose, and processing method, and obtain your authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "If you need to share or transfer your personal information, we will inform us of the types of sharing or transfer of personal information, the name of the data receiver, the purpose of processing, and the processing method, and obtain your authorization consent."}
{"task": "rw_37.jsonl", "id": 49842, "text": "Involving sensitive information, we will also inform the types of sensitive information, the identity of the data receiver, and the data security ability of the data receiver, the need to handle sensitive personal information, and the impact of your personal rights and interests, and obtain your independent authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "If you transfer sensitive information, we will obtain your independent authorization consent."}
{"task": "rw_37.jsonl", "id": 49843, "text": "3. Please understand that our bank may share your personal information to the outside world in accordance with the provisions of laws and regulations, or in accordance with the mandatory requirements of the government authorities, or to fulfill the anti -money laundering and sanctions regulations.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Our bank may share your personal information to the outside world in accordance with the provisions of laws and regulations, or in accordance with the mandatory requirements of the government authority, or to perform anti -money laundering and sanctions regulations."}
{"task": "rw_37.jsonl", "id": 49844, "text": "4. According to laws and regulations and business practices, in similar transactions such as mergers, acquisitions, asset transfer, etc., if you involve personal information transfer, our guild requires new companies and organizations that hold your personal information to continue to be subject to the constraints of their privacy policies.Otherwise, our bank will ask the company and the organization to reconcile your authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When involving mergers, acquisitions, or bankruptcy liquidation, if personal information transfer is involved, it will be required to continue to be bound by the policy, otherwise it will request that it will re -solicit authorization consent."}
{"task": "rw_37.jsonl", "id": 49845, "text": "5. In the scope of legal requirements or permits, it is necessary to provide your personal information to a third party in order to protect the interests, property or security of our banks and its customers or the public.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the scope of legal requirements or permits, it is necessary to provide your personal information to third parties in order to protect the interests of our banks and its customers or the public."}
{"task": "rw_37.jsonl", "id": 49846, "text": "6. Your personal information may be shared within our bank and affiliated companies. Our bank will only be shared with your own authorization consent, and this sharing is restricted by the purpose of this policy.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Our bank will be shared within our bank and affiliated companies only with your own authorization consent."}
{"task": "rw_37.jsonl", "id": 49847, "text": "Once you change the purpose and method of personal information, you will solicit your authorization consent again.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Once you change the purpose and method of personal information, you will solicit your authorization consent again."}
{"task": "rw_37.jsonl", "id": 49848, "text": "The scope of sharing personal information will be determined according to the specific business situation. If the financial supervision and management department is submitted to the financial supervision and management department according to the requirements, it may be shared your personal identity information and account information within the business institutions and affiliated companies of our bank.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The scope of sharing personal information will be dependent on specific business conditions."}
{"task": "rw_37.jsonl", "id": 49849, "text": "7. In order to provide you with more complete and high -quality products and services, some of our services will be provided by the partners.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49850, "text": "Our bank may share some of your personal information with partners to provide better customer service and user experience.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Our bank may share some of your personal information with partners to provide better customer service and user experience."}
{"task": "rw_37.jsonl", "id": 49851, "text": "Our bank will only share your personal information for legal, correct, necessary, specific, and clear purposes, and after your separate authorization consent, you will share your personal information, and will only share the personal information necessary for the service.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Our bank will only share your personal information for legal, correct, necessary, specific, and clear purposes, and after your separate authorization consent, you will share your personal information, and will only share the personal information necessary for the service."}
{"task": "rw_37.jsonl", "id": 49852, "text": "At the same time, our guild signed a rigorous confidentiality agreement with the partner, asking them to handle your personal information in strict accordance with our bank's instructions, this policy, and any other related confidentiality and security measures.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Our guild signed a rigorous confidentiality agreement with the partner, asking them to take security measures to handle your personal information."}
{"task": "rw_37.jsonl", "id": 49853, "text": "Our bank will require our cooperation party to use personal information for any other purpose.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "The partner of our bank has no right to use the shared personal information for any other purpose."}
{"task": "rw_37.jsonl", "id": 49854, "text": "If you refuse our partner to share your personal information with our bank's collection with our bank when providing services, it may cause you to be unable to use the service on our bank.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49855, "text": "(2) Public disclosure", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49856, "text": "1. We will not disclose your personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not disclose your personal information publicly. If we really need to disclose, we will tell you the purpose and type of personal information."}
{"task": "rw_37.jsonl", "id": 49857, "text": "In addition to the above, in addition to the above, our bank will also inform you that the necessity of processing sensitive personal information and the impact on your personal rights.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Our bank will inform you that the need to handle sensitive personal information and the impact on your personal rights."}
{"task": "rw_37.jsonl", "id": 49858, "text": "2. Please understand that we may publicly disclose your personal information if legal, legal procedures, lawsuits or government authorities are required.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the case of compulsory requirements of legal, legal procedures, litigation, or government authorities, we may disclose your personal information publicly."}
{"task": "rw_37.jsonl", "id": 49859, "text": "(3) Exceptions of obtaining authorization consent", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49860, "text": "According to relevant laws and regulations, regulatory requirements, and national standards, in the following circumstances, we may share, transfer, and openly disclose user information without requiring your authorization consent in advance:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "According to relevant laws and regulations, regulatory requirements, and national standards, in the following circumstances, we may share, transfer, and openly disclose user information without requiring your authorization consent in advance:"}
{"task": "rw_37.jsonl", "id": 49861, "text": "1. Directly related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The sharing or disclosure directly related to national security and national defense security does not require authorization."}
{"task": "rw_37.jsonl", "id": 49862, "text": "2. Directly related to public safety, public health, and major public interests;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Sharing or disclosure directly related to public safety, public health and major public interests does not need to be authorized."}
{"task": "rw_37.jsonl", "id": 49863, "text": "3. Directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Sharing or disclosure related to criminal investigation, prosecution, trial, and judgment execution does not need to be authorized."}
{"task": "rw_37.jsonl", "id": 49864, "text": "4. For major legitimate rights and interests such as maintaining your life, property, and reputation of your or other individuals, it is difficult to get my consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Out of the major legitimate rights and interests of the life and property of the subject of personal information or other individuals, it is difficult to get shared or disclosed by my consent, and there is no need to solicit."}
{"task": "rw_37.jsonl", "id": 49865, "text": "5. Personal information that you disclose to the public by yourself;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The collected personal information is your own sharing or disclosure of your own public to the public, without having to solicit authorization."}
{"task": "rw_37.jsonl", "id": 49866, "text": "6. In order to fulfill the regulations on anti -money laundering and sanctions;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to fulfill the sharing, transfer or disclosure of anti -money laundering and sanctions, no authorization is required."}
{"task": "rw_37.jsonl", "id": 49867, "text": "7. User information collected from legal publicly disclosed information, such as legal news reports, government information disclosure and other channels.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you collect personal information from the legal disclosure information, no authorization is required."}
{"task": "rw_37.jsonl", "id": 49868, "text": "Fourth, how can our trip store and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49869, "text": "(1) Storage", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49870, "text": "1. The personal information collected and generated in the territory of the People's Republic of China will be stored in the People's Republic of China.", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in domestic operations will be stored in China."}
{"task": "rw_37.jsonl", "id": 49871, "text": "But in order to deal with cross -border business and get your authorization consent, your personal information includes the name, address, contact phone number, postcode, and the name of the payee, the country, the detailed address, and the transfer account will be used as the transaction information.Some are transmitted abroad.", "label": ["Data Retention", "Important", "Risk"], "rewrite": "In order to handle cross -border business and obtain your authorization consent, your personal information will be transmitted overseas as part of the transaction information."}
{"task": "rw_37.jsonl", "id": 49872, "text": "When you use BOC Study Abroad or West Union's study abroad remittance business, the information transmitted to overseas also has names, addresses, postcodes, countries, mailboxes, and school numbers.Where the provinces and cities and career information.", "label": ["Data Retention", "Important"], "rewrite": "When you use BOC Study Abroad for remittances or the Western Union's study abroad remittance business, information transmitted to overseas also includes names, addresses, postcodes, and countries."}
{"task": "rw_37.jsonl", "id": 49873, "text": "In this case, our bank will take effective measures to protect your information security. For example, before cross -border data transfer, measures, verification and other measures require overseas institutions to keep confidential for your information.", "label": ["Important", "Data Security"], "rewrite": "Our bank will adopt a confidentiality agreement and verification to protect your information security."}
{"task": "rw_37.jsonl", "id": 49874, "text": "2. Our bank only retains your personal information within the minimum time limit of laws and regulations or to fulfill the minimum period of anti -money laundering and sanctions.At least 20 years of preservation, fund investor information and transaction backups should be stored on unmodified media for 15 years.", "label": ["Data Retention", "Important"], "rewrite": "Our bank only retains your personal information only within the minimum period of laws and regulations or to fulfill the minimum period of anti -money laundering and sanctions, as well as the minimum time limit for the purpose of realizing the purpose of this policy statement."}
{"task": "rw_37.jsonl", "id": 49875, "text": "When the data preservation period is exceeded, our bank will delete or processes your information.", "label": ["Data Retention", "Important"], "rewrite": "When the data preservation period is exceeded, your information will be deleted or anonymous."}
{"task": "rw_37.jsonl", "id": 49876, "text": "For example:", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49877, "text": "Mobile phone number: When you need to use mobile banking services, our bank needs to keep your mobile phone number to ensure that you use the service normally. When you cancel the mobile banking account, our bank will delete the corresponding information;", "label": ["Data Retention", "Important"], "rewrite": "When you need to use a mobile banking service, our bank needs to save your mobile phone number until you delete it after you cancel it."}
{"task": "rw_37.jsonl", "id": 49878, "text": "User avatar: When you set up your avatar, our guild has always saved your avatar for login page display.", "label": ["Data Retention", "Important"], "rewrite": "When you set the avatar, our guild has always saved your avatar for login page display."}
{"task": "rw_37.jsonl", "id": 49879, "text": "When you choose to restore the default avatar, our bank will delete the avatar information you set.", "label": ["Data Retention", "Important"], "rewrite": "When you choose to restore the default avatar, our bank will delete the avatar information you set."}
{"task": "rw_37.jsonl", "id": 49880, "text": "(2) Protection", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49881, "text": "1. Our bank has used security protection measures that meet the industry standards to protect your personal information, prevent data from being interviewed, publicly disclosed, used, modified, damaged or lost.", "label": ["Important", "Data Security"], "rewrite": "We use security protection measures to protect your personal information."}
{"task": "rw_37.jsonl", "id": 49882, "text": "Our trip will take all reasonable and feasible measures to protect your personal information.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49883, "text": "For example: Our trip will adopt corresponding encryption and de -identification technology to ensure the confidentiality of the data;", "label": ["Important", "Data Security"], "rewrite": "Our trip will adopt corresponding encryption and de -identification technologies to ensure the confidentiality of the data."}
{"task": "rw_37.jsonl", "id": 49884, "text": "Our guilty uses a trusted protection mechanism to prevent data from being maliciously attacked;", "label": ["Important", "Data Security"], "rewrite": "Our guided use of trusted protection mechanisms to prevent data from being maliciously attacked."}
{"task": "rw_37.jsonl", "id": 49885, "text": "Our association deploys the access permission control mechanism to ensure that only authorized personnel can access personal information;", "label": ["Important", "Data Security"], "rewrite": "Our association deploys the access permission control mechanism to ensure that only authorized personnel can access personal information."}
{"task": "rw_37.jsonl", "id": 49886, "text": "And our guild organize safety and privacy protection training courses to strengthen employees' awareness of protecting the importance of personal information.", "label": ["Important", "Data Security"], "rewrite": "Our guild organizes safety and privacy protection training courses to strengthen employees' awareness of protecting the importance of personal information."}
{"task": "rw_37.jsonl", "id": 49887, "text": "2. If all or part of the mobile banking business provided by our bank is stopped operation, the relevant products or services of our bank will inform you through the announcement and other forms, and at the same time stop the operation of related products or servicesPersonal information security.", "label": ["Important", "Data Security", "Cessation of Operations"], "rewrite": "When stopping operation, we will make an announcement notice and delete or processes your personal information."}
{"task": "rw_37.jsonl", "id": 49888, "text": "If all or part of the mobile banking business interruption is caused by various reasons such as technical faults, network attacks, natural disasters and accidents, and human factors, our bank will take emergency treatment and restoration measures to respond to restore services as soon as possible.", "label": ["Important", "Data Security"], "rewrite": "Our bank will take emergency response and restoration measures to respond to the interruption of mobile banking business and restore services as soon as possible."}
{"task": "rw_37.jsonl", "id": 49889, "text": "3. Please understand that due to the limitation of technical level and possible malicious attacks, there may be unexpected situations that cannot be reasonably foresee, prevent, avoid, and control.", "label": ["Important", "Data Security"], "rewrite": "There may still be an accident that we cannot foresee, prevent, avoid, and control it reasonably."}
{"task": "rw_37.jsonl", "id": 49890, "text": "The Internet is not an absolutely secure environment. Please use complex passwords and security tools to assist us in ensuring your account security.", "label": ["Important", "Data Security"], "rewrite": "Please use complex passwords to help us guarantee your account security."}
{"task": "rw_37.jsonl", "id": 49891, "text": "4. If a personal information security incident occurs, our bank will inform you in accordance with the requirements of the laws and regulations in a timely manner, or a reasonable and effective way to issue an announcement in a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "The relevant situation of security incidents will be informed or issued by mail, letter, telephone, push notification, etc. or issued an announcement."}
{"task": "rw_37.jsonl", "id": 49892, "text": "At the same time, our bank will also report to the disposal of personal information security incidents in accordance with regulatory regulations.", "label": ["Important", "Data Security"], "rewrite": "Our bank will also report to the disposal of personal information security incidents in accordance with regulatory regulations."}
{"task": "rw_37.jsonl", "id": 49893, "text": "Fifth, how can our bank give you the right to manage personal information", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49894, "text": "In accordance with the relevant laws and regulations and regulatory regulations of the People's Republic of China, our bank guarantees your personal information to exercise the following rights:", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49895, "text": "(1) Visit, correct and update your personal information", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49896, "text": "You have the right to access, correct, and update your personal information through our mobile banking channels, except for other provisions of laws and regulations.", "label": ["Important", "Edit/Control"], "rewrite": "You have the right to access, correct, and update your personal information through our mobile banking channels, except for other provisions of laws and regulations."}
{"task": "rw_37.jsonl", "id": 49897, "text": "You have a responsibility to update your personal information in time.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49898, "text": "Before you modify your personal information, we will verify your identity.", "label": ["Important", "Edit/Control"], "rewrite": "Before you modify your personal information, we will verify your identity."}
{"task": "rw_37.jsonl", "id": 49899, "text": "1. You can check the names, gender, nationality, date of birth, certificate type, certificate number, electronic bank customer serial number through the mobile banking \"My Personal Information\" or the online bank \"Personal Settings-Customer Information Management\"Information, such basic information cannot be modified online, and can only go to offline outlets to modify;", "label": ["Edit/Control", "Important"], "rewrite": "You can check your basic information through the mobile banking \"My Personal Information\" or the online bank \"Personal Settings-Customer Information Management\", but you can only go to offline outlets to modify."}
{"task": "rw_37.jsonl", "id": 49900, "text": "You can also query address information, work information, contact information, more information, and update the validity period of your ID card. Such information can be modified online through mobile banking.", "label": ["Edit/Control", "Important"], "rewrite": "You can query address information, work information, contact information, more information, update the validity period of your ID card, such information can be modified online through mobile banking."}
{"task": "rw_37.jsonl", "id": 49901, "text": "2. You can perform limited settings, login password settings, security tool settings, binding device settings, and reserved information settings through mobile banking \"My-Security Center and Settings\" or online banking.", "label": ["Important", "Edit/Control"], "rewrite": "You can perform limited settings, login password settings, security tool settings, binding device settings, and reserved information settings through mobile banking \"My-Security Center and Settings\" or online banking."}
{"task": "rw_37.jsonl", "id": 49902, "text": "(2) Delete your personal information", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49903, "text": "In the following circumstances, you can make a request to delete personal information from our bank:", "label": ["Edit/Control", "Important"], "rewrite": "You can make a request to delete personal information to our bank."}
{"task": "rw_37.jsonl", "id": 49904, "text": "1. If our behavior of handling personal information violates laws and regulations;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49905, "text": "2. If we collect and use your personal information, you have not obtained your consent;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49906, "text": "3. If our behavior of handling personal information violates your agreement;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49907, "text": "4. If you no longer use our products or services, or you cancel your account;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49908, "text": "5. If my trip no longer provides you with products or services;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49909, "text": "6. If the user withdraws the privacy policy.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49910, "text": "If our bank decides to respond to your deletion request, our bank will also notify the entities that obtain your personal information from our bank, asking them to delete them in time, unless laws and regulations have other regulations, or these entities have obtained your independent authorization.", "label": ["Important", "Edit/Control"], "rewrite": "If our bank decides to respond to your deletion request, it will also notify the entities that obtain your personal information from our bank, asking them to delete them in time."}
{"task": "rw_37.jsonl", "id": 49911, "text": "After you delete the mobile banking APP in the mobile terminal, the local information of the terminal will be deleted, but the personal information in the background has not been deleted.", "label": ["Important", "Edit/Control"], "rewrite": "After you delete the mobile banking APP in the mobile terminal, the local information of the terminal will be deleted, but the personal information in the background has not been deleted."}
{"task": "rw_37.jsonl", "id": 49912, "text": "After you online or go to the counter to cancel the electronic banking users, you can delete your personal information in our services.", "label": ["Important", "Edit/Control"], "rewrite": "After you cancel the electronic banking users, you can delete your personal information in the service."}
{"task": "rw_37.jsonl", "id": 49913, "text": "When you delete the information from our services, we may not immediately delete the corresponding information in the backup system, but will delete these information when the backup is updated.", "label": ["Important", "Edit/Control"], "rewrite": "Delete the information you require delete in the backup update."}
{"task": "rw_37.jsonl", "id": 49914, "text": "(3) Change the scope of your authorization consent", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49915, "text": "Each business function requires some basic personal information to complete.", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49916, "text": "For the collection and use of extra collected personal information, you can give or revoke your authorization consent at any time based on different brands and models of mobile phones, to open or close location service permissions, read contact human rights, call calls, etc., and cancel or revoke your authorization consent at any time.", "label": ["Important", "Edit/Control"], "rewrite": "You can give or revoke your authorization consent at any time by opening or closing location service permissions, reading contact human rights, calling permissions, etc. at any time."}
{"task": "rw_37.jsonl", "id": 49917, "text": "You can click the \"Revisible Agreement Agreement\" through the mobile banking \"My-Privacy Policy\".", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49918, "text": "Please note that while you cancel our mobile banking service independently, you will depend on your consent of your mobile banking service \"Privacy Policy\". For example, if you cancel our mobile banking serviceThe consent of our mobile banking \"Privacy Policy\".", "label": ["Policy Change", "Important"], "rewrite": "While canceling our mobile banking services independently, it will be deemed that you will withdraw your consent of the \"Privacy Policy\" of mobile banking services."}
{"task": "rw_37.jsonl", "id": 49919, "text": "When you recover your consent, our bank will no longer process the corresponding personal information.", "label": ["Policy Change", "Important"], "rewrite": "After the withdrawal consent, our bank will no longer process the corresponding personal information."}
{"task": "rw_37.jsonl", "id": 49920, "text": "But your decision to recover the consent will not affect personal information processing based on your authorization.", "label": ["Important", "Risk"], "rewrite": "The decision you take back will not affect the personal information processing based on your previous authorization."}
{"task": "rw_37.jsonl", "id": 49921, "text": "(4) Profile accounts for personal information main body", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49922, "text": "If you register for mobile banking for our mobile phone, you can turn off your mobile banking channel or cancel the electronic banking, or go to the outlet to cancel your electronic banking services.", "label": ["Edit/Control", "Important"], "rewrite": "You can close your mobile banking channel online or cancel the electronic banking, or go to the outlet to cancel your electronic banking services."}
{"task": "rw_37.jsonl", "id": 49923, "text": "If you need to close the mobile banking channel, you can log in to online banking and enter the \"Personal Settings-Mobile Banking Open Close\" function.", "label": ["Important", "Edit/Control"], "rewrite": "If you need to close the mobile banking channel, you can log in to online banking and enter the \"Personal Settings-Mobile Banking Open Close\" function."}
{"task": "rw_37.jsonl", "id": 49924, "text": "If you need to cancel the electronic banking service, you can enter the mobile banking to enter \"My-Security and Settings-Logging out Electronic Bank\", or \"Mine-About Us-\" China Banking Co., Ltd. Mobile Banking Service Agreement \", online, online, online, online, onlineLogging out the function of electronic banking \"or searching for\" cancellation \"and entering the online cancellation function.", "label": ["Edit/Control", "Important"], "rewrite": "If you need to cancel the electronic banking service, you can record the mobile banking to enter the \"My-Security and Settings-Logging up the Electronic Bank\", or \"Mine-About Us-\" China Banking Co., Ltd. Mobile Banking Service Agreement \"online to cancel onlineElectronic banking function \"or search\" cancellation \"for cancellation."}
{"task": "rw_37.jsonl", "id": 49925, "text": "Your behavior of logging out mobile banking is irreversible. Once you log out your electronic bank, your mobile banking will cancel simultaneously. We will no longer collect your personal information through the mobile banking client and will delete everything about your mobile bankingExcept for information, laws and regulations, or regulators, the storage time of personal information is otherally stipulated.", "label": ["Important", "Edit/Control"], "rewrite": "Your behavior of logging out mobile banking is irreversible. After the cancellation, all your information will be deleted."}
{"task": "rw_37.jsonl", "id": 49926, "text": "If you are not a registered user of mobile phone banks, you can choose to uninstall or stop using mobile banking clients to prevent us from obtaining your personal information.", "label": ["Important", "Edit/Control"], "rewrite": "If you are not a registered user, you can uninstall or stop using the mobile banking client to prevent information from obtaining."}
{"task": "rw_37.jsonl", "id": 49927, "text": "Please note that when the registered users of our mobile phone banking only delete the mobile banking app in the mobile phone device, our bank will not cancel your mobile banking, and all the information about your mobile banking will not delete it.", "label": ["Important", "Edit/Control"], "rewrite": "When the mobile banking APP is deleted alone in the mobile phone device, the information inside will not be deleted."}
{"task": "rw_37.jsonl", "id": 49928, "text": "You still need to cancel your mobile banking to achieve the above goals.", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49929, "text": "Logging out on mobile banks will not automatically cancel your fast payment and fast payment authorization. You can take the initiative to cancel the authorization in the fast payment function or third -party.", "label": ["Important", "Edit/Control"], "rewrite": "Logging out on mobile banks will not automatically cancel your fast payment and fast payment authorization."}
{"task": "rw_37.jsonl", "id": 49930, "text": "(5) Personal information subject obtain a copy of personal information", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49931, "text": "You have the right to obtain your personal information copy, you can operate yourself by yourself:", "label": ["Edit/Control", "Important"], "rewrite": "You have the right to obtain your personal information copy."}
{"task": "rw_37.jsonl", "id": 49932, "text": "Log in to mobile banks into \"My-My Personal Information\" and get your name, gender, birth date, certificate type, certificate number, electronic bank customer serial number information and copy some information.", "label": ["Important", "Edit/Control"], "rewrite": "You can log into mobile banks into \"My-My Personal Information\", get your information and copy some information."}
{"task": "rw_37.jsonl", "id": 49933, "text": "Log in to online banks into \"Personal Settings-Customer Information Management\" to copy all personal information.", "label": ["Important", "Edit/Control"], "rewrite": "You can log in to online banks into \"Personal Settings-Customer Information Management\" to copy all personal information."}
{"task": "rw_37.jsonl", "id": 49934, "text": "(6) Automatic decision -making of constraint information system", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49935, "text": "In certain business functions, our bank may make decisions based on non -artificial automatic decision -making mechanisms such as information systems and algorithms.", "label": ["Important", "Edit/Control"], "rewrite": "Our bank may make decisions based on non -artificial automatic decision -making mechanisms."}
{"task": "rw_37.jsonl", "id": 49936, "text": "If these decisions significantly affect your legitimate rights and interests, you have the right to ask us to explain, and our bank will also provide appropriate relief methods.", "label": ["Important", "Edit/Control"], "rewrite": "If non -artificial automatic decisions affect your legitimate rights and interests, you have the right to ask us to explain that we will also provide relief."}
{"task": "rw_37.jsonl", "id": 49937, "text": "(7) Responsive your above request", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49938, "text": "To ensure safety, you may need to provide a written request or prove your identity in other ways.", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "To ensure safety, you may need to provide a written request or prove your identity in other ways."}
{"task": "rw_37.jsonl", "id": 49939, "text": "Our bank may ask you to verify your identity first, and then process your request.", "label": ["Edit/Control", "Data Security", "Important"], "rewrite": "Our bank may ask you to verify your identity first, and then process your request."}
{"task": "rw_37.jsonl", "id": 49940, "text": "If the above request involves manual treatment, our bank will handle and reply within 15 working days.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49941, "text": "Please understand that for some unprovoral repetitions, too much technical means, risk or very unrealistic requests to others' legitimate rights and interests, our bank may refuse.", "label": ["Important", "Data Security"], "rewrite": "We may refuse to repeat for unseen, need too much technical means, bring risks or very unrealistic requests to others' legitimate rights and interests."}
{"task": "rw_37.jsonl", "id": 49942, "text": "Although there are above, in accordance with the requirements of laws and regulations, if the following circumstances, our bank may not be able to respond to your request:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49943, "text": "1. Related to national security and national defense security;", "label": ["Edit/Control", "Important"], "rewrite": "If your request is directly related to national security and national defense security, you may not be responded."}
{"task": "rw_37.jsonl", "id": 49944, "text": "2. It is related to public safety, public health, and major public interests;", "label": ["Important", "Edit/Control"], "rewrite": "Your request is directly related to public safety, public health, and major public interests and may not be responded."}
{"task": "rw_37.jsonl", "id": 49945, "text": "3. Related to criminal investigation, prosecution, trial and judgment execution;", "label": ["Important", "Edit/Control"], "rewrite": "Your request is related to criminal investigation, prosecution, and trial, and may not be responded."}
{"task": "rw_37.jsonl", "id": 49946, "text": "4. There is sufficient evidence that you have subjective malice or abuse of rights;", "label": ["Edit/Control", "Important"], "rewrite": "We have sufficient evidence that if you have subjective malice or abuse of rights, you may not be able to respond to the request."}
{"task": "rw_37.jsonl", "id": 49947, "text": "5. Response your request will cause the legitimate rights and interests of you or other individuals and organizations to be seriously damaged;", "label": ["Important", "Edit/Control"], "rewrite": "We may not be able to respond to requests that exceed the storage range, exceed the reasonable limit, or the legitimate rights and interests of personal information subjects or other individuals and organizations will be seriously damaged."}
{"task": "rw_37.jsonl", "id": 49948, "text": "6. Involving our business secrets;", "label": ["Important", "Edit/Control"], "rewrite": "We may not be able to respond."}
{"task": "rw_37.jsonl", "id": 49949, "text": "7. To fulfill the regulations for anti -money laundering and sanctions.", "label": ["Edit/Control", "Important"], "rewrite": "In order to fulfill anti -money laundering and sanctions, we may not be able to respond to your request."}
{"task": "rw_37.jsonl", "id": 49950, "text": "6. How to deal with the information of minors for our trip", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49951, "text": "1. We expect parents or guardians to guide minors to use our services.", "label": ["Specific Audiences", "Important"], "rewrite": "It is hoped that parents or guardians will guide minors to use our services."}
{"task": "rw_37.jsonl", "id": 49952, "text": "Without the consent of the guardian, minors under 16 years of age shall not open mobile banking.", "label": ["Specific Audiences", "Important"], "rewrite": "Without the consent of the guardian, minors under 16 years of age shall not open mobile banking."}
{"task": "rw_37.jsonl", "id": 49953, "text": "We will only use this information when the laws and regulations and regulatory requirements are allowed or protect the minors.", "label": ["Specific Audiences", "Important"], "rewrite": "We will only use this information when the laws and regulations and regulatory requirements are allowed or protect the minors."}
{"task": "rw_37.jsonl", "id": 49954, "text": "We will protect the confidentiality and security of the information of minors in accordance with the provisions of relevant national laws and regulations.", "label": ["Specific Audiences", "Important"], "rewrite": "We will protect the confidentiality and security of the information of minors in accordance with the provisions of relevant national laws and regulations."}
{"task": "rw_37.jsonl", "id": 49955, "text": "2. If you are a minor, please read this policy for your supervisor. You use your mobile banking to use our service or provide us information on the premise of obtaining your parents or guardians.For minors under the age, please note that your personal information is sensitive.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a minor, your use of mobile banking means that you have used our services or providing us information to us under the consent of your parents or guardians."}
{"task": "rw_37.jsonl", "id": 49956, "text": "For the situation of collecting your information with the consent of the guardian, we will only use or disclose this information if they are allowed to be allowed, the guardian's clear consent or protecting your rights and interests.", "label": ["Specific Audiences", "Important"], "rewrite": "We will only use or disclose the information of minors when they are permitted to, the guardian clearly agree with or protect your rights."}
{"task": "rw_37.jsonl", "id": 49957, "text": "If your guardian does not agree that you use our services or provide information to us in accordance with this policy, please immediately terminate our services and inform us in time so that we can take corresponding measures.", "label": ["Specific Audiences", "Important"], "rewrite": "If your guardian does not agree with your service or information, please terminate and notify us immediately."}
{"task": "rw_37.jsonl", "id": 49958, "text": "3. If you are the guardian of the minor, when you have questions about the information processing of the minors you monitor, please contact us through the contact information in this article.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49959, "text": "7. Application and update of this policy", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49960, "text": "1. Our bank reserves the right to update or modify this policy from time to time.", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49961, "text": "This policy is suitable for all personal mobile banking users of Bank of China.", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49962, "text": "Without your consent, our bank will not reduce your rights you should enjoy in accordance with this policy.", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49963, "text": "We will notify you through reasonable methods such as pushing notifications, pop -ups, and official website announcements, so that you can understand any changes made in this policy (including business functions, changes in use, and personal information protection.Change and other situations).", "label": ["Policy Change", "Important"], "rewrite": "We will notify your changes in this policy through reasonable methods such as pushing notifications, pop -ups, and official website announcements."}
{"task": "rw_37.jsonl", "id": 49964, "text": "2. For major changes, depending on the specific circumstances, our bank may also provide more significant notifications to explain the specific changes in this policy.", "label": ["Policy Change", "Important"], "rewrite": "For major changes, we may also provide a more significant notice depending on the specific situation."}
{"task": "rw_37.jsonl", "id": 49965, "text": "Major changes include but not limited to:", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49966, "text": "(1) The service model and business form of our bank have changed significantly.", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49967, "text": "Such as the purpose of handling personal information, the type of personal information, the use of personal information, etc.;", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49968, "text": "(2) The main object of personal information sharing, transfer or public disclosure changes;", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49969, "text": "(3) The right to participate in personal information processing and its exercise methods have changed significantly;", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49970, "text": "(4) The way we are responsible for handling personal information security and the changes in the complaint channels;", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49971, "text": "(5) Evaluation report on personal information security impact indicates that there is a high risk.", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49972, "text": "3. If you do not agree with the modified privacy policy, you have the right and immediately stop using our products and services.", "label": ["Policy Change", "Important"], "rewrite": "If you do not agree with the modified privacy policy, you have the right and immediately stop using our products and services."}
{"task": "rw_37.jsonl", "id": 49973, "text": "If you checked the privacy policy after the amendment and continue to use our products and services, it is deemed that you accept the amendment of our bank's related provisions.", "label": ["Policy Change", "Important"], "rewrite": "If you checked the privacy policy after the amendment and continue to use our products and services, it is deemed that you accept the amendments made by the relevant terms of this policy."}
{"task": "rw_37.jsonl", "id": 49974, "text": "8. How to contact me", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49975, "text": "If you have any questions, opinions or suggestions on this privacy policy, you can consult or reflect the 95566 customer service hotline, or go to the business outlets of our bank.", "label": ["Important", "Contact Information"], "rewrite": "Customer service hotline: 95566"}
{"task": "rw_37.jsonl", "id": 49976, "text": "After accepting your problem, we will deal with it in time and properly.", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49977, "text": "We will reply within 15 working days.", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49978, "text": "If you think that our personal information processing behavior harms your legitimate rights and interests, you can protect your legitimate rights and interests through complaints, application for arbitration, litigation and other methods.", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49979, "text": "The full name of our bank: Bank of China Co., Ltd., registered address: No. 1, Fuxingmen, Xicheng District, Beijing, China, Zip Code: 100818.", "label": ["Important", "Contact Information"], "rewrite": "The full name of our bank: Bank of China Co., Ltd., registered address: No. 1, Fuxingmen, Xicheng District, Beijing, China, Zip Code: 100818."}
{"task": "rw_37.jsonl", "id": 49980, "text": "Please read this privacy policy carefully before clicking \"Agree\" to ensure that the meaning and corresponding legal consequences of its content, especially the rough content of the font, and the corresponding legal consequences are fully understood.", "label": [], "rewrite": []}
{"task": "rw_37.jsonl", "id": 49981, "text": "If you click \"Agree\" is deemed that you accept this privacy policy, our bank will legally use and protect your personal information in accordance with relevant laws and regulations and this policy.", "label": ["Policy Change", "Important"], "rewrite": "If you click \"Agree\", you are deemed to accept the privacy policy."}
{"task": "rw_37.jsonl", "id": 49982, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
