{"task": "rw_31.jsonl", "id": 47862, "text": "Meituan takeaway privacy policy", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47863, "text": "Update date: October 28, 2021", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47864, "text": "Effective date: November 4, 2021", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47865, "text": "Meituan takeaway (following or \"we\") pays great attention to protecting the personal information and privacy of users (\"you\"). We know the importance of personal information to you and will follow the requirements of laws and regulations and the industry's mature security standards.Take corresponding security measures to protect your personal information.", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47866, "text": "We hope to clearly introduce you how to deal with your personal information and protect you when using our products/services through this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47867, "text": "This policy will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47868, "text": "1. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47869, "text": "2. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47870, "text": "3. How can we share, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47871, "text": "4. How do we save and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47872, "text": "5. How do you manage your personal information", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47873, "text": "6. Protection of personal information of minors", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47874, "text": "7. Notification and revision", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47875, "text": "8. How to contact us", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47876, "text": "9. Appendix", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47877, "text": "[Special Tips] Please read and fully understand this \"Privacy Policy\" (the key content has bolded the fonts, please pay special attention to the use of the products/services we provided by us.", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47878, "text": "Once you use or continue to use our products/services, it means that you agree that we will process your relevant information in accordance with this privacy policy.", "label": ["Policy Change", "Important", "Risk"], "rewrite": "Once you use or continue to use our products/services, it means that you agree that we will process your relevant information in accordance with this privacy policy."}
{"task": "rw_31.jsonl", "id": 47879, "text": "If you have any questions about this privacy policy, you can contact us through the way how to contact us in this privacy policy).", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47880, "text": "The product/service of \"Meituan Takeaway\" is Beijing San Kuang Online Technology Co., Ltd. and its related parties provided to you through the following routes: including but not limited to the Meituan takeaway website (https: // wait.Meituan.com or Meituan takeaway according to the URL of business needs), Meituan takeaway APP and other clients, as well as related WeChat open platform accounts or applets.", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47881, "text": "The Meituan takeaway and its related parties referred to this policy referUnclated companies are named or collectively known as.", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47882, "text": "Please note that this policy is not applicable to other third -party products/services connected by your products/services (\"Other third parties\", including your trading counterparty, any third -party website, and third -party service providerWait), please refer to the privacy policy or similar statement of the third party.", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47883, "text": "1. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47884, "text": "When you use our products/services, you need/you can choose to authorize us to collect and use personal information.", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47885, "text": "1. In order to provide you with the basic functions of our product/service- \"Catering purchase and delivery\", you need to authorize us to collect and use the necessary personal information. The necessary personal information includes \"mobile phone number, the consignee's name, address, connectionPay information such as telephone, payment time, payment amount, payment channels.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "You need to authorize us to collect and use the necessary personal information. The necessary personal information includes payment information such as \"mobile phone number, consignee name, address, contact phone number, payment time, payment amount, payment channels, etc."}
{"task": "rw_31.jsonl", "id": 47886, "text": "If you refuse to provide the above necessary information, you will not be able to use our product/service normally;", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide the above necessary information, you will not be able to use our products/services normally."}
{"task": "rw_31.jsonl", "id": 47887, "text": "2. In order to provide you with the expansion function or additional function of our product/service, you can choose to authorize us to collect and use your other personal information. If you refuse to provide the aforementioned information, you will not be able to use related additional functions normally or cannot achieve usThe functional effects intended to be achieved will not affect your basic function of using our product/service normally.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "You can choose to authorize us to collect and use your other personal information. If you refuse to provide the aforementioned information, you will not be able to use related additional functions normally or to achieve the functional effects we intend to achieve, but it will not affect your normal use of our product/Basic functions of service."}
{"task": "rw_31.jsonl", "id": 47888, "text": "(1) You need to authorize us to collect and use personal information.", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47889, "text": "We will follow the principles of legitimate, legal, and necessary, and use your personal information for the following purposes described in this policy.", "label": ["Usage"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47890, "text": "1. Help you become our user", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47891, "text": "We provide you with a service through Meituan account. When you register as our user, you need to provide at least mobile phone numbers to create Meituan account (Meituan takeaway use Meituan account system.Meituan takeaway), and improve the relevant network identification information (such as avatars, nicknames, login passwords, etc.), after you authorize the Meituan account to log in to Meituan takeaway, we will obtain relevant account information based on your authorization (such as user logo logo, Nickname, avatar, login status information, etc.);", "label": ["Important", "First Party Collection Information"], "rewrite": "When you register as our user, you need to provide at least mobile phone numbers to create Meituan account and improve the relevant network identity information."}
{"task": "rw_31.jsonl", "id": 47892, "text": "If you only need to use the browse function, you don't need to register as our users and provide the above information.", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47893, "text": "If you choose to log in with a third -party account, we will obtain the account information you shared (such as avatars, nicknames, regions, gender and other information, etc.) from third parties to your Meituan account for quick login. We willAccording to the agreement with the third party, use your personal information on the premise of complied with relevant regulations.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will obtain your shared account information (such as avatar, nickname, region, gender and other information, etc.) from a third party to bind to your Meituan account for quick login."}
{"task": "rw_31.jsonl", "id": 47894, "text": "2. Provide you with geographic location -based information display", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47895, "text": "In order to provide you with the display and search service of the surrounding goods/services, and improve our service performance, efficiency and functions, after you authorize, we will collect the relevant information you generate in the process of using our service, including:", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47896, "text": "(1) Location information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47897, "text": "When you authorize the positioning permissions of the mobile device and use the service -based services based on the system authorization, we will collect and use your location information to recommend the surrounding life services (for example, you don’t need to manually enter the geographical location where you are located, you canGet relevant services, estimate the actual distance between the merchant and you to make you consumer decision, and recommend the nearby takeaway category and preferential information for you.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "We will collect and use your location information to recommend your surrounding life services."}
{"task": "rw_31.jsonl", "id": 47898, "text": "We also need to show you all kinds of exclusive activities and merchant stores where you can participate in your own position and merchant stores that can participate in.Relying on location information, if you do not provide location information, you cannot show you the current effective activities, available merchant stores and other services).", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47899, "text": "We will use relevant technology to obtain your location information (accuracy will be different). These technologies include, IP, address, GPS, and WLAN (such as Wi-Fi) access points, Bluetooth and base stations that can provide relevant information, Bluetooth and base stations, etc.Sensor information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will use relevant technology to obtain your location information (the accuracy will be different)."}
{"task": "rw_31.jsonl", "id": 47900, "text": "You can turn off the positioning service in the mobile device system to stop our collection of information on your location, but it may not be able to use the services we provide for you based on geographical location, or to achieve the expected effect of related services.", "label": ["Important", "Edit/Control"], "rewrite": "You can turn off the positioning service in the mobile device system to stop our collection of information on your location."}
{"task": "rw_31.jsonl", "id": 47901, "text": "You do not provide location information and will not affect your use of basic product functions.", "label": ["Important", "First Party Collection Information"], "rewrite": "You do not provide location information and will not affect your use of basic product functions."}
{"task": "rw_31.jsonl", "id": 47902, "text": "(2) Log information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47903, "text": "When you use the products/services we provide, we will collect information from browsing, searching, clicking, collecting, collecting, trading, after -sales, attention, sharing, release and other information as related online logs, including you, including youThe IP address, the type of browser, the language used, the version of the operating system, the date and time of access, the telecommunications operator, and the network request.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect information about your browsing, searching, clicking, collection, collection, adding shopping carts, trading, after -sales, follow -up, sharing, release and other information and save them as related network logs."}
{"task": "rw_31.jsonl", "id": 47904, "text": "(3) Sensor information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47905, "text": "When you use our product/service process, we may collect your sensor information to identify your actions when you choose to participate in the event. The types of sensor in different scenarios may be inconsistent.Will be used.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may collect your sensor information to identify your actions when you choose to participate in the event."}
{"task": "rw_31.jsonl", "id": 47906, "text": "For example, when you are involved in interactive activities, you can achieve active effects or show you the next interactive scenario by accelerating the acceleration and magnetic meter sensors;", "label": ["Usage"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47907, "text": "When you use your own service, you can implement the navigation function through the orientation sensor.", "label": ["Important", "Usage"], "rewrite": "When you use your own service, you can implement the navigation function through the orientation sensor."}
{"task": "rw_31.jsonl", "id": 47908, "text": "3. Provide you with order and order management function", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47909, "text": "When you place orders for food, dessert beverages, supermarket convenience, vegetables and fruits, medicine delivery, and other services in Meituan takeaway, you need to provide contact information (name, gender, phone number, etc.), address information (name, gender, phone number, etc.), address information (name, gender, phone number, etc.), address information (name, gender, phone number, etc.)Receiving address), service preferences (such as the number of dining people), etc.", "label": ["Important", "First Party Collection Information"], "rewrite": "You need to provide contact information (name, gender, phone number, etc.), address information (receiving address), service preferences (such as dining people), etc. according to the selected service type."}
{"task": "rw_31.jsonl", "id": 47910, "text": "When you place an order to send drugs in Meituan takeaway, in accordance with the requirements of relevant laws and regulations, if you accept online re -consultation, you also need to provide patients with real -name diagnosis and treatment information, medical record information, physical symptoms, and personal photos (required for the re -diagnosis).", "label": ["Important", "First Party Collection Information"], "rewrite": "When placing an order to send drugs for the Meituan takeaway, according to the requirements of relevant laws and regulations, if you accept the online retail consultation, you also need to provide patients with real -name diagnosis and treatment information, medical record information, physical symptoms, and personal photos (required by the re -diagnosis)."}
{"task": "rw_31.jsonl", "id": 47911, "text": "In order to provide you with exclusive rights services to specific scenarios, in specific scenarios (such as college students' exclusive rights), you need to provide student certification information, but we will obtain your authorization separately.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In specific scenarios (such as the exclusive rights and interests of college students), you need to provide student certification information, but we will obtain your authorization separately."}
{"task": "rw_31.jsonl", "id": 47912, "text": "To show you the order information of your account and facilitate the management of your order information, we will collect the order information you generate during the use of our service.", "label": ["Important", "First Party Collection Information"], "rewrite": "To show you the order information of your account and facilitate the management of your order information, we will collect the order information you generate during the use of our service."}
{"task": "rw_31.jsonl", "id": 47913, "text": "In the order you generated on the Meituan takeaway, you will include your identity information, contact information, address information, payment information, etc. These are all sensitive information. Please be careful to display or provide them outside.When displaying the order information, try to identify the processing on the basis of ensuring the availability of information.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47914, "text": "4. Provide you with collection, attention, sharing, and recommendation functions", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47915, "text": "In order to facilitate your management of your own preferences, find users or communities with common hobbies, get a easier access experience, and share with friends and third parties.You can also share information with third parties through functional components. We will collect the log information you generated in the use of the above functions to display, realize online management, initiate sharing, and recommend to you with common hobbies on your personal homepage.User and other.", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47916, "text": "5. Provide you with the function of distribution, post -post, and leg running", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47917, "text": "When you use the corresponding functions on Meituan takeaway involved in distribution/replacement (such as invoice mail)/running legs (such as help buying help) service, you need to provide the name of the collection/consigneeIt is called you, such as Ms. Liu), mobile phone numbers, and receiving addresses, so that your order can be delivered and completed safely and accurately.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "You need to provide the name of the collection/consignee (for the delivery personnel to call you, such as Ms. Liu), mobile phone number, and receiving address, so that your order can be delivered and completed safely and accurately."}
{"task": "rw_31.jsonl", "id": 47918, "text": "You can also choose to add labels (such as home, company, etc.) for common addresses, so that they can be found in the future.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47919, "text": "6. Provide you with information release functions such as writing evaluation", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47920, "text": "When you actively evaluate the merchant's products/services or publish other content on the Meituan takeaway, we will collect the information you posted and show your nickname, avatar and publishing content.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "When you actively evaluate the merchant's products/services or publish other content on the Meituan takeaway, we will collect the information you posted and show your nickname, avatar and publishing content."}
{"task": "rw_31.jsonl", "id": 47921, "text": "If you choose to publish the evaluation information in anonymous way, we will not show your nickname and avatar.", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47922, "text": "7. Help you complete the payment", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47923, "text": "When you pay for order on Meituan Takeaway, you can choose Meituan Takeaway and its related parties (such as Meituan Pay) or Meituan takeaway third -party cooperation agencies (such as WeChat payment, QQ wallet, Apple Pay, Alipay and other cooperationFang) The service provided for payment.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47924, "text": "We need to collect your Meituan takeaway order information, reconciliation information, and the necessary information of other legal requirements and share it with these cooperation agencies to confirm your payment instructions and help you complete the payment.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "We need to collect your Meituan takeaway order information, reconciliation information and other necessary information and share it with these cooperation agencies."}
{"task": "rw_31.jsonl", "id": 47925, "text": "8. Provide you/display payment, loan, financial management, insurance and other financial products/services", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47926, "text": "When you use the financial products/services provided by our affiliates or partners on the Meituan takeaway, we may also collect your ID information (including shadow printers), bank card information, etc., specific information collection and collectionFor use rules, please refer to the specific service agreement/document/rules signed with you and the \"Meituan Financial Privacy Policy\".", "label": ["Important", "First Party Collection Information"], "rewrite": "We may also collect your identity documents (including shadow stamps), bank card information, etc."}
{"task": "rw_31.jsonl", "id": 47927, "text": "9. Provide you with customer service and after -sales service", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47928, "text": "When you get in touch with our customer service, our system may record the communication records between you and the customer service, and use your account information to verify the identity;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Our system may record the communication records between you and customer service, as well as using your account information to verify your identity."}
{"task": "rw_31.jsonl", "id": 47929, "text": "When you need us to provide a customer service related to your order, we may check your relevant order information in order to give you appropriate help and processing;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you need us to provide a customer service related to your order, we may check your relevant order information."}
{"task": "rw_31.jsonl", "id": 47930, "text": "When you need customer service to help you modify the relevant information (such as delivery address, contact information, etc.), you may also need to provide other information outside the above information to complete the modification.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you need customer service to help you modify the relevant information (such as delivery address, contact information, etc.), you may also need to provide other information outside the above information to complete the modification."}
{"task": "rw_31.jsonl", "id": 47931, "text": "In order to ensure the service experience and processing service disputes, when you call or answer the number of the number protection (privacy) during the performance of the order, the call information of you and the rider may be recorded.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you call or answer the number of the number protection (privacy) during the performance of the order, the call information of you and the merchant and riding room may be recorded."}
{"task": "rw_31.jsonl", "id": 47932, "text": "The collection and use rules of the above information are as follows, or see the prompt content in the order page.", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47933, "text": "(1) After authorization, when you have a service dispute with the merchant and the rider, the platform can retrieve and use recording information as the basis for the reference of the dispute.", "label": ["Important", "Usage"], "rewrite": "When you have service disputes with merchants and riders, the platform can retrieve and use recording information as a reference for resolving disputes."}
{"task": "rw_31.jsonl", "id": 47934, "text": "(2) The platform will effectively ensure the privacy and security of the two parties. The recording will be uploaded to the Meituan server to save, and all parties cannot download, retrieve or play recording by themselves;", "label": ["Data Retention", "Important"], "rewrite": "The platform will effectively ensure the privacy of the two parties. The recording will be uploaded to the Meituan server to save, and all parties cannot download, retrieve or play recording by themselves."}
{"task": "rw_31.jsonl", "id": 47935, "text": "Except for the following circumstances, the platform will not provide the recording to anyone (including the master of the call, the name of the call): a.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47936, "text": "b. The recording of the legal documents issued by the judicial organs was retrieved according to law.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47937, "text": "(3) After 7 days of preservation, the recording will automatically delete permanently. In case of bad reviews, complaints, disputes that have not been completed, the platform will appropriately extend the periodic of the recording preservation.", "label": ["Data Retention", "Important"], "rewrite": "After 7 days of preservation, the recording will automatically delete permanently. If there are poor reviews, complaints, disputes that have not yet been handled, the platform will appropriately extend the period of recording preservation."}
{"task": "rw_31.jsonl", "id": 47938, "text": "(4) Limited by the stability of the network status, in extreme cases, there may be unable to recording or some recording failure.", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47939, "text": "It may also be encountered in the case of number protection. Your real mobile phone number will be displayed to merchants and riders to ensure that merchants and riders can deliver you for you.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47940, "text": "10. Provide you with security guarantee", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47941, "text": "In order to ensure your account security, transaction security, and system operation security, to meet the requirements of laws and regulations and our agreement rules, in the process of accessing and using our products/service, you authorize us to obtain your equipment information, including your equipment information, includingThe device model, hardware serial number, device MAC address, unique device recognition code (such as IMEI/Android/Openudid/OAID/OAID, SIM card IMSI, ICCID information and other device identifiers), mobile application list, telecommunications operationsCharacter soft hardware feature information, sensor information.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "We have authorized us to get your device information."}
{"task": "rw_31.jsonl", "id": 47942, "text": "Without your authorization, we will not obtain the above information in advance.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "Without your authorization, we will not obtain the above information in advance."}
{"task": "rw_31.jsonl", "id": 47943, "text": "In order to improve the security of the services you provide, and to prevent fraud and Trojan virus more accurately, we may use or integrate your personal information, as well as our related parties and partners to obtain information you authorize or shared according to law.Based on your habits and common software information, you can comprehensively judge your account number and transaction risk, including verifying your identity, preventing, discovering, and investigating possible security risks such as fraud, network virus, and cyber attacks that violate us or related party agreements,Policies or rules to protect the legitimate rights and interests of you, other users, or we or related parties, and record some links (\"url\") that we think are risky.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may use or integrate your personal information and our related parties and partners to obtain information you authorized or shared according to law, and comprehensively judge your account and transaction risk based on your habits and common software information."}
{"task": "rw_31.jsonl", "id": 47944, "text": "11. We may collect personal information indirectly", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47945, "text": "In order to complete the identity verification, ensure account security, confirm the status of transaction and provide you with after -sales and dispute resolution, we may obtain your personal information from a third party after you authorize (such as the transaction objects and transactions you choose directly involved directly involved directly involvedMal malicious behaviors such as ordering).", "label": ["Important", "First Party Collection Information"], "rewrite": "After you authorize, we may obtain your personal information from a third party."}
{"task": "rw_31.jsonl", "id": 47946, "text": "In accordance with the requirements of the laws and regulations and the agreement with the third party, after you have authorized, you will get your relevant information to the related parties and partners of Meituan takeaway, and use your information to confirm the legitimacy of the source of the information.Essence", "label": ["Important", "First Party Collection Information"], "rewrite": "After you have authorized, you can get your relevant information to the related parties and partners of Meituan Takeaway, and use your information to confirm the legitimacy of the source of the information."}
{"task": "rw_31.jsonl", "id": 47947, "text": "(2) You can choose to authorize us to collect and use personal information.", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47948, "text": "In order to provide you with personalized services, you can choose to use the expansion function we provide. We will collect and use the following information in accordance with the laws and regulations and use the following information according to your specific authorization.", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47949, "text": "This kind of information will be collected in the specific functions and business scenarios you choose. If you do not provide this information, it will not affect your basic function of using Meituan takeaway.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47950, "text": "1. Expansion function based on camera authorization", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47951, "text": "You can choose to turn on the system's camera permissions and authorize Meituan takeaway to access your camera by using the functions of taking pictures, recording video, in order to publish content by taking photos or recording videos. If you need to record and publish sound videos,You also need to turn on microphone permission.", "label": ["Permission Acquisition", "Edit/Control", "Important"], "rewrite": "You can choose to turn on the system's camera permissions and authorize Meituan takeaway to access your camera by using the functions such as taking pictures, recording videos.If you need to record and publish sound videos, you need to turn on the microphone right."}
{"task": "rw_31.jsonl", "id": 47952, "text": "We will collect the above information you uploaded. You can close it in the system permissions. Once you close it, you may not be able to achieve the code scanning function, or you cannot review or interact with the pictures, videos, etc., but it will not affectYou enjoy the basic functions of Meituan takeaway services.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect the above information you uploaded. You can turn it off in the system permissions. Once you close it, you may not be able to achieve the code scanning function."}
{"task": "rw_31.jsonl", "id": 47953, "text": "2. Expansion function based on album authorization", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47954, "text": "You can choose to open the system's album authority and authorize us to access your album by actively uploading pictures, videos, etc., so that you can publish content by uploading photos or uploading videos.", "label": ["Permission Acquisition", "Important", "Edit/Control"], "rewrite": "You can choose to turn on the system of the system and authorize us to access our album through actively uploading pictures, videos and other methods."}
{"task": "rw_31.jsonl", "id": 47955, "text": "We will collect the above information you choose to upload. You can close it in the system permissions. Once you close it, you may not be able to replace the avatars, publish a picture review, etc., but it will not affect youEnjoy the basic functions of Meituan takeaway services.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect the above information you choose to upload, you can close in the system permissions."}
{"task": "rw_31.jsonl", "id": 47956, "text": "3. Development function based on microphone authorization", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47957, "text": "You can choose to turn on the system of microphone and use voice technology to achieve voice interaction functions such as voice search and smart order.", "label": ["Permission Acquisition", "Important", "Edit/Control"], "rewrite": "You can choose to turn on the system of microphone."}
{"task": "rw_31.jsonl", "id": 47958, "text": "We will collect the voice information you entered in the process of using intelligent voice technology for machine recognition, online interaction and meet your needs for searching or ordering (for example, you are using the \"smart order\" function or \"holding talk\" functionAt this time, we will search, display and place orders according to your needs).", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We will collect the voice information you entered in the process of using intelligent voice technology for machine recognition, online interaction and meet your needs for searching or placing orders."}
{"task": "rw_31.jsonl", "id": 47959, "text": "You can close this function in the system permissions. Once you close it, you may not be able to achieve the online voice interaction function, but it will not affect your basic functions of enjoying Meituan takeaway services.", "label": ["Important", "Edit/Control"], "rewrite": "You can close this function in the system permissions. Once you close it, you may not be able to achieve the online voice interaction function, but it will not affect your basic functions of enjoying Meituan takeaway services."}
{"task": "rw_31.jsonl", "id": 47960, "text": "4. Development function based on friends recommended", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47961, "text": "We may also recommend your friends or recommend you to your friends or to recommend you to other users based on the friend relationship, interaction relationship, equipment information, and log information you have authorized to help you expand your social circle.", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47962, "text": "You can turn off or lift the relationship between friends in privacy settings, or you can manage the scope of the viewing of others (such as people who follow, fans, nicknames displayed when sharing).", "label": ["Important", "Edit/Control"], "rewrite": "You can turn off or lift the relationship between friends in privacy settings, or you can manage the scope of the viewing of others independently."}
{"task": "rw_31.jsonl", "id": 47963, "text": "Once you close it, you may not be able to share and communicate with your friends in Meituan, but it will not affect your basic function of enjoying Meituan takeaway services.", "label": ["Edit/Control", "Important"], "rewrite": "Once you close it, you may not be able to share and communicate with your friends in Meituan, but it will not affect your basic function of enjoying Meituan takeaway services."}
{"task": "rw_31.jsonl", "id": 47964, "text": "5. Expansion function based on shear -based license", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47965, "text": "In the case of sharing or receiving the shared information, participation in activities, online consultation, etc., we need to visit your scissor permissions locally, including information such as nicknames, single numbers, sharing codes, links and other information to achieve jumpingSports, sharing, activity linkage and other functions or services.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "We need to visit your scissors locally."}
{"task": "rw_31.jsonl", "id": 47966, "text": "We will upload our server only when the contents of the shear board belong to Meituan's jumping, sharing, and activity linkage in the local area.", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47967, "text": "In addition, we will not upload other information about your cut plate to our server.", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47968, "text": "The system of some mobile phone devices prompts the application (APP) to read the shear plate, but the system prompts that it cannot be distinguished or uploaded by local processing or uploading, and due to the differences in statistical methods, the possibility of misunderstanding is not ruled out.", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47969, "text": "Therefore, if you find similar prompts and have questions, please contact us so that we can locate the problem.", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47970, "text": "(3) Others", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47971, "text": "You can place various products/services for others through Meituan takeaway, and provide information about the actual service receiver. Earlier, please make sure that you have obtained the authorization of the relevant person.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can place various products/services for others through Meituan takeaway, and provide information about the actual service receiver. Earlier, please make sure that you have obtained the authorization of the relevant person."}
{"task": "rw_31.jsonl", "id": 47972, "text": "If we use other purposes that the information is not stated in this policy, or the information collected based on specific purposes for other purposes, it will solicit your authorization consent alone.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "If we use other purposes that the information is not stated in this policy, or the information collected based on specific purposes for other purposes, it will solicit your authorization consent alone."}
{"task": "rw_31.jsonl", "id": 47973, "text": "(4) Exception of consent", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47974, "text": "Please know that in the following situations, we do not need to obtain your authorization consent if we collect or use personal information:", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In the following circumstances, we do not need to obtain your authorization consent if we collect or use personal information:"}
{"task": "rw_31.jsonl", "id": 47975, "text": "1. In order to establish and fulfill the contract as a party as a party, or to implement human resources management in accordance with the labor rules and regulations and collective contracts signed in accordance with the law in accordance with the law;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collecting and fulfilling the personal information necessary for the contract as a party as a party, no need to solicit consent."}
{"task": "rw_31.jsonl", "id": 47976, "text": "2. In order to fulfill the statutory responsibility or the requirements of the legal volunteer;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "It is not necessary to solicit consent as a personal information that is collected as a legal duty or a personal information necessary for the legal duty."}
{"task": "rw_31.jsonl", "id": 47977, "text": "3. In order to cope with emergencies, or in urgent situations, it is necessary to protect the health and property safety of natural people in emergency;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "It is collected as a personal information to deal with emergencies, and no consent is required."}
{"task": "rw_31.jsonl", "id": 47978, "text": "4. Implement news reports and public opinion supervision for public interests, and handle personal information within a reasonable range;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to implement news reports and public opinion supervision, deal with personal information within a reasonable scope without soliciting consent."}
{"task": "rw_31.jsonl", "id": 47979, "text": "5. Treatment of personal information that individuals are disclosed or other legally disclosed in accordance with the provisions of this Law;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In accordance with the provisions of this Law, deal with legal information that have been legally disclosed within a reasonable scope without asking for consent."}
{"task": "rw_31.jsonl", "id": 47980, "text": "6. Other circumstances stipulated in laws and regulations.", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47981, "text": "Please note that it is not personal information that cannot be recognized or unable to identify your identity or directly establish contact with you alone.", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47982, "text": "If we will be unable to connect with any specific individuals to combine with other information to identify the personal identity of natural people, or use it with personal information, such information will be regarded as personal information during the combination of use.", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47983, "text": "(5) Use rules of personal information", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47984, "text": "In order to meet your personalized needs and maintain and improve our product/service quality, we will use the following information in accordance with the laws and regulations and according to your specific authorization:", "label": ["Usage"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47985, "text": "1. We may collect your order information, browsing and searching information, behavioral preferences (such as information such as the dietary habits you provide to us), location information, etc., andThe information is combined with information from other services to conduct comprehensive statistics and analyzes to form user portraits to recommend or show you product/service information you may be interested in, or show you a personalized third -party promotion to you through the systeminformation.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may collect your order information, browsing and searching information, behavioral preferences (such as information such as the dietary habits you provide to us), location information, etc., andThe information from other services is combined to carry out comprehensive statistics and analyze to form a user portrait"}
{"task": "rw_31.jsonl", "id": 47986, "text": "Including push message notifications to you on the APP page, provide you with intelligent recommendations. Through SMS, APP, email, etc. to send you push messages, promote information or display commercial advertisements, provide you with a telephone return, provide you with information consulting or other services or information consultationInvite you to participate in customers related to services, products or functions.", "label": ["Usage"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47987, "text": "For example, the information collected when you use our service to show you personalized content or advertisements to you in another service.", "label": ["Usage"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47988, "text": "2. We may collect the information you provided to us when participating in the product/service survey, as well as the relevant information provided by your related parties and our partners, so that you can track the order situation and initiate user complaints to launch user complaintsAnd we optimize the quality and process of customer service.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may collect the information you provide to us when participating in the product/service survey."}
{"task": "rw_31.jsonl", "id": 47989, "text": "3. We may use the personal information collected in the business to statistical analysis and improvement operations, and use information that has been identified and cannot recognize your identity and cannot be restored to establish a database and commercialize.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may use the personal information collected in the business to statistical analysis and improvement operations, and use information that has been identified and cannot recognize your identity and cannot be restored to establish a database and commercialize it."}
{"task": "rw_31.jsonl", "id": 47990, "text": "For example, statistical analysis is performed through your location, preferences, etc., so as to improve our product, service or marketing plan;", "label": ["Usage"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47991, "text": "Another example is the technical transformation, network maintenance, failure elimination, internal policy and process formulation, and generating internal reports carried out for improvement of our system.", "label": ["Usage"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47992, "text": "(6) Equipment rights adjustment", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47993, "text": "In order to ensure the normal implementation of the relevant business functions, we need to call the corresponding permissions according to the specific use scenarios, and inquire with you before calling. Please refer to the table below for specific authority calling instructions:", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47994, "text": "Meituan takeaway-authority list", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47995, "text": "You can select the closing part or all permissions in the setting of the device, which may cause the corresponding business functions to be unable to achieve or achieve the expected effect.", "label": ["Edit/Control", "Important"], "rewrite": "You can select the closing part or all permissions in the setting of the device, which may cause the corresponding business functions to be unable to achieve or achieve the expected effect."}
{"task": "rw_31.jsonl", "id": 47996, "text": "2. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47997, "text": "(1) Use of cookies", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 47998, "text": "In order to ensure the normal and efficient operation of the website, get a easier access experience for you, and recommend the content you may be interested in, we will store the small data file of the cookie on your device terminal/system.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will store small data files named Cookie on your device terminal/system."}
{"task": "rw_31.jsonl", "id": 47999, "text": "Cookie will help you call your information when visiting our website in follow -up, simplify your process of filling in your personal information (such as one -click login, etc.);", "label": ["Usage"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48000, "text": "Provide you with a preference for safe shopping;", "label": ["Usage"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48001, "text": "Help you optimize the selection and interaction of advertising;", "label": ["Usage"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48002, "text": "Protect your data security and so on.", "label": ["Usage"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48003, "text": "We will not use Cookie for any purpose except the purpose of this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48004, "text": "You can manage or delete according to your preferences, cookies.", "label": ["Important", "Edit/Control"], "rewrite": "You can manage or delete Cookie according to your preferences."}
{"task": "rw_31.jsonl", "id": 48005, "text": "You can clear all, cookie kept on your computer or mobile device, and you have the right to accept or refuse cookies.", "label": ["Important", "Edit/Control"], "rewrite": "You can remove all the cookies saved on your computer or mobile device, and you have the right to accept or refuse cookies."}
{"task": "rw_31.jsonl", "id": 48006, "text": "Most browsers will automatically accept cookies, but you can usually modify the browser settings according to your needs to reject cookies;", "label": ["Important", "Edit/Control"], "rewrite": "Most browsers will automatically accept cookies, but you can usually modify the browser settings according to your needs to reject cookies."}
{"task": "rw_31.jsonl", "id": 48007, "text": "In addition, you can also remove all Cookie stored in the software.", "label": ["Edit/Control", "Important"], "rewrite": "You can also remove all the cookies stored in the software."}
{"task": "rw_31.jsonl", "id": 48008, "text": "But you may not fully experience some convenience and security service functions.", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48009, "text": "(2) The use of network beacon and similar technologies", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48010, "text": "In addition to Cookie, we often include other similar technologies such as electronic images (called \"single pixels\" GIF file or \"network Beacon\") on the webpage. They can help the website calculate the users of the webpage or access certain cookies.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48011, "text": "We use the network beacon method::", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48012, "text": "1. We use the network beacon on our website, calculate the number of user access, and access the Cookie identification registered users by accessing Cookie.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48013, "text": "2. We can provide personalized services on our website through the cookie information we get.", "label": ["Usage"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48014, "text": "3. How can we share, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48015, "text": "(1) Sharing", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48016, "text": "When we provide you with products/services, we will take strict security measures. In the products/services we have completed, we will not share your personal information with any company, organization and individual other than Meituan takeaway.", "label": ["Third Party Sharing/ Disclosure", "Data Security"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48017, "text": "But please know that most of the products/services we provide cannot be completed alone, so we may share or entrust them to handle some of your personal information with our related companies and other partners to ensure and optimize usThe product/service provided for you, this situation includes:", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48018, "text": "1. Provide platform services.", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48019, "text": "We may provide you with products/services as an e -commerce platform. If you use the products/services provided by merchants or other partners on our platform, we may share your necessary personal information with the corresponding product/service provider, So that you can use the corresponding browsing, ordering, trading, payment and other functions normally.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We may share your necessary personal information with the corresponding product/service provider so that you can use the corresponding browsing, ordering, transaction, payment and other functions normally."}
{"task": "rw_31.jsonl", "id": 48020, "text": "2. Provide unified management services.", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48021, "text": "If you log in and use our account to log in and use the products/services provided by our affiliated companies and other third parties, we may share your personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you log in and use our account to log in and use the products/services provided by our affiliated companies and other third parties, we may share your personal information."}
{"task": "rw_31.jsonl", "id": 48022, "text": "We will only share the necessary personal information in order to provide you with consistent services and unified management, such as checking orders and managing in our products/services.The purpose will once again solicit your authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only share the necessary personal information in order to provide you with consistent services and unified management."}
{"task": "rw_31.jsonl", "id": 48023, "text": "3. Provide necessary cooperation services.", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48024, "text": "In order to achieve the purpose of this policy, some of our services will be provided by business partners.", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48025, "text": "To ensure the successful completion of the services provided for you, we may share your personal information with our partners, including suppliers, service partners, third -party merchants, etc., including distribution business, technical services, payment services, financial services, etc.It may include your contact information, order information, payment information, address information, etc.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share your personal information with our partners."}
{"task": "rw_31.jsonl", "id": 48026, "text": "For example, when you use our takeaway service, we must share your orders and distribution information with the distribution service partners and riders to ensure the safe and accurate delivery of the order;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We must share your orders and distribution information with distribution service partners and riders."}
{"task": "rw_31.jsonl", "id": 48027, "text": "For example, we need to share your order number and order amount with a third -party payment institution to achieve its confirmation of your payment instructions and complete the payment;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We need to share your order number and order amount with third -party payment institutions to achieve your confirmation of your payment instructions and complete payment."}
{"task": "rw_31.jsonl", "id": 48028, "text": "Share your order information and necessary transaction information with third -party merchants so that they can provide you with goods, services and after -sales.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share your order information and necessary transaction information with third -party merchants."}
{"task": "rw_31.jsonl", "id": 48029, "text": "Among them, your contact information and address information are personal sensitive information. We will strive to protect your personal information by taking appropriate measures such as \"number protection\" and \"hiding\" on documents.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Your contact information and address information are personal sensitive information. We will strive to protect your personal information by taking appropriate measures such as \"number protection\" and \"address hiding\" on documents."}
{"task": "rw_31.jsonl", "id": 48030, "text": "4. Safe security and optimization services.", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48031, "text": "In order to ensure your safety when using our products/services and optimize our services, we may share your necessary information with our relevant partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share your necessary information with our relevant partners."}
{"task": "rw_31.jsonl", "id": 48032, "text": "Safety guarantee service.", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48033, "text": "In order to ensure your account security and avoid risks such as fraud, network virus, and cyber attacks, we may use partners to share with our security guarantee partnersSoftware information and other to comprehensively judge your account number and transaction risk to prevent the occurrence of security incidents.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We may share the necessary device information, log information, as well as your usage habits and common software information with our necessary equipment information, as well as your security partners."}
{"task": "rw_31.jsonl", "id": 48034, "text": "Statistics and optimization services.", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48035, "text": "After authorization, we may share information with partners who provide advertising promotion and statistical analysis. It is used to analyze the above information and provide advertising exposure monitoring or service decisions to provide you with better serviceEssence", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We may share information with partners who provide advertising promotion and statistical analysis."}
{"task": "rw_31.jsonl", "id": 48036, "text": "But we will only provide information such as the coverage, effectiveness, and statistical categories of advertising promotion to these partners without sharing personal information that can identify your identity, otherwise we will identify this information to avoid your identity to your identity.Identification.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will only provide these partners with information such as advertising promotion, effectiveness, and statistical categories without sharing personal information that can identify your identity, otherwise we will identify this information to avoid your identity to avoid your identity.Recognize."}
{"task": "rw_31.jsonl", "id": 48037, "text": "5. Provided based on statutory situations.", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48038, "text": "In accordance with the provisions of laws and regulations, the need for litigation disputes, the relevant agreements you signed with us (including the electronic agreement and platform rules signed online) or legal documents, or when the administrative, judicial authorities have the right to make requirements in accordance with the law, we may shareYour personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You may share your personal information when you signed related agreements (including the online signing of the electronic agreement and platform rules signed online) or legal documents, or administrative, judicial authorities such as administrative and judicial authorities."}
{"task": "rw_31.jsonl", "id": 48039, "text": "6. In addition to the above situations, if we share your personal information for any other companies, organizations, and individuals, we will solicit your clear consent or authorization.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "If we share your personal information for any other companies, organizations, and individuals, we will solicit your clear consent or authorization."}
{"task": "rw_31.jsonl", "id": 48040, "text": "We will use the application interface (API), software tool development package (SDK) to share the previous necessary data sharing with third parties. Different versions of third -party SDKs will be different, generally including third -party account login, sharing category, firstThree -party payment category, map navigation, manufacturer push, statistical categories, etc., we will conduct strict security testing of third parties and agreed data protection measures.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will share the aforementioned data sharing with third parties through application interface (API), software tool development package (SDK)."}
{"task": "rw_31.jsonl", "id": 48041, "text": "Meituan takeaway and third -party sharing personal information list (meituan.com)", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48042, "text": "Please know that we will only share your personal information for legal, correct, necessary, specific, and clear purposes. For companies, organizations, and individuals that shared personal information for us to realize the purpose of this policy, we, weIt will sign strict information protection and confidentiality agreement with them, asking them to abide by the agreement and take relevant security measures to protect your personal information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will only share your personal information for legal, correct, necessary, specific, and clear purposes. For companies, organizations, and individuals that only share personal information in order to realize the purpose of this policy and share personal information, we will sign strictly with them.Information protection and confidentiality agreement."}
{"task": "rw_31.jsonl", "id": 48043, "text": "(2) Transfer", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48044, "text": "With the development of our business, we and our affiliated parties may conduct merger, acquisition, reorganization, asset transfer or similar transactions. If the transfer of personal information, we will ask companies and organizations that give your personal information to continue to acceptThe constraints of this privacy policy.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48045, "text": "Otherwise, we will ask the company and the organization to solicit your authorization consent again.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48046, "text": "Except for the above situations, we will not transfer your personal information without your clear consent.", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48047, "text": "(3) Public disclosure", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48048, "text": "We will only disclose your personal information only under the following circumstances and adopt the premise that we meet the industry standards:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only disclose your personal information only in the following circumstances:"}
{"task": "rw_31.jsonl", "id": 48049, "text": "1. According to your needs, disclose the personal information you specified under your clear consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "According to your needs, disclose your personal information you specified under the disclosure of your clear consent."}
{"task": "rw_31.jsonl", "id": 48050, "text": "2. When the requirements of laws and regulations, mandatory administrative law enforcement or judicial requirements must provide your personal information, we may disclose your personal information according to the types of personal information and disclosure required.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may disclose your personal information according to the types of personal information and disclosure required."}
{"task": "rw_31.jsonl", "id": 48051, "text": "Under the premise of compliance with laws and regulations, when we receive a request for the above disclosure information, we ask we must issue corresponding legal documents such as tickets or investigation letters.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48052, "text": "Please note that when you use our service, you voluntarily publish or even publicly shared information may involve your personal information and even personal sensitive information, such as your transaction information, and you choose to upload texts containing personal information when evaluatingVarious forms of information such as pictures or videos.", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48053, "text": "When using our services, please consider whether to publish or even share relevant information.", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48054, "text": "(4) Sharing, transfer, and public disclosure of disclosure of personal information.", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48055, "text": "In the following circumstances, sharing, transfer, and publicly disclose your personal information without obtaining your authorization consent in advance:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the following circumstances, sharing, transfer, and publicly disclose your personal information without obtaining your authorization consent in advance:"}
{"task": "rw_31.jsonl", "id": 48056, "text": "1. It is related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Personal information related to national security and national defense security does not require consent."}
{"task": "rw_31.jsonl", "id": 48057, "text": "2. Related to public safety, public health, and major public interests;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Personal information related to public safety, public health, and major public interests does not need to solicit consent."}
{"task": "rw_31.jsonl", "id": 48058, "text": "3. It is related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Personal information related to sharing with crime investigation, prosecution, trial, and execution of judgment does not need to ask for consent."}
{"task": "rw_31.jsonl", "id": 48059, "text": "4. For major legitimate rights and interests such as maintaining your or other individuals, but it is difficult to get my consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share major legitimate rights and interests such as life and property, but it is difficult to obtain personal information that I agree, without asking for consent."}
{"task": "rw_31.jsonl", "id": 48060, "text": "5. Other situations that safeguard public interests, such as your credit evaluation information needs to be public/shared;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48061, "text": "6. Personal information that you disclose to the public by yourself;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share personal information that you disclose to the public yourself without asking for consent."}
{"task": "rw_31.jsonl", "id": 48062, "text": "7. Collect personal information from legal public information, such as legal news reports and government information disclosure.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you collect personal information from the legal disclosure information, you do not need to ask for consent."}
{"task": "rw_31.jsonl", "id": 48063, "text": "But you clearly reject or deal with this information that infringes your major interests;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48064, "text": "8. Other situations where other regulations can be obtained without authorization.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Other otherwise sharing personal information without authorization in accordance with the law, no need to solicit consent."}
{"task": "rw_31.jsonl", "id": 48065, "text": "According to the law, sharing, transfer, and publicly disclose personal information that is identified by de -identification processing, and ensure that the data receiver cannot restore and re -identify the subject of personal information. We will not notify you separately and obtain it to youYour consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share, transfer, and publicly disclose personal information that has been identified by de -identification processing, and ensure that the data receiver cannot restore and re -identify the subject of personal information. We will not notify you separately and obtain your consent to this type of data."}
{"task": "rw_31.jsonl", "id": 48066, "text": "4. How do we save and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48067, "text": "(1) Preservation of personal information", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48068, "text": "1. Storage period: We will only retain your personal information within the time limit required for the purpose of the cost of reaching the cost of the cost, unless laws and regulations have compulsory retention requirements, such as the \"E -Commerce Law of the People's Republic of China\" requires commodity and service information, and service information, and service information,The preservation time of transaction information is not less than three years from the date of the transaction.", "label": ["Data Retention", "Important"], "rewrite": "We will only retain your personal information within the time limit required by the cost of reaching the cost policy, unless laws and regulations have compulsory retention requirements."}
{"task": "rw_31.jsonl", "id": 48069, "text": "We judge the storage period of personal information mainly refer to the following standards and based on the elders: to complete the transaction purpose related to your transaction, maintain the corresponding transactions and business records to cope with your possible inquiries or complaints;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48070, "text": "Make sure we provide you with service safety and quality;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48071, "text": "Do you agree to a longer retention period;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48072, "text": "Whether there are other special agreement or laws and regulations on the retention period.", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48073, "text": "After exceeding the reservation period, we will delete your personal information according to the requirements of the applicable law, or make it anonymous processing.", "label": ["Data Retention", "Important"], "rewrite": "After exceeding the reservation period, we will delete your personal information according to the requirements of the applicable law, or make it anonymous processing."}
{"task": "rw_31.jsonl", "id": 48074, "text": "When you actively cancel your account, we will process data processing according to the requirements of laws and regulations.", "label": ["Edit/Control", "Important"], "rewrite": "When you actively cancel your account, we will process data processing according to the requirements of laws and regulations."}
{"task": "rw_31.jsonl", "id": 48075, "text": "2. Save the area: The personal information we collected and generated in the territory of the People's Republic of China will be stored in China, except for the following situations:", "label": ["Data Retention", "Important"], "rewrite": "The personal information we collected and generated in the People's Republic of China will be stored in China, except for the following situations:"}
{"task": "rw_31.jsonl", "id": 48076, "text": "(1) The laws and regulations are clearly stipulated;", "label": ["Data Retention", "Important"], "rewrite": "If the laws and regulations are clearly stipulated, the personal information is stored abroad."}
{"task": "rw_31.jsonl", "id": 48077, "text": "(2) Get your authorization consent alone;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48078, "text": "(3) Personal behavior such as cross -border places and transactions that you initiates.", "label": ["Data Retention", "Important"], "rewrite": "If you take the initiative to initiate personal behavior such as cross -border orders and transactions, personal information is stored abroad."}
{"task": "rw_31.jsonl", "id": 48079, "text": "In the above situation, we will perform the corresponding processes and obligations in accordance with the requirements of laws and regulations, and require the data receiver to handle personal information in accordance with the privacy policies and other related security and confidentiality measures.", "label": ["Important", "Data Security"], "rewrite": "In the above situation, we will perform the corresponding processes and obligations in accordance with the requirements of laws and regulations, and require the data receiver to handle personal information in accordance with the privacy policies and other related security and confidentiality measures."}
{"task": "rw_31.jsonl", "id": 48080, "text": "3. Termination operation: If the termination of operations, we will notify you at least 30 days in advance, and delete or anonymous processing of your personal information after termination of operation.", "label": ["Important", "Data Security", "Cessation of Operations"], "rewrite": "If the termination of operations, we will notify you at least 30 days in advance, and delete or processes your personal information after termination of operation."}
{"task": "rw_31.jsonl", "id": 48081, "text": "(2) Protection measures for personal information", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48082, "text": "1. Data security measures", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48083, "text": "In order to ensure your information security, we strive to take various physical, electronics and management security measures that meet industry standards to protect your personal information, and establish data classification hierarchical systems, data security management specifications, and data security development specifications to manage specifications to manage specificationsStorage and use of personal information.", "label": ["Important", "Data Security"], "rewrite": "We strive to adopt various physical, electronics and management security measures that meet industry standards to protect your personal information, and establish data classification hierarchical system, data security management specifications, and data security development specifications to manage the storage and use of personal information."}
{"task": "rw_31.jsonl", "id": 48084, "text": "Our confidentiality agreement, monitoring and auditing mechanisms through information contacts to comprehensively control the data to prevent your personal information from being disclosed, used, modified, damaged, or lost by unauthorized access, publicly disclosure, use, modification, damage, or loss.", "label": ["Important", "Data Security"], "rewrite": "We control the data through the confidentiality agreement, monitoring and audit mechanism through information contactors."}
{"task": "rw_31.jsonl", "id": 48085, "text": "For example, when you exchange data (such as credit card information) between your browser and \"service\" (such as credit card information);", "label": ["Data Security"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48086, "text": "At the same time, the website itself provides HTTPS security browsing methods;", "label": ["Data Security"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48087, "text": "Use encryption technology to ensure the confidentiality of data;", "label": ["Data Security"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48088, "text": "Using a trusted protection mechanism to prevent data from being maliciously attacked;", "label": ["Data Security"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48089, "text": "Deploy the access control mechanism to ensure that only authorized personnel can access personal information;", "label": ["Data Security"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48090, "text": "As well as holding safety and privacy protection training courses to strengthen employees' awareness of protecting the importance of personal information.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48091, "text": "2. Safety certification", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48092, "text": "We have passed the certification qualifications such as the international certification of data security certification of the Ministry of Public Security's information security level protection, ISO27001 information security certification, the third -party payment industry (PCI, DSS) data security standard international certification and other certification qualifications.Establish a good coordination and communication mechanism, timely resist and dispose of various information security threats, and provide a comprehensive guarantee for your information security.", "label": ["Important", "Data Security"], "rewrite": "We have passed the certification qualifications such as international certification such as data security certification, ISO27001 information security certification, and third -party payment industry (PCI DSS) data security standard international certification qualifications."}
{"task": "rw_31.jsonl", "id": 48093, "text": "3. Please know and understand that the Internet is not an absolute security environment. We strongly recommend that you help us ensure your account security through security methods and complex passwords.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48094, "text": "If you find your personal information disclosure, especially your account or password, please contact us according to the contact information provided in this privacy policy in order to take corresponding measures.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48095, "text": "4. Safety events", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48096, "text": "After unfortunately a personal information security incident, we will immediately set up a special emergency group to start emergency plans to prevent the expansion of security incidents. We will inform you in a timely manner in accordance with the requirements of laws and regulations: the basic situation and possible impact of security incidents, we have adopted the impact of the security incident, we have adopted it.It may take disposal measures, suggestions that you can prevent and reduce risks, and remedy measures for your remedy.", "label": ["Important", "Data Security"], "rewrite": "After unfortunately a personal information security incident, we will immediately set up a special emergency group to start emergency plans to prevent the expansion of security events, and inform you in a timely manner in accordance with the requirements of laws and regulations: basic situations and possible impacts, disposal measures, suggestions, remediesMeasures, etc."}
{"task": "rw_31.jsonl", "id": 48097, "text": "We will promptly inform you that the incident -related situation is informing the email, letter, telephone, push notification, etc. When it is difficult to inform the subject of personal information one by one, we will publish an announcement in a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "We will promptly inform you that the incident -related situation is informing the email, letter, telephone, push notification, etc. When it is difficult to inform the subject of personal information one by one, we will publish an announcement in a reasonable and effective way."}
{"task": "rw_31.jsonl", "id": 48098, "text": "At the same time, we will also actively report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "We will also take the initiative to report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities."}
{"task": "rw_31.jsonl", "id": 48099, "text": "5. How do you manage your personal information", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48100, "text": "You have the following rights to your personal information.", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48101, "text": "According to the requirements of laws and regulations, in specific circumstances, in addition to your other arrangements, your close relatives can exercise the following rights for your relevant personal information for your own legal and legitimate interests.", "label": ["Important", "Edit/Control"], "rewrite": "In specific circumstances, in addition to your other arrangements, your close relatives can exercise the following rights for your relevant personal information for your own legal and legitimate interests."}
{"task": "rw_31.jsonl", "id": 48102, "text": "(1) You have the right to check, access, correct, and delete your personal information, except for the exception stipulated in laws and regulations.", "label": ["Important", "Edit/Control"], "rewrite": "You have the right to check, access, correct, and delete your personal information, except for the exception stipulated in laws and regulations."}
{"task": "rw_31.jsonl", "id": 48103, "text": "You can manage your information in the following way:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48104, "text": "You can enter \"Settings\"-\"Privacy Management\" through the upper right corner of \"Mine\" to check and manage personal information.", "label": ["Important", "Edit/Control"], "rewrite": "You can enter \"Settings\"-\"Privacy Management\" through the upper right corner of \"Mine\" to check and manage personal information."}
{"task": "rw_31.jsonl", "id": 48105, "text": "Unbinding of bank cards.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48106, "text": "You can click on the \"Avatar of My\" on the left corner of \"My\" in the upper left corner of \"My\" in the upper left corner of the Meituan Takeaway APP;", "label": ["Important", "Edit/Control"], "rewrite": "You can click on the \"Avatar\" in the upper left corner of \"My\" in the upper left corner of the Meituan Takeaway APP to check or correct your personal information."}
{"task": "rw_31.jsonl", "id": 48107, "text": "Your payment information and bank card binding information can enter the \"My\"-\"My Wallet\" by visiting Meituan takeaway app to check and perform such operations.", "label": ["Important", "Edit/Control"], "rewrite": "Your payment information and bank card binding information can enter the \"My\"-\"My Wallet\" by visiting Meituan takeaway app to check and perform such operations."}
{"task": "rw_31.jsonl", "id": 48108, "text": "Address Information-You can add, change, and delete your delivery address information at any time by visiting the \"My\"-\"My Function\"-\"My Address\" on the Meituan takeaway page, Gender, delivery address, phone number, etc.).", "label": ["Edit/Control", "Important"], "rewrite": "Address Information-You can add, change, and delete your delivery address information at any time by visiting the \"My\"-\"My Function\"-\"My Address\" on the Meituan takeaway page, Gender, delivery address, phone number, etc.)."}
{"task": "rw_31.jsonl", "id": 48109, "text": "Search for browsing information -you can access or clear your search history, view and modify your interests, and manage other data in Meituan Takeaway APP.", "label": ["Edit/Control", "Important"], "rewrite": "You can access or clear your search history, view and modify your interests, and manage other data in Meituan Takeaway APP."}
{"task": "rw_31.jsonl", "id": 48110, "text": "Order information -You can check the order that you have completed, pay, after sale, and evaluation by visiting the \"Order\" page.", "label": ["Important", "Edit/Control"], "rewrite": "You can check all the orders that have been completed, pay, after -sales, and evaluation by visiting the \"Order\" page."}
{"task": "rw_31.jsonl", "id": 48111, "text": "You can choose to delete the completed order information, but this may cause us to accurately provide corresponding after -sales services according to your purchase information.", "label": ["Important", "Edit/Control"], "rewrite": "You can choose to delete the completed order information, but this may cause us to accurately provide corresponding after -sales services according to your purchase information."}
{"task": "rw_31.jsonl", "id": 48112, "text": "Comment information-You can visit, correct, and remove your comments by accessing \"My\"-\"My Function\"-\"My Evaluation\" on the Meituan takeaway page.", "label": ["Important", "Edit/Control"], "rewrite": "You can visit, correct, and clear your comments by visiting the \"My\"-\"My Function\"-\"My Evaluation\" on the Meituan takeaway page."}
{"task": "rw_31.jsonl", "id": 48113, "text": "Please know that according to the requirements of the laws and regulations and the technical conditions of different information, we may not be able to completely delete the corresponding information you want to delete immediately from the system. Prior to this, we will only store and storage the corresponding information according to the requirements of the regulations and regulations.Take the necessary safety protection measures.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48114, "text": "If you cannot manage these personal information through the above links, you can contact us at any time through the feedback method provided in this privacy policy.", "label": ["Edit/Control", "Important"], "rewrite": "If you cannot manage these personal information through the above links, you can contact us at any time through the feedback method provided in this privacy policy."}
{"task": "rw_31.jsonl", "id": 48115, "text": "We will reply to your access request within 15 days.", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48116, "text": "(2) Change the scope of your authorization consent or withdraw authorization", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48117, "text": "You can change the consent range or withdraw your authorization by deleting information in Meituan takeaway APP, changing privacy settings, or closing equipment permissions in the system or withdrawing your authorization.", "label": ["Edit/Control", "Important"], "rewrite": "You can change the consent range or withdraw your authorization by deleting information in Meituan takeaway APP, changing privacy settings, or closing equipment permissions in the system or withdrawing your authorization."}
{"task": "rw_31.jsonl", "id": 48118, "text": "You can operate management and withdraw your system authorization in the upper right corner to enter \"Settings\"-\"Privacy Management\"-\"System permissions Management\".", "label": ["Important", "Edit/Control"], "rewrite": "You can operate management and withdraw your system authorization in the upper right corner to enter \"Settings\"-\"Privacy Management\"-\"System permissions Management\"."}
{"task": "rw_31.jsonl", "id": 48119, "text": "Please understand that when you perform the above operations, we will not be able to continue to provide you with the service corresponding to the withdrawal consent or authorization, but it will not affect the personal information processing that has been developed based on your authorization.", "label": ["Important", "Edit/Control"], "rewrite": "When you perform the above operations, we will not be able to continue to provide you with the service corresponding to the withdrawal consent or authorization, but it will not affect the personal information processing that has been carried out based on your authorization."}
{"task": "rw_31.jsonl", "id": 48120, "text": "(3) Logging out the account", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48121, "text": "You have the right to cancel the Meituan takeaway service, and also have the right to sell your Meituan account. You can click on the \"avatar\" on the upper corner of the \"My\" on the left corner \"Logging out\" by visiting the Meituan Takeaway App page for online operation.", "label": ["Edit/Control", "Important"], "rewrite": "You have the right to cancel the Meituan takeaway service, and also have the right to sell your Meituan account. You can click on the \"avatar\" on the upper corner of the \"My\" on the left corner \"Logging out\" by visiting the Meituan Takeaway App page for online operation."}
{"task": "rw_31.jsonl", "id": 48122, "text": "After you successfully cancel, in addition to laws and regulations and corresponding national standards, we will delete your personal information or make anonymous processing.", "label": ["Edit/Control", "Data Security", "Important"], "rewrite": "After you successfully cancel, in addition to laws and regulations and corresponding national standards, we will delete your personal information or make anonymous processing."}
{"task": "rw_31.jsonl", "id": 48123, "text": "If you cannot access, correct or delete your personal information and cancel your account in the above method, or if you think that the US group has a violation of laws to collect and use your personal information, you can use our customer service or through this privacy policy through this privacy policyOther ways are provided to get in touch with us.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48124, "text": "In order to ensure safety, we may need to provide the corresponding way to prove the legitimacy of your identity and request. We will answer your request within 15 days after receiving your feedback and verifying your identity.", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48125, "text": "For your reasonable request, we do not charge fees in principle, but we will charge a certain cost fee depending on the request that repeats and beyond the reasonable limit.", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48126, "text": "For those who have no repetition and need too much technical means (for example, need to develop new systems or fundamentally change the current practice), bring risks to others' legitimate rights and interests or very unrealistic (for example, information involved in backup tapes)We may refuse.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48127, "text": "(4) Autonomous management control marketing information and directional push", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48128, "text": "Message push -if you don't want to receive message notifications on the APP page, you can refuse to receive message notifications when installing the APP for the first time, or turn off the corresponding notification function in the \"Notice\" center in the mobile operating system.", "label": ["Important", "Edit/Control"], "rewrite": "If you don't want to receive message notifications on the APP page, you can refuse to receive message notifications when installing the APP for the first time, or the \"notification\" center in the mobile terminal operating system is closed to close the corresponding notification function."}
{"task": "rw_31.jsonl", "id": 48129, "text": "Personalized recommendation -If you do not want to use our intelligent recommendation service, you can choose to sort according to the way of distance, praise, price, etc. without your personal characteristics.Do not want to watch \"\" functions such as \"such as\" functions for precise feedback and real -time shutdown;", "label": ["Important", "Edit/Control"], "rewrite": "If you do not want to use our intelligent recommendation service, you can choose to sort according to the way of distance, praise, price, etc. that do not target your personal characteristics. You can also use functions such as \"not interested\", \"don't want to see\" in the recommend information pagePerform accurate feedback and closed in real time."}
{"task": "rw_31.jsonl", "id": 48130, "text": "You can also control the switch in \"My\"-\"Settings\"-\"Privacy Management\"-\"Receive Personalized Recommendation\".", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48131, "text": "Personalized advertisements-If you don't want to receive personalized advertisements, you can control the switch yourself in \"My\"-\"Settings\"-\"Privacy Management\"-\"Receive Personalized Recommendation\". When you closeAdvertising correlations will be reduced, but advertisements will not disappear.", "label": ["Important", "Edit/Control"], "rewrite": "If you do not want to receive personalized advertisements, you can control your own control switch in \"My\"-\"Settings\"-\"Privacy Management\"-\"Receiving Personalized Recommendation\". When you close it, the advertising correlation you can seeIt will be reduced, but the advertisement will not disappear."}
{"task": "rw_31.jsonl", "id": 48132, "text": "Promotion/return visits -If you do not want to receive our promotion text messages or telephone return visits, you can withdraw through the corresponding withdrawal function in the information, or explicitly reject it during the telephone return visit.", "label": ["Important", "Edit/Control"], "rewrite": "If you do not want to receive our promotional SMS or telephone return visits, you can withdraw bips through the corresponding withdrawal function in the information, or explicitly reject it during the telephone return visit."}
{"task": "rw_31.jsonl", "id": 48133, "text": "6. Protection of personal information of minors", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48134, "text": "Meituan takeaway attaches great importance to the protection of personal information of minors.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48135, "text": "Our websites and services are mainly adults.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48136, "text": "If you are a minor, it is recommended that you ask your parents or guardians to read this privacy policy carefully and the \"Privacy Policy of the Minor Privacy\" that we specially formulate, and use our parents or guardians' consent on the premise of obtaining our parents or guardians.Serve or provide information to us.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48137, "text": "For the case where parents or guardians agree to use our products/services to collect personal information of minors, we will only use, share, transfer, transfer, transfer, transfer, transfer, transfer, and transfer if the parents or guardians are clearly agreed or protected by the guardian.Or disclose this information.", "label": ["Specific Audiences", "Important"], "rewrite": "We will only use, share, transfer, or disclose this information if the laws and regulations are allowed, parents or guardians to clearly agree or protect minors."}
{"task": "rw_31.jsonl", "id": 48138, "text": "If we find that we collect the personal information of minors without the consent of the parents or the legal guardian who can be confirmed in advance, they will try to take appropriate processing of relevant data as soon as possible.", "label": ["Specific Audiences", "Important"], "rewrite": "If we find that we collect the personal information of minors without the consent of the parents or the legal guardian who can be confirmed in advance, they will try to take appropriate processing of relevant data as soon as possible."}
{"task": "rw_31.jsonl", "id": 48139, "text": "7. Notification and revision", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48140, "text": "In order to provide you with better services, our business will change from time to time, and this privacy policy will be adjusted.If our contact information is changed, we will update it in time.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48141, "text": "Without your clear consent, we will not reduce the rights you should enjoy in accordance with the privacy policy.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48142, "text": "We will send a update version on our website and mobile terminals or remind you to update the relevant content in other ways. Please also visit us to understand the latest privacy policy in time.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48143, "text": "In the foregoing, if you continue to use our services, you will agree to accept the revised policy and be bound.", "label": ["Risk", "Policy Change"], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48144, "text": "8. How to contact us", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48145, "text": "You can contact us in the following ways, we will answer your request within 15 days;", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48146, "text": "1. You can contact us through the online contact information provided by Meituan takeaway website (https://waiimai.meituan.com)/Meituan takeaway app/online customer service system to contact us.", "label": ["Important", "Contact Information"], "rewrite": "You can contact us through the online contact information provided by the Meituan takeaway website (https://waiimai.meituan.com)/Meituan takeaway app/online customer service system to contact us."}
{"task": "rw_31.jsonl", "id": 48147, "text": "2. You can contact Meituan takeaway customer service phone to feedback or report complaints (Meituan Takeaway Customer Service: 10109777).", "label": ["Important", "Contact Information"], "rewrite": "You can contact Meituan takeaway customer service phone to feedback or report complaints (Meituan Takeaway Customer Service: 10109777)."}
{"task": "rw_31.jsonl", "id": 48148, "text": "3. We have also set up a special personal information protection team. You can contact our personal information protection person in charge of mailbox, privacy@meituan.com, or send a letter to the following address:Privacy Protection Center, Block C of Block C of Weiye Building (closed), postcode:, 100102.", "label": ["Important", "Contact Information"], "rewrite": "We have also set up a special personal information protection team. You can contact our personal information protection person in charge of the mailbox privacy@meituan.com, or send a letter to the following address: Block C, Hengji Building, No. 4, No. 4, Wangjing East Road, Chaoyang District, BeijingLayer Privacy Protection Center (closed), postcode: 100102."}
{"task": "rw_31.jsonl", "id": 48149, "text": "appendix:", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48150, "text": "1. Personal information: Refers to the various information that can be recorded alone or with other information to identify a specific natural person or reflect the activity of specific natural persons alone or with other information.", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48151, "text": "Personal information that may involve in this privacy policy includes, but not limited to: personal information (including name, phone number, gender, address, birthday, birthday, etc.);", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48152, "text": "Personal identity information (including ID cards, officers, passports, driving licenses, etc.);", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48153, "text": "Network identity identification information (including system accounts, IP addresses, mailbox addresses, and the answer to the aforementioned password, password, password protection);", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48154, "text": "Personal property information (including bank accounts, transactions and consumption records, credit records, and virtual property information, etc.);", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48155, "text": "Personal health and physiological information (including diseases, medical records, history, etc.);", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48156, "text": "Contact information (including address book information, friends list, etc.);", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48157, "text": "Personal Internet records (including website browsing records, click records, etc.);", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48158, "text": "Personal device information (including information that describes the basic situation of individual equipment such as the unique device identification code);", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48159, "text": "Personal location information (including the trajectory, precise positioning information, etc.).", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48160, "text": "2. Personal sensitive information: It refers to personal information that once leaked, illegally provided or abuses the security of people's body and property, and it is easy to lead to personal information that causes personal reputation, physical and mental health, or discriminatory treatment.", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48161, "text": "Personal sensitive information that may be involved in this privacy policy includes: personal identity certification information (including ID cards, officers, passports, driving licenses, student IDs, etc.);", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48162, "text": "Personal property information (bank account, transaction and consumption records, credit records, virtual property information, etc.);", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48163, "text": "Other information (trajectory, accurate positioning information, etc.);", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48164, "text": "Under 14 years old, minor information.", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48165, "text": "3. Related company: refers to Meituan affiliated company disclosed by Meituan's latest listed company annual report.", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48166, "text": "Meituan Takeaway and Meituan are related companies.", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48167, "text": "4. Related account number: You can use the same mobile phone number to log in to the product/services provided by Meituan, and authorize the use of your Meituan account information (such as avatar, nickname, receiving address), so that we can to you based on related accounts to you to youProvide consistent services and unified management.", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48168, "text": "To learn more about the rules of Meituan takeaway platform, please click: Meituan takeaway rules.", "label": [], "rewrite": []}
{"task": "rw_31.jsonl", "id": 48169, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
