{"task": "rw_32.jsonl", "id": 48170, "text": "Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48171, "text": "Version update date: March 5, 2022", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48172, "text": "Version Effective Date: March 5, 2022", "label": [], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48173, "text": "Shenzhen Yixian Technology Co., Ltd. (hereinafter referred to as \"We\") is an operator of the primary and secondary school network cloud platform (hereinafter referred to as \"APP\").For better services, we will use and disclose your personal information in accordance with the provisions of this privacy protection policy. We know the importance of personal information to you and we will do our best to protect your personal information security and reliable.", "label": [], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48174, "text": "This privacy protection policy explains how to collect, use your personal information, and help you understand your rights. Before using our services, carefully read and understand the privacy protection policy.", "label": [], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48175, "text": "[Special Tips] Please read the \"Privacy Protection Policy\" (especially the content of bold and line) and determine our personal information processing rules.", "label": [], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48176, "text": "During the reading and use process, if you have any questions, you can contact our customer service consultation. If you do not agree with any terms in the agreement, you should stop access and use immediately.", "label": [], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48177, "text": "This policy will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48178, "text": "1. Definition", "label": [], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48179, "text": "2. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48180, "text": "3. How can we share, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48181, "text": "4. How do we protect and save your personal information", "label": [], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48182, "text": "5. Your rights", "label": [], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48183, "text": "6. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48184, "text": "7. How to update this policy", "label": [], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48185, "text": "8. How to contact us", "label": [], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48186, "text": "1. Definition", "label": [], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48187, "text": "Personal information: Refers to the various information that can be recorded alone or with other information with other information alone or with other information.", "label": [], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48188, "text": "For personal information referred to this privacy protection policy, please see the types of \"how do we collect and use your personal information\".", "label": [], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48189, "text": "Personal sensitive information: Refers to personal information such as leakage, illegal provision or abuse that may endanger people's body and property, and it is easy to lead to personal information such as personal reputation, physical and mental health damage or discrimination.", "label": [], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48190, "text": "Personal sensitive information involved in this privacy protection policy includes: network identification information (including account names, account nicknames, and passwords related to the aforementioned);", "label": [], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48191, "text": "Other information (mobile phone number, location information).", "label": [], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48192, "text": "For the above personal sensitive information listed in this privacy protection policy, in order to facilitate your alertness when reading, in addition to the definition and listing here, we will still use the fonts in this privacy protection policy.Coupled with the line, or point out the way to display it alone, prompt you to pay attention.", "label": [], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48193, "text": "2. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48194, "text": "In the process of APP development and upgrading, we will continue to improve the product function. We will only collect and use your personal information for the following goals described in this policy:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48195, "text": "(1) Help you register as our user", "label": [], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48196, "text": "To help you become our user, that is, the creation of the account can be completed so that we can provide you with a registered user service. We provide you with a variety of registered channels for you to choose from.", "label": [], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48197, "text": "When you choose to register with your mobile phone number, you need to provide us with your personal sensitive information of your mobile phone number. We use this type of information to send the verification code information to submit whether to submit the verification identity.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "You need to provide us with personal sensitive information of your mobile phone number. We use this type of information to send the verification code information to submit whether you are valid."}
{"task": "rw_32.jsonl", "id": 48198, "text": "When you choose to use a third -party account (eg: WeChat) to register and log in to the user account more conveniently, we will access and collect your personal information after indirectly obtained.Class information, which is subject to the public information and permissions authorized by different third -party accounts) and binds your third -party account with your registered account.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you choose to register and log in to the user account more conveniently with a third -party account (eg, WeChat), we will access and collect your personal information after indirectly obtained."}
{"task": "rw_32.jsonl", "id": 48199, "text": "If you refuse to provide information under a third -party account, you cannot choose to register and log in to use a third -party account. We promise the legitimacy of the third -party account channel source of this type of personal information.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide information under a third -party account, you cannot choose to register and log in to use a third -party account. We promise the legitimacy of the third -party account channel source of this type of personal information."}
{"task": "rw_32.jsonl", "id": 48200, "text": "(2) Equipment permissions we will use", "label": [], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48201, "text": "1., we need to read your mobile phone status, use the purpose and business scenario: read the mobile phone status, involves IMEI information of user equipment, for user data statistics (installation, activity) and identifying users, and ensuring you to ensure yourAccounts, networks, operations and system security reduce the risk of numbers.", "label": ["Important", "First Party Collection Information"], "rewrite": "We need to read your mobile phone status, purpose and business scenario."}
{"task": "rw_32.jsonl", "id": 48202, "text": "The collection of your information is: hardware serial number, MAC address of the device, and the only device identification code (IMEI, OAID, AndroidId, IDFA, IDFV, UUID, Open UDID, UDID, AID, CAID, GUID, SIM card IMSI IMSI information))", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48203, "text": "2., we need to obtain the software installation list information of your mobile phone, to determine whether there are WeChat and Alipay when you need to adjust WeChat or Alipay;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We need to get the software installation list information of your mobile phone."}
{"task": "rw_32.jsonl", "id": 48204, "text": "If you do not authorize this permissions, some functions and related services of this product will not be used;", "label": ["Important", "First Party Collection Information"], "rewrite": "If you do not authorize this permissions, some functions and related services of this product will not be used."}
{"task": "rw_32.jsonl", "id": 48205, "text": "After authorizing this permissions, you can also cancel the authorization at the application permission management center of the mobile phone at any time.", "label": ["Important", "Edit/Control"], "rewrite": "After authorizing this permissions, you can also cancel the authorization at the application permission management center of the mobile phone at any time."}
{"task": "rw_32.jsonl", "id": 48206, "text": "3. Get network connection to provide the normal operation of the APP basic service, and to ensure the normal operation of the SDK access to the APP.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48207, "text": "4. Get the permissions of the external storage device to provide the normal operation of the APP basic service and the normal operation of the SDK access to the APP.", "label": ["Permission Acquisition", "Important"], "rewrite": "Get the permissions of the external storage device and use it to provide the normal operation of the APP basic service."}
{"task": "rw_32.jsonl", "id": 48208, "text": "5. Get read and write the permissions of the external storage device for users to use related functions for storage data, and the normal operation of the SDK access to the APP.", "label": ["Permission Acquisition", "Important"], "rewrite": "Get read and write external storage permissions for users to use related functions for storage data."}
{"task": "rw_32.jsonl", "id": 48209, "text": "6. Get network information status to provide the normal operation of APP basic services, and to ensure the normal operation of SDK access to the APP.", "label": ["Important", "First Party Collection Information"], "rewrite": "Obtain network information status to provide the normal operation of APP basic services, and to ensure the normal operation of SDK access to the APP."}
{"task": "rw_32.jsonl", "id": 48210, "text": "7. Get the status of the current WIFI access and information about WLAN hotspots to provide the normal operation of the APP basic service and the normal operation of the SDK access to the APP.", "label": ["Important", "First Party Collection Information"], "rewrite": "Get the status of the current WiFi access and information about WLAN hotspots to provide the normal operation of the APP basic service and the normal operation of the SDK access to the APP."}
{"task": "rw_32.jsonl", "id": 48211, "text": "8. Get your mobile phone status permissions for providing normal operation of APP basic services, and the normal operation of SDK access to the APP.", "label": ["Permission Acquisition", "Important"], "rewrite": "Get the mobile phone status permission to provide the normal operation of the APP basic service, and the normal operation of the SDK access to the APP."}
{"task": "rw_32.jsonl", "id": 48212, "text": "9. Get rough position permissions to provide the normal operation of the APP basic service, and the normal operation of the SDK access to the APP.", "label": ["Permission Acquisition", "Important"], "rewrite": "Get a rough position permissions to provide the normal operation of the APP basic service and the normal operation of the SDK access to the APP."}
{"task": "rw_32.jsonl", "id": 48213, "text": "(3) Improve our products or services", "label": [], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48214, "text": "We may also obtain your other information to improve the reasonable needs of our products or services, including the relevant feedback information provided by you when contacting the customer service, the questionnaire answering information sent to us during the questionnaire survey, and you and usWhen the related parties and our partners are interacted, we authorize the relevant information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may also obtain your other information to improve the reasonable needs of our products or services."}
{"task": "rw_32.jsonl", "id": 48215, "text": "For information collected from your various devices, we may associate them so that we can provide you with consistent services on these devices.", "label": ["Important", "Usage"], "rewrite": "For information collected from your various devices, we may associate them so that we can provide you with consistent services on these devices."}
{"task": "rw_32.jsonl", "id": 48216, "text": "We may combine information from a certain service with other services to provide you with services.", "label": ["Important", "Usage"], "rewrite": "We may combine information from a certain service with other services to provide you with services."}
{"task": "rw_32.jsonl", "id": 48217, "text": "(4) Provide you with security guarantee", "label": [], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48218, "text": "In order to improve the security of your service, protect the safety of personal property of you, other users or the public, be exempted from infringement, and better prevent security risks such as fishing websites, fraud, network vulnerabilities, computer viruses, cyber attacks, network invasion, etc.To accurately identify the rules that violate laws and regulations or the relevant agreement of the company, we may use or integrate your registered information, equipment information, network logs, and the frequency of your application, the collapse data, the overall installation usage, performance data, and performance data, andFor the source of the application, to comprehensively judge your account and transaction risk, conduct authentication, test and prevent security incidents, and take necessary records, audit, analysis, and disposal measures in accordance with the law.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may use or integrate your registered information, equipment information, network logs, and the frequency of your application, the collapse data, the overall installation usage, performance data, and the source of the application to comprehensively judge your account and transaction riskEssence"}
{"task": "rw_32.jsonl", "id": 48219, "text": "For example, we will comprehensively analyze the abnormalities of user account activity, multi -end login, and abnormal traffic to protect your account security.", "label": ["Important", "Usage"], "rewrite": "We will comprehensively analyze the abnormal user account activity, multi -end login, and abnormal traffic to protect your account security."}
{"task": "rw_32.jsonl", "id": 48220, "text": "(5) Other purposes and uses", "label": [], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48221, "text": "In the following circumstances, we will solicit your consent in advance in accordance with the provisions of laws and regulations: 1. We use information for other purposes and purposes that are not stated in this policy;", "label": ["Usage", "Data Security"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48222, "text": "2. We use the information collected based on specific uses for other uses.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48223, "text": "(6) Exception of obtaining authorization consent", "label": [], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48224, "text": "According to relevant laws and regulations, collecting your personal information in the following circumstances does not need to obtain your authorization consent:", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In the following circumstances, collect your personal information without obtaining your authorization consent:"}
{"task": "rw_32.jsonl", "id": 48225, "text": "1. It is related to national security and national defense security;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collecting personal information related to national security and national defense security does not require consent."}
{"task": "rw_32.jsonl", "id": 48226, "text": "2. Related to public safety, public health, and major public interests;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collecting personal information related to public safety, public health, and major public interests does not require consent."}
{"task": "rw_32.jsonl", "id": 48227, "text": "3. It is related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collecting related personal information related to criminal investigation, prosecution, trial, and execution of judgments does not need to ask for consent."}
{"task": "rw_32.jsonl", "id": 48228, "text": "4. For major legitimate rights and interests of the life and property of the subject of personal information or other individuals, it is difficult to get your consent;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collecting major legitimate rights and interests such as life and property, but it is difficult to obtain personal information that I agree, without asking for consent."}
{"task": "rw_32.jsonl", "id": 48229, "text": "5. The collected personal information is made by your own public;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The collected personal information is made to the public by itself without asking for consent."}
{"task": "rw_32.jsonl", "id": 48230, "text": "6. Collect personal information from the legal publicly disclosed information, such as legal news reports and government information disclosure;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If you collect personal information from the legal disclosure information, you do not need to ask for consent."}
{"task": "rw_32.jsonl", "id": 48231, "text": "7. Signing the contract for the contract according to your requirements;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collecting the personal information necessary for the signing of the contract does not need to ask for consent."}
{"task": "rw_32.jsonl", "id": 48232, "text": "8. It is necessary to maintain the safe and stable operation of the products or services provided by maintenance, such as the failure of discovering and disposing of products or services;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collecting the personal information necessary for the safe and stable operation of the products or services provided by the maintenance, no consent is required."}
{"task": "rw_32.jsonl", "id": 48233, "text": "9. It is necessary for legal news reports;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collecting the personal information necessary for legal news reports does not need to solicit consent."}
{"task": "rw_32.jsonl", "id": 48234, "text": "10. Academic research institutions need to carry out statistics or academic research in the institute based on public interests, and provide academic research or description results to identify the personal information contained in the results;", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48235, "text": "11. Other circumstances stipulated in laws and regulations.", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48236, "text": "3. How can we share, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48237, "text": "(1) Sharing and disclosure", "label": [], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48238, "text": "We will not share your personal information to any company, organization and individual other than the company, except the following situations: except:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not share your personal information to any company, organization and individual other than the company, except the following situations: except:"}
{"task": "rw_32.jsonl", "id": 48239, "text": "1. Share it if obtained the clear consent or authorization of you (and guardian) or you take the initiative.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share personal information with your clear consent or authorization of you (and guardian) or actively choosing."}
{"task": "rw_32.jsonl", "id": 48240, "text": "2. Sharing in statutory situations.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48241, "text": "We may share your personal information to the outside world in accordance with the requirements of laws and regulations, litigation disputes, or in accordance with the requirements of administrative and judicial organs in accordance with law.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share your personal information to the outside world in accordance with the requirements of laws and regulations, litigation disputes, or in accordance with the requirements of administrative and judicial organs in accordance with law."}
{"task": "rw_32.jsonl", "id": 48242, "text": "For example, if we determine that you have violated laws and regulations or seriously violated the rules of this agreement, or for the protection of personal property of the company's and its related companies or the public, we may disclose it in accordance with laws and regulations or platform -related agreement rules.Your personal information, including related violations and the measures we have taken.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48243, "text": "3. Share your personal information from the affiliates of the APP.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48244, "text": "In this case, we will only share the necessary personal information and be subject to the purpose of the purpose declared in the privacy protection policy.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48245, "text": "If our affiliates want to change the purpose of personal information, we will solicit your authorization consent again.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "If our affiliates want to change the purpose of personal information, we will solicit your authorization consent again."}
{"task": "rw_32.jsonl", "id": 48246, "text": "4. Sharing with the authorized partners of the APP: Only in order to achieve the purpose of the privacy policy, some of our services will be provided by us and authorized partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to achieve the purpose of the privacy policy, some of our services will be provided by us and authorized partners."}
{"task": "rw_32.jsonl", "id": 48247, "text": "We will share some of your personal information with your partners to provide better customer service and user experience.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will share some of your personal information with your partners to provide better customer service and user experience."}
{"task": "rw_32.jsonl", "id": 48248, "text": "We will only share your personal information for legal, correct, necessary, specific, and clear purposes, and only share the personal information necessary for providing services.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only share your personal information for legal, correct, necessary, specific, and clear purposes, and only share the personal information necessary for providing services."}
{"task": "rw_32.jsonl", "id": 48249, "text": "Our partners have no right to use shared personal information for other uses that are not related to products or services.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Our partners have no right to use shared personal information for other uses that are not related to products or services."}
{"task": "rw_32.jsonl", "id": 48250, "text": "At present, our authorized partners include the following types:", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48251, "text": "a) Sharing with suppliers, service providers and other partners.", "label": [], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48252, "text": "We send information to software service providers, smart equipment supply, system service providers and other partners (such as hardware manufacturers, telecommunications operators, map service providers, etc.) that support our business.Analyze the usage methods of our service, provide customer service, positioning services, or conduct academic research and investigation.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We send information to software service providers, smart device supply, system service providers and other partners that support our business."}
{"task": "rw_32.jsonl", "id": 48253, "text": "We will sign a strict data protection agreement with the shared objects, asking them to handle personal information in accordance with our instructions, privacy protection policies, and any other related confidentiality and security measures.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will sign a strict data protection agreement with the shared objects, asking them to handle personal information in accordance with our instructions, privacy protection policies, and any other related confidentiality and security measures."}
{"task": "rw_32.jsonl", "id": 48254, "text": "If we share your personal sensitive information or authorize partners to change the purpose of the use and processing of personal information, we will solicit your authorization consent again.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "If we share your personal sensitive information or authorize partners to change the purpose of the use and processing of personal information, we will solicit your authorization consent again."}
{"task": "rw_32.jsonl", "id": 48255, "text": "In order to enable you to log in for third -party login, accept information push, share information on third -party platforms, use location services, and the above services and functions, we will embed the software tool development package (SDK) or other similar similar to authorized partners in the application partner in the applicationApplications and strict security inspections to protect data security.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will embed the software tool development package (SDK) or other similar applications of authorized partners in the application and perform strict security inspections to protect data security."}
{"task": "rw_32.jsonl", "id": 48256, "text": "We list the related situations related to the use of user information.", "label": [], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48257, "text": "b) The SDK directory we use", "label": [], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48258, "text": "SDK Name: Tencent Browse Service Company Name: Tencent Technology (Shenzhen) Co., Ltd. SDK official website: https://x5.tencent.com/ Objective: Types/field of personal information collected in the app loaded in the app: equipment information, network network, networkinformation", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48259, "text": "SDK Name: Friend League+SDK Company Name: Youmeng Tongxin (Beijing) Technology Co., Ltd. SDK official website: https://www.umeng.com/ Objective: Type/field of personal information collected by Youmeng dataInformation (IMEI/MAC/Android/IDFA/Openudid/Guid/SIM card IMSI/geographical location, etc.)", "label": ["Third Party Sharing/ Disclosure", "First Party Collection Information"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48260, "text": "SDK Name: WeChat Pay SDK Company Name: Tenpay Payment Technology Co., Ltd. SDK official website: https://pay.weixin.qq.com Objective: Types/field for the type/field of personal information collected by cash payment to purchase members: Equipment information collected: Equipment information, Network information, positioning information, log information", "label": ["Third Party Sharing/ Disclosure", "First Party Collection Information"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48261, "text": "Network information, positioning information, log information", "label": ["Third Party Sharing/ Disclosure", "First Party Collection Information"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48262, "text": "SDK name: pangolin SDK company name: Beijing huge volume engine network technology Co., Ltd. SDK official website: https://www.csjplatform.com/", "label": ["Third Party Sharing/ Disclosure", "First Party Collection Information"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48263, "text": "Objectives: Types/fields of personal information of advertising, attribution of advertising, advertising monitoring, anti -cheating, statistical analysis of advertising, reducing the collapse of the APP, and providing stable and reliable services: Equipment brand, model, software system version, resolution, network, network, network, network, network, network, network, network, network, network, network, networkBasic information such as signal strength, device language, sensor information, AndroidID, IP address, wireless network SSID name, WIFI router MAC address, MAC address of the device, device identifier (such as IMEI, OAID, IMSI, ICCID, GAID (only GMS service only GMS service), MEID, device serial number BuildlSerial, specific fields are different due to the different soft hardware versions), developer's application name, application package name, version number, application front and background status, application list information, display, click and clicks and clicks and clicks on advertising, clicks, andInteractive data such as transformation, such as collapse data, performance data, operator information, equipment time zone", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48264, "text": "SDK Name: Tencent Advertising SDK Company Name: Tencent Technology Co., Ltd. SDK official website: https://e.qq.com/ads/ Objective: Types/field of personal information collected by Tencent Advertising display business:And application information, mobile network information, location information", "label": ["Third Party Sharing/ Disclosure", "First Party Collection Information"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48265, "text": "SDK Name: Alibaba Cloud Certification SDK Company Name: Alibaba Cloud Computing Co., Ltd. SDK official website: https://www.aliyun.com/ Objective: Types/field of personal information collected by the mobile phone number one -click to collect: Equipment information, network information, network information, Log information", "label": ["Third Party Sharing/ Disclosure", "First Party Collection Information"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48266, "text": "SDK Name: WeChat SDK Company Name: Tencent Technology Co., Ltd. SDK official website: https://open.weixin.qq.com/ Objective: WeChat one -click personal information type/field: Equipment information, network information, logs, logs, logsinformation", "label": ["Third Party Sharing/ Disclosure", "First Party Collection Information"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48267, "text": "SDK Name: Google Android System Control SDK Company Name: Google LLC SDK official website: https://policies.google.cn/ Objective: The type/field of personal information developed and collected by APP component: Equipment information, network information, log information", "label": ["Third Party Sharing/ Disclosure", "First Party Collection Information"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48268, "text": "SDK Name: UC Woodpecker Company Name: Guangzhou Motion Scenic Computer Technology Co., Ltd.Field: Equipment information, network information, log information", "label": ["Third Party Sharing/ Disclosure", "First Party Collection Information"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48269, "text": "SDK Name: Qihoo 360 Reinforcement Company Name: Beijing Qihoo 360 Technology Co., Ltd.Type/field: Equipment information, network information, log information", "label": ["Third Party Sharing/ Disclosure", "First Party Collection Information"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48270, "text": "SDK Name: Move One -click Login Company Name: Maiwai Internet Co., Ltd.(IMSI), network information (network type, network address)", "label": ["Third Party Sharing/ Disclosure", "First Party Collection Information"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48271, "text": "SDK Name: Unicom One -click Login Company Name: China United Network Communication Co., Ltd. SDK official website: https://onlinebusice.10010.com/product/5302?", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48272, "text": "CHNL = NONE Objectives: Provide the type/field of personal information collected by the mobile phone number to be collected: device recognition information (IMSI), network information (network type, network address)", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48273, "text": "SDK Name: Telecom One -click Login Company Name: Century Long Information Network Co., Ltd. SDK official website: http://id.189.cn/api?", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48274, "text": "Initialsrc =/html/api_detail_634.html Objective: Provide the type/field of personal information collected by the mobile phone number to be collected: device recognition information (IMSI), network information (network type, network address)", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48275, "text": "5. Third -party software or technology.", "label": [], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48276, "text": "In order to make you use our products normally, we may use third -party software or technologies. Third -party software or technology may collect your device information (the software and hardware feature information of the only device identifier).", "label": ["Important", "First Party Collection Information"], "rewrite": "We may use third -party software or technologies, third -party software or technology may collect your device information (the software and hardware feature information of the only device identifier)."}
{"task": "rw_32.jsonl", "id": 48277, "text": "(2) Transfer", "label": [], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48278, "text": "We will not transfer your personal information to any company, organization and individual, except the following situations: except:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not transfer your personal information to any company, organization and individual, except the following situations: except:"}
{"task": "rw_32.jsonl", "id": 48279, "text": "1.Transfer when obtaining clear consent: After getting your clear consent, we will transfer your personal information to other parties;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After getting your clear consent, we will transfer your personal information to other parties."}
{"task": "rw_32.jsonl", "id": 48280, "text": "2.When the company has a merger, acquisition or bankruptcy liquidation situation, or other cases involving mergers, acquisitions or bankruptcy liquidation, if you involve personal information transfer, we will require new companies that hold your personal information and organizations to continue to be subject to this policy.Restrictions, otherwise we will ask the company, organization, and individuals to reconcile your authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If it involves the transfer of personal information, we will require new companies and organizations that hold your personal information to continue to be subject to this policy. Otherwise, we will ask the company, organization and individual to reconcile your authorization consent."}
{"task": "rw_32.jsonl", "id": 48281, "text": "(3) Public disclosure", "label": [], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48282, "text": "We will only disclose your personal information only under the following circumstances and adopt the premise of the industry standards:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will disclose your personal information only in the following circumstances:"}
{"task": "rw_32.jsonl", "id": 48283, "text": "1.According to your needs, disclose your personal information you specified under your clear consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "According to your needs, disclose your personal information you specified under the disclosure of your clear consent."}
{"task": "rw_32.jsonl", "id": 48284, "text": "2.In accordance with the requirements of laws and regulations, mandatory administrative law enforcement or judicial requirements that must provide your personal information, we may disclose your personal information according to the types and disclosure methods required.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In accordance with the requirements of laws and regulations, mandatory administrative law enforcement or judicial requirements that must provide your personal information, we may disclose your personal information according to the types and disclosure methods required."}
{"task": "rw_32.jsonl", "id": 48285, "text": "Under the premise of compliance with laws and regulations, when we receive a request for the above disclosure information, we ask we must issue corresponding legal documents such as tickets or investigation letters.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Under the premise of compliance with laws and regulations, when we receive a request for the above disclosure information, we ask we must issue corresponding legal documents such as tickets or investigation letters."}
{"task": "rw_32.jsonl", "id": 48286, "text": "We firmly believe that for the information requested by us, it should be as transparent as much as possible within the scope of law.", "label": [], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48287, "text": "We will conduct a cautious review of all requests to ensure that it has a legitimate basis, and it is limited to data obtained by law enforcement agencies because of specific investigations and legitimate rights.", "label": ["Third Party Sharing/ Disclosure", "Data Security"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48288, "text": "(4) Sharing, transfer, and disclose personal information.", "label": [], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48289, "text": "According to the relevant laws and regulations, in the following circumstances, sharing, transfer, and publicly disclose your personal information without obtaining your authorization consent in advance:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the following circumstances, sharing, transfer, and publicly disclose your personal information without obtaining your authorization consent in advance:"}
{"task": "rw_32.jsonl", "id": 48290, "text": "a. Directly related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Personal information directly related to national security and national defense security does not need to solicit consent."}
{"task": "rw_32.jsonl", "id": 48291, "text": "b. It is directly related to public safety, public health, and major public interests;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Personal information directly related to public safety, public health, and direct public interests does not need to solicit consent."}
{"task": "rw_32.jsonl", "id": 48292, "text": "c. It is related to criminal investigation, prosecution, trial and judgment execution;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Personal information related to sharing with crime investigation, prosecution, trial, and judgment implementation does not need to solicit consent."}
{"task": "rw_32.jsonl", "id": 48293, "text": "e. The personal information collected was made to the public to the public;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The collected personal information is made by the subject of the personal information to the public by themselves without asking for consent."}
{"task": "rw_32.jsonl", "id": 48294, "text": "f. Other laws and regulations and other conditions.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48295, "text": "According to the law, the personal information of sharing and transferred the identification processing, and ensure that the data receiver cannot restore and re -identify the subject of personal information, which does not belong to the external sharing, transfer and public disclosure of personal information.Save and processing will not be notified to you separately and obtain your consent.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48296, "text": "4. How do we protect and save your personal information", "label": [], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48297, "text": "(1) Technical protection:", "label": [], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48298, "text": "In order to ensure your information security, we strive to take a variety of reasonable physical, electronics and management security measures that meet industry standards to protect your information, so that your information will not be leaked, damaged or lostSSL, information encryption storage, data center access control.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48299, "text": "We will use encryption technology to improve the security of personal information;", "label": ["Data Security"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48300, "text": "We will use a trusted protection mechanism to prevent personal information from being maliciously attacked;", "label": ["Data Security"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48301, "text": "We will deploy the access control mechanism to make every effort to ensure that only authorized personnel can access personal information.", "label": ["Important", "Data Security"], "rewrite": "We will deploy the access control mechanism to make every effort to ensure that only authorized personnel can access personal information."}
{"task": "rw_32.jsonl", "id": 48302, "text": "(2) Security system guarantee:", "label": [], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48303, "text": "We have the industry's advanced data security management system based on data -centered data and data security management systems around the data life cycle. From the aspects of organizational construction, system design, personnel management, product technology, and personal information security impact assessment, the security of the entire system is improved.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48304, "text": "At present, we have passed the third -level certification of information security level.", "label": ["Important", "Data Security"], "rewrite": "We have passed the third -level certification of information security level."}
{"task": "rw_32.jsonl", "id": 48305, "text": "(3) Personnel safety management:", "label": [], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48306, "text": "We have also adopted strict management of employees or outsourcing personnel who may contact you, including but not limited to adopting different permissions control according to different jobs, signing confidentiality agreements with them, monitoring their operations.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48307, "text": "We will provide corresponding security measures according to existing technologies to protect your information and provide reasonable security guarantees. We will try our best to make your information not be leaked, damaged or lost.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48308, "text": "We will organize safety and privacy protection training courses to strengthen employees' awareness of protecting the importance of personal information.", "label": ["Important", "Data Security"], "rewrite": "We will organize safety and privacy protection training courses to strengthen employees' awareness of protecting the importance of personal information."}
{"task": "rw_32.jsonl", "id": 48309, "text": "(4) Sensitive information and password protection tips:", "label": [], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48310, "text": "1. Personal sensitive information protection: You voluntarily shared or even publicly shared information when using our service may involve personal information of you or others and even personal sensitive information.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48311, "text": "Please consider whether to share or even publicly share relevant information when using our services.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48312, "text": "2. Please use complex passwords to help us guarantee your account security.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48313, "text": "We will try our best to ensure the security of any information you send to us.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48314, "text": "If our physical, technical, or management protection facilities are damaged, the information is caused by unauthorized access, public disclosure, tampering or destruction, which will cause your legitimate rights and interests to be damaged, and we will bear the corresponding legal responsibility.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48315, "text": "3. Your account has a security protection function, please keep your account and password information properly.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48316, "text": "We will ensure that your information is not lost and will not be abused and altered by backup security measures such as backup and encryption of user passwords.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48317, "text": "Although there are aforementioned security measures, please also understand that there are no \"perfect security measures\" on the information network.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48318, "text": "4. Information disclosure prompts and password leak processing: Please pay attention to the Internet is not an absolutely secure environment.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48319, "text": "We will try our best to ensure the security of any information you send to us.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48320, "text": "Please protect your personal information properly and provide them with others only.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48321, "text": "If you find your personal information leakage, especially your account and password leak, please contact our customer service immediately so that we can take corresponding measures.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48322, "text": "(5) Information security incident processing", "label": [], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48323, "text": "After unfortunately a personal information security incident, we will inform you in accordance with the requirements of the laws and regulations: the basic situation and possible impact of the security incident, the disposal measures we have taken or we will take, the suggestions that you can prevent and reduce the risk,Remedy for your remedy.", "label": ["Important", "Data Security"], "rewrite": "After unfortunately a personal information security incident, we will inform you in accordance with the requirements of the laws and regulations: basic situations and possible impacts, we have taken or or that we will take, you can self -prevent and reduce risk suggestions, to your risks, to youRemedy measures, etc."}
{"task": "rw_32.jsonl", "id": 48324, "text": "In the event related to the incident, we will inform you in the form of mail, letter, telephone, push notification, etc. When it is difficult to inform the subject of personal information one by one, we will publish an announcement in a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "In the event related to the incident, we will inform you in the form of mail, letter, telephone, push notification, etc. When it is difficult to inform the subject of personal information one by one, we will publish an announcement in a reasonable and effective way."}
{"task": "rw_32.jsonl", "id": 48325, "text": "At the same time, we will also report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "We will also report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities."}
{"task": "rw_32.jsonl", "id": 48326, "text": "(6) How do we save your personal information:", "label": [], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48327, "text": "1.Storage location: The company will store and generate personal information collected and generated during the domestic operations in accordance with the provisions of laws and regulations.", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated during the domestic operation process is stored in the territory of the People's Republic of China, and such information will not be transmitted overseas."}
{"task": "rw_32.jsonl", "id": 48328, "text": "If the company needs to be transmitted overseas due to business development, it will clearly inform and obtain your consent.", "label": ["Data Retention", "Important"], "rewrite": "If the company needs to be transmitted overseas due to business development, it will clearly inform and obtain your consent."}
{"task": "rw_32.jsonl", "id": 48329, "text": "2.Storage period: We will take reasonable and feasible measures to avoid collecting unrelated personal information.", "label": ["Data Retention", "Important"], "rewrite": "We will take reasonable and feasible measures to avoid collecting unrelated personal information."}
{"task": "rw_32.jsonl", "id": 48330, "text": "We will only retain your personal information within the shortest period of the purpose of the cost of reaching the cost policy, unless you agree to extend the retention period or be permitted by law.", "label": ["Data Retention", "Important"], "rewrite": "We will only retain your personal information within the shortest period of the purpose of the cost of reaching the cost policy, unless you agree to extend the retention period or be permitted by law."}
{"task": "rw_32.jsonl", "id": 48331, "text": "After exceeding the storage period, we will delete your personal information or take technical measures for anonymized processing, except for other provisions of laws and regulations.", "label": ["Data Retention", "Important"], "rewrite": "After exceeding the storage period, we will delete your personal information or take technical measures for anonymized processing, except for other provisions of laws and regulations."}
{"task": "rw_32.jsonl", "id": 48332, "text": "5. Your rights", "label": [], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48333, "text": "1. We always put the protection of user information first, and you have the right to update or correct your information independently.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48334, "text": "Before your information update is corrected, in order to protect the security of the account and ensure that the update is corrected for your own operation, we will first verify your identity, and then we can update and correct the information.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48335, "text": "2. You can apply for a cancellation of your account through [Settings/Mine-User Center-Logging out account]. To ensure that the user or user authorizes the application of the account, we will collect and verify the personal identity information of the user and the applicant.Do your best to protect the rights and interests of users.", "label": ["Important", "First Party Collection Information", "Edit/Control"], "rewrite": ". You can apply for a cancellation of your account through [Settings/Mine-User Center-Logging out account]. To ensure that the user or user authorizes the application of the account, we will collect and verify the personal identity information of the user and the applicant, and do our best to do our best.Maximum efforts to protect the rights of users."}
{"task": "rw_32.jsonl", "id": 48336, "text": "We strictly abide by the provisions of the protection of personal information on law and administrative regulations. The above information is only used for the cancellation business of this account.", "label": ["Usage"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48337, "text": "We specially remind you that your behavior of canceling your account is irreversible behavior. Once you log out your account, the platform will delete or anonymous information about your account. At the same time, you cannot obtain the APP service through the cancellation account.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48338, "text": "3. Complaint report and response", "label": [], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48339, "text": "When you have other complaints, suggestions, or related issues, please contact us through [Settings/Mine-contact customer service].", "label": ["Important", "Contact Information"], "rewrite": "When you have other complaints, suggestions, or related issues, please contact us through [Settings/Mine-contact customer service]."}
{"task": "rw_32.jsonl", "id": 48340, "text": "We will review the issues involved as soon as possible and reply to your user in time after verifying your user identity. Generally, we will reply to your question within 15 working days.", "label": [], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48341, "text": "4. Visit Privacy Protection Policy", "label": [], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48342, "text": "When you register your account for the first time, we will prompt you to the privacy protection policy and make your own decision by your choice. In addition, you can log in to your personal account in the mobile application and] Check all the content of this privacy protection policy at any time.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48343, "text": "5. I have the right to obtain a notice of stopping operation", "label": ["Cessation of Operations"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48344, "text": "If we terminate our services or operations, we will issue a notice to you at least 30 days in advance, and delete or anonymous processing of your personal information after the termination of the service or operation.", "label": ["Important", "Cessation of Operations"], "rewrite": "If we terminate our services or operations, we will issue a notice to you at least 30 days in advance, and delete or anonymous processing of your personal information after the termination of the service or operation."}
{"task": "rw_32.jsonl", "id": 48345, "text": "6. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48346, "text": "We attach importance to the protection of personal information of minors. In the process of using our service, we presume that you have the corresponding civil behavior capabilities.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48347, "text": "If you are a minor under the age of 18, before you use related services, you should read and agree with your parents or other guardians under the supervision and guidance of your parents or guardians.Under the premise of consent, use our services or provide information to us.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a minor under the age of 18, before you use related services, you should read and agree with your parents or other guardians under the supervision and guidance of your parents or guardians.Under the premise of consent, use our services or provide information to us."}
{"task": "rw_32.jsonl", "id": 48348, "text": "For the case where parents or guardians agree to use our products or services to collect personal information of minors, we will only use, share, transfer, transfer, transfer, transfer, transfer, transfer, and transfer they are clearly agreed or protected by laws or guardians.Or disclose this information.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Usage", "Important"], "rewrite": "We will only use, share, transfer, or disclose this information if the laws and regulations are allowed, parents or guardians to clearly agree or protect minors."}
{"task": "rw_32.jsonl", "id": 48349, "text": "If we find the personal information of minors without obtaining proven parents in advance, we will try to delete relevant information as soon as possible.", "label": ["Specific Audiences", "Important"], "rewrite": "If we find the personal information of minors without obtaining proven parents in advance, we will try to delete relevant information as soon as possible."}
{"task": "rw_32.jsonl", "id": 48350, "text": "7. How to update the privacy protection policy", "label": [], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48351, "text": "(1) The company may amend the privacy protection policy in a timely manner. Without your clear consent, we will not reduce the rights you should enjoy in accordance with the privacy protection policy.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48352, "text": "(2) After the privacy protection policy is updated, it will show you the change of privacy protection policies after login and version update, so that you can understand the latest privacy protection policy in a timely manner, so that you can timely understand the latest privacy protection policy.Version.", "label": ["Policy Change", "Important"], "rewrite": "After the privacy protection policy is updated, you will show you the change of privacy protection policies after you log in and version update."}
{"task": "rw_32.jsonl", "id": 48353, "text": "If you continue to use our services, you agree to accept the content of the privacy protection policy after the revision, but if the updated content needs to collect video, obtain address book, contact information, geographical location and other personal sensitive information, it will still show again Fight for your consent.", "label": ["Policy Change", "Important"], "rewrite": "If you continue to use our services, you agree to accept the content of the privacy protection policy after the revision, but if the updated content needs to collect video, obtain address book, contact information, geographical location and other personal sensitive information, it will still show again Fight for your consent."}
{"task": "rw_32.jsonl", "id": 48354, "text": "(3) For major changes, we will also provide more significant notifications (we will use the method of including but not limited to SMS, private messages, and special prompts on the login page to explain the specific changes of privacy protection policies. Content).", "label": ["Policy Change", "Important"], "rewrite": "For major changes, we will also provide a more significant notice."}
{"task": "rw_32.jsonl", "id": 48355, "text": "We will also archive the old version of this strategy for you to check.", "label": ["Policy Change", "Important"], "rewrite": "We will also archive the old version of this strategy for you to check."}
{"task": "rw_32.jsonl", "id": 48356, "text": "The major changes referred to the privacy protection policy include, but not limited to:", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48357, "text": "1.Our service model has changed significantly.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48358, "text": "Such as the purpose of handling personal information, the type of personal information of the processing, the way of use of personal information, etc.;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48359, "text": "2.We have changed significantly in the aspects of ownership structure and organizational structure.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48360, "text": "Such as all changes caused by business adjustment, bankruptcy mergers and acquisitions, etc.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48361, "text": "3.The main object of personal information sharing, transfer or public disclosure changes;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48362, "text": "4.You participated in the right of personal information processing and its exercise methods have undergone major changes;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48363, "text": "5.When we are responsible for handling the responsibility departments, contact methods and complaint channels of personal information security;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48364, "text": "6.The personal information security impact assessment report shows that there is a high risk.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48365, "text": "8. How to contact us", "label": [], "rewrite": []}
{"task": "rw_32.jsonl", "id": 48366, "text": "If you have any questions, opinions or suggestions on this privacy protection policy or app, you can contact us through junzi1324487@163.com [contact customer service] in the email or app, and leave the relevant information about the app. We will review as soon as possibleIn the problem, we will reply to timely after verifying your user identity.", "label": ["Important", "Contact Information"], "rewrite": "You can contact us through junzi1324487@163.com email or app [contact customer service]."}
{"task": "rw_32.jsonl", "id": 48367, "text": "Under normal circumstances, we will reply to your request within seven working days.", "label": ["Important", "Contact Information"], "rewrite": "Under normal circumstances, we will reply to your request within seven working days."}
{"task": "rw_32.jsonl", "id": 48368, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
