{"task": "rw_33.jsonl", "id": 48369, "text": "Operations to help user privacy policies", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48370, "text": "Effective date: August 25, 2022", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48371, "text": "Update date: August 25, 2022", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48372, "text": "Guangzhou Xiaolan Gang Network Technology Co., Ltd. (hereinafter referred to as \"we\" or \"company\") respects and protects user privacy. When your service uses the service provided by the APP platform (hereinafter referred to as the \"Assignment Gang\"), we will not be in accordance with the operation of \"homeworkIn addition to providing you with the agreement of helping the User Service Agreement, we will also follow the principles of legitimate, correct, and necessary in accordance with the \"Operation Help User Privacy Policy\" (hereinafter referred to as the \"Privacy Policy\") to publicize and use your individuals.information.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48373, "text": "Please read all the terms of this privacy policy carefully so that you can understand the purpose, scope, method of using your personal information, and the purpose of using your personal information.", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48374, "text": "If you are a child, please review this privacy policy with the legal guardian. After reviewing and agreeing with the legal guardian, you can use the job to help and provide personal information to the job.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48375, "text": "If you or the guardian do not agree with any content of the privacy policy, you should immediately stop using the operation to help the product or service.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48376, "text": "When you use any service provided by your assignment, you have agreed that we have agreed to collect, use, store and protect your relevant information in accordance with this privacy policy.", "label": ["Policy Change", "Important"], "rewrite": "When you use any service provided by your homework, you have agreed to this privacy policy."}
{"task": "rw_33.jsonl", "id": 48377, "text": "We know the importance of personal information to you, and we will do our best to protect your personal information security and reliable.", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48378, "text": "We are committed to maintaining your trust in us, abiding by the following principles, and protecting your personal information: the principles of consistency and responsibility, the principles of clear purpose, the principles of consent, the principle of minimum necessary necessary, the principles of safety, the principles of subject participation, and the principle of openness and transparency.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48379, "text": "At the same time, we promise that we will take corresponding security protection measures to protect your personal information in accordance with the mature safety standards of the industry.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48380, "text": "This privacy policy will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48381, "text": "1. Scope of application", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48382, "text": "2. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48383, "text": "3. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48384, "text": "4. How do we share, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48385, "text": "Fifth, how do you manage your information and accounts for cancellation", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48386, "text": "6. How do we store your personal information", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48387, "text": "7. How do we protect your personal information", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48388, "text": "8. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48389, "text": "Nine, the revision of this policy", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48390, "text": "10. Controversy jurisdiction", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48391, "text": "Eleven, contact us", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48392, "text": "1. Scope of application", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48393, "text": "1. This privacy policy is suitable for all services provided by some specific products and services.", "label": ["Important"], "rewrite": "This privacy policy is suitable for all services provided by some specific products and services."}
{"task": "rw_33.jsonl", "id": 48394, "text": "These specific products and services will apply specific privacy policies.", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48395, "text": "2. It is necessary to specifically explain that this privacy policy is not applicable to the services you provided by the third direction of the third -party sharing information with the third -party sharing information except Article 4 of the privacy policy.", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48396, "text": "Please know: If you provide personal information to them when you browse third -party websites or use third -party products and services, your information should apply the third -party privacy policy. We will not bear any legal responsibilities. Please read it carefully.The third party's privacy policy is confirmed whether it is acceptable.", "label": ["Important"], "rewrite": "If you provide personal information to it when you browse third -party websites or use third -party products and services, your information should apply the third -party privacy policy."}
{"task": "rw_33.jsonl", "id": 48397, "text": "2. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48398, "text": "Personal information refers to a variety of information that can identify specific natural persons or reflects the activity of specific natural persons in a single or other information with other information.", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48399, "text": "Personal sensitive information refers to personal information that once leaked, illegally provided or abuses the security of people and property, and it is easy to lead to personal information such as personal reputation, physical and mental health damage or discrimination.", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48400, "text": "Under normal circumstances, the personal information of children under the age of 14 is personal sensitive information.", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48401, "text": "The products and services we provide need to rely on some of your information to run. ThereforeBetter services, based on different business functions, we divide the types of personal information that we collect and use into two types: one is the information necessary for realizing the basic business functions of products and services. Such information is necessary personal information.If you refuse to provide, we will not be able to provide you with the basic business functions and corresponding services;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect information necessary for the basic business functions of products and services."}
{"task": "rw_33.jsonl", "id": 48402, "text": "The second is to expand the information that the business function may need to be collected. You can choose whether to provide or authorize us to collect it. We will process these personal information based on your authorization consent or realize your choice of extended business functions.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the information you choose to provide for extended business functions."}
{"task": "rw_33.jsonl", "id": 48403, "text": "If you refuse to provide it, we will not be able to provide you with expanded business functions, but it will not affect your basic business functions.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48404, "text": "1. We will collect and use your personal information based on the goals in the following scene:", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48405, "text": "1.1 Register Login", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48406, "text": "Register Login: When you register and log in to the assignment account, you can create a user through the mobile phone number. We will verify your identity by sending the SMS verification code, or you can register and log in through the mobile phone number and password. We collect your collection of youMobile phone numbers and passwords (such as use) are used to provide you with a registration login service.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you register and log in to the assignment account, collect your mobile phone number and password (such as) to provide you with a registration login service."}
{"task": "rw_33.jsonl", "id": 48407, "text": "One -click login: We cooperate with telecom operators to provide you with a \"one -click login\" function. When you use this function, after your consent, the operator will send us the mobile phone number in your device.Your registration, login account and free password or dynamic verification code verification to provide you with fast registration and login service.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the \"One -click login\" function, collect your mobile phone number to provide you with fast registration and login service."}
{"task": "rw_33.jsonl", "id": 48408, "text": "Authorized login: The assignment helper supports the use of third -party accounts (WeChat, QQ) registration and login. If you log in with a third -party platform account, you must authorize us to obtain your information on the third -party platform (avatar, nickname and other public information and your authorization.Give other information) to generate the assignments bound to the third -party account, so that you can register, log in and use the assignment and related services.", "label": ["Important", "First Party Collection Information"], "rewrite": "When registering and logging in with a third -party account, access and collect your personal information after your authorization, and bind it."}
{"task": "rw_33.jsonl", "id": 48409, "text": "After you agree to authorize, we also need to re -verify and bind your mobile phone number to confirm the authenticity and merger of the third -party account.", "label": ["Important", "First Party Collection Information"], "rewrite": "After you agree with authorization, re -verify and bind your mobile phone number to confirm the authenticity and merger of the third -party account."}
{"task": "rw_33.jsonl", "id": 48410, "text": "If you do not provide any information required by any of the above login methods, you will only browse and understand the assignment gang, and you cannot enjoy related services;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48411, "text": "If you only need to use browsing and understand the assignment gang, you don't need to register as our users and provide the above information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Only by using browsing and understanding of the assignment gangs, you do not need to register as a user and provide information."}
{"task": "rw_33.jsonl", "id": 48412, "text": "1.2 Real -name authentication", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48413, "text": "1.2.1, the search answer function only supports use in the parent/teacher mode. If you need to use this function, you need to authenticate your identity. We need to provide the name and ID number to verify your identity. The parent/teacher mode isThe choice can be carried out in \"Operations APP-My-Model Switching\", \"Operations ApP-Searching Answers-Taking the Results Page to View Search Results\".", "label": ["Important", "First Party Collection Information"], "rewrite": "Using the search answer function, you need to verify your identity through your name and ID number."}
{"task": "rw_33.jsonl", "id": 48414, "text": "If you do not need to search for questions, you can do not perform real -name authentication, and will not affect your other functions and services using this product.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48415, "text": "1.2.2, if you need to withdraw orders for refunds (only when we cannot complete the refund through the original payment channel) or need to withdraw user cash withdrawal, in order to protect your fundsCertificate number (real -name authentication) to verify your identity. If it is not provided, it will not affect other functions and services of your product.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you need to withdraw the order refund or withdraw the user cash back, you need to provide your name and ID number to verify your identity."}
{"task": "rw_33.jsonl", "id": 48416, "text": "1.3 Account Basic Information", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48417, "text": "After the account is registered and logged in, you can choose to fill in the name or nickname, gender, personal profile, grade, class, school, upload your avatar, upload your avatar, you need to get your camera or album permissions. Choose a school to obtain your location information to be used for your location information for use for your location information for it for use for your location information to be used for use for it for your location information to be used for use for your location information to be used for it for use for your location.Interactive, proper courses, and matching nearby schools. If you do not want to receive recommended courses, you can set up in the \"Operation APP-Me-Settings-System Settings\".", "label": ["Important", "First Party Collection Information"], "rewrite": "You can choose to fill in the name or nickname, gender, personal profile, grade, class, school, upload your avatars, upload your avatars, you need to obtain camera or album permissions, select school information to obtain location information, you can in the \"operation help app-me-setting-system-system-systemTurn off the course recommendation in \"Settings."}
{"task": "rw_33.jsonl", "id": 48418, "text": "You can fill in your QQ information at the \"Work-Help App-Settings-Account and Security-My QQ\" to distribute virtual rewards and push online activities to you.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can fill in the QQ information at the \"Operation APP-Me-Settings-Account and Security-My QQ\" to distribute virtual rewards and push online activities."}
{"task": "rw_33.jsonl", "id": 48419, "text": "You can choose whether to provide the above information according to whether the above service is required;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48420, "text": "If it is not provided, it will not affect your other functions and services of this product.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48421, "text": "1.4 Normal operation, network and operational security of basic functions", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48422, "text": "1.4.1, when you first open the job help APP, after obtaining your authorization, we will receive and record the device -related information you use, including the international mobile device identification code (IMEI, IMSI), serial number, and unique deviceThe identifier (Android_id may be obtained multiple times), the MAC address of WIFI hotspot, OAID (where you use Huawei mobile phones, collect OAID information to achieve Huawei HMS, Core, APP), MAC address, IP address, system version version, system version, System language, boot time, operator, national code, mobile phone brand, mobile phone model, memory size, CPU type, hard disk size, default input method, default browser, advertising logo information, screen size, system update time, equipment version, equipment version, Mobile phone style to verify whether your device is a legal device, conduct a security check to ensure your account and transaction security.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you first open the job help app, after obtaining your authorization, we will receive and record the device -related information you use, and perform a security verification."}
{"task": "rw_33.jsonl", "id": 48423, "text": "1.4.2, when you first use the opening of the job to help the app, we will read your mobile phone status after you authorize to ensure the normal use of the operation to help the APP application service, more accurate positioning and solving the encounter during use in use.The problems you have, improve and optimize the operation to help the APP service experience, and ensure your account security.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "When you first use the operation to help the APP, we will read your reading mobile phone status after you authorize to ensure the normal use of the service and ensure account security."}
{"task": "rw_33.jsonl", "id": 48424, "text": "1.4.3, when you open and use the job to help the app, we will use your, WIFI information and SSID information to obtain network status information to judge network changes and complete network positioning functions.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you open and use your job to help the app, use your WiFi information and SSID information to obtain network status information."}
{"task": "rw_33.jsonl", "id": 48425, "text": "1.4.4, for performance detection and user logo for your device, when the operation help app runs in the background, the job help app may read your relevant information again, including: MAC address, task list, Wi-Fi informationWe will control the frequency of reading within a reasonable range.", "label": ["Important", "First Party Collection Information"], "rewrite": "When the operation help app runs in the background, the job help app may read your relevant information."}
{"task": "rw_33.jsonl", "id": 48426, "text": "1.5 Purchase goods, recharge services to order and delivery", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48427, "text": "1.5.1, when you buy specific products and/or services, and recharge in the job help APP, to show you the transaction information of the account and ensure the security of the transaction., Collect your specific order number, order creation time, and transaction amount information for you to display and facilitate your transaction management of orders.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you buy specific products,/or services, and recharge, collect your specific order number, order creation time, and transaction amount information for you to display and facilitate transaction management."}
{"task": "rw_33.jsonl", "id": 48428, "text": "If you buy the auxiliary information attached to the product or course that you need to mail or course, in the process of placement, we also need to provide you with the name of the recipient's name, receiving address, and contact phone call information so that we can deliver the goods to you;", "label": ["Important", "First Party Collection Information"], "rewrite": "If you buy a product you need to mail, we also need you to provide the recipient's name, receiving address, and contact phone call information."}
{"task": "rw_33.jsonl", "id": 48429, "text": "The recharge records, transactions and consumption records are sensitive personal information. Collecting such information is necessary to achieve consumption functions, otherwise the transaction will not be completed.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48430, "text": "1.5.2, after your successful place, such as the provided or product/service of a third -party merchant in the product/service department requires a third -party distribution to complete the delivery and delivery of goods/services to you. Third -party merchants and logistics service providers cannotAvoid knowing your consignee information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After you successfully place an order, share your consignee information to third -party merchants and logistics service providers to complete the distribution and delivery."}
{"task": "rw_33.jsonl", "id": 48431, "text": "We promise that we will ensure your personal information security with the greatest efforts, strictly require merchants and third -party distribution companies to keep your personal information confidential, and only learn and use only the purpose of delivery and distribution.Essence", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will require merchants and third -party distribution companies to keep your personal information confidential and not be used for other purposes."}
{"task": "rw_33.jsonl", "id": 48432, "text": "At the same time, in order to provide you with the purpose of after -sales and dispute solutions, we may need to learn and confirm the delivery progress and status in a timely manner. You agree that we can collect information related to the delivery progress from the aforementioned subject.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect information related to delivery progress, thinking that it will provide you with after -sales and dispute solutions."}
{"task": "rw_33.jsonl", "id": 48433, "text": "1.6 Market activity", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48434, "text": "When you participate in our related marketing activities, we may collect your name, communication address, phone number, and even your real -name certification through the operating activity interface;", "label": ["Important", "First Party Collection Information"], "rewrite": "When you participate in marketing activities, collect your name, communication address, and phone number."}
{"task": "rw_33.jsonl", "id": 48435, "text": "In order to get in touch with you, send operation rewards to you.", "label": ["Usage"], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48436, "text": "If you do not participate in related operating activities, you do not need to provide the aforementioned information, and will not affect other functions and services of your product.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48437, "text": "1.7 Customer service", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48438, "text": "When you contact us, if you use the online customer service function, you need to obtain your microphone (recording) permissions, and the screen is often on, thinking that you provide customer service.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you use the online customer service function, you need to obtain your microphone (recording) permissions, and the screen is often on."}
{"task": "rw_33.jsonl", "id": 48439, "text": "We may save your communication or call records and content or the contact information you leave in order to help you solve the problem or record the processing plan and results of related issues.", "label": ["Important", "First Party Collection Information"], "rewrite": "Save your communication or call records and content or contact information you leave in order to help you solve the problem, or record the processing plan and results."}
{"task": "rw_33.jsonl", "id": 48440, "text": "Our customer service will use your account information to verify your identity with you.", "label": ["Important", "First Party Collection Information"], "rewrite": "Customer service will use your account information to verify your identity with you."}
{"task": "rw_33.jsonl", "id": 48441, "text": "You may provide other information outside of the above information when communicating with our customer service staff.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48442, "text": "If it is not provided, it will not affect your other functions and services of this product.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48443, "text": "1.8 The permissions required for business functions", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48444, "text": "1.8.1, based on the implementation of business functions, each business function may collect your system permissions, as follows:", "label": ["Permission Acquisition", "Important"], "rewrite": "Based on the implementation of business functions, each business function may collect your system permissions, as follows:"}
{"task": "rw_33.jsonl", "id": 48445, "text": "1.8.1.1 Basic business functions:", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48446, "text": "Search answer: When you use search answering services, obtain your storage / (and album) permissions for the use of search answering functions to select questions from the album;", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use search for questioning services, get your storage / (and album) permissions."}
{"task": "rw_33.jsonl", "id": 48447, "text": "Get your geographical location permissions (whereabouts) in order to more accurately provide search and matching the practice questions of nearby schools and regions. If you do not authorize the location authority of the address, we will show you the possible correlated cities based on the IP address.Content or service;", "label": ["Permission Acquisition", "Important"], "rewrite": "Get your geographical location permissions (trajectory) in order to provide search and matching the practice questions of nearby schools and the region, otherwise it will be displayed based on cities corresponding to IP addresses."}
{"task": "rw_33.jsonl", "id": 48448, "text": "Get your camera (camera) permissions for using image recognition services and search services;", "label": ["Permission Acquisition", "Important"], "rewrite": "Get your camera (camera) permissions for using image recognition services and search services."}
{"task": "rw_33.jsonl", "id": 48449, "text": "Get your recording/audio permissions and use voice to search for questions;", "label": ["Permission Acquisition", "Important"], "rewrite": "Get your recording/audio permissions and use voice to search for questions."}
{"task": "rw_33.jsonl", "id": 48450, "text": "After searching for questions, when using the printing function, obtain your Bluetooth permissions for linking the connection of Bluetooth device and Bluetooth device.", "label": ["Permission Acquisition", "Important"], "rewrite": "When using the printing function, get your Bluetooth permissions."}
{"task": "rw_33.jsonl", "id": 48451, "text": "Job correction: When you use your job correction function, obtain your storage / (and albums) permissions, and choose the content you need to correct from the album when using the work correction function.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use your job correction function, obtain your storage / (and album) permissions for selection of content to be corrected from the album."}
{"task": "rw_33.jsonl", "id": 48452, "text": "Live lesson: When you use the live broadcast function, choose the grade area, obtain your geographical location permissions (trajectory) in order to match the learning materials and courses more accurately.The corresponding city shows you possible content or services;", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use the live course function, get your geographical location permissions in order to match learning materials and courses."}
{"task": "rw_33.jsonl", "id": 48453, "text": "When entering the live classroom for the first time, obtain your camera (camera) permissions for teachers and students in the class, take photos in, and video class;", "label": ["Permission Acquisition", "Important"], "rewrite": "When entering the live classroom for the first time, you can obtain your camera (camera) permissions for teachers and students in the class, take photos in, and videos."}
{"task": "rw_33.jsonl", "id": 48454, "text": "During the class in the live broadcast room, obtain your recording/audio permissions for online class interactive and wheat services, voice answers;", "label": ["Permission Acquisition", "Important"], "rewrite": "During the live broadcast room, you can obtain your recording/audio permissions for online class interactive wheat services and voice answers."}
{"task": "rw_33.jsonl", "id": 48455, "text": "When the course is played, you can download the course on the course homepage. You need to obtain your storage / (and albums) permissions in order to facilitate your back to the course.", "label": ["Permission Acquisition", "Important"], "rewrite": "You need to obtain your storage / (and albums) permissions in order for you to return the course."}
{"task": "rw_33.jsonl", "id": 48456, "text": "VIP: We provide learning reporting services and test paper download services for VIP members, which require your storage / (and album) permissions to provide a learning report service and test paper download;", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48457, "text": "When using the printing function, obtain your Bluetooth permissions for linking the connection of Bluetooth device and Bluetooth device.", "label": ["Permission Acquisition", "Important"], "rewrite": "When using the printing function, obtain your Bluetooth permissions for linking the connection of Bluetooth device and Bluetooth device."}
{"task": "rw_33.jsonl", "id": 48458, "text": "Chinese essay: When you post composition in the composition circle-content recommendation, you need to obtain your geographical location permissions (whereabouts) are used to show the relevant content of your location.The corresponding city shows you possible content or services.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you publish composition-content recommendation in the composition circle, you need to obtain your geographical location permissions (whereabouts) are used to prefer the relevant content of your location."}
{"task": "rw_33.jsonl", "id": 48459, "text": "Word query: When taking pictures and taking photos, if you choose the content of translation and words from the album, you need to obtain your storage / (and album) permissions.Get your camera (camera) permissions for you to provide you with camera translation and taking pictures.", "label": ["Permission Acquisition", "Important"], "rewrite": "When taking pictures and taking photos, you need to obtain your storage / (and album) permissions."}
{"task": "rw_33.jsonl", "id": 48460, "text": "Error question book: When recording the wrong question, you need to obtain your camera (camera) permissions for fast enrollment of the question, frame selection of the wrong question;", "label": ["Permission Acquisition", "Important"], "rewrite": "When recording the wrong question, you need to obtain your camera (camera) permissions for fast enrollment of questions and frames."}
{"task": "rw_33.jsonl", "id": 48461, "text": "When downloading the wrong question, you need to obtain your storage / (and album) permissions for saving files or cache information to your mobile phone;", "label": ["Permission Acquisition", "Important"], "rewrite": "When downloading the wrong question, you need to obtain your storage / (and album) permissions for saving files or cache information to your mobile phone."}
{"task": "rw_33.jsonl", "id": 48462, "text": "When using the printing function, obtain your Bluetooth permissions for linking the connection of Bluetooth device and Bluetooth device.", "label": ["Permission Acquisition", "Important"], "rewrite": "When using the printing function, obtain your Bluetooth permissions for linking the connection of Bluetooth device and Bluetooth device."}
{"task": "rw_33.jsonl", "id": 48463, "text": "Test papers: Test papers re -exercise, work beautification, and take a test paper upload picture, download the test paper to check, obtain your storage / (and album) permissions for test papers, work beautification, and upload pictures when taking test papers.The test paper is saved to the cloud for test paper download;", "label": ["Permission Acquisition", "Important"], "rewrite": "Get your storage / (and album) permissions for test papers to re -exercise, work beautification, and upload pictures when taking test papers. The test paper is saved to the cloud for test paper download."}
{"task": "rw_33.jsonl", "id": 48464, "text": "When uploading the test paper, obtain your camera (camera) permissions for test papers to re -exercise, work to beautify, and take the content of the test papers.", "label": ["Permission Acquisition", "Important"], "rewrite": "Get your camera (camera) permissions for test papers to re -exercise, work to beautify, and shoot the content you need when shooting."}
{"task": "rw_33.jsonl", "id": 48465, "text": "Test papers: When selecting grades, obtain your geographical location permissions (trajectory) in order to more accurately match the learning materials and match the test paper service in the region.Display the possible content or service;", "label": ["Permission Acquisition", "Important"], "rewrite": "When choosing grades, get your geographical location permissions (trajectory) in order to more accurately match learning materials and match test paper services in the region."}
{"task": "rw_33.jsonl", "id": 48466, "text": "When using the printing function, obtain your Bluetooth permissions for linking the connection of Bluetooth device and Bluetooth device.", "label": ["Permission Acquisition", "Important"], "rewrite": "When using the printing function, obtain your Bluetooth permissions for linking the connection of Bluetooth device and Bluetooth device."}
{"task": "rw_33.jsonl", "id": 48467, "text": "Fun skipping: Get your camera (video) permissions for skipping counting and checking your skipping posture;", "label": ["Permission Acquisition", "Important"], "rewrite": "Get your camera (video) permissions for rope skipping counting and checking your skipping posture."}
{"task": "rw_33.jsonl", "id": 48468, "text": "Get your microphone (recording) permissions, use to perform auxiliary skipping counts according to the sound skipping sound, and use it to improve and optimize the product's skipping function to better serve you;", "label": ["Permission Acquisition", "Important"], "rewrite": "Get your microphone (recording) permissions for assisted rope -skipping counts according to the sound skipping sound."}
{"task": "rw_33.jsonl", "id": 48469, "text": "Get your storage / (and album) permissions, so that you can save the video content into your mobile phone to understand your own movement, and to improve and optimize the product skipping action identification deep learning framework to better serve you.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "Get your storage / (and album) permissions so that you save the video content to your phone."}
{"task": "rw_33.jsonl", "id": 48470, "text": "Analysis of ancient texts: When using recitation and other functions, obtain your microphone (recording) permissions, modify sound settings permissions, and provide you with recitation recording services;", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "When using functions such as recitation, obtain your microphone (recording) permissions, modify the sound settings permissions, and provide you with recitation recording services."}
{"task": "rw_33.jsonl", "id": 48471, "text": "When using the printing function, obtain your Bluetooth permissions for linking the connection of Bluetooth device and Bluetooth device.", "label": ["Permission Acquisition", "Important"], "rewrite": "When using the printing function, obtain your Bluetooth permissions for linking the connection of Bluetooth device and Bluetooth device."}
{"task": "rw_33.jsonl", "id": 48472, "text": "Back ancient poems: When using recitation and other functions, obtain your microphone (recording) permissions, modify sound settings permissions, and provide you with recitation recording services;", "label": ["Permission Acquisition", "Important"], "rewrite": "When using functions such as recitation, obtain your microphone (recording) permissions, modify the sound settings permissions, and provide you with recitation recording services."}
{"task": "rw_33.jsonl", "id": 48473, "text": "When using the printing function, obtain your Bluetooth permissions for linking the connection of Bluetooth device and Bluetooth device.", "label": ["Permission Acquisition", "Important"], "rewrite": "When using the printing function, obtain your Bluetooth permissions for linking the connection of Bluetooth device and Bluetooth device."}
{"task": "rw_33.jsonl", "id": 48474, "text": "Browse APP activity: Get your calendar authority to remind you to participate in the event.", "label": ["Permission Acquisition", "Important"], "rewrite": "Get your calendar authority to remind you to participate in the event."}
{"task": "rw_33.jsonl", "id": 48475, "text": "Listening audio playback function: Get your suspended window permissions and front desk notification barracks to control the audio audio background playback function.", "label": ["Permission Acquisition", "Important"], "rewrite": "Get your suspended window permissions and front desk notifications of the pills to control the audio audio background playback function."}
{"task": "rw_33.jsonl", "id": 48476, "text": "Fault function: When scanning code binding device, obtain your camera (camera) permissions for scanning code binding hardware devices.", "label": ["Permission Acquisition", "Important"], "rewrite": "When scanning code binding device, obtain your camera (camera) permissions for scanning code binding hardware devices."}
{"task": "rw_33.jsonl", "id": 48477, "text": "1.8.1.2 Extended business functions:", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48478, "text": "Mall: When the user returns and uploads pictures, obtains your camera (camera) permissions, and selects the picture upload from the album to obtain your storage/(and album) permissions;", "label": ["Permission Acquisition", "Important"], "rewrite": "When the user returns and uploads pictures, obtain your camera (camera) permissions, and select the picture upload from the album, get your storage/(and album) permissions."}
{"task": "rw_33.jsonl", "id": 48479, "text": "Provide information communication such as goods/orders, and when purchasing after -sales related functions and services, obtain your maintenance screens to provide you with customer service & after -sales service.", "label": ["Permission Acquisition", "Important"], "rewrite": "Get your maintenance of the screen at the same time to provide you with customer service & after -sales service."}
{"task": "rw_33.jsonl", "id": 48480, "text": "1.9 In addition, when you use your job to help the app, we may still need to turn on other access permissions of the device in the relevant business functions. If you do not need to use related business functions, you can refuse to open these permissions, which will not affect your use of this product.Other functions and services.", "label": ["Edit/Control", "Permission Acquisition"], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48481, "text": "The detailed permissions and the purpose of use are as follows:", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48482, "text": "Ensure safely, and when sharing outside, provide you with sharing services. When choosing a payment method, you provide you with application upgrade services when you are entrusted to provide payment services and application upgrades.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "When you first open the job to help the app, when you choose the payment method, share, and upgrade in the application, we will read your application installation list and read the process information during operation during operation."}
{"task": "rw_33.jsonl", "id": 48483, "text": "1.9.2, when you first launched the assignment APP, we will apply for a shortcut for creating a custom shortcut icon to create learning tools.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you first start the job to help the APP, we will apply for a fast way to create a custom shortcut icon authority to create learning tools."}
{"task": "rw_33.jsonl", "id": 48484, "text": "1.9.3, when you use the live course function, we apply for your custom authority for judgment of authorization and system permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use the live course function, we will apply for your custom authority for judgment of authority and system permissions."}
{"task": "rw_33.jsonl", "id": 48485, "text": "1.9.4, when you need to transmit files with online customer service, we will apply for the permissions of visiting multimedia files to transmit pictures, audio, and video files in customer service communication to help you solve the problem.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you need to transmit files with online customer service, we will apply for the permissions of visiting multimedia files to transfer pictures, audio, and video files in customer service communication."}
{"task": "rw_33.jsonl", "id": 48486, "text": "1.9.5, mobile phone vibration permissions, to achieve new message reminder functions.", "label": ["Permission Acquisition", "Important"], "rewrite": "Mobile phone vibration permissions are used to achieve new message reminder functions."}
{"task": "rw_33.jsonl", "id": 48487, "text": "1.9.6, push permissions to support message push functions.", "label": ["Permission Acquisition", "Important"], "rewrite": "Push permissions to support message push functions."}
{"task": "rw_33.jsonl", "id": 48488, "text": "1.9.7, the read -write system settings permissions are used to cache the user equipment information data.", "label": ["Permission Acquisition", "Important"], "rewrite": "Reading and writing system setting permissions for caching the user equipment information data."}
{"task": "rw_33.jsonl", "id": 48489, "text": "1.9.8, obtain the recent task list permissions to determine the operating status of the operation to help the app.", "label": ["Permission Acquisition", "Important"], "rewrite": "Get the procedure's recent task list permissions to determine the operation of the operation to help the app."}
{"task": "rw_33.jsonl", "id": 48490, "text": "1.9.9, display the notification permissions after downloading for the progress of the notification bar in the end upgrade.", "label": ["Permission Acquisition", "Important"], "rewrite": "After downloading, the notification permissions are displayed for the progress of the notification bar in the end upgrade."}
{"task": "rw_33.jsonl", "id": 48491, "text": "1.9.10, when you need to scan the QR code, we will apply for flash permission to identify and generate QR codes.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you need to scan the QR code, we will apply for the flash of light to identify and generate a QR code."}
{"task": "rw_33.jsonl", "id": 48492, "text": "1.9.11, when you log in to the job help app, we will apply for the permissions of the assignment assignment account for the APP read the job help account information to log in to the account.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you log in to the job help app, we will apply for the permissions of the assignment assignment account."}
{"task": "rw_33.jsonl", "id": 48493, "text": "1.9.12, apply for screening permissions to support the screen function.", "label": ["Permission Acquisition", "Important"], "rewrite": "Apply for the screen permissions to support the screen function."}
{"task": "rw_33.jsonl", "id": 48494, "text": "1.9.13, if you are using Huawei mobile phones, we will apply for Huawei's desktop corner bid authority to achieve the function of starting the ICON angle label reminder.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you are using Huawei mobile phones, we will apply for Huawei desktop corner standard authority to achieve the function of starting the ICON angle label reminder."}
{"task": "rw_33.jsonl", "id": 48495, "text": "2. Exception of consent in advance:", "label": ["Important", "First Party Collection Information"], "rewrite": "Exceptions to obtain consent in advance:"}
{"task": "rw_33.jsonl", "id": 48496, "text": "2.1, related to the obligations stipulated in the performance of personal information controller;", "label": ["Important", "First Party Collection Information"], "rewrite": "The collection and usage information related to the obligations stipulated by the personal information controller fulfills the obligation of laws and regulations does not need to solicit authorization consent."}
{"task": "rw_33.jsonl", "id": 48497, "text": "2.2, directly related to national security and national defense security;", "label": ["Important", "First Party Collection Information"], "rewrite": "The collection and use information directly related to national security and national defense security does not need to solicit authorization consent."}
{"task": "rw_33.jsonl", "id": 48498, "text": "2.3, directly related to public safety, public health, and major public interests;", "label": ["Important", "First Party Collection Information"], "rewrite": "The collection and use information directly related to public safety, public health, and major public interests does not need to solicit authorization consent."}
{"task": "rw_33.jsonl", "id": 48499, "text": "2.4, directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Important", "First Party Collection Information"], "rewrite": "Direct related collection and use information such as criminal investigation, prosecution, trial, and execution of judgments does not need to solicit authorization consent."}
{"task": "rw_33.jsonl", "id": 48500, "text": "2.5, due to the major legitimate rights and interests of the life, property of the subject of personal information or other individuals, it is difficult to get the consent of my authorization;", "label": ["Important", "First Party Collection Information"], "rewrite": "Out of major legitimate legitimate rights and interests of the life and property of personal information subjects or other individuals, it is difficult to get the collection and use information that I have authorized."}
{"task": "rw_33.jsonl", "id": 48501, "text": "2.6, the personal information involved is made by the personal information subject to the public by itself;", "label": ["Important", "First Party Collection Information"], "rewrite": "The personal information collected and used by the personal information is made to the public by itself, and no authorization consent is required."}
{"task": "rw_33.jsonl", "id": 48502, "text": "2.7, signed and fulfilling the contract according to the requirements of the personal information subject;", "label": ["Important", "First Party Collection Information"], "rewrite": "The collection and use information necessary for signing and fulfilling the contract according to the requirements of the personal information subject does not need to solicit authorization consent."}
{"task": "rw_33.jsonl", "id": 48503, "text": "2.8, collect personal information from the legal public information, such as legal news reports and government information disclosure;", "label": ["Important", "First Party Collection Information"], "rewrite": "If you collect personal information from the legal disclosure information, you do not need to solicit authorization consent."}
{"task": "rw_33.jsonl", "id": 48504, "text": "2.9, maintain the safe and stable operation of the products or services provided, such as discovery and disposal of product or service failure.", "label": ["Important", "First Party Collection Information"], "rewrite": "Maintaining the collection and use information necessary for the safe and stable operation of the product or service, no need to solicit authorization consent."}
{"task": "rw_33.jsonl", "id": 48505, "text": "3. Anonymous treatment", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48506, "text": "For your information we collected, we will make anonymity in time through technical means.", "label": ["Important", "Data Security"], "rewrite": "We will anonymous personal information collected through technical means."}
{"task": "rw_33.jsonl", "id": 48507, "text": "Under the premise of not leaking your personal information, we have the right to analyze, dig and use the user data after anonymous processing, and have the right to statistically analyze the use of the operation to help the product and share it for possible third -party information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Under the premise of not leaking your personal information, we have the right to analyze, dig and use the user data after anonymous processing, and share statistical data."}
{"task": "rw_33.jsonl", "id": 48508, "text": "4. Personalized service", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48509, "text": "According to your browsing, use records, and filling in information, we will extract your preference characteristics. It may also combine your information for data analysis, and provide you with personalized services in the following scene: I-sign in, shoot in, shoot, shoot, shoot, shoot, shoot, shoot, shoot, shoot, shoot, shoot, shoot, shoot, shoot, shootSearch Result Page-Against the Three, Search Result Page-Guess you want to shoot.", "label": ["Important", "Usage"], "rewrite": "We will extract your preference characteristics based on your browsing, use records, and filling in information, provide data analysis, and provide personalized services."}
{"task": "rw_33.jsonl", "id": 48510, "text": "If you do not need to sign in and reflect the personalized service of daily, you can close it in the \"Operations APP-My-Settings-System Settings-Personalized Recommendation\". If you dont need to guess the personalized service you want to shootYou can turn off in the operation of the operation help app-my-setting-system settings-guess you want to shoot \". After the corresponding switch is closed, we will stop making corresponding personalized recommendations for you.", "label": ["Edit/Control", "Important"], "rewrite": "You can close the daily check-in and the personalized service of the daily check-in and one-three-three personalized services in the \"Work-Help App-Settings-System Settings-Personalized Recommendation\";Turn off and guess the personalized service you want to shoot."}
{"task": "rw_33.jsonl", "id": 48511, "text": "3. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48512, "text": "We or our third -party partners may collect and use your information through cookies and webs, beacon, and store these information as log information.", "label": ["Important", "First Party Collection Information"], "rewrite": "May collect and use your information through cookies and Web Beacon, and store these information as a log message."}
{"task": "rw_33.jsonl", "id": 48513, "text": "We use our own cookies and Web Beacon to provide you with better and better user experience and services, and for the following uses:", "label": ["Usage"], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48514, "text": "1. Remember your identity.", "label": ["Usage"], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48515, "text": "For example: Cookies and Web, Beacon helps us recognize your identity as our registered user, or save what you provided to us about your preferences or other information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Cookies and Web Beacon help us remember your identity and save your information."}
{"task": "rw_33.jsonl", "id": 48516, "text": "2. Analyze the situation of your service.", "label": ["Usage"], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48517, "text": "For example, we can use cookies and webs, beacon to understand what activities you use for our services, or which services are most popular.", "label": ["Important", "Usage"], "rewrite": "You can use Cookies and Web Beacon to analyze the situation you use our services."}
{"task": "rw_33.jsonl", "id": 48518, "text": "When we use cookies and web, beacon for the above purposes, we may be collected through cookies and web, beacon, and provide other partners after statistics to analyze how users use our services.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Non -personal identity information collected through cookies and Web Beacon is provided to other partners after statistics."}
{"task": "rw_33.jsonl", "id": 48519, "text": "There may be cookies and web, beacon placed by other partners in our products and services.", "label": ["Important", "Risk"], "rewrite": "Our products and services may have Cookies and Web Beacon placed by other partners."}
{"task": "rw_33.jsonl", "id": 48520, "text": "These cookies and webs, beacon may collect non -personal identity information related to you to analyze how you use these products or services.", "label": ["Important", "First Party Collection Information", "Usage", "Risk"], "rewrite": "Third -party Cookies and Web Beacon may collect non -personal identity information related to you to analyze the situation of your service."}
{"task": "rw_33.jsonl", "id": 48521, "text": "These third -party cookies and webs, beacon collects and use these information are not subject to this privacy policy, but are subject to the privacy policy of related third parties. We are not responsible for such cookies and webs, beacon.", "label": ["Important", "Risk"], "rewrite": "We are not responsible for third -party cookies and Web Beacon."}
{"task": "rw_33.jsonl", "id": 48522, "text": "You can refuse or manage Cookies through the browser.", "label": ["Important", "Edit/Control"], "rewrite": "You can refuse or manage Cookies through the browser."}
{"task": "rw_33.jsonl", "id": 48523, "text": "But please note that if Cookies or Web Beacon is discontinued, you may not be able to enjoy the best service experience, and certain products or services may not be used normally.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48524, "text": "4. How do we share, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48525, "text": "1. We will treat your information with a high degree of diligence. Unless you get your clear consent, we will not share your personal information with any company, organization and individual other than the company, but it cannot be identified after processing.Except for restoration.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Unless you get your clear consent, we will not share your personal information with any company, organization and individual other than the company, except for being unable to recognize specific individuals and cannot be restored after processing."}
{"task": "rw_33.jsonl", "id": 48526, "text": "It is inevitable that in order to provide you with a perfect quality service, we need to cooperate with third -party partners as you to provide services to share some of your personal information from third -party partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We need to provide a service with third -party partners as you and share some of your personal information from third -party partners."}
{"task": "rw_33.jsonl", "id": 48527, "text": "At present, we will ask you to ask you to authorize your personal information in the following situation:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the following situation, we will ask you to authorize your authorization to share personal information:"}
{"task": "rw_33.jsonl", "id": 48528, "text": "1.1, part of the service in the job help app provided by other subjects: the job help APP provides live class services, live broadcast classes are provided by boats from ships out of sea education technology (Beijing) Co., Ltd. and Guangzhou Qunlu Culture Technology Co., Ltd.Mall and VIP services, malls and VIP services are provided by boats from ships out of the sea education technology (Beijing) Co., Ltd. to provide operational services. The above products are provided by the company to provide technical services and use other services with the operation to help other services. Therefore, we need to register your registration.Login information is the registration phone number/(and password) shared with the boat out of the shipbuilding Education Technology (Beijing) Co., Ltd. and Guangzhou Qunlu Culture Technology Co., Ltd., thinking that you provide operational services and technical services.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Live lesson provides content services by the boat out of the sea education technology (Beijing) Co., Ltd. and Guangzhou Qunlu Culture Technology Co., Ltd..information."}
{"task": "rw_33.jsonl", "id": 48529, "text": "The job help app provides learning pens. In order to ensure your information synchronization, this function needs to use the same account to bind the learning pen hardware product with the operation help smart APP.Unregistered jobs help smart apps. You can authorize the registered job to help the smart APP account when you help the APP.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You can authorize the registered job to help the smart APP account when you help the app binding the learning pen to use the learning pen function."}
{"task": "rw_33.jsonl", "id": 48530, "text": "1.2, the product part of the mall is provided by a third -party merchant. To realize the needs of your purchase of goods (including enjoying after -sales service), we will share your order information and transaction -related information with our platform for third -party merchants.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will share your order information with transaction -related information to our platform's third -party merchants."}
{"task": "rw_33.jsonl", "id": 48531, "text": "The delivery service is provided by a third -party logistics company. To ensure that you receive the product smoothly, we will share your orders and recipient information with third -party logistics companies.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "To ensure that you receive the product smoothly, we will share your orders and recipient information with third -party logistics companies."}
{"task": "rw_33.jsonl", "id": 48532, "text": "1.3, the assignment help VIP service provides joint member services to help you successfully receive relevant rights and interests such as partners and members, we will provide your mobile phone number to partners who develop joint membership services to ensure that partners can distribute relevant rights and interests to you to youUnder the aforementioned mobile phone number binding partner platform account number.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will provide your mobile phone number to partners who carry out co -branded members to ensure that partners issue relevant rights and interests."}
{"task": "rw_33.jsonl", "id": 48533, "text": "1.4, based on technical needs, the operation help app needs to integrate third -party software development tool packs (SDK).", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Based on technological needs, the operation help app needs to integrate third -party software development tool packs (SDK)."}
{"task": "rw_33.jsonl", "id": 48534, "text": "The information required to collect or shared by the integrated third -party SDK is as follows:", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48535, "text": "1.4.1, the job help app integrates Beijing Jinshi Technology Co., Ltd.'s quick check login SDK, quick -checking SDK needs to obtain your network access rights, collect your mobile phone style, equipment version information, and use the operator to move the Internet ChinaThe APPID information of the Limited Co., Ltd., China United Network Communications Group Co., Ltd., and China Telecom Group Co., Ltd. provides you with one -click verification and number certification services. For details, please refer to \"SDK\", \"China Mobile Certification Service Agreement\",\"Unicom Service Terms and Privacy Policy\", \"Tianyi Account Privacy Policy\";", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Quickly logging in SDK needs to obtain your network access permissions, collect your mobile phone style, device version information, and provide you with one -click verification and number certification services by obtaining the operator's Appid information."}
{"task": "rw_33.jsonl", "id": 48536, "text": "1.4.2, the job help app integrates Beijing Baidu Net News Technology Co., Ltd.'s Huagu SDK, Hui Pai SDK needs to collect your device information (device attribute information: user's hardware model, operating system version, equipment configuration, unique device logo symbol, WIFI hot spot MAC address, international mobile device recognition code (IMEI, IMSI), SIM card information, network device hardware address Mac, Android, ID (may be obtained multiple times)), and device status information: equipment application installation list), equipment application installation list), installation list)Log information (the server will automatically record the requests issued by the user when visiting Baidu Hui Push, the hardware equipment information, the version of the operating system, the date, time, time of the end user access service)The program list information, and your authorized equipment permissions read/write to external memory card, obtain location, access the network, obtain network status, access the state of access to the phone, access Wi-Fi status, obtain task list, read and run the process process processing processInformation, used to send messages (including operational activities, version updates), please refer to \"Baidu Hui Pushing Privacy Policy\";", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Huijuan SDK needs to collect your device information, log information, location information, application list information, and the device permission read/write to external memory cards, obtain location, access the network, obtain network status, access the phone status, access to the phone status, access to the state of the phone, access to the status of the phone, and the status of the phone.Visit Wi-Fi status, obtain the task list of operation, and read the process information during the operation."}
{"task": "rw_33.jsonl", "id": 48537, "text": "1.4.3 In view of the operational help app integrates the Huagu SDK of Beijing Baidu Network Technology Co., Ltd., Huaguan SDK integrates the Pushsdk of Huawei/OPPO/Xiaomi/vivo/Meizu.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48538, "text": "If you use Huawei/OPPO/vivo/Xiaomi/Meizu mobile phone, Huawei/OPPO/vivo/Xiaomi/Meizu Push needs to read your device information, Xiaomi push needs to read your MAC address, WiFi information, system version version, system version, Task list, international mobile device recognition code (IMEI, IMSI), SSID information, unique device identifier, WIFI hotspot MAC address, device type (mobile phone manufacturer, network equipment manufacturer), application installation list, Huawei SDK needs to needRead your application installation list for push notification column messages, OPPO, ColorOS, SDK collect your anonymous user ID for message push, please refer to \"Huawei Consumer Business Privacy Statement\", \"Push personal information protection policy\"\",\" Vivo Privacy Policy \",\" Xiaomi Push Privacy Policy \",\" Meizu Privacy Policy \";", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Huawei/OPPO/vivo/Xiaomi/Meizu Push SDK needs to read your device information for message push."}
{"task": "rw_33.jsonl", "id": 48539, "text": "SDK and other Huawei mobile phone service functions to ensure that the push function is realized, and when you need other Huawei mobile phone services, you can use it safely and smoothly. For details", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "HMS-Core SDK is the foundation of Huawei SDK to collect your WiFi information."}
{"task": "rw_33.jsonl", "id": 48540, "text": "1.4.5, the job help app integrated Beijing Baidu Net News Technology Co., Ltd. Baidu Map SDK, Baidu Map SDK needs to obtain your network access permissions, collect your mobile phone style, WIFI information (WIFI information), SSID (SSID) ,,,MAC address (MAC address), unique device identifier, WIFI hotspot MAC address, task list (task list), location information (latitude, longitude, location information), which is used to place nearby personal data selection schools, locate nearby nearby nearby, locate nearby nearby nearby, locate nearby nearby nearby, positioning nearby nearby nearby, positioning nearby nearby, nearby nearby, nearby near the school, positioning nearby near the school, positioning nearby near the school, positioning nearby near the school, locate nearby nearby nearby.School, provide you with better services, please refer to \"Baidu Map Open Platform Products and Service Privacy Policy\";", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Baidu Map SDK needs to obtain your network access rights, collect your mobile phone style, WIFI information, SSID, etc. to provide you with positioning services."}
{"task": "rw_33.jsonl", "id": 48541, "text": "1.4.6, the job help app integrates Beijing Baidu Net News Technology Co., Ltd. Baidu Mobile Statistics SDK, Baidu Mobile Statistics SDK needs to obtain your network access permissions, collect your mobile phone style, location information (latitude, longitude, location information),, position information),,), location information),,), position information),, information), position information, location information),,), location information),, position information),, information), position information, location information),, information), position information, location information),, information), position information, position information),, information), position information, position information),, information), position information, location information),, information), position information, location information),, information), position information, position information),, information), position information, position information),, information), position information, position information),, information), position information, position information),, information), position information, position information),, information), position information, position information),, information), position information, position information),, information), location information, position information),, information), position information, position information),, information)WIFI Information (WIFI Information), Device Application Installation List, International Mobile Device Recognition Code (IMEI, IMSI), device types (mobile phone manufacturers, network device manufacturers), MAC address (MAC address), task list, browser type type, Use language, access date and time, software and hardware feature information, and web records, equipment models, equipment recognition codes, operating systems, resolution for data that you need, for data statistics to provide a better service experience. For details, please refer to \"BaiduStatistical Privacy Policy;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Baidu Mobile Statistics SDK needs to obtain your network access permissions and collect your mobile phone style, location information, WIFI information, etc. for data statistics."}
{"task": "rw_33.jsonl", "id": 48542, "text": "1.4.7.The domain name analysis function of the httpdns service, thereby improving the success rate of network request. For details, please refer to the \"Baidu Intelligent Cloud Privacy Policy\";", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Baidu open cloud SDK needs to obtain your network access permissions and collect your mobile phone style information to provide domain name analysis functions based on HTTPDNS services."}
{"task": "rw_33.jsonl", "id": 48543, "text": "1.4.8, the job help app integrates Shenzhen Ledie Technology Co., Ltd.'s Ledie screen SDK.SDK Privacy Terms \"\" iOS, SDK Privacy Terms \";", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Laowan -screen SDK reads the equipment list in your local local area network for the playback video screen."}
{"task": "rw_33.jsonl", "id": 48544, "text": "1.4.9, the job help app integrates Hangzhou NetEase Qinhong Cloud Technology Co., Ltd. Netease Qiyu SDK, Netease Qiyu SDK collects your network information (network status, WIFI information, IP address), to understand the network status and changes of the device, Therefore maintain the stability of the network connection to the greatest extent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Netease Qiyu SDK collects your network information to understand the network status and changes of the device."}
{"task": "rw_33.jsonl", "id": 48545, "text": "After turning on the sensor information permissions, the distance sensor information will be collected to perceive whether the mobile phone is raised and provides a better voice chat experience. If you provide customer service session services, please refer to \"Netease Qiyu SDK Privacy Policy\";", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When the sensor information is turned on, the NetEase Qiyu SDK will collect distance sensor information to perceive whether the mobile phone is raised."}
{"task": "rw_33.jsonl", "id": 48546, "text": "1.4.10, the job help app integrates Hangzhou NetEase Qinhong Cloud Technology Co., Ltd. NetEase Yunxin SDK, NetEase Yunxin SDK will read your only device identifier, WIFI hot spot MAC address, SSID information, MAC address, WIFI information, tasks, tasks, tasksList, for supporting online customer service services, please refer to \"Netease Yunxin Privacy Policy\"", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Netease Yunxin SDK will read your only device logo, WIFI hot spot MAC address, SSID information, MAC address, WIFI information, task lists to support online customer service services."}
{"task": "rw_33.jsonl", "id": 48547, "text": "1.4.11, the job help app integrated Xiamen Meowbao Technology Co., Ltd.'s printing SDK. Printing SDK does not collect any information for you to provide you with printing services. For details, please refer to \"Paperang User Privacy Policy\";", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Printing SDK does not collect any information for you to provide you with printing services."}
{"task": "rw_33.jsonl", "id": 48548, "text": "1.4.12.Code scanning service, please refer to the \"Google Privacy Policy\";", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "ZXING QR code scanning SDK obtains photo information, video information, network status information, flash information, which is convenient for you to provide QR code scanning services."}
{"task": "rw_33.jsonl", "id": 48549, "text": "1.4.13, the job help app integrates Buglysdk of Shenzhen Tencent Computer System Co., Ltd., BuglySDK needs to obtain your network access permissions, collect your SIM card information, mobile phone model, system version, mobile phone style (mobile phone style), sole device logo logo logoMAC address, CRASH environment: CRASH information and thread stack, ROM/RAM/SD card capacity, network/language status APP information: package name, version, process name, device information: international mobile device identification code (IMEI, IMSI), used to judge CRASH device statistics, please refer to \"Bugly, SDK Personal Information Protection Rules\";", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Buglysdk needs to obtain your network access permissions and collect information such as your SIM card information, mobile phone models, system versions, mobile phone styles to determine the statistics of CRASH device."}
{"task": "rw_33.jsonl", "id": 48550, "text": "1.4.14.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The operation help app integrates the equipment risk of Beijing Diger Times Technology Co., Ltd."}
{"task": "rw_33.jsonl", "id": 48551, "text": "Equipment risk SDK will obtain your network authority and network connection status information (2G, 3G, 4G, 5G information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Equipment risk SDK will obtain your network authority and network connection status information."}
{"task": "rw_33.jsonl", "id": 48552, "text": "WIFI and cellular network information, including: WIFI network card MAC address, WIFI hotspot MAC address, WIFI name, surrounding WIFI information list, network connection mode operator information), to judge network link status and transmission service data.", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48553, "text": "At the same time, equipment risk SDK collects your device IP address, device hardware serial number, equipment and Bluetooth MAC address, equipment application installation list, task list, equipment basic configuration information (device name, CPU, memory, screen, model, operating system), System and software -related configuration information, SSID information, mobile phone manufacturers, SIM card information, unique device identifier (Android_id, may be obtained multiple times), international mobile device identification code (IMEI, IMSI), and rough geographical location forEquipment recognition, risk control and anti -fraud to ensure your account and transaction security.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Equipment risk SDK collects information such as your device IP address, equipment hardware serial number, etc. for equipment recognition, risk control and anti -fraud."}
{"task": "rw_33.jsonl", "id": 48554, "text": "For details, please refer to \"Digital Beauty Technology Privacy Policy\";", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48555, "text": "1.4.15, the job help app integrated Alipay (China) Network Technology Co., Ltd. Alipay SDK, Alipay SDK collects your international mobile device recognition code (IMEI), mobile phone status, system version, network status, read and write external storage, read and write external storage, and read external storage.For processing and cache your payment order and payment status, please refer to the \"Alipay Privacy Policy\";", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Alipay SDK collects your international mobile device recognition code, mobile phone status, system version, network status, read and write external storage, to process and cache your payment order and payment status."}
{"task": "rw_33.jsonl", "id": 48556, "text": "1.4.16, the job help APP Integrated Online Banking Online (Beijing) Technology Co., Ltd.'s Jingdong Pay SDK, JD Pay SDK collects your international mobile device identification code (IMEI, IMSI), MAC address, system version, network environment, for processingAnd cache your payment order and payment status, please refer to the \"JD Wallet Privacy Policy\";", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "JD Pay SDK collects your international mobile device recognition code, MAC address, system version, network environment, to process and cache your payment order and payment status."}
{"task": "rw_33.jsonl", "id": 48557, "text": "1.4.17, the job help app integrates WeChat open platform of Shenzhen Tencent Computer System Co., Ltd., SDK, WeChat open platform, SDK will obtain online access permissions, collect your equipment logo information and equipment versions, application installation lists for support for supportWeChat authorized login, WeChat sharing content and WeChat payment, please refer to \"WeChat OpenSDK Personal Information Processing Rules\";", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "WeChat open platform SDK will obtain network access permissions, collect your device logo information and equipment versions, application installation lists to support WeChat authorization login, WeChat share content and WeChat payment."}
{"task": "rw_33.jsonl", "id": 48558, "text": "1.4.18, the job help APP integrates the QQ interconnection SDK, QQ interconnection of Shenzhen Tencent Computer System Co., Ltd., SDK collects your device logo information, application and installation list for sharing the content you are interested in to QQ and QQ space,For details", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "QQ interconnect SDK collects your device logo information and applied installation lists to share the content you are interested in to QQ and QQ space."}
{"task": "rw_33.jsonl", "id": 48559, "text": "1.4.19, the job help APP Integrated Tenpay Payment Technology Co., Ltd.'s Tenpay SDK, Tenpay SDK collects your international mobile device identification code (IMEI, IMSI), MAC address, system version, network environment, for it for for it for for it for for it for for it for for it.Treatment and cache your payment order and payment status to ensure your safe use of payment services. For details, please refer to the \"Payment Policy Privacy Policy\";", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Tenpay SDK collects your international mobile device recognition code (IMEI, IMSI), MAC address, system version, network environment, to process and cache your payment order and payment status."}
{"task": "rw_33.jsonl", "id": 48560, "text": "1.4.20, the job help app integrates Beijing Weimengchuang Cynthica Network Technology Co., Ltd.'s Weibo sharing, SDK, Weibo sharing, SDK collects your equipment identification information, equipment application installation list to share the content you are interested inTo Sina Weibo, please refer to the \"Weibo Open Platform\";", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share on Weibo to collect your equipment identification information and equipment application installation list to share the content you are interested in to Sina Weibo."}
{"task": "rw_33.jsonl", "id": 48561, "text": "1.4.21, the job help APP integrated Beijing volcanic engine technology Co., Ltd. Data roamer SDK (Douyin Development Platform), data roamer SDK (APMINSIGHT)(Based on IP address) State/regional information, device model, MAC address, task list (task list), operating system name and version information, system language and region, device resolution, mobile device national code, mobile device networkCode, APP version, advertising identifier information, the only device identifier (Android_id, may be obtained multiple times), WIFI hot spot MAC address, international mobile device identification code (IMEI, IMSI), domain name information, APP collapse log information, APP, APP, APP, APP, APP, APP, APP, APP, APP, APP, APP, APP, APP, APPThe operation path of abnormalities and when collapsed is used to provide APP performance monitoring services;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Data roamers SDK reads your operator name, region, national/regional information, equipment models and other information to provide APP performance monitoring services."}
{"task": "rw_33.jsonl", "id": 48562, "text": "Data roamers SDK (APMINSIGHT, Web) reads your domain name information, screen resolution, network type, operating system name and version information, browser name, type, version, pages abnormal, operating paths when collapse, use useFor web performance monitoring services, please refer to the Volcano Engine Privacy Policy;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Data roamers SDK read your domain name information, screen resolution, network type, operating system name and version information, etc., for web performance monitoring services."}
{"task": "rw_33.jsonl", "id": 48563, "text": "International mobile device recognition code (IMEI, IMSI), task list, WIFI information, MAC address, SSID information, device application installation lists are used to support web pages opening. For details, please refer to the \"Tencent Browse Service SDK Personal Information Protection Rules\";", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Tencent TBS browser SDK needs to read your network authority, unique device identifier, etc., to support web pages opening."}
{"task": "rw_33.jsonl", "id": 48564, "text": "1.4.23, the job help app integrates the Chromium (open source code) of Google, Inc.Information is used to complete the relevant capabilities of network requests;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Chromium will read your unique device identifier, WIFI hot spot MAC address, MAC address, Wi-Fi information, and SSID information to complete the relevant capabilities of network requests."}
{"task": "rw_33.jsonl", "id": 48565, "text": "When the operation help app is in the background mode, Chromium will read Wi-Fi information, MAC address, and SSID information to continue to perform unfinished network requests in the background. For details, please refer to the \"Google Privacy Policy\";", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48566, "text": "1.4.24, the job help app integrated Google (Inc.) Glide pictures loaded SDK, GLIDE pictures loaded SDK, you will read your album and device type (mobile phone manufacturer, network equipment manufacturer) for network picturesLoad, please refer to the \"Google Privacy Policy\";", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Glide picture loading SDK will read your album and device type to load for network pictures."}
{"task": "rw_33.jsonl", "id": 48567, "text": "1.4.25, the operation help app integrated Alibaba Cloud's Arouter Ali SDK, Arter Ali SDK, for component development and routing jump, it does not collect your information. For details, please refer to the \"Legal Statement and Privacy Policy\";", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Arter Ali SDK, for component development and routing jump, does not collect your information."}
{"task": "rw_33.jsonl", "id": 48568, "text": "1.4.26, the job help app integrated the, Apache, Software, Foundation, (ASF, Apache Software Foundation), Apache, SDK, for establishing network connections, Apache, SDK does not collect your information, please please, please please, please please, please please, please please, pleaseSee Apache Privacy Policy;", "label": ["Important"], "rewrite": "The Apache SDK is used to establish a network connection and does not collect your information."}
{"task": "rw_33.jsonl", "id": 48569, "text": "1.4.27, the job help app integrates the SDK of the vocal voice recognition of Suzhou Chi Sheng Sheng Information Technology Co., Ltd., and the vocal voice recognition SDK will collect your device information (device model, equipment MAC address, operating system type, version, hardware equipment, and hardware equipmentSequence number), obtain your recording, storage permissions and read audio data to send recording to the server that sends the recording to Suzhou Chisheng Information Technology Co., Ltd. to achieve English spoken language evaluation and recognition services.For speaking and identification services, please refer to \"Vetera Privacy Policy\";", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The SDK voice recognition SDK will collect your device information, get your recording, storage permissions, and read audio data, and realize the English spoken evaluation and recognition services."}
{"task": "rw_33.jsonl", "id": 48570, "text": "1.4.28, the operation help app integrates the mobile intelligent terminal supplementary device logo system of the mobile security terminal of China Information and Communication Research Institute (MSA) uniform call system, SDK, mobile smart terminal supplementary device logo system uniformly call SDK will not actively collect any data, onlyGet the following data when calling, app, and use it for local judgments. No network transmission will be performed: equipment manufacturers, equipment models, and equipment brands are used to determine the name of the terminal to call the interface device network operator name to judge the virtual machine environmentAPP, package name, used to check the signature, to access the mobile smart terminal supplementary device logo system and protect the device logo. When the user uses Huawei mobile phones, the mobile smart terminal supplementary device logo system is uniformly called., App to collect OAID information. For details, please refer to the \"Mobile Intelligent Device Make Public Service Platform\";", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Mobile smart terminal supplementary device logo system uniformly calls SDK will not actively collect any data, only obtain data when app calls of the APP, for local judgment, and no network transmission will be performed."}
{"task": "rw_33.jsonl", "id": 48571, "text": "1.4.29, the job help app integrates Shenzhen City, that is, the real -time audio and video SDK, which is a real -time audio and video SDK, that is, the real -time audio and video SDK records and save your information on login and use this service. It will collect your IP, address, browse viewThe type of device, the language of use, the date and time of access, the software and hardware feature information, the user logo and web browsing records are used to provide real -time audio and video communication services. For details, please refer to the \"Construction Cloud Service Privacy Policy\";", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "That is, the SDK record of the audio and video SDK records and saves your information about logging in and using this service to provide real -time audio and video communication services."}
{"task": "rw_33.jsonl", "id": 48572, "text": "1.4.30, the operating help app integrated Taobao (China) Software Co., Ltd.'s MNN deep learning framework, the MNN deep learning framework will get your camera and microphone permission to identify human body movements, count the rope skipping action, and count the rope skipping action, and count the rope jumping actions, and count the rope jumping action, and count the rope skipping action, and count the rope jumping action.Read your skipping video to complete your own optimization and improvement. For details, please refer to \"MNNKIT/LICENSE\";", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The MNN deep learning framework will obtain your camera and microphone rights to identify human movements, count the rope skipping action, and read your skipping video."}
{"task": "rw_33.jsonl", "id": 48573, "text": "1.4.31, the Alibaba Quinox framework of Alibaba Cloud Computing Co., Ltd. is open SDK, and Ali QUINOX framework is open SDK to collect your MAC address, IMEI, Androidid, application list, shear board information, for APP messagesPush, improve the user experience, use it to do front -back state management, APM performance monitoring, please refer to the \"Alibaba Cloud Legal Statement and Privacy Policy\";", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Ali Quinox Framework Open SDK to collect your MAC address, IMEI, Androidid, application list, shear information that is running, for APP message push, improve user experience, use it for front and back state management, APM performance monitoring."}
{"task": "rw_33.jsonl", "id": 48574, "text": "1.4.32, the job help APP integrates the real-time audio and video of Shenzhen Tencent Computer System Co., Ltd., State, system attributes, equipment models, operating systems, IP addresses, and apply for access to your camera (camera), microphone (recording) permissions for supporting video and voice calls. For details, please see \"Real -time audio and video, TRTC, SDK, Personal Information Protection Rules.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Real-time audio and video TRTC SDK needs to read your Wi-Fi status, system attributes and other information to support video and voice calls."}
{"task": "rw_33.jsonl", "id": 48575, "text": "1.4.33, due to real -time audio and video, TRTC, SDK access to Huawei Audio, Engine, SDK, the job help app integrated real -time audio and video, TRTC, SDK, integrated Huawei Audio, ENGINE, SDK, Huawei Terminal Co., Ltd.Visit your microphone (recording) permissions for audio collection during the recording process. For details, please refer to the \"Huawei SDK Privacy Safety Instructions\".", "label": ["Important", "First Party Collection Information"], "rewrite": "When integrated real -time audio and video TRTC SDK, the job help app integrates Huawei Audio Engine SDK to visit your microphone (recording) permissions for audio collection during the recording process."}
{"task": "rw_33.jsonl", "id": 48576, "text": "We will only share your personal information for legal, correct, necessary, specific, and clear purposes.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only share your personal information for legal, correct, necessary, specific, and clear purposes."}
{"task": "rw_33.jsonl", "id": 48577, "text": "Companies, organizations and individuals who share personal information with us, we will sign a strict confidentiality agreement with them, asking them to handle information in accordance with our instructions, this policy, and any other related confidentiality and security measures.There is only a limited access right of information. They also need to bear the contractual obligation, including obtaining your information that is not limited to the use of legal compliance, and adopt reasonable security measures to protect your information.Legal responsibility.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We signed a confidentiality agreement with the information receiver to process information according to the instructions, this policy, and other confidentiality and security measures."}
{"task": "rw_33.jsonl", "id": 48578, "text": "We assume corresponding responsibilities for some open source and free partners who have leaked your information such as infringing your personal rights and interests.", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48579, "text": "2. We will not sell illegally and illegally provide your information to others;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not sell and provide your information illegally."}
{"task": "rw_33.jsonl", "id": 48580, "text": "We will not provide your information to any third party, nor is it used for any other purposes and uses, except for the following situations: except:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not provide your information to any third party, nor is it used for any other purposes and uses, except for the following situations: except:"}
{"task": "rw_33.jsonl", "id": 48581, "text": "2.1, disclose to the third party with your consent in advance;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After you agree, disclose your personal information to a third party."}
{"task": "rw_33.jsonl", "id": 48582, "text": "2.2, in accordance with the relevant provisions of the law, or the requirements of administrative or judicial institutions, disclose to third parties or administrative or judicial institutions;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "According to the relevant provisions of the law, or the requirements of administrative or judicial institutions, disclose your personal information to a third party or administrative and judicial institution."}
{"task": "rw_33.jsonl", "id": 48583, "text": "2.3, when we provide services, you may use your information for authentication, customer service, security precautions, fraud monitoring, archiving, and backup to prevent, discover, investigate fraud, harm security, illegally or violate us with us.Acts, policies, or rules to protect the legitimate rights and interests of you, other users, our affiliated companies, partners and other trusted third -party suppliers, service providers, agents, and the public to ensure that we provide you withThe safety of products and services;", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security", "Usage"], "rewrite": "When we provide services, your information may be used for authentication, customer service, security defense, fraud monitoring, archiving and backup."}
{"task": "rw_33.jsonl", "id": 48584, "text": "2.4, we cooperate with the third -party to provide you with related services or other network services of the assignment platform, and these third parties agree to assume the responsibility of protecting the privacy of the user the same;", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We cooperate with third parties to provide you with services, and these third parties agree to assume the same responsibility, and we may share your personal information with them."}
{"task": "rw_33.jsonl", "id": 48585, "text": "2.5 Other disclosures should be carried out in accordance with laws, regulations or policies.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48586, "text": "3., we will only publicly disclose your personal information in the following circumstances:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only disclose your personal information in the following situation:"}
{"task": "rw_33.jsonl", "id": 48587, "text": "3.1, after getting your clear consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After getting your clear consent, you will publicly disclose your personal information."}
{"task": "rw_33.jsonl", "id": 48588, "text": "3.2. Based on legal disclosure: In the case of compulsory requirements of legal, legal procedures, litigation or government authorities, we may publicly disclose your personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the case of compulsory requirements of legal, legal procedures, litigation, or government authorities, we may disclose your personal information publicly."}
{"task": "rw_33.jsonl", "id": 48589, "text": "4. Sharing, transfer, and public disclosure of personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share, transfer, and publicly disclose the exception of authorization of personal information."}
{"task": "rw_33.jsonl", "id": 48590, "text": "4.1, related to the obligations stipulated by the performance of personal information controller;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The sharing, transfer or disclosure of the obligations stipulated by the individual information controller's performed laws and regulations does not need to be authorized."}
{"task": "rw_33.jsonl", "id": 48591, "text": "4.2, directly related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The sharing or disclosure directly related to national security and national defense security does not require authorization."}
{"task": "rw_33.jsonl", "id": 48592, "text": "4.3, directly related to public safety, public health, and major public interests;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Sharing or disclosure directly related to public safety, public health and major public interests does not need to be authorized."}
{"task": "rw_33.jsonl", "id": 48593, "text": "4.4, directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Sharing or disclosure related to criminal investigation, prosecution, trial, and judgment execution does not need to be authorized."}
{"task": "rw_33.jsonl", "id": 48594, "text": "4.5, due to the major legitimate rights and interests of the life and property of the subject of personal information or other individuals, it is difficult to get the consent of my authority;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Out of the major legitimate rights and interests of the life and property of the subject of personal information or other individuals, it is difficult to get shared or disclosed by my consent, and there is no need to solicit."}
{"task": "rw_33.jsonl", "id": 48595, "text": "4.6, personal information disclosed to the public by yourself;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The collected personal information is the sharing or disclosure of the subject of the personal information to the public by themselves without authorization."}
{"task": "rw_33.jsonl", "id": 48596, "text": "4.7, collecting personal information from legal public information, such as legal news reports, government information disclosure and other channels.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you collect personal information from the legal disclosure information, no authorization is required."}
{"task": "rw_33.jsonl", "id": 48597, "text": "5. In accordance with the law, share, transfer, and disclose personal information that is identified by de -identification processing, and ensure that the data receiver cannot restore and re -identify the information of the information, which is not a personal information sharing, transfer, and public disclosure behavior.The preservation and processing of such data do not need to obtain your consent separately.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If the personal information of sharing, transfer, and disclosure is identified, and ensure that the data receiver cannot restore and re -identify the information of the information, it is not a personal information sharing, transfer and public disclosure behavior, and you do not need to obtain your consent separately."}
{"task": "rw_33.jsonl", "id": 48598, "text": "Fifth, how do you manage your information and accounts for cancellation", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48599, "text": "In accordance with China's relevant laws, regulations, standards, and the practice of other countries and regions, we guarantee that you exercise the following rights on your personal information:", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48600, "text": "1. Inquiry right", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48601, "text": "You have the right to check your personal information, except for the situation stipulated in laws and regulations.", "label": ["Important", "Edit/Control"], "rewrite": "You have the right to check your personal information, except for the situation stipulated in laws and regulations."}
{"task": "rw_33.jsonl", "id": 48602, "text": "You can query or edit your personal information information in your account through \"Operations APP-My Avatar-Edit Information\", \"Operations ApP-Settings-Account and Security\", modify your password, real-name authentication, real-name authentication, real-name authenticExpress address information.", "label": ["Important", "Edit/Control"], "rewrite": "You can query or edit your personal information through \"Operation APP-Mine-Avatar-Edit Information\", \"Operations APP-Settings-Account and Security\" inquiry or editing your personal information."}
{"task": "rw_33.jsonl", "id": 48603, "text": "2. Correction", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48604, "text": "When you find that we have an error about your personal information, you can find your information to modify your information through \"Operations APP-My Avatar-Edit Information\" \"Workp for Mine-Settings-Account and Security\"Essence", "label": ["Important", "Edit/Control"], "rewrite": "You can find your information to modify your information through \"Operations APP-My-Avatar-Edit Information\" \"Assignment Gang-Settings-Account and Security\"."}
{"task": "rw_33.jsonl", "id": 48605, "text": "3. Delete right", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48606, "text": "In the following situation, you can make a request to delete personal information:", "label": ["Important", "Edit/Control"], "rewrite": "In the following situation, you can make a request to delete personal information:"}
{"task": "rw_33.jsonl", "id": 48607, "text": "3.1, if our behavior of handling personal information violates laws and regulations;", "label": ["Important", "Edit/Control"], "rewrite": "If our behavior of handling personal information violates laws and regulations, you can make a request to delete personal information."}
{"task": "rw_33.jsonl", "id": 48608, "text": "3.2, if we collect and use your personal information, it has not obtained your consent;", "label": ["Important", "Edit/Control"], "rewrite": "If we collect and use your personal information but not obtain your consent, you can make a request to delete information."}
{"task": "rw_33.jsonl", "id": 48609, "text": "3.3, if our handling of personal information is violated with you;", "label": ["Edit/Control", "Important"], "rewrite": "If our behavior of handling personal information violates your agreement, you can make a request to delete information."}
{"task": "rw_33.jsonl", "id": 48610, "text": "3.4, if you no longer use our products or services, or you cancel your account;", "label": ["Important", "Edit/Control"], "rewrite": "If you no longer use our products or services, or if you log out your account, you can make a request to delete information."}
{"task": "rw_33.jsonl", "id": 48611, "text": "3.5, if we no longer provide you with products or services.", "label": ["Important", "Edit/Control"], "rewrite": "If we no longer provide products or services for you, you can make a request to delete information."}
{"task": "rw_33.jsonl", "id": 48612, "text": "When you decide to delete a certain or some information, you can contact customer service to delete, send emails to GEENXINXI@zuoyebang.com, or call customer service 400-611-0000.", "label": ["Important", "Contact Information", "Edit/Control"], "rewrite": "You can contact customer service to delete, send emails to GEENXINXI@zuoyebang.com, or call customer service 400-611-0000."}
{"task": "rw_33.jsonl", "id": 48613, "text": "4. Rejection right", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48614, "text": "4.1, if you revoke one or more authority authorization, you can be carried out in the \"Operation APP-Settings-Permanent Center\". If you need to revoke all the authorization of the privacy policy, you can use the \"mobile phone-setting-application and service and service-Application Management-Operation Gang-Storage-Delete Data \"implementation.", "label": ["Edit/Control", "Important"], "rewrite": "You can revoke one or more authority authorization in the \"Operational APP-Settings-Permanent Center\"; you can use the \"mobile phone-setting-application and service-operational-storage-delete data\"Essence"}
{"task": "rw_33.jsonl", "id": 48615, "text": "Please note that the path may be different in different devices, referring to the explanation and guidance of your equipment and system developer.", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48616, "text": "4.2, when you withdraw your consent or authorization, we cannot continue to provide you with the service corresponding to the withdrawal consent or authorization, and will no longer deal with your corresponding personal information.", "label": ["Important", "Edit/Control"], "rewrite": "After withdrawing consent or authorization, we will no longer provide the corresponding service, and we will no longer deal with your corresponding personal information."}
{"task": "rw_33.jsonl", "id": 48617, "text": "But your decision to withdraw consent or authorization will not affect personal information processing based on your consent or authorization before.", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "Withdrawal authorization will not affect personal information processing based on previous authorization."}
{"task": "rw_33.jsonl", "id": 48618, "text": "5. Depending on the right", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48619, "text": "If you decide to stop using the job gang, you can cancel your account.", "label": ["Important", "Edit/Control"], "rewrite": "If you decide to stop using the job gang, you can cancel your account."}
{"task": "rw_33.jsonl", "id": 48620, "text": "Account cancellation can be achieved in the \"Homework APP-Mine-Settings-Account and Security-Logging up the Assignment Express Account\".", "label": ["Important", "Edit/Control"], "rewrite": "Account cancellation can be achieved in the \"Homework APP-Mine-Settings-Account and Security-Logging up the Assignment Express Account\"."}
{"task": "rw_33.jsonl", "id": 48621, "text": "If we need to handle it, we will complete the verification and processing within 15 working days.", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48622, "text": "After canceling the account, we will stop providing you with products or services and delete your personal information according to your requirements.", "label": ["Important", "Edit/Control"], "rewrite": "After canceling the account, we will stop providing you with products or services and delete your personal information according to your requirements."}
{"task": "rw_33.jsonl", "id": 48623, "text": "After canceling the account, the data in this account cannot be restored, including but not limited to asset information in the account, such as learning currency, credits, coupons, etc.;", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48624, "text": "The content of the account information will also be removed, including but not limited to articles, comments, etc. that the account published.", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48625, "text": "The cancellation operation cannot be revoked, please apply carefully.", "label": ["Important", "Edit/Control"], "rewrite": "The cancellation operation cannot be revoked."}
{"task": "rw_33.jsonl", "id": 48626, "text": "6. Personal information subject to obtain a copy of personal information", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48627, "text": "You have the right to obtain your personal information copy, and you can perform this operation through the following ways \"Operations APP-Setting-Customer Service Center\".", "label": ["Important", "Edit/Control"], "rewrite": "You can obtain a copy of your personal information through the following ways \"Operations APP-Settings-Customer Service Center\"."}
{"task": "rw_33.jsonl", "id": 48628, "text": "Under the premise of technical feasibility, if the data interface has been matched, we can also transmit your personal information copy directly to your specified third party according to your requirements.", "label": ["Important", "Edit/Control"], "rewrite": "Under the premise of technical feasibility, we can also transmit your personal information copy directly to your designated third party according to your requirements."}
{"task": "rw_33.jsonl", "id": 48629, "text": "7. respond to your above request", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48630, "text": "7.1 To ensure safety, you may need to provide a written request or prove your identity in other ways.", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48631, "text": "We may ask you to verify your identity first, and then process your request.", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48632, "text": "7.2 We will respond within 15 working days or the time limit stipulated in laws and regulations.", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48633, "text": "If you are not satisfied, you can also pass the following channels: send emails to GEENXINXI@zuoyebang.com, or call customer service: 400-611-0000.", "label": ["Important", "Contact Information"], "rewrite": "You can complain through the following channels: send emails to GEENXINXI@zuoyebang.com, or call customer service: 400-611-0000."}
{"task": "rw_33.jsonl", "id": 48634, "text": "7.3 For your reasonable requests, we do not charge fees in principle, but we will charge a certain cost fee depending on the request that repeats and exceeds reasonable limitations.", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48635, "text": "For those who have no repetition and need too much technical means (for example, need to develop new systems or fundamentally change the current practice), bring risks to others' legitimate rights and interests or very unrealistic (for example, information involved in backup tapes)We may refuse.", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48636, "text": "7.4, in the following circumstances, in accordance with the requirements of laws and regulations, we will not be able to respond to your above request:", "label": ["Important", "Edit/Control"], "rewrite": "In the following circumstances, in accordance with the requirements of laws and regulations, we will not be able to respond to your above requests:"}
{"task": "rw_33.jsonl", "id": 48637, "text": "7.4.1, related to the obligations stipulated by the Personal Information Controller's Performance of Laws and Regulations;", "label": ["Important", "Edit/Control"], "rewrite": "If your request is related to the obligation stipulated by the Personal Information Controller to fulfill its obligations, it may not be responding."}
{"task": "rw_33.jsonl", "id": 48638, "text": "7.4.2, directly related to national security and national defense security;", "label": ["Edit/Control", "Important"], "rewrite": "If your request is directly related to national security and national defense security, you may not be responded."}
{"task": "rw_33.jsonl", "id": 48639, "text": "7.4.3, directly related to public safety, public health, and major public interests;", "label": ["Important", "Edit/Control"], "rewrite": "Your request is directly related to public safety, public health, and major public interests and may not be responded."}
{"task": "rw_33.jsonl", "id": 48640, "text": "7.4.4, directly related to criminal investigation, prosecution, trial and execution judgment;", "label": ["Important", "Edit/Control"], "rewrite": "Your request is related to criminal investigation, prosecution, and trial, and may not be responded."}
{"task": "rw_33.jsonl", "id": 48641, "text": "7.4.5, personal information controller has sufficient evidence that the subject of personal information has subjective malicious or abuse of rights;", "label": ["Edit/Control", "Important"], "rewrite": "Personal information controller has sufficient evidence to indicate that the subject of personal information has subjective malice or abuse of rights, and may not respond to the request."}
{"task": "rw_33.jsonl", "id": 48642, "text": "7.4.6, for maintaining major legitimate rights and interests of the life and property of the subject of personal information or other individuals, but it is difficult to obtain the consent of my authority;", "label": ["Important", "Edit/Control"], "rewrite": "Out of the major legitimate rights and interests of the life and property of personal information subjects or other individuals, but it is difficult to get my consent, we may not be able to respond to the request."}
{"task": "rw_33.jsonl", "id": 48643, "text": "7.4.7, in response to the request of the subject of personal information, the legitimate rights and interests of the personal information subject or other individuals and organizations will be severely damaged;", "label": ["Important", "Edit/Control"], "rewrite": "We may not be able to respond to requests that exceed the storage range, exceed the reasonable limit, or the legitimate rights and interests of personal information subjects or other individuals and organizations will be seriously damaged."}
{"task": "rw_33.jsonl", "id": 48644, "text": "7.4.8, involved business secrets.", "label": ["Important", "Edit/Control"], "rewrite": "We may not be able to respond."}
{"task": "rw_33.jsonl", "id": 48645, "text": "6. How do we store your personal information", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48646, "text": "1. The personal information that we collect and generate in the operation of the People's Republic of China in principle is stored in China, and your personal information is stored in accordance with the storage period of storage periods in accordance with the laws and regulations of the People's Republic of China of the People's Republic of China.", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in domestic operations will be stored in China and stored according to the prescribed storage period."}
{"task": "rw_33.jsonl", "id": 48647, "text": "2., before the storage period is used to use the job gang or to send your personal information to the job gang, when you ask for deletion of the storage information or decide to stop using the operation to cancel the account, we will delete your personal information in timeEssence", "label": ["Data Retention", "Important"], "rewrite": "When you ask for deleting storage information or cancel your account, we will delete your personal information in time."}
{"task": "rw_33.jsonl", "id": 48648, "text": "At the same time, your personal information will only be retained within the time limit required for the purpose of reaching the cost of privacy policy, unless the law has compulsory depository requirements.", "label": ["Data Retention", "Important"], "rewrite": "Keep your personal information only within the time limit required for the service purpose, unless the law has other requirements."}
{"task": "rw_33.jsonl", "id": 48649, "text": "For example, the \"E -Commerce Law of the People's Republic of China\" requires that goods and service information and transaction information preservation time is not less than three years from the date of completion of the transaction;", "label": ["Data Retention", "Important"], "rewrite": "The preservation time of goods and service information and transaction information is not less than three years from the date of the transaction."}
{"task": "rw_33.jsonl", "id": 48650, "text": "The \"Implementation Opinions of the Ministry of Education and other six departments on regulating online training on -school\" stipulates that user behavior logs must be retained for more than 1 year.", "label": ["Data Retention", "Important"], "rewrite": "User behavior logs must be left for more than 1 year."}
{"task": "rw_33.jsonl", "id": 48651, "text": "We will conduct anonymized treatment as the user behavior logs involved in the service.", "label": ["Important", "Data Security"], "rewrite": "We will conduct anonymous processing user behavior logs."}
{"task": "rw_33.jsonl", "id": 48652, "text": "The criteria for judging the aforementioned period include:", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48653, "text": "2.1 Complete your related transaction purposes, maintain the corresponding transactions and business records, and deal with your possible queries or complaints;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48654, "text": "2.2 Guarantee platform to provide you with service security and quality;", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48655, "text": "2.3 Do you agree to a longer retention period;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48656, "text": "2.4 Whether there are other special agreements in the reserved period.", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48657, "text": "3. After your personal information exceeds the reservation period, the company will delete your personal information according to the requirements of the applicable laws, or make it anonymous processing (for exampleThe company will handle your personal information in accordance with relevant laws and regulations).", "label": ["Data Retention", "Specific Audiences", "Important"], "rewrite": "After exceeding the storage period, your personal information will be deleted or anonymous, except for other provisions of laws and regulations."}
{"task": "rw_33.jsonl", "id": 48658, "text": "If you cannot delete it in accordance with the relevant requirements, the company will explain this part of the matter.", "label": ["Data Retention", "Important"], "rewrite": "If personal information cannot be deleted in accordance with relevant requirements, the company will explain this part of the matter."}
{"task": "rw_33.jsonl", "id": 48659, "text": "7. How do we protect your personal information", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48660, "text": "1. We attach great importance to your personal information security.", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48661, "text": "We strive to take various reasonable physical, electronic and management security measures to protect your personal information, and do our best to make your personal information from being leaked, damaged or lost, including but not limited to SSL, information encryption, information encryptionAccess control of storage and data centers.", "label": ["Important", "Data Security"], "rewrite": "Take various reasonable physical, electronic and management security measures to protect your personal information, including but not limited to the access control of SSL, information encryption storage, and data centers."}
{"task": "rw_33.jsonl", "id": 48662, "text": "We have also adopted strict management of employees or outsourcing personnel who may be exposed to your personal information, including measures such as but not limited to adopting information access permissions control, signing confidentiality agreements with personnel contacting personal information, and operational conditions for monitoring such personnel.", "label": ["Important", "Data Security"], "rewrite": "Strictly restrict the scope of access to information and sign the confidentiality agreement with it."}
{"task": "rw_33.jsonl", "id": 48663, "text": "2. Although there are the above paragraph 1, please understand and understand that because there are various malicious means that there are various unpredictable or existing technologies, even if we have tried our best to take the necessary protection measures, your information, your informationIt is still possible to be leaked, damaged or lost.", "label": ["Important", "Data Security"], "rewrite": "Even if we try our best to take necessary protection measures, your information may still be leaked, damaged or lost."}
{"task": "rw_33.jsonl", "id": 48664, "text": "If you find that your account or password is about or leaked for any reason, you should contact us immediately so that we can take measures in time to prevent or reduce your related losses.", "label": ["Important", "Data Security"], "rewrite": "If the personal information discovered, please contact our customer service immediately."}
{"task": "rw_33.jsonl", "id": 48665, "text": "3. If we have a corporate acquisition, merger, reorganization, bankruptcy, merger, separation, etc., your information will continue to fulfill the protection obligations of the company, and we will notify you in the announcement, text messages, or other written ways to notify youItems", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If a company acquisition, merger, reorganization, bankruptcy, merger, separation, etc., your information will be protected by the main body of the company at that time and notify you the corresponding situation."}
{"task": "rw_33.jsonl", "id": 48666, "text": "If our products and services are stopped, we will stop collecting your information in time and notify you by announcement and text messages. At that time, we will delete or hide your information.", "label": ["Important", "Cessation of Operations"], "rewrite": "When stopping operation, we will make an announcement notice and delete or processes your personal information."}
{"task": "rw_33.jsonl", "id": 48667, "text": "8. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48668, "text": "1. We attach importance to the protection of personal information of minors. If you are a minor under the age of eighteen, please read this privacy policy carefully under your guardian and use it under the premise of obtaining your guardian's consent.Our service and submission of your personal information.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a minor, please use our services or provide information to us after reading this policy carefully or agreeing with us."}
{"task": "rw_33.jsonl", "id": 48669, "text": "If your guardian does not agree with the privacy policy, you should immediately stop using the service of the operation and refuse to provide personal information.", "label": ["Specific Audiences", "Important"], "rewrite": "If your guardian does not agree with the privacy policy, you should stop using and refuse to provide personal information."}
{"task": "rw_33.jsonl", "id": 48670, "text": "2. If you are a minor under the age of 14, please notify your guardian to read and accept our \"Homework for Children's User Privacy Policy\" and see it before you use your job help service and submit personal information, seek for personal information, seek personal information, seek personal information, and seek personal information.The consent and guidance of your guardian.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a child under the age of 14, please use services or provide information under the guidance of the guardian after the guardian's consent."}
{"task": "rw_33.jsonl", "id": 48671, "text": "3. For children's personal information collected by the guardian's consent, we will only use or disclose the information within the scope of laws and regulations permit, guardian clearly agree or protect children's users.", "label": ["Specific Audiences", "Important"], "rewrite": "For the personal information of the child's consent and collect, we will only use or disclose the scope of laws and regulations, the guardian's clear consent or protecting children's users."}
{"task": "rw_33.jsonl", "id": 48672, "text": "For personal information provided by children's users without the consent of the guardian, we will delete relevant information as soon as possible after receiving the notice from the guardian.", "label": ["Specific Audiences", "Important"], "rewrite": "If the personal information of minors was collected without the consent of the legal guardian, he would try to delete relevant information as soon as possible."}
{"task": "rw_33.jsonl", "id": 48673, "text": "Nine, the revision of this policy", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48674, "text": "We can modify this privacy policy from time to time, and the change of privacy policy will be announced by the operation to the platform or notify you in an appropriate way before revising the effectiveness.", "label": ["Policy Change", "Important"], "rewrite": "The change of privacy policy will be announced through the operation to the platform or notify you in an appropriate way before revising the effect."}
{"task": "rw_33.jsonl", "id": 48675, "text": "In these cases, if you continue to use our services, you will agree to the constraints of privacy policies that have been revised.", "label": ["Policy Change", "Important", "Risk"], "rewrite": "If you continue to use the service, it means the constraints of privacy policies agreed to be revised."}
{"task": "rw_33.jsonl", "id": 48676, "text": "10. Controversy jurisdiction", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48677, "text": "1. The solution of the signing, effectiveness, performance, and controversy of this privacy policy applies the laws of the People's Republic of China.", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48678, "text": "2. Disputes on this agreement shall be resolved through friendly negotiation. If the negotiation fails, the dispute will be submitted to the court litigation of the company where the company is located.", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48679, "text": "Eleven, contact us", "label": [], "rewrite": []}
{"task": "rw_33.jsonl", "id": 48680, "text": "If you have any questions or complaints or reports, you can contact us through the following ways, and we will reply to your request within 15 days.", "label": ["Important", "Contact Information"], "rewrite": "If you have any questions or complaints or reports, you can contact us through the following ways, and we will reply to your request within 15 days."}
{"task": "rw_33.jsonl", "id": 48681, "text": "Guangzhou Xiaolan Gang Network Technology Co., Ltd. Personal Privacy Safety Protection Center", "label": ["Important", "Contact Information"], "rewrite": "Guangzhou Xiaolan Gang Network Technology Co., Ltd. Personal Privacy Safety Protection Center"}
{"task": "rw_33.jsonl", "id": 48682, "text": "Address: No. 6030, Beijing Building, Beijing Building, No. 68, Beijing Road, Yuexiu District, Guangzhou", "label": ["Important", "Contact Information"], "rewrite": "Address: No. 6030, Beijing Building, Beijing Building, No. 68, Beijing Road, Yuexiu District, Guangzhou"}
{"task": "rw_33.jsonl", "id": 48683, "text": "Email: GEENXINXI@zuoyebang.com", "label": ["Important", "Contact Information"], "rewrite": "Email: GEENXINXI@zuoyebang.com"}
{"task": "rw_33.jsonl", "id": 48684, "text": "Contact number: 400-611-0000", "label": ["Important", "Contact Information"], "rewrite": "Contact number: 400-611-0000"}
{"task": "rw_33.jsonl", "id": 48685, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
