{"task": "rw_36.jsonl", "id": 49338, "text": "China Unicom APP user privacy policy", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49339, "text": "1. The scope and focus explanation of privacy policies", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49340, "text": "The first release date: 2011 [4] month [6] Day", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49341, "text": "The release date of this update: 2022 [2] month [26] Day", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49342, "text": "Effective date of this version: 2022 [2] month [26] Day", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49343, "text": "China Unicom (hereinafter referred to as \"we\") attaches great importance to the protection of users' privacy and personal information, and is committed to maintaining your trust in us.", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49344, "text": "We promise to take corresponding security measures to protect your personal information.", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49345, "text": "Please carefully read and understand the \"China Unicom APP user privacy policy such as\" our products or services \") before using the mobile business, broadband business, fixed -line business, and integration business (hereinafter collectively referred to as\" our products or services \").\"(Hereinafter referred to as\" privacy policy \"), especially the thick part of the font.", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49346, "text": "If you sign or click to confirm the privacy policy, it means that you have understood and agree with the entire content of the privacy policy.", "label": ["Policy Change", "Important"], "rewrite": "If you sign or click to confirm the privacy policy, it means that you understand and agree to the entire content of the privacy policy."}
{"task": "rw_36.jsonl", "id": 49347, "text": "If you have any questions about the content of this privacy policy, do not perform the next step, and contact us with contact information provided by this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49348, "text": "When you use our products or services, we will handle the relevant requirements of national laws and regulations and regulatory policies such as the Personal Information Protection Law such as the People's Republic of China.Personal information.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49349, "text": "We hope to explain to you through this privacy policy: When you use our products or services, what information will we collect information, why this information is collected, what this information does, and how we protect this information.", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49350, "text": "This \"Privacy Policy\" is the general privacy clause we use uniformly, suitable for all our products and services.", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49351, "text": "If a certain product or service we provides a separate privacy policy or a special agreement in the corresponding user service agreement, the privacy policy of the product or service will be preferred.", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49352, "text": "The content that this product or service privacy policy or user service agreement is not covered is based on the content of this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49353, "text": "This privacy policy includes the following:", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49354, "text": "How do we collect and use your personal information;", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49355, "text": "How do we use cookies and similar technologies;", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49356, "text": "How do we share, transfer, and publicly disclose your personal information;", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49357, "text": "How do we protect your personal information;", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49358, "text": "How can we protect the personal information of minors;", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49359, "text": "How can your personal information be stored and transferred globally;", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49360, "text": "How to update this privacy policy;", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49361, "text": "Your rights;", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49362, "text": "How to contact us.", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49363, "text": "2. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49364, "text": "Personal information refers to the various information related to the recognized or recognizable natural person recorded in electronics or other methods, excluding information after anonymous processing.", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49365, "text": "We will follow the principles of legitimate, legal, and necessary. For the following purposes described in this privacy policy, collect and use personal information that you take the initiative to provide or use or/or services in the process of using products and/or services in the process of using products and/or servicesAnd get your personal information from a third party.", "label": ["Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "Following the principles of legitimate, legal, and necessary, for the purpose of this privacy policy, collect and use the information generated during the process of using the product or service and obtain your relevant personal information from a third party."}
{"task": "rw_36.jsonl", "id": 49366, "text": "If we want to use your personal information for other purposes that have not been stated in this privacy policy, or use the information collected based on specific purposes for other purposes, we will inform you in a reasonable way, and again before useGet your consent.", "label": ["Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "If your personal information exceeds the purpose of this policy or agreed, it will be told you again and obtain your consent again."}
{"task": "rw_36.jsonl", "id": 49367, "text": "(1) Based on basic functions you need to authorize us to collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49368, "text": "Our products or services include some basic functions, which are necessary for implementing products or services.", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49369, "text": "We collect, save, and use the following information to achieve the above functions.", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49370, "text": "In other words, if you do not provide relevant information, you will not be able to enjoy the products or services we provide.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49371, "text": "Specifically include:", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49372, "text": "1. Personal information you use when you log in to China Unicom APP", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49373, "text": "When using China Unicom's mobile phone number, broadband account number, fixed -line account number (referred to as \"Unicom users\"), this APP will use the name of the online mobile phone number, broadband account, fixed -line account nameInformation, package usage, package cost consumption and other information shows the display of information;", "label": ["Important", "Usage"], "rewrite": "When Unicom users use this APP, this APP will conduct information such as the name of the access to the net, the information of the access person, the use of package use, and the consumption of package costs."}
{"task": "rw_36.jsonl", "id": 49374, "text": "Due to the names of those who logged in mobile phone numbers, broadband accounts, fixed -line accounts, the names of the net, and the information on the Internet, you have been provided in accordance with the real -name system when applying for China Unicom's mobile phone number, broadband, and fixed -line products. ThereforeFill in again;", "label": ["Important", "First Party Collection Information"], "rewrite": "When you apply for mobile phone numbers, broadband, and fixed -line products in China, you have no need to fill in the information provided by the real -name system as required by the real -name system."}
{"task": "rw_36.jsonl", "id": 49375, "text": "If you need to change information from the Internet, please go to China Unicom's physical business hall to handle it.", "label": ["Important"], "rewrite": "Please go to China Unicom's physical business hall for change."}
{"task": "rw_36.jsonl", "id": 49376, "text": "2. Personal information you use when using network transaction services", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49377, "text": "When you use this APP for the network transaction services provided by you, buy a product (non -number card package, broadband network product) or participating in marketing activities to get a winning product that needs to be used in marketing activities.You need to get your consignee's name, the consignee contact phone number, and the consignee address information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When using network transaction services, if you involve logistics delivery, this APP needs to obtain your consignee's name, the consignee contact phone number, and the consignee address information."}
{"task": "rw_36.jsonl", "id": 49378, "text": "3. Personal information you use when you go through the connection procedures of Unicom business in the APP", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49379, "text": "According to the \"Regulations on the Regulations on the Registration of True Information Registration of Telephone Users\" (Regulations on the Registration of True Information of Telephone users \"(Ministry of Industry and Information Technology No. 25), you can apply for card activation, broadband new installation appointment, government and enterprise online, broadbandIn the area, Wo Xiao, and network access procedures, we must provide us with valid documents and provide real identity information;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "You must provide valid document information and real identity information when you apply for card activation, broadband new installation appointment, government -enterprise online, broadband zone, Wo small number and network access procedures."}
{"task": "rw_36.jsonl", "id": 49380, "text": "At the same time, in order to verify the accuracy and integrity of this type of information, we will verify and verify the information that you provide with the information that you provide with your information (government agencies, institutions, and commercial institutions).Get your image information to retain your personal information to identify your identity and go through the network access procedures on the APP.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Verify the information you provided with your information with your information, and obtain your image information to retain your personal information to verify your identity and go through the network access procedures."}
{"task": "rw_36.jsonl", "id": 49381, "text": "In your process of applying for the above -mentioned Unicom business, we will collect your following information:, personal user name, business license, album information, regional, valid communication contact information, valid certificate type and number, certificate registration information, read mobile phone status statusObtained image information obtained with identity, photo or online video, business information, distribution address, installation address and location information of your processing.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your personal user name, business license, album information, regional, valid communication contact information, valid documents and numbers, certificates registration information, read mobile phone status and identity, image information, business information, distribution, distribution, distribution, distribution, distribution, distributionAddress, installation address and location information."}
{"task": "rw_36.jsonl", "id": 49382, "text": "If you refuse to provide personal valid documents and real information, you will not be able to go through the network access procedures, and we will not be able to use our products or services.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide personal valid documents and real information, you will not be able to go through the network access procedures."}
{"task": "rw_36.jsonl", "id": 49383, "text": "4. Personal information you use when you pay and query the balance", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49384, "text": "In order to pay directly in the APP and query the remaining calls, traffic and text messages in your package, we will collect your order information, service detailed forms (including calling fees, point -to -point SMS, and point -to -point MMS fees, value -added, value -added,Business fees for details, online traffic expenses for mobile phone online, wireless Internet card traffic expenses, broadband Internet internet details, WLAN traffic expenses, query records, online records, online shopping records), and communication records, consumption information, bill information, bill information, bill information, bill information, bill information, bill information, bill information, Call records, address book, and terminal information to ensure that you can use our services normally, and to achieve your accurate billing charges and accurate balance display.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your order information, service details, and communication records, consumption information, bill information, call records, address book, terminal information to ensure that you use services and provide you with accurate display of charges and margins."}
{"task": "rw_36.jsonl", "id": 49385, "text": "5. Personal information you use when you apply for business and query business in the APP", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49386, "text": "In order to make you more conveniently use the basic service in the APP or query the basic services, specifically to query my basic information, package changes, I have ordered, local integration acceptance, different land integration acceptance, and value -added business withdrawal, we will collect yourOrder package information, APP itself screenshot information, album information, certificate registration information, invoice head, value -added business information, to ensure that you can use the above services in the APP without business processing conditions.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your ordering package information, APP itself screenshot information, album information, document registration information, invoice heading, value -added business information, to provide basic services for processing or inquiry."}
{"task": "rw_36.jsonl", "id": 49387, "text": "6. Personal property information you used when enjoying equity services or participating in activities", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49388, "text": "In order to facilitate your inquiry about the equity information obtained in the APP, we will collect points, call vouchers, traffic packages, electronic coupons, vouchers, voice packages, card vouchers, and other physical categories you get during the process of enjoying equity services or participating in the activity.Prize information and show you on the corresponding event page.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your points, phone bills, traffic packages, electronic coupons, exchange coupons, vocal packages, card vouchers, and other physical prizes to show you."}
{"task": "rw_36.jsonl", "id": 49389, "text": "7. Your SMS sending permissions and reading information permissions in the APP", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49390, "text": "In the business scenario of SMS verification code login, detailed query, traffic package ordering, account sales, epidemic SMS query, air access writing card and other business scenarios, we need you to authorize SMS sending and read permissions to obtain your SMS information content and reply to replyThe real identity SMS verification code you need.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "Get your SMS sending and reading permissions to obtain your text message content and reply to the real identity SMS verification code."}
{"task": "rw_36.jsonl", "id": 49391, "text": "8. Personal address book information in the APP", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49392, "text": "For the convenience of using calls for you, we need to obtain your authority reading permissions.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "Get your communication records for your communication."}
{"task": "rw_36.jsonl", "id": 49393, "text": "9. In order to facilitate your better use of the new and old version of the APP, and the service that continues to show you the stable APP, we need to obtain your terminal equipment brand information, equipment manufacturer information, and the currently used APP version number.To distinguish between new and old versions, as well as the development and adaptation related work of different platforms (Android/iOS/outer web pages).", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "Get your terminal equipment brand information, equipment manufacturer information, and the currently used APP version number, which is used to distinguish between new and old versions and the development and adaptation of different platforms."}
{"task": "rw_36.jsonl", "id": 49394, "text": "10. In order to ensure the secure and stable operation of services to you, we need to record the Unicom service category, methods and equipment models, IP addresses, equipment software version information, device identification code, equipment identification, location information, network usage habitsAnd other log information related to China Unicom services are used for risk control verification.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Records log information related to Unicom services for risk control verification."}
{"task": "rw_36.jsonl", "id": 49395, "text": "11. In order to ensure the basic APP webpage loading service for you, we use the system framework Chromium. We need to obtain your IMEI, location information, android_id permissions for loading the H5 webpage.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Get your IMEI, location information, android_id permissions for loading the H5 webpage."}
{"task": "rw_36.jsonl", "id": 49396, "text": "(2) The situation of the personal information you can provide based on the extension function", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49397, "text": "In order to enhance your user experience, the following expansion functions may appear when you use our products or services. At that time, we will obtain your authorization consent through pop -ups and other methods before collecting and using your personal information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Get your authorization consent before collecting and using your personal information to provide expansion functions."}
{"task": "rw_36.jsonl", "id": 49398, "text": "If you do not provide these personal information, you can still use our basic products or service functions, but you may not be able to use some expansion functions.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49399, "text": "1. In order to use this client, you can load H5 page, start page video, and online upgrade client new versions normally.Multimedia content such as sound, video.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "Get the right to the mobile terminal storage limit to collect multimedia content such as pictures, sounds, videos and other multimedia content of your mobile terminal with normal loading page."}
{"task": "rw_36.jsonl", "id": 49400, "text": "If you refuse to authorize this permissions, the functions involved in the APP may not be used normally.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "Refusing to provide mobile terminal storage permissions will cause functions related to this to be unavailable."}
{"task": "rw_36.jsonl", "id": 49401, "text": "2. In order to facilitate your use of the density release function on the APP, we will obtain your mobile phone recognition code after your authorization consent. If you do not authorize this permission, you can only log in through the APP through the service password or SMS random code.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Get your mobile phone recognition code to facilitate your use of density -free logging function."}
{"task": "rw_36.jsonl", "id": 49402, "text": "3. Provide you with the ability to share. When you enter the application and any functional page, we need to obtain your clipplane board and cut plate content information. If you do not authorize, you will not be able to use this functional service.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Get your clipplane and cutting plate content information to facilitate your use of sharing function."}
{"task": "rw_36.jsonl", "id": 49403, "text": "4. In order to facilitate your direct call in the APP, we need to get your call permissions. If you do not authorize the permissions, you will not be able to use the corresponding functional services.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "Get your call permissions so that you can call directly in the app."}
{"task": "rw_36.jsonl", "id": 49404, "text": "5. When visiting the \"Wo Video\" business, we need to obtain your device name and equipment type permissions to better show you the video content.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "Get your device name and equipment type permissions in order to provide \"Wo Video\" business."}
{"task": "rw_36.jsonl", "id": 49405, "text": "If you do not provide the aforementioned information, you may not be able to provide you with corresponding video services, but it does not affect your normal use of other functions.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49406, "text": "6. When you choose a communication recorder in the intimate and affection function, you bind the group, add friends to the Wozhisu function for interaction, invite friends to log in to China Unicom APP in recommending gifts, and in my membership functions in my member functionWhen you look at the list of friends, we will obtain the communication recording/writing permissions after you authorize the consent, including obtaining the name of the contact person and the mobile phone number information of the contact person.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "After you have authorized consent, obtain the communication recording/writing permissions, contact names, contact mobile phone number information for this machine, so that you can use intimacy and affection to pay function."}
{"task": "rw_36.jsonl", "id": 49407, "text": "If the permissions are not authorized, the right will not be able to use the corresponding functional services.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49408, "text": "7. In order to facilitate your use of nearby business hall functions in the APP, we have used the positioning capacity of (NSLOCATIONAYSANDWHENUSEUSAGESCRIPTION)/terminal. It is used for your geographical location for a single positioning and requires your mobile phone positioning permissions.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "Get your mobile phone positioning permissions for a single positioning of your geographical location in order to make you use the function of nearby business halls."}
{"task": "rw_36.jsonl", "id": 49409, "text": "8. In order to provide you with nearby life services, we need to obtain the positioning authority of your current equipment for a single positioning of your geographical location.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "Get the positioning authority of your current device so that you can provide nearby life services."}
{"task": "rw_36.jsonl", "id": 49410, "text": "9. To facilitate your normal appointment to use related activities in the APP to remind the service. We need to obtain your calendar permissions to open the calendar -related newly built/modify/delete and other regular reminder services.Calendar, but does not affect your normal use of the client's other functions.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "Get your calendar permissions to turn on regular reminder services so that you use related activities to remind the service."}
{"task": "rw_36.jsonl", "id": 49411, "text": "10. In order to provide you with old -fashioned services, we will read your equipment model on the homepage and mall to provide the old machine valuation function. If you do not provide the aforementioned information, you may not be able to provide you with the corresponding service.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "Read your device model for providing old machine valuation functions."}
{"task": "rw_36.jsonl", "id": 49412, "text": "11. In order to provide you with the purchase terminal service, you need to get your location information, check the nearby business hall for you, support you to choose the business hall with inventory to make your own, or contact you to handle your business. If you do not provide the aforementioned information, May not be able to provide you with corresponding services.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Get your location information to support you to choose a business hall with inventory to make your own, or the salesperson contacts you to handle your business."}
{"task": "rw_36.jsonl", "id": 49413, "text": "12. For your convenience of feedback and online customer service business, we need to obtain your shooting and album permissions. If you refuse to authorize us to authorize this permissions, we will not be able to use the corresponding functional services.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "Get your shooting and album authority in order to provide feedback and online customer service business."}
{"task": "rw_36.jsonl", "id": 49414, "text": "(3) China Unicom APP involves embedded third -party code, plug -in transmission personal information", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49415, "text": "In order to provide you with product services, or to improve the quality of products and services, or due to the necessary and reasonable needs of product service security, we may follow the requirements of relevant laws and regulations and regulatory policies or with your authorization from related companies, from related companies,Partners and other trusted third parties receive your personal information and other information.", "label": ["Important", "First Party Collection Information"], "rewrite": "May receive your personal information and other trust from related companies, partners and other trusted third parties."}
{"task": "rw_36.jsonl", "id": 49416, "text": "For example, when you order our products through our affiliated company and business partner website, the booking information you provide to it may be transferred to us so that we can handle your order.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "When you order our products through our affiliated company and business partner website, the booking information you provide may be transferred to us."}
{"task": "rw_36.jsonl", "id": 49417, "text": "For the third-party software tool development package (\"SDK\") we use, you can check the link or related privacy of its official website or related privacy through the \"China Unicom APP-Mine-Equipment of Information Content-Third Party Sharing Data Description\"Protection description.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can check the third-party official website link or related privacy protection instructions through the \"China Unicom APP-Mine-Settings-Requesting information content-third-party sharing data description\"."}
{"task": "rw_36.jsonl", "id": 49418, "text": "We will conduct strict security testing of third -party SDKs and ask partners to take strict measures to protect your personal data.", "label": ["Important", "Data Security"], "rewrite": "Strict security testing of third -party SDK requires them to take measures to protect your personal data."}
{"task": "rw_36.jsonl", "id": 49419, "text": "When meeting the new service needs and changes in business functions, we may adjust the third -party SDK we access and publicize the latest situation of accessing the third -party SDK in time.", "label": ["Important", "First Party Collection Information"], "rewrite": "When meeting the new service needs and changes in business functions, the access may be adjusted and explained to you in time."}
{"task": "rw_36.jsonl", "id": 49420, "text": "Please note that the third -party SDK may have changed the data type due to the version upgrade and strategic adjustment. For details, please refer to the official explanation of its publicity.", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49421, "text": "List the following as follows:", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49422, "text": "1., Xunfei AIUI, SDK: In order to facilitate your use of voice recognition functions, we used Xunfei AIUI, SDK, you need to obtain your WiFi information, location information, recording authority, IMEI (international mobile device recognition code), IMSI (IMSI (IMSI)International mobile user identification codes), MAC address, and unique device recognition code (Android_id, Bssid), if you do not provide the aforementioned information, you may not be able to provide you with the corresponding voice search function, but it does not affect your normal use of other functions of the client.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Use Xunfei AIUI SDK to obtain your WiFi information, location information, recording authority, IMEI, IMSI, MAC address, and unique device recognition code in order to facilitate your use of voice recognition functions."}
{"task": "rw_36.jsonl", "id": 49423, "text": "2., Baidu Map SDK: When providing you with local unicom services and finding the function of nearby business halls, we will use Baidu Map SDK. After you authorize your consentBssid), region, equipment type (device name, device model), upload mobile phone style information.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "Use Baidu Map SDK to obtain your location permissions, unique device recognition codes, regions, and equipment types in order to make you use the function of finding nearby business halls."}
{"task": "rw_36.jsonl", "id": 49424, "text": "Among them, when Baidu AR presents image processing, you need to obtain your identity authentication information and equipment control vibrator permissions.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "Usage"], "rewrite": "Get your identity authentication information and equipment control the vibrator permissions for Baidu AR presentation image processing."}
{"task": "rw_36.jsonl", "id": 49425, "text": "If you do not provide the aforementioned information, you may not be able to provide you with corresponding positioning services, but it does not affect your normal client's other functions.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49426, "text": "3., Baidu positioning SDK: In order to use nearby life services, we use Baidu positioning SDK, and we need to obtain your WiFi information, task lists, BSSID, SSID, location information.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Use Baidu to locate SDK to obtain your WiFi information, task lists, BSSID, SSID, location information, so that you can use nearby life services."}
{"task": "rw_36.jsonl", "id": 49427, "text": "If you do not provide the aforementioned information, you may not be able to provide you with corresponding positioning services, but it does not affect your normal client's other functions.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49428, "text": "4., FACE ++ Living recognition SDK: In order to activate the newly -entered network number, you can upload your avatars via this APP. At the same time, this APP can conduct real -name activity verification on you.Later, obtain the camera, audio, facial features, albums, and microphone rights. If you refuse to provide the aforementioned permission access, you may not be able to provide you with corresponding living identification services, but it does not affect your normal use of other clients.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "Use FACE ++ Living recognition SDK to obtain the camera, audio, facial features, albums, and microphone permissions in this machine, so that you can upload your avatars for real -name activity verification."}
{"task": "rw_36.jsonl", "id": 49429, "text": "5. WeChat and Alipay SDK: In order to facilitate your use of online charging phone billing functions, we use WeChat and Alipay SDK, and we may need to visit your equipment information (IMEI number), read and write storage, ICCID, Android_id, MAC address, SSID, IMSI, BSSID, View network connection permissions to ensure your normal payment.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "Use WeChat and Alipay SDK to access your device information, read and write storage, ICCID, Android_id, MAC address, SSID, IMSI, BSSID, and viewing network connection rights to ensure your normal payment."}
{"task": "rw_36.jsonl", "id": 49430, "text": "Among them, integrated Ali UTDID2, SDK, you need to obtain complete network access permissions, check the network status, and view WIFI status to assist the development of payment functions.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "Usage"], "rewrite": "Use Ali's UTDID2 SDK to view the network status and view WiFi status to assist the development of payment functions."}
{"task": "rw_36.jsonl", "id": 49431, "text": "If you do not provide the aforementioned information, you may not be able to provide you with the corresponding online payment services, but it does not affect your normal use of other functions of the client.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49432, "text": "6., HMS, CORE, SDK: In order to be able to send you Unicom service notification in time, we use HMS, Core, SDK, you may need to visit your own machine equipment information (IMEI number) to collect your mobile phone model and system typesSystem version information is used to achieve APP push services.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Use HMS Core SDK to collect your mobile phone model, system type, and system version information to achieve APP push services."}
{"task": "rw_36.jsonl", "id": 49433, "text": "The data analysis module in SDK needs to use a complete network access permissions to view network status and application upgrade.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "The data analysis module in the SDK needs to obtain a complete network access permissions and view network status and application upgrade."}
{"task": "rw_36.jsonl", "id": 49434, "text": "When the push message reaches the application interface, the red dot message reminds the red dot message in the corresponding position of the APP icon. This function will obtain the red dot notification permissions that you use the terminal.", "label": ["Usage", "Permission Acquisition"], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49435, "text": "If you do not want to receive these notifications or information, you can close the message notification in the terminal device settings. If you do not provide the aforementioned information, you may not be able to provide you with corresponding notification services, but it will not affect your normal use of other functions of the client.", "label": ["Important", "Edit/Control"], "rewrite": "You can close the message notification in the terminal device settings."}
{"task": "rw_36.jsonl", "id": 49436, "text": "7. QQ, Sina Weibo SDK: In order to facilitate your use of the sharing function, we used QQ and Sina Weibo SDK, and we may need to visit your machine equipment information (IMEI number), read and write storage, view network connection permissions,, viewing network connection permissions, and viewing network connection permissions.Android_id is used to ensure your normal sharing.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "Use QQ and Sina Weibo SDK to access your equipment information, read and write storage, view network connection permissions, android_id to ensure your normal sharing."}
{"task": "rw_36.jsonl", "id": 49437, "text": "If you do not provide the aforementioned information, you may not be able to provide you with corresponding sharing function services, but it does not affect your normal use of other functions.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49438, "text": "8. Mobtech, Sharesdk,: In order to facilitate your use of the sharing function, we use third -party (Shanghai Youkun Information Technology Co., Ltd., hereinafter referred to as \"Mobtech\") Mobtech, Sharesdk, service provides you with MOBTECH, Sharesdk functions.", "label": ["Important", "Usage"], "rewrite": "Use the Mobtech Sharesdk service to provide you with the Mobtech Sharesdk function."}
{"task": "rw_36.jsonl", "id": 49439, "text": "If you authorize the service, Mobtech, Sharesdk will collect your system operating information, complete network access permissions, network status information, Android, ID, iOS advertising logo (IDFA), international mobile device recognition code (IMEI), anonymousEquipment identifier (OAID), international mobile user identification code (IMSI), application list information, device manufacturers, equipment models, and current base station information, mainly used to share data statistics.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "Mobtech Sharesdk will collect your system operation information, complete network access permissions, network status information, Android ID, iOS advertising identifier, etc. for sharing data statistics."}
{"task": "rw_36.jsonl", "id": 49440, "text": "Regarding the types, uses, personal information protection rules and exit mechanisms collected by Mobtech, please refer to the terms of privacy (www.mob.com/about/policy) in the Mobtech official website (www.mob.com).", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49441, "text": "If you do not provide the aforementioned information, you may not be able to provide you with corresponding sharing services, but it does not affect your normal use of other functions.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49442, "text": "9., IJKPlayer, SDK: For the convenience of using the video playback function, we use iJKPlayer, SDK, you need to authorize the terminal to prevent the mobile phone from entering the dormant state.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "Usage"], "rewrite": "Using IJKPlayer SDK, you need to authorize the terminal to prevent your mobile phone from entering the dormant state."}
{"task": "rw_36.jsonl", "id": 49443, "text": "If you do not provide the aforementioned information, you may not be able to provide you with the corresponding continuous video service, but it does not affect your normal use of the client's other functions.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49444, "text": "10. In order to improve the security of APP application services and functions, we have used the security SDK, and we may need to obtain a personal BSSID, mobile phone number, SIM card card number (ICCID), latitude and longitude, international mobile device recognition code(IMei), international mobile user identification code (IMSI), location information, so that you have a better security experience.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Use the security SDK to obtain personal BSSID, mobile phone number, SIM card number, latitude and longitude, international mobile device identification code, international mobile user identification code, location information to improve the security of services."}
{"task": "rw_36.jsonl", "id": 49445, "text": "If you do not provide the aforementioned information, you may not be able to provide you with corresponding security services, but it does not affect your normal client's other functions.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49446, "text": "11. ZXING, SDK: For the pictures you see in the app, the pictures you see in the app are clearer, we use ZXING's SDK, you need to obtain your network status, read storage, camera permissions, add image processing and increase image processing when scanning QR codes and scan the QR code.Visuality of page pictures.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "Use ZXING's SDK to obtain your network status, read storage, camera permissions, etc. to increase the visuality of image processing and page pictures."}
{"task": "rw_36.jsonl", "id": 49447, "text": "If you do not provide the aforementioned information, you may not be able to provide you with the corresponding identification QR code function, but it does not affect other functions of your normal client.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49448, "text": "The operating system version number, time zone, networking method, whether jailbreak, terminal model, baseband version, APP, package name, latitude, longitude, merchant app package information, if you do not provide the aforementioned information, you may not be able to provide you with corresponding payment services.But it does not affect other functions of your client normally.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "Use UnionPay online cashier SDK to obtain your terminal information so that you can provide you with more payment options."}
{"task": "rw_36.jsonl", "id": 49449, "text": "13., Tencent Bugly, SDK: In order to collect the abnormalities in the process of using the APP and the problem of stuttering to optimize the APP, we use Tencent Bugly, SDK, you may need to obtain mobile phone status, complete network access permissions, network status, IMEI, IMEI, WiFi status, read logs.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "Use Tencent Bugly SDK to obtain mobile phone status, complete network access permissions, network status, IMEI, WiFi status, and read logs to find abnormalities."}
{"task": "rw_36.jsonl", "id": 49450, "text": "If you do not provide the aforementioned information, you may not be able to provide you with a stable APP page display service, but it does not affect your normal use of the client's other functions.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49451, "text": "14., Tencent Hand Q game SDK: When you use the game service in this APP, we use Tencent's Q game SDK, and you may need to obtain your login information, device information, and network -related information.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Use Tencent Hand Q game SDK to obtain your login information, equipment information, and network -related information in order to provide game services."}
{"task": "rw_36.jsonl", "id": 49452, "text": "If you do not provide the aforementioned information, you may not be able to provide you with the corresponding mini -game service, but it does not affect your normal use of other functions.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49453, "text": "15. Baidu audio and video live, SDK: In order to use the live viewing function, including entering the live broadcast room, sending barrage, collection, attention, etc., we used Baidu audio and video live broadcast, SDK, need to collect and display the information you uploadedThe content contains your comments, your nicknames, avatars, and other published content. You need to authorize the access permissions of the following content: camera, camera, photos, microphone, address book, location information, equipment information, log information, reading/writing/writingEnter the external memory card, mobile phone status and identity, location information, and WLAN connection status authority.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "Use Baidu Audio Video Live SDK, collect and display the information you uploaded, and obtain access permissions for cameras, cameras, photos, etc., so that you can use the live viewing function."}
{"task": "rw_36.jsonl", "id": 49454, "text": "When watching and advertising information display live broadcast, you need to obtain complete network access permissions, check the network status, check the WiFi status, and prevent the mobile phone from entering the dormant state and searching the currently running applications.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "When watching live watching and advertising information, obtain a complete network access permissions, check the network status, check the WIFI status, and prevent the mobile phone from entering the dormant state and retrieve the currently running applications."}
{"task": "rw_36.jsonl", "id": 49455, "text": "If you do not provide the aforementioned information, you may not be able to provide you with a live broadcast service, but it does not affect your normal client's other functions.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49456, "text": "16., pangolin SDK: Advertising in this APP uses a pangolin SDK. In order to ensure the stable operation of the screen and other advertisements, you need to collect your hardware model, operating system version number, IP address, WLAN, access point, software version number, Network access method, network type, network status, operation log, use log, Android_id, service log information, equipment application installation list, task list.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Use a pangolin SDK to collect your hardware model, operating system version number, IP address, WLAN and other information."}
{"task": "rw_36.jsonl", "id": 49457, "text": "If you do not agree to provide the aforementioned information, you may not be able to provide you with corresponding pangolin advertising services, but it does not affect other functions of your client normally.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49458, "text": "17., Tencent Coral Advertising SDK: The advertisements in this APP are provided to you by our affiliated parties, third parties or us with software service providers.You need to get your device information (IMEI number), network -related information and geographical location information. If you do not provide the aforementioned information, you may not be able to provide you with corresponding advertising services, but it does", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "Use Tencent Coral Advertising SDK to obtain your equipment information, network -related information and geographical location information to provide personalized recommendation services for advertising services and content."}
{"task": "rw_36.jsonl", "id": 49459, "text": "18. Outstanding SDK: In order to facilitate your browse business advertisement, we use the excellent SDK, and we need to visit your personal location, equipment manufacturer, equipment model, operating system (such as, iOS, Android)Such as tablet computers), device attributes related to screen size and direction, network connection type, IP address, application identifier, application version, device operating system version, WIFI network status, advertising identifier (IDFA), or OAID.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "Use the excellent SDK to access your personal location, equipment manufacturer, equipment model, operating system and other systems or network information, so that you can browse the screen business advertisement."}
{"task": "rw_36.jsonl", "id": 49460, "text": "If you do not provide the aforementioned information, you may not be able to provide you with the corresponding advertising services, but it does not affect your normal use of other functions.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49461, "text": "19., Douyin Development Platform SDK: In order to facilitate your browse business advertisement, we used the Douyin Development Platform SDK, and we need to obtain your WiFi information, the only device recognition code (Android_id, BSSID), and the international mobile device identification code (IMEI), location information, albums, equipment application installation lists, international mobile user identification codes (IMSI), task lists, network operators, MAC addresses, SSID permissions.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "Use the Douyin Development Platform SDK to obtain your WiFi information, unique device recognition code, international mobile device identification code, location information and other information, so that you can browse the screen business advertisement."}
{"task": "rw_36.jsonl", "id": 49462, "text": "If you do not provide the aforementioned information, you may not be able to provide you with the corresponding advertising services, but it does not affect your normal use of other functions.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49463, "text": "20. Tencent Excellence SDK: In order to provide you with appropriate promotion services in the screen advertisement, we use Tencent Exchange SDK (Tencent Advertising) to obtain complete network access permissions, view network status permissions, view viewing, viewWIFI status, equipment models, equipment manufacturers, equipment names, task lists, Android_id, SSID, IMEI, BSSID, equipment application installation list and authority.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "Use Tencent's excellent exchange SDK to obtain complete network access permissions, view network status permissions, view WIFI status, etc. to provide appropriate promotion services."}
{"task": "rw_36.jsonl", "id": 49464, "text": "If you do not provide the aforementioned information, you may not be able to provide you with the corresponding advertising services, but it does not affect your normal use of other functions.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49465, "text": "21. Woyou SDK: In order to facilitate your use of the game -free function, we use the Woyou SDK, and we need to access your equipment information (IMEI number), read and write storage, obtain network connection, status information and permissions.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "Use the Woyou SDK to access your equipment information, read and write storage, obtain network connection, status information and permissions in order to use the game -free function."}
{"task": "rw_36.jsonl", "id": 49466, "text": "You need to use your mobile phone number and APP package name when opening the virtual network (VPN), and at the same time provide you with the monitoring network traffic function to ensure your normal outflow.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Use your mobile phone number and APP package name when turning on the virtual network, while providing the monitoring network traffic function."}
{"task": "rw_36.jsonl", "id": 49467, "text": "If you do not provide the aforementioned information, you may not be able to provide you with the corresponding -free service, but it does not affect your normal client's other functions.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49468, "text": "22. Web certificate SDK: When you need to open an electronic certificate or download the electronic voucher function through the China Unicom APP, we use the online functional voucher (\"Internet certificate\") SDK, and we need to do it after you authorize the consent.For living recognition verification and authentication, the verification information you need to obtain include your name, ID number, network certificate authentication code, and biological characteristics. If this permission is not grantedOther functions.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "When you open an electronic certificate or download the electronic voucher function, use the online functional voucher SDK to obtain your name, ID number, network certificate authentication code, and biological characteristics."}
{"task": "rw_36.jsonl", "id": 49469, "text": "23., Webratc, SDK and AFNETWORKING, SDK: We have integrated the aforementioned two third -party SDKs to improve the support of basic capabilities.", "label": ["Important", "Usage"], "rewrite": "Integrated Webratc SDK and Afnetworking SDK to improve the support of basic capabilities."}
{"task": "rw_36.jsonl", "id": 49470, "text": "24. Chromium, SDK: In order to provide you with better and better services, we will use the aforementioned SDK to obtain information such as your SSID, WIFI information, equipment application installation lists, etc., to improve the support of basic capabilities.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "Use Chromium SDK to obtain information such as your SSID, WIFI information, and equipment application installation lists to improve the support of basic capabilities."}
{"task": "rw_36.jsonl", "id": 49471, "text": "(4) The rules of handling your personal information", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49472, "text": "1. Please understand that as this APP function is further enriched, when the new service or function is added in the future, if it involves obtaining user authorization, we will clearly remind you through pop -up windows, page prompts, etc. before collecting your personal information and page prompts.After obtaining your authorization consent, you will obtain the authority required for the function.", "label": ["Important", "Data Security"], "rewrite": "When new services or functions involve user authorization, before collecting personal information, you can clearly remind you through pop -up windows, page prompts and other methods to obtain permissions after obtaining your authorization consent."}
{"task": "rw_36.jsonl", "id": 49473, "text": "If you have not obtained your authorization, we will not collect and use relevant information. You may not be able to use this product or service and function, but it does not affect your existing products or services and functions.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49474, "text": "2. In the process of collecting personal information, we will strictly abide by relevant laws and regulations and regulatory policies, and do not collect any personal information for collecting any laws and regulations and regulatory policies.", "label": ["Important", "First Party Collection Information"], "rewrite": "Personal information that is not collected without collecting any laws and regulations and regulatory policies."}
{"task": "rw_36.jsonl", "id": 49475, "text": "3. You understand and agree, in the following situations, we do not need to obtain your authorization consent:", "label": ["Important", "First Party Collection Information"], "rewrite": "You understand and agree, in the following situations, we do not need to obtain your authorization consent:"}
{"task": "rw_36.jsonl", "id": 49476, "text": "(1) It is necessary for the contract to establish and fulfill your contract;", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to establish and fulfill your contract with your contract, no authorization is required."}
{"task": "rw_36.jsonl", "id": 49477, "text": "(2) To fulfill the statutory duties or must", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to fulfill the statutory duties or the required regulations, no authorization is required."}
{"task": "rw_36.jsonl", "id": 49478, "text": "(3) In order to deal with emergencies, or in urgent situations to protect your life, health and property security;", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to cope with emergencies, or in urgent situations, it is necessary to protect your life and health and property security, and no authorization is required."}
{"task": "rw_36.jsonl", "id": 49479, "text": "(4) Treatment your own or other legal information within a reasonable range;", "label": ["Important", "First Party Collection Information"], "rewrite": "To handle your own or other legal personal information within a reasonable scope, no authorization is required."}
{"task": "rw_36.jsonl", "id": 49480, "text": "(5) It is related to national security and national defense security;", "label": ["Important", "First Party Collection Information"], "rewrite": "Data collection and use directly related to national security and national defense security does not need to be authorized."}
{"task": "rw_36.jsonl", "id": 49481, "text": "(6) Related to public safety and major public interests;", "label": ["Important", "First Party Collection Information"], "rewrite": "Data collection and use directly related to public safety and major public interests does not need to be authorized."}
{"task": "rw_36.jsonl", "id": 49482, "text": "(7) Related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Important", "First Party Collection Information"], "rewrite": "Data collection and use related to criminal investigation, prosecution, trial, and execution of judgments do not need to be authorized."}
{"task": "rw_36.jsonl", "id": 49483, "text": "(8) It is necessary to maintain the safe and stable operation of the products or services provided by maintenance, such as the failure of discovering and disposing of products or services;", "label": ["Important", "First Party Collection Information"], "rewrite": "The necessary collection and use for the safe and stable operation of the products or services provided by maintaining it does not require authorization."}
{"task": "rw_36.jsonl", "id": 49484, "text": "(9) Other circumstances stipulated in laws and regulations and regulatory policies.", "label": ["Important", "First Party Collection Information"], "rewrite": "Other data collection and use of laws and regulations and regulatory policies do not need to be solicited."}
{"task": "rw_36.jsonl", "id": 49485, "text": "4. In order to provide you with services, on the premise of complying with national laws and regulations and regulatory policies, we may use your personal information for the following purpose:", "label": ["Usage"], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49486, "text": "(1) When we provide services, it is used for authentication, customer service, security precautions, fraud monitoring, archiving and backup purposes to ensure the safety of the products and services we provide to you;", "label": ["Important", "Usage"], "rewrite": "When we provide services, your information will be used for authentication, customer service, security defense, fraud monitoring, archiving and backup purposes to ensure the safety of products and services."}
{"task": "rw_36.jsonl", "id": 49487, "text": "(2) In accordance with the relevant national requirements, it is used to promote government management, strengthen social governance, improve social livelihood, and establish a integrity system;", "label": ["Important", "Usage"], "rewrite": "According to the relevant national requirements, your information will be used to serve the purpose of promoting government management, strengthening social governance, improving social livelihood, and establishing an integrity system."}
{"task": "rw_36.jsonl", "id": 49488, "text": "(3) Make us better understand how you use our products, services or advertisements, so as to meet your personal needs, such as language settings, location settings, personalized help services and instructionUsers who use our service to make other responses;", "label": ["Important", "Usage"], "rewrite": "Use your information to meet your personal needs targeted."}
{"task": "rw_36.jsonl", "id": 49489, "text": "(4) It is used to provide you with personalized or customized products and services, such as showing or recommending higher information flow or promotion information results to you.", "label": ["Important", "Usage"], "rewrite": "Use your information to provide you with personalized or customized products and services."}
{"task": "rw_36.jsonl", "id": 49490, "text": "If you don't want to receive this information, China Unicom APP supports you to close personalized or customized products and services, you can close this recommendation at the China Unicom APP \"Settings-> Universal -> Personalized Recommendation\";", "label": ["Important", "Edit/Control"], "rewrite": "Close personalized or customized products and services in China Unicom APP \"Settings -> GM-> Personalized Recommendation\"."}
{"task": "rw_36.jsonl", "id": 49491, "text": "(5) Through information and data analysis, help us design and provide you with better perception new services;", "label": ["Important", "Usage"], "rewrite": "Use your information to analyze data to provide new services that perceive better."}
{"task": "rw_36.jsonl", "id": 49492, "text": "(6) Evaluate the effect of our service and improve;", "label": ["Important", "Usage"], "rewrite": "Your information will be used to evaluate the effect of services."}
{"task": "rw_36.jsonl", "id": 49493, "text": "(7) Software authentication or management software upgrade;", "label": ["Important", "Usage"], "rewrite": "Your information will be used for software authentication or management software upgrades."}
{"task": "rw_36.jsonl", "id": 49494, "text": "(8) Invite you to participate in investigations about our products and services.", "label": ["Important", "Usage"], "rewrite": "Use your information to invite you to participate in surveys on our products and services."}
{"task": "rw_36.jsonl", "id": 49495, "text": "5. You understand and agree. We can identify your personal information data through technical means. The information that identify the processing process will not be able to identify the individual subject.", "label": ["Important", "Data Security"], "rewrite": "The personal information data is identified by technical means, and the individual subject will not be recognized after processing."}
{"task": "rw_36.jsonl", "id": 49496, "text": "In this case, we have the right to use the information that has been identified as the premise of compliance with relevant laws and regulations and regulatory policies to conduct overall analysis and utilization of user databases including your personal information.", "label": ["Important", "Usage"], "rewrite": "Use the information that has been identified to conduct integrated analysis and utilization of user databases including your personal information."}
{"task": "rw_36.jsonl", "id": 49497, "text": "6. When we want to use other purposes that the information is not stated in this privacy policy, we will solicit your consent in advance.", "label": ["Important", "Data Security"], "rewrite": "When the information is used for other purposes that are not stated in this privacy policy, you will solicit your consent in advance."}
{"task": "rw_36.jsonl", "id": 49498, "text": "In addition, third -party subjects may provide you with services through the China Unicom APP.", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49499, "text": "When you enter the service page of the third -party subject operation, please note that the relevant services are provided to you by the third party subject.", "label": ["Important", "Risk"], "rewrite": "When you enter the service page of the third -party subject operation, please pay attention to the service to you with a third -party subject."}
{"task": "rw_36.jsonl", "id": 49500, "text": "If the third -party subject collects personal information to you, it is recommended that you carefully check the privacy policy or agreement of the third -party subject.", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49501, "text": "3. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49502, "text": "(1) Cookie", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49503, "text": "To ensure that the APP and the internal web pages can operate normally, we will store the small data file of the cookie on your computer or mobile device.", "label": ["Important"], "rewrite": "Small data files named Cookie on your computer or mobile device."}
{"task": "rw_36.jsonl", "id": 49504, "text": "Cookie usually contains identifiers, site names, and some numbers and characters.", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49505, "text": "With the help of cookies, the website can store your preference or product data in the shopping basket.", "label": ["Important", "First Party Collection Information"], "rewrite": "Use cookies to store your preference or product data in shopping baskets."}
{"task": "rw_36.jsonl", "id": 49506, "text": "We will not use Cookie for any purpose except the purpose of this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49507, "text": "You can manage or delete Cookie according to your preferences.", "label": ["Important", "Edit/Control"], "rewrite": "You can manage or delete Cookie according to your preferences."}
{"task": "rw_36.jsonl", "id": 49508, "text": "See AboutCookies.org for details.", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49509, "text": "You can clear all the cookies saved on the computer, and most of the network browsers have the function of preventing cookies.", "label": ["Edit/Control", "Important"], "rewrite": "You can clear all the cookies saved on the computer through the browser."}
{"task": "rw_36.jsonl", "id": 49510, "text": "But if you do this, you need to change the user settings when you visit our website.", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49511, "text": "(2) Website beacon and pixel label", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49512, "text": "In addition to Cookie, we may also use other similar technologies such as website beacons and pixel labels on the website.", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49513, "text": "For example, the email we send to you may contain a link to the URL of the content of the content of our website.", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49514, "text": "If you click the link, we will track this click to help us understand your product or service preferences and improve customer service.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If you click the link we send, you will track this click to understand your product or service preferences and improve customer service."}
{"task": "rw_36.jsonl", "id": 49515, "text": "Website beacon is usually a transparent image embedded in a website or email.", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49516, "text": "With the pixel labels in emails, we can know whether the email has been opened.", "label": ["Important", "First Party Collection Information"], "rewrite": "With the pixel labels in emails, to know whether the email is opened."}
{"task": "rw_36.jsonl", "id": 49517, "text": "If you don't want your activities to be tracked in this way, you can withdraw from our signal list at any time.", "label": ["Edit/Control", "Important"], "rewrite": "If you don't want your activities to be tracked, you can withdraw from the letter list at any time."}
{"task": "rw_36.jsonl", "id": 49518, "text": "4. How can we share, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49519, "text": "(1) Sharing", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49520, "text": "We will not share your personal information with any companies, organizations and individuals other than China Unicom, except the following situations:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not share your personal information with any companies, organizations and individuals other than China Unicom, except the following situations:"}
{"task": "rw_36.jsonl", "id": 49521, "text": "1. Shared with clear consent: After getting your clear consent, we will share your personal information with other parties.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After getting your clear consent, we will share your personal information with other parties."}
{"task": "rw_36.jsonl", "id": 49522, "text": "2. We may share your personal information to the outside world in accordance with the requirements of laws and regulations and regulatory policies, or in accordance with the mandatory requirements of the government authority.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share your personal information to the outside world in accordance with the requirements of laws and regulations and regulatory policies, or in accordance with the mandatory requirements of the government authority."}
{"task": "rw_36.jsonl", "id": 49523, "text": "3. You authorize banks, securities, insurance, credit reporting agencies and other third directions to inquire and collect your information in China Unicom, or we will be within the scope of laws and regulations and regulatory policies and your authorized scope of third parties to the first part of the first party.When the three parties share your information, we will use your personal information on the premise of compliance with laws and regulations and regulatory policies based on the agreement with the third party and the legality of the source of personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you authorize banks, securities, insurance, credit reporting agencies and other third directions to inquire and collect your information in China Unicom, we will share your information with it."}
{"task": "rw_36.jsonl", "id": 49524, "text": "4. Share with our affiliates: Your personal information may be shared with our affiliated company.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Your personal information may be shared with our affiliated companies."}
{"task": "rw_36.jsonl", "id": 49525, "text": "In accordance with the principles of legality, rights, necessary, and integrity, we will only share your necessary personal information within the smallest range of the business purpose and be subject to the purpose of the purpose declared in this privacy policy.", "label": ["Important", "Data Security"], "rewrite": "In accordance with the principles of legal, right, necessary, and integrity, we only share your necessary personal information within the small range of the business purpose."}
{"task": "rw_36.jsonl", "id": 49526, "text": "If the relevant laws and regulations, regulatory policies requirements, or we believe that it is necessary to safeguard your rights, we will also obtain your separate consent before providing information to related companies.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will obtain your separate consent before providing the information to the affiliated company."}
{"task": "rw_36.jsonl", "id": 49527, "text": "If related companies want to change the purpose of personal information, they will solicit your authorization consent again.", "label": ["Important", "Data Security"], "rewrite": "If related companies want to change the purpose of personal information, they will solicit your authorization consent again."}
{"task": "rw_36.jsonl", "id": 49528, "text": "Our affiliated companies include China Unicom's now or in the future of any company, institutions, or the legal heirs of any company, institutions, and the above -mentioned companies or institutions under the common control of China Unicom.", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49529, "text": "Among them, \"control\" refers to the ability to directly or indirectly affect the company's management, whether it is a method that is identified by the ownership, the shares of the voting right, the contract, or the other by the people's court.", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49530, "text": "5. Sharing with authorized partners: In order to achieve the purpose of the privacy policy, some of our services will be provided by authorized partners.", "label": ["Important"], "rewrite": "Some of our services will be provided by authorized partners."}
{"task": "rw_36.jsonl", "id": 49531, "text": "To this end, we may share your arrival or personal information with your partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share your place of arrival or certain personal information with your partners."}
{"task": "rw_36.jsonl", "id": 49532, "text": "For example, when you buy goods or ordering business through our website, we must share your personal information with logistics service providers to arrange delivery or arrange partners to provide services.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "When you buy goods or ordering business through our website, share your personal information with logistics service providers."}
{"task": "rw_36.jsonl", "id": 49533, "text": "In accordance with the principles of legality, rights, necessary, and integrity, we will only share your necessary personal information within the smallest range of the business purposes.", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49534, "text": "If the relevant laws and regulations, regulatory policies are required, or we think that it is necessary to safeguard your rights and interests, we will also obtain your separate consent before providing information to authorized partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will obtain your separate consent before providing the information to the authorized partner."}
{"task": "rw_36.jsonl", "id": 49535, "text": "Our partners have no right to use the personal information they shared for any other purpose.", "label": ["Important", "Data Security"], "rewrite": "Our partners have no right to use the personal information they shared for any other purpose."}
{"task": "rw_36.jsonl", "id": 49536, "text": "At present, our authorized partners include the following [3] type:", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49537, "text": "(1) Suppliers, service providers and other partners.", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49538, "text": "We send information to suppliers, service providers, and other partners that support our business. These support include providing technical infrastructure services, analyzing the use of our services, measurement of the effectiveness of advertising and services, providing customer service, convenient payment of payment, Trading security services or academic research and investigation.", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49539, "text": "(2) Third -party merchants.", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49540, "text": "We must share your order information with the necessary information related to transactions with third -party merchants to realize your needs for purchasing goods or services from it, and to promote it to complete subsequent after -sales service.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Share your order information related to the necessary information related to transactions with third -party merchants to realize your needs for purchasing goods or services."}
{"task": "rw_36.jsonl", "id": 49542, "text": "Unless you obtain your permission, we will not share information that is used to identify your personal identity. We may share the user portrait formed by using your information to share with partners who provide advertising and analyze services to enhance advertising and service informationEffective touch rate.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "The user portrait that uses your information may be shared with partners who provide advertising and analysis services."}
{"task": "rw_36.jsonl", "id": 49543, "text": "Companies, organizations and individuals who share personal information with us, we will sign corresponding confidentiality agreements with them, asking them to handle personal information in accordance with our instructions, privacy policies, and any other related confidentiality and security measures.", "label": ["Important", "Data Security"], "rewrite": "We will sign a confidentiality agreement with the partner of shared information, asking it to handle personal information in accordance with the agreement and related confidentiality and security measures."}
{"task": "rw_36.jsonl", "id": 49544, "text": "(2) Transfer", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49545, "text": "We will not transfer your personal information to any company, organization and individual, except the following situations: except:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not transfer your personal information to any company, organization and individual, except the following situations: except:"}
{"task": "rw_36.jsonl", "id": 49546, "text": "1. Solve when obtaining a clear consent: After getting your clear consent, we will transfer your personal information to other parties;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After getting your clear consent, we will transfer your personal information to other parties."}
{"task": "rw_36.jsonl", "id": 49547, "text": "2. When involving mergers, acquisitions or bankruptcy liquidation, if personal information transfer, we will ask new companies and organizations holding your personal information to continue to be subject to this privacy policy.Solo your authorization consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When involving mergers, acquisitions, or bankruptcy liquidation, if personal information transfer is involved, it will be required to continue to be bound by the policy, otherwise it will request that it will re -solicit authorization consent."}
{"task": "rw_36.jsonl", "id": 49541, "text": "(3) Authorized partners of advertising and analysis of service.", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49548, "text": "3. Relevant laws and regulations stipulate or other circumstances we agreed with you.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49549, "text": "(3) Public disclosure", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49550, "text": "We will only publicly disclose your personal information in the following circumstances:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only publicly disclose your personal information in the following circumstances:"}
{"task": "rw_36.jsonl", "id": 49551, "text": "1. After getting your clear consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After getting your clear consent, disclose your information publicly."}
{"task": "rw_36.jsonl", "id": 49552, "text": "2. Based on legal disclosure: In the case of the compulsory requirements of legal, legal procedures, or government authorities, we may publicly disclose your personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the case of compulsory requirements of legal, legal procedures, or government authorities, we may disclose your personal information publicly."}
{"task": "rw_36.jsonl", "id": 49553, "text": "5. How do we protect your personal information", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49554, "text": "(1) Preservation of the area: The personal information we collected and generated in the territory of the People's Republic of China will be stored in the territory of the People's Republic of China.", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in domestic operations will be stored in China."}
{"task": "rw_36.jsonl", "id": 49555, "text": "We only save your personal information during the period of the purpose of the privacy policy, and the time limit for laws and regulations and regulatory regulations. After exceeding the deposit period, we will anonymous processing the collected information.", "label": ["Data Retention", "Important"], "rewrite": "Generally, your personal information is preserved within the time limit required for the service purpose. After exceeding the storage period, your personal information will be deleted or anonymous, except for other provisions of laws and regulations."}
{"task": "rw_36.jsonl", "id": 49556, "text": "(2) Protection measures: In order to ensure your information security, after collecting your information, we will take various reasonable and necessary measures to protect your information.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49557, "text": "In the technical development environment, we only use the information processing information for statistical analysis;", "label": ["Important", "Data Security"], "rewrite": "In the technical development environment, statistical analysis is performed using information that has been identified."}
{"task": "rw_36.jsonl", "id": 49558, "text": "When providing an APP -related research report, we will identify the information contained in the report.", "label": ["Important", "Data Security"], "rewrite": "When providing APP -related research reports, the information contained in the report will be identified."}
{"task": "rw_36.jsonl", "id": 49559, "text": "We will store information from the information that can be used to restore the information that can be used to restore the identification of individuals to ensure that the individual is not re -identified in the follow -up processing of derived information.", "label": ["Important", "Data Security"], "rewrite": "Separate the information -based information from the information that can be used to restore the information of individuals."}
{"task": "rw_36.jsonl", "id": 49560, "text": "(3) We have used security measures that meet the industry standards to protect your personal information, preventing data from being unauthorized, publicly disclosed, use, modified, damaged or lost.", "label": ["Important", "Data Security"], "rewrite": "Use security protection measures that meet industry standards to protect personal information."}
{"task": "rw_36.jsonl", "id": 49561, "text": "We will take all reasonable and feasible measures (such as: identity identification, information collection monitoring and auditing, network -based transmission, anti -invasion, anti -virus, information encryption storage, information access authority management, information certification authorization, monitoring audit, information desensitization, desensitization of information, Information traceability) and supporting management system to protect your personal information.", "label": ["Important", "Data Security"], "rewrite": "Take all reasonable and feasible measures and supporting management systems to protect your personal information."}
{"task": "rw_36.jsonl", "id": 49562, "text": "(4) We promise to do a good job of user information security protection in accordance with relevant national regulations.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49563, "text": "To ensure your information security, we will use the necessary security technology and supporting management system to prevent your information from being leaked, damaged or lost.", "label": ["Important", "Data Security"], "rewrite": "Use the necessary security technology and supporting management system to prevent information from being leaked, damaged or lost."}
{"task": "rw_36.jsonl", "id": 49564, "text": "At the same time, we have set up user information protection responsibility departments to establish relevant internal control, and adopt the principle of minimum authorization for the staff who may contact your information;", "label": ["Important", "Data Security"], "rewrite": "Establish a user information protection responsibility department, establish relevant internal control, and adopt the minimum principle of authorization for staff who may contact personal information."}
{"task": "rw_36.jsonl", "id": 49565, "text": "We will conduct systematic monitoring of relevant laws and regulations, privacy policies and security awareness training, and systematically monitor the behavior of the staff to handle your information.", "label": ["Important", "Data Security"], "rewrite": "Training laws, regulations, privacy policies, and security awareness of staff, and systematically monitor the behavior of handling personal information."}
{"task": "rw_36.jsonl", "id": 49566, "text": "We will also receive information security inspections from relevant state agencies.", "label": ["Important", "Data Security"], "rewrite": "Accept the information security inspection of relevant state agencies."}
{"task": "rw_36.jsonl", "id": 49567, "text": "(5) You need to promise to properly save the login account, password and other information, and the consequences of the leakage of the account password due to your reasons are borne by you.", "label": ["Important", "Data Security"], "rewrite": "Please preserve information such as the login account, password, etc., and the consequences of the information leak caused by your reasons are borne by you."}
{"task": "rw_36.jsonl", "id": 49568, "text": "In order to prevent information leakage, we will take technical means such as anti -leakage, anti -crawler and other technical means to restrict frequent operational behaviors such as your information to prevent the leakage of the account password or the use of our identity to cause you to produce bad behavior records or your information leak.", "label": ["Important", "Data Security"], "rewrite": "Use technical means such as anti -leakage, anti -crawler and other technical means to prevent information leakage."}
{"task": "rw_36.jsonl", "id": 49569, "text": "(6) We have developed an emergency plan for personal information security incidents, and regularly organized internal personnel to conduct emergency response training and emergency drills to enable them to master job duties and emergency disposal strategies and procedures.", "label": ["Important", "Data Security"], "rewrite": "Formulate emergency plans for personal information security incidents, and regularly organize personnel emergency response training and emergency drills."}
{"task": "rw_36.jsonl", "id": 49570, "text": "However, due to technical level restrictions and possible malicious means, security problems may be due to factors outside the control scope.", "label": ["Important", "Data Security"], "rewrite": "Due to technical level restrictions and various malicious means, security problems may still occur."}
{"task": "rw_36.jsonl", "id": 49571, "text": "After a personal information security incident, we will inform you in a timely manner in accordance with the requirements of relevant laws and regulations and regulatory policies: the basic situation and possible impact of the security incident, the disposal measures we have taken or we will take, you can take it alone to prevent and reduceSuggestions for risk, remedy measures, etc.", "label": ["Important", "Data Security"], "rewrite": "If a personal information security incident occurs, we will inform your basic situation, possible impact, disposal measures, independent prevention suggestions, etc."}
{"task": "rw_36.jsonl", "id": 49572, "text": "We will promptly inform you that the incident -related situation is informing the email, letter, telephone, push notification, etc. When it is difficult to inform the subject of personal information one by one, we will publish an announcement in a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "The relevant situation of security incidents will be informed by mail, letter, telephone, push notification, etc. When it is difficult to inform one by one, it will issue an announcement."}
{"task": "rw_36.jsonl", "id": 49573, "text": "At the same time, we will also actively report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "Report the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities."}
{"task": "rw_36.jsonl", "id": 49574, "text": "6. How do we protect the personal information of minors", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49575, "text": "(1) We attach great importance to the protection of personal information of minors.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49576, "text": "We will protect personal information of minors in accordance with relevant national laws and regulations and regulatory policies.", "label": ["Specific Audiences", "Important"], "rewrite": "We will protect personal information of minors in accordance with relevant national laws and regulations and regulatory policies."}
{"task": "rw_36.jsonl", "id": 49577, "text": "(2) If you are a minor under the age of 14, before using our service, you should read this privacy policy under the supervision and guidance of your parents or other guardians, and will be confirmed by your parents or other guardians to confirm whetherAgree with this privacy policy.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a child under the age of 14, please use the service under the guidance of the guardian under the guidance of the guardian after reading the policy carefully."}
{"task": "rw_36.jsonl", "id": 49578, "text": "(3) For the case of collecting minors with the consent of parents or other guardians, we will only use or publicly disclose this information if they are permitted by law, parents or other guardians who are clearly agreed or protecting minors.Essence", "label": ["Specific Audiences", "Important"], "rewrite": "For the consent of the guardian to collect personal information of minors, we will only use or disclose this information if they are allowed to be allowed to be used by law, parents or other guardians to protect minors."}
{"task": "rw_36.jsonl", "id": 49579, "text": "(4) If we find that we collect personal information of minors without the consent of parents or other guardians who can be confirmed in advance, we will try to delete relevant data as soon as possible.", "label": ["Specific Audiences", "Important"], "rewrite": "If the personal information of minors was collected without the consent of the legal guardian, he would try to delete relevant information as soon as possible."}
{"task": "rw_36.jsonl", "id": 49580, "text": "If you are the parents of the minor or other guardians, please pay attention to whether the minors you guard with your authorization will use our services after obtaining your authorization consent.", "label": ["Specific Audiences", "Important"], "rewrite": "The legal guardian is requested to pay attention to whether to use services or provide personal information after obtaining your authorization consent."}
{"task": "rw_36.jsonl", "id": 49581, "text": "If you have any questions about the personal information of the minors you monitor, please contact us through contact information in this privacy policy.", "label": ["Specific Audiences", "Important"], "rewrite": "If you have any questions about the personal information of the minors you monitor, please contact us."}
{"task": "rw_36.jsonl", "id": 49582, "text": "(5) We have formulated specialized personal information processing rules for minors. You can learn more by reading the \"China Unicom Children's Personal Information Protection Policy and Guardian\".", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49583, "text": "7. How can your personal information be stored and transferred globally", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49584, "text": "(1) How to store your personal information", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49585, "text": "The personal information we collected in the People's Republic of China will be stored in the People's Republic of China.", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in domestic operations will be stored in China."}
{"task": "rw_36.jsonl", "id": 49586, "text": "We only retain your personal information during the time limit for the purpose of this policy, laws and regulations, and the time limit stipulated by regulatory regulations.", "label": ["Data Retention", "Important"], "rewrite": "Generally, your personal information is retained within the time limit required to achieve service purposes, unless the law has other requirements."}
{"task": "rw_36.jsonl", "id": 49587, "text": "If you need to transfer your personal information abroad, we will:", "label": ["Data Retention", "Important"], "rewrite": "If you need to transfer your personal information abroad, we will:"}
{"task": "rw_36.jsonl", "id": 49588, "text": "1. Obtain your authorization consent and fulfill your legal procedures, so that your personal information will be protected enough in the case of compliance with the law;", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "We will obtain a separate authorization consent, fulfill the legal procedures, and then transfer your information to overseas."}
{"task": "rw_36.jsonl", "id": 49589, "text": "2. These transfer will be carried out on the premise that it meets the requirements of the applicable law. Even if you obtain your authorization, the transfer method or purpose does not meet the relevant laws and regulations, and we will not transfer it.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "The cross -border transfer of information will be carried out on the premise of meeting the application of law."}
{"task": "rw_36.jsonl", "id": 49590, "text": "(2) How can your personal information be stored and transferred globally", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49591, "text": "The personal information we collected in the People's Republic of China will be stored in the People's Republic of China.", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in domestic operations will be stored in China."}
{"task": "rw_36.jsonl", "id": 49592, "text": "We only retain your personal information during the time limit for the purpose of the privacy policy, laws and regulations, and the time limit stipulated in regulatory regulations.", "label": ["Data Retention", "Important"], "rewrite": "Keep your personal information only within the time limit for service purposes, unless the law has other requirements."}
{"task": "rw_36.jsonl", "id": 49593, "text": "If you need to transfer your personal information abroad, we will:", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49594, "text": "1. Obtain your authorization consent and fulfill your legal procedures, so that your personal information will be protected enough in the case of compliance with the law;", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "If you need to transfer your information to your abroad, we will obtain your authorization consent and fulfill your legal procedures."}
{"task": "rw_36.jsonl", "id": 49595, "text": "2. These transfer will be carried out on the premise that it meets the requirements of the applicable law. Even if you obtain your authorization, the transfer method or purpose does not meet the relevant laws and regulations, and we will not transfer it.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "Cross -border transfer of personal information will be carried out on the premise that the legal requirements are met."}
{"task": "rw_36.jsonl", "id": 49596, "text": "8. How to update this policy", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49597, "text": "Based on providing you with better services and changes in the development of telecommunications business or laws and regulations and regulatory policies, we may update this privacy policy in a timely manner.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49598, "text": "Because there are many users, such as major changes in this privacy policy, we will notify you by pop -up window pop -up window of the APP homepage and the app announcement of APP.", "label": ["Policy Change", "Important"], "rewrite": "If this privacy policy has changed significantly, we will notify you by pop -up window of the APP homepage, and the app pushing the announcement."}
{"task": "rw_36.jsonl", "id": 49599, "text": "If you confirm your consent or continue to use our products or services after the revision of the privacy policy, this indicates that you have fully read, understand, and are willing to be restricted by the privacy policy after the revision.", "label": ["Policy Change", "Important", "Risk"], "rewrite": "If you confirm the consent or continue to use our products or services after the revision of the privacy policy, it means that you accept the restrictions of the privacy policy after the revision."}
{"task": "rw_36.jsonl", "id": 49600, "text": "Nine, your rights", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49601, "text": "(1) Visit your personal information", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49602, "text": "You have the right to visit your personal information, except for the exceptions stipulated in laws and regulations.", "label": ["Edit/Control", "Important"], "rewrite": "You have the right to visit your personal information, except for the exceptions stipulated in laws and regulations."}
{"task": "rw_36.jsonl", "id": 49603, "text": "(1) You can check your personal information on the path of \"China Unicom APP-Mine-Mine\".", "label": ["Important", "Edit/Control"], "rewrite": "You can check your personal information on the path of \"China Unicom APP-Mine-Mine\"."}
{"task": "rw_36.jsonl", "id": 49604, "text": "(2) You can in [Mine]-[Personal Avatutory]-, View/Edit your account, name, avatar, comments, praise related interactive content.", "label": ["Important", "Edit/Control"], "rewrite": "But in [Mine]- [Personal avatar] -Chat to view/edit your account, name, avatar, comments, likes related interaction content."}
{"task": "rw_36.jsonl", "id": 49605, "text": "(3) You can view/use the prizes, traffic packages, and voice packages in [mine]-[My gift package].", "label": ["Important", "Edit/Control"], "rewrite": "You can view/use the prizes, traffic packages, and voice packages in [Mine]-[My Gift Pack] to see/use what you get or obtained in the app."}
{"task": "rw_36.jsonl", "id": 49606, "text": "You can also go to the local business hall of China Unicom, call the 10010 customer service hotline, visit https://www.10010.com Online business hall to check your personal information.", "label": ["Important", "Edit/Control"], "rewrite": "You can go to the local business hall of China Unicom, call 10010 customer service hotline, visit https://www.10010.com Online business hall to check your personal information."}
{"task": "rw_36.jsonl", "id": 49607, "text": "(2) Correct your personal information", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49608, "text": "When you find that our personal information is wrong, you can modify your personal information on the path of \"China Unicom APP-Settings-My Personal Information\".", "label": ["Important", "Edit/Control"], "rewrite": "Modify your personal information on the path of \"China Unicom APP-Settings-My Personal Information\"."}
{"task": "rw_36.jsonl", "id": 49609, "text": "At the same time, you have the right to ask us to make corrections. You can make a correction application in the way you listed in \"(1) access your personal information\".", "label": ["Edit/Control", "Important"], "rewrite": "The application for correction can be proposed in the form of \"(1) access to your personal information\"."}
{"task": "rw_36.jsonl", "id": 49610, "text": "(3) Delete your personal information", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49611, "text": "You can delete your information through the \"China Unicom APP-Mine-My Personal Information\" path, or apply for a cancellation account to delete all your information.", "label": ["Important", "Edit/Control"], "rewrite": "Delete some information through the \"China Unicom APP-Mine-My Personal Information\" path, or apply for a cancellation account to delete all your information."}
{"task": "rw_36.jsonl", "id": 49612, "text": "You can request us to delete your personal information under the following circumstances:", "label": ["Important", "Edit/Control"], "rewrite": "You can request us to delete your personal information under the following circumstances:"}
{"task": "rw_36.jsonl", "id": 49613, "text": "1. If our behavior of handling personal information violates laws and regulations;", "label": ["Important", "Edit/Control"], "rewrite": "If our behavior of handling personal information violates laws and regulations, you can make a request to delete personal information."}
{"task": "rw_36.jsonl", "id": 49614, "text": "2. If we collect and use your personal information, it has not obtained your consent;", "label": ["Important", "Edit/Control"], "rewrite": "If we collect and use your personal information but not obtain your consent, you can make a request to delete personal information."}
{"task": "rw_36.jsonl", "id": 49615, "text": "3. If our behavior of handling personal information violates your agreement;", "label": ["Important", "Edit/Control"], "rewrite": "If our behavior of handling personal information violates your agreement, you can make a request to delete personal information."}
{"task": "rw_36.jsonl", "id": 49616, "text": "4. If you no longer use our products or services, or you cancel your account;", "label": ["Important", "Edit/Control"], "rewrite": "If you no longer use our products or services, or if you cancel your account, you can make a request to delete personal information."}
{"task": "rw_36.jsonl", "id": 49617, "text": "5. If we no longer provide you with products or services.", "label": ["Edit/Control", "Important"], "rewrite": "If we no longer provide you with products or services, you can make a request to delete personal information."}
{"task": "rw_36.jsonl", "id": 49618, "text": "Please note that when you or we help you successfully delete the relevant information, because of the applicable legal and security technical restrictions, we may not be able to immediately delete the corresponding information from the backup system.It is preserved, and the authority has the right to inquire in accordance with the law during the time for preservation of the law. During the preservation period, we will securely store your personal information and restrict any further processing of it until the backup can be deleted or achieved anonymous.", "label": ["Edit/Control", "Important"], "rewrite": "Our personal information that has not yet expired or technically difficult to delete the specified preservation period is processed except for storage and adopting necessary security measures until we can be deleted or achieved anonymous."}
{"task": "rw_36.jsonl", "id": 49619, "text": "(4) Profile accounts for personal information main body", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49620, "text": "You can cancel your account you used to use in the path of \"China Unicom APP-Mine-Safety Center-Logout\". After you cancel your account, all the information in the account will be cleared, and we will not collect anymore againUse or share personal information related to this account, but the previous information we still need to be saved according to the time of the regulatory policy, and the authority has the right to inquire in accordance with the law within the time of preservation of the law.", "label": ["Data Retention", "Important", "Edit/Control"], "rewrite": "You can cancel your account you used to use in the path of \"China Unicom APP-Mine-Safety Center-Logout\". After the cancellation, it will no longer collect, use, or share related personal information, but it will be saved according to regulatory requirements, and it will be saved according to regulatory requirements, and it will be saved according to regulatory requirements.Some authorities can still inquire according to law."}
{"task": "rw_36.jsonl", "id": 49621, "text": "(5) Change the scope of your authorization consent", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49622, "text": "Each business function requires some basic personal information to complete.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49623, "text": "For the collection and use of additional personal information, you can give or withdraw your authorization consent at any time.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49624, "text": "You can go to the local business hall of China Unicom, visit https://www.10010.com online business hall or use the China Unicom APP (my-settings-user permissions information) to set upItems", "label": ["Edit/Control", "Important"], "rewrite": "You can go to the local business hall of China Unicom, visit https://www.10010.com online business hall or use the China Unicom APP (my-settings-user permissions information) to set up to close some function options to revoke some authorization."}
{"task": "rw_36.jsonl", "id": 49625, "text": "Or in the [Settings]-[Unicom APP] of the mobile phone system, turn off a certain authorized authority.", "label": ["Important", "Edit/Control"], "rewrite": "In the [Settings]-[Unicom APP] of the mobile phone system, turn off a certain authorized authority."}
{"task": "rw_36.jsonl", "id": 49626, "text": "After you withdraw or authorize, we cannot continue to provide you with the service corresponding to the withdrawal consent or authorization, and we will no longer deal with your corresponding personal information.", "label": ["Important"], "rewrite": "When you withdraw consent or authorization, we will no longer provide corresponding services and no longer processing corresponding personal information."}
{"task": "rw_36.jsonl", "id": 49627, "text": "But your decision to withdraw consent or authorization will not affect the effectiveness of personal information processing activities based on your consent or authorization.", "label": ["Edit/Control", "Important"], "rewrite": "Withdrawal authorization will not affect personal information processing based on previous authorization."}
{"task": "rw_36.jsonl", "id": 49628, "text": "(6) In response to your above request", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49629, "text": "To ensure safety, you may need to provide a written request or prove your identity in other ways.", "label": ["Important", "Data Security"], "rewrite": "When responding to your request, you need to verify your identity."}
{"task": "rw_36.jsonl", "id": 49630, "text": "We may ask you to verify your identity first, and then handle your request. For your reasonable request about user personal information, we do not charge fees in principle, but we will dependLove is charged a certain cost.", "label": ["Important"], "rewrite": "Reasonable requests are not charged in principle without charging and exceeding the reasonable limit."}
{"task": "rw_36.jsonl", "id": 49631, "text": "We may refuse to reject those who have no repetition, need too much technical means, bring risks or very unrealistic requests to others.", "label": ["Important", "Data Security"], "rewrite": "We may refuse to repeat for unseen, need too much technical means, bring risks or very unrealistic requests to others' legitimate rights and interests."}
{"task": "rw_36.jsonl", "id": 49632, "text": "In the following circumstances, in accordance with laws and regulations and regulatory policy requirements, we will not be able to respond to your request:", "label": ["Edit/Control", "Important"], "rewrite": "In the following circumstances, in accordance with laws and regulations and regulatory policy requirements, we will not be able to respond to your request:"}
{"task": "rw_36.jsonl", "id": 49633, "text": "1. Directly related to national security and national defense security;", "label": ["Edit/Control", "Important"], "rewrite": "If your request is directly related to national security and national defense security, you may not be responded."}
{"task": "rw_36.jsonl", "id": 49634, "text": "2. Directly related to public safety, public health, and major public interests;", "label": ["Important", "Edit/Control"], "rewrite": "Your request is directly related to public safety, public health, and major public interests and may not be responded."}
{"task": "rw_36.jsonl", "id": 49635, "text": "3. Directly related to criminal investigation, prosecution, trial and judgment execution;", "label": ["Important", "Edit/Control"], "rewrite": "Your request is related to criminal investigation, prosecution, and trial, and may not be responded."}
{"task": "rw_36.jsonl", "id": 49636, "text": "4. There is sufficient evidence that you have subjective malice or abuse of rights;", "label": ["Edit/Control", "Important"], "rewrite": "Personal information controller has sufficient evidence to indicate that the subject of personal information has subjective malice or abuse of rights, and may not respond to the request."}
{"task": "rw_36.jsonl", "id": 49637, "text": "5. Response your request will cause serious damage to the legitimate rights and interests of you or other individuals and organizations;", "label": ["Important", "Edit/Control"], "rewrite": "We may not be able to respond to requests that exceed the storage range, exceed the reasonable limit, or the legitimate rights and interests of personal information subjects or other individuals and organizations will be seriously damaged."}
{"task": "rw_36.jsonl", "id": 49638, "text": "6. Involving business secrets.", "label": ["Important", "Edit/Control"], "rewrite": "We may not be able to respond."}
{"task": "rw_36.jsonl", "id": 49639, "text": "Ten, how to contact us", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49640, "text": "Company Name: China United Network Communication Co., Ltd.", "label": [], "rewrite": []}
{"task": "rw_36.jsonl", "id": 49641, "text": "Registration address: Unicom Building, No. 21, Financial Street, Xicheng District, Beijing", "label": ["Important", "Contact Information"], "rewrite": "Registration address: Unicom Building, No. 21, Financial Street, Xicheng District, Beijing"}
{"task": "rw_36.jsonl", "id": 49642, "text": "Contact number: 10010 customer service hotline", "label": ["Important", "Contact Information"], "rewrite": "Contact number: 10010 customer service hotline"}
{"task": "rw_36.jsonl", "id": 49643, "text": "Relevant person in charge: hqs-yhys@chinaunicom.cn", "label": ["Important", "Contact Information"], "rewrite": "Relevant person in charge: hqs-yhys@chinaunicom.cn"}
{"task": "rw_36.jsonl", "id": 49644, "text": "Website: http://www.chinaunicom.com", "label": ["Important", "Contact Information"], "rewrite": "Website: http://www.chinaunicom.com"}
{"task": "rw_36.jsonl", "id": 49645, "text": "If you have any questions, complaints, opinions, or suggestions on this privacy policy or your personal information, you can go to the local business hall of China Unicom, dial 10010 customer service hotline, access http://www.10010.com online business hall,Use China Unicom APP and other ways to contact us.", "label": ["Important", "Contact Information"], "rewrite": "You can contact us in China Unicom's local business hall, call 10010 customer service hotline, visit http://www.10010.com online business hall, and use China Unicom APP and other methods to contact us."}
{"task": "rw_36.jsonl", "id": 49646, "text": "Under normal circumstances, we will reply within 15 working days.", "label": ["Important", "Contact Information"], "rewrite": "Under normal circumstances, we will reply within 15 working days."}
{"task": "rw_36.jsonl", "id": 49647, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
