{"task": "rw_3.jsonl", "id": 37328, "text": "Personal Information Protection Policy of China Construction Bank Co., Ltd.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37329, "text": "Dear users: Our bank has updated the \"Personal Information Protection Policy\". The update content is mainly: 1. How can our bank collect your personal information;", "label": ["Policy Change", "Important"], "rewrite": "Our bank has updated the \"Personal Information Protection Policy\", and the update content is mainly: 1. How can our bank collect your personal information;"}
{"task": "rw_3.jsonl", "id": 37330, "text": "2. How do we use your personal information.", "label": ["Policy Change", "Important"], "rewrite": "2. How do we use your personal information."}
{"task": "rw_3.jsonl", "id": 37331, "text": "Version release date: November 1, 2021", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37332, "text": "Version Effective Date: November 1, 2021", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37333, "text": "China Construction Bank Co., Ltd. (\"I\") knows the importance of personal information to you and will try its best to protect your personal information security.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37334, "text": "We are committed to maintaining your trust in our trip, adhere to the following principles to protect your personal information: the principles of consistency and responsibility, the principles of clear purpose, the principle of consent, the principles of necessity, the principle of security, the principle of openness and transparency, the principles of integrity, information, information, information, informationQuality principles, etc.", "label": ["Important", "Data Security"], "rewrite": "Our bank adheres to the following principles to protect your personal information: the principles of consistency and responsibility, the principle of clear purpose, the principle of selection and consent, the principles of necessity, ensuring the principles of safety, the principles of openness and transparency, the principles of integrity, and the principle of information quality."}
{"task": "rw_3.jsonl", "id": 37335, "text": "At the same time, our bank promises to take corresponding security measures in accordance with the law to protect your personal information.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37336, "text": "This \"Personal Information Protection Policy\" will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37337, "text": "1.How does our trip collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37338, "text": "2.How does our trip use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37339, "text": "3.How to share, transfer and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37340, "text": "4.How does our trip store and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37341, "text": "5.The right to control personal information", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37342, "text": "6.How to deal with minors information", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37343, "text": "7.How to update this policy", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37344, "text": "8.How to contact me", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37345, "text": "1. How does our trip collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37346, "text": "Personal information refers to a variety of information that can identify specific natural persons or reflects the activity of specific natural persons in a single or other information with other information.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37347, "text": "Personal information includes but not limited to customer names, gender, nationality, occupation, residence or work unit address, contact information, identity documents or identity documents, certificates and documents validity periods, etc.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37348, "text": "Among them, once leaked, illegally provided or abuses the security of people and property, it is easy to lead to information such as personal reputation, physical and mental health damage or discriminatory treatment, etc., which mainly include: ID number, personal biometric information, finance, financial information, finance, finance, finance, financeAccounts, communication records and content, property information, credit information, trajectory trajectory, accommodation information, health and physiological information, transaction information, specific identities, personal information of minors under the age of 14, etc.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37349, "text": "(1) How to collect information", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37350, "text": "To provide you with services and ensure your electronic banking services (online banking services, mobile banking services, international Internet website services, SMS financial services, WeChat banking services, direct sales banking services, good integrity business, Yue Living service, etc.)During the use of electronic banking services, our bank will collect information you actively enter or use the service during the use of service:", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to provide you with service and ensure that your electronic banking service is safe, our bank will collect information you generate during the service process."}
{"task": "rw_3.jsonl", "id": 37351, "text": "1. When you open the service of electronic banking, according to laws and regulations and regulatory requirements, our bank will collect your personal basic information, personal identity information, property information, mobile phone number, signature information to help you complete the registration and use me in electronic bankingBasic services such as travel account management, information inquiry, transfer remittance, if you refuse to provide this information, you may not be able to open the basic services of electronic banks or cannot use our banks' electronic banks normally.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you open the electronic banking service, our bank will collect your personal information, personal identity information, property information, mobile phone number, signature information."}
{"task": "rw_3.jsonl", "id": 37352, "text": "2. When you use electronic banking functions or services, for example, in the following situations, you may need to provide or authorize our bank to collect the user information required for the corresponding services.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use electronic banking functions or services, you may need to provide or authorize the information required to collect the corresponding services to our bank."}
{"task": "rw_3.jsonl", "id": 37353, "text": "If you refuse to provide some functions or services, you may not be able to use some functions or services, but this does not affect other functions or services of your normal use of electronic banks.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37354, "text": "(1) In order to make you use mobile banking more secure and quickly, when you first binding the mobile banking, you need to send the specified SMS content (88#88) to 95533 to get the authorization code;", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37355, "text": "In the link that requires SMS verification codes, you may need to read the verification code SMS content to help you fill in the verification code.", "label": ["Important", "First Party Collection Information"], "rewrite": "In the link that requires SMS verification codes, you may need to read the verification code SMS content to help you fill in the verification code."}
{"task": "rw_3.jsonl", "id": 37356, "text": "If you refuse to authorize the communication information (SMS), our mobile phone bank will not read the text message content, and the system background does not save the text message content.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37357, "text": "(2) If you choose to log in, transfer, transfer, pay, identity authentication through fingerprints, faces, sound patterns, and face -brushing verification services, you need to provide your voice, face information, or allow us to use you to use you.Fingerprint and face recognition function provided by the device.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "If you choose to log in, transfer, payment, identity authentication through fingerprints, faces, sound patterns, and face -brushing verification services, you need to provide your voice, face information, or allow the fingerprint and facial recognition function provided by your device to use your device.Essence"}
{"task": "rw_3.jsonl", "id": 37358, "text": "Our bank obtained the sound lines and face information collected by your explicit consent, and stored encryption in the background database of our information system.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "The collected sound texture and face information are stored in the background database of our information system."}
{"task": "rw_3.jsonl", "id": 37359, "text": "If you refuse to provide the above information, our bank will not be able to provide you with products or services that you can use after fingerprints, faces, sound patterns, and face verification.", "label": ["First Party Collection Information", "Permission Acquisition"], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37360, "text": "Among them, the scope of the face verification application includes the face brushing login, face brushing, withdrawal, face -brushing, face -brushing, and real -name authentication function of the face.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37361, "text": "You can open or close the above individual or more features through the mobile banking \"Security Center-Security Authentication-Brushing Face\", and you can also update face information in this menu bar.", "label": ["Edit/Control", "Important"], "rewrite": "You can open or close the face recognition function through the \"Security Center-Security Center-Security Verification-Brush\"."}
{"task": "rw_3.jsonl", "id": 37362, "text": "Among them, the scope of sound pattern verification includes sound pattern login, sound pattern withdrawal, sound pattern transfer, and sound pattern payment function.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37363, "text": "You can open or close the above individual or more features through the mobile banking \"security center-security verification-sound pattern\", and you can also update the sound texture information in the menu bar.", "label": ["Important", "Edit/Control"], "rewrite": "You can open or close the sound pattern recognition through the \"Security Center-Security Authentication-Sound Patriotic\" through the mobile banking."}
{"task": "rw_3.jsonl", "id": 37364, "text": "The scope of fingerprint verification includes fingerprint login and fingerprint payment function.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37365, "text": "You can open or close the above individual or more features through the mobile banking \"Security Center-Security Verification-Fingerprint\".", "label": ["Important", "Edit/Control"], "rewrite": "You can open or close your fingerprint recognition through the mobile banking \"Security Center-Security Verification-Fingerprint\"."}
{"task": "rw_3.jsonl", "id": 37366, "text": "Our line will not collect your fingerprints. Your fingerprint is only stored on the device you authorized to collect fingerprints. You can update the fingerprint information in your fingerprint recognition function on your device.", "label": ["Important", "First Party Collection Information", "Edit/Control"], "rewrite": "Your fingerprint is only stored on the device you authorized to collect fingerprints, and you can update the fingerprint information in your fingerprint recognition function on your device."}
{"task": "rw_3.jsonl", "id": 37367, "text": "The scope of face capacity verification application includes facial login and face payment function.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37368, "text": "You can open or close the above individual or more features through the mobile banking \"Security Center-Security Verification-Face\".", "label": ["Important", "Edit/Control"], "rewrite": "You can open or close face verification through the \"Security Center-Security Verification-Face\" of mobile banking."}
{"task": "rw_3.jsonl", "id": 37369, "text": "Our bank will not collect facial information you use for facial verification services. The facial information is only stored on the device that you authorize to collect face information. You can update the face information in the face recognition function on your device.", "label": ["Important", "First Party Collection Information", "Edit/Control"], "rewrite": "Face information is only stored on the device that authorizes the collection of facial information. You can update the face information in the face recognition function on your device."}
{"task": "rw_3.jsonl", "id": 37370, "text": "For the local biological characteristics authentication function of some brands or models of mobile terminals, such as face recognition functions, the information is processed by mobile phone terminal providers, and we do not retain information in your mobile terminal related functions.", "label": ["Data Retention", "Important"], "rewrite": "Our bank does not retain information in your mobile terminal -related functions."}
{"task": "rw_3.jsonl", "id": 37371, "text": "(3) When you use your mobile banking to transfer to your mobile phone number (mobile, telecommunications and Unicom mobile phone number, radio and television and virtual operators mobile phone number), remittance SMS notification, payment to friends, opening a dragon card loan bar, call recharge involved in the address book, involved in the address bookAt the time, our bank only obtains the contact information you clicked from the address book and perform encrypted transmission to prevent malicious interception.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "When you use the mobile bank to transfer the mobile phone number, the remittance SMS notification, pay to friends, the opening of the dragon card loan bar, and the recharge involving the address book, our bank only obtains the contact information you clicked and encrypted transmission."}
{"task": "rw_3.jsonl", "id": 37372, "text": "The above information is personal sensitive information.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37373, "text": "If you refuse to provide the above information, you can choose to manually enter the contact information to continue using the above features.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37374, "text": "(4) When you use transfer remittances, account payment, QR code payment function, you may need to provide the payment party's mobile phone number, name, bank card number/account number, account opening bank, capital use information, and you may need to provide you with you to provide you with youThe name, mobile phone number, certificate type and document number information in order to verify the identity and payment services using the above functions.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the transfer remittance, account payment, QR code payment function, you may need to provide the payment party's mobile phone number, name, bank card number/account number, account opening bank, capital use information."}
{"task": "rw_3.jsonl", "id": 37375, "text": "In addition, our bank will collect your related receivable transactions for your inquiry.", "label": ["Important", "First Party Collection Information"], "rewrite": "Our bank will also collect your related receipt and payment transactions to facilitate your inquiry."}
{"task": "rw_3.jsonl", "id": 37376, "text": "Relevant matters are implemented according to the \"China Construction Bank Personal Customer Service Agreement\" agreed to sign when you add a bank card.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37377, "text": "The above information is a personal sensitive information. If you refuse to provide this information, it will only make you unable to use the above features, but it does not affect other functions of your mobile banking normally.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37378, "text": "(5) When you use the real -name authentication service provided by the mobile banking, you may need to provide your name, certificate type, certificate number, bank card number/account number, equipment information, fingerprint authentication, sound pattern certification, face brushing authentication information, I am, I am, I am, I am, I am, I am, I am.The line may also perform validity verification of relevant information by verifying the account/card password and SMS verification code.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the real -name authentication services provided by a mobile banking, you may need to provide your name, certificate type, certificate number, bank card number/account, equipment information, fingerprint authentication, sound pattern certification, face -brushing authentication information."}
{"task": "rw_3.jsonl", "id": 37379, "text": "If you refuse to provide the above information, our bank will not be able to provide you with products or services that you can use after real -name authentication.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37380, "text": "(6) When you use the real -name authentication services provided by direct -selling banks or \"E accounts\", our bank needs your name, gender, nationality, occupation, address, contact information, certificate types, documents, validity periods, banks, banks, banksCard number/account number, face -brushing authentication, document image information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the real -name authentication services provided by direct selling banks or \"E account\", our bank needs your name, gender, nationality, occupation, address, contact information, certificate type, certificate number, certificate validity period, bank card number/account number, Swipe face authentication, certificate video information."}
{"task": "rw_3.jsonl", "id": 37381, "text": "If you refuse to provide the above information, our bank will not be able to provide you with products or services that you can use after real -name authentication.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37382, "text": "(7) When you use the search service provided by a mobile banking, our bank will collect your search keyword information and click data to facilitate you to enter or show you the products or services related to the content related to you.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the search service provided by a mobile banking, our bank will collect your search keyword information and click data."}
{"task": "rw_3.jsonl", "id": 37383, "text": "When searching keyword information cannot identify your personal identity alone, this information does not belong to your user information. In order to provide you and other users with more efficient search services, our bank can use other purposes;", "label": ["Important", "Usage"], "rewrite": "When searching keyword information cannot identify your personal identity alone, the information does not belong to your user information."}
{"task": "rw_3.jsonl", "id": 37384, "text": "When searching keyword information with your other information can identify your personal identity, our bank will use your search keyword information as your user information during the combination period to protect it.", "label": ["Important", "Data Security"], "rewrite": "When searching keyword information with your other information can identify your personal identity, search keyword information as your user information for protection."}
{"task": "rw_3.jsonl", "id": 37385, "text": "(8) When you use geographical position -based functions, our bank will collect your location information in order to provide you with the corresponding service at your location.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use geographical location -based functions, our bank will collect your location information."}
{"task": "rw_3.jsonl", "id": 37386, "text": "If you refuse to provide this information, you will not be able to use the above features, but this will not affect other functions of your use of mobile banking.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37387, "text": "(9) When you do information management through the mobile banking, our bank may verify your original record password, sign the mobile phone number SMS verification code, original use equipment, and biological characteristics.", "label": ["Important"], "rewrite": "When you manage information through mobile banking, our bank may verify your original record password, signing mobile phone number SMS verification code, original use equipment, and biological characteristics."}
{"task": "rw_3.jsonl", "id": 37388, "text": "You can lift the device binding through the \"Security Center\" of the mobile banking.", "label": ["Edit/Control", "Important"], "rewrite": "You can lift the device binding through the \"Security Center\" of the mobile banking."}
{"task": "rw_3.jsonl", "id": 37389, "text": "In order to ensure the security of your account funds, you need to verify your user identity when you enter the \"Security Center\" for quick payment management, and provide the four -digit number of mobile phone numbers and sign a mobile phone number SMS verification code.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "When you enter the \"Security Center\" for quick payment management, you need to verify your user identity, and provide the four digits of the mobile phone number and the signing of the mobile phone number SMS verification code."}
{"task": "rw_3.jsonl", "id": 37390, "text": "(10) In the process of providing mobile banking services to you, our bank may use the software development work package (referred to as \"SDK\") provided by a third -party service provider to provide you.If you refuse to provide relevant information or permissions, you will not be able to use related functional services.", "label": ["Third Party Sharing/ Disclosure", "Edit/Control", "First Party Collection Information", "Important"], "rewrite": "Our bank may use the software development work package provided by a third -party service provider to provide you with a service, collecting your necessary information by third -party service providers."}
{"task": "rw_3.jsonl", "id": 37391, "text": "Specifically include:", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37392, "text": "1) Electronic Social Security Card SDK: In order to provide you with electronic social security card services, we use the Electronic Social Security Card SDK of the Human Resources and Social Security Bureau.Electronic social security cards are issued online.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "In order to provide you with an electronic social security card service, the electronic social security card SDK needs to obtain your name and ID card information and transmit it to the Human Resources and Social Security Agency."}
{"task": "rw_3.jsonl", "id": 37393, "text": "2) Baidu Map SDK: In order to provide you with geographical location -based services, we use Baidu Map SDK to obtain your positioning information, equipment number (IMEI/Android, ID) for the positioning function.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "In order to provide you with geographical location -based services, Baidu Map SDK needs to obtain your positioning information and equipment number."}
{"task": "rw_3.jsonl", "id": 37394, "text": "3) UnionPay ride code SDK: In order to provide you with a QR code ride service, we used the UnionPay ride code SDK and need to obtain your UnionPay customer number information to UnionPay to generate electronic ride QR codeEssence", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "In order to provide you with a two -dimensional code ride service, UnionPay ride code SDK needs to obtain your UnionPay customer number information to UnionPay."}
{"task": "rw_3.jsonl", "id": 37395, "text": "4) Unblocked Card SDK: In order to provide you with Chongqing unblocked card recharge service, we used the unblocked card SDK of Chongqing Mobile Financial Co., Ltd. to obtain your network, NFC read, storage, positioning, Bluetooth, camera, equipment number(IMei/Android, ID) permissions for unblocking card recharge services.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "In order to provide you with Chongqing unblocked card recharge services, the smooth card SDK will obtain your network, NFC read, storage, positioning, Bluetooth, camera, equipment number permissions."}
{"task": "rw_3.jsonl", "id": 37396, "text": "5) Social finance SDK, mobile manager SDK: In order to provide you with message notifications and online communication services, we use the social finance SDK and mobile manager SDK provided by Shenzhou Taiyue Company., Network, positioning, storage, and running the front desk service authority are used to push account change information, system announcements, and real -time voice and video communication services with customer managers.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "In order to provide you with message notifications and online communication services, social finance SDK and mobile manager SDK need to obtain your microphone, camera, album, telephone, network, positioning, storage, and running front desk service authority."}
{"task": "rw_3.jsonl", "id": 37397, "text": "6) Network certificate SDK: In order to provide you with a network certificate service, we use the network certificate SDK provided by the First Research Institute of the Ministry of Public Security. You need to obtain your name, certificate number, mobile phone number, device information, face information, transmission, transmission, transmissionFrom the first research institute of the Ministry of Public Security, it is used for online certificate opening and certification services.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "In order to provide you with a network certificate service, the online certificate SDK needs to obtain your name, certificate number, mobile phone number, equipment information, and face information to the First Institute of the Ministry of Public Security."}
{"task": "rw_3.jsonl", "id": 37398, "text": "7) Friends sharing SDK: In order to provide you with social sharing services, our bank uses the Friend League of Friends to share SDK and needs to collect your device logo information (such as IMEI/Android, ID/IDFA/Openudid/GUID/MACAddress/IP address) Public information with social accounts you need to share for social sharing services.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "In order to provide you with social sharing services, Friends sharing SDK needs to collect your device logo information and open information on social accounts you need to share."}
{"task": "rw_3.jsonl", "id": 37399, "text": "8) OCR identification SDK: In order to provide you with a certificate and bank card fast recognition service, our bank uses the OCR recognition SDK of Beijing Shangtang Technology Development Co., Ltd. to obtain your camera authority and storage permissions., Identity verification, bank card recognition.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "In order to provide you with a fast recognition service for your certificate and bank card, OCR recognition SDK will obtain your camera authority and storage permissions."}
{"task": "rw_3.jsonl", "id": 37400, "text": "9) Cloud Flash Payment SDK: In order to provide you with a dragon payment service, we use the cloud flash payment SDK provided by UnionPay, and you need to apply for your information from the Cloud Flash Pay App for Dragon Pay opening service.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "In order to provide you with a dragon payment service, you need to apply for your information from the Cloud Flash Pay App for Dragon Pay opening service."}
{"task": "rw_3.jsonl", "id": 37401, "text": "10) True Code SDK: In order to provide you with the real -knowledge code scanning service, we use the real knowledge code SDK provided by the real code information technology company.Detection service.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "In order to provide you with a real code scanning service, the real knowledge code SDK needs to obtain your camera authority and storage authority."}
{"task": "rw_3.jsonl", "id": 37402, "text": "11) Fingerprint authentication SDK: In order to provide you with convenient fingerprint authentication services, we use Huawei and Samsung's fingerprint authentication SDK to obtain your equipment fingerprint verification results for providing fingerprint login and fingerprint payment services.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "In order to provide you with convenient fingerprint authentication services, fingerprint authentication SDK will obtain your device fingerprint verification results."}
{"task": "rw_3.jsonl", "id": 37403, "text": "12) Voice Navigation SDK and Voice Bank SDK: In order to provide you with voice interactive services, our travel uses HKUST Xunfei's voice navigation SDK and voice bank SDK.Navigation services.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "In order to provide you with voice interaction services, voice navigation SDK and voice bank SDK need to obtain your microphone and recording authority."}
{"task": "rw_3.jsonl", "id": 37404, "text": "13) Face recognition SDK: In order to provide you with face recognition service, we use the face recognition SDK of Beijing Shangtang Technology Development Co., Ltd. to obtain your camera permissions and storage permissions for mobile banking face login, login,Face transfers, face payment, face withdrawal, and face improvement certification level.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "In order to provide you with face recognition service, face recognition SDK will obtain your camera authority and storage permissions."}
{"task": "rw_3.jsonl", "id": 37405, "text": "14) Huami authorized SDK: In order to provide you with Longmi bracelet service, we used Huami (Beijing) Information Technology Co., Ltd. Huami authorized SDK to obtain your bracelet information and Bluetooth authority for the bracelet.Binding and management.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "In order to provide you with Longmi bracelet service, Huami authorized SDK to obtain your bracelet information and Bluetooth authority."}
{"task": "rw_3.jsonl", "id": 37406, "text": "15) Huawei push SDK: In order to provide you with message services, our bank uses Huawei's Huawei push SDK to obtain your Huawei device token for mobile banking message notification services.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to provide you with a message service, Huawei pushes SDK to get your Huawei device token."}
{"task": "rw_3.jsonl", "id": 37407, "text": "16) Huawei 3D face recognition SDK: In order to provide you with Huawei mobile phone brush face login service, we use Huawei's 3D face recognition SDK to obtain your camera permissions for face authentication.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "In order to provide you with a Huawei mobile phone brushing service, 3D face recognition SDK will obtain your camera authority."}
{"task": "rw_3.jsonl", "id": 37408, "text": "17) WeChat SDK: In order to provide you with WeChat sharing function, we use WeChat SDK to obtain your device MAC address and unique device identification code for mobile banking WeChat sharing functions.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to provide you with WeChat sharing function, WeChat SDK will obtain your device MAC address and unique device recognition code."}
{"task": "rw_3.jsonl", "id": 37409, "text": "18) Weibo SDK: In order to provide you with Weibo sharing function, we used Sina Weibo's SDK to obtain your device logo information (IMei/Android, ID) for mobile banking sharing functions.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "In order to provide you with Weibo sharing function, Sina Weibo's SDK will obtain your device logo information."}
{"task": "rw_3.jsonl", "id": 37410, "text": "19) This machine number authentication SDK: In order to provide you with the authentication function of this machine number, we used the mobile communication operator (China Mobile, China Unicom, China Telecom) this machine number authentication SDK to obtain your mobile phone deviceMobile phone card information, used for mobile banking's machine number authentication function.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "In order to provide you with the authentication function of this machine number, this machine number authentication SDK will obtain the mobile phone card information on your mobile phone device."}
{"task": "rw_3.jsonl", "id": 37411, "text": "20) Fantai SDK: In order to provide you with online account opening/trading functions of securities, we used the SDK of Zhuhai Fantai Paid Technology Co., Ltd. to obtain your microphone, camera, album, and positioning authority for mobile banking verificationCustomer identity and online securities account opening function;", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "In order to provide you with online account opening/transaction functions, the SDK of Zhuhai Fantai Ji Person Technology Co., Ltd. will obtain your microphone, camera, album, and positioning permissions."}
{"task": "rw_3.jsonl", "id": 37412, "text": "Get the device number (IMEI/Android ID), IP, MAC address, mobile phone system type, mobile phone version, mobile phone manufacturer, mobile phone model information authority, for mobile banking online securities trading functions, and transmit information to you to conduct the corresponding correspondence of the Stock ExchangeThe securities company serves marks on securities compliance information.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition"], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37413, "text": "21) One -way video authentication SDK: In order to provide you with a unidirectional video authentication function for online account opening, we used AnyChat, SDK from Guangzhou Birui Network Technology Co., Ltd.Bank online securities account for one -way video certification when opening an account.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "In order to provide you with one -way video authentication function in online account opening, Anychat SDK will obtain your microphone rights and camera authority."}
{"task": "rw_3.jsonl", "id": 37414, "text": "(11) When you use investment and wealth management functions, our bank may collect your name, certificate type, certificate number, bank card number/account number, mobile phone number information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use investment and wealth management functions, our bank may collect your name, certificate type, certificate number, bank card number/account number, mobile phone number information."}
{"task": "rw_3.jsonl", "id": 37415, "text": "If you buy insurance, you may also collect your gender, country/region, mailing address, contact information, occupation, annual income information, and may transmit the above information to the corresponding product provider for product purchase and inquiry.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you buy insurance, you may collect your gender, country/region, mailing address, contact information, occupation, annual income information, and transmit it to the corresponding product provider for product purchase and inquiry."}
{"task": "rw_3.jsonl", "id": 37416, "text": "If you refuse to provide the above information, you will not be able to use the above features, but this does not affect other functions of your normal use of mobile banking, online banking, international Internet website and mobile portals.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37417, "text": "(12) When you use SMS banking and WeChat banking services, our bank will collect your account information and transaction information in order to send you account funds change and related notifications in time;", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use SMS banks and WeChat banking services, our bank will collect your account information and transaction information in order to send you account funding changes and related notifications to you in time."}
{"task": "rw_3.jsonl", "id": 37418, "text": "Our bank may provide your account information and transaction information to our partner with your partner with your own consent, so that you can send you account funds change and related notifications to you in a timely manner;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Our bank may provide your account information and transaction information to your partners with your own consent."}
{"task": "rw_3.jsonl", "id": 37419, "text": "Our bank may also collect information from our bank's partners and authorize the information that can be shared by authorized to provide you with corresponding message notifications and reminder services.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Our bank may collect information from our partner and information that can be shared by authorized by your partners."}
{"task": "rw_3.jsonl", "id": 37420, "text": "(13) When you use online banking, mobile banking, and direct sales banking services, our bank will collect your transaction information to form a collection of a payment person to simplify your transfer operation;", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use online banking, mobile banking, and direct sales banking services, our bank will collect your transaction information to form a collection of the collection of the payee to simplify your transfer operation."}
{"task": "rw_3.jsonl", "id": 37421, "text": "If you choose a mobile SMS dynamic password as a security certification tool, our bank will send a mobile phone SMS dynamic password to your signing mobile phone number to verify online banking, mobile banking, and direct sales bank transactions.", "label": ["Important", "Data Security"], "rewrite": "If you choose a mobile phone SMS dynamic password as a security certification tool, our bank will send a mobile phone number dynamic password to your signing mobile phone number for transaction verification."}
{"task": "rw_3.jsonl", "id": 37422, "text": "(14) When you use the member registration service provided by the international Internet website, our bank needs you to provide the mobile phone number information, and it may be verified by the validity verification of it through SMS.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the member registration service provided by the International Internet Website, our bank needs to provide you with mobile phone number information."}
{"task": "rw_3.jsonl", "id": 37423, "text": "If you refuse to provide the above information, our bank will not be able to provide you with products or services that need to be used after membership registration.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37424, "text": "(15) When you use the member login service provided by the international Internet website, our bank needs you to provide the username, mobile phone number, mailbox, nickname, certificate number, CCB account information, and may conduct valid verification of it through SMS.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the member login service provided by the international Internet website, our bank needs to provide you with user name, mobile phone number, mailbox, nickname, certificate number, CCB account information."}
{"task": "rw_3.jsonl", "id": 37425, "text": "If you refuse to provide the above information, our bank will not be able to provide you with products or services that you need to use after you log in.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37426, "text": "(16) When you use the member real -name authentication service provided by the international Internet website, our bank needs your name, bank card number/account number, and mobile phone number information, and may use the bank card number/account, password methodEffective verification.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the member real -name authentication services provided by the International Internet Website, our bank needs you to provide your name, bank card number/account number, and mobile phone number information."}
{"task": "rw_3.jsonl", "id": 37427, "text": "If you refuse to provide the above information, our bank will not be able to provide you with products or services that you can use after real -name authentication.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37428, "text": "(17) When you apply for a signing deduction service with online banking and mobile banking, our bank will collect your name, ID number, bank card number/account, mobile phone number information and payment user number information, and will pay the user numberBind it with the bank card number/account to deduct from your authorized binding account after obtaining your to -pay bill.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use online banking and mobile banking to apply for a signing deduction service, our bank will collect your name, ID number, bank card number/account, mobile phone number information and payment user number information."}
{"task": "rw_3.jsonl", "id": 37429, "text": "Our bank also verified the validity verification of your relevant information in CCB through verification account/card password, SMS verification code, and online banking shield.success;", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37430, "text": "In addition, our bank will collect your signing and deduction transaction records for your inquiry.", "label": ["Important", "First Party Collection Information"], "rewrite": "Our bank will also collect your signing deduction transaction records to facilitate your inquiry."}
{"task": "rw_3.jsonl", "id": 37431, "text": "The implementation of the \"China Construction Bank Yue Life Platform Payment Business Deduction Agreement\", which is agreed to sign the contract deduction when you open the contract deduction service.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37432, "text": "(18) When you use Shanrong Business Registration as a platform member, we need to obtain your name, certificate type, certificate number, bank card number/account number, bank card reserved mobile phone number, contact information information, our bankCollect this information to provide you with customer service support.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you register as a platform member using Shanrong Business, our bank needs to get your name, certificate type, certificate number, bank card number/account number, bank card reserved mobile phone number, contact information information."}
{"task": "rw_3.jsonl", "id": 37433, "text": "In order to give you the product or service you need better, our bank may collect equipment information you use our product/or service (including equipment name, device model, device recognition code, operating system and application version, language, language, language, language, language, language, language, language, language, language, language, language, languageSettings, resolution, service provider network ID (PLMN)), browser type and version to provide you with the best way to display product information display.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to give you a better presentation of the goods or services you need, our bank may collect equipment information, browser types and versions you use our product/or service to provide you with product information."}
{"task": "rw_3.jsonl", "id": 37434, "text": "You can also accurately find the goods or services you need by searching.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37435, "text": "Our travel will retain or count your search keywords and click data to facilitate you to enter or show you the products related to the content related to you.", "label": ["Data Retention", "Important", "Usage"], "rewrite": "Our travel will retain or count your search keywords and click data to facilitate you to enter or display it for you."}
{"task": "rw_3.jsonl", "id": 37436, "text": "Please note that your search keyword information cannot identify your identity alone. It does not belong to your personal information. In order to provide you and other users with more efficient search services, our bank has the right to use it;", "label": ["Important", "Usage"], "rewrite": "Your search keyword information cannot identify your identity alone and does not belong to your personal information."}
{"task": "rw_3.jsonl", "id": 37437, "text": "Only when your search keyword information is combined with your other information and can identify your identity, during the combination of use, our bank will use your search keyword information as your personal information, and your search with your search with your search.Historical records handle and protect them in accordance with this personal information protection policy.", "label": ["Important", "Data Security", "Usage"], "rewrite": "Only when your search keyword information is used in combination with other information and can recognize your identity, our bank will use your search keyword information as your personal information to process and protect."}
{"task": "rw_3.jsonl", "id": 37438, "text": "When you use the ordering service provided by Shanrong Business, you need to fill in the consignee's name, the consignee's name, the receiving address and the mobile phone number information in the order page. At the same time, the order number will be stated in the orderCommodity or service information, the amount you should pay and the payment method information;", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the ordering service provided by Shanrong Business, you need to fill in the consignee/consignee's name, the receiving address and mobile phone number information. At the same time, the order number will be stated in the order number, the product or service information you purchasedThe amount and payment method you should pay."}
{"task": "rw_3.jsonl", "id": 37439, "text": "Some information will be synchronized to a third -party ERP system connected to the Shanrong Business Platform, so that merchants can provide related services such as order delivery.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Some information will be synchronized to a third -party ERP system connected to the Shanrong Business Platform, so that merchants can provide related services such as order delivery."}
{"task": "rw_3.jsonl", "id": 37440, "text": "When you are involved in some marketing activities provided by Shanrong Business, you need to fill in the event gift receiver/consignee name, the receiving address, and the mobile phone number information on the event page.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you participate in some marketing activities provided by Shanrong Business, you need to fill in the event gift receiver/consignee's name, receiving address, and winning mobile phone number information."}
{"task": "rw_3.jsonl", "id": 37441, "text": "When you use the unit certification services provided by Shanrong Business, our bank needs to provide you with your invitation code, the information, name, and membership mobile phone number of your affiliated institution, and check the effective information of the relevant information through the invitation code.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the unit certification services provided by Shanrong Business, you need to provide your invitation code, the information of the institution, the name, and the membership mobile phone number."}
{"task": "rw_3.jsonl", "id": 37442, "text": "When you use the cross -border commodity transaction services provided by Shanrong Business, Shanrong Business and Platform Merchants need to transmit payment orders and orders including real -name information (including name and ID number) including customers.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When you use the cross -border commodity transaction services provided by Shanrong Business, Shanrong Business and Platform Merchants need to transmit payment orders and orders including the customer's real -name information."}
{"task": "rw_3.jsonl", "id": 37443, "text": "When the merchant obtains order information from Shanrong Business through the system docking interface, Shanrong Business will transmit order information including the real -name information of the customer (including the name and ID number).", "label": ["Important", "Risk"], "rewrite": "When merchants obtain order information from Shanrong Business through system docking interfaces, Shanrong Business will transmit order information including customer real -name information."}
{"task": "rw_3.jsonl", "id": 37444, "text": "When you use the mobile phone recharge service provided by Shanrong Business, you can quickly select the phone number through the address book, without your manual input.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37445, "text": "After rejecting authorization, the mobile phone recharge service can still be used, but you need to enter the mobile phone number manually.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37446, "text": "Shanrong Business reads only and records the designated phone number, and does not read your full address book.", "label": ["Permission Acquisition", "Important"], "rewrite": "Shanrong Business reads only and records the designated phone number, and does not read your full address book."}
{"task": "rw_3.jsonl", "id": 37447, "text": "When you book tickets such as air tickets, train tickets, hotels, and scenic spots, you may also need to be based on national laws and regulations, regulatory requirements or service providers (such as ticket seller, hotel, travel agency, and its authorized agents and basic telecommunications operators, Mobile Resale Operator) The request to provide your real -name information, these real -name information may include your identity information (such as your ID card, officer card, passport, and driver's certificate.Your own photos, names, phone numbers.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you book tickets such as air tickets, train tickets, hotels, and scenic spots, you may also need to provide your real -name information. These real -name information may include your identity information, your own photos, names, and phone numbers."}
{"task": "rw_3.jsonl", "id": 37448, "text": "These orders may also include your itinerary, hotel address, reserved identity information, contact name and phone number information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37449, "text": "All the above information constitutes your order information. Our bank will use your order information to perform your identity verification, determine transactions, pay settlement, complete distribution, query orders for you, and provide customer service consultation and after -sales service;", "label": ["Important", "Usage"], "rewrite": "Our bank will use your order information to perform your identity verification, determine transactions, payment settlement, complete delivery, query orders for you, and provide customer service consultation and after -sales service."}
{"task": "rw_3.jsonl", "id": 37450, "text": "Our bank will also use your order information to determine whether your transaction is abnormal to protect your transaction security.", "label": ["Important", "Data Security", "Usage"], "rewrite": "Our bank will also use your order information to determine whether your transaction is abnormal to protect your transaction security."}
{"task": "rw_3.jsonl", "id": 37451, "text": "After placing an order, you can choose to pay with CCB card or pay for other cards.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37452, "text": "After you place an order and choose the payment to pay or complete the payment online, Shanrong Commercial Merchants and third -party distribution companies will complete the delivery of orders for you.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37453, "text": "You agree here that Shanrong business merchants, third -party distribution companies, after -sales service, etc. can use your order information to provide you with goods or services.", "label": ["Important", "Usage"], "rewrite": "Use your order information to provide you with goods or services."}
{"task": "rw_3.jsonl", "id": 37454, "text": "Our telephone customer service and after -sales function will use your account information and order information.", "label": ["Important", "Usage"], "rewrite": "Our telephone customer service and after -sales function will use your account information and order information."}
{"task": "rw_3.jsonl", "id": 37455, "text": "To ensure your account security, our customer service will use your account information to verify your identity with you.", "label": ["Important", "Data Security", "Usage"], "rewrite": "Our customer service will use your account information to verify your identity with you."}
{"task": "rw_3.jsonl", "id": 37456, "text": "When you need our bank to provide customer service and after -sales service related to your order information, our bank will check your order information.", "label": ["Important", "Usage"], "rewrite": "When you need our bank to provide customer service and after -sales service related to your order information, our bank will check your order information."}
{"task": "rw_3.jsonl", "id": 37457, "text": "You may provide other information except the above information when communicating with our customer service staff, such as: when you ask our bank to change the delivery address, contact or contact number.", "label": ["Important", "First Party Collection Information"], "rewrite": "You may provide other information except the above information when communicating with our customer service staff."}
{"task": "rw_3.jsonl", "id": 37458, "text": "The transaction password and online banking shield number information may be verified by verifying account numbers, card passwords, SMS, credit card security code/validity period, transaction password, face brushing, and network silver shield method to verify the effectiveness of relevant information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Online banking shield number information and validity verification."}
{"task": "rw_3.jsonl", "id": 37459, "text": "If you refuse to provide the above information, our bank will not be able to provide you with products or services that you can use after real -name authentication.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37460, "text": "(20) When you use savings account inquiry, credit card inquiry, provident fund inquiry and pension query function, open bank accounts, RMB/foreign currency withdrawal, foreign exchange remittance and redeem currency reservation, credit card application and debit card application may be our bank.Collect your name, certificate type, certificate number, bank card number/account number, mobile phone number information, and may transmit the above information to the corresponding product provider for business inquiry, appointment, and application.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use savings account inquiry, credit card inquiry, provident fund inquiry and pension query function, open bank accounts, RMB/foreign currency withdrawal, foreign exchange remittances and redeem reservations for commemorative coins, credit card applications and debit card applications, our bank may collect youName, certificate type, certificate number, bank card number/account number, mobile phone number information,"}
{"task": "rw_3.jsonl", "id": 37461, "text": "If you refuse to provide the above information, you will not be able to use the above features, but this will not affect your normally using international Internet websites and other functions of mobile portals.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37462, "text": "(21) When you use the real -name query service of Yue Life, our bank needs to provide you with your name, ID number, and mobile phone number information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the real -name query service of Yue Life, our bank needs you to provide your name, ID number, and mobile phone number information."}
{"task": "rw_3.jsonl", "id": 37463, "text": "If you refuse to provide the above information, our bank will not be able to provide you with real -name query services.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37464, "text": "(22) When you use the limited query of the account payment, our bank may verify the effective information of the relevant information by verifying the account number, ID number, and SMS verification code.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37465, "text": "If you refuse to provide the above information, our bank will not be able to provide you with a limited query service.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37466, "text": "(23) When you participate in some marketing activities of Yue Life, our bank may collect your user name or mobile phone number of your login on mobile banking, personal online banking, Internet website, mobile portal, and WeChat bank as the only user identification number to participate in the event.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you are involved in some marketing activities of Yue Life, our bank may collect your username or mobile phone number of your login on mobile banking, personal online banking, Internet website, mobile portal, and WeChat bank as the only user identification number to participate in the event."}
{"task": "rw_3.jsonl", "id": 37467, "text": "3. When you use electronic banking services, in order to maintain the normal operation of the service, optimize our travel experience and ensure your account security, our guild collects the following basic information, including your device model, operating system, and unique equipment logoFaculty, mobile banking software version number, login IP address, MAC address, method, type and status of access networks, network quality and data, equipment accelerator (such as gravity sensor equipment), operating log, service log information (such as you are on a mobile bankingSearching and viewing information, service failure information), and geographical location information. This information is the basic information that you must collect for you to collect for you to ensure your normal use of our service.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the electronic banking service, our guild collects basic information to ensure your normal use of our travel service."}
{"task": "rw_3.jsonl", "id": 37468, "text": "Due to the differences in the permissions of the mobile phone operating system of different manufacturers, some mobile phones attribute the \"unique device logo\" to \"phone -call status or mobile network information\" or \"mobile phone information -mobile phone number and call status\".I did not read your mobile phone call records and status.", "label": ["First Party Collection Information", "Permission Acquisition"], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37469, "text": "4. In order to provide you with more accurate, personality and convenient services, and improve the service experience, our bank will collect the categories, methods and operating behavior information of your use of electronic banking functions or services, and your travel information on our bank.Our guillery can statistics and analysis of this information, and will provide you with precise push services according to the above information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Our bank will collect the categories, methods, and operating behavior information of your use of electronic banking functions or services, as well as your user and transaction information on our bank to statistics and analysis, and provide you with precise push services."}
{"task": "rw_3.jsonl", "id": 37470, "text": "If you refuse to provide the above information, our bank will not be able to provide you with precise push services, but it does not affect other functions of your use of electronic banks normally.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37471, "text": "5. In order to provide you with a better service experience, improve service quality, or to prevent risks, our bank will collect information provided by your feedback suggestions or reports. If you refuse to provide the above information, our bank will not provide corresponding services.But it does not affect other functions of your normal use of electronic banks.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "To provide you with a better service experience, improve service quality, or to prevent risks, our bank will collect information provided by your feedback suggestions or reports."}
{"task": "rw_3.jsonl", "id": 37472, "text": "6. When you use the services provided by a third party in electronic banks, third parties may get your nickname, avatar, location, name, certificate type, certificate number, mobile phone number information;", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "When you use the service provided by a third party in the electronic bank, a third party may get your nickname, avatar, location, name, certificate type, certificate number, mobile phone number information."}
{"task": "rw_3.jsonl", "id": 37473, "text": "After your individual consent, the third party can obtain your above information;", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "After your individual consent, the third party can obtain your information."}
{"task": "rw_3.jsonl", "id": 37474, "text": "For the relevant information provided to the third party when you use the service provided by a third party, our bank will be regarded as you allow the third party to obtain the above -mentioned information;", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "For the relevant information provided by your service provided by the third party, our bank will be deemed that you allow the third party to obtain."}
{"task": "rw_3.jsonl", "id": 37475, "text": "For the information that you generate when using the third -party service, you and the third party should agree on the collection and use of the above information according to law.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "For the information that you generate when using the third -party service, you should collect and use the information agreed by the third party in accordance with the law."}
{"task": "rw_3.jsonl", "id": 37476, "text": "If you refuse to collect, use or pass the above information when providing services, it may cause you to be unable to use the corresponding service of third parties in electronic banks, but this does not affect other functions of your use of electronic banks.", "label": ["Third Party Sharing/ Disclosure", "First Party Collection Information"], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37477, "text": "7. In the following circumstances, you can choose whether to authorize our bank to collect and use your personal information:", "label": ["Important", "First Party Collection Information"], "rewrite": "In the following situation, you can choose whether to authorize our bank to collect and use your personal information:"}
{"task": "rw_3.jsonl", "id": 37478, "text": "(1) Camera for identifying QR codes, face recognition, OCR recognition, setting avatars, video, E account, ETC, customer manager communicationLoan remote signing, dedicated debit debit cards, migrant workers, UnionPay face payment, savings government bond subscription scenarios for debit debit debit debit debit debit debit debit debit students.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "The camera permissions are used to identify the two -dimensional code, face recognition, OCR recognition and other scenarios."}
{"task": "rw_3.jsonl", "id": 37479, "text": "After rejecting authorization, the above functions will not be used.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37480, "text": "Our bank will store data such as face and other data, and stored in the system background database after encryption.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "Our bank will store data such as face and other data, and stored in the system background database after encryption."}
{"task": "rw_3.jsonl", "id": 37481, "text": "(2) Microphone, used for sound pattern recognition, recording, voice navigation, voice banking, voice broadcasting, voice customer service, customer manager communication, smart band service purposes, in voice login/transfer/payment, voice navigation, voice banking, voice banking bank, Dragon Fortune Voice Broadcasting, Private Banking Consultant Service Voice Broadcast, Customer Manager Communication, and Smart Band service scenarios.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "Microphone permission is used for vocal pattern recognition, recording, voice navigation, voice banking, voice broadcasting and other scenarios."}
{"task": "rw_3.jsonl", "id": 37482, "text": "After rejecting authorization, the above functions will not be used.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37483, "text": "The sound pattern data collected by our line is stored in the system background database after encryption.", "label": ["Data Retention", "Important", "First Party Collection Information", "Data Security"], "rewrite": "The sound pattern data collected by our line is stored in the system background database after encryption."}
{"task": "rw_3.jsonl", "id": 37484, "text": "(3) In the process of transfer, payment, and receiving address management, the mobile phone address book is used to help you quickly select the phone number through the address book, and you do not need to enter manually.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "In the process of transfer, payment, and delivery address management, mobile phone address book is used to assist you in quickly select the phone number through the address book."}
{"task": "rw_3.jsonl", "id": 37485, "text": "After refusing to be authorized, transfer to mobile phone numbers, payment to friends, remittance SMS notification, and Dragon Card loan bar can still be used, but you need to enter the mobile phone number manually.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37486, "text": "Mobile banking only reads and records the designated phone number, and does not read your full address book.", "label": ["Important", "First Party Collection Information"], "rewrite": "Mobile banking only reads and records the designated phone number, and does not read your full address book."}
{"task": "rw_3.jsonl", "id": 37487, "text": "(4) Mobile SMS, you may need to read the verification code SMS content in the link that requires the SMS verification code to help you fill in the verification code.", "label": ["Important", "First Party Collection Information"], "rewrite": "The link that needs to be a SMS verification code may need to read the verification code SMS content to help you fill in the verification code."}
{"task": "rw_3.jsonl", "id": 37488, "text": "If you refuse to authorize the communication information (SMS), our mobile phone bank will not read the text message content, and the system background does not save the text message content.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37489, "text": "(5) Geographical location, obtain your geographical location to provide outlet navigation, benefit life services, urban services, local special services, and electronic bank transaction risk control.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Get your geographical location to provide outlet navigation, benefit life services, urban services, local special services, and electronic bank transaction risk control."}
{"task": "rw_3.jsonl", "id": 37490, "text": "The system background keeps your location information when trading.", "label": ["Data Retention", "Important", "First Party Collection Information"], "rewrite": "The system background keeps your location information when trading."}
{"task": "rw_3.jsonl", "id": 37491, "text": "After rejecting authorization, the related functions of mobile banking cannot be used.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37492, "text": "(6) Read the installation application list to scan the application of the CCB APP app.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "Read the installation application list, and whether there is an application for the CCB APP application."}
{"task": "rw_3.jsonl", "id": 37493, "text": "After rejecting authorization, the APP health check function cannot be used.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37494, "text": "The system's background does not save customers who have installed application list information.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "The system's background does not save customers who have installed application list information."}
{"task": "rw_3.jsonl", "id": 37495, "text": "(7) Bluetooth is used to connect and interact with third -party devices through Bluetooth.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37496, "text": "After rejecting authorization, the Longmi bracelet and unblocked card recharge function cannot be used.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37497, "text": "The system's background does not save the customer's mobile phone Bluetooth configuration information.", "label": ["Data Retention", "Important", "First Party Collection Information"], "rewrite": "The system's background does not save the customer's mobile phone Bluetooth configuration information."}
{"task": "rw_3.jsonl", "id": 37498, "text": "(8) Network communication is used to communicate with the server.", "label": ["Important"], "rewrite": "Network communication permissions are used to communicate with the server."}
{"task": "rw_3.jsonl", "id": 37499, "text": "After rejecting authorization, all the functions that need to be used by mobile banking cannot be used.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37500, "text": "The network information used in the system to save the device used in the system, including IP, port and other information.", "label": ["Data Retention", "Important", "First Party Collection Information"], "rewrite": "The network information used in the system to save the device used in the system, including IP, port and other information."}
{"task": "rw_3.jsonl", "id": 37501, "text": "The above features may require you to turn on your camera (camera), geographical location (location information), microphone, Bluetooth, mobile SMS, online communication, and mobile phone address book access to our device to achieve these functionsCollection and use of information involved.", "label": ["First Party Collection Information", "Permission Acquisition"], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37502, "text": "Please note that when you turn on these permissions, it means that you can authorize our bank to collect and use this information to implement the above functions. If you cancel these authorization, our bank will no longer continue to collect and use your information, and you cannot do it for you for youProvide the above functions corresponding to these authorization.", "label": ["Edit/Control", "Permission Acquisition", "Risk", "Important", "First Party Collection Information"], "rewrite": "The opening of one authority means that the authorization is authorized to collect and use the relevant information to provide corresponding services. Close the authority to cancel the authorization representative, and no longer continue to collect and use relevant information based on the corresponding permissions."}
{"task": "rw_3.jsonl", "id": 37503, "text": "If you collect or use your information beyond the above situation, our bank will ask your consent in advance, and to fully inform you the purpose, method, scope, and preservation period of information collection and use, as well as the way you exercise your rights and procedures, etc.Essence", "label": ["Important", "First Party Collection Information"], "rewrite": "If you collect or use your information beyond the situation, our bank will seek your consent in advance and fully inform you the purpose, method, scope, and preservation period of the information collection and use, and the way you exercise your rights and procedures for the right to exercise your rights and procedures.wait."}
{"task": "rw_3.jsonl", "id": 37504, "text": "(2) How to use information", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37505, "text": "1. When you provide you with the consent of your bank's bank's financial products or services, our bank will also use this information to maintain and improve the aforementioned business functions.", "label": ["Important", "Usage"], "rewrite": "Our guilty uses collected information to maintain and improve the aforementioned business functions."}
{"task": "rw_3.jsonl", "id": 37506, "text": "2. During our trip to you, you authorize our bank to continue to collect and use your information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "During our trip to you to provide you with financial services, you authorize our bank to continue to collect and use your information."}
{"task": "rw_3.jsonl", "id": 37507, "text": "When you cancel the service, our bank will stop collecting your relevant personal information, but our guild will continue to use your relevant personal information collected in the fields of business data archiving, auditing, supervision and investigation.", "label": ["Risk", "Edit/Control", "First Party Collection Information", "Important"], "rewrite": "When you cancel the service, our bank will stop collecting your relevant personal information, but will continue to use the personal information collected before in the fields of business data archiving, auditing, supervision and investigation."}
{"task": "rw_3.jsonl", "id": 37508, "text": "3. In order to improve your product or service experience, or to prevent risks, our bank will summarize, analyze, and process the service usage, but this information will not include any identity information information.", "label": ["Important", "Usage"], "rewrite": "Our travel will summarize, analyze, and process the service usage, but this information will not include any identity information information."}
{"task": "rw_3.jsonl", "id": 37509, "text": "4. In order to make you know the situation of using our bank's financial products or services or to make you learn more about our travel service, our bank will send you a service status notification and the commercial information of related products or services.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37510, "text": "5. What you authorize and other purposes that are allowed by the law.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37511, "text": "(3) Exceptions of obtaining authorization consent", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37512, "text": "According to relevant laws and regulations, regulatory requirements, and national standards, in the following circumstances, our bank may collect and use your relevant personal information without asking for your authorization consent:", "label": ["Important", "First Party Collection Information"], "rewrite": "According to relevant laws and regulations, regulatory requirements, and national standards, in the following circumstances, our bank may collect and use your relevant personal information without asking for your authorization consent:"}
{"task": "rw_3.jsonl", "id": 37513, "text": "1. Directly related to national security and national defense security;", "label": ["Important", "First Party Collection Information"], "rewrite": "The collection and use information directly related to national security and national defense security does not need to solicit authorization consent."}
{"task": "rw_3.jsonl", "id": 37514, "text": "2. Directly related to public safety, public health, and major public interests;", "label": ["Important", "First Party Collection Information"], "rewrite": "The collection and use information directly related to public safety, public health, and major public interests does not need to solicit authorization consent."}
{"task": "rw_3.jsonl", "id": 37515, "text": "3. Directly related to criminal investigation, prosecution, trial and judgment execution;", "label": ["Important", "First Party Collection Information"], "rewrite": "Direct related collection and use information such as criminal investigation, prosecution, trial and judgment execution does not need to solicit authorization consent."}
{"task": "rw_3.jsonl", "id": 37516, "text": "4. Out of maintaining major legitimate rights and interests such as life, property such as you or other individuals, but it is difficult to get your consent;", "label": ["Important", "First Party Collection Information"], "rewrite": "Out of maintaining major legitimate rights and interests such as life and property of you or other individuals, it is difficult to obtain the collection and use information you agree with, without requiring the consent of authorization."}
{"task": "rw_3.jsonl", "id": 37517, "text": "5. The collected personal information is publicly disclosed to the public by itself, but you clearly refuse or collect or use this information to infringe your major interests;", "label": ["Important", "First Party Collection Information"], "rewrite": "The collected personal information is publicly disclosed to the public by itself, and there is no need to solicit authorization consent, but you clearly refuse or collect or use this information to infringe your major interests."}
{"task": "rw_3.jsonl", "id": 37518, "text": "6. Collect personal information from the information disclosed by legal publicly, such as legal news reports and government information disclosure, but you clearly refuse or collect or use this information to infringe your major interests;", "label": ["Important", "First Party Collection Information"], "rewrite": "If you collect personal information from the legal disclosure information, you do not need to solicit authorization consent."}
{"task": "rw_3.jsonl", "id": 37519, "text": "7. Signing and fulfilling the contract according to your requirements;", "label": ["Important", "First Party Collection Information"], "rewrite": "According to your request to sign and perform the collection and use information necessary for the contract, no authorization consent is required."}
{"task": "rw_3.jsonl", "id": 37520, "text": "8.The necessary and stable operation of the products or services provided by maintaining the products or services, such as discovering and disposing of products or services;", "label": ["Important", "First Party Collection Information"], "rewrite": "The collection and use information necessary for the safe and stable operation of the products or services provided by the products provided does not need to solicit authorization consent."}
{"task": "rw_3.jsonl", "id": 37521, "text": "9. Other circumstances stipulated in laws and regulations and regulatory requirements.", "label": ["Important", "First Party Collection Information"], "rewrite": "Other collection and use information stipulated in laws and regulations does not need to solicit authorization."}
{"task": "rw_3.jsonl", "id": 37522, "text": "2. How can our trip use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37523, "text": "(1) Cookie", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37524, "text": "To ensure the normal operation of the website, our guilty of small data files are stored on your computer or mobile device.", "label": ["Important", "First Party Collection Information"], "rewrite": "Our will store small data files named Cookie on your computer or mobile device."}
{"task": "rw_3.jsonl", "id": 37525, "text": "Cookie usually contains identifiers, site names, and some numbers and characters.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37526, "text": "With the help of cookies, websites can store data such as your preferences or products in shopping baskets.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37527, "text": "Our bank will not use Cookie for any purpose outside of the purpose of this policy.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37528, "text": "You can manage or delete according to your preferences, cookies.", "label": ["Important", "Edit/Control"], "rewrite": "You can manage or delete Cookie according to your preferences."}
{"task": "rw_3.jsonl", "id": 37529, "text": "You can remove everything stored on the computer, Cookie, and most of the network browsers have the function of preventing cookies.", "label": ["Edit/Control", "Important"], "rewrite": "You can clear all the cookies saved on the computer."}
{"task": "rw_3.jsonl", "id": 37530, "text": "But if you do this, you need to change the user settings when you visit our website.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37531, "text": "(2) Do Not Track (Do not track)", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37532, "text": "Many network browsers have the Do not track function, which can release the DO Not Track request to the website.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37533, "text": "At present, the major Internet standard organization has not yet established relevant policies to stipulate how websites should respond to such requests.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37534, "text": "But if your browser is enabled, do, not, track, then all our websites will respect your choice.", "label": ["Edit/Control", "Important"], "rewrite": "If your browser enables Do Not Track, all our websites will respect your choice."}
{"task": "rw_3.jsonl", "id": 37535, "text": "3. How can our bank share, transfer and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37536, "text": "(1) Sharing and transfer", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37537, "text": "1. Unless you get your separate consent or authorization, our bank will not share or transfer your personal information from any other companies, organizations and individuals.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Unless you get your separate consent or authorization, our bank will not share or transfer your personal information to any other companies, organizations and individuals."}
{"task": "rw_3.jsonl", "id": 37538, "text": "2. If the business needs to share or transfer your personal information to the outside world, our bank will inform you that the purpose, processing method, personal information types, names or names of data receiving parties, and contact information of sharing or transferring personal information will be informed.Solid consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If the business needs to share or transfer your personal information to the outside world, our bank will inform you that the purpose, processing method, personal information type, data receiver information of sharing or transfer personal information will be informed of you, and your own consent is obtained."}
{"task": "rw_3.jsonl", "id": 37539, "text": "3. Please understand that our bank may share your personal information to the outside world in accordance with the provisions of laws and regulations, or in accordance with the mandatory requirements of the government authority.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Our bank may share your personal information to the outside world in accordance with the provisions of laws and regulations, or in accordance with the mandatory requirements of the government authority."}
{"task": "rw_3.jsonl", "id": 37540, "text": "4. According to laws and regulations and business practices, in similar transactions such as mergers, acquisitions, and asset transfer, if you involve personal information transfer, our bank will inform you that the name or name and contact information of the receiver will be told youThe company and organization of your personal information continue to be subject to this personal information protection policy, otherwise our bank will ask the company and the organization to reconcile your authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When involving mergers, acquisitions, or bankruptcy liquidation, if personal information transfer is involved, it will be required to continue to be bound by the policy, otherwise it will request that it will re -solicit authorization consent."}
{"task": "rw_3.jsonl", "id": 37541, "text": "(2) Public disclosure", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37542, "text": "1. I will not disclose your personal information publicly. If you really need to disclose it, we will tell you the purpose and type of personal information. Those who involve sensitive information will also inform the content of sensitive information and obtain your separate alone in advance.agree.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you really need to be disclosed, our will tell you the purpose and type of personal information. Those who involve sensitive information will also inform the content of sensitive information and obtain your separate consent in advance."}
{"task": "rw_3.jsonl", "id": 37543, "text": "2. Please understand that under the circumstances of legal, legal procedures, litigation or government authorities, our bank may disclose your personal information publicly.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "With the compulsory requirements of legal, legal procedures, litigation, or government authorities, our bank may disclose your personal information publicly."}
{"task": "rw_3.jsonl", "id": 37544, "text": "(3) Exceptions of obtaining authorization consent", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37545, "text": "According to relevant laws and regulations, regulatory requirements, and national standards, in the following circumstances, our bank may share, transfer, and publicly disclose user information without obtaining your authorization in advance:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "According to relevant laws and regulations, regulatory requirements, and national standards, in the following circumstances, our bank may share, transfer, and publicly disclose user information without obtaining your authorization in advance:"}
{"task": "rw_3.jsonl", "id": 37546, "text": "1. Directly related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The sharing or disclosure directly related to national security and national defense security does not require authorization."}
{"task": "rw_3.jsonl", "id": 37547, "text": "2. Directly related to public safety, public health, and major public interests;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Sharing or disclosure directly related to public safety, public health and major public interests does not need to be authorized."}
{"task": "rw_3.jsonl", "id": 37548, "text": "3. Directly related to criminal investigation, prosecution, trial and judgment execution;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Sharing or disclosure related to criminal investigation, prosecution, trial, and judgment execution does not need to be authorized."}
{"task": "rw_3.jsonl", "id": 37549, "text": "4. For major legitimate rights and interests such as maintaining your life, property, and reputation of your or other individuals, it is difficult to get my consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Out of the major legitimate rights and interests of the life and property of the subject of personal information or other individuals, it is difficult to get shared or disclosed by my consent, and there is no need to solicit."}
{"task": "rw_3.jsonl", "id": 37550, "text": "5. Personal information that you disclose to the public yourself, but you clearly refuse or collect or use this information to infringe your major interests;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You do nt need to authorize the personal information that you disclose to the public yourself, but you clearly refuse or collect or use this information to infringe your major interests."}
{"task": "rw_3.jsonl", "id": 37551, "text": "6. User information collected from legal publicly disclosed information, such as legal news reports, government information disclosure, etc., but you clearly refuse or collect or use this information to infringe your major interests.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you collect personal information from the legal disclosure information, no authorization is required."}
{"task": "rw_3.jsonl", "id": 37552, "text": "Fourth, how can our trip store and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37553, "text": "(1) Storage", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37554, "text": "1. The personal information collected and generated in the territory of the People's Republic of China will be stored in the territory of the People's Republic of China.", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in domestic operations will be stored in China."}
{"task": "rw_3.jsonl", "id": 37555, "text": "It really needs to be provided overseas. Under the premise of having legal conditions, we will tell you that the name or name, contact information, processing purpose, processing method, personal information type, and your right to exercise your rights to the overseas receiver will be exercised.Methods and procedures and other matters, and after getting your separate consent, your personal information may be transferred abroad.", "label": ["Data Retention", "Important"], "rewrite": "Under the premise of having legal conditions, our bank will inform you the relevant information of the overseas receiving party and get your personal information after obtaining your separate consent."}
{"task": "rw_3.jsonl", "id": 37556, "text": "In this case, our bank will take effective measures to protect your information security. For example, implement security measures such as data dementification before cross -border data transfer, or to require overseas institutions to keep confidentiality for your information through measures and verification measures.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "When cross -border data transfer, our bank will take effective measures to protect your information security."}
{"task": "rw_3.jsonl", "id": 37557, "text": "Storage of biometric information: Our bank stores personal biometric information separately from personal identity information;", "label": ["Important", "Data Security"], "rewrite": "Our bank stores personal biometric information separately from personal identity information."}
{"task": "rw_3.jsonl", "id": 37558, "text": "Our travel will not collect your fingerprints and face information for facial recognition services. Your fingerprint and face information are only stored on the device that you authorize to collect fingerprints and face information;", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "Your fingerprint and the face information are only stored on the device you authorize to collect fingerprints and face information."}
{"task": "rw_3.jsonl", "id": 37559, "text": "Delete the original information in the collection terminal after using the face brushing, sound pattern and other functions and authentication functions, and store personal biological identification information on the line of our line only.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "Delete the original information in the collection terminal after using the face brushing, sound pattern and other functions and authentication functions, and store personal biological identification information on the line of our line only."}
{"task": "rw_3.jsonl", "id": 37560, "text": "2. Our bank only retains your personal information within the time limit required by laws and regulations, as well as the time limit for the purpose of realizing the purpose of this policy.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "Keep your personal information only within the time limit for service purposes, unless the law has other requirements."}
{"task": "rw_3.jsonl", "id": 37561, "text": "For example:", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37562, "text": "Mobile phone number: When you need to use mobile banking services, our bank needs to keep your mobile phone number to ensure that you use the service normally. When you cancel the mobile banking account, our bank will delete the corresponding information;", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "When you need to use a mobile banking service, our bank needs to save your mobile phone number until you delete it after you cancel it."}
{"task": "rw_3.jsonl", "id": 37563, "text": "User avatar: When you set up your avatar, our guild has always saved your avatar for login page display.", "label": ["Data Retention", "Important"], "rewrite": "When you set the avatar, our guild has always saved your avatar for login page display."}
{"task": "rw_3.jsonl", "id": 37564, "text": "When you choose to restore the silent avatar, our bank will delete the avatar information you set.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "When you choose to restore the silent avatar, our bank will delete the avatar information you set."}
{"task": "rw_3.jsonl", "id": 37565, "text": "Biometric information: When you use biometric information services, our bank needs to save your face, sound pattern and other information to ensure that you use the service normally. When you no longer use biometric information services, our bank will delete the corresponding correspondinginformation.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "When you use biometric information services, our bank needs to save your face, sound pattern and other information."}
{"task": "rw_3.jsonl", "id": 37566, "text": "(2) Protection", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37567, "text": "1. Our bank has used security protection measures that meet the industry standards to protect your personal information, prevent data from being interviewed, publicly disclosed, used, modified, damaged or lost.", "label": ["Important", "Data Security"], "rewrite": "Use security protection measures to protect your personal information and prevent data from being interviewed, publicly disclosed, used, modified, damaged, or lost."}
{"task": "rw_3.jsonl", "id": 37568, "text": "Our trip will take all reasonable and feasible measures to protect your personal information.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37569, "text": "For example: we will use encryption technology to ensure the confidentiality of the data;", "label": ["Important", "Data Security"], "rewrite": "We will use encryption technology to ensure the confidentiality of the data."}
{"task": "rw_3.jsonl", "id": 37570, "text": "Our guilty uses a trusted protection mechanism to prevent data from being maliciously attacked;", "label": ["Important", "Data Security"], "rewrite": "Our guided use of trusted protection mechanisms to prevent data from being maliciously attacked."}
{"task": "rw_3.jsonl", "id": 37571, "text": "Our conference deploys the access control mechanism to ensure that only authorized personnel can access personal information;", "label": ["Important", "Data Security"], "rewrite": "Our conference deploys the access control mechanism to ensure that only authorized personnel can access personal information."}
{"task": "rw_3.jsonl", "id": 37572, "text": "And our guild organize security and personal information protection training courses to strengthen employees' awareness of protecting the importance of personal information.", "label": ["Important", "Data Security"], "rewrite": "Our guild organizes safety and personal information protection training courses to strengthen employees' awareness of protecting personal information."}
{"task": "rw_3.jsonl", "id": 37573, "text": "2. If all or part of the electronic banking business provided by our bank is stopped operating, the relevant products or services of our bank will inform you through the announcement and other forms.Personal information security.", "label": ["Important", "Data Security", "Cessation of Operations"], "rewrite": "When stopping operation, we will make an announcement notice and delete or processes your personal information."}
{"task": "rw_3.jsonl", "id": 37574, "text": "If all or part of the electronic banking business interruption is caused by various or some electronic banks due to various reasons such as technical faults, network attacks, natural disasters and accidents, and human factors, our bank will take emergency treatment and restoration measures to respond to restore services as soon as possible.", "label": ["Important", "Data Security"], "rewrite": "Our bank will take emergency disposal and recovery measures to respond to the problem of e -banking business interruption and restore services as soon as possible."}
{"task": "rw_3.jsonl", "id": 37575, "text": "3. Our bank has obtained the following certification: At present, our bank has passed the evaluation and filing of national network security level protection. In terms of information security, the data center has met the requirements of the ISO27001 certification standard and obtained corresponding certification.", "label": ["Important", "Data Security"], "rewrite": "Our bank has passed the evaluation and filing of national network security level protection. In terms of information security, the data center has reached the requirements of the ISO27001 certification standard and obtained corresponding certification."}
{"task": "rw_3.jsonl", "id": 37576, "text": "4. Our trip will take all reasonable and feasible measures to ensure unrelated personal information.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "Our trip will take all reasonable and feasible measures to ensure unrelated personal information."}
{"task": "rw_3.jsonl", "id": 37577, "text": "5. Please understand that due to the limitation of technical level and possible malicious attacks, there may be unexpected situations that cannot be reasonably foresee, prevent, avoid, and control.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37578, "text": "The Internet is not an absolutely secure environment. Please use complex passwords to assist our travel to ensure your account security.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37579, "text": "6. If a personal information security incident occurs, our bank will inform you in accordance with the requirements of the laws and regulations in the form of email, letter, telephone, push notification, etc., or in a reasonable and effective manner.", "label": ["Important", "Data Security"], "rewrite": "The relevant situation of security incidents will be informed or issued by mail, letter, telephone, push notification, etc. or issued an announcement."}
{"task": "rw_3.jsonl", "id": 37580, "text": "At the same time, our bank will also report to the disposal of personal information security incidents in accordance with regulatory regulations.", "label": ["Important", "Data Security"], "rewrite": "Report the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities."}
{"task": "rw_3.jsonl", "id": 37581, "text": "5. The right to control personal information", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37582, "text": "In accordance with China's relevant laws and regulations and regulatory regulations, our bank guarantees the following rights to exercise your personal information:", "label": ["Important"], "rewrite": "In accordance with China's relevant laws and regulations and regulatory regulations, our bank guarantees the following rights to exercise your personal information:"}
{"task": "rw_3.jsonl", "id": 37583, "text": "(1) Visit, correct and update your personal information", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37584, "text": "You have the right to visit and correct your personal information through our bank's international Internet websites, online banking, mobile banking, telephone banking, WeChat banking, and Shanrong business channels.", "label": ["Important", "Edit/Control"], "rewrite": "You have the right to visit and correct your personal information through our bank's international Internet websites, online banking, mobile banking, telephone banking, WeChat banking, and Shanrong business channels."}
{"task": "rw_3.jsonl", "id": 37585, "text": "You have a responsibility to update your personal information in time.", "label": ["Important", "Edit/Control"], "rewrite": "You have a responsibility to update your personal information in time."}
{"task": "rw_3.jsonl", "id": 37586, "text": "Before you modify your personal information, our trip will verify your identity.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37587, "text": "1. After you log in to your mobile banking, you can query name, gender, certificate type, certificate number, signing mobile phone number, belonging to branch information in \"My Information\";", "label": ["Important", "Edit/Control"], "rewrite": "After you log in to your mobile banking, you can query name, gender, certificate type, certificate number, signing mobile phone number, and branch information in \"My Information\"."}
{"task": "rw_3.jsonl", "id": 37588, "text": "In the modification of customer information, the country, region, occupation, and communication address can be modified;", "label": ["Important", "Edit/Control"], "rewrite": "In the modification of customer information, national/regional, occupation, and mailing address can be modified."}
{"task": "rw_3.jsonl", "id": 37589, "text": "Inquiry and modify your security settings in the \"Security Center\";", "label": ["Important", "Edit/Control"], "rewrite": "Inquiry and modify your security settings in the \"Security Center\"."}
{"task": "rw_3.jsonl", "id": 37590, "text": "Manage binding bank cards, opening E accounts, Class III households, and other account services in the \"account,\" in the function of \"account,\"", "label": ["Important", "Edit/Control"], "rewrite": "Manage the binding bank card, open E account, Class  households, and other account services in the \"account\" function."}
{"task": "rw_3.jsonl", "id": 37591, "text": "In the \"Message Service Customs\" management account change notification, financial market notification, credit card bill sending method, points activity notification, Yue Living payment reminder, preferential activity notice, dragon wealth news notice, orientation push authorization;", "label": ["Important", "Edit/Control"], "rewrite": "In the \"Message Service Customization\", the notification of management account change, financial market notification, credit card bill sending method, points activity notification, Yue Living payment reminder, preferential activity notification, dragon wealth news notice, and directional push authorization."}
{"task": "rw_3.jsonl", "id": 37592, "text": "In the \"My Payment\", check and update your signing account for your signing deduction service.", "label": ["Important", "Edit/Control"], "rewrite": "In the \"My Payment\", check and update your signing account for your signing deduction service."}
{"task": "rw_3.jsonl", "id": 37593, "text": "Quick Payment Management -Express Payment is an authorized payment service launched by Construction Bank for third -party payment institutions and some high -quality merchants.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37594, "text": "Individual customers holding the Construction Bank's current savings or credit card accounts, after opening the fast payment function through third -party authorization, customers do not need to jump to the Construction Bank payment page when applying for a payment business in a third party.Complete payment directly.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37595, "text": "Quick payment management business includes query of the quick payment authorization account, suspension of authorization, restoration of authorization, and designated accounts to open the quick payment authorization function.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37596, "text": "2. After you log in to the online banking, you can perform private settings, payment settings, SMS settings, security settings, personal information settings, message service customization in \"Settings\";", "label": ["Important", "Edit/Control"], "rewrite": "After you log in to the online banking, you can make private settings, payment settings, SMS settings, security settings, personal information settings, and message service customization in \"Settings\"."}
{"task": "rw_3.jsonl", "id": 37597, "text": "You can query and update your signing account in the \"Life Service Homepage-Easy Payment-Signing Deduction\".", "label": ["Important", "Edit/Control"], "rewrite": "You can query and update your signing account in the \"Life Service Homepage-Easy Payment-Signing Deduction\"."}
{"task": "rw_3.jsonl", "id": 37598, "text": "Private setting-provides personalized online banking security customization functions by adopting security technologies such as anti-counterfeiting and privacy.", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "Personalized online banking security customization functions are provided by adopting security technologies such as anti -counterfeiting and setting privacy."}
{"task": "rw_3.jsonl", "id": 37599, "text": "The main functions include anti -counterfeiting information, account function settings, suspending online banking, and modifying private information.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37600, "text": "Payment settings-including fast payment and quick payment management.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37601, "text": "The fast payment is an authorized payment service launched by some high -quality merchants for some high -quality merchants.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37602, "text": "Individual customers holding the Construction Bank's current savings or credit card accounts, after authorizing the opening of the quick payment function to a specific merchant through online banking or account SMS verification, customers do not need to jump to the Construction Bank Pay page when applying for a payment business. CustomersAfter passing the business security verification, the payment can be completed.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37603, "text": "Quick payment business mainly includes commissioned authorization, cancellation authorization, modification authorization, and entrustment deduction business;", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37604, "text": "Among them, the entrusted authorization business can be entrusted from the online banking system or from the merchant system.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37605, "text": "SMS settings-including SMS verification settings and SMS reminder settings.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37606, "text": "SMS verification settings are reminded by transaction confirmation during the transfer transaction process to further ensure the security of personal online banking transfer accounts.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37607, "text": "Safety settings-provide customers with a variety of security services that enhance online banking to ensure the security of online banking accounts.", "label": ["Important", "Edit/Control"], "rewrite": "Safety settings-provide customers with a variety of security services that enhance online banking to ensure the security of online banking accounts."}
{"task": "rw_3.jsonl", "id": 37608, "text": "The main functions include: Modify passwords, dynamic passwords, opening convenient payment services, free verification settings, national secret shield activation, fast transfer settings.", "label": ["Important", "Edit/Control"], "rewrite": "Safety settings mainly include: modify passwords, dynamic passwords, opening convenient payment services, validation settings, national secret shield activation, fast transfer settings."}
{"task": "rw_3.jsonl", "id": 37609, "text": "Personal information settings-mail service receiving the announcement information sent by online banking and providing customers to send information such as information such as consulting, complaints, suggestions, and praise to the system.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37610, "text": "Provide customers with a personalized user nickname setting function, and can log in to the CCB online banking with the nickname.", "label": ["Important", "Edit/Control"], "rewrite": "Personal information is set to provide customers with a personalized user nickname setting function, which can be logged in to the online banking of Construction Bank using the nickname."}
{"task": "rw_3.jsonl", "id": 37611, "text": "Support to query personal basic information and set avatars and background pictures.", "label": ["Important", "Edit/Control"], "rewrite": "Personal information settings support to query basic information and set up avatars and background pictures."}
{"task": "rw_3.jsonl", "id": 37612, "text": "Message service custom-customized maintenance account change notification, financial market notification, credit card message notification, points activity information reminder, notification message accepts through mobile banking and SMS channels.", "label": ["Important", "Edit/Control"], "rewrite": "Message service custom-customized maintenance account change notification, financial market notification, credit card message notification, points activity information reminder, notification message accepts through mobile banking and SMS channels."}
{"task": "rw_3.jsonl", "id": 37613, "text": "3. After you log in to the international Internet website members, you can query and modify your basic information in \"My .com\"-\"User Information\", mainly including avatars, mobile phone numbers, login passwords, email, nicknames, in additionYou can add a bank card number/account.", "label": ["Important", "Edit/Control"], "rewrite": "After you log in to the international Internet website members, you can query and modify your basic information in \"My .com\"-\"User Information\". In addition, you can add a bank card number/account."}
{"task": "rw_3.jsonl", "id": 37614, "text": "4. You log in to Shanrong Business Personal Mall. In \"My Mall\"-\"Member Services\", you can query and modify your basic information, mainly including avatars, mobile phone numbers, login passwords, email mailboxes, nicknames, locations;", "label": ["Edit/Control", "Important"], "rewrite": "You log in to Shanrong Business Personal Mall. In \"My Mall\"-\"Member Service\", you can query and modify your basic information."}
{"task": "rw_3.jsonl", "id": 37615, "text": "Log in to Shanrong Business Enterprise Mall. In the \"Business Center\"-\"Member Service\", you can query and modify your basic information, mainly including mobile phone numbers, login passwords, emails, and avatars.", "label": ["Edit/Control", "Important"], "rewrite": "You can log in to Shanrong Business Enterprise Mall. In the \"Business Center\"-\"Member Service\", you can query and modify your basic information."}
{"task": "rw_3.jsonl", "id": 37616, "text": "5. For modifying mobile phone bank signing information, it can be handled through our counter, e -dynamic terminal or self -service device.", "label": ["Important", "Edit/Control"], "rewrite": "For modifying mobile phone bank signing information information, it can be handled through our counter, e -dynamic terminal or self -service device."}
{"task": "rw_3.jsonl", "id": 37617, "text": "(2) Delete your personal information", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37618, "text": "In the following circumstances, you can make a request to delete personal information from our bank:", "label": ["Important", "Edit/Control"], "rewrite": "You can make a request to delete personal information to our bank."}
{"task": "rw_3.jsonl", "id": 37619, "text": "1. If our behavior of handling personal information violates laws and regulations;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37620, "text": "2. If we collect and use your personal information, you have not obtained your consent;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37621, "text": "3. If our behavior of handling personal information violates your agreement;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37622, "text": "4. If you no longer use our product or service, or you cancel your account;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37623, "text": "5. If my trip no longer provides you with products or services.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37624, "text": "If our bank decides to respond to your deletion request, our bank will also notify the entities that obtain your personal information from our bank, asking them to delete them in time, unless laws and regulations have other regulations, or these entities have obtained your independent authorization.", "label": ["Important", "Edit/Control"], "rewrite": "If our bank decides to respond to your deletion request, our bank will also notify the entities that obtain your personal information from our bank, asking them to delete them in time, unless laws and regulations have other regulations, or these entities have obtained your independent authorization."}
{"task": "rw_3.jsonl", "id": 37625, "text": "When you delete the information from our line, our bank may not immediately delete the corresponding information in the backup system, but it will delete these information when the backup is updated.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Delete the information you require delete in the backup update."}
{"task": "rw_3.jsonl", "id": 37626, "text": "If the preservation period stipulated in laws and administrative regulations has not expired, or delete your information is difficult to achieve technically, our bank will stop processing except for storage and necessary security measures.", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "If the preservation period stipulated in laws and regulations is not expired, or it is difficult to achieve technically, our bank will stop handling except for storage and adopting necessary safety protection measures."}
{"task": "rw_3.jsonl", "id": 37627, "text": "(3) Change the scope of your authorization consent", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37628, "text": "Each business function requires some basic personal information to complete.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37629, "text": "For personal information (such as location, mobile phone address book, etc.) to improve the product or service experience, you can use the mobile phone system settings according to the different brands and models of the mobile phone.Contact human rights, call permissions, etc., give or withdraw your authorization consent at any time.", "label": ["Important", "Edit/Control"], "rewrite": "You can give or withdraw your authorization consent at any time by opening or closing the location service authority, reading contact human rights, dial -call permissions, etc. at any time."}
{"task": "rw_3.jsonl", "id": 37630, "text": "Please note that you will independently cancel our electronic banking service (online banking services, mobile banking services, SMS financial services, WeChat banking services, direct sales banking services, good business services, etc.), and will be regarded as you have withdrawn from meThe consent of the electronic banking service \"Personal Information Protection Policy\", for example, if you cancel our mobile banking service, it depends on your consent of the \"Personal Information Protection Policy\" of our mobile banking.", "label": ["Policy Change", "Important", "Edit/Control"], "rewrite": "While you cancel our electronic banking services independently, you will deepen your consent of the \"Personal Information Protection Policy\" of the electronic bank service of our bank."}
{"task": "rw_3.jsonl", "id": 37631, "text": "When you withdraw your consent, our bank will no longer process the corresponding personal information.", "label": ["Important", "Edit/Control"], "rewrite": "When you withdraw your consent, our bank will no longer process the corresponding personal information."}
{"task": "rw_3.jsonl", "id": 37632, "text": "But your decision to withdraw consent will not affect personal information processing based on your authorization.", "label": ["Permission Acquisition", "Edit/Control", "Risk", "Important"], "rewrite": "The decision you withdraws from consent will not affect personal information processing based on your authorization."}
{"task": "rw_3.jsonl", "id": 37633, "text": "If you don't want to accept the business advertising text message sent to you, you can be canceled to 95533 or 106980095533 by editing \"QXYX\" at any time.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37634, "text": "(4) Profile accounts for personal information main body", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37635, "text": "If you register a user for our electronic banking, you can go to the outlet to cancel your electronic banking through channels such as our counter or E -end or self -service device, and you can also choose to cancel themselves through the following ways.", "label": ["Important", "Edit/Control"], "rewrite": "If you register a user for our electronic banking, you can go to the outlet to cancel your electronic banking, or you can choose to cancel it by self -help through the following ways."}
{"task": "rw_3.jsonl", "id": 37636, "text": "1. If you cancel the mobile banking, you can download our mobile banking client, start the client, click the \"Security Center\" in the sidebar-\"Logging out the mobile phone bank\", enter the mobile phone number, related account number, account password and SMS verification codeYou can cancel the mobile banking after verification.", "label": ["Edit/Control", "Important"], "rewrite": "If you cancel the mobile banking, you can download our mobile banking client, start the client, and click the \"Security Center\" in the sidebar-\"Logging up the mobile phone bank\", enter the mobile phone number, related account number, account password and SMS verification code, verify the verificationAfter passing, you can cancel the mobile banking."}
{"task": "rw_3.jsonl", "id": 37637, "text": "Among them, other accounts for opening mobile banks need to enter CCB's wallet account number and dragon payment password.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37638, "text": "2. If you cancel the online bank, you can log in to the online bank, enter the \"account management\" in the \"My Account\" menu, select \"Logging out online banking services\", delete all online bank accounts and terminate online banking services;", "label": ["Edit/Control", "Important"], "rewrite": "If you log in to the online bank, you can log in to the online bank, enter the \"account management\" in the \"My Account\" menu, select \"Logging out online banking services\", delete all online bank accounts and terminate online banking services."}
{"task": "rw_3.jsonl", "id": 37639, "text": "Or select \"Profile for Personal Online Banking\" on the login interface of the personal online banking, enter the customer's name, certificate number, Ren Yi CCB real -name account number, account password, and account reserved mobile phone number information., Delete all online banks and terminate online banking services.", "label": ["Important", "Edit/Control"], "rewrite": "Select the \"Personal Online Banking Logistics\" on the personal online banking login interface.Delete all online banks and terminate online banking services."}
{"task": "rw_3.jsonl", "id": 37640, "text": "3. If you cancel the WeChat Bank, you can click on the WeChat menu or enter the \"unbinding\" through the dialogue mode to issue an unbinding instruction to the public account of our bank to cancel the binding relationship between the bank account and the WeChat;", "label": ["Important", "Edit/Control"], "rewrite": "If you cancel the WeChat Bank, you can click on the WeChat menu or enter the \"unbinding\" through the dialogue mode to issue an unbinding instruction to the public account of our bank to cancel the binding relationship between the bank account and the WeChat."}
{"task": "rw_3.jsonl", "id": 37641, "text": "Or click the \"No more attention\" button on the \"China Construction Bank\" WeChat public account details page to cancel the attention of the \"China Construction Bank\" WeChat public account, and the system automatically lifts all the binding relationships of customers after the system.", "label": ["Important", "Edit/Control"], "rewrite": "Click the \"No more attention\" button on the \"China Construction Bank\" WeChat public account details page to cancel the attention of the \"China Construction Bank\" WeChat public account, and the system will automatically lift the customer's binding relationship automatically."}
{"task": "rw_3.jsonl", "id": 37642, "text": "4. If you cancel the SMS financial services, you can cancel SMS financial services in various ways, including uplink SMS, Internet website, telephone banking, online banking, mobile banking and bank outlets.", "label": ["Important", "Edit/Control"], "rewrite": "If you cancel the SMS financial services, you can cancel the SMS, Internet website, telephone banking, online banking, mobile banking, and bank outlets."}
{"task": "rw_3.jsonl", "id": 37643, "text": "5. If you cancel the international Internet website members, you can log in to the construction bank portal www.ccb.com, click the basic information in \"My .com\"-\"User Information\" in the page-account service-cancellation website members.", "label": ["Edit/Control", "Important"], "rewrite": "If you cancel the international Internet website members, you can log in to the construction of the Construction Bank portal www.ccb.com and click on the basic information in the page \"My .com\"-\"User Information\"-account service-cancellation website members."}
{"task": "rw_3.jsonl", "id": 37644, "text": "Upper SMS -You use your mobile phone editing SMS, \"QXZH#Account\" or \"QXFW\" is sent to 95533, which can cancel the account change notification service.", "label": ["Important", "Edit/Control"], "rewrite": "Upper SMS -You use your mobile editor SMS \"QXZH#Account\" or \"QXFW\" to send to 95533, which can cancel the account change notification service."}
{"task": "rw_3.jsonl", "id": 37645, "text": "Logging in the Internet website-you can log in to the January Construction Bank portal www.ccb.com, click \"Electronic Bank-, Message Service Customization\" on the page to enter the SMS financial service opening page, and cancel the notification of changes in the SMS account, wealth management information or payment of the SMS account.Recharge service.", "label": ["Important", "Edit/Control"], "rewrite": "You can log in to the construction bank portal website www.ccb.com, click \"Electronic Bank-Message Service Customization\" in the page to enter the SMS financial service to open the page to cancel the SMS account change notification, financial information SMS or payment recharge service."}
{"task": "rw_3.jsonl", "id": 37646, "text": "Calculating telephone banking -you can select artificial services by dialing 95533, explain to customer service representatives after passing the authentication of identity verification;", "label": ["Important", "Edit/Control"], "rewrite": "You can select 95533 to select manual services. After passing the identity verification, explain to customer service representatives to cancel the notification service of the change of the SMS account."}
{"task": "rw_3.jsonl", "id": 37647, "text": "At the same time, you can also choose a self -service voice to cancel.", "label": ["Important", "Edit/Control"], "rewrite": "You can choose a self -service voice to cancel."}
{"task": "rw_3.jsonl", "id": 37648, "text": "Online banking  You can cancel the account change notification service in the \"Settings\" \"Settings\" \"Settings\" \"Settings\".", "label": ["Edit/Control", "Important"], "rewrite": "After logging in to online banking, you can cancel the account change notification service in the \"Settings\" \"Settings\" \"Settings\"."}
{"task": "rw_3.jsonl", "id": 37649, "text": "Among them, after the online banking of online banks can log in to online banking, the \"channel interactive signing and maintenance\" of \"My Account\" cancels SMS transfer remittance and payment recharge services.", "label": ["Important", "Edit/Control"], "rewrite": "After the online banking of the online bank can log in to the online banking, the \"channel interactive signing and maintenance\" of \"My Account\" cancels SMS transfer remittance and payment recharge services."}
{"task": "rw_3.jsonl", "id": 37650, "text": "Mobile banking is canceled -you can log in to the \"Message Service Customization\" menu after logging in to the mobile banking to cancel the notification service of the account change.", "label": ["Important", "Edit/Control"], "rewrite": "After logging in to the mobile bank, you can cancel the notification service of the account change through the \"Message Service Customization\" menu."}
{"task": "rw_3.jsonl", "id": 37651, "text": "Among them, senior customers of mobile banking can cancel the payment and recharge service through the \"SMS Financial Services\" menu after logging in to the mobile banking.", "label": ["Important", "Edit/Control"], "rewrite": "Senior customers of mobile banking can cancel the payment recharge service through the \"SMS Financial Services\" menu after logging in to the mobile banking."}
{"task": "rw_3.jsonl", "id": 37652, "text": "If you are not a registered user of electronic banks, you can choose to uninstall or stop using mobile banking clients to prevent our bank from obtaining your personal information.", "label": ["Edit/Control", "Important"], "rewrite": "If you are not a registered user of electronic banks, you can choose to uninstall or stop using mobile banking clients to prevent our bank from obtaining your personal information."}
{"task": "rw_3.jsonl", "id": 37653, "text": "Your behavior of canceling the electronic bank is irreversible. Once you log out your electronic bank, your mobile banking will cancel simultaneously. Our bank will no longer collect your personal information through the mobile banking client and delete everything about your mobile banking bankExcept for information, laws and regulations, or regulators, the storage time of personal information is otherally stipulated.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Once you cancel your electronic bank, your mobile banking will cancel simultaneously, our bank will no longer collect your personal information and delete it. The laws and regulations or regulators have other regulations on the storage time of personal information."}
{"task": "rw_3.jsonl", "id": 37654, "text": "Please note that when the registered users of our electronic banks only delete the mobile banking app in mobile phone devices, our bank will not cancel your mobile banking, and all information about your mobile banking will not delete it.", "label": ["Edit/Control", "Important"], "rewrite": "When the mobile banking app is deleted in mobile phone devices, our bank will not cancel your mobile banking."}
{"task": "rw_3.jsonl", "id": 37655, "text": "You still need to cancel your electronic banking to achieve the above goals.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37656, "text": "Logging out on electronic banks will not automatically cancel your shortcut and fast payment authorization. You can take the initiative to cancel the authorization in payment management or third -party.", "label": ["Important", "Edit/Control"], "rewrite": "Logging out on electronic banks will not automatically cancel your shortcut and fast payment authorization. You can take the initiative to cancel the authorization in payment management or third -party."}
{"task": "rw_3.jsonl", "id": 37657, "text": "(5) Automatic decision -making of constraint information systems", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37658, "text": "In certain business functions, our bank may make decisions based on non -artificial automatic decision -making mechanisms such as information systems and algorithms.", "label": ["Important", "Usage"], "rewrite": "Our bank may make decisions based on non -artificial automatic decision -making mechanisms."}
{"task": "rw_3.jsonl", "id": 37659, "text": "If these decisions significantly affect your legitimate rights and interests, you have the right to ask us to explain, and our bank will also provide appropriate relief methods.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37660, "text": "(6) In response to your above request", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37661, "text": "To ensure safety, you may need to provide a written request or prove your identity in other ways.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37662, "text": "Our bank may ask you to verify your identity first, and then process your request.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37663, "text": "Please understand that for some unprovoral repetitions, too much technical means, risk or very unrealistic requests to others' legitimate rights and interests, our bank may refuse.", "label": ["Edit/Control", "Important"], "rewrite": "Our bank may refuse some unprocessed repeats, need too much technical means, bring risks or very unrealistic requests to the legitimate rights and interests of others."}
{"task": "rw_3.jsonl", "id": 37664, "text": "Although there are above, in accordance with the requirements of laws and regulations, if the following circumstances, our bank may not be able to respond to your request:", "label": ["Important", "Risk"], "rewrite": "If it involves the following circumstances, our bank may not be able to respond to your request:"}
{"task": "rw_3.jsonl", "id": 37665, "text": "1.Related to national security and national defense security;", "label": ["Important"], "rewrite": "If your request is directly related to national security and national defense security, you may not be responded."}
{"task": "rw_3.jsonl", "id": 37666, "text": "2.It is related to public safety, public health, and major public interests;", "label": ["Important"], "rewrite": "Your request is directly related to public safety, public health, and major public interests and may not be responded."}
{"task": "rw_3.jsonl", "id": 37667, "text": "3.Related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Important"], "rewrite": "Your request is related to criminal investigation, prosecution, and trial, and may not be responded."}
{"task": "rw_3.jsonl", "id": 37668, "text": "4.There is sufficient evidence that you have subjective malicious or abuse of rights;", "label": ["Important"], "rewrite": "We have sufficient evidence that if you have subjective malice or abuse of rights, you may not be able to respond to the request."}
{"task": "rw_3.jsonl", "id": 37669, "text": "5. Response your request will cause serious damage to the legitimate rights and interests of you or other individuals and organizations;", "label": ["Important"], "rewrite": "We may not be able to respond to requests that exceed the storage range, exceed the reasonable limit, or the legitimate rights and interests of personal information subjects or other individuals and organizations will be seriously damaged."}
{"task": "rw_3.jsonl", "id": 37670, "text": "6. Involving our business secrets.", "label": ["Important"], "rewrite": "We may not be able to respond."}
{"task": "rw_3.jsonl", "id": 37671, "text": "6. How to deal with the information of minors for our trip", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37672, "text": "Without the consent of the guardian, minors may not create their own user account.", "label": ["Specific Audiences", "Important"], "rewrite": "Without the consent of the guardian, minors may not create their own user account."}
{"task": "rw_3.jsonl", "id": 37673, "text": "If you are a minor, please read this guideline carefully and use our service to use our bank's service or provide information to our bank under the premise of obtaining your consent.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a minor, please use our bank's service or provide information to our bank under the premise of obtaining your consent."}
{"task": "rw_3.jsonl", "id": 37674, "text": "Our bank will only use this information when the laws and regulations and regulatory requirements are allowed or protect the minors.", "label": ["Specific Audiences", "Important"], "rewrite": "Our bank will only use information and protect minor information outside of the laws and regulations and regulatory requirements to allow or protect minors."}
{"task": "rw_3.jsonl", "id": 37675, "text": "7. How to update this policy", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37676, "text": "According to changes in national laws and regulations and service operations, our bank will modify this policy and related rules.Window and other methods (our travel will choose one or more ways according to the actual situation) and solicit your authorization consent again.", "label": ["Policy Change", "Important"], "rewrite": "The revised content of this policy will be announced through channels such as our international Internet website, online banking, WeChat client and other channels. The mobile banking APP push notification or pop -up window will be announced and will once again solicit your authorization consent."}
{"task": "rw_3.jsonl", "id": 37677, "text": "You should pay attention to changes in related content, prompt information, agreements, rules and other related content from time to time.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37678, "text": "You know and confirm that if you do not agree with the updated content, you should immediately stop using the corresponding service and cancel relevant users. Our bank will stop collecting your personal information;", "label": ["Policy Change", "Important"], "rewrite": "If you do not agree with the updated content, you should immediately stop using the corresponding service and cancel the relevant users. Our bank will stop collecting your relevant personal information."}
{"task": "rw_3.jsonl", "id": 37679, "text": "If you continue to use your service, our bank will execute the update content.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37680, "text": "8. How to contact me", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37681, "text": "If you have any questions, opinions, or suggestions on this personal information protection policy, you can pass on the official website of our bank (www.ccb.com) by calling our bank's 95533 customer service hotline, follow the \"China Construction Bank\" WeChat public account or come to our bankConsultation or reflection of various business outlets.", "label": ["Important", "Contact Information"], "rewrite": "Customer service hotline: 95533; our official website: www.ccb.com; WeChat public account: \"China Construction Bank\"."}
{"task": "rw_3.jsonl", "id": 37682, "text": "After accepting your problem, our guild will deal with it in time and properly.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37683, "text": "Under normal circumstances, our bank will give a reply within 15 working days.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37684, "text": "The full name of our bank: China Construction Bank Co., Ltd., registered address: No. 25, Financial Street, Xicheng District, Beijing, China, 100033.", "label": ["Important", "Contact Information"], "rewrite": "The full name of our bank: China Construction Bank Co., Ltd., registered address: No. 25, Financial Street, Xicheng District, Beijing, China, 100033."}
{"task": "rw_3.jsonl", "id": 37685, "text": "Please carefully read this personal information protection policy before clicking \"Agree\" to ensure that the meaning of its content, especially the font and black content, and the corresponding legal consequences are all known and fully understood.", "label": [], "rewrite": []}
{"task": "rw_3.jsonl", "id": 37686, "text": "If you click \"Agree\" and confirm that the submission is to be regarded as your acceptance of this personal information protection policy, our bank will legally use and protect your personal information in accordance with relevant laws and regulations and this policy.", "label": ["Policy Change", "Important"], "rewrite": "If you click \"Agree\" and confirm that the submission is to be regarded as your acceptance of this personal information protection policy, our bank will legally use and protect your personal information in accordance with relevant laws and regulations and this policy."}
{"task": "rw_3.jsonl", "id": 37687, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
