{"task": "rw_34.jsonl", "id": 48686, "text": "Version update: May 12, 2022", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48687, "text": "Effective time: May 20, 2022", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48688, "text": "[Special Tips] Please read our \"Transfer Privacy Policy\" (especially the content of bold or downwalk) and determine our understanding of our personal information processing rules to help you understand the way to maintain your personal information rights.", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48689, "text": "During the reading process, if you have any questions, you can contact us in time (the contact information is subject to the privacy policy).", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48690, "text": "If you do not agree with any terms in this privacy policy, you should immediately stop accessing the transfer platform.", "label": ["Policy Change", "Important"], "rewrite": "If you do not agree with any terms in this privacy policy, you should stop access immediately."}
{"task": "rw_34.jsonl", "id": 48691, "text": "When you use any service provided by the transfer platform, it means that you have agreed that we can legally handle and protect your personal information in accordance with this privacy policy.", "label": ["Policy Change", "Important", "Risk"], "rewrite": "When you use any service provided by the transfer platform, it means you have agreed to this privacy policy."}
{"task": "rw_34.jsonl", "id": 48692, "text": "introduction:", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48693, "text": "\"Transfer Privacy Policy\" will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48694, "text": "1. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48695, "text": "2. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48696, "text": "3. How do we entrust your personal information, provide, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48697, "text": "4. How do we protect your personal information", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48698, "text": "5. The right to manage personal information", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48699, "text": "6. How do we deal with the personal information of minors", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48700, "text": "7. How to update this privacy policy", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48701, "text": "8. How to contact us", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48702, "text": "Turn (that is, the Beijing Transfer Spiring Spiritual Technology Co., Ltd., the registered address is: Xixiakou Road, Haidian District, Beijing, 66, No. 1 Zhongguancun Dongsheng Science and Technology Park • North Territory, B-2, Building, 2, Floor, C203, C205, Room (Dongsheng Area), contact information: (010) 83416704, is the main body and service provider of the transfer platform, hereinafter referred to as \"we\"/\"turn\"/\"transfer platform\")) I know personal information to youThe importance of we respect and protects the personal information of all users who use the transfer platform service, and will do our best to protect your personal information security and reliable.", "label": ["Important", "Contact Information"], "rewrite": "The registered address is: Dongsheng Science and Technology Park, No. 66 Xixiakou Road, Haidian District, Beijing • Room C203 and C205 (Dongsheng Region), Building 2 Floor, Building B-2, and contact information: (010) 83416704"}
{"task": "rw_34.jsonl", "id": 48703, "text": "At the same time, we promise to take corresponding security protection measures in accordance with the mature security standards of the industry to protect your personal information.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48704, "text": "Before using our products (or services), please carefully read and understand this \"Privacy Policy\" (hereinafter referred to as \"this privacy policy\"/\"this policy\").", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48705, "text": "This privacy policy belongs to the inseparable effective component of the \"Transfer User Service Agreement\".", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48706, "text": "Protection of personal information: We have always attached great importance to and are committed to the protection of personal information of minors.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48707, "text": "If you are a minor, you need to read this policy with your parents or other guardians;", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48708, "text": "If you are a child under the age of 14, before you use our service, you and your parents or other guardians should also carefully read the \"Children's Version\" we specially formulated, and ensure that you have obtained your parents or otherAfter the guardian's consent of \"Children's Privacy Policy <Children's Edition>\", we can use our services under the guidance of parents or other guardians to ensure that you are using our services and security during transactions.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48709, "text": "If you have any questions about this privacy policy or you have any questions about dealing with our personal information when using the services we provided, you can use ① to turn the customer service channel (turn to the APP, or turn to the second -hand trading network small program.-Mine-customer service center) or ② send email to the person in charge of personal information protection.The full -time department of information protection will give you a reply as soon as possible to solve your confusion in time.", "label": ["Important", "Contact Information"], "rewrite": "Personal information protection person mailbox: jubao@zhuanzhuan.com; bad information report phone (010) 83416704."}
{"task": "rw_34.jsonl", "id": 48710, "text": "Table of contents:", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48711, "text": "1. The general principle of our personal information", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48712, "text": "Second, the scope of the application of privacy policies", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48713, "text": "3. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48714, "text": "4. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48715, "text": "Fifth, how do we entrust your personal information, provide, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48716, "text": "6. How do we store and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48717, "text": "7. The right to manage personal information", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48718, "text": "8. How do we deal with the personal information of minors", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48719, "text": "Nine, the update and notice of this privacy policy", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48720, "text": "Ten, how to contact us", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48721, "text": "11. Dispute resolution", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48722, "text": "1. The general principle of our personal information", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48723, "text": "Generally, we will collect your personal information based on the function of this privacy policy.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48724, "text": "In some cases, if we involve other information, we will show you the clauses of personal information protection.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48725, "text": "The principles of subject participation and the principle of openness and transparency, and the terms of individual personal information protection instructions are preferred.", "label": ["Important", "Data Security"], "rewrite": "We handle personal information, abide by the principles of consistent and responsibilities, the principles of clear purpose, the principle of selecting consent, the minimum principles, ensuring safety principles, subject participation principles, and the principles of openness and transparency."}
{"task": "rw_34.jsonl", "id": 48726, "text": "If the content of the individual personal information protection description is not mentioned, this policy is applicable.", "label": ["Important", "Data Security"], "rewrite": "If the content of the individual personal information protection description is not mentioned, this policy is applicable."}
{"task": "rw_34.jsonl", "id": 48727, "text": "In terms of dealing with your personal information, we are committed to maintaining your trust in us, adhere to the following principles, and protect your personal information: the principle of legitimate and correct integrity, the principles of consistent power and responsibilityPrinciples, ensure safety principles, subject participation principles, open and transparent principles, and data quality principles.", "label": ["Important", "Data Security"], "rewrite": "We handle personal information, abide by the principles of legitimate and fair integrity, the principles of consistent power and responsibilities, the principles of clear purpose, the principles of choice, at least the principle of at least enough, ensure the principles of security, the principles of the subject, the principle of openness and transparency, and the principle of data quality."}
{"task": "rw_34.jsonl", "id": 48728, "text": "The principles of subject participation and the principle of openness and transparency.", "label": ["Important", "Data Security"], "rewrite": "We handle personal information, abide by the principles of consistent power, the principles of clear purpose, the principles of consent, the minimum principles, the principles of safety, the principles of safety, the principles of subject participation, and the principles of disclosure and transparency."}
{"task": "rw_34.jsonl", "id": 48729, "text": "Second, the scope of the application of privacy policies", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48730, "text": "This privacy policy is suitable for us to transfer to the second -hand trading website (www.zhuanzhuan.com), the transfer mobile application software (APP), the transition second -hand trading network mini program, and the new forms that have emerged with the development of technology to provide you with all items provided to youproduct and service.", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48731, "text": "Except for the relevant information collection activities described by this privacy policy, this privacy policy is not applicable to other services you provided by the transfer platform users and other third directions. Other services are suitable for the privacy policy or personal information collection that it explained to youUse rules.", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48732, "text": "3. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48733, "text": "The personal information involved in this privacy policy or containing personal information and sensitive information contains from the personal information of the \"Personal Information Security\".", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48734, "text": "。", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48735, "text": "We will discuss in detail in this article (1) and (2). Based on the following functions, we will collect and use the types and purpose of collecting and using your personal information.", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48736, "text": "Personal information refers to the that can be recorded in electronics or other methods that can be used alone with identified or other information that can identify specific natural person status or reflect various information related to the activity of specific natural persons, excluding information after anonymous processing.", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48737, "text": "Personal information involved in this privacy policy includes: basic information (including personal name, birthday, gender, receipt address, phone number, e -mail, education, work information);", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48738, "text": "Personal information (including ID card or passport);", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48739, "text": "Facial features;", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48740, "text": "Network identity information (including system accounts, IP addresses) personal property information (bank account, financial payment account, transaction and consumption records, and virtual property information such as coupons, red envelopes, game redeem code);", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48741, "text": "Personal Internet records (including website browsing records, software use records, click records);", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48742, "text": "Personal commonly used equipment information (including hardware models, equipment MAC addresses, operating system types, application lists (application names, application package names, installation time) and process information, unique device recognition code IMEI/AndroidId/OAID/IDFA/Openudid/GuidEquipment fingerprint information, SIM card IMSI information, etc., information, information including the basic situation of individuals commonly used by individuals);", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48743, "text": "Personal location information (including itinerary information, accurate positioning information, latitude and longitude, etc.);", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48744, "text": "Personal equipment permissions information (including albums, cameras, microphones, address books, calendars and other information).", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48745, "text": "Personal sensitive personal information refers to once leaked, or illegally provided or abused that may be harmful, it is easy to cause the personality and dignity of natural people to be infringed or personal and property security, which can easily lead to personal reputation, physical and mental health damage or discrimination treatment, etc.Personal information.", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48746, "text": "Personal sensitive personal information involved in this privacy policy includes: your property information (including bank accounts, financial payment accounts, transactions and consumption records, as well as virtual property information such as coupons, red envelopes, game redemption codes);", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48747, "text": "Facial recognition features;", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48748, "text": "Personal information (including ID card, passport and other ID information);", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48749, "text": "Network identification information (including account name, account nickname);", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48750, "text": "Other information (including mobile phone numbers, web browsing records, receiving address information, travel trajectory, accurate positioning information, address book, friends list, group list).", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48751, "text": "The personal sensitive information involved in this privacy policy will be thicker and adding lines to remind you to pay attention to reading.", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48752, "text": "Before you provide any personal information with sensitive information to the turn, please clearly consider that this provision is appropriate and agree that your personal sensitive information can be processed in accordance with the purpose and method described in this privacy policy.", "label": ["Important", "First Party Collection Information"], "rewrite": "Before you provide any personal information with sensitive information to the rotary, please confirm that you agree to deal with the purpose and method described in this privacy policy."}
{"task": "rw_34.jsonl", "id": 48753, "text": "We will collect and use your sensitive personal information after getting your consent to achieve functions related to the transfer business, and allow you to choose from the collection and use of these sensitive information.It affects your related functions.", "label": ["Important", "First Party Collection Information", "Edit/Control"], "rewrite": "We will collect and use your sensitive personal information after getting your consent to achieve functions related to the transfer business, allowing you to refuse to collect and use it."}
{"task": "rw_34.jsonl", "id": 48754, "text": "In principle, the transfer platform will only collect and use your personal information for the following goals described by this privacy policy.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The transfer platform will only collect and use your personal information for the following goals described by this privacy policy."}
{"task": "rw_34.jsonl", "id": 48755, "text": "However, in view of the fact that the transfer platform is a comprehensive second -hand and idle item trading platform, there are many scenarios involved. If we exceed the following goals, we will prompt you to inform and obtain your consent separately when you collect and use your personal information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If we exceed the collection and use of your personal information described in this policy, we will prompt you separately to inform and obtain your consent."}
{"task": "rw_34.jsonl", "id": 48756, "text": "(1) Help you become our registration/login user", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48757, "text": "1. When you use the services provided by the transfer, in order to guarantee, APP, normal data statistics, and security risk control, after you agree with this privacy policy, we will integrate, SDK, and initialization work will collect you, OpenUDID, Androidid, IDFA, Mac, address, IMEI, IMSI, application list (application name, application package name, installation time).", "label": ["Important", "First Party Collection Information"], "rewrite": "When we initialize the integrated SDK, we will collect your OpenUDID, Androidid, IDFA, MAC address, IMEI, IMSI, application list information."}
{"task": "rw_34.jsonl", "id": 48758, "text": "At the same time, we will apply for the \"notification\" authority to send you business reminders, order information, chat messages, activities and promotional reminders, and the latest information and related recommendations that users often pay attention to. If you refuse to open \"The notification \"permissions will not be able to receive the aforementioned reminder, information, notification or recommendation, but it will not affect your normal use of the basic functions and services of the transfer platform.", "label": ["Permission Acquisition", "Important"], "rewrite": "Apply for you \"notification\" permissions to send business reminders, order information, chat messages, activities and promotional reminders, and the latest information and related recommendations that users often pay attention to."}
{"task": "rw_34.jsonl", "id": 48759, "text": "2. According to Article 27 of the E -Commerce Law of the People's Republic of China, \"E -commerce platform operator shall require the application of the authenticity of their identity, address, contact information, administrative license, etc. who apply for or provide services to the platform to sell products or provide services.Information, check, register, establish registration files, and check updates on a regular basis. \"", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48760, "text": "Therefore, when you choose to become our registered \\ login user and authorize to log in to the registered account through WeChat, you need to provide us with your account information (including avatars, nicknames, regions, gender), and users who are prepared on the WeChat platformThe name and your own mobile phone number, we will verify whether your identity is valid by sending a SMS verification code.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you become a collection of registered \\ login users and authorize login to register and transfer accounts through WeChat, collect your account information on the WeChat platform, the username of preparing to use, and your mobile phone number."}
{"task": "rw_34.jsonl", "id": 48761, "text": "After you log in, you can continue to improve your account letter and interest. You can modify your avatar, nickname, gender, birth date, personal profile, phone number, region, delivery address, contact card.", "label": ["Important", "First Party Collection Information", "Edit/Control"], "rewrite": "You can modify your avatar, nickname, gender, date of birth, personal profile, telephone number, region, delivery address, contact card."}
{"task": "rw_34.jsonl", "id": 48762, "text": "At the same time, when you register and log in to the transfer platform, the platform needs to collect your personal equipment information including: IMEI, SIM, Card, IMSI, information, Androidid, IDFA, OAID.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you register and log in to the transfer platform, collect your personal device information include IMEI, SIM card IMSI information, Androidid, IDFA, OAID."}
{"task": "rw_34.jsonl", "id": 48763, "text": "3. According to relevant laws and regulations such as the \"Internet Security Law of the People's Republic of China\", if you make information release, instant messaging, recycling items or network payment, game transactions, you need to complete the real -name authentication to ensure your personal identity information.sex.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you make information release, instant communication, recycling items or network payment, game transactions, you need to complete real -name authentication to ensure the authenticity of personal identity information."}
{"task": "rw_34.jsonl", "id": 48764, "text": "Real -name authentication requires you to provide your name, ID number to the transfer and transfer real -name authentication service provider (Tencent Cloud Computing (Beijing) Co., Ltd.), to achieve and guarantee the real -name information through the data verification with the Public Security Network to ensure the real -name informationReality.", "label": ["Important", "First Party Collection Information"], "rewrite": "Real -name authentication requires you to provide your name, ID number to the transition and transfer real -name authentication service provider."}
{"task": "rw_34.jsonl", "id": 48765, "text": "In order to ensure the safety of platform transactions and protect you legal and effective protection, in accordance with relevant laws and regulations such as the Protection Law of the People's Republic of ChinaPersonal information theft, cooperate with cracking down criminal crimes, and platform risk control purposes. In triggering related risk scenarios, you need to collect your mobile phone number or/and facial biological identification information to the transfer and transfer certification service provider (Tencent Cloud Computing (Beijing Calculation (Beijing) Co., Ltd.), Tencent Cloud uses the world's leading recognition technology to achieve effective verification of your identity.", "label": ["Important", "First Party Collection Information"], "rewrite": "In the scene of triggering platform security risks, you need to collect your mobile phone number or/and facial biological identification information to the transfer and transfer certification service provider to verify."}
{"task": "rw_34.jsonl", "id": 48766, "text": "If you refuse to provide the above information, you will not be able to effectively publish information release, instant messaging, recycling items or network payment, game transactions on the transfer platform, but it will not affect your information browsing and search services.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48767, "text": "4. The account information you supplement will help us provide you with personalized service recommendations and better service experiences, including: improving the security of the account, so that you can enjoy better guarantee services;", "label": ["Important", "Usage"], "rewrite": "The account information you supplement will be used to provide personalized service recommendations and better service experience."}
{"task": "rw_34.jsonl", "id": 48768, "text": "Increase the credit of the account to verify the true identity;", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48769, "text": "Open VIP members and enjoy exclusive services.", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48770, "text": "But if you do not provide these supplementary information, it will not affect your basic functions of turning.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48771, "text": "The above information you provide will continue to authorize us to use it during your use of the transfer service.", "label": ["Important", "Usage"], "rewrite": "The information you provide will continue to authorize us to use it during your use of the transfer service."}
{"task": "rw_34.jsonl", "id": 48772, "text": "When you cancel your account, we will stop using and delete the above information.", "label": ["Important", "Edit/Control"], "rewrite": "When you cancel your account, we will stop using and delete information."}
{"task": "rw_34.jsonl", "id": 48773, "text": "5. The above information will be stored in the People's Republic of China.", "label": ["Data Retention", "Important"], "rewrite": "The information will be stored in the People's Republic of China."}
{"task": "rw_34.jsonl", "id": 48774, "text": "If you need to transmit cross -border transmission, we will obtain your authorization consent alone.", "label": ["Data Retention", "Important"], "rewrite": "If we need cross -border transmission, we will obtain your authorization consent alone."}
{"task": "rw_34.jsonl", "id": 48775, "text": "(2) Provide you with our products or services", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48776, "text": "1. Information release and trading function", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48777, "text": "The main function of the transfer platform is information release, product search and trading functions.", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48778, "text": "(1) When you use the release function, we will collect your personal information, including account information, second -hand and idle items or basic information of buying goods (will also collect your mobile phone number and provide the service provider 58 when buying a car 58The same city [main name: Beijing Wuba Information Technology Co., Ltd.], geographical location, user album, address information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the release function, we will collect your account information, second -hand and idle items or basic information, geographical location, user album, address information."}
{"task": "rw_34.jsonl", "id": 48779, "text": "The information that this kind of information is filled in for yourself is collected to facilitate that you can successfully publish the information and match the content you posted faster.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the information you are filled in for convenience. You can successfully publish information."}
{"task": "rw_34.jsonl", "id": 48780, "text": "(2) When you use product information display and search function, in order to show you the product or service information that meets your needs or let you quickly find the goods you need, we may collect your access or use us.Browsing, search records and equipment of products and/or services, information (including equipment names, equipment models, equipment unique identification codes (IMEI/Android/OAID/IDFA/Openudid/GUID), operating system and application version, language settings, language settings, language settings, Resolution, service provider network, ID (PLMN), WLAN, access point, network access method, Bluetooth and base station information, gyroscope, gravity sensor information, application list (application name, application package name, installation time, installation time) And the process information, the overall operation of the application, the use of usage and frequency, the application collapse, the overall installation of usage, performance data, application source), service log information (including browsing records, click to view records, search for query records, search query records, Collect, add to shopping carts, transactions, after -sales, follow sharing information, publish information, and, IP, address, browser type, telecommunications operator, use language, access date and time), browser types to provide you with products for youThe optimal way of information display.", "label": ["Important", "Usage"], "rewrite": "When you use product information display and search functions, collect your viewing or using products and/or service browsing, search records and equipment information, operating system information, service log information, etc., thinking that you provide the best way to display product information display.Essence"}
{"task": "rw_34.jsonl", "id": 48781, "text": "We will also use your above personal information to continuously improve and optimize the above functions.", "label": ["Usage"], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48782, "text": "You can also accurately find the goods or services you need by searching.", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48783, "text": "We will retain your search content to facilitate you to enter or show you the products related to your search content.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Will retain your search content to facilitate you to enter or show you the products associated with you."}
{"task": "rw_34.jsonl", "id": 48784, "text": "Please note that your search keyword information cannot identify your identity alone. It does not belong to your personal information. We have the right to use it for any purpose;", "label": ["Important"], "rewrite": "Your search keyword information cannot identify your identity alone, not your personal information, and we have the right to use it for any purpose."}
{"task": "rw_34.jsonl", "id": 48785, "text": "Only when your search keyword information is combined with your other information and can identify your identity, during the combination of use, we will use your search keyword information as your personal information, and your search history with your search historyThe records are handled and protected in accordance with this privacy policy.", "label": ["Important"], "rewrite": "When your search keyword information is used in combination with other information and can recognize your identity, during the combination of use, we will use your search keyword information as personal information processing and protection."}
{"task": "rw_34.jsonl", "id": 48786, "text": "(3) When you use the transaction function (including placing orders, payment, delivery products or services, customer service and after -sales), we will collect your personal information accordingly:", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the trading function, we will collect your personal information accordingly."}
{"task": "rw_34.jsonl", "id": 48787, "text": "① Place order function:", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48788, "text": "A. When you place an order to buy goods or services, you need to fill in your consignee's name, receiving address and mobile phone number at least in the order. At the same time, the order number will indicate in the orderInformation, the amount and payment method you pay for, we will synchronize the aforementioned information to the product seller to realize your effective purchase;", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "When you place an order to buy goods or services, you need to provide the consignee's name, the receiving address, and the mobile phone number. We will synchronize the information provided in the order to the product seller."}
{"task": "rw_34.jsonl", "id": 48789, "text": "You can also fill in the consignee's fixed telephone and address information to increase more contact information to ensure that the product can be delivered accurately, but it does not affect the production of your order without filling in this information.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can also provide the fixed phone and address information of the consignee to increase more contact information to ensure that the product can be extended accurately."}
{"task": "rw_34.jsonl", "id": 48790, "text": "B. When you choose the valuation function of the sale, you need to provide us with information about your valuation property (including property, versions and models, brands, years, appearance and function status, pictures, books, books, and books), we will knowCollect the aforementioned information you provided for system computing intelligent valuation. For the convenience of information, you can authorize us to collect your equipment information (including the device name and equipment model). If you refuse to authorize, it will only cause you to enjoy automatic reading device informationQuick valuation services, but it does not affect your normal use of ordinary valuation services.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "When you choose the valuation function of the transfer, you need to provide information about the valuation property and provide the equipment information that can authorize us to collect your equipment."}
{"task": "rw_34.jsonl", "id": 48791, "text": "If you choose to sell for valuation property or use the recycling function we provided directly, we will provide you with sale or recycling services within the range of mobile phones, tablets, laptops, headphones, smart digitals, and books.Telephone, delivery address information;", "label": ["Important", "First Party Collection Information"], "rewrite": "If you sell the valuation property or use the recycling function directly, within the range of mobile phones, tablets, laptops, headphones, smart digitals, and books, you need to collect your name, contact phone number, and receipt address information."}
{"task": "rw_34.jsonl", "id": 48792, "text": "Within 3C and accessories, old clothes, watches, luxury goods, automobiles, home appliances, and card vouchers, we will collect your name, contact telephone number, delivery address or property.The property information filled out on the valuation page of the species, card density, face value) and provided the aforementioned information to the corresponding product recycling service provider (including Renren car, daily car shooting, hi recycling, idle and prefecture, Putlian, Dang DangdangOne, flying ants, fat tigers, trend pawnshops) in order to provide you with recycling services.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "If you sell the valuation property or use the recycling function directly, within the range of 3C and accessories, old clothing, watches, luxury goods, automobiles, home appliances, card vouchers, you need to collect your name, contact phone number, receipt address or property where the property is locatedThe area is provided to the recycling service provider."}
{"task": "rw_34.jsonl", "id": 48793, "text": "All the above information constitutes your \"order information\". We will use your order information to perform your identity verification, determine transactions, payment settlement, complete distribution, query orders for you, and provide customer service consultation and after -sales service;", "label": ["Important", "Usage"], "rewrite": "We will use your order information to perform your identity verification, determine transactions, payment settlement, complete distribution, query orders for you, and provide customer service consultation and after -sales service."}
{"task": "rw_34.jsonl", "id": 48794, "text": "We will also use your order information to determine whether your transaction is abnormal to protect your transaction security.", "label": ["Important", "Usage"], "rewrite": "We will use your order information to determine whether your transaction is abnormal."}
{"task": "rw_34.jsonl", "id": 48795, "text": "② Payment function:", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48796, "text": "A. Payment function: After you place an order, you can choose the payment service provided by the third -party payment institutions (including WeChat Pay, Alipay, Huayao installment, JD Pay, and the following \"payment institution\") provided by the third -party payment institution.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After you place an order, you can choose the payment services provided by a third -party payment institution with the turnover."}
{"task": "rw_34.jsonl", "id": 48797, "text": "The payment function itself does not collect your personal information, but we need to share your transfer order number and transaction amount information with these payment institutions to achieve your payment instructions and complete the payment.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We need to share your transfer order number with the transaction amount information with the payment institution to achieve payment."}
{"task": "rw_34.jsonl", "id": 48798, "text": "If you choose to use other methods (ie, staging X, installment music) for payment, you should read the user service protocol displayed by the corresponding page (including but not limited to the \"User Data Information Authorization Book\", \"User Registration Agreement\", \"Individuals\"Including network/gps, positioning and, wifi, positioning information), network status.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "If you choose to pay in other ways, you should provide and authorize the service party to use your personal information according to the step prompts."}
{"task": "rw_34.jsonl", "id": 48799, "text": "The name of the account bank/payment institution) to support your collection needs. At the same time, we may need to collect your identity information (name, ID number) for tax payment", "label": ["Important", "First Party Collection Information"], "rewrite": "If you sell items, use the sale service, use the refund function, and other needs to pay you, we need to collect your collection account information to support your collection needs. At the same time, we may need to collect your identityInformation is used to pay taxes."}
{"task": "rw_34.jsonl", "id": 48800, "text": "③ Delivery products or service functions: After you place an order and choose to complete the payment or sale/recycling order to place an order online, the third -party distribution company (including the seller of the user product seller and the item recyclers with us or the platform of the platform (includingSF's", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After you place an order and choose to complete the payment or sale/recycling order online, the cooperative third -party distribution company will complete the delivery of the order for you."}
{"task": "rw_34.jsonl", "id": 48801, "text": "You know and agree that the distribution company will use your order information within the above link to ensure that the goods you buy can be delivered safely.", "label": ["Important"], "rewrite": "You know and agree that the distribution company will use your order information to ensure that the products you buy can be delivered safely."}
{"task": "rw_34.jsonl", "id": 48802, "text": "While providing distribution services for you, the delivery staff requires the need for real -name authentication based on certain business laws and will help you complete the real -name authentication.", "label": ["Important"], "rewrite": "While providing distribution services for you, the delivery staff requires the need for real -name authentication based on certain business laws and will help you complete the real -name authentication."}
{"task": "rw_34.jsonl", "id": 48803, "text": "We did not collect your ID information in this link.", "label": ["Important", "First Party Collection Information"], "rewrite": "We did not collect your ID information in the delivery link."}
{"task": "rw_34.jsonl", "id": 48804, "text": "Delivery products or service functions: After you place an order and choose to complete the payment online, a third -party distribution company (including SF, Yuantong Express, Express, 100, Bai Shi Express, Tiantian Express, House Express Delivery, Homing Express Delivery, House Express, Zhongtong Express, Shentong Express, Yunda Express, JD Logistics, Debon Logistics, etc., hereinafter referred to as \"distribution company\") will complete the delivery of orders for you, and the specific logistics service provider shall prevail in real time.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "After you place an order and choose to complete the payment online, the cooperative third -party distribution company will complete the order of the order for you."}
{"task": "rw_34.jsonl", "id": 48805, "text": "Sending address/receiving address) Shared to the aforementioned logistics service provider;", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "You know and agree to share the receiving/sending information you filled in to the logistics service provider to ensure the safety and timely delivery of the goods you traded."}
{"task": "rw_34.jsonl", "id": 48806, "text": "In some scenarios, you need to share your aforementioned receipts/send information information to the third -party storage service provider, and the storage service provider will pack and ship the goods for you.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Share your aforementioned receipts/send information to the third -party storage service provider, thinking that you pack and ship the goods."}
{"task": "rw_34.jsonl", "id": 48807, "text": "While providing distribution services for you, the delivery staff requires the need for real -name authentication based on certain business laws and will help you complete the real -name authentication.", "label": ["Important"], "rewrite": "While providing distribution services for you, the delivery staff requires the need for real -name authentication based on certain business laws and will help you complete the real -name authentication."}
{"task": "rw_34.jsonl", "id": 48808, "text": "We did not collect your ID information in this link.", "label": ["Important"], "rewrite": "We did not collect your ID information in the delivery session."}
{"task": "rw_34.jsonl", "id": 48809, "text": "④ customer service and after -sales function: Our telephone customer service and after -sales function will use your account information and order information.", "label": ["Important", "Usage"], "rewrite": "Telephone customer service and after -sales function will use your account information and order information."}
{"task": "rw_34.jsonl", "id": 48810, "text": "To ensure your account security, our online customer service and call center customer service will use your account information to verify your identity and record your call records with customer service to provide you with appropriate help and processing.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Customer service will use your account information to verify your identity and record your call records with customer service."}
{"task": "rw_34.jsonl", "id": 48811, "text": "When you need us to provide customer service and after -sales service related to your order information, we will check your order information. You may provide other information other than the above information when communicating with our customer service staff.", "label": ["Important", "Usage"], "rewrite": "When you need customer service and after -sales service related to order information, we will check your order information and you may provide other information."}
{"task": "rw_34.jsonl", "id": 48812, "text": "2. Search/subscription function", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48813, "text": "When using the search function provided by the transfer, we will collect the keyword information you query and other information and content details you browsed or required when you use the transfer service.", "label": ["Important", "First Party Collection Information"], "rewrite": "When using the search function provided by the transfer, we will collect the keyword information of your inquiries and other information and content details you browse or required."}
{"task": "rw_34.jsonl", "id": 48814, "text": "In order to bring you more convenient search services and continuously improve the rotary products and/or services.", "label": ["Usage"], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48815, "text": "These keyword information usually cannot identify your personal identity alone, not your personal information, and not within the scope of the restrictions of the privacy policy.", "label": ["Important"], "rewrite": "Keyword information usually cannot recognize your personal identity alone, and it does not belong to your personal information."}
{"task": "rw_34.jsonl", "id": 48816, "text": "Only when your search keyword information is connected with other information and can recognize your personal identity, during the combination of use, we will use your search keyword information as your personal information, and your search history with your search historyThe records are handled and protected in accordance with this policy.", "label": ["Important", "Data Security"], "rewrite": "When your search keyword information is connected with other information and can recognize your personal identity, search keyword information as personal information processing and protection."}
{"task": "rw_34.jsonl", "id": 48817, "text": "3. Customer service", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48818, "text": "When you publish information, appeal or consult, in order to contact you or help you solve the problem, we need you to provide your name, mobile phone number, order number, and email information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you publish information, appeal or consult, you need to provide your name, mobile phone number, order number, and email information."}
{"task": "rw_34.jsonl", "id": 48819, "text": "If you refuse to provide the above information, some functions may not be used, and at the same time, you cannot feedback to appeal or consult the results in time.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48820, "text": "In order to confirm the status of the transaction and provide you with after -sales and dispute solutions, we will collect, pay, logistics information related to the transaction objects, payment institutions, and logistics companies based on the exchanges.The transaction information shared with the above -mentioned service providers.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "In order to confirm the transaction status and provide after -sales and dispute solutions, collect your transactions, payment, logistics information related to the transaction progress, or share your transaction information with the above -mentioned service providers."}
{"task": "rw_34.jsonl", "id": 48821, "text": "4. Direct push/personalized recommendation", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48822, "text": "When you browse and searches, we will analyze your preferences, habits, and location based on the information collected in turn, in order to provide you with more suitable customized services, such as showing or recommending you to youSubscribe information, information flow or advertising/promotion information results with a higher degree of correlation (not generally pushed).", "label": ["Important", "Usage"], "rewrite": "When you browse and search for around, we will analyze your preferences, habits, and location based on the collected information and user portraits in order to provide customized services."}
{"task": "rw_34.jsonl", "id": 48823, "text": "To this end, the information we need to collect includes your device model, operating system type, and the unique I recognition code (IMei/Android/OAID/IDFA/Openudid/Guid), log information, browsing records.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your equipment model, operating system type, the unique identification code, log information, and browsing records for user portraits."}
{"task": "rw_34.jsonl", "id": 48824, "text": "At the same time, this directional push will provide you with more suitable customized services, and it may also cause you to be unable to know all browsing and searching information in a timely manner, so if you don’t want to get our directional push or personalized recommendation services, you are turning, and you are turning.APP, end, you can set up the directional push service through \"My\"-\"Settings\"-\"Push Settings\" —— \"Orientation Push Free Interference\" and through \"My\"-\"Settings\"—— \"Privacy Settings\" - \"Personalized Recommended Recommendation\" Close Personalized Recommendation Service \".", "label": ["Important", "Edit/Control"], "rewrite": "You can set off the directional push service through \"My\"-\"Settings\"-Push Settings \"-\" Treatment Push-free Disable \"and through\" My \"-\" Settings \"-\" Privacy Settings \"—— \"Personalized Recommendation Recommendation\" Close Personalized Recommendation Service \"."}
{"task": "rw_34.jsonl", "id": 48825, "text": "Please understand that separate devices and log information are information that cannot recognize specific natural person status.", "label": ["Important"], "rewrite": "Solid equipment information and log information are information that cannot identify specific natural persons."}
{"task": "rw_34.jsonl", "id": 48826, "text": "If we use this type of non -personal information with other information to identify a specific natural person or use it with personal information, during the combination of use, such non -personal information will be regarded as personal information, except for obtaining your authorization.Or in addition to other provisions of laws and regulations, we will anonymous and de -identify this type of personal information. Please understand and agree. In this case, we have the right to use the information that has been identified;", "label": ["Important", "Data Security"], "rewrite": "We will anonymous and logo processing of equipment information and log information. Please understand and agree. In this case, we have the right to use information that has been identified."}
{"task": "rw_34.jsonl", "id": 48827, "text": "Under the premise that your personal information is not disclosed, we have the right to analyze the user database and use it commercialized.", "label": ["Important", "Usage"], "rewrite": "Under the premise that your personal information is not disclosed, we have the right to analyze and use the user database to use it."}
{"task": "rw_34.jsonl", "id": 48828, "text": "5. Marketing activities", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48829, "text": "We will host online or offline marketing activities from time to time, including inviting users to reward red envelopes, give away physical items and similar activities.", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48830, "text": "In such marketing activities, we may need users to provide personal information (name, mobile phone number, postcode, address information so that we can distribute rewards or send gifts to users.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In marketing activities, we may need users to provide personal information."}
{"task": "rw_34.jsonl", "id": 48831, "text": "In the case of turning to your payment, we need to collect your collection account information (account number, account opening/payment institution name, household name). At the same time, we may need to collect your identity information (name, ID card, ID card, ID card, ID cardNo.) Used to pay taxes.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In the case of turning to your payment, you need to collect your receiving account information and collect your identity information to pay taxes."}
{"task": "rw_34.jsonl", "id": 48832, "text": "6. Provide you with more personalized services", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48833, "text": "(1) Personalized recommendation function based on location information: We will access your location information after you open your position permissions (we only obtain the geographical location you were at that time, but will not combine your location information of each period forTo judge your whereabouts), you provide you with page display, functions, products, services that meet your needs in accordance with the location permissions and location information of your opening, including recommending nearby preferential information to you, recommended nearby idle, idle, and idleness, and to be idle nearby, and to be idle for you, idleness, and idleness, and to be idle nearby, and to be idle nearby, you are idle nearby, and you are idle nearby.Realize the current position automatic positioning or sharing or sharing, screening or service in the address/chat.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "According to your opening authority and location information, you provide you with page display, functions, products, and services that meet your needs."}
{"task": "rw_34.jsonl", "id": 48834, "text": "(2) Service function based on camera (camera): You can use the function to complete the photo or video shooting and uploading, promoting information by this function after opening the camera/camera permissionsComplete the information of the information, and the face recognition function authorized by you in a specific scenario.", "label": ["Permission Acquisition", "Important"], "rewrite": "You can use the function to complete the photo or video shooting and uploading, promoting information, launching voice calls, scanning code, or completing information after opening the camera/camera permissions to complete the face recognition function of the person authorized by your authorized person."}
{"task": "rw_34.jsonl", "id": 48835, "text": "When you use this additional function for face recognition, we will collect your facial features and strictly use it within the scope of your authorization. In the future, as we plan to use your facial information to provide you with other products and/or services, we will use your facial information to provide you with other products and/or services.We will confirm with you again.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We will collect your facial features and use it within the scope of your authorization."}
{"task": "rw_34.jsonl", "id": 48836, "text": "(3) Picture/video access and uploaded additional functions based on album (picture library/video library): you can use this function to upload your photo/picture/picture/picture/picture/picture/picture/picture/picture/picture/picture/system album permanentVideo to realize the editing of the promotion information you want to publish, taking pictures, shopping, personal information avatar, and introduction of video upload or other users of the customer service and transfer platforms., Need to be retrieved, SD, card in the card).", "label": ["Permission Acquisition", "Important"], "rewrite": "You can upload your photos/pictures/videos to the iOS system album permissions or Android systems to realize the functions of promoting information editing, photo shopping and other functions."}
{"task": "rw_34.jsonl", "id": 48837, "text": "(4) Voice technology -related additional functions based on microphone: You can realize real -time or non -real -time voice interaction with other users or customer service after turning on the right of microphone and release idle/chat/shooting video.Function (in, iOS, system scenario, you need to open the videos of multimedia resource libraries).", "label": ["Permission Acquisition", "Important"], "rewrite": "You can interact with other users or customer service after opening the microphone rights and release idle/chat/video shooting functions."}
{"task": "rw_34.jsonl", "id": 48838, "text": "In these features, we will collect your recording content to identify your shopping needs, or respond to your customer service and dispute processing needs.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your recording content to identify your shopping needs, or respond to your customer service and dispute processing needs."}
{"task": "rw_34.jsonl", "id": 48839, "text": "Please know that even if you have agreed to turn on the microphone rights, we will only obtain voice information through the microphone when you actively click on the microphone icon or recorded video in your client.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "Even if you have agreed to turn on the microphone rights, we will only get voice information when you actively click on the microphone icon or recording video in your client."}
{"task": "rw_34.jsonl", "id": 48840, "text": "(5) Additional functions based on the address book: When you are using banks or/and third -party financial institutions that use transitions to cooperate (including installments, Du Xiaoman, Sina Finance, 360, Financial, Provincial, Sesame staging, staging, stagesWhen the specific service provider takes the real -time display of the transfer platform, the loan, consumer installment financial services, or mobile leasing services provided by a beautiful machine are provided, the requirements of a third -party institution should beProvide your contact information (name and contact number) for credit review, anti -fraud testing and risk control decision -making, you can choose to fill in or open the communication record authority to automatically fill in.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "When you use the transfer of loans, consumer installment financial services, or mobile phone rental services provided by/and third -party financial institutions provided by third -party financial institutions, you need to provide yourContact information for credit review, anti -fraud testing and risk control decision -making."}
{"task": "rw_34.jsonl", "id": 48841, "text": "(6) Additional functions based on calendar: After you open the permissions that we can read/write to your calendar, you can use this function to record important information about the transfer of related products and services (including snapping, appointment, similar and time limitRelated information, functions, or services), as a reminder for your participation in or receiving relevant rights and interests, as well as other important matters.", "label": ["Permission Acquisition", "Important"], "rewrite": "After you open the permissions that we can read/write to your calendar, you can record important information about the transfer of related products and services."}
{"task": "rw_34.jsonl", "id": 48842, "text": "(7) Additional functions based on floating windows: After you open the floating window permissions, you can use this permissions to achieve the small windowization function of the live broadcast screen.", "label": ["Permission Acquisition", "Important"], "rewrite": "After you turn on the floating window authority, you can implement the small windowization function of the live broadcast screen."}
{"task": "rw_34.jsonl", "id": 48843, "text": "(8) Additional functions based on telephone or mobile phone information: After you turn on the phone permissions or mobile phone information permissions, you can use this permissions to implement the one -click login function of the mobile phone number. We will collect your mobile phone number and device, IMEI, IMEI, and weSIM, card, IMSI, information to achieve the aforementioned function.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "After you turn on the phone permissions or mobile phone information permissions, we will collect the IMEI and SIM card IMSI information of your mobile phone number and device to achieve one -click login function."}
{"task": "rw_34.jsonl", "id": 48844, "text": "(9) Additional functions based on advertising tracking: After you open, iOS, system advertising permissions, we will be able to collect your, IDFA to achieve the effect of targeted push advertisement according to this permissions.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "After you open the advertising tracking right of the iOS system, we will be able to collect your IDFA based on this permissions to achieve the effect of targeted push ads."}
{"task": "rw_34.jsonl", "id": 48845, "text": "(10) Additional functions based on the clipboard: You can copy the link function when sharing the product or activity after opening the patch permission, copy the order number/receiving address/courier single number function, and the network abnormal diagnosis during the transaction processThe results and copying passwords participated in the shake event.", "label": ["Permission Acquisition", "Important"], "rewrite": "You can copy the link function when the product or activity sharing is enabled after opening the patch authority, copy the order number/receiving address/courier single number function during the transaction, copy the diagnosis results when diagnosis of network abnormal diagnosis, and copy passwords to participate in shaking activities."}
{"task": "rw_34.jsonl", "id": 48846, "text": "In the aforementioned function, we need to collect and recognize your password content.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48847, "text": "The above additional features may require you to open your geographical location (location information), camera (camera), album (picture library), storage, microphone, address book, calendar, suspension windows, telephone or mobile phone information in your device in your deviceAdvertising tracking to achieve the collection and use of information involved in these functions.", "label": ["Permission Acquisition", "Important"], "rewrite": "The additional function may require you to open your geographical location, camera, album, storage, microphone, address book, calendar, suspended windows, phone or mobile phone information, advertising tracking."}
{"task": "rw_34.jsonl", "id": 48848, "text": "We will prompt you in advance when you download the APP for the first time or use the above features one by one in the form of a pop -up window. You can choose according to your needs.", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "We will prompt you to obtain permissions in advance when you download the APP for the first time or use the additional features. You can choose according to your needs."}
{"task": "rw_34.jsonl", "id": 48849, "text": "Please note that when you turn on these permissions, it means that you authorize us to collect and use these personal information to achieve the above functions. If you turn off the authority, it means that you cancel these authorization, and we will no longer continue to collect and use your individuals.Information cannot provide you with the above functions corresponding to these authorization.", "label": ["Important", "Edit/Control"], "rewrite": "The opening of one authority means that the authorization is authorized to collect and use the relevant information to provide corresponding services. Close the authority to cancel the authorization representative, and no longer continue to collect and use relevant information based on the corresponding permissions."}
{"task": "rw_34.jsonl", "id": 48850, "text": "The decision to close permissions will not affect the collection and use of information based on your authorization.", "label": ["Important", "Edit/Control"], "rewrite": "Close authority will not affect the collection and use of information based on authorization."}
{"task": "rw_34.jsonl", "id": 48851, "text": "If the information you provide contains personal information of other users, you need to ensure that you have obtained legal authorization before providing these personal information to the transfer platform.", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48852, "text": "If the personal information involved in children (referring to minors under the age of 14), you need to obtain the consent of the child guardian before the release, the guardian has the right to contact us through the channels stipulated by this policy, request or delete more corrective or deleteContent involving children's personal information.", "label": ["Specific Audiences", "Important"], "rewrite": "If you publish the information involved in children, you need to obtain the consent of the child guardian before the release."}
{"task": "rw_34.jsonl", "id": 48853, "text": "7. Other services", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48854, "text": "(1) In addition to the above -mentioned products and services you provide, we may also collect your other information in order to provide the reasonable needs of the service and improve the qualityInformation, the questionnaire answering information sent us during the questionnaire survey.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may collect your other information in order to provide the reasonable needs of services and improve service quality."}
{"task": "rw_34.jsonl", "id": 48855, "text": "At the same time, in order to improve the security of products and/services using the transfer platform, it is more accurate to prevent fishing websites fraud, Trojan virus and malware, and protect account security. We may understand some of your browsing information and orders.Information, your application list (application name, application package name, installation time, through, SDK, form), operating system type, device model, equipment, MAC, address, device unique identification codeGUID) to judge the risk of your account, and may record some links that we think are risky (\"url\");", "label": ["Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "We may judge the risk of your account by understanding some of your browsing information, order information, your application list, operating system type, device model, equipment MAC address, and the unique identification code of the device."}
{"task": "rw_34.jsonl", "id": 48856, "text": "We will also collect your device information (including: IDFA, Openudid, Android, ID) to analyze, statistical traffic and check the risks that may exist, and check it when you choose to send us abnormal information.", "label": ["Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "We will collect your device information to analyze, statistical traffic and investigate the possible risks of the rotation system."}
{"task": "rw_34.jsonl", "id": 48857, "text": "In order to provide you with better, better, more personalized, and more secure services, protect the safety of personal property of you or other users or the public, and better prevent fishing websites, fraud, network vulnerabilities, computer viruses, Internet attacks, network invasion and similar security risks, and more accurately identify the situation of violating laws and regulations or related agreement rules, we may use or integrate your user information, trading information, equipment information (including IDFA, Openudid, Androidid,,,,, Androidid,,,,, Androidid,,,,, Androidid,,,,, AndroidID,,,,,, Androidid,,,,, Androidid,,System version number, equipment name, current network type), related network logs and related parties, partners and other independent third -party sources based on legal provisions or obtain your authorization consent to share your individualInformation to comprehensively judge your account and transaction risk, conduct authentication, test and prevent security incidents, and take necessary records, audit, analysis, and disposal measures in accordance with the law.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Data Security"], "rewrite": "We may use or integrate your personal information, transaction information, device information, your personal information shared by the network and third parties to determine your account number and transaction risks, authentication, testing and preventing security incidents."}
{"task": "rw_34.jsonl", "id": 48858, "text": "(2) Under the premise of not disclosing a single user privacy data, the transfer has the right to analyze the entire user database and use the user database to use it.", "label": ["Important", "Usage"], "rewrite": "Under the premise that a single user privacy data is not disclosed, the transfer has the right to analyze the entire user database and use the user database to use it."}
{"task": "rw_34.jsonl", "id": 48859, "text": "Transfer may count the usage of network services.", "label": ["Important", "Usage"], "rewrite": "Transfer may count the usage of network services."}
{"task": "rw_34.jsonl", "id": 48860, "text": "At the same time, turning may share these statistical information with the public to show the overall trend of our service.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Rotation may share statistical information with the public to show the overall trend of service."}
{"task": "rw_34.jsonl", "id": 48861, "text": "These statistical information does not include any identification information of your identity.", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48862, "text": "(3) When you use the transfer of mobile phone rental services (that is, the \"Fun Rent\") provided by Shenzhen Municipal Machine Technology Co., Ltd. through the turnover and turn, you need to provide it with your own request.Name, personal mobile phone number, address, ID card, facial features, bank card number, address book (contact name and telephone), common equipment information (IMEI, SIM, card, IMSI information, advertising logo, IDFA, IDFV, Androidid,,, Androidid,OAID, device brand models, equipment operating systems), location information (including network/GPS, positioning and, wifi, positioning information) for service qualification review, credit evaluation, anti -fraud testing and risk control decision -making.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the interesting machine, you need to provide your personal name, personal mobile phone number, address, ID card, facial features, bank card number, address book, common equipment information, location information, service qualification review, credit assessment, anti -anti -anti -evaluation, anti -anti -anti -evaluation, anti -anti -anti -evaluation, anti -anti -anti -evaluation, anti -anti -anti -evaluation, anti -anti -anti -evaluation, anti -anti -anti -evaluation, anti -anti -anti -evaluation, anti -anti -anti -evaluation, anti -anti -anti -evaluation, anti -countermeasureFraud detection and risk control decision -making."}
{"task": "rw_34.jsonl", "id": 48863, "text": "You should carefully read the \"Electronic Equipment Leasing Service Agreement\" on the corresponding page to learn more about the information related to mobile phone rental services and your rights and obligations.", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48864, "text": "(4) When you communicate with customer service or other users, work orders, submit avatars, and publish topics, you can use short video functions.", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48865, "text": "When using a short video service, we will dynamically apply for the album, camera, microphone, multimedia resource library (only, iOS, system) permissions required for the video function, collect your video information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When using a short video service, we will apply for your video information after you apply for albums, cameras, microphones, and multimedia resource libraries (only iOS systems) permissions."}
{"task": "rw_34.jsonl", "id": 48866, "text": "The purpose is to accurately express your information through short videos, pictures, or voice forms. Refusing to provide this permission will only cause you to be unable to fully use the aforementioned personalized services we provide, but it does not affect other services provided by your normal use.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48867, "text": "(3) Exceptions of obtaining authorization consent", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48868, "text": "You fully know that, in accordance with relevant laws, in addition to the situation where you agree to collect your personal information, based on the following circumstances, we can also collect your personal information without your consent:", "label": ["Important", "First Party Collection Information"], "rewrite": "According to relevant laws, in addition to the situation where you agree to collect your personal information, based on the following situations, we can also collect your personal information without your consent:"}
{"task": "rw_34.jsonl", "id": 48869, "text": "(1) It is necessary for the contract to establish and fulfill your contract as one party;", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to set up and fulfill your collection and use information for the contract as a party, no need to solicit authorization."}
{"task": "rw_34.jsonl", "id": 48870, "text": "(2) To fulfill the statutory duties or the requirements of the statutory volunteer;", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to fulfill the statutory duties or the collection and usage information necessary for the statutory volunteer, there is no need to solicit authorization consent."}
{"task": "rw_34.jsonl", "id": 48871, "text": "(3) In order to deal with emergencies, or in emergency situations to protect the health and property security of you or other natural persons;", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to cope with emergencies, or in urgent cases to protect the life and health of natural persons and the necessary collection and use information, no need to solicit authorization."}
{"task": "rw_34.jsonl", "id": 48872, "text": "(4) Implement news reports and public opinion supervision for public interests, and collect personal information within a reasonable scope;", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to implement news reports and public opinion supervision, deal with personal information within a reasonable scope without soliciting authorization consent."}
{"task": "rw_34.jsonl", "id": 48873, "text": "(5) Collect your own personal information in accordance with the provisions of this law or other legal disclosure;", "label": ["Important", "First Party Collection Information"], "rewrite": "In accordance with laws and regulations, personal information is processed by individuals or other legal disclosure within a reasonable range, and no authorization consent is required."}
{"task": "rw_34.jsonl", "id": 48874, "text": "(6) Other circumstances stipulated in laws and administrative regulations.", "label": ["Important", "First Party Collection Information"], "rewrite": "Other collection and use information stipulated in laws and regulations does not need to solicit authorization."}
{"task": "rw_34.jsonl", "id": 48875, "text": "(4) Use of personal information use rules", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48876, "text": "We will use your personal information to achieve product or service functions according to the agreement of this policy.", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48877, "text": "When we want to use other purposes that the information is not stated in this policy, we will solicit your consent again in an appropriate manner in accordance with the requirements of laws and regulations and national standards.", "label": ["Important", "Data Security"], "rewrite": "If we use other purposes that the information is not stated in this policy, we will solicit your consent again."}
{"task": "rw_34.jsonl", "id": 48878, "text": "The sensitive personal information we collected has been displayed in this policy through significant identification.", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48879, "text": "Once your sensitive personal information is leaked, tampered with or illegally used, it will cause damage to your personal or property security.", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48880, "text": "To prevent your sensitive personal information from being leaked or illegally used, we have taken appropriate technical and organizational protection measures to strive to ensure your information security.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48881, "text": "With the upgrading and iteration of our products and services, we may adjust the business functions described in this policy and the types of personal information we have collected and used.", "label": ["Important"], "rewrite": "We may adjust the business functions described in this policy and the types of personal information that are collected and used."}
{"task": "rw_34.jsonl", "id": 48882, "text": "When the new features or services are related to the functions or services we are currently provided, the personal information collected and used will be directly or reasonable to the original processing purpose.", "label": ["Important", "First Party Collection Information"], "rewrite": "When the new features or services are related to the current function or service, the personal information collected and used will be directly or reasonable to the original processing purpose."}
{"task": "rw_34.jsonl", "id": 48883, "text": "When we want to use your personal information to be directly or reasonable to be related to the original processing purpose, or other purposes that are not stated in this policy, or for other purposes based on specific purposes, we willBy updating privacy documents such as this policy, related product pages, and informing you through various methods such as pop -up windows, in -site letters, push information, etc., and asking your consent in advance.", "label": ["Important", "Data Security"], "rewrite": "When we use your personal information beyond the agreed purpose, we will inform you and ask you in advance."}
{"task": "rw_34.jsonl", "id": 48884, "text": "If the information you provide contains personal information of other users, you need to ensure that you have obtained legal authorization before providing these personal information to the transfer platform.", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48885, "text": "If the personal information involved in children (referring to minors under the age of 14), you need to obtain the consent of the child guardian before the release, the guardian has the right to contact us through the channels stipulated by this policy, request or delete more corrective or deleteContent involving children's personal information.", "label": ["Specific Audiences", "Important"], "rewrite": "If the information you provide involves children's personal information, you need to obtain the consent of the child guardian before release."}
{"task": "rw_34.jsonl", "id": 48886, "text": "Please note that all the personal information you provided when using our products and/or services, unless you delete or reject us to collect through the system settings, we will continue to authorize us to use us during your product and/or service period.Essence", "label": ["Important", "Edit/Control"], "rewrite": "All personal information you provided when using products and/or services, unless you delete or reject it or you will continue to authorize us during your use."}
{"task": "rw_34.jsonl", "id": 48887, "text": "When you cancel your account, we will stop using and delete your personal information.", "label": ["Important", "Edit/Control"], "rewrite": "When you cancel your account, we will stop using and delete your personal information."}
{"task": "rw_34.jsonl", "id": 48888, "text": "If we stop operating the transfer product or service, we will stop collecting your personal information activities in time. The notice of stopping operation will be notified in the form of one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -serving person information, delete or anonymous personal information held.deal with.", "label": ["Important", "Cessation of Operations"], "rewrite": "When stopping operation, we will make an announcement notice and delete or processes your personal information."}
{"task": "rw_34.jsonl", "id": 48889, "text": "4. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48890, "text": "(1) Use of cookies", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48891, "text": "In order to make you get a easier access experience, when you access the transfer platform related websites or use the services provided by the transfer platform, we may identify your identity through small data files.Steps, or help judge your account security.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may recognize your identity through small data files, help you simplify your use, and judge your account risk."}
{"task": "rw_34.jsonl", "id": 48892, "text": "These data files may be Cookie, Flash Cookie, or other local storage provided by your browser or associated application (collectively referred to as \"Cookie\").", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48893, "text": "Please understand that some of our services can only be implemented by using \"cookie\".", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48894, "text": "If your browser or browser additional service allows, you can modify the degree of acceptance of Cookie on the related page or refusal to turn around, but this move may affect your safe access to transfer in some cases.Related websites and services provided by the transfer platform.", "label": ["Important", "Edit/Control"], "rewrite": "You can modify the degree of acceptance of Cookie on related pages or cookies that refuse to turn around."}
{"task": "rw_34.jsonl", "id": 48895, "text": "(2) Use of similar technologies for cookies", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48896, "text": "It will collect information about your browsing web activities through the Internet, Beacon, such as the page address you visited, the address of the quoted page you previously visited, the time you stay on the page, your browsing environment, and display settings.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect your information about your browsing web activities through the Internet Beacon."}
{"task": "rw_34.jsonl", "id": 48897, "text": "Transfer may use the behavioral data you browse on the transfer website. According to your interests and preferences, you may show content related to your interest when you browse other websites. This process includes the following aspects:", "label": ["Important", "Usage"], "rewrite": "Transfer may use the behavioral data you browse on the transfer website, and you browse other websites to show content related to your interest."}
{"task": "rw_34.jsonl", "id": 48898, "text": "1) Collection of interest data: We use the content you are viewing, use, cookie collects and save your behavior data.", "label": ["Important", "First Party Collection Information"], "rewrite": "We collect and save your behavior data by using Cookie."}
{"task": "rw_34.jsonl", "id": 48899, "text": "2) Get your interest classification according to your browsing behavior data.", "label": ["Important", "Usage"], "rewrite": "Based on your viewing data, get your interest classification."}
{"task": "rw_34.jsonl", "id": 48900, "text": "For example, if you look for the Beijing moving company information in the past two days, we will understand that your interest is Beijing's moving company.", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48901, "text": "We will not use the information collected above for any purpose outside of the purpose of this privacy policy.", "label": ["Important", "Usage"], "rewrite": "We will not use the collected information for any purpose outside the purpose of the privacy policy."}
{"task": "rw_34.jsonl", "id": 48902, "text": "Please understand that some of our services can only be implemented by using \"cookie\".", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48903, "text": "If your browser or browser additional service allows, you can modify the degree of acceptance of the right, cookie, and acceptance, but this move may affect your safe access to the transfer network related websites and use transfer transfers.Services provided by the network platform.", "label": ["Edit/Control", "Important"], "rewrite": "You can modify the degree of acceptance of Cookie on the browser -related page."}
{"task": "rw_34.jsonl", "id": 48904, "text": "Fifth, how do we entrust your personal information, provide, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48905, "text": "(1) Entrusted processing", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48906, "text": "In order to improve the efficiency of information processing, reduce information processing costs or improve the accuracy of information processing, or [purpose of entrustment processing], we may entrust our ability to afford our affiliated companies or other [Trusty types, such as: SMS sending service providerItems", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to improve the efficiency of information processing, reduce information processing costs, or improve information processing accuracy, we may entrust our ability to handle information on our representatives of our affiliates or other providers."}
{"task": "rw_34.jsonl", "id": 48907, "text": "Software, system technical service providers;", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48908, "text": "Marketing and research, data analysis service providers;", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48909, "text": "Map service provider;", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48910, "text": "Invoice service provider;", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48911, "text": "Website/system server hosting service provider.", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48912, "text": "] On behalf of us, we will handle user information, but we will require the trustee to comply with strict confidentiality obligations and take effective confidentiality measures through written agreements, on -site audits, etc., and prohibit it from using this information to be used without user authorization.", "label": ["Important", "Data Security"], "rewrite": "We will require the entrusted company to abide by the confidentiality obligations and take confidentiality measures to prohibit it from using this information to the purpose of not being authorized by user."}
{"task": "rw_34.jsonl", "id": 48913, "text": "After the entrusted relationship is lifted, the trustee will no longer save your personal information.", "label": ["Important", "Data Security"], "rewrite": "After the entrusted relationship is lifted, the trustee will no longer save your personal information."}
{"task": "rw_34.jsonl", "id": 48914, "text": "(2) Provide outside", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48915, "text": "Under normal circumstances, we will not share your personal information with any company, organization and individual other than Xiangzhi, except the following situations: except:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Under normal circumstances, we will not share your personal information with any company, organization and individual other than Xiangzhi, except the following situations: except:"}
{"task": "rw_34.jsonl", "id": 48916, "text": "1. Shared in a separate consent: After obtaining a separate consent of your or your guardian, or if you take the initiative to ask us to share your personal information with a third party, we will share your personal information with other parties.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After obtaining a separate consent of you or your guardian, or if you actively ask us to share your personal information with a third party, we will share your personal information with other parties."}
{"task": "rw_34.jsonl", "id": 48917, "text": "2. With other legal reasons stipulated in the law, we share your personal information with third parties;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "With other legal things stipulated in the law, we share your personal information with third parties."}
{"task": "rw_34.jsonl", "id": 48918, "text": "3. Provide by the requirements of the applicable laws and regulations, legal procedures, mandatory administrative or judicial requirements;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share your personal information according to the requirements of applicable laws and regulations, legal procedures, mandatory administrative or judicial requirements."}
{"task": "rw_34.jsonl", "id": 48919, "text": "4. Compliance with the relevant protocols signed (including the electronic agreement signed online and the corresponding platform rules) or other legal documents provided.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "It meets the relevant agreements or other legal documents you signed to share your information."}
{"task": "rw_34.jsonl", "id": 48920, "text": "5. Shared with authorized partners: Only in order to achieve the purpose of the privacy policy, some of our services will be provided by authorized partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Some of our services will be provided by authorized partners."}
{"task": "rw_34.jsonl", "id": 48921, "text": "We may share some of your personal information with our partners to provide better customer service and user experience.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share some of your personal information with your partners."}
{"task": "rw_34.jsonl", "id": 48922, "text": "We will only share your personal information for legal, correct, necessary, specific, and clear purposes, and only share the personal information necessary for providing services.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will only share your personal information for legal, correct, necessary, specific, and clear purposes, and only share the personal information necessary for providing services."}
{"task": "rw_34.jsonl", "id": 48923, "text": "Our partners have no right to use the personal information they shared for any other purpose.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Our partners have no right to use the personal information they shared for any other purpose."}
{"task": "rw_34.jsonl", "id": 48924, "text": "At present, our authorized partners include the following three types:", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48925, "text": "(1) Supplier of commodity or technical services.", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48926, "text": "We may share your personal information with a third party that supports our functions.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share your personal information with a third party that supports our functions."}
{"task": "rw_34.jsonl", "id": 48927, "text": "These supports include our supply or providing infrastructure technical services (such as electronic equipment manufacturers), logistics distribution services, payment services (such as WeChat payment, Alipay, Huayan installment, JD Pay, installment music), data processing (such as 58 58, Tencent), risk control (such as Tencent), warehousing services.", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48928, "text": "The purpose of our sharing of this information is to achieve the core shopping function of our products and/or services. For example, we must share your device fingerprint information with mobile phone manufacturers so that they can provide you with mobile phone system information sending and display notification information services (such as private messaging informationNotice, transaction information notification, notification of operational activities, and other similar notice);", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "The purpose of our sharing information is to achieve the core shopping function of our products and/or services."}
{"task": "rw_34.jsonl", "id": 48929, "text": "For example, we must share your order information with logistics service providers to arrange delivery;", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We must share your order information with logistics service providers to arrange delivery."}
{"task": "rw_34.jsonl", "id": 48930, "text": "Or we need to share your order number and order amount with a third -party payment institution to achieve your confirmation of your payment instructions and complete the payment.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We need to share your order number and order amount with third -party payment institutions to achieve your confirmation of your payment instructions and complete payment."}
{"task": "rw_34.jsonl", "id": 48931, "text": "(2) Third -party merchants.", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48932, "text": "We must share your order information with the necessary information related to transactions with third -party merchants to realize your needs for purchasing goods or services from it, and to promote it to complete subsequent after -sales service.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We must share your order information with the necessary information related to transactions with third -party merchants to achieve your purchase needs and promote it to complete after -sales service."}
{"task": "rw_34.jsonl", "id": 48933, "text": "(3) Entrust our partners for promotion.", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48934, "text": "Sometimes we provide services to other companies to provide promotional promotion services to user groups using our products and/or services.", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48935, "text": "We may use your personal information and the indirect user portrait formed by your non -personal information collection with the partner (\"commissioner\") that commissioned us to promote us, but we will only provide these clients with the coverage and effectiveness of promotional coverage and effectiveness to these clients.Sex information, not providing your personal identity information, or we summarize this information so that it does not recognize your individual.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may use the indirect user portrait formed by your information collection to share with our partners who commission us to promote, but will not provide your personal identity information."}
{"task": "rw_34.jsonl", "id": 48936, "text": "For example, we can inform how many people of the client read their promotional information or buy the commodity of the client after seeing the information, or provide them with statistical information that cannot recognize personal identity to help them understand their audience or customers.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We can inform the commissioner's promotion information or the transformation after viewing, or provide them with statistical information that cannot recognize personal identity."}
{"task": "rw_34.jsonl", "id": 48937, "text": "6. If you are a qualified intellectual property rightist and have filed a complaint, the respondent should be disclosed to the respondent, so that both parties can handle possible rights and disputes;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you are a qualified intellectual property rights right and have filed a complaint, the respondent should disclose your information to the respondent in order to handle disputes."}
{"task": "rw_34.jsonl", "id": 48938, "text": "7. Only by sharing your information can you provide the service you need or handle your disputes or disputes with others.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Share your information for your needs or process your disputes or disputes with others."}
{"task": "rw_34.jsonl", "id": 48939, "text": "For example, in a transaction created on the turn, if any party performs or partially fulfilled the transaction obligations and submits information disclosure requests, the transfer will provide the user with the connection method of the other party to the user's contact method.To promote the completion of the transaction or the resolution of disputes;", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "The transfer provides users with the necessary information such as the connection method of the other party to the user to promote the completion of the transaction or the resolution of the dispute."}
{"task": "rw_34.jsonl", "id": 48940, "text": "8. You agree to submit personal information to third parties by clicking on the corresponding button of related products (including but not limited to \"help me apply\", \"help me submit\", \"apply immediately\" and other keys.", "label": ["Third Party Sharing/ Disclosure", "Edit/Control", "Important"], "rewrite": "You agree to submit personal information to third parties by clicking on the corresponding button of related products."}
{"task": "rw_34.jsonl", "id": 48941, "text": "9. We have joint marketing activities with third parties. We may have the personal information that are necessary to complete the activities during the sharing of activities, such as the number of users who participate in the event, the number of winners, the list of winners, the contact information of the winner, and the transfer account.Third -party can issue prizes to you in time;", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "We may have the personal information of the necessary personal information in the process of sharing joint marketing activities with third parties to complete the activity."}
{"task": "rw_34.jsonl", "id": 48942, "text": "10. In accordance with the law and reasonable business habits, when we plan to merge with other companies or are acquired or carried out or carried out other capital market activities (including but not limited to IPOs, bond issuance)During the due diligence, we will provide your information to the necessary subjects, but we will request them to take reasonable confidentiality measures on your personal information through signing confidentiality agreement with these subjects;", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "When we need to accept due diligence from other subjects, we will provide your information to the necessary subjects, but we will require them to take reasonable confidentiality measures by signing a confidential agreement."}
{"task": "rw_34.jsonl", "id": 48943, "text": "11. If you violate relevant Chinese laws, regulations or related agreements (including the electronic agreement signed online) and related rules you signed with us, you need to disclose to a third party;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you have violated relevant Chinese laws, regulations or related agreements and relevant rules you signed with us, you need to disclose your information to a third party."}
{"task": "rw_34.jsonl", "id": 48944, "text": "Regarding the situation of our personal information, please check the \"Sharing Personal Information List with a Third Party\":", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For the situation of our personal information, please check the \"Sharing Personal Information List with a Third Party\"."}
{"task": "rw_34.jsonl", "id": 48945, "text": "(3) Transfer", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48946, "text": "We will not transfer your personal information to any company, organization and individual, except for the following situations: 1. After obtaining clear consent, transfer: After obtaining your clear consent, we will transfer you to other partiesinformation;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not transfer your personal information to any company, organization and individual, except the following situations: After obtaining your clear consent, we will transfer your personal information to other parties."}
{"task": "rw_34.jsonl", "id": 48947, "text": "2. When involving similar transactions such as mergers, acquisitions or bankruptcy liquidation, if you involve personal information transfer, we will require new companies that hold your personal information and organizations to continue to be subject to this privacy policy. Otherwise, we will ask forThe company and organization re -solicit authorization consent, unless there are other legal reasons.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When involving mergers, acquisitions, or bankruptcy liquidation, if personal information transfer is involved, it will be required to continue to be bound by the policy, otherwise it will request that it will re -solicit authorization consent."}
{"task": "rw_34.jsonl", "id": 48948, "text": "3. Provide by the requirements of the applicable laws and regulations, legal procedures, mandatory administrative or judicial requirements;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Transfer your personal information according to the requirements of applicable laws and regulations, legal procedures, mandatory administrative or judicial requirements."}
{"task": "rw_34.jsonl", "id": 48949, "text": "4. Compliance with the relevant protocols signed (including the electronic agreement signed online and the corresponding platform rules) or other legal documents provided.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Against the relevant agreements or other legal documents you signed with you to transfer your personal information."}
{"task": "rw_34.jsonl", "id": 48950, "text": "(4) Public disclosure", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48951, "text": "We will only publicly disclose your personal information in the following circumstances:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only publicly disclose your personal information in the following circumstances:"}
{"task": "rw_34.jsonl", "id": 48952, "text": "1. After getting your clear consent alone;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After getting your clear consent, disclose your personal information."}
{"task": "rw_34.jsonl", "id": 48953, "text": "2. Based on legal disclosure: With the compulsory requirements of legal, legal procedures, litigation or government authorities, we may disclose your personal information to the above regulatory authorities.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the case of compulsory requirements of legal, legal procedures, litigation or government authorities, we may disclose your personal information to the above regulatory authorities."}
{"task": "rw_34.jsonl", "id": 48954, "text": "We know the corresponding legal liabilities assumed to provide, transfer, and publicly disclose the provision of, transfer, and publicly disclose.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48955, "text": "We promise to share, transfer, and publicly disclose your personal information in accordance with the requirements of these clauses. In accordance with the requirements of laws and regulations and national standards, confirm the agreement, copywriting in specific scenarios, pop -up windows, prompts and other formsConfirm that third parties have obtained your consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We promise to share, transfer, and publicly disclose your personal information in accordance with the requirements of these terms, and obtain your consent or confirm that the third party has obtained your consent."}
{"task": "rw_34.jsonl", "id": 48956, "text": "Therefore, please consider the information content that uploads, publish and communicate through our services.", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48957, "text": "In some cases, you can control the privacy settings of some of our services to control the scope of user scope of your shared information.", "label": ["Important", "Edit/Control"], "rewrite": "You can control the privacy settings of certain services to control the scope of users with information sharing."}
{"task": "rw_34.jsonl", "id": 48958, "text": "If you are required to delete your relevant information from our services, please operate the contact information provided by the beginning of this privacy policy.", "label": ["Important", "Edit/Control"], "rewrite": "If you want to delete your relevant information from our service, operate through contact information."}
{"task": "rw_34.jsonl", "id": 48959, "text": "According to relevant laws and regulations and national standards, in the following circumstances, we provide, transfer, and publicly disclose your personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "According to relevant laws and regulations and national standards, in the following circumstances, we provide, transfer, and publicly disclose your personal information."}
{"task": "rw_34.jsonl", "id": 48960, "text": "(1) It is necessary for the contract to establish and fulfill your contract as a party;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to establish and fulfill your contract, transfer, transfer or disclosure of your contract as a party, you do not need to solicit."}
{"task": "rw_34.jsonl", "id": 48961, "text": "(2) In order to fulfill the statutory duties or the requirements of the statutory volunteer;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to fulfill the shared, transferred or disclosed by the statutory duties or the necessary sharing, transfer, or disclosure necessary for the statutory duty, no authorization is required."}
{"task": "rw_34.jsonl", "id": 48962, "text": "(3) In order to cope with emergencies, or in urgent situations, it is necessary to protect the health and property safety of natural people;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to cope with emergencies, or in urgent situations to protect the health of natural people and the must -sharing, transfer or disclosure of property security, no authorization is required."}
{"task": "rw_34.jsonl", "id": 48963, "text": "(4) For public interests implement news reports and public opinion supervision, collect personal information within a reasonable scope;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Implement news reports and supervision of public opinion for public interests, collect personal information within a reasonable scope without authorized consent."}
{"task": "rw_34.jsonl", "id": 48964, "text": "(5), you are collected within a reasonable scope in accordance with the law or other personal information that you have already disclosed or have legal disclosure;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You are collected by your own or other legitimate personal information in accordance with the law, without authorization consent."}
{"task": "rw_34.jsonl", "id": 48965, "text": "(6), other circumstances stipulated in laws and administrative regulations.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The sharing or disclosure of other laws and regulations and other regulations does not need to be authorized."}
{"task": "rw_34.jsonl", "id": 48966, "text": "(6) Use of third -party SDK", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48967, "text": "In order to ensure the stable operation and functional implementation of our client, so that you can enjoy more services and functions. Our application will embed the SDK or other similar applications of authorized partners, such as when you use your mobile phone device, mobile phone manufacturers, mobile phone manufacturers, mobile phone manufacturersThe provided Push, SDK needs to read your device recognition number and network -related information for push/down notification column messages.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Our applications are embedded in SDK or other similar applications of authorized partners to ensure the stable operation and functional implementation of our client."}
{"task": "rw_34.jsonl", "id": 48968, "text": "We will strictly test the application interface (API) and software tool development package (SDK) of the authorized partners to obtain relevant information, and strict data protection measures with the authorized partners, so that it will be in accordance with this policy and any other any otherRelated confidentiality and security measures to handle personal information.", "label": ["Important", "Data Security"], "rewrite": "We will strictly test the application interface and software tool development package of authorized partners to obtain information about information, and strict data protection measures with their agreed strict data."}
{"task": "rw_34.jsonl", "id": 48969, "text": "We will explain to you the latest situation of third -party SDKs involved in collecting user information. For more details, please check in the embedded SDK list in \"Sharing Personal Information List with Third Party\".", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will explain to you the latest situation involving the third -party SDK that collects user information."}
{"task": "rw_34.jsonl", "id": 48970, "text": "6. How do we store and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48971, "text": "(1) Information storage", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48972, "text": "The information and information collected by the transfer will be stored on the server of the transfer and / or its affiliated company, all of which are stored in China.", "label": ["Data Retention", "Important"], "rewrite": "Your information and information will be stored on the server of the rotation and (or) its related companies, and all are stored in China."}
{"task": "rw_34.jsonl", "id": 48973, "text": "At present, the transfer products and services will not involve the cross -border transmission of data. If our product \\ services are changed and the cross -border transmission of data involves data, we will tell you alone in the way of pop -up or email.The purpose, receiver, etc., and obtain your authorization consent, we will ensure that the data receiver has sufficient data protection capabilities to protect your personal information.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "At present, the products and services of the transfer will not involve the cross -border transmission of data. If it involves in the future, we will tell you the purpose of the data outbound, receiving party, etc., and obtain your authorization consent, which will ensure that the receiving party’s partner’s’s’s’s’s.Data protection ability."}
{"task": "rw_34.jsonl", "id": 48974, "text": "We only retain your personal information within the minimum time limit required by your service period and laws and regulations, such as the technical measures and related network log storage period for monitoring and recording network operations, technical measures for network security incidents, and related network log storage periods, 6 6, 6 6, 6 6, 6In a month, the storage period for goods and service information and transaction information is not less than three years from the date of completion of the transaction.", "label": ["Data Retention", "Important"], "rewrite": "Keep your personal information only during your service period and the shortest time limit required by law and regulations."}
{"task": "rw_34.jsonl", "id": 48975, "text": "For personal information beyond the deadline, we will immediately delete or do anonymous processing.", "label": ["Data Retention", "Important"], "rewrite": "For personal information beyond the deadline, we will immediately delete or do anonymous processing."}
{"task": "rw_34.jsonl", "id": 48976, "text": "(2) Information protection", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48977, "text": "In order to ensure your information security, we strive to take various reasonable physical, electronics and management security measures to protect your information, so that your information will not be leaked, damaged or lostCryptive storage and data centers access control.", "label": ["Important", "Data Security"], "rewrite": "Take various reasonable physical, electronic and management security measures to protect your information will not be leaked, damaged or lost."}
{"task": "rw_34.jsonl", "id": 48978, "text": "1. Data encryption: We encrypted and stored the user's WeChat name, user name, mobile phone number, etc. to ensure that the user's basic information will not be maliciously obtained;", "label": ["Important", "Data Security"], "rewrite": "We encrypted the user's WeChat name, username, mobile phone number, etc."}
{"task": "rw_34.jsonl", "id": 48979, "text": "2. Identity identity: We authorize the verification code or ID number and facial feature recognition verification through WeChat authorized verification or account number to conduct user identity legality identification to prevent non -authorized intervention;", "label": ["Important", "Data Security"], "rewrite": "We are authorized by WeChat to verify or account for mobile phone verification codes or ID numbers and facial feature recognition verifications to identify user identity legitimacy to prevent non -authorized intervention."}
{"task": "rw_34.jsonl", "id": 48980, "text": "3. Access control: We have also adopted strict management of employees or outsourcing staff who might contact you, including but not limited to adopting different authority control according to different positions, signing confidentiality agreements with them, monitoring their operations, etc.measure.", "label": ["Important", "Data Security"], "rewrite": "Employees or outsourcing staff who may be exposed to you have also adopted strict management."}
{"task": "rw_34.jsonl", "id": 48981, "text": "Only after the identity is identified, the transfer user can inquire and manage the user's information and resources. Without identity identification, you cannot manage user resources;", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48982, "text": "4. Security audit: We sometimes access the risk control platform or certification platform to monitor some scenes or behaviors.", "label": ["Important", "Data Security"], "rewrite": "We sometimes access the risk control platform or certification platform to monitor some scenarios or behaviors."}
{"task": "rw_34.jsonl", "id": 48983, "text": "If the traffic analysis, complete the monitoring of the account abnormal login, registration and other abnormal behaviors.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48984, "text": "The transfer provides corresponding security measures according to existing technologies to protect your information, provides reasonable security guarantees, and will try its best to make your information not be leaked, damaged or lost;", "label": ["Important", "Data Security"], "rewrite": "Transfer provides corresponding security measures according to existing technologies to protect your information."}
{"task": "rw_34.jsonl", "id": 48985, "text": "5. Account protection: Your account has a security protection function. Please keep your WeChat account, mobile phone number and verification code.", "label": ["Important", "Data Security"], "rewrite": "Please keep your WeChat account, mobile phone number and verification code."}
{"task": "rw_34.jsonl", "id": 48986, "text": "The rotation will ensure that your information is not lost by backup and other security measures to other servers, and it will not be abused and altered.", "label": ["Important", "Data Security"], "rewrite": "The rotation will ensure that your information is not lost by backup and other security measures to other servers, and it will not be abused and altered."}
{"task": "rw_34.jsonl", "id": 48987, "text": "Despite the aforementioned security measures, at the same time, please understand that due to the technical restrictions and various malicious means of malicious means, even if you do your best to strengthen security measures, there is no \"perfect security measure\" on the information network.", "label": ["Important", "Data Security"], "rewrite": "Although there are security measures, it is impossible to fully guarantee that there is no security problem."}
{"task": "rw_34.jsonl", "id": 48988, "text": "We strongly recommend that you do not use the non -rotary recommended communication method to send personal information.", "label": ["Important", "Data Security"], "rewrite": "It is recommended that you do not use the non -rotary recommended communication method to send personal information."}
{"task": "rw_34.jsonl", "id": 48989, "text": "Any legal consequences caused by the leakage of account information due to your own reasons need to be responsible for you", "label": ["Important", "Data Security"], "rewrite": "Any legal consequences caused by the leakage of account information due to your own reasons must be responsible for you."}
{"task": "rw_34.jsonl", "id": 48990, "text": "When using the transfer platform service online transactions, if you inevitably disclose your personal information (such as contact, contact method, contact address) to the other party or potential transaction of the transaction, please properly protect your personal information, Provide to others alone in the necessary situation.", "label": ["Important", "Data Security"], "rewrite": "Protecting your personal information properly, it is provided to others only under the necessary situation."}
{"task": "rw_34.jsonl", "id": 48991, "text": "If you find that your personal information has been leaked or there is a possibility of being leaked, and it may endanger your registered transfer account security, or cause you other losses, please be sure to follow the privacy of the first time according to this privacy.The contact information mentioned in the policy is contacted with us so that we can take corresponding measures to maintain your transfer account security to prevent the occurrence of losses or further expand.", "label": ["Important", "Data Security"], "rewrite": "If the personal information discovered, please contact our customer service immediately."}
{"task": "rw_34.jsonl", "id": 48992, "text": "To avoid doubt, if you do not notify the transfer customer service as soon as possible, you should bear the losses (and the loss of expansion) caused by it yourself.", "label": ["Important", "Data Security"], "rewrite": "If you do not notify the transfer of customer service information leaks at the first time, you should bear the loss caused by itself."}
{"task": "rw_34.jsonl", "id": 48993, "text": "6. The Internet environment is not 100 % security. We will try our best to ensure or guarantee the security of any information you send to us.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48994, "text": "After unfortunately a personal information security incident, we will inform you in a timely manner in accordance with the requirements of the laws and regulations: the basic situation and possible impact of the security incident, the disposal measures we have taken or will take, you can independently prevent and reduce the risk of riskSuggestions, remedy measures, etc.", "label": ["Important", "Data Security"], "rewrite": "If a personal information security incident occurs, we will inform your basic situation, possible impact, disposal measures, independent prevention suggestions, etc."}
{"task": "rw_34.jsonl", "id": 48995, "text": "We will promptly inform you that the incident -related situation is informing the email, letter, telephone, push notification, etc. When it is difficult to inform the subject of personal information one by one, we will publish an announcement in a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "The relevant situation of security incidents will be informed by mail, letter, telephone, push notification, etc. When it is difficult to inform one by one, it will issue an announcement."}
{"task": "rw_34.jsonl", "id": 48996, "text": "7. The right to manage personal information", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 48997, "text": "Tarming attaches great importance to your attention to personal information, and do your best to protect your personal information access to your personal information to enjoy your right to know and decide.", "label": ["Important", "Data Security"], "rewrite": "Try to protect your personal information access to your personal information to enjoy your right to know and decide."}
{"task": "rw_34.jsonl", "id": 48998, "text": "During your use of our products and/or service, you can contact us through the corresponding page prompts or the privacy policy, to query, copy, transfer, refuse or restrict the processing, correct, delete and withdraw consent to supplement, delete, deleteYour personal information, as well as the right to exercise the scope of changing authorization and the right to cancel the account, we will deal with your request in time.", "label": ["Important", "Edit/Control"], "rewrite": "You can query, copy, transfer, refuse or restrict the processing, correct, delete, and withdraw the consent to supplement and delete your personal information, and exercise the scope of the authorization consent and the right to cancel the account."}
{"task": "rw_34.jsonl", "id": 48999, "text": "We will do our best to protect your right to your personal information so that you have full ability to ensure your privacy and security.", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 49000, "text": "Your rights include:", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 49001, "text": "(1) Inquiry and correction of personal information", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 49002, "text": "You have the right to visit your personal information, except for the exception stipulated in laws and regulations.", "label": ["Important", "Edit/Control"], "rewrite": "You have the right to visit your personal information, except for the exception stipulated in laws and regulations."}
{"task": "rw_34.jsonl", "id": 49003, "text": "If you want to exercise the right of personal information inquiries of data access, you can access the inquiry by yourself through the following ways: APP side: you can use \"My\" by the bottom page -click the settings in the upper right corner- \"Personal Information\" to access the inquiry, change your change of youPersonal information, account information, etc.", "label": ["Important", "Edit/Control"], "rewrite": "You can use \"My\" -click the settings in the upper right corner- \"Personal Information\" to access the inquiry and change your personal data information, account information, etc."}
{"task": "rw_34.jsonl", "id": 49004, "text": "details as follows:", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 49005, "text": "Regional, receiving address, contact card, etc.", "label": ["Important", "Edit/Control"], "rewrite": "Manage your account information: The specific path of the app side is: \"My\" -click the settings in the upper right corner- \"Personal Information\" to manage your avatars, nicknames, gender, birthday, personal profile, phone number, region, receiving, receiving, receivingCargo address, contact card, etc."}
{"task": "rw_34.jsonl", "id": 49006, "text": "(2) Your actual authentication information: APP, the specific path of the end is: \"My\" -click the settings in the upper right corner- \"Account and Security\" - \"Real Personal Certification\".", "label": ["Important", "Edit/Control"], "rewrite": "Manage your real -person authentication information: The specific path of the APP side is: \"My\" -click the settings in the upper right corner- \"account and security\" - \"real person certification\"."}
{"task": "rw_34.jsonl", "id": 49007, "text": "You can perform realistic authentication.", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 49008, "text": "If you need to change the solid authentication information, please contact the customer service to assist in the re -certification.", "label": ["Important", "Edit/Control"], "rewrite": "If you need to change the solid authentication information, please contact the customer service to assist in the re -certification."}
{"task": "rw_34.jsonl", "id": 49009, "text": "(3) Your order information: APP, the specific path of the end is: Homepage- \"My\"-\"Sell Management/Buy Management\".", "label": ["Important", "Edit/Control"], "rewrite": "Manage your order information: The specific path of the app side is: Homepage- \"My\"-\"Sell Management/Buy Management\"."}
{"task": "rw_34.jsonl", "id": 49010, "text": "You can choose to delete the completed order to delete your order information, but this may cause us to be unable to accurately judge your purchase information and it is difficult to provide corresponding after -sales service.", "label": ["Important", "Edit/Control"], "rewrite": "You can choose to delete the completed order to delete your order information, but it will make it difficult to provide corresponding after -sales service."}
{"task": "rw_34.jsonl", "id": 49011, "text": "(4) Your browsing and attention information: You can access or clear your search history, view and modify your interest, and manage other data.", "label": ["Important", "Edit/Control"], "rewrite": "Manage your browsing and follow information: The app path is: Homepage- \"Mine\"-\"Footprint/Follow\"."}
{"task": "rw_34.jsonl", "id": 49012, "text": "The app path is: Homepage- \"My\"-\"Footprint/Follow\".", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_34.jsonl", "id": 49013, "text": "(5) Your billing information: APP, the specific path of the end is: Homepage- \"My\"-\"Bill\", you can view information such as payment, refund, receipt, freezing, recharge, withdrawal, etc.", "label": ["Important", "Edit/Control"], "rewrite": "Manage your billing information: The specific path of the app side is: Homepage- \"My\"-\"Bill\", you can view information such as payment, refund, receipt, freezing, recharge, withdrawal, etc."}
{"task": "rw_34.jsonl", "id": 49014, "text": "You can also click \"Settings\" in the upper right corner to bind and manage bank card information or set a payment password.", "label": ["Important", "Edit/Control"], "rewrite": "You can click \"Settings\" in the upper right corner to bind and manage bank card information or set a payment password."}
{"task": "rw_34.jsonl", "id": 49015, "text": "You can delete and modify your above information through this path.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_34.jsonl", "id": 49016, "text": "(6) Your privacy settings: You can view or modify your privacy settings, including whether to allow transaction evaluation questions, poke one reminder settings, voice call authority settings, system permissions (such as geographical location, camera, album, microphone, etc.)set up.", "label": ["Important", "Edit/Control"], "rewrite": "Manage your privacy settings: APP path is: \"My\" -click the settings in the upper right corner- \"Privacy Settings\"."}
{"task": "rw_34.jsonl", "id": 49017, "text": "The app path is: \"My\" -click the settings in the upper right corner- \"Privacy Settings\".", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_34.jsonl", "id": 49018, "text": "(7) For other personal information generated during the process of using our products and/or service: such as application list (application name, application package name, installation time), device informationAdvertising identification IDFA, Androidid, OAID, equipment brand model, equipment operating system), etc., you need to query or correct, please contact us in accordance with this privacy policy \"responding to your above request\" clause.", "label": ["Edit/Control", "Important"], "rewrite": "For other personal information generated by your products and/or services, you need to query or correct, please contact us."}
{"task": "rw_34.jsonl", "id": 49019, "text": "We will respond to your request according to the way and periods listed in this privacy policy.", "label": ["Edit/Control", "Important"], "rewrite": "We will respond to your request according to the way and periods listed in this privacy policy."}
{"task": "rw_34.jsonl", "id": 49020, "text": "You cannot access the query and correction personal information: Except for the information stated above, some of your personal information we cannot provide you with the service of accessing online inquiries and correction.Your device information collected by security, personal information generated when you use additional functions.", "label": ["Edit/Control", "Important"], "rewrite": "We cannot provide you with a service to access online inquiries and corrections for some of your personal information."}
{"task": "rw_34.jsonl", "id": 49021, "text": "We will use the above information within your authorization scope. You cannot access the query and correction, but you can contact us to delete or do anonymous treatment. We will respond to your request under the premise of technical feasibility based on the actual situation.", "label": ["Important", "Edit/Control"], "rewrite": "You cannot access the personal information you have inquired and corrected, and you can contact us to delete or anonymize it."}
{"task": "rw_34.jsonl", "id": 49022, "text": "(2) Delete of personal information", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 49023, "text": "In addition to the information deleting and processing on the page of the above queries and correction information, you can also be, \"My\" — \"Settings\" in the upper right corner -select \"Cchecation Clean\".", "label": ["Important", "Edit/Control"], "rewrite": "You can \"My\" -Co \"Settings\" in the upper right corner of the lower right corner -select \"cache cleaning\"."}
{"task": "rw_34.jsonl", "id": 49024, "text": "You can request us to delete your personal information under the following circumstances:", "label": ["Important", "Edit/Control"], "rewrite": "You can request us to delete your personal information under the following circumstances:"}
{"task": "rw_34.jsonl", "id": 49025, "text": "(1) The purpose of the processing declared in this policy has been achieved, cannot be achieved, or is not necessary for the purpose of the treatment;", "label": ["Important", "Edit/Control"], "rewrite": "The purpose of the processing declared in this policy has been achieved, cannot be achieved, or is no longer necessary for the purpose of the processing purpose. You can make a request to delete information."}
{"task": "rw_34.jsonl", "id": 49026, "text": "(2) Based on your personal information, you withdraw your consent;", "label": ["Edit/Control", "Important"], "rewrite": "Based on the consent to handle your personal information, if you withdraw your consent, you can make a request to delete information."}
{"task": "rw_34.jsonl", "id": 49027, "text": "(3) Personal information storage period has expired;", "label": ["Important", "Edit/Control"], "rewrite": "Personal information storage period has expired, you can make a request to delete information."}
{"task": "rw_34.jsonl", "id": 49028, "text": "(4) We violate laws, administrative regulations, or collect, use, and store your (4) personal information with your agreement;", "label": ["Important", "Edit/Control"], "rewrite": "We violate laws, administrative regulations, or collect, use, and store your personal information with your agreement, and you can make a request to delete information."}
{"task": "rw_34.jsonl", "id": 49029, "text": "(5) We violate laws, administrative regulations, or provide your personal information to your third parties with your agreement. We will immediately stop the information transmission behavior and notify the third parties to delete it in time;", "label": ["Important", "Edit/Control"], "rewrite": "We violate laws, administrative regulations, or provide your personal information to a third party with your agreement. We will immediately stop the information transmission behavior and notify the third parties to delete them in time."}
{"task": "rw_34.jsonl", "id": 49030, "text": "(6) We will publicly disclose your personal information in violation of laws and administrative regulations, or to disclose your personal information.", "label": ["Important", "Edit/Control"], "rewrite": "If we violate laws and administrative regulations, or to disclose your personal information publicly, we will immediately stop public disclosure and issue notifications to require relevant receivers to delete the corresponding information."}
{"task": "rw_34.jsonl", "id": 49031, "text": "(7) You no longer use our products or services, or you cancel the transfer account;", "label": ["Important", "Edit/Control"], "rewrite": "You no longer use our products or services, or if you cancel the transfer account, you can ask for deleting personal information."}
{"task": "rw_34.jsonl", "id": 49032, "text": "(8) We stop providing products or services;", "label": ["Important", "Edit/Control"], "rewrite": "We stop providing products or services, and you can ask for deleting personal information."}
{"task": "rw_34.jsonl", "id": 49033, "text": "(9) Other circumstances stipulated in laws and regulations.", "label": ["Important", "Edit/Control"], "rewrite": "Others stipulated by laws and regulations may request deletion of personal information."}
{"task": "rw_34.jsonl", "id": 49034, "text": "If we decide to respond to your deletion request, we will also also notify the entities that obtain your personal information from our personal information and ask them to delete them in time, unless laws and regulations have other regulations, or these entities have obtained your independent authorization.", "label": ["Edit/Control", "Important"], "rewrite": "When we delete your personal information, it will require the entity that obtains your personal information to delete in time, unless laws and regulations have other regulations or you have authorized it alone."}
{"task": "rw_34.jsonl", "id": 49035, "text": "When you delete the information from our services, we may not immediately delete the corresponding information from the backup system, but will delete these information when the backup is updated.", "label": ["Important", "Edit/Control"], "rewrite": "Delete the information you require delete in the backup update."}
{"task": "rw_34.jsonl", "id": 49036, "text": "(3) Change the scope of your authorization consent or withdraw your authorization", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 49037, "text": "You can change your authorization of the scope of personal information or withdraw your authorization by deleting information and setting privacy permissions in the transfer software or withdrawing your authorization.", "label": ["Important", "Edit/Control"], "rewrite": "You can change authorization or withdraw your authorization by deleting information and setting privacy."}
{"task": "rw_34.jsonl", "id": 49038, "text": "You can also withdraw all the authorization of our personal information by canceling the account of the account.", "label": ["Edit/Control", "Important"], "rewrite": "You can withdraw all the authorization of your personal information by canceling the account."}
{"task": "rw_34.jsonl", "id": 49039, "text": "Please understand that each business function requires some basic personal information to be completed. When you withdraw consent or authorization, we cannot continue to provide you with the service corresponding to the withdrawal consent or authorization, and no longer handle your corresponding personal informationEssence", "label": ["Important", "Edit/Control"], "rewrite": "When you withdraw or authorize, we cannot continue to provide you with the corresponding services corresponding to the withdrawal consent or authorization, and no longer handle your corresponding personal information."}
{"task": "rw_34.jsonl", "id": 49040, "text": "But your decision to withdraw consent or authorization will not affect personal information processing based on your authorization.", "label": ["Edit/Control", "Important"], "rewrite": "Withdrawal authorization will not affect personal information processing based on previous authorization."}
{"task": "rw_34.jsonl", "id": 49041, "text": "(4) Sharing, transfer, and public disclosure of personal information. In the following cases, in the following situations, in the following circumstances, we shared, transferred, and publicly disclosed your personal information without obtaining your authorization consent in advance:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "According to the law, in the following circumstances, we shared, transferred, and publicly disclosed that your personal information does not need to obtain your authorization consent in advance:"}
{"task": "rw_34.jsonl", "id": 49042, "text": "(1) Directly related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The sharing or disclosure directly related to national security and national defense security does not require authorization."}
{"task": "rw_34.jsonl", "id": 49043, "text": "(2) Directly related to public safety, public health, and major public interests;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Sharing or disclosure directly related to public safety, public health and major public interests does not need to be authorized."}
{"task": "rw_34.jsonl", "id": 49044, "text": "(3) Directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Sharing or disclosure related to criminal investigation, prosecution, trial, and judgment execution does not need to be authorized."}
{"task": "rw_34.jsonl", "id": 49045, "text": "(4) For major legitimate rights and interests such as the life and property of the subject of personal information or other individuals, it is difficult to get my consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Out of the major legitimate rights and interests of the life and property of the subject of personal information or other individuals, it is difficult to get shared or disclosed by my consent, and there is no need to solicit."}
{"task": "rw_34.jsonl", "id": 49046, "text": "(5) Personal information that the subject of personal information disclosure to the public by itself;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The collected personal information is the sharing or disclosure of the subject of the personal information to the public by themselves without authorization."}
{"task": "rw_34.jsonl", "id": 49047, "text": "(6) Collect personal information from legal public information, such as legal news reports and government information disclosure.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you collect personal information from the legal disclosure information, no authorization is required."}
{"task": "rw_34.jsonl", "id": 49048, "text": "(5) Logging out the account", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 49049, "text": "You can apply directly in our products or services to cancel the account.", "label": ["Important", "Edit/Control"], "rewrite": "You can apply directly in our products or services to cancel the account."}
{"task": "rw_34.jsonl", "id": 49050, "text": "For the way you cancel your account and the conditions you should meet, see the \"Logging out\" page for details.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_34.jsonl", "id": 49051, "text": "After you cancel your account, we will stop providing you with products and/or services, and in accordance with your requirements, in addition to other provisions of laws and regulations, we will delete your personal information.", "label": ["Important", "Edit/Control"], "rewrite": "After the account is canceled, we will stop providing products and/or services, and delete your personal information, except for other provisions of laws and regulations."}
{"task": "rw_34.jsonl", "id": 49052, "text": "If you have any questions about the cancellation account, you can send an email, jubao@zhuanzhuan.com, we will have special personnel to give back feedback.", "label": ["Important", "Contact Information"], "rewrite": "If you have any questions about the cancellation account, you can send an email to jubao@zhuanzhuan.com."}
{"task": "rw_34.jsonl", "id": 49053, "text": "Inquiry method of the \"Logging out\" page:, APP, end: app, \"My\" -\"Settings\" - \"Account and Security\" - \"Logging out\" - \"Logging out\".", "label": ["Important", "Edit/Control"], "rewrite": "Inquiry method of the \"Logging out account\" page: APP end: \"My\" -\"Settings\" - \"Account and Security\" - \"Logging out\" - \"Logging out\"."}
{"task": "rw_34.jsonl", "id": 49054, "text": "(6) Copy and transfer of personal information", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 49055, "text": "You have the right to copy your personal information.", "label": ["Important", "Edit/Control"], "rewrite": "You have the right to copy your personal information."}
{"task": "rw_34.jsonl", "id": 49056, "text": "If you need to get the copy of your personal information we collected, you can contact us through the contact information agreed in [how to contact us] in this policy. Artificial customer service will confirm or collect your order information, register/call into your mobile phone by confirming or collecting your mobile phone.After the number and real -name authentication information is performed, the personal information copy is submitted to you.", "label": ["Important", "Edit/Control"], "rewrite": "Artificial customer service will submit your personal information copy to you after a test of you."}
{"task": "rw_34.jsonl", "id": 49057, "text": "Under the premise of compliance with relevant laws and technical feasibility, we will provide you with your personal information copy according to your requirements.", "label": ["Important", "Edit/Control"], "rewrite": "Under the premise of compliance with relevant laws and technical feasibility, we will provide you with your personal information copy according to your requirements."}
{"task": "rw_34.jsonl", "id": 49058, "text": "If you need to transfer your part or all your personal information to the personal information processor you designated, you can contact us through the contact information agreed by [How to contact us] in this policy, with a reasonable transfer request, and have legal lawsThe prescribed prerequisite for personal information transfer is under the premise of technical feasibility, if the data interface has been matched, we can also directly transmit your personal information copy to the third parties specified by you according to your requirements.", "label": ["Important", "Edit/Control"], "rewrite": "Under the premise of technical feasibility, we can also transmit your personal information copy directly to your designated third party according to your requirements."}
{"task": "rw_34.jsonl", "id": 49059, "text": "(7) Automatic decision -making of information system", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 49060, "text": "In certain business functions, we may make decisions only based on the non -artificial automatic decision mechanism, including information systems, algorithms, etc..", "label": ["Important", "Usage"], "rewrite": "We may make decisions based on non -artificial automatic decision -making mechanisms, including information systems, algorithms, etc.."}
{"task": "rw_34.jsonl", "id": 49061, "text": "If these decisions significantly affect your legitimate rights and interests, you have the right to ask us to explain, and we will also provide appropriate relief methods for you to refuse us to make decisions based on automation decision -making mechanisms.", "label": ["Edit/Control", "Important"], "rewrite": "You can refuse us to make a decision based on the automation decision mechanism."}
{"task": "rw_34.jsonl", "id": 49062, "text": "(8) Other personal information rights", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 49063, "text": "In the case of compliance with relevant laws, your close relatives can exercise the above rights of the relevant personal information behind you to check, copy, correct, delete, etc.", "label": ["Important", "Edit/Control"], "rewrite": "In the case of compliance with relevant laws, your close relatives can exercise the above rights of the relevant personal information behind you to check, copy, correct, delete, etc."}
{"task": "rw_34.jsonl", "id": 49064, "text": "But you have other arrangements.", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 49065, "text": "(9) In response to your above request", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 49066, "text": "Any questions, suggestions, opinions, and complaints on your customer service hotline can be contacted by contacting our customer service by dialing the customer service hotline 010-83416704, or through the \"transfer app or transfer to the second-hand trading network small program-my-customer service center\".", "label": ["Important", "Contact Information"], "rewrite": "Any questions, suggestions, opinions, and complaints on your customer service hotline can be contacted by contacting our customer service by dialing the customer service hotline 010-83416704, or through the \"transfer app or transfer to the second-hand trading network small program-my-customer service center\"."}
{"task": "rw_34.jsonl", "id": 49067, "text": "In order to ensure security, we will deal with the necessary authentication after passing the necessary authentication. The maximum will be answered within a period of no more than 15 working days or within the period of the prescribed by the laws and regulations.", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 49068, "text": "For your reasonable request, we do not charge fees in principle, but we will charge a certain cost fee depending on the request that repeats and beyond the reasonable limit.", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 49069, "text": "For those requests that need to be repeated and need too many technical means (for example, need to develop new systems or fundamentally change the current practice), bring risks to others' privacy or very unrealistic (such as information stored on the backup tape),We may refuse.", "label": ["Important", "Data Security"], "rewrite": "We may refuse to repeat for unseen, need too much technical means, bring risks or very unrealistic requests to others' legitimate rights and interests."}
{"task": "rw_34.jsonl", "id": 49070, "text": "In the following circumstances, in accordance with the requirements of laws and regulations, we will not be able to respond to your request:", "label": ["Important", "Edit/Control"], "rewrite": "In the following circumstances, in accordance with the requirements of laws and regulations, we will not be able to respond to your request:"}
{"task": "rw_34.jsonl", "id": 49071, "text": "(1) What is related to the obligations stipulated in our performance and regulations:", "label": ["Important", "Edit/Control"], "rewrite": "If your request is related to the obligations stipulated in our laws and regulations, it may not be responding."}
{"task": "rw_34.jsonl", "id": 49072, "text": "(2) It is related to national security and national defense security;", "label": ["Edit/Control", "Important"], "rewrite": "If your request is directly related to national security and national defense security, you may not be responded."}
{"task": "rw_34.jsonl", "id": 49073, "text": "(3) Related to public safety, public health, and major public interests;", "label": ["Important", "Edit/Control"], "rewrite": "Your request is directly related to public safety, public health, and major public interests and may not be responded."}
{"task": "rw_34.jsonl", "id": 49074, "text": "(4) Related to crime investigation, prosecution, trial, and execution judgment;", "label": ["Important", "Edit/Control"], "rewrite": "Your request is related to criminal investigation, prosecution, and trial, and may not be responded."}
{"task": "rw_34.jsonl", "id": 49075, "text": "(5) There is sufficient evidence that the subject of personal information has subjective malicious or abuse of rights;", "label": ["Edit/Control", "Important"], "rewrite": "Personal information controller has sufficient evidence to indicate that the subject of personal information has subjective malice or abuse of rights, and may not respond to the request."}
{"task": "rw_34.jsonl", "id": 49076, "text": "(6) For major legitimate rights and interests such as the life and property of the subject of personal information or other individuals, it is difficult to get the consent of my authority;", "label": ["Important", "Edit/Control"], "rewrite": "Out of the major legitimate rights and interests of the life and property of personal information subjects or other individuals, but it is difficult to get my consent, we may not be able to respond to the request."}
{"task": "rw_34.jsonl", "id": 49077, "text": "(7) responding to your request will cause the legitimate rights and interests of you or other individuals and organizations to be seriously damaged;", "label": ["Important", "Edit/Control"], "rewrite": "We may not be able to respond to requests that exceed the storage range, exceed the reasonable limit, or the legitimate rights and interests of personal information subjects or other individuals and organizations will be seriously damaged."}
{"task": "rw_34.jsonl", "id": 49078, "text": "(8) Involved in business secrets.", "label": ["Important", "Edit/Control"], "rewrite": "We may not be able to respond."}
{"task": "rw_34.jsonl", "id": 49079, "text": "8. How do we deal with the personal information of minors", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 49080, "text": "1. The transfer is mainly used for second -hand and idle items trading platforms. Our services are mainly for adults (principled, 18, years older as adults, 16, years old and or above, and we also use our labor income as the main source of life.For adults).", "label": ["Specific Audiences", "Important"], "rewrite": "The transfer is mainly used for second -hand and idle items trading platforms. Our services are mainly for adults."}
{"task": "rw_34.jsonl", "id": 49081, "text": "If you are a minor, you should read this privacy policy accompanied by the guardian before using our products and/or services. In particular, if you are a child under the age of 14, you should also be accompanied by the guardian’s accompaniment.Read the \"Children's Version\" \"Children's Version\", and ensure that you have obtained your guardian's consent and use our services and provide us with your information.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a child under the age of 14, please read privacy policies with your guardian and use services or information under the consent and guidance of the guardian."}
{"task": "rw_34.jsonl", "id": 49082, "text": "We will focus on protecting the personal information of minors in accordance with the provisions of relevant national laws and regulations.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_34.jsonl", "id": 49083, "text": "2. If your guardian does not agree that you use our services or provide information to us in accordance with this privacy policy, please immediately terminate our services and inform us in time.", "label": ["Specific Audiences", "Important"], "rewrite": "If your guardian does not agree with your service or information, please immediately terminate our services and notify us in time."}
{"task": "rw_34.jsonl", "id": 49084, "text": "3. For the consent of the parents or legal guardians to collect personal information of minors, we will only use or disclose this information if they are allowed to be used by law, parents or guardians to clearly consent or protect minors.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Usage", "Important"], "rewrite": "We will only use or disclose information when they are allowed to be allowed, parents or guardians to clearly consent or protect minors."}
{"task": "rw_34.jsonl", "id": 49085, "text": "4. If you are the guardian of minors, when you have any questions about the minors you monitor or the user information you provide to us, please contact us in time.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_34.jsonl", "id": 49086, "text": "We will protect the confidentiality and security of minor user information in accordance with relevant national laws and regulations and the provisions of this privacy policy.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_34.jsonl", "id": 49087, "text": "If we find that we collect personal information of minors without getting the consent of the parents or the legal guardian who can be confirmed in advance, we will try to delete relevant data as soon as possible.", "label": ["Specific Audiences", "Important"], "rewrite": "If the personal information of minors was collected without the consent of the legal guardian, he would try to delete relevant information as soon as possible."}
{"task": "rw_34.jsonl", "id": 49088, "text": "Nine, the update and notice of this privacy policy", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 49089, "text": "Our privacy policy may change.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_34.jsonl", "id": 49090, "text": "Without your clear consent, we will not reduce the rights you should enjoy in accordance with this privacy policy.", "label": ["Policy Change", "Important"], "rewrite": "Without your clear consent, we will not reduce the rights you should enjoy in accordance with this privacy policy."}
{"task": "rw_34.jsonl", "id": 49091, "text": "Whenever the privacy policy is updated, we will notify you through the \"Qualification & Agreement\" module on the station or on the \"qualification & agreement\" module on the PC and the homepage of the APP side → the \"Opinion Consultation and Update Announcement\".", "label": ["Policy Change", "Important"], "rewrite": "We will notify your privacy policy update through the \"Qualification & Agreement\" module on the site or on the \"Qualification & Protocol\" module on the PC and the homepage of the APP -end."}
{"task": "rw_34.jsonl", "id": 49092, "text": "For major changes, we will also provide more significant notifications (including for certain services, we will send notifications through PUSH notifications, text messages, etc. to explain the specific changes of privacy policies).", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_34.jsonl", "id": 49093, "text": "The major changes referred to this privacy policy include, but not limited to:", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_34.jsonl", "id": 49094, "text": "1. Make a major change in our service model.", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 49095, "text": "Such as the purpose of handling personal information, the type of S personal information, the use of personal information, etc.;", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 49096, "text": "2. We have changed significantly in the aspects of ownership structure and organizational structure.", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 49097, "text": "Such as changes caused by business adjustment, S bankruptcy mergers and acquisitions, etc.", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 49098, "text": "3. The main object of personal information sharing, transfer or public disclosure changes;", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 49099, "text": "4. The right to participate in personal information processing and its exercise methods have changed significantly;", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 49100, "text": "5. When we are responsible for handling the responsible departments, contact methods and complaint channels of personal information security;", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 49101, "text": "6. Personal information protection assessment report shows that there is a high risk.", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 49102, "text": "We will also archive the old version of this privacy policy for you to check.", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 49103, "text": "In addition to registering on the transfer platform, you can check the latest version of the privacy policy, the PC side, you can check our latest version of the \"Transfer Privacy Policy\" below the transfer home page;", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 49104, "text": "APP, you can \"set\"-\"Settings\"-\"About Turn\" to view the latest version of \"Transfer Privacy Policy\" in the upper right corner.", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 49105, "text": "Ten, how to contact us", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 49106, "text": "If you have any questions about this privacy policy or the above-mentioned personal information you provided, you can use ① to turn the customer service channel (turn to the app or turn to the second-hand trading network small program-my-customer service center) or ② send email emailsThe person in charge of personal information protection: jubao@zhuanzhuan.com or ③ Dial the transfer platform illegal bad information report phone (010) 83416704 to contact us.jubao@zhuanzhuan.com], we will give you a reply as soon as possible after receiving your request and verifying your identity.", "label": ["Important", "Contact Information"], "rewrite": "① Transfer to customer service channels: Transfer app or turn to a second-hand trading network small program-my-customer service center; ② personal information protection person mailbox: jubao@zhuanzhuan.com; ③ illegal bad information report phone: (010) 83416704."}
{"task": "rw_34.jsonl", "id": 49107, "text": "Under normal circumstances, we will reply within fifteen days (the national statutory holidays are postponed) or the time limit stipulated by the law.", "label": ["Important", "Contact Information"], "rewrite": "We will reply within fifteen days (the national statutory holidays are postponed) or within the time limit stipulated by the law."}
{"task": "rw_34.jsonl", "id": 49108, "text": "11. Dispute resolution", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 49109, "text": "1. If you are not satisfied with our reply, especially if you think our personal information processing behavior has damaged your legitimate rights and interests, you can also give feedback to the Internet Information Office and Industry and Commerce Supervision.", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 49110, "text": "Among them, the official website of the Central Cyberspace Office's illegal and bad information reporting center is: http://report.12377.cn: 13225/TOREPORTINPUTNOTNONIS.DO?", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 49111, "text": "utm_source=market&spm=u-2d2yxv86y3v43nkddh1.BDPCPZ_BT。", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 49112, "text": "2. Due to any disputes caused by our privacy policy and our personal information, either party shall file a lawsuit to a court with jurisdiction in the place of residence in the residence of the defendant to seek solutions.", "label": [], "rewrite": []}
{"task": "rw_34.jsonl", "id": 49113, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
