{"task": "rw_38.jsonl", "id": 49983, "text": "Updated: January 26, 2022", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 49984, "text": "Effective time: January 26, 2022", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 49985, "text": "Foreword", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 49986, "text": "China Agricultural Bank of China Co., Ltd. (\"My Here\" or \"Us\") (Registration address: 69, Jianguomen, Jianguo Men, Dongcheng District, Beijing) deeply knows the importance of personal information to you, and will do its best to protect your personal information.Safe and reliable.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 49987, "text": "We are committed to maintaining your trust in us, abiding by the following principles, and protecting your personal information: the principles of justice and integrity, the principles of consistent power and responsibility, the principles of the purpose of the purpose, the principle of choice and consent, Public and transparent principles, etc.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 49988, "text": "At the same time, our bank promises that we will take corresponding security protection measures in accordance with the law to protect your personal information in accordance with the law.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 49989, "text": "This \"Privacy Policy (Personal Edition)\" (following or \"this policy\") is a general privacy clause used by our bank, which is suitable for our products and services for personal customers.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 49990, "text": "Involved in specific products (or services), our bank can collect and use your personal information, methods, scope, and storage periods that can also pass the corresponding product (or service) protocols, authorization books, etc.Your authorization or consent.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 49991, "text": "The above documents and this \"Privacy Policy (Personal Edition)\" together constitute the complete privacy policy of our bank for personal customer products and services.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 49992, "text": "Please carefully read the \"Privacy Policy (Personal Edition)\" before checking \"Agree\" to ensure that all of them have known and fully understand the content of its content (especially the content of the black font content) and the corresponding legal consequences.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 49993, "text": "If you click or checked \"Agree\", you are deemed that you accept this \"Privacy Policy (Personal Edition)\". Our bank will legally use and protect your personal information in accordance with relevant laws and regulations and this policy.", "label": ["Policy Change", "Important"], "rewrite": "If you click or checked \"Agree\", you are deemed that you accept this \"Privacy Policy (Personal Edition)\"."}
{"task": "rw_38.jsonl", "id": 49994, "text": "If you want to know more detailed information, please read the corresponding chapter as follows:", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 49995, "text": "1. How does our trip collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 49996, "text": "2. How can our trip use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 49997, "text": "3. How does our trip store and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 49998, "text": "Fourth, how do our trip provide your personal information to the outside world", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 49999, "text": "5. How do you access and manage your personal information", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50000, "text": "6. How to deal with the personal information of the minor", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50001, "text": "7. How to update this policy", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50002, "text": "8. How to contact me", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50003, "text": "1. How does our trip collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50004, "text": "Personal information refers to the various information related to the recognized or recognizable natural person recorded in electronics or other methods, excluding information after anonymous processing.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50005, "text": "Personal information includes names, date of birth, ID number, personal biometric information, address, communication and communication contact information, communication records and content, account passwords, property information, credit information, travel information, accommodation information, health and physiological information, transactions, transactions, transactions, transactions, transactions, transactions, transactionsInformation, etc.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50006, "text": "Sensitive personal information refers to personal information that can easily cause the personality dignity of natural people to be violated or harmed by personal and property security once it is leaked or illegally used.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50007, "text": "Specific identity and personal information of minors under the age of 14.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50008, "text": "Among them, personal biometric information includes personal genes, fingerprints, sound patterns, palm lines, auricle, iris, facial recognition features, etc.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50009, "text": "We may collect and use personal information that you actively provide in the process of using our products or services in the process of using our products or services, and in accordance with the provisions of the usePersonal information collected to third parties.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may collect and use personal information that you actively provide or use the product or service, and personal information collected in accordance with laws and regulations or your authorization consent."}
{"task": "rw_38.jsonl", "id": 50010, "text": "We will not handle your personal information than your authorization or consent. If we need to collect your personal information, we will inform you in a reasonable way and obtain your consent before collecting.", "label": ["Important", "First Party Collection Information", "Data Security"], "rewrite": "It will not exceed your personal information and scope of the purpose of your authorization or consent, otherwise you will inform and obtain your consent before collecting."}
{"task": "rw_38.jsonl", "id": 50011, "text": "If the business is involved in sensitive personal information, our bank will inform you that the need to handle sensitive personal information and the impact on personal rights in accordance with the law, etc., obtain your separate consent in accordance with the law.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "If the business is involved in sensitive personal information, you will obtain your separate consent in accordance with the law."}
{"task": "rw_38.jsonl", "id": 50012, "text": "If our bank needs to use your personal information for other purposes that are not stated in this policy, we will fully notify you in accordance with the requirements, methods, and scope of information collection and use in accordance with the requirements of laws and regulations and national standards, and once again ask your consent again.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "If you use your information to unprepare other purposes, you will fully inform and ask for your consent."}
{"task": "rw_38.jsonl", "id": 50013, "text": "If our bank needs to use your personal information based on specific purposes for other purposes, you will also solicit your consent in advance.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "If you use personal information based on specific goals for other purposes, you will solicit your consent."}
{"task": "rw_38.jsonl", "id": 50014, "text": "(1) Provide you with your personal information and/or services you actively provide personal information.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50015, "text": "In order to achieve various channels for personal products and services in our bank, such as personal online banking (hereinafter referred to as \"personal online banking\", personal palm bank (hereinafter referred to as \"personal palm bank\"), counter, super counter, self -service equipment, Agricultural Bank of China WeChat public publicThe core business function of the number and WeChat mini -programs may need to collect personal information from you.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to realize the core functions of our personal products and services, we may need to collect personal information like you."}
{"task": "rw_38.jsonl", "id": 50016, "text": "The following will list the core business functions of our bank and the personal information collected to realize the function. If you refuse, you cannot use related services.", "label": ["Important", "First Party Collection Information"], "rewrite": "The following will list the core business functions of our bank and the personal information collected to realize the function. If you refuse, you cannot use related services."}
{"task": "rw_38.jsonl", "id": 50017, "text": "The SMS verification code collected in the following scene and the customer payment password are only used to verify your identity, and the client does not store such information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The collected SMS verification code and customer payment password are only used to verify your identity, and the client does not store such information."}
{"task": "rw_38.jsonl", "id": 50018, "text": "Please note: If you provide personal information of others, make sure you have obtained the authorization or consent of the relevant personal information subject.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50019, "text": "1. Account management service:", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50020, "text": "(1) In accordance with laws and regulations and regulatory requirements, when using personal online banking, personal banks, and Agricultural Bank of China WeChat public account registration, log in and activate the service of the above -mentioned personal electronic banking channels (hereinafter collectively referred to as \"electronic banking services\"),Our bank will collect your mobile phone number, ID number, and name.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When registering, logging in and activating electronic banking services, we will collect your mobile phone number, ID number, and name."}
{"task": "rw_38.jsonl", "id": 50021, "text": "If you are a bank card customer of other banks, when you register, log in and activate our personal electronic banking services, our bank will collect your name, gender, nationality, occupation, contact address, ID number and ID information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The bank card customers of other banks will register, log in and activate our personal electronic banking services, and will obtain names, gender, nationality, occupation, contact address, ID number and ID information."}
{"task": "rw_38.jsonl", "id": 50022, "text": "If you register for our personal electronic banking service through personal palm bank \"fast registration\" channel, our bank will collect your mobile phone number and SMS verification code.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If the personal electronic banking service is registered through the \"fast registration\" channel through personal palm silver, our bank will collect your mobile phone number and SMS verification code."}
{"task": "rw_38.jsonl", "id": 50023, "text": "If you refuse to provide this information, you may not be able to successfully register, log in or activate personal electronic banks or cannot use our banks normally.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50024, "text": "(2) According to the requirements of my country's laws and regulations and the purpose of security guarantee, when you register our account, you need to provide you with a mobile phone number and send a SMS verification code for certification. The registration is unsuccessful, so it is impossible to use the relevant functions of our personal electronic banking services.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you register our account, you need to provide your mobile phone number and send you a SMS verification code for authentication."}
{"task": "rw_38.jsonl", "id": 50025, "text": "But you can withdraw from the registration/login business and return to the homepage to browse.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide a mobile phone number for verification, you can withdraw from the registration/login business and return to the home page to browse."}
{"task": "rw_38.jsonl", "id": 50026, "text": "(3) When you need to verify your identity and signature in your counter processing business, you need to provide or authorize our bank to collect and retain your ID information and fingerprint images.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you need to verify your identity and signature in your counter processing business, our bank will collect and retain your ID information and fingerprint images."}
{"task": "rw_38.jsonl", "id": 50027, "text": "(4) When you use your personal palm silver fingerprint login service, in order to provide you with the service, we need you to provide your fingerprint recognition information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you log in to your personal palm silver fingerprint, you need to provide your fingerprint recognition information."}
{"task": "rw_38.jsonl", "id": 50028, "text": "(5) In accordance with laws and regulations and regulatory requirements, users who have not binded bank cards need to collect your bank card number, payment password, bank reserved mobile phone number, SMS verification code, ID number and identity when the bank is upgraded to upgradeCertificate information, communication information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Users who do not bind bank cards need to collect your bank card number, payment password, bank reserved mobile phone number, SMS verification code, ID number and ID information, communication information, and communication information."}
{"task": "rw_38.jsonl", "id": 50029, "text": "(6) When you use the super counter, personal palm bank, personal online banking to apply for a debit card, two or three types of electronic accounts, and modifying information, our guild collects and records your name and certificate type in the system in the system., Certificate number, document issuance date, document expiration date, location of the issuing authority, gender, date of birth, nationality, nationality, occupation, mobile phone number, fixed telephone, mailing address, personal tax identity information, if only non -residents or both are both or bothChinese tax residents are also tax residents of other countries (regions). They need to increase your surname (English or Pinyin), name (English or Pinyin), tax residents (regions), taxpayer identification numbers, and if the taxpayer identification is not filled in the taxpayer identificationNumber, the specific reasons for the account holder who failed to obtain the taxpayer identification number, the code of the current country, the current residence address (Chinese) administrative division code, the current residence address (Chinese), the current residence address (English or pinyin)Provincial (state), current residence address (English or pinyin) cities, current residence address (English or pinyin), code in the country of birth, cities (Chinese) administrative divisions, birth cities (Chinese), birth cities (English or Pinyin) Provincial (state), birth cities (English or pinyin) cities, birth cities (English or Pinyin).", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the super counter, personal palm silver, personal online banking to apply for a debit card, two or third types of electronic accounts, and modify the information, you need to collect your name, certificate type, certificate number, date of document issuance, document to certificate toDate and other information."}
{"task": "rw_38.jsonl", "id": 50030, "text": "(7) When you open a debit card, you can use the online channels such as the Agricultural Bank of China microservice mini -programs \"Super Counter\" and other online channels for debit card to open the card.Mobile phone number, occupation, address information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When your super counter is pre -filled in \"online channels to perform debit card opening, your name, certificate number, mobile phone number, occupation, and address information will be collected."}
{"task": "rw_38.jsonl", "id": 50031, "text": "(8) When you use the super counter to apply for electronic banks, or to sign the contract with other business to sign a contract to handle personal message service maintenance, we will collect your mobile phone number and verify authenticity through the SMS verification code.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you apply for electronic banking contract or personal message service maintenance, you need to collect your mobile phone number and verify authenticity through the SMS verification code."}
{"task": "rw_38.jsonl", "id": 50032, "text": "(9) When you use the super counter to handle card replacement, password resetting, or hanging out of the card, in order to compare the system retention data, we need to collect your mobile phone number and account balance.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you apply for a card conversion, password resetting, or hanging out of the card, you need to collect your mobile phone number and account balance."}
{"task": "rw_38.jsonl", "id": 50033, "text": "There are card -selling cards and losses. In order to compare the information with the system, we need to collect your reserved mobile phone number and account balance. In addition, we also need to collect and transfer to the debit card number and collect your transfer record.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "There are card -selling cards and looser -to -sales cards. You need to collect your reserved mobile phone numbers, account balances, transfer to debit card number, transfer records."}
{"task": "rw_38.jsonl", "id": 50034, "text": "2. Transfer payment service:", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50035, "text": "When you use personal hand silver and super counter service to transfer the transfer function, in order to handle the corresponding business for you, we need to collect the mobile phone number, name, account number, receipt bank, and transfer of the payment of the payee;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the transfer remittance function, you need to collect the mobile phone number, name, account number, receipt bank, and transfer of transfers."}
{"task": "rw_38.jsonl", "id": 50036, "text": "We need to collect the names, account information, ID number and identity information, and communication information of the transferor.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect the name, account information, ID number and identity information, and communication information of the transferor."}
{"task": "rw_38.jsonl", "id": 50037, "text": "In order to provide you with query and convenient transfer services, we need to collect and retain your transfer records.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect and retain your transfer records in order to provide query and convenient transfer services."}
{"task": "rw_38.jsonl", "id": 50038, "text": "You can also use a check -up pre -filled service through the function of the Agricultural Bank of the MSA \"Super Counter Pre -Filling Fill\" function.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50039, "text": "In order to provide you with this service, we will collect your ID number and ID information, Chinese name, pinyin, and name Pinyin.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your ID number and ID information, Chinese names, pinyin, and name pinyin to provide check -to -payment pre -filling services."}
{"task": "rw_38.jsonl", "id": 50040, "text": "When you apply for transfer or delayed transfer through the super counter, our bank will collect information about the payer's account, the name of the payee, the account party account, and the account opening bank account.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect the payer's account number, the name of the payee, the account party account, and the account party account opening information to handle or delay transfer."}
{"task": "rw_38.jsonl", "id": 50041, "text": "When you use personal palm silver and personal online banking for payment, in order to handle the corresponding business for you, we need to collect your name, account number, ID type, ID number, mobile phone number, SMS verification code.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your name, account number, ID type, ID number, mobile phone number, SMS verification code to handle payment business."}
{"task": "rw_38.jsonl", "id": 50042, "text": "In order to provide you with query services, we need to collect and retain your payment records.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect and retain your payment records to provide query services."}
{"task": "rw_38.jsonl", "id": 50043, "text": "3. Personal loan service:", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50044, "text": "When you use the loan application function at your personal palm silver and super counter, in order to provide you with the service, our bank needs to evaluate your loan qualification, credit credit quota, check your identity, and perform risk prevention and control. ThereforeAuthorized us to check your following information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your basic situation, education work information, investment or business information, personal property information, etc., to verify your identity and perform risk prevention and control to provide loan application functions."}
{"task": "rw_38.jsonl", "id": 50045, "text": "Single loan products may only require some types of information listed below. Personal information collected by different loan products will be different. For details, please refer to the text and application forms of each product agreement.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50046, "text": "If you do not provide such information, you may not be able to handle this business successfully, but this does not affect other functions of your normal use of personal silver.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50047, "text": "(1) Basic situation.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50048, "text": "Including names, birthdays, gender, ethnicity, nationality, marriage status, mobile phone number, current residence address, postcode, household registration, local residential time, current housing source, identity document type, ID number, certificate certificate, long -term validity, identity certificate validity periodEssence", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50049, "text": "(2) Education work information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50050, "text": "Including cultural, academic qualifications, degrees, work units, industry types, occupations, jobs, vocational titles, current units work, and previous units work.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50051, "text": "(3) Investment or business information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50052, "text": "Including the name of the enterprise, the shareholding ratio, the industry and the industry's business years, unit address, postal code, unit phone, mailing address, mobile phone number, email, industrial and commercial registration information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50053, "text": "(4) Personal property information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50054, "text": "Including bank accounts, credit records, transactions and consumption records, family revenue and expenditure information, identification information (to verify information that you have access or use authority, including bank card passwords, login passwords, account query passwords, transaction passwords, dynamic passwords, dynamic passwords, SMS verification codes, password prompt questions, answers, etc.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50055, "text": "）。", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50056, "text": "Home revenue and expenditure information includes total monthly income, applicants' annual income, monthly salary income, monthly operating income, other monthly income, monthly salary income, monthly operating income, other monthly income, income flow records, deposit informationItems", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50057, "text": "The total monthly debt expenditure of the family, the applicant's monthly loan expenditure, the applicant's spouse's monthly repayment expenditure, the family's other monthly debt expenditures, the family support population, and the family's total external guarantee.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50058, "text": "(5) Network identity information, personal silver operation records, personal common equipment information, personal location information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50059, "text": "Including personal information main account number, IP address, personal digital certificate, personal information main operation records, hardware serial number, device MAC address, unique device recognition code, IPv4, IPv6, PC or mobile phone operating system, mobile phone number, mobile phone number, mobile phone number, mobile phone number, mobile phone number, mobile phone number, mobile phone number, mobile phone number, mobile phone number, mobile phone number, mobile phone number, mobile phone number, mobile phone number, mobile phone number, mobile phone number, mobile phone number, mobile phone number, mobile phone number, mobile phone number, mobile phone number, mobile phone number, mobile phone number, mobile phone number, mobile phone number, mobile phone number, mobile phone number, mobile phone number, and mobile phone number, mobile phone number, mobile phone number, mobile phone number, mobile phone number, mobile phone number, mobile phone number, mobile phone number, mobile phone number, mobile phone number, mobile phone number, mobile phone number, mobile phone number, and mobile phone number,Mobile phone brand, mobile phone model, GPS longitude, GPS latitude, GPS province, GPS city, equipment number.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50060, "text": "(6) Personal information of relevant parties.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50061, "text": "Including spouse, common applicant/borrower (and spouse) information.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50062, "text": "The scope of collecting the personal information of the aforementioned person will not exceed the scope of personal information from this service item.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50063, "text": "(7) Loan information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50064, "text": "Including loan use, loan variety, loan amount, guaranteed loan amount, credit loan amount, loan interest rate information, loan period, repayment method, repayment cycle, whether to apply for cycle quota, circular amount amount, the validity period of the cycle limit, whether you have applied for autonomous applicationCirculation quota, autonomous cycle quota.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50065, "text": "If you apply for a house purchase loan, you need to collect your family (including myself, spouse and minor children). At present, there are real housing sets, whether the provident fund portfolio loan, and provident fund loan amount.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you apply for a housing loan, you need to collect your family's current number of housing sets, whether the provident fund portfolio loan, and provident fund loan amount."}
{"task": "rw_38.jsonl", "id": 50066, "text": "If you apply for a loan or a loan or a loan of a loan, you need to collect the name of the original loan bank, the initial amount of the loan, and the balance of the loan deposit on the original loan bank.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you apply for a loan or a loan or a loan of a loan, you need to collect the name of the original loan bank, the initial amount of the loan, and the balance of the loan deposit on the original loan bank."}
{"task": "rw_38.jsonl", "id": 50067, "text": "(8) Guarantee situation.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50068, "text": "Housing down payment amount, purpose of buying houses.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Housing down payment amount, purpose of buying houses."}
{"task": "rw_38.jsonl", "id": 50069, "text": "If the house is mortgaged with a house, the mortgagor's name, identity document type, ID number, contact phone number, house address, house nature, real estate right certificate number, house building area.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If the house is mortgaged with a house, the mortgagor's name, identity document type, ID number, contact phone number, house address, house nature, real estate right certificate number, house building area."}
{"task": "rw_38.jsonl", "id": 50070, "text": "If the vehicle purchased with a loan is mortgaged, the vehicle brand, the total price of the vehicle, and the down payment of the vehicle need to be collected.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If the vehicle purchased with a loan is mortgaged, the vehicle brand, the total price of the vehicle, and the down payment of the vehicle need to be collected."}
{"task": "rw_38.jsonl", "id": 50071, "text": "If the property beyond the three types of mortgagers is set for mortgage, the mortgagers' name, identity document type, ID number, contact phone number, mortgage name, and mortgage evaluation price must be collected.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If you set mortgages with other property, you need to collect the name of the mortgagor, the type of ID, ID number, contact phone number, mortgage name, and mortgage evaluation price."}
{"task": "rw_38.jsonl", "id": 50072, "text": "If the pledge is set with property, it is necessary to collect the name of the person, the phone number, the name of the pledge, and the value of the pledge.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If the pledge is set with property, it is necessary to collect the name of the person, the phone number, the name of the pledge, and the value of the pledge."}
{"task": "rw_38.jsonl", "id": 50073, "text": "If the legal person is guaranteed, the name of the legal person, the type of guarantee, the type of guarantee, the mailing address, the postcode, the contact phone number, the industrial and commercial registration information, and other information that the \"Privacy Policy (Public Edition) of the Agricultural Bank of China Co., Ltd. (Public Edition)\" is required.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If the legal person is guaranteed, the name of the legal person, the type of guarantee, the assignment address, the mailing address, the postcode, the contact telephone number, the industrial and commercial registration information, and other information."}
{"task": "rw_38.jsonl", "id": 50074, "text": "If the natural person is guaranteed, the guarantor information that needs to be collected includes: name, gender, nationality, year of birth, marriage status, identity document type, ID number, cultural level, current residence address, postcoding of current residence address, location of the household registration, locally locally, local local, local local, local local, local local, local local, local local, local local, local local, local local, local local, local local, local local, local local, local local, local local, local local, local local, local areaHousing time, current housing source, work unit, current unit work, life limit, and position of the previous unit;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If the natural person is guaranteed, the guarantor information that needs to be collected includes: name, gender, nationality, year of birth, marriage status, identity certificate type, ID number, cultural level, etc."}
{"task": "rw_38.jsonl", "id": 50075, "text": "The name of the company's investment or business enterprise, the shareholding ratio, the industry and the industry's business years, the unit address of the unit, the postcode of the unit address, the mailing address, the mail code of the mailing address, the family phone, the mobile phone number, the unit phone, the industrial and commercial registration information;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50076, "text": "Guarantee family revenue and expenditure: monthly income, monthly salary income, monthly operating income, other monthly income, guaranteed monthly salary income, monthly operating income, other monthly income, family monthly debt expenditure, guarantor monthly repayment expenditure expenditure expenditure expenditure expenditure expenditure expenditure expenditure expenditure2. Monthly pay for spouse monthly loan expenses, family monthly debt expenditures, number of family support population, and total family guarantee.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50077, "text": "(9) Other information authorized or submitted by applicants.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50078, "text": "Including credit information, provident fund payment, personal tax information, medical insurance payment, whether it is included in the list of people who have been dishonesty.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50079, "text": "When you apply for a pricing benchmark conversion, we will collect your loan repayment.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you apply for a pricing benchmark conversion, you will collect your loan repayment."}
{"task": "rw_38.jsonl", "id": 50080, "text": "4. Cash service:", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50081, "text": "(1) You can enjoy the large -scale cash withdrawal service through personal online banking and Agricultural Bank microservices mini program. In order to provide you with the service, we need to collect your name, mobile phone number, ID number and ID information, SMS verification code, SMS verification code, and SMS verification code, SMS verification code, and SMS verification code, and verification code, and SMS verification code, and the verification code, and the verification code, and the verification code,, the SMS verification code, the verification code, and the verification code,, the verification code, and the verification code,, the SMS verification code, the verification code, and the verification code, and the text message verification code, the verification code, and the verification code, and the verification code, and the verification code, and the SMS verification code.Communication information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your name, mobile phone number, ID number and ID information, SMS verification code, and communication information."}
{"task": "rw_38.jsonl", "id": 50082, "text": "(2) You can reserve foreign currency cash by personal online banking and the Agricultural Bank of China microservice mini program. In order to provide you with the service, we need to collect your name, mobile phone number, ID number, SMS verification code, certificate information, identity information, identity information, identity information, Communication information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your name, mobile phone number, ID number, SMS verification code, document information, identity information, and communication information, thinking that you provide reservation for foreign currency cash services."}
{"task": "rw_38.jsonl", "id": 50083, "text": "(3) When you use the commemorative coin appointment and query function provided by the super counter. In order to handle the corresponding business, we need to collect your name, document information, and mobile phone number.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your name, document information, and mobile phone number, thinking that you provide the commemorative currency appointment and query function."}
{"task": "rw_38.jsonl", "id": 50084, "text": "According to the supervision requirements of the People's Bank of China, we need to collect your appointment record information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your commemorative currency appointment record information."}
{"task": "rw_38.jsonl", "id": 50085, "text": "(4) When you use the cash access function provided by the super counter, and the relevant functions related to the opening of a regular and deposit list, if your withdrawal amount reaches the amount you need to review, in order to give you the corresponding business, weYou need to collect your name, account number, amount, funding source or withdrawal usage, industry category and attachment, mobile phone number and SMS verification code, certificate type and certificate number, fingerprint, identity information, account information to ensure transaction security;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If your withdrawal amount reaches the amount that needs to be reviewed, you need to collect information such as your name, account number, amount, funding source or withdrawal usage, industry category and attachment to ensure transaction security."}
{"task": "rw_38.jsonl", "id": 50086, "text": "At the same time, in order to provide you with query and convenient deposit withdrawal services, we need to collect your access to withdrawal transaction records.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your access to withdrawal transaction records, thinking that you provide inquiries and convenient deposit withdrawal services."}
{"task": "rw_38.jsonl", "id": 50087, "text": "5. Investment wealth management services:", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50088, "text": "Common addresses, work units, occupations, positions, personal annual income, family annual income, resident types, risk types, financial account accounts and household names, insured relationships, insured person's height and weight.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your name, gender, date, nationality, identity document type and other information, thinking that you provide wealth management product purchase services."}
{"task": "rw_38.jsonl", "id": 50089, "text": "(2) In order to provide you with the above -mentioned financial services and ensure your property security, we need to evaluate your risk tolerance, so you need to provide your age, education, financial status, product holding, investment experience, investment purpose, investment style, investment style, Lobricity requirements, risk loss maturity, risk appetite, risk awareness, account information, identity information, document information, property information, property information;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your information, education, financial status, product holding, investment experience, investment purpose, investment style, liquidity requirements and other information to evaluate your risk tolerance."}
{"task": "rw_38.jsonl", "id": 50090, "text": "At the same time, in order to evaluate whether you belong to qualified investors, we need to collect your investment experience, net assets of family finance, account information, identity information, certificate information, property information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your investment experience, net assets of family finance, account information, identity information, ID information, property information, and evaluate whether you are a qualified investor."}
{"task": "rw_38.jsonl", "id": 50091, "text": "You can also use the risk assessment pre -processing through the function of the Agricultural Bank of the MSA \"Super Counter Pre -Filling Fill\" function.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50092, "text": "To provide you with this service, we will collect your name and ID number.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your name and ID number for risk assessment and pre -processing."}
{"task": "rw_38.jsonl", "id": 50093, "text": "6. Life service:", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50094, "text": "(1) You can use the related banks of personal banks, the WeChat public account of the Agricultural Bank of China, the Agricultural Bank of China Micro Payment Application, Super Counter and Counter's living payment function.cost.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50095, "text": "In order to provide you with corresponding services, our bank will collect the necessary personal information according to the charging scenario, for example: when you recharge the phone bill, fix the phone bill, and the food fee, we need to collect your mobile phone number or phone number;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect the necessary personal information according to the toll scenario to provide the living payment function."}
{"task": "rw_38.jsonl", "id": 50096, "text": "When you pay property fees, party fees, conference fees, maintenance costs, payment, membership fees, deposits, and pension fees, we need to collect your name information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you pay property fees, party fees, conference fees, maintenance fees, payment, payment, membership fees, deposits, and pension fees, collect your name information."}
{"task": "rw_38.jsonl", "id": 50097, "text": "(2) When you recharge the various online games and application accounts through \"Game Card\", we need to collect your game account and mobile phone number.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your game account and mobile phone number to provide online games and application account recharge services."}
{"task": "rw_38.jsonl", "id": 50098, "text": "(3) When you use the \"high -speed steward\" function to buy train tickets, we need to collect your mobile phone number and SMS verification code.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your mobile phone number and SMS verification code so that you can use the \"high -speed rail butler\" function to buy train tickets."}
{"task": "rw_38.jsonl", "id": 50099, "text": "(4) When you recharge the oil card, we need to collect your card number;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you recharge the oil card, we need to collect your card number."}
{"task": "rw_38.jsonl", "id": 50100, "text": "At the same time, if you have a coupon or red envelope, in order to successfully use the coupon or red envelope, we need to collect your mobile phone number and SMS certificate to verify the relevant information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your mobile phone number and SMS card to verify the coupon or red envelope information."}
{"task": "rw_38.jsonl", "id": 50101, "text": "(5) You can open the \"Sensing Parking/Come on\" function through personal palm banks, WeChat public accounts of Agricultural Bank of China, and Agricultural Bank of China.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50102, "text": "When you open this service, we need to collect your name, ID number and ID information, mobile phone number, license plate number, bank card number, SMS verification code, and communication information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your name, ID number and ID information, mobile phone number, license plate number, bank card number, SMS verification code, and communication information to provide the \"sensory parking/refueling\" function."}
{"task": "rw_38.jsonl", "id": 50103, "text": "(6) When you use the travel service provided by your personal palm silver, we will collect your name, ID number and ID information, mobile phone number, license plate number, bank card number.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your name, ID number and ID information, mobile phone number, license plate number, bank card number to provide travel services."}
{"task": "rw_38.jsonl", "id": 50104, "text": "Please note that the travel services here do not include non -sensing travel and signing of non -sensing payment.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50105, "text": "(7) You can use the \"UnionPay discount\" function to obtain discount information of nearby merchants that cooperate with our bank.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50106, "text": "To this end, our bank needs to collect your name, document type, certificate number, mobile phone number, bank card number, location information, certificate information, identity information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your name, certificate type, document number, mobile phone number, bank card number, location information, document information, identity information, so that you can get preferential information of nearby merchants in cooperation with our bank."}
{"task": "rw_38.jsonl", "id": 50107, "text": "(8) Agricultural Bank of China provides a series of goods purchase services.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50108, "text": "You can purchase various types of products in the \"Poverty Alleviation Mall\" of Personal Bank of China and the WeChat public account of the Bank of China. To this end, our bank needs to collect the names of the consignee, contact address, mobile phone number or phone number.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect the consignee's name, contact address, mobile phone number or phone number so that you can buy various products in the \"Poverty Alleviation Mall\"."}
{"task": "rw_38.jsonl", "id": 50109, "text": "You can also buy precious metals on the \"physical precious metal\" page of personal palm silver. To this end, our bank needs to collect the name, contact address, mobile phone number or phone number of the consignee.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect the names of the consignee, contact address, mobile phone number or phone number so that you can buy precious metals."}
{"task": "rw_38.jsonl", "id": 50110, "text": "(9) You can pay pensions through the WeChat public account of Agricultural Bank of China, and our bank needs to collect your ID number.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "You pay pensions through the WeChat public account of Agricultural Bank of China, and our bank will collect your ID number."}
{"task": "rw_38.jsonl", "id": 50111, "text": "(10) You can enjoy smart medical services through the WeChat public account of the Agricultural Bank of China. Our bank needs to collect the name, gender, ID number and ID information, mobile phone number, and SMS verification code of the clinic.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect the name, gender, ID number and ID information, mobile phone number, SMS verification code for the person's name, gender, ID number and ID to provide smart medical services."}
{"task": "rw_38.jsonl", "id": 50112, "text": "(11) When you buy insurance through a super counter, we will collect your mobile phone number, email address, insured address, annual income, postcode, occupational type, insured information, beneficiary information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your mobile phone number, email address, insured address, annual income, postcode, occupational type, insured information, beneficiary information to provide insurance services."}
{"task": "rw_38.jsonl", "id": 50113, "text": "The information of the insured and the beneficiary includes: name, gender, date of birth, nationality, certificate type, document number, certificate validity period, mobile phone number, postcode, address, occupation, occupation category.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50114, "text": "7. Credit card service:", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50115, "text": "(1) You can apply for a credit card or a lottery card upgraded version through personal online banking, personal palm silver, counter, super counter, Agricultural Bank of China WeChat public account, Agricultural Bank Credit Card Mini Program, Agricultural Bank Micro -service Mini Program.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50116, "text": "Mobile phone number), mailbox address is used for credit card access approval.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your name, ID number, mobile phone number, verification code, education level, marriage, residential status, family address, work information, company address, contact information, mailbox address for credit card access approval."}
{"task": "rw_38.jsonl", "id": 50117, "text": "(2) When you apply for a credit card face -to -face visa through the super counter, we will collect your name, ID card information, credit card number, front and back photos of ID cards, and subject qualification certification.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you apply for a credit card face -to -face sign, collect your name, ID card information, credit card number, front and back photos of ID cards, and subject qualification certification certificate."}
{"task": "rw_38.jsonl", "id": 50118, "text": "(3) When you use the super counter to apply for credit card activation and set the password business, we will collect your mobile phone number, credit card number, verification code, payment password, and billing address.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your mobile phone number, credit card number, verification code, payment password, and bill mailing address to apply for credit card activation and setting password business."}
{"task": "rw_38.jsonl", "id": 50119, "text": "(4) You can check the application progress of the credit card through personal online banking, personal palm silver, and WeChat public account of Agricultural Bank of China.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50120, "text": "When you check your credit card application progress, we will collect your ID number, mobile phone number, and verification code to verify your identity.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you check your credit card application progress, collect your ID number, mobile phone number, and verification code to verify your identity."}
{"task": "rw_38.jsonl", "id": 50121, "text": "(5) When you use the super counter to apply for a credit card receiver business, in order to provide you with corresponding services, we will collect your name, ID card information, credit card number, and front and back photos of ID cards.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your name, ID card information, credit card number, and front and back photos of ID cards to apply for your credit card receiver business."}
{"task": "rw_38.jsonl", "id": 50122, "text": "(6) You can use credit card transfers through official channels such as personal palm bank \"cash out\" function, personal online banking \"transfer\" and \"transfer\" function.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50123, "text": "To this end, we need to collect your payee's name and receipt account.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your payee's name and receipt account to provide you with a credit card transfer function."}
{"task": "rw_38.jsonl", "id": 50124, "text": "(7) You can enjoy the services such as shopping and points of gift replacement through personal channels such as personal online banking, personal palm silver, and agricultural bank applet. If you buy or exchange physical gifts, we will collect your name, mobile phone number, mobile phone number, mobile phone number, and mobile phone numberDelivery address;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your name, mobile phone number, and sending address in order to send you physical objects."}
{"task": "rw_38.jsonl", "id": 50125, "text": "If you buy or exchange virtual card coupons, we will collect your mobile phone number.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you buy or redeem virtual card coupons, you will collect your mobile phone number."}
{"task": "rw_38.jsonl", "id": 50126, "text": "(8) When you participate in official channels such as personal banks, Agricultural Bank of China WeChat public account, etc., in order to send you physical prizes, we need to collect your mobile phone number and contact address.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your mobile phone number and contact address in order to send you physical prizes."}
{"task": "rw_38.jsonl", "id": 50127, "text": "If the prize is a virtual product, we need to collect your mobile phone number to issue the reward (direct charging or card coupon).", "label": ["Important", "First Party Collection Information"], "rewrite": "If the prize is a virtual product, you need to collect your mobile phone number to distribute the reward (direct charge or card coupon)."}
{"task": "rw_38.jsonl", "id": 50128, "text": "(9) When you use your personal palm bank to \"borrow money\" for fun, we will collect your installment period and installment amount.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your installment period and installment amount so that you can use the \"Lending Easy Borrowing\"."}
{"task": "rw_38.jsonl", "id": 50129, "text": "(10) When you use the Credit Card Mall in the Capital and Credit Card Program for the Agricultural Bank of China, we need to collect the names of the consignee, mobile phone number, and receiving address.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect the names of the consignee, mobile phone number, and receiving address in order to provide you with shopping services."}
{"task": "rw_38.jsonl", "id": 50130, "text": "8. Private banking service:", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50131, "text": "When you use personal banks, online banking, counter, super counter, customer service hotline, customer manager or wealth consultant and other channels, use private banking contract services, wealth planning services, family inheritance services, asset allocation services, comprehensive financial services of listed companies, insuranceDuring the exclusive consultants and value -added services such as planning services, cross -border financial services, professional consulting services, medical and health services, business travel services, education and training services, customized tourism services, we will collect your name, gender, nationality, occupation, contact, contactMethods, contact address, certificate type, certificate number, property information, itinerary information, educational background information, the aforementioned information (if.).", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your name, gender, nationality, occupation, contact information, contact address, contact address, certificate type, document number, property information, itinerary information, educational background information, and the aforementioned information of the subsidiary applicants, thinking that you provide exclusive consultants and value -added services."}
{"task": "rw_38.jsonl", "id": 50132, "text": "Among them, when conducting private bank asset allocation services, we will conduct asset allocation analysis according to your product holding situation in our bank, and may collect your out -of -bank assets in order to provide asset allocation services for your full assets.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The asset allocation analysis is performed based on your product holding position, and your out -of -bank assets may be collected in order to provide asset allocation services."}
{"task": "rw_38.jsonl", "id": 50133, "text": "9. Super counter service:", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50134, "text": "In order to provide you with service and ensure your service security, when you apply for services at the \"Super counter\", according to laws and regulations and regulatory requirements, you may need to provide or authorize our bank to collect the user information required for the corresponding services.Including your name, identity information, certificate type, certificate number, front and back of the certificate, bank card number/account, mobile phone number, property information, communication information, fingerprint images, signature handwriting to help you handle your business.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect information such as your name, identity information, certificate type, certificate number, front and back of the document, and think that you provide super counter services."}
{"task": "rw_38.jsonl", "id": 50135, "text": "Our bank may also perform validity verification of relevant information by verifying accounts/card passwords.", "label": ["Important", "Usage"], "rewrite": "The effective verification of the information is validized by verifying the account/card password."}
{"task": "rw_38.jsonl", "id": 50136, "text": "If you refuse to provide the information required for a certain function or service, you may not be able to use this part of the function or service, but this does not affect other functions or services of your normal use of the \"super counter\".", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50137, "text": "details as follows:", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50138, "text": "(1) Medium verification link: When you use our \"super counter\" to apply for business to use bank cards or passbooks, you need to provide or authorize our bank to collect the user information required for the corresponding services, including the bank card number/account number, Passbook account information, our bank conducts validity verification of relevant information by verifying the account/card password.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The medium verification link needs to collect the bank card number/account, passbook account information."}
{"task": "rw_38.jsonl", "id": 50139, "text": "Certificate number, validity period, issuing authority, date of birth, nationality, ethnicity, gender, and positive and negative images of documents.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The document verification link needs to collect personal names, types of documents, documents, validity periods, issuing agencies, birth date, nationality, ethnicity, gender, and positive and negative images of the documents."}
{"task": "rw_38.jsonl", "id": 50140, "text": "(3) Application book signing link: When you use our \"super counter\" to apply for business, you need to sign the business application form, you need to provide or authorize our bank to collect your fingerprint images and sign the handwriting information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The application signature section needs to collect your fingerprint images and signature handwriting information."}
{"task": "rw_38.jsonl", "id": 50141, "text": "10. Self -service equipment service:", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50142, "text": "In order to provide you with service and ensure your service security, when you apply for the service in the \"self -service equipment\" (including cash -based self -service equipment, self -service terminal, queuing call machine), you can use the account, password, certificate type, certificate number number, certificate numberVerify your identity and help you handle your business.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you are serving the \"self -service device\", you can verify your identity through account numbers, passwords, documents, and documents numbers."}
{"task": "rw_38.jsonl", "id": 50143, "text": "If you refuse to provide the information required for a function or service, you may not be able to use this part of the function or service.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50144, "text": "details as follows:", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50145, "text": "(1) Medium verification: When you use our \"self -service equipment\" to apply for a bank card or passbook, you need to provide or authorize our bank to collect the user information required for the corresponding services, including the bank card number/account number, andIn the passbook information information, we travel to the relevant information to verify the effective information of the relevant information by verifying the account/card password.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When using \"self -service equipment\" to handle business, the medium verification requires collecting bank card numbers/account, passbook account information."}
{"task": "rw_38.jsonl", "id": 50146, "text": "(2) Face -brushing business: When you use our \"self -service equipment\" to handle face -brushing, withdrawal, transfer, and handling without a card -free deposit business, our bank will collect your on -site mobile phone number or certificate type/certificate number, use it withFor relevant information validity verification;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When using \"self -service equipment\" to handle face -brushing, withdrawal, transfer, and transfer of card -free deposits, you need to collect on -site mobile phone numbers or certificates type/document numbers."}
{"task": "rw_38.jsonl", "id": 50147, "text": "When you apply for transfer, card -free and discounted deposit business, we also need to collect accounts accounts and account information information help to handle business.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you apply for transfer, card -free and discounted deposit business, you need to collect accounts and information information for the receiving party to help handle the business."}
{"task": "rw_38.jsonl", "id": 50148, "text": "11. Digital RMB service:", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50149, "text": "When you use digital RMB services, our bank will protect your customer information in accordance with the relevant provisions of the \"Protection Policy of the Agricultural Bank of China Digital Renminbi Wallet\".", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50150, "text": "12. Other services:", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50151, "text": "(1) The \"small secretary\" of the Agricultural Bank of China provides you with exclusive intelligent reminder services. To this end, we need to collect your payment records, credit card bill information, loan information, property information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your payment records, credit card bill information, loan information, property information, thinking that you provide intelligent reminder services."}
{"task": "rw_38.jsonl", "id": 50152, "text": "(2) You can make an appointment for value -added services through personal online banking. To this end, we need to collect your name, mobile phone number, ID number and ID information, SMS verification code, and communication information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your name, mobile phone number, ID number and ID information, SMS verification code, and communication information, so that you provide a value -added service appointment."}
{"task": "rw_38.jsonl", "id": 50153, "text": "(3) You can use the Agricultural Bank of China microservice mini -programs for real -time number. We will collect your name and ID number and follow the Tencent's authorization strategy to obtain your geographical location information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your name, ID number, and geographical location information so that you can get a real -time number."}
{"task": "rw_38.jsonl", "id": 50154, "text": "(4) When you use the peripheral discounts and outlets provided by your personal palm silver, we will collect your location information to provide you with the corresponding service you are located.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your location information to provide you with the corresponding service at your location."}
{"task": "rw_38.jsonl", "id": 50155, "text": "When you use the outlet reservation service provided by the Agricultural Bank of China microservice mini program, we will collect your name, ID number and ID information, mobile phone number, SMS verification code, communication information, and follow the Tencent authorization strategy to obtain your acquisitionGeographical location.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your name, ID number and ID information, mobile phone number, SMS verification code, communication information, and geographical location to provide outlet appointment services."}
{"task": "rw_38.jsonl", "id": 50156, "text": "(5) When you use voice customer service, online customer service (palm banking, online banking, WeChat public account and other online channels, emails), new media customer service (Weibo, WeChat) and other long -range bank customer service channels to seek services, we may be specific according to the service.Matters and remote banking customer service specific channels collect your name, gender, occupation, residence, or work unit address, contact information, identity documents, or identity documents, numbers, and validity periods, financial account information, and seeking services with youRelated other information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the customer service channel of the remote banking to seek services, collect your name, gender, occupation, residence, or work unit address, contact information, identity documents or identity documents according to specific mattersAnd other information."}
{"task": "rw_38.jsonl", "id": 50157, "text": "(2) Provide you in product and/or services in products we actively collect and use.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50158, "text": "In order to meet the basic requirements of laws and regulations and provide services, ensure your account security and system operation security, and more accurately prevent fraud from fishing websites. We will collect the following information that you generate in the process of using our service to judge your accountRisks and control credit risks, guarantee us to provide services to you normally, analyze and statistical traffic of our system problems, and check it when you choose to send an abnormal information to us.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect the information that you generate during the use of our service to judge account risks and control credit risks to ensure normal provision of services."}
{"task": "rw_38.jsonl", "id": 50159, "text": "This information includes:", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50160, "text": "1. Log information:", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50161, "text": "When you use our personal online banking, personal palm bank, super counter, WeChat public account of Agricultural Bank of China, WeChat Mini Program Products and/or services, we will collect the details of your service as a network log and transaction flowing waterThe log is saved.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the details of your service using our services and save it as a network log and transaction flow log."}
{"task": "rw_38.jsonl", "id": 50162, "text": "The network log includes the language you use, the time for access, and the webpage records, operating systems, software information, and login IP information of your product and/or service;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50163, "text": "Trading flow logs include transaction amount, transaction date, transaction time, trading currency, trading card number, trading type, transaction terminal, transaction results, document information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50164, "text": "2. Equipment information:", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50165, "text": "When you use the personal online banking, personal palm banking, super counter, WeChat public account of Agricultural Bank of China, WeChat Mini Program products and/or services, in order to provide you with corresponding services to ensure your account security and transaction security,Our travel will collect your IP address, device model, device MAC address, international mobile device recognition code (IMEI), Android, ID, international mobile user recognition code (IMSI), operating system type and version number.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your IP address, device model, device MAC address, international mobile device recognition code, Android ID, international mobile user identification code, operating system type and version number to ensure your account security and transaction security."}
{"task": "rw_38.jsonl", "id": 50166, "text": "3. Search records:", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50167, "text": "When you use personal palm silver, in order to provide you with fast search services, we need to collect your historical search records. If you use voice search functions, we will also collect your voice information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your historical search records in order to provide convenient search services. If you use voice search functions, collect your voice information."}
{"task": "rw_38.jsonl", "id": 50168, "text": "4. Location information:", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50169, "text": "When you use our product and/or service process, we will collect your location information based on the requirements of relevant laws and regulations or to recommend convenient service outlets for personalized recommendations, advertising, life and other columns to facilitate youUse outlet query, outlet appointment, online number pickup, business status query, UnionPay discount, local discount, living payment, agricultural bank insurance, and personal palm silver \"life\" column.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your location information so that the convenient service outlets are recommended."}
{"task": "rw_38.jsonl", "id": 50170, "text": "(3) The right to call for the right of the silver equipment of our bank.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50171, "text": "Under certain scenarios or services, our personal palm silver and Agricultural Bank of China credit card applets may call some of your equipment permissions (see the table below for details). We will obtain you alone in the form of pop -up windows before calling the corresponding permissions.Agree, you can choose to close part or all permissions in the setting function of the device, so as to refuse our bank to collect corresponding personal information.", "label": ["Permission Acquisition", "Important", "Edit/Control"], "rewrite": "Personal silver and agricultural bank credit card applets may call some of your equipment permissions, and obtain your consent separately before calling for the first time. You can choose to close part or all permissions."}
{"task": "rw_38.jsonl", "id": 50172, "text": "Effects of device permissions application scenarios/service call rights closed/refusal permissions retrieved", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50173, "text": "The address book, mobile phone recharge, convenient for you to enter the recharge mobile phone number, you need to manually enter the recharge mobile phone number", "label": ["Permission Acquisition", "Important"], "rewrite": "Call the communication recording authority, so that you can enter the recharge mobile phone number."}
{"task": "rw_38.jsonl", "id": 50174, "text": "Camera, face recognition, sweeping, bank card recognition, ID card recognition, registration, application for credit card (including main card application), appointment of music points (including scenes and fun), special installment application (car \\ car \\Home improvement \\ parking space \\ education), credit card activation, ETC application, face recognition verification identity, scanning QR code, bank card recognition, ID card recognition, verification and verification identity, prevent counterfeiting application, call face recognition transactions, sweep sweeping, Bank card recognition, ID card recognition and other applications cannot be used", "label": ["Permission Acquisition", "Important"], "rewrite": "Calling the camera permissions for face recognition verification identity, scanning QR code, bank card recognition, ID card recognition, verification and verification identity, and prevent counterfeiting applications."}
{"task": "rw_38.jsonl", "id": 50175, "text": "Microphone, kbao, voice search, which is convenient for you to use audio K treasure, voice search function, audio K treasure, voice search function cannot be used", "label": ["Permission Acquisition", "Important"], "rewrite": "Call the microphone permission to facilitate your use of audio K treasure and voice search function."}
{"task": "rw_38.jsonl", "id": 50176, "text": "Push (only iOS users), message push, push you information to you, you can't accept the news of our bank normally", "label": ["Permission Acquisition", "Important"], "rewrite": "Call the push permissions to push you information to you."}
{"task": "rw_38.jsonl", "id": 50177, "text": "Bluetooth, Bluetooth Kbao, Chongqing Civil Tong traffic card recharge, hardware wallet, connect customer mobile phones to third -party devices, and interact with third -party devices.", "label": ["Permission Acquisition", "Important"], "rewrite": "Call the Bluetooth authority to connect and interact with the customer's mobile phone with the third -party device."}
{"task": "rw_38.jsonl", "id": 50178, "text": "Storage (only Android users), application upgrades, sweeping, cloud flash payment, code scan payment, responding to the user screenshot, identify local album pictures, save pictures to the album, apply upgrade, sweep the local album pictures, save pictures to the picture to the picture to the picture to the picture to the picture to the picture,Functions such as albums cannot be used, and user screenshots cannot be adjusted online customer service", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "Call the storage permissions to identify local album pictures and save pictures to the album."}
{"task": "rw_38.jsonl", "id": 50179, "text": "Telephone (only Android users), login, message push, data acquisition analysis, obtain device recognition code to ensure the security of account login, and cannot obtain the device recognition code. For some existing customers, there may be situations that need to be activated when logging in.", "label": ["Permission Acquisition", "Important"], "rewrite": "Call the phone permissions and obtain the device recognition code to ensure the security of the account login."}
{"task": "rw_38.jsonl", "id": 50180, "text": "Check the WLAN status, network request, to obtain the network status of the mobile phone, and realize the network request and file download strategy in different network states. Under the WiFi network, you cannot download updated resource files in advance.", "label": ["Permission Acquisition", "Important"], "rewrite": "Check the WLAN status to obtain the network status of the mobile phone and realize the network request and file download strategy in different network status."}
{"task": "rw_38.jsonl", "id": 50181, "text": "Search the current running program, online customer service, to determine whether it is the \"online customer service\" interface to determine whether to pop up the \"contact customer service\" small window, and the small window of \"contact customer service\" cannot be popped up normally", "label": ["Permission Acquisition", "Important"], "rewrite": "Retrieving the current running program is used to determine whether it is an \"online customer service\" interface to determine whether the \"contact customer service\" small window pops up."}
{"task": "rw_38.jsonl", "id": 50182, "text": "Starting from the start, message push, used to start message push services, when the application is not started, the push message cannot be received", "label": ["Permission Acquisition", "Important"], "rewrite": "Open the self -boot to start the message push service."}
{"task": "rw_38.jsonl", "id": 50183, "text": "Allowing functions such as fingerprint, fingerprint login, fingerprint payment for fingerprint recognition login and fingerprint recognition payment.", "label": ["Permission Acquisition", "Important"], "rewrite": "\"Allowing fingerprints\" for fingerprint recognition login and fingerprint recognition payment."}
{"task": "rw_38.jsonl", "id": 50184, "text": "Cut the shear, micro -treasure hunt, transfer, used for password recognition, transfers fast jumping function, cannot copy passwords, bank card numbers", "label": ["Permission Acquisition", "Important"], "rewrite": "Call the scissorship permission for password recognition and speed jumping function."}
{"task": "rw_38.jsonl", "id": 50185, "text": "Location, nearby outlets, preferential merchants, and life services, obtain your geographical location information, does not affect normal use, may not be able to provide position -based services -based services", "label": ["Permission Acquisition", "Important"], "rewrite": "Call the location permissions to get your geographical location information."}
{"task": "rw_38.jsonl", "id": 50186, "text": "NFC permissions, Chongqing Citizen's traffic card recharge, hardware wallet, Yangcheng Tong traffic card recharge, used to obtain equipment NFC capabilities, interact with NFC devices, cannot connect to the device through NFC capabilities", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "Call NFC permissions to obtain the NFC ability of the device and interact with NFC devices."}
{"task": "rw_38.jsonl", "id": 50187, "text": "Create desktop shortcut boards, small programs add desktop shortcuts, small programs add desktop shortcuts, small programs cannot add desktop shortcuts", "label": ["Permission Acquisition", "Important"], "rewrite": "Call the desktop shortcut board to add desktop shortcuts for applets."}
{"task": "rw_38.jsonl", "id": 50188, "text": "Inpad, other applications will be installed and applied to upgrade the application.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50189, "text": "(4) Our bank obtains your personal information from a third party.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50190, "text": "In the process and/or service process you need to provide you, we may use the financial credit information basic database of the People's Bank of China, public security and judicial organs, tax authorities, market supervision and management agencies, financial regulatory authorities, provident fund management agencies, Social insurance management institutions, academic qualifications information management institutions, related industry associations and industry self -regulatory organizations, qualified credit reporting service agencies, etc., such as third -party institutions with relevant information query service qualifications, inquire, print, use, verify the verification according to lawAnd preserve your relevant information, including personal information, credit reports, public utilities, taxation conditions, loan conditions, guarantee conditions, account information, account information, transaction information, asset information.", "label": ["Important", "First Party Collection Information"], "rewrite": "In the process of providing products or services, we may inquire, print, use, verify, and save your relevant information through legal information query service qualifications with relevant information query service qualifications."}
{"task": "rw_38.jsonl", "id": 50191, "text": "When you log in to the WeChat public account of China Agricultural Bank of China and the Agricultural Bank of China MSA, in order to verify, bind WeChat identity and the identity of the silver, we will follow Tencent's authorization strategy to collect your avatars, nicknames, Openid, Unionid, so as to thusProvide you with the relevant services of the WeChat public account of Agricultural Bank of China and microservice mini -programs.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your avatars, nicknames, Openid, Unionid to provide you with related services to the Agricultural Bank of China WeChat public account and microservice mini -programs."}
{"task": "rw_38.jsonl", "id": 50192, "text": "You generate and use the personal information on the WeChat public account of the Agricultural Bank of China and the Agricultural Bank of China, and the personal information provided by our bank in accordance with the agreement on this policy.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50193, "text": "As a developer, WeChat has promised not to collect, save, use or authorize others to use the aforementioned personal information for any purpose.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50194, "text": "In order to provide you with more complete and high -quality products and services, some of the electronic banking services you use may be directly provided by third -party service providers in its environment. At this time, we will not collect or share any personal information of your personal information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use part of the electronic banking provided by a third party, we will not collect or share any personal information of your personal information."}
{"task": "rw_38.jsonl", "id": 50195, "text": "The third party is not bound by this privacy policy. We recommend that you view the platform of third -party service providers and understand how they collect, use, and share your personal information based on their privacy policies.", "label": ["Important"], "rewrite": "Third parties are not bound by this privacy policy."}
{"task": "rw_38.jsonl", "id": 50196, "text": "(5) How can our personal information use your personal information.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50197, "text": "1. Use the financial products or services of our travel to you, and use it to improve these products or services to identify and verify your identity, approval, management, processing, execution or implementation of transactions you require or authorize.", "label": ["Important", "Usage"], "rewrite": "Use your personal information to provide you with financial products or services and use your personal information to improve these products or services."}
{"task": "rw_38.jsonl", "id": 50198, "text": "Bringing, corruption, tax evasion, fraud, etc.).", "label": ["Important", "Usage"], "rewrite": "Perform your bank's compliance responsibility and use your personal information."}
{"task": "rw_38.jsonl", "id": 50199, "text": "3. During our trip to you, you authorize our bank to continue to collect and use your information.", "label": ["Important", "Usage"], "rewrite": "During our trip to you to provide you with financial services, you authorize our bank to continue to collect and use your information."}
{"task": "rw_38.jsonl", "id": 50200, "text": "When you cancel the service, we will stop collecting your relevant personal information, but in accordance with laws, regulations and regulatory requirements, we will continue to use business information archiving, auditing, supervision cooperation, performance of anti -money laundering and sanctionsYour related personal information.", "label": ["Edit/Control", "Usage", "Important"], "rewrite": "After the cancellation service, stop collecting relevant personal information, but continue to use your relevant personal information collected in the fields of business information archiving, auditing, supervision cooperation, and performing anti -money laundering and sanctions regulations."}
{"task": "rw_38.jsonl", "id": 50201, "text": "4. In order to improve your product or service experience, or to prevent risks, our bank will summarize, analyze, and process the service usage, but this information will not include any identity information information.", "label": ["Important", "Usage"], "rewrite": "Summary, statistical analysis, and processing of service usage will not include any identity information information."}
{"task": "rw_38.jsonl", "id": 50202, "text": "5. In order to let you know the situation of using our bank's financial products or services or to make you learn more about our travel service, our bank may send you a service status notification and the commercial information of related products or services.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50203, "text": "6. What do you authorize and other uses of law and legal permission.", "label": ["Usage"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50204, "text": "(6) The exception of authorization to collect and use your personal information.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50205, "text": "According to relevant laws and administrative regulations, in the following exceptions, even if you have not obtained your consent, our bank may still collect and use your personal information:", "label": ["Important", "First Party Collection Information"], "rewrite": "According to relevant laws and administrative regulations, in the following exceptions, even if you have not obtained your consent, our bank may still collect and use your personal information:"}
{"task": "rw_38.jsonl", "id": 50206, "text": "1. In order to establish and fulfill your contract as a party as a party;", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to set up and fulfill your collection and use information for the contract as a party, no need to solicit authorization."}
{"task": "rw_38.jsonl", "id": 50207, "text": "2., related to our obligation to perform laws and regulations and regulatory regulations;", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to fulfill the statutory duties or the collection and usage information necessary for the statutory volunteer, there is no need to solicit authorization consent."}
{"task": "rw_38.jsonl", "id": 50208, "text": "3. In order to deal with emergencies, or in urgent situations to protect the health and property safety of natural people;", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to cope with emergencies, or in urgent cases to protect the life and health of natural persons and the necessary collection and use information, no need to solicit authorization."}
{"task": "rw_38.jsonl", "id": 50209, "text": "4. In addition to your explicit rejection, collect and use your own or other legal personal information in accordance with the law in accordance with the law.", "label": ["Important", "First Party Collection Information"], "rewrite": "In accordance with laws and regulations, personal information is processed by individuals or other legal disclosure within a reasonable range, and no authorization consent is required."}
{"task": "rw_38.jsonl", "id": 50210, "text": "5. Other circumstances stipulated in laws and administrative regulations.", "label": ["Important", "First Party Collection Information"], "rewrite": "Other collection and use information stipulated in laws and regulations does not need to solicit authorization."}
{"task": "rw_38.jsonl", "id": 50211, "text": "If we collect and use your personal information that you have disclosed will have a significant impact on your personal rights and interests, you will obtain your consent in accordance with the law.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you collect and use your personal information, you will have a significant impact on your personal rights and interests, and your consent will be obtained in accordance with the law."}
{"task": "rw_38.jsonl", "id": 50212, "text": "If you collect or use your personal information outside the above situation, we will fully explain to you the purpose, use, content, and scope of the collection and use of your relevant information, and obtain your consent or authorization in advance.", "label": ["Data Security", "First Party Collection Information"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50213, "text": "Please understand that the functions and services we provide to you are constantly updated and developed. If a function or service is not in the aforementioned and collected your information, we will use page prompts, interactive processes, website announcements, etc.Explain the content, scope and purpose of information collection to you, and obtain your consent.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "If a function or service is not collected in the aforementioned instructions and your information is collected, we will explain to you through page prompts, interaction processes, website announcements, etc., and obtain your consent."}
{"task": "rw_38.jsonl", "id": 50214, "text": "2. How can our trip use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50215, "text": "(1) Cookie.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50216, "text": "To ensure the normal operation of the service, our will store small data files named Cookie on your computer or mobile devices.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50217, "text": "Cookie usually contains identifiers, site names, and some numbers and characters.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50218, "text": "With the help of cookies, the website can verify the correctness of your input information (such as the mobile phone verification code) and prevent you from repeating the information (such as the verification code) to analyze the number of visitors and the general use of the website.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "With the help of cookies, the website can verify your input information and analyze the number of visitors and the general use of the website."}
{"task": "rw_38.jsonl", "id": 50219, "text": "You can manage or delete Cookie according to your preferences.", "label": ["Important", "Edit/Control"], "rewrite": "You can manage or delete Cookie according to your preferences."}
{"task": "rw_38.jsonl", "id": 50220, "text": "You can clear all the cookies saved on the computer, and most of the network browsers have the function of preventing cookies.", "label": ["Important", "Edit/Control"], "rewrite": "You can clear all the cookies saved on the computer."}
{"task": "rw_38.jsonl", "id": 50221, "text": "But if you do this, you need to change your settings when you visit our website.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50222, "text": "The \"help\" part in most browser tools will tell you how to prevent your browser from accepting new cookies, how to make your browser notify you or how to completely close cookies when you receive a new cookie.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50223, "text": "In addition, you can turn off or delete similar data (such as Flash, Cookie) by changing the settings of the browser additional program, or to delete the browser additional program.", "label": ["Important", "Edit/Control"], "rewrite": "You can turn off or delete similar data used by the browser additional program, or to delete the browser additional program through the webpage of the provider."}
{"task": "rw_38.jsonl", "id": 50224, "text": "But this move may affect your safe access to our website and the services provided by our bank.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50225, "text": "(2) Website beacon and pixel label.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50226, "text": "In addition to Cookie, our bank will also use other similar technologies such as website beacons and pixel labels on the website.", "label": ["Important", "First Party Collection Information"], "rewrite": "In addition to Cookie, our bank will also use other similar technologies such as website beacons and pixel labels on the website."}
{"task": "rw_38.jsonl", "id": 50227, "text": "For example, the email you send to you may contain a link to the URL of the content of the content of our website.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50228, "text": "If you click the link, our bank will track this click to help our bank understand your product or service preference and improve customer service.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you click the link we send, our bank will track this click."}
{"task": "rw_38.jsonl", "id": 50229, "text": "Website beacon is usually a transparent image embedded in a website or email.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50230, "text": "With the pixel labels in emails, we can know whether the email is opened.", "label": ["Important", "First Party Collection Information"], "rewrite": "With the pixel labels in emails, we can know whether the email is opened."}
{"task": "rw_38.jsonl", "id": 50231, "text": "If you do not want your activities to be tracked in this way, you can pass the Cookie withdrawal at any time.", "label": ["Important", "Edit/Control"], "rewrite": "If you do not want your activities to be tracked in this way, you can pass the Cookie withdrawal at any time."}
{"task": "rw_38.jsonl", "id": 50232, "text": "(3) Do Not Track (Do not track).", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50233, "text": "Many network browsers have DO, not, track features, which can publish Do, not, track requests to the website.", "label": ["Important", "Edit/Control"], "rewrite": "Do Not Track function can release the DO Not Track request to the website."}
{"task": "rw_38.jsonl", "id": 50234, "text": "At present, the major Internet standard organization has not yet established relevant policies to stipulate how websites should respond to such requests.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50235, "text": "But if your browser enables Do, Not, Track, then all our websites will respect your choice.", "label": ["Important", "Edit/Control"], "rewrite": "The Do Not Track used by your browser is applicable to all our websites."}
{"task": "rw_38.jsonl", "id": 50236, "text": "3. How does our trip store and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50237, "text": "(1) The situation where our personal information is stored.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50238, "text": "1. The personal information collected and generated in the territory of the People's Republic of China will be stored in the People's Republic of China.", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in domestic operations will be stored in China."}
{"task": "rw_38.jsonl", "id": 50239, "text": "But in order to handle cross -border business, your personal information may need to be transferred abroad.", "label": ["Data Retention", "Important"], "rewrite": "Your personal information may need to be transferred abroad to handle cross -border business."}
{"task": "rw_38.jsonl", "id": 50240, "text": "In this case, our guild will be implemented in accordance with the law and inform you that the names or names, contact information, processing purpose, processing methods, personal information types, and the way you exercise the rights prescribed by the law to the overseas receiving party andProcedures and other matters, and get your individual consent.", "label": ["Data Retention", "Important"], "rewrite": "When your personal information is out of the country, you will inform you of the situation of the overseas receiver and obtain your separate consent."}
{"task": "rw_38.jsonl", "id": 50241, "text": "Our bank will take effective measures to protect your personal information. For example, before cross -border data transfer, you can keep the foreign institutions confidentially through agreements, verification and other measures.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "Cross -border data transfer requires foreign institutions to keep in confidentiality for your information through measures, verification and other measures."}
{"task": "rw_38.jsonl", "id": 50242, "text": "2. Our bank only determines the longest storage period for your personal information and the storage period of your logs only in the minimum time limit for the purpose of the purpose of this policy and the minimum time limit for the purpose of this policy.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "Generally, your personal information is retained within the time limit required to achieve service purposes, unless the law has other requirements."}
{"task": "rw_38.jsonl", "id": 50243, "text": "When the data preservation period is exceeded, our bank will delete or processes your information.", "label": ["Data Retention", "Important"], "rewrite": "When the data preservation period is exceeded, our bank will delete or processes your information."}
{"task": "rw_38.jsonl", "id": 50244, "text": "For example: mobile phone number: When you need to use personal palm silver service, our bank needs to keep your mobile phone number to ensure that you use the service normally. When you cancel your personal silver account, our bank will delete the corresponding information of the channel;", "label": ["Data Retention", "Important"], "rewrite": "When you cancel your personal silver account, our bank will delete the corresponding information of the channel."}
{"task": "rw_38.jsonl", "id": 50245, "text": "(2) Security measures to protect your personal information taken by our trip.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50246, "text": "Our banks have used security measures that meet the industry standards to protect your personal information, prevent data from being unauthorized, replicated, publicly disclosed, used, modified, transmitted, damaged or lost.", "label": ["Important", "Data Security"], "rewrite": "Use security protection measures that meet industry standards to protect your personal information and prevent data leakage."}
{"task": "rw_38.jsonl", "id": 50247, "text": "For example: we will use encryption technology to ensure the confidentiality of the data;", "label": ["Important", "Data Security"], "rewrite": "Use encryption technology to ensure the confidentiality of data."}
{"task": "rw_38.jsonl", "id": 50248, "text": "Our guilty uses a trusted protection mechanism to prevent data from being maliciously attacked;", "label": ["Important", "Data Security"], "rewrite": "Using a trusted protection mechanism to prevent data from being maliciously attacked."}
{"task": "rw_38.jsonl", "id": 50249, "text": "Our association deploys the access control mechanism, strictly restrict access to access, and systematically monitor information access and processing behavior to ensure that only authorized personnel can access personal information;", "label": ["Important", "Data Security"], "rewrite": "Deploy access control mechanisms and strictly restrict access to access."}
{"task": "rw_38.jsonl", "id": 50250, "text": "And our guild organize safety and privacy protection training courses, strengthen employees' awareness of protecting the importance of personal information, and ask relevant staff to sign a confidentiality agreement.", "label": ["Important", "Data Security"], "rewrite": "Safe safety and privacy protection training courses, and ask relevant staff to sign a confidentiality agreement."}
{"task": "rw_38.jsonl", "id": 50251, "text": "If all or part of the electronic banking business provided by our bank is stopped operation, the relevant products or services of our bank will inform you through the announcement and other forms.Delete or processes personal information to protect your personal information security.", "label": ["Important", "Data Security"], "rewrite": "If all or part of the electronic banking business stops operation, our bank will inform, at the same time stop collecting personal information, delete or processes the personal information of the holding."}
{"task": "rw_38.jsonl", "id": 50252, "text": "If all or part of the electronic banking business interruption is caused by various or some electronic banks due to various reasons such as technical faults, network attacks, natural disasters and accidents, and human factors, our bank will take emergency treatment and restoration measures to respond to restore services as soon as possible.", "label": ["Important", "Data Security"], "rewrite": "If all or part of the electronic banking business is interrupted, our bank will take emergency disposal and restoration measures to respond to restore services as soon as possible."}
{"task": "rw_38.jsonl", "id": 50253, "text": "If our bankruptcy and unsecured party will delete the personal information held.", "label": ["Important", "Data Security"], "rewrite": "If our bankruptcy and unsecured party will delete the personal information held."}
{"task": "rw_38.jsonl", "id": 50254, "text": "。", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50255, "text": "At present, we have passed the evaluation and filing of national network security level protection. In terms of information security, the data center has reached the requirements of ISO27001 certification standards and obtained corresponding certification.", "label": ["Important", "Data Security"], "rewrite": "We have passed the evaluation and filing of national network security level protection, and the data center of information security has met the requirements of ISO27001 certification standards."}
{"task": "rw_38.jsonl", "id": 50256, "text": "Our bank will try our best to ensure the security of personal information.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50257, "text": "At the same time, please be sure to keep your account login and other identity elements.", "label": ["Important", "Data Security"], "rewrite": "Please keep your account login and other identity elements well."}
{"task": "rw_38.jsonl", "id": 50258, "text": "Please use complex passwords to help us guarantee your account security.", "label": ["Important", "Data Security"], "rewrite": "Please use complex passwords to help us guarantee your account security."}
{"task": "rw_38.jsonl", "id": 50259, "text": "When you use our travel service, our will recognize your identity through your login name and other identity elements.", "label": ["Important", "Data Security"], "rewrite": "When you use our service, you will identify your identity through your login name and other identity elements."}
{"task": "rw_38.jsonl", "id": 50260, "text": "Once you leak the aforementioned information, you may suffer and have legal consequences that are unfavorable to you.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50261, "text": "If you find that the account login name and/or other identity elements may be leaked, please contact our bank immediately so that we can take corresponding measures in time to avoid or reduce related losses.", "label": ["Important", "Data Security"], "rewrite": "If the personal information discovered, please contact us immediately."}
{"task": "rw_38.jsonl", "id": 50262, "text": "If there is a personal information security incident unfortunately, our bank will take effective remedial measures in a timely manner in accordance with the requirements of laws and regulations to prevent the expansion of security incidents.", "label": ["Important", "Data Security"], "rewrite": "If a personal information security incident occurs, effective remedial measures will be taken to prevent the expansion of security incidents."}
{"task": "rw_38.jsonl", "id": 50263, "text": "Our bank will inform you of the incident -related situation in time by email, letter, telephone and/or push notification. It is difficult to inform you one by one, and our bank will publish a reasonable and effective way to publish an announcement.", "label": ["Important", "Data Security"], "rewrite": "The relevant situation of security incidents will be informed by mail, letter, telephone, push notification, etc. When it is difficult to inform one by one, it will issue an announcement."}
{"task": "rw_38.jsonl", "id": 50264, "text": "At the same time, our bank will actively report to the disposal of personal information security incidents in accordance with the requirements of the regulatory agency.", "label": ["Important", "Data Security"], "rewrite": "Report the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities."}
{"task": "rw_38.jsonl", "id": 50265, "text": "Fourth, how do our trip provide your personal information to the outside world", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50266, "text": "(1) Sharing.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50267, "text": "We will not share your personal information with companies, organizations and individuals other than our bank, except the following situations: except:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not share your personal information with companies, organizations and individuals other than our bank, except the following situations: except:"}
{"task": "rw_38.jsonl", "id": 50268, "text": "1. Shared when obtaining a separate consent or authorization:", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50269, "text": "After getting your individual consent, the guild will share the personal information within the scope of your authorization with other parties.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After getting your individual consent, share your personal information within the scope of your authorization."}
{"task": "rw_38.jsonl", "id": 50270, "text": "If the business needs to share your personal information to the outside world, before sharing, we will tell you the name or name, contact information, processing purpose, processing method, and personal information of the receiver of shared personal information, and get your separate consentExcept for laws and regulations.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you need to share personal information to the outside world, you will inform the receiver's name or name, contact information, processing purpose, processing methods, and personal information types in advance to obtain your separate consent, except for other provisions of laws and regulations."}
{"task": "rw_38.jsonl", "id": 50271, "text": "For example, other businesses other than the sharing situation disclosed by this policy need to share your personal information to the outside world. According to the requirements of relevant laws and regulations, our bank will clearly inform you of the relevant information sharing of personal information and obtain you to obtain you.Independent authorization or consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If the sharing of sharing disclosed in this policy will be notified separately and obtain your separate authorization or consent."}
{"task": "rw_38.jsonl", "id": 50272, "text": "2. Sharing in statutory situations:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Sharing under legal situation:"}
{"task": "rw_38.jsonl", "id": 50273, "text": "Our bank may share your personal information to the outside world in accordance with the regulations of laws and regulations, or in accordance with the mandatory requirements of the government authority.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "It may share your personal information to the outside world in accordance with the regulations of laws and regulations, or in accordance with the mandatory requirements of the government authority."}
{"task": "rw_38.jsonl", "id": 50274, "text": "3. Shared with authorized partners:", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50275, "text": "In order to achieve the purpose of privacy policies or provide services to you, our guild will share some of your personal information with other authorized partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to achieve the purpose of privacy policies or provide services to you, our guild will share some of your personal information with other authorized partners."}
{"task": "rw_38.jsonl", "id": 50276, "text": "For example, the payee, beneficiary, intermediary, exchanges and agency banks, securities exchanges, securities companies, etc. on behalf of you who act on behalf of you;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50277, "text": "Other financial institutions, industry associations, bank card organizations, credit rating institutions, credit reporting agencies, information service providers;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50278, "text": "Third -party asset management institutions that provide you with asset management services.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50279, "text": "Our bank will also cooperate with government agency platforms, such as sharing some of your personal information from relevant institutions such as social security, customs, taxes.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Our bank will also cooperate with government agency platforms to share some of your personal information from relevant institutions."}
{"task": "rw_38.jsonl", "id": 50280, "text": "Our bank will only share your personal information for legal, correct, and necessary purposes, and only share the necessary personal information that provides services.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "It will only share your personal information for legal, legitimate, and necessary purposes, and only share the necessary personal information that provides services."}
{"task": "rw_38.jsonl", "id": 50281, "text": "At the same time, our guild signed a rigorous confidentiality agreement with the partner, asking them to handle your personal information in strict accordance with our bank's instructions, this policy, and any other related confidentiality and security measures.Use shared personal information for any other purpose.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Signed a strict confidentiality agreement with the partner, requiring it to handle personal information in accordance with our explanation, this policy, and other confidentiality and security measures, and require it to not be used for any other use."}
{"task": "rw_38.jsonl", "id": 50282, "text": "If you refuse our bank and the partner to share the personal information collected by our bank when providing services, it may cause you to be unable to use the service in our bank.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you refuse to share the necessary personal information when providing services with the partner, it may cause you to be unable to use the service."}
{"task": "rw_38.jsonl", "id": 50283, "text": "(1) The issuer of agency sales of financial products:", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50284, "text": "These institutions are publishers who sell their financial products (such as funds, insurance, trusts, etc.).", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50285, "text": "In order to enable you to buy earlier financial products, we may share your personal identity information, personal property information (such as issuer's need), personal account information, and financial product transaction information to the issuer of agencies to sell financial products.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Share your personal identity information, personal property information, personal account information, and financial product transaction information to the issuer of financial products to sell financial products, so that you can buy financial products."}
{"task": "rw_38.jsonl", "id": 50286, "text": "The scope of sharing personal information is limited to the requirements of financial product issuers.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50287, "text": "(2) Cooperators of advertising and analysis services:", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50288, "text": "For advertising partners, our bank may provide it with information about its advertising coverage and effectiveness without providing your personal information, or the will be anonymous to deal with personal information, which will not recognize your personal.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50289, "text": "In order to better analyze the usage of our customers, our bank may provide data from the number of customers, regional distribution, and active situations to the service providers of analyzing data. HoweverStatistical information (such as \"25 -year -old men in Beijing, like to buy fund wealth management products\").", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "It may provide data such as the number of customers, regional distribution, and active situations to the service providers of analyzing data."}
{"task": "rw_38.jsonl", "id": 50290, "text": "(3) Suppliers, service providers and other partners providing technology, consulting, logistics and other services:", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50291, "text": "We may share your personal information to a third -party sharing of supporting and services to us, including providing us with infrastructure technology, data processing, credit approval, customer service and other institutions.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Share your personal information to the third parties that provide us with support and services."}
{"task": "rw_38.jsonl", "id": 50292, "text": "For example, when you apply for points for purchase and purchase activities through the online mall, provide you with services such as logistics delivery, order inquiry, after -sales service, customer support and other services, we may share your name, phone number, address sharing to service providers;", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Share your name, phone number, address, and address with service providers in order to provide logistics delivery, order inquiry, after -sales service, customer support and other services."}
{"task": "rw_38.jsonl", "id": 50293, "text": "In order to send an email or SMS push notification, we may share your name, mailbox or phone number with communication service providers;", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Share your name, mailbox or phone number with communication service providers in order to send emails or SMS push notifications."}
{"task": "rw_38.jsonl", "id": 50294, "text": "To provide you with maps and location -related services, we may share your location data to the map service provider.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Share your location data with map service providers in order to provide maps and location -related services."}
{"task": "rw_38.jsonl", "id": 50295, "text": "For another example, in order to further feel convenient services, we will establish a member information file library with the joint card partner, and may share member information with the joint card partner;", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Member information may be shared with joint card partners."}
{"task": "rw_38.jsonl", "id": 50296, "text": "We will also carry out post loan management with post -loan service agencies and legal service agencies, and may share your name, phone number, personal credit situation with post -loan service agencies and legal service agencies.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Share your name, telephone number, personal credit situation with post -loan service agencies and legal service agencies in order to conduct post -loan management."}
{"task": "rw_38.jsonl", "id": 50297, "text": "(4) Partner providing private bank exclusive services:", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50298, "text": "In order to provide private bank customers with a \"exclusive service\" function based on personal silver, we will provide your name, mobile phone number, and ID number to the corresponding service providers to provide you with functions such as service appointments and inquiries.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Provide your name, mobile phone number, and ID number to the corresponding service providers to provide you with functions such as service appointments and query."}
{"task": "rw_38.jsonl", "id": 50299, "text": "4. Sharing with our business agency and the Bank of Agricultural Bank of China:", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50300, "text": "Your personal information may be shared within the subsidiaries of our banks and the subsidiary of the Agricultural Bank of China.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Personal information may be shared within the subsidiaries of various business institutions and agricultural bank groups in our bank."}
{"task": "rw_38.jsonl", "id": 50301, "text": "This kind of sharing of the purpose of the purpose of this policy will be determined according to the specific business situation, including the purpose of submitting statistical information to the regulatory authorities according to the requirements, the needs of group risk management, and anti -money laundering and anti -fraud.It may share your personal identity information and account information within the subsidiaries of the business institutions and Agricultural Bank of China.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The scope of sharing personal information will be dependent on specific business conditions."}
{"task": "rw_38.jsonl", "id": 50302, "text": "Once the purpose of the processing of personal information is changed, your authorization consent will be solid again.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Once the purpose of the processing of personal information is changed, your authorization consent will be solid again."}
{"task": "rw_38.jsonl", "id": 50303, "text": "5. Sharing based on the interests of protecting our bank and its customers or the public:", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50304, "text": "In the scope of legal requirements or permits, in order to protect the interests, property or security of our customers or the public, it is necessary to provide your personal information to a third party.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the scope of legal requirements or permission, it is necessary to provide personal information to third parties in order to protect the interests of our banks and our customers or the public."}
{"task": "rw_38.jsonl", "id": 50305, "text": "6. We cooperate with the third -party software development tool package (SDK) service provider:", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50306, "text": "Software development toolkit refers to the collection of development tools for the development tools such as software packages, software frameworks, hardware platforms, and operating systems for specific software packages.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50307, "text": "In order to provide you with better services, some SDKs are embedded in the personal palm silver platform. These SDKs will collect your personal information in the scene of personal palm silver:", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "The SDK embedded in our personal palm silver platform will collect your personal information in the scenario of personal palm silver."}
{"task": "rw_38.jsonl", "id": 50308, "text": "SDK type plug -in name implementation function and scenario description SDK provider information personal information type calls The device permissions SDK directly collect personal information", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50309, "text": "Map SDK, Baidu, Gaode Map, provides positioning and map functions, Beijing Baidu Net News Technology Co., Ltd., Gaode Group, latitude and longitude, international mobile device identification code (IMEI), MAC address, location permission", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "Map SDK collects latitude and longitude, international mobile device recognition codes (IMEI), and MAC addresses to obtain location permissions to provide positioning and map functions."}
{"task": "rw_38.jsonl", "id": 50310, "text": "Data analysis SDK, in -line data collection components, provide client data collection and analysis function (user click analysis, mobile phone model, etc.), our bank, user click analysis, mobile phone model, operating system type, IMSI, Android, ID, location permissions, location permissions", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "Data analysis SDK collects user click analysis, mobile phone model, operating system type, IMSI, android ID, to obtain location permissions to provide client data collection analysis functions."}
{"task": "rw_38.jsonl", "id": 50311, "text": "Mobile phone number transmittance SDK, mobile phone number transparent authentication component, providing mobile phone number authentication services, Zhuowang Digital Technology (Shenzhen) Co., Ltd., China United Network Communication Co., Ltd., Century Dragon Information Network Co., Ltd., China Mobile Communications Group Co., Ltd., Mobile phone number, mobile phone operator certification information, IMSI, Android, ID", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "Mobile phone number transmission SDK collects mobile phone numbers, mobile operators certification information, IMSI, android ID to provide mobile phone number certification services."}
{"task": "rw_38.jsonl", "id": 50312, "text": "Chongqing Changtong Card recharge SDK, traffic card recharge component, provided to Chongqing Changtong Card holding card users through mobile phone NFC functions or offline shared Bluetooth machines for self -service online recharge bus cards, Chongqing Mobile Financial Co., Ltd.Position permissions", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "Chongqing Changchang Card recharge SDK, collect latitude and longitude, and obtain cameras, telephones, and location permissions in order to conduct self -service online recharge bus cards."}
{"task": "rw_38.jsonl", "id": 50313, "text": "Customer manager SDK, customer manager component, customer service, marketing communication, our travel, mobile phone number, user gender, no gender", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Customer manager SDK, collect mobile phone numbers, user gender information to provide customer service and marketing communication."}
{"task": "rw_38.jsonl", "id": 50314, "text": "Interactive center SDK, interactive center component, realize some transaction information, preferential messages and activity information push, Huawei offline information: provided by Huawei, Xiaomi offline news: provided by Xiaomi Technology Co., Ltd. provided by Xiaomi Technology Co., Ltd.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "The interactive center SDK collects offline messages to achieve some transaction information, preferential messages and activity information push."}
{"task": "rw_38.jsonl", "id": 50315, "text": "Privacy policy, mobile phone number, mobile phone model, IMSI, Android, ID, international mobile device recognition code (IMEI), change the configuration authority", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "Privacy policy collection mobile phone numbers, mobile models, IMSI, Android ID, international mobile device identification code."}
{"task": "rw_38.jsonl", "id": 50316, "text": "Electronic social security card SDK, electronic social security card components, electronic social security cards, status query, payment settlement, social security information query, etc., human resources and social security information center, face image information, ID information, mobile phone number, ID card, ID cardNumber, social security card number, bank card number, camera permission", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "Electronic social security card SDK collecting face image information, ID information, mobile phone number, ID number, social security card number, bank card number to obtain camera permissions to provide electronic social security cards, status query, etc."}
{"task": "rw_38.jsonl", "id": 50317, "text": "Baidu AI, SDK, Baidu voice recognition, face recognition, ID card OCR, bank card OCR, providing voice recognition function, face recognition function, ID card recognition and bank card number recognition function, Beijing Baidu Net News Technology Co., Ltd., customer number, ID information, bank card number, voice recognition information, face information, recording, camera permissions", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "Baidu AI SDK collects customer numbers, ID information, bank card number, voice recognition information, face information, and obtain camera permissions to provide voice recognition functions, face recognition functions, ID card recognition, and bank card number recognition functions."}
{"task": "rw_38.jsonl", "id": 50318, "text": "Online customer service SDK, online customer service component, provide online customer service -related services, our travel number, location information, trading ID, customer gender, sessionid, recording, camera permissions", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "Online customer service SDK collects mobile phone numbers, location information, trading ID, customer gender, sessionid to obtain recording and camera permissions to provide online customer service -related services."}
{"task": "rw_38.jsonl", "id": 50319, "text": "Equipment identification SDK, Ali device logo SDK, in order to accurately locate and analyze problems, Alibaba Cloud, International Mobile Device Recognition Code (IMEI), MAC address, device manufacturer, Androididid, CPU type, telephone permissions, telephone permissions", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "Equipment identification SDK collects international mobile device recognition codes (IMEI), MAC address, device manufacturers, Androidid, CPU types, obtain phone permissions to accurately locate and analyze problems."}
{"task": "rw_38.jsonl", "id": 50320, "text": "Xiaomi open platform message push SDK, message push component, provides Xiaomi offline notification function, Xiaomi Technology Co., Ltd., mobile model, IMSI, Android, ID, international mobile device recognition code (IMEI)", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Xiaomi open platform message push SDK to collect mobile phone models, IMSI, Android ID, and international mobile device recognition code (IMEI) to provide Xiaomi offline notification function."}
{"task": "rw_38.jsonl", "id": 50321, "text": "Fingerprint authentication SDK (only Android), fido fingerprint authentication component, verification fingerprint information, National Certification Technology Co., Ltd., fingerprint information, fingerprint permissions", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "Fingerprint authentication SDK collects fingerprint information to obtain fingerprint permissions to verify fingerprint information."}
{"task": "rw_38.jsonl", "id": 50322, "text": "Mobile phone shield, mobile shield authentication component, Huawei mobile phones based on specific security chips and independent systems, providing information certification services for transactions related to accounts, Beijing Jieqi Data Co., Ltd., mainly equipment information, including chip types, SEID, mobile phoneDevice model, EMUI version, device manufacturer, Androidid, Android version, CPU type", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Mobile shields collect equipment information to provide information certification services for transactions related to accounts."}
{"task": "rw_38.jsonl", "id": 50323, "text": "The car code SDK, the car code related components, provide UnionPay ride code services, China UnionPay, network permissions, change configuration permissions", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "Take the ride code SDK to obtain network permissions, change the configuration authority, and provide UnionPay ride code services."}
{"task": "rw_38.jsonl", "id": 50324, "text": "Voice recognition SDK, Lingxi Voice recognition related components, providing ASR services, companies,: HKUST Xunfei Co., Ltd., voice data, recording authority", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "Voice recognition SDK obtains recording authority collection of voice data to provide ASR services."}
{"task": "rw_38.jsonl", "id": 50325, "text": "ID cloud decoding SDK, ID cloud decoding related components, reading ID information based on NFC function, Tianye Rong Technology Co., Ltd., ID information, NFC permissions", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "The ID cloud decoding SDK collects ID information to obtain NFC permissions and read ID information based on NFC functions."}
{"task": "rw_38.jsonl", "id": 50326, "text": "Yun Cong's face SDK, face recognition related components, providing face recognition functions, Yuncong Technology Group Co., Ltd., customer number, ID information, customer name, facial image information, camera permissions, camera permissions", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "Yun obtains the camera authority from the face SDK, collects customer numbers, ID information, customer name, facial image information to provide face recognition function."}
{"task": "rw_38.jsonl", "id": 50327, "text": "SDK collects other circumstances (such as sharing personal information from the SDK service provider)", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50328, "text": "Identity verification sdk, the facial recognition component of the person, the face of the face, the transfer to the account, our travel, facial image information, camera permissions", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "Identity verification SDK obtains camera permissions, collects facial image information, and appoints for a face -to -face transfer to open an account."}
{"task": "rw_38.jsonl", "id": 50329, "text": "Identity verification SDK, Baidu company SDK, providing value -added services such as voice, face brushing, OCR, Beijing Baidu Net News Technology Co., Ltd., face image information, card number, ID information, camera authority, microphone rights permission", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "Identity verification SDK, Baidu company SDK acquisition of camera permissions, microphone permission collectors face image information, card number, ID information information, to provide value -added services such as voice, face brushing, OCR."}
{"task": "rw_38.jsonl", "id": 50330, "text": "WeChat login sharing SDK, row umap sharing components, query WeChat sharing in the bill, our bank, WeChat avatar and nickname information", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "WeChat login sharing SDK collection of WeChat avatar and nickname information to query WeChat sharing for returning orders."}
{"task": "rw_38.jsonl", "id": 50331, "text": "Static scanning SDK, row umap scanning component, return order verification, QR code scanning function, our travel authority", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "Static scanning SDK obtains the camera permissions in order to verify it."}
{"task": "rw_38.jsonl", "id": 50332, "text": "Yangcheng Tongyang City SDK Yangcheng Tong Electronic Card opened, recharge Yangcheng Tong physical card recharge mobile phone number, customer registration information NFC", "label": ["Usage", "Third Party Sharing/ Disclosure", "First Party Collection Information"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50333, "text": "Nantian OCR, Nantian ID card, bank card SDK, providing ID card recognition and information extraction, Yunnan Nantian Electronic Information Industry Co., Ltd., camera permissions, read and write permissions", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "Nantian OCR obtains camera permissions, read and write permissions to provide ID card recognition and information extraction."}
{"task": "rw_38.jsonl", "id": 50334, "text": "Hardware wallet sdk, hardware wallet SDK, providing hardware wallets to interact with client, Tiandi Rong Technology Co., Ltd., location information, location permissions, Bluetooth permissions, NFC, NFC", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "The hardware wallet SDK obtains position permissions, Bluetooth permissions, and NFC collection location information to provide hardware wallets to interact with the client."}
{"task": "rw_38.jsonl", "id": 50335, "text": "Our bank will only share your personal information for legal, correct, necessary, and clear purposes.", "label": ["Important", "Data Security"], "rewrite": "It will only share your personal information for legal, correct, necessary, and clear purposes."}
{"task": "rw_38.jsonl", "id": 50336, "text": "For companies, organizations, and individuals who share personal information with them, our guild and them signed strict confidentiality agreements with them, asking them to handle your personal information in accordance with our bank's instructions, this privacy policy, and other related confidentiality and security measuresEssence", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Our association signed a strict confidentiality agreement with the shared information party, requiring it to handle personal information in accordance with the instructions, privacy policies and confidentiality and security measures."}
{"task": "rw_38.jsonl", "id": 50337, "text": "Our bank will require our cooperation party to use personal information for any other purpose.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "The partners of our bank have no right to use the personal information they shared for any other purpose."}
{"task": "rw_38.jsonl", "id": 50338, "text": "If our bank discovers the requirements of the partners to violate the requirements of laws and regulations or to deal with our personal information with our bank, our bank will immediately ask it to stop related behaviors and take or take effective remedial measures (such as changing oral orders, recycling permissions, disconnecting network connections, disconnecting network connections) Control or eliminate security risks facing personal information;", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Our bank will immediately ask partners to violate laws and regulations or agreed partners to stop related behaviors and take remedial measures to control or eliminate security risks facing personal information."}
{"task": "rw_38.jsonl", "id": 50339, "text": "When necessary, our bank will lift the business relationship with relevant partners and requires them to delete personal information obtained from our bank in time.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Our bank will lift the business relationship with related partners and require them to delete personal information obtained from our bank in time."}
{"task": "rw_38.jsonl", "id": 50340, "text": "If you refuse our partner to share your personal information with our bank's collection with our bank when providing services, it may cause you to be unable to use the service in our bank.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50341, "text": "(2) Transfer.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50342, "text": "Our bank will not transfer your personal information to companies, organizations and individuals, except the following situations: except:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Our bank will not transfer your personal information to companies, organizations and individuals, except the following situations: except:"}
{"task": "rw_38.jsonl", "id": 50343, "text": "1. Get your individual consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Get your solo consent and may transfer your personal information."}
{"task": "rw_38.jsonl", "id": 50344, "text": "If the business needs to transfer your personal information to the outside world, before the transfer, our guild will inform you the name, name, contact information, processing purpose, processing method, and personal information of the receiver in accordance with the law, and get your own consent.Except for other regulations;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Before transferring your personal information, you will inform you of the receiving party information according to law and obtain your separate consent, except for other provisions of laws and regulations."}
{"task": "rw_38.jsonl", "id": 50345, "text": "2. According to laws and regulations or mandatory administrative or judicial requirements;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Transfer your personal information in accordance with laws and regulations or mandatory administrative or judicial requirements."}
{"task": "rw_38.jsonl", "id": 50346, "text": "3. In similar transactions such as mergers, acquisitions, asset transfer, etc., if the transfer of personal information is involved, our bank will inform you that the name or name and contact information of the receiver will be required to require the new company and organization that holds your personal informationContinue to be bound by this policy, otherwise our bank will ask the company and organization to re -obtain your clear consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When involving mergers, acquisitions, or bankruptcy liquidation, if personal information transfer is involved, it will be required to continue to be bound by the policy, otherwise it will request that it will re -solicit authorization consent."}
{"task": "rw_38.jsonl", "id": 50347, "text": "If our bank violates the provisions of laws and regulations or violates your agreement to share and transfer your personal information to the partners. When you ask for deletion of relevant information, our bank will immediately stop sharing and transfer, and notify the third parties to delete in time.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If our bank violates laws and regulations or shared personal information in violation of the agreement, if you ask for deletion of information, our bank will immediately stop sharing and transfer behaviors and notify the third parties to delete."}
{"task": "rw_38.jsonl", "id": 50348, "text": "(3) Public disclosure.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50349, "text": "Our bank will only disclose your personal information in the following situations:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Our bank will only disclose your personal information in the following situations:"}
{"task": "rw_38.jsonl", "id": 50350, "text": "1.Our will tell you the purpose and type of personal information. Those who involve sensitive information will also inform the content of sensitive information, and get your clear consent or authorization in advance;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You will tell you the purpose and type of personal information. Those who involve sensitive information will also inform the content of sensitive information, and get your clear consent or authorization in advance."}
{"task": "rw_38.jsonl", "id": 50351, "text": "2.According to the compulsory requirements of laws and regulations, legal procedures, litigation or government authorities, our bank may disclose your personal information publicly.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "According to the compulsory requirements of laws and regulations, legal procedures, litigation or government authorities, our bank may disclose your personal information publicly."}
{"task": "rw_38.jsonl", "id": 50352, "text": "For example, if our trip violates the provisions of laws and regulations or disclose your personal information publicly with your agreement, when you ask for the act of stopping disclosure, our bank will immediately stop public disclosure and issue a notice requesting the relevant receiver to delete the corresponding information to delete the corresponding informationEssence", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If our bank violates the provisions of laws and regulations or disclose personal information public information in violation of the agreement. When you ask for stopping, our bank will immediately stop disclosed publicly and issue notifications to request the relevant receiver to delete the corresponding information."}
{"task": "rw_38.jsonl", "id": 50353, "text": "(4) Exception of authorization consent.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50354, "text": "According to relevant laws and administrative regulations, in the following circumstances, we may share, transfer, and publicly disclose personal information, and do not need to obtain your authorization consent in advance:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "According to relevant laws and administrative regulations, in the following circumstances, we may share, transfer, and publicly disclose personal information, and do not need to obtain your authorization consent in advance:"}
{"task": "rw_38.jsonl", "id": 50355, "text": "1. To establish and fulfill your contract as a party as a party;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to establish and fulfill your contract, transfer, transfer or disclosure of your contract as a party, you do not need to solicit."}
{"task": "rw_38.jsonl", "id": 50356, "text": "2. What is related to the obligations of the implementation of laws and regulations and regulatory regulations;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Shared, transferred or disclosed the obligations related to the implementation of laws and regulations and regulatory regulations, and no authorization is required."}
{"task": "rw_38.jsonl", "id": 50357, "text": "3. In order to deal with emergencies, or in urgent situations to protect the health and property safety of natural people;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to cope with emergencies, or in urgent situations to protect the health of natural people and the must -sharing, transfer or disclosure of property security, no authorization is required."}
{"task": "rw_38.jsonl", "id": 50358, "text": "4. In addition to your clear rejection, share, transfer, publicly disclose your own or other legal personal information in accordance with the law, such as legal news reports, government information disclosure", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In addition to your explicit rejection, sharing, transfer, disclose your own or other legal personal information in accordance with the law in accordance with the law, and do not need to solicit authorization."}
{"task": "rw_38.jsonl", "id": 50359, "text": "5. Other circumstances stipulated in laws and administrative regulations.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The sharing or disclosure of other laws and regulations and other regulations does not need to be authorized."}
{"task": "rw_38.jsonl", "id": 50360, "text": "If our personal information that shared, transferred, and disclosed, it will have a significant impact on your personal rights and interests, and you will obtain your consent in accordance with the law.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you have a significant impact on your personal information that you have disclosed your personal information, your consent will be obtained in accordance with the law."}
{"task": "rw_38.jsonl", "id": 50361, "text": "5. How do you access and manage your personal information", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50362, "text": "In accordance with China's relevant laws and regulations and regulatory regulations, our bank guarantees your right to exercise your personal information. We will reply or respond to your right requests within 15 working days:", "label": ["Edit/Control", "Important"], "rewrite": "We will reply or respond to your rights request within 15 working days."}
{"task": "rw_38.jsonl", "id": 50363, "text": "(1) Visit your personal information and get your personal information copy.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50364, "text": "You have the right to access your personal information through channels such as our outlets, personal online banking, personal palm banking, telephone banking and other channels, except for laws and regulations.", "label": ["Important", "Edit/Control"], "rewrite": "You can access personal information through channels such as our outlets, personal online banking, personal palm bank, telephone banking, etc., except for laws and regulations."}
{"task": "rw_38.jsonl", "id": 50365, "text": "In personal online banking, you can access your personal information through \"My-My Information\" and check your gender, marriage status, ethnic, occupation, mailbox, unit name, and palm silver registered mobile phone number.", "label": ["Important", "Edit/Control"], "rewrite": "You can access your personal information through \"My-My Information\"."}
{"task": "rw_38.jsonl", "id": 50366, "text": "At the outlet, you can check personal information through artificial counters or super counter. Through the super counter, you can check your mobile phone number, fixed telephone, occupation, contact address, and personal tax status through \"Bank card business-data modification\".", "label": ["Important", "Edit/Control"], "rewrite": "You can query personal information through artificial counters or super counters."}
{"task": "rw_38.jsonl", "id": 50367, "text": "In personal palm silver, you can access your personal information through \"My-Security Center-Personal Information Maintenance\" to check your name, gender, nationality, certificate type, certificate validity period, mailbox, contact address, postal code, occupational information, occupational informationAnd copy some information.", "label": ["Important", "Edit/Control"], "rewrite": "You can access your personal information through \"My-Security Center-Personal Information Maintenance\"."}
{"task": "rw_38.jsonl", "id": 50368, "text": "If you request to transfer personal information to the specified personal information processing, if you meet the requirements of the national network information department, our bank will provide a way to transfer according to law.", "label": ["Important", "Edit/Control"], "rewrite": "If you request transfer personal information and meet the prescribed conditions, you will provide a way to transfer."}
{"task": "rw_38.jsonl", "id": 50369, "text": "(2) Correction and update your personal information.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50370, "text": "If you find that there is an error in your personal information processing, you have the right to ask us to make corrections.", "label": ["Important", "Edit/Control"], "rewrite": "You have the right to ask us to make correct personal information."}
{"task": "rw_38.jsonl", "id": 50371, "text": "Similarly, if you want to update your personal information, you can also update some of your personal information through electronic channels.", "label": ["Important", "Edit/Control"], "rewrite": "You can update some of your personal information by yourself through electronic channels."}
{"task": "rw_38.jsonl", "id": 50372, "text": "Before you modify your personal information, we will verify your identity. The specific modification channels are as follows:", "label": ["Important", "Edit/Control"], "rewrite": "Before you modify your personal information, we will verify your identity. The specific modification channels are as follows:"}
{"task": "rw_38.jsonl", "id": 50373, "text": "In personal online banking, you can modify your gender, marriage status, nation, occupation, mailbox, and unit name through \"My-My Information\".", "label": ["Edit/Control", "Important"], "rewrite": "You can modify your personal information through \"My-My Information\"."}
{"task": "rw_38.jsonl", "id": 50374, "text": "In personal online banking and personal palm silver, you can modify your family address, family postcode, family phone, unit name, unit address, unit postcode, unit phone, mobile phone number through \"credit card-setting-personal information\".", "label": ["Important", "Edit/Control"], "rewrite": "You can modify your family address, family postcode, family phone, unit name, unit address, unit phone, unit phone, mobile phone number through \"credit card-setting-personal information\"."}
{"task": "rw_38.jsonl", "id": 50375, "text": "In personal palm silver, you can modify your gender, mailbox, fixed telephone, contact address, postcode, and career information through 'my-customer information \".", "label": ["Edit/Control", "Important"], "rewrite": "You can modify your gender, mailbox, fixed telephone, contact address, postcode, professional information through 'my-customer information'."}
{"task": "rw_38.jsonl", "id": 50376, "text": "In the WeChat public account and agricultural bank applet of the Agricultural Bank of China, you can modify the relationship between your WeChat ID and palm silver identity through \"My account-switch account login\".", "label": ["Edit/Control", "Important"], "rewrite": "You can modify your WeChat ID and the identity of the silver identity through \"My Account-Switching Account Login\"."}
{"task": "rw_38.jsonl", "id": 50377, "text": "The information you filled in in your precious metal mall and poverty alleviation mall can be modified by logging in to your precious metal mall and poverty alleviation mall.", "label": ["Edit/Control", "Important"], "rewrite": "The information filled in in the precious metal mall and poverty alleviation mall can be modified by logging in to the precious metal mall and poverty alleviation mall."}
{"task": "rw_38.jsonl", "id": 50378, "text": "Please note that because your information in your precious metal mall and poverty alleviation mall is not associated with hand silver information, you have modified some personal information through personal palm silver. It is not of course equivalent to modifying your information in your precious metal mall and poverty alleviation mall.", "label": ["Important", "Edit/Control"], "rewrite": "Modifying some personal information through personal silver is not equal to the information in the precious metal mall and poverty alleviation mall."}
{"task": "rw_38.jsonl", "id": 50379, "text": "At the super counter, you can use the \"bank card business-data modification\" to modify your document validity period, birth date, certificate issuer, national, ethnicity, gender, mobile phone number, fixed telephone, occupation, contact address, personal tax status.", "label": ["Important", "Edit/Control"], "rewrite": "You can use the \"Bank Card Business-Data Modification\" to modify your certificate validity period, birth date, certificate issuer, nationality, ethnicity, gender, mobile phone number, fixed telephone, occupation, contact address, personal tax status."}
{"task": "rw_38.jsonl", "id": 50380, "text": "You can also submit a modification application through channels such as our outlets, customer service hotline (95599).", "label": ["Important", "Edit/Control"], "rewrite": "You can submit a modification application through channels such as our outlets, customer service hotline (95599)."}
{"task": "rw_38.jsonl", "id": 50381, "text": "Please note that you have modified your mobile phone number through personal palm bank and personal online banking, but it is not appropriate to modify the information you reserved when applying for a credit card.", "label": ["Important", "Edit/Control"], "rewrite": "The mobile phone number was modified through personal palm silver and personal online banking, but it did not mean that the information reserved during credit card applications was not the same."}
{"task": "rw_38.jsonl", "id": 50382, "text": "(3) Delete your personal information.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50383, "text": "In the following circumstances, you can make a request to delete personal information through channels such as our outlets, personal online banking, and personal palm banking:", "label": ["Important", "Edit/Control"], "rewrite": "In the following circumstances, you can make a request to delete personal information through channels such as our outlets, personal online banking, and personal palm banking:"}
{"task": "rw_38.jsonl", "id": 50384, "text": "1. If our behavior of handling personal information violates laws and regulations;", "label": ["Edit/Control", "Important"], "rewrite": "If our behavior of handling personal information violates laws and regulations, you can ask for deletion of information."}
{"task": "rw_38.jsonl", "id": 50385, "text": "2. If our behavior of handling personal information violates your agreement;", "label": ["Important", "Edit/Control"], "rewrite": "If our behavior of handling personal information violates your agreement, you can ask for deletion of information."}
{"task": "rw_38.jsonl", "id": 50386, "text": "3. If you no longer use our products or services, or you cancel your account;", "label": ["Edit/Control", "Important"], "rewrite": "If you no longer use our products or services, or if you cancel your account, you can ask for deletion of information."}
{"task": "rw_38.jsonl", "id": 50387, "text": "4. If our trip no longer provides you with products or services.", "label": ["Important", "Edit/Control"], "rewrite": "If my travel no longer provides you with products or services, you can ask for delete information."}
{"task": "rw_38.jsonl", "id": 50388, "text": "You can request delete your personal information through our outlets, customer service hotline (95599) and other methods.", "label": ["Edit/Control", "Important"], "rewrite": "You can request delete personal information through our outlets, customer service hotline (95599) and other methods."}
{"task": "rw_38.jsonl", "id": 50389, "text": "In personal online banking, you can delete your gender, marriage status, nation, occupation, mailbox, and unit name through \"My-My Information\" request.", "label": ["Important", "Edit/Control"], "rewrite": "In personal online banking, you can delete your gender, marriage status, nation, occupation, mailbox, and unit name through \"My-My Information\" request."}
{"task": "rw_38.jsonl", "id": 50390, "text": "In personal palm silver, you can delete your gender, mailbox, fixed telephone, contact address, postcode, occupational information through \"My-Customer Information\" request.", "label": ["Important", "Edit/Control"], "rewrite": "In personal palm silver, you can delete your gender, mailbox, fixed telephone, contact address, postcode, occupational information through \"My-Customer Information\" request."}
{"task": "rw_38.jsonl", "id": 50391, "text": "The information you filled in in your precious metal mall and poverty alleviation mall can be deleted by logging in to your precious metal mall and poverty alleviation mall.", "label": ["Important", "Edit/Control"], "rewrite": "The information you filled in in your precious metal mall and poverty alleviation mall can be deleted by logging in to your precious metal mall and poverty alleviation mall."}
{"task": "rw_38.jsonl", "id": 50392, "text": "(4) Change the scope of your authorization consent.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50393, "text": "In personal palm silver, our guild prompts whether you have authorized you when the client initializes it. You can freely choose to accept it, and provide you with the method of withdrawing and using personal information authorization.", "label": ["Edit/Control", "Important"], "rewrite": "When the client is initialized, you can freely choose the acceptance of relevant authorization, and provide you with the method of withdrawing and using personal information authorization consent."}
{"task": "rw_38.jsonl", "id": 50394, "text": "After you withdraw the authorization, our bank will no longer deal with your corresponding personal information, except for other provisions of laws and regulations.", "label": ["Edit/Control", "Important"], "rewrite": "After you withdraw the authorization, our bank will no longer deal with your corresponding personal information, except for other provisions of laws and regulations."}
{"task": "rw_38.jsonl", "id": 50395, "text": "At the same time, withdrawal authorization does not affect the effectiveness of personal information processing activities based on your authorization before withdrawal.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "The withdrawal authorization does not affect the effectiveness of the personal information processing activities based on the withdrawal before withdrawal."}
{"task": "rw_38.jsonl", "id": 50396, "text": "You can give your authorization consent at any time based on different brands and models of mobile phones, to open or close location service permissions, read contact human rights, call permissions, etc. at any time.", "label": ["Important", "Edit/Control"], "rewrite": "You can give or withdrawing authorization at any time by opening or closing location service permissions, reading contact human rights, dialing call authority, etc. at any time."}
{"task": "rw_38.jsonl", "id": 50397, "text": "When you use the WeChat public account and WeChat mini -programs of Agricultural Bank of China, we will obtain geographical authorization in accordance with Tencent's strategy. You can change your authorization of our geographical location by modifying the WeChat positioning service in the system settings, you in the applet, youYou can also set the authorization of the small program location information to change your authorization of our geographical location.", "label": ["Important", "Edit/Control"], "rewrite": "When you use the WeChat public account and WeChat mini -programs of Agricultural Bank of China, you can authorize the authorization of WeChat positioning services in the system settings or setting the location information of mini -program location."}
{"task": "rw_38.jsonl", "id": 50398, "text": "In personal palm silver, if you need to turn off the directional push function, you can slide the key to the right side of the right side through the \"Home-Message-Settings-Promotion Message\" and turn off a personalized push.", "label": ["Important", "Edit/Control"], "rewrite": "You can slide the key to the right side through the \"Homepage-Settings-Settings-Promotion-Promotion Message\" and turn off a personalized push."}
{"task": "rw_38.jsonl", "id": 50399, "text": "In order to provide you with more accurate and convenient services, our bank will make a comprehensive judgment based on your personal identity information, operating information, and transaction information. It is recommended to introduce products and related content that you may be interested in.", "label": ["Important", "Usage"], "rewrite": "Based on your personal identity information, operating information, and transaction information to make comprehensive judgments, it is recommended to introduce products and related content that you may be interested in."}
{"task": "rw_38.jsonl", "id": 50400, "text": "At the same time, in order to ensure the autonomy of your receiving information, if you need to turn off the \"personalized recommendation\" function, you can slide the key to the right side of the right side through personal palm bank \"My-Settings-Personalized Recommendation\" and turn off the \"personalized recommendation\"Function.", "label": ["Important", "Edit/Control"], "rewrite": "You can use personal palm silver \"Mine-Settings-Personalized Recommendation\", slide the key on the right, and close the \"personalized recommendation\" function."}
{"task": "rw_38.jsonl", "id": 50401, "text": "(5) Logging out your account.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50402, "text": "If you log out of the second and third types of electronic accounts, you can choose personal palm bank, personal online banking, or outlet to cancel.", "label": ["Edit/Control", "Important"], "rewrite": "You can choose personal palm silver, personal online banking, or go to the outlet to cancel our bank's second and third types of electronic accounts."}
{"task": "rw_38.jsonl", "id": 50403, "text": "If you are a personal silver user, you can log out your second and third types of electronic accounts through personal palm silver \"my account-electronic account details-more-sales\";", "label": ["Important", "Edit/Control"], "rewrite": "If you are a personal silver user, you can cancel the second and third types of electronic accounts through the personal palm of the silver \"my account-electronic account details-more-account sales\"."}
{"task": "rw_38.jsonl", "id": 50404, "text": "If you are a personal online banking user, you can cancel your second and third types of electronic accounts through \"account-my account-electronic account-account management-electronic account sales\".", "label": ["Important", "Edit/Control"], "rewrite": "If you are a personal online banking user, you can cancel the second and third types of electronic accounts through the \"account-my account-electronic account-account management-electronic account sales\"."}
{"task": "rw_38.jsonl", "id": 50405, "text": "(6) Logging out your electronic banking channel.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50406, "text": "If your palm bank does not bind the account or ID number, you need to cancel the bank of my hand, you can go to the palm to pass the bank through \"my settings-cancel and exit\", enter the mobile phone number verification code, and you can cancel it after passing the verification.Palm to the bank.", "label": ["Edit/Control", "Important"], "rewrite": "You can go to the palm to pass the \"I-Settings-Logging out and exit\", enter the mobile phone number verification code, and then you can cancel the palm bank after passing the verification."}
{"task": "rw_38.jsonl", "id": 50407, "text": "If your palm bank has binded account or ID number, you can go to our outlet to cancel.", "label": ["Important", "Edit/Control"], "rewrite": "If your palm is bound to an account or ID number, you can go to our outlet to cancel the account."}
{"task": "rw_38.jsonl", "id": 50408, "text": "If you log out of our online bank, you can go to the outlet to apply for a cancellation business.", "label": ["Important", "Edit/Control"], "rewrite": "If you cancel our online bank, you can go to the outlet to apply for a cancellation business."}
{"task": "rw_38.jsonl", "id": 50409, "text": "Please note that your behavior of canceling personal online banking channels is irreversible. Once you cancel your personal online banking channels, your personal palm banking channels will be canceled simultaneously. We will delete the signing information about your channels in personal online banking and personal palm bank client.", "label": ["Important", "Edit/Control"], "rewrite": "The behavior of canceling the personal online banking channel is irreversible. Personal silver channels will be canceled simultaneously, and channel signing information will be deleted."}
{"task": "rw_38.jsonl", "id": 50410, "text": "Except for laws and regulations or regulatory agencies on personal information storage time.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50411, "text": "Please note that when the online channel registered users of our online channel only turn off the company's online banking page, uninstall or stop using personal palm silver clients, delete small programs, or delete public accounts, you cannot log out of your personal online banking or personal palm silver channel.All information about your personal online banking or palm silver will not be deleted.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Only close the company's online banking page, uninstall or stop using personal palm banking clients, delete small programs, and delete the public account cannot cancel personal online banking or personal palm silver channels, and cannot delete information."}
{"task": "rw_38.jsonl", "id": 50412, "text": "(7) respond to your above request.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50413, "text": "To ensure safety, before handling your request, our bank may need to provide a written request and verify your identity.", "label": ["Important", "Data Security"], "rewrite": "Before handling your request, you may need to provide a written request for authentication."}
{"task": "rw_38.jsonl", "id": 50414, "text": "Please understand that for some unprovoral repetitions, too much technical means, risk or very unrealistic requests to others' legitimate rights and interests, our bank may refuse.", "label": ["Important", "Data Security"], "rewrite": "Our bank may refuse to repeat for no repetition, need too much technical means, bring risks or very unrealistic requests to others' legitimate rights and interests."}
{"task": "rw_38.jsonl", "id": 50415, "text": "Although there are above, in the following circumstances, in accordance with laws and regulations or regulatory requirements, we will not be able to respond to your request:", "label": ["Edit/Control", "Important"], "rewrite": "Although there are above, in the following circumstances, in accordance with laws and regulations or regulatory requirements, we will not be able to respond to your request:"}
{"task": "rw_38.jsonl", "id": 50416, "text": "1. What is related to the obligations of the implementation of laws and regulations and regulatory regulations on our bank;", "label": ["Edit/Control", "Important"], "rewrite": "If your request is related to the obligations of the implementation of laws and regulations and regulatory regulations, your request may not be responded."}
{"task": "rw_38.jsonl", "id": 50417, "text": "2. Directly related to national security and national defense security;", "label": ["Edit/Control", "Important"], "rewrite": "If your request is directly related to national security and national defense security, you may not be responded."}
{"task": "rw_38.jsonl", "id": 50418, "text": "3. Directly related to public safety, public health, and major public interests;", "label": ["Important", "Edit/Control"], "rewrite": "Your request is directly related to public safety, public health, and major public interests and may not be responded."}
{"task": "rw_38.jsonl", "id": 50419, "text": "4. Directly related to criminal investigation, prosecution, trial and execution judgment;", "label": ["Important", "Edit/Control"], "rewrite": "Your request is directly related to criminal investigation, prosecution, trial, and execution judgment, and may not be responded."}
{"task": "rw_38.jsonl", "id": 50420, "text": "5. Our bank has sufficient evidence that you have subjective malice or abuse of rights;", "label": ["Important", "Edit/Control"], "rewrite": "If there is sufficient evidence that you have sufficient evidence that you have subjective malice or abuse of rights, you may not be able to respond to your request."}
{"task": "rw_38.jsonl", "id": 50421, "text": "6. For major legitimate rights and interests such as maintaining your or other people's life, property, etc., it is difficult to get the consent of my authorization;", "label": ["Important", "Edit/Control"], "rewrite": "Out of maintaining major legitimate rights and interests such as the life and property of you or other people, it is difficult to get your request when you are authorized."}
{"task": "rw_38.jsonl", "id": 50422, "text": "7. responding to your request will cause the legitimate rights and interests of you or other people and organizations to be seriously damaged;", "label": ["Important", "Edit/Control"], "rewrite": "In response to your request, the legitimate rights and interests of you or other people and organizations are seriously damaged, and your request may not be responding."}
{"task": "rw_38.jsonl", "id": 50423, "text": "8. Involved business secrets.", "label": ["Important", "Edit/Control"], "rewrite": "You may not be able to respond to your request involving business secrets."}
{"task": "rw_38.jsonl", "id": 50424, "text": "Please note that if our bank decides not to respond to your request, it will inform you the reason for the decision and provide you with a way to complain.", "label": ["Important", "Edit/Control"], "rewrite": "If our bank decides not to respond to your request, it will inform you the reason for the decision and provide you with a way to complain."}
{"task": "rw_38.jsonl", "id": 50425, "text": "6. How to deal with the personal information of the minor", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50426, "text": "Our trip hopes that parents or guardians to guide minors to use our services.", "label": ["Specific Audiences", "Important"], "rewrite": "Our trip hopes that parents or guardians to guide minors to use our services."}
{"task": "rw_38.jsonl", "id": 50427, "text": "Our bank will protect the confidentiality and security of personal information of minors in accordance with the provisions of relevant national laws and regulations.", "label": ["Specific Audiences", "Important"], "rewrite": "Our bank will protect the confidentiality and security of personal information of minors in accordance with the provisions of relevant national laws and regulations."}
{"task": "rw_38.jsonl", "id": 50428, "text": "If you are a minor, it is recommended that your parents or guardians read this policy and use our service to use our bank's service or provide your personal information to our bank under the consent of your parents or guardians.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a minor, please use our services or provide information to us after reading this policy carefully or agreeing with us."}
{"task": "rw_38.jsonl", "id": 50429, "text": "If you are a minor under the age of 14, your personal information is a sensitive personal information. Our travel collecting your personal information will obtain a clear consent of your parents or other guardians.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a minor under the age of 14, collecting your personal information will obtain your consent of your guardian."}
{"task": "rw_38.jsonl", "id": 50430, "text": "For your personal information collected by your parents or guardians, our bank will only use it with the consent of law, parents or guardians.", "label": ["Specific Audiences", "Important"], "rewrite": "For your personal information collected by your parents or guardians, our bank will only use it with the consent of law, parents or guardians."}
{"task": "rw_38.jsonl", "id": 50431, "text": "If your guardian does not agree that you can use our service to use our bank's service or provide personal information to our bank in accordance with this policy, please immediately terminate the service of our bank and inform us in time in order to take corresponding measures.", "label": ["Specific Audiences", "Important"], "rewrite": "If your guardian does not agree with this policy, please immediately terminate the service of our bank and inform us in time."}
{"task": "rw_38.jsonl", "id": 50432, "text": "If you are a minor's parents or guardians, when you have questions about the personal information processing of the minors you monitor, please contact us through the contact information in the eighth part of the following part.", "label": ["Specific Audiences", "Important"], "rewrite": "When the guardian has questions about the personal information processing of minors, please contact us."}
{"task": "rw_38.jsonl", "id": 50433, "text": "7. How to update this policy", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50434, "text": "According to the changes in national laws and regulations and the needs of service operations, our bank will modify this policy and related rules from time to time.And replace the previous related content.", "label": ["Policy Change", "Important", "Risk"], "rewrite": "The modified privacy policy content will take effect after the announcement of the announcement and replace the previous relevant content."}
{"task": "rw_38.jsonl", "id": 50435, "text": "From time to time, please pay attention to changes in related content, prompt information and agreements, rules and other related content.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50436, "text": "For major changes, our bank will also provide more prominent notifications (including APP push notifications, email/SMS sending notifications, etc.).", "label": ["Policy Change", "Important"], "rewrite": "For major changes, our bank will also provide more prominent notifications."}
{"task": "rw_38.jsonl", "id": 50437, "text": "The major changes in this policy include, but not limited to:", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50438, "text": "1. Our service model, such as the purpose of handling personal information, the type of personal information, the use of personal information, etc.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50439, "text": "2. The main types of the main object of personal information sharing, transfer, or public disclosure have changed;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50440, "text": "3. The right to participate in personal information processing and its exercise methods have changed significantly;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50441, "text": "4. We are responsible for handling the responsible departments, contact methods and complaint channels for handling personal information security;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50442, "text": "5. Personal information security impact assessment report shows that there is a high risk.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50443, "text": "You know and confirm that if you do not agree with the updated content, you should immediately stop using the corresponding service and cancel the relevant account. Our bank will stop collecting your personal information;", "label": ["Policy Change", "Important"], "rewrite": "If you do not agree with the updated content, you should stop using the corresponding service immediately and cancel the relevant account."}
{"task": "rw_38.jsonl", "id": 50444, "text": "If you continue to use your service, you are deemed to agree to accept the update content.", "label": ["Policy Change", "Important", "Risk"], "rewrite": "If you continue to use your service, you are deemed to agree to accept the update content."}
{"task": "rw_38.jsonl", "id": 50445, "text": "In order to receive notifications in time, it is recommended that you notify us in time when you update the contact information.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50446, "text": "8. How to contact me", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50447, "text": "If you have any questions, opinions or suggestions on this privacy policy, please contact us in the following ways:", "label": ["Important", "Contact Information"], "rewrite": "If you have any questions, opinions or suggestions on this privacy policy, please contact us in the following ways:"}
{"task": "rw_38.jsonl", "id": 50448, "text": "Email: 95599@abchina.com", "label": ["Important", "Contact Information"], "rewrite": "Email: 95599@abchina.com"}
{"task": "rw_38.jsonl", "id": 50449, "text": "Customer Service Hotline: 95599", "label": ["Important", "Contact Information"], "rewrite": "Customer Service Hotline: 95599"}
{"task": "rw_38.jsonl", "id": 50450, "text": "WeChat public account (debit card): Agricultural Bank of China WeChat", "label": ["Important", "Contact Information"], "rewrite": "WeChat public account (debit card): Agricultural Bank of China WeChat"}
{"task": "rw_38.jsonl", "id": 50451, "text": "WeChat public account (credit card): Agricultural bank credit card", "label": ["Important", "Contact Information"], "rewrite": "WeChat public account (credit card): Agricultural bank credit card"}
{"task": "rw_38.jsonl", "id": 50452, "text": "Under normal circumstances, we will reply within 15 working days after receiving your questions, opinions or suggestions.", "label": ["Important", "Contact Information"], "rewrite": "We will reply within 15 working days after receiving your questions, opinions or suggestions."}
{"task": "rw_38.jsonl", "id": 50453, "text": "Full name of our bank: Agricultural Bank of China Co., Ltd.", "label": ["Important", "Contact Information"], "rewrite": "Full name of our bank: Agricultural Bank of China Co., Ltd."}
{"task": "rw_38.jsonl", "id": 50454, "text": "Registration address: No. 69, Jianguo, Jianguomen, Dongcheng District, Beijing", "label": ["Important", "Contact Information"], "rewrite": "Registration address: No. 69, Jianguo, Jianguomen, Dongcheng District, Beijing"}
{"task": "rw_38.jsonl", "id": 50455, "text": "If you are not satisfied with our reply, especially if our personal information processing behavior harms your legitimate rights and interests, you also have the right to complain to consumer rights protection organizations and other relevant departments.", "label": [], "rewrite": []}
{"task": "rw_38.jsonl", "id": 50456, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
