{"task": "rw_30.jsonl", "id": 47488, "text": "Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47489, "text": "Welcome to use BOSS direct employment products and services!", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47490, "text": "BOSS direct appointment products and services are Beijing Huapui Network Technology Co., Ltd. (registered address: 1801 in Building 1801, Building 1801, No.11801, Building 1801, No.16, Chaoyang District, Chaoyang District, Beijing).www.zhipin.com), BOSS direct appointment APP, related WeChat open platform account accounts or applets, and other new forms that may appear with technological development to provide you with products and services.", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47491, "text": "We attach great importance to your privacy protection and personal information protection, and specially formulate this \"Privacy Policy\" to help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47492, "text": "I. Introduction", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47493, "text": "In order to effectively protect the privacy and personal information of BOSS direct employment and optimize the user experience, BOSS direct hires based on the \"Personal Information Protection Law of the People's Republic of China\", \"The People's Republic of China Network Security Law\", and the necessary personal information scope of mobile Internet applications for mobile Internet applications\"And other laws and regulations, and refer to national standards such as the\" Personal Information Security Standards for Information Security Technology \"(GB/T 35273-2020), and formulate this\" Privacy Policy \".", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47494, "text": "This \"Privacy Policy\" is suitable for all services we provide to you, whether you are directly hired by BOSS obtained through computer equipment, mobile terminals or other devices.", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47495, "text": "This \"Privacy Policy\" will specify the scope of personal information, collecting purposes, collection methods, and refusing to provide personal information that each function may be collected in detail.", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47496, "text": "Please know, if you refuse to provide information required for non -necessary personal information or additional functions, you can still use BOSS to directly hire basic functions.", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47497, "text": "This \"Privacy Policy\" will explain to you that the BOSS direct employment platform may need to be retrieved, the purpose of calling, or its corresponding business functions, whether to inquire before calling, and how to close the corresponding permissions, please know, you agree to this \"After the Privacy Policy \", the corresponding equipment permissions will not be opened by default. When involving important or sensitive equipment permissions, when you use the corresponding business functions, we will open another pop -up window again.You can also turn off at any time through device settings. You do not agree to turn on permissions, which will not affect the normal use of other non -related business functions.", "label": ["Policy Change", "Important", "Edit/Control"], "rewrite": "You agree that after this \"Privacy Policy\", the corresponding equipment permissions will not be turned on by default. When important or sensitive equipment permissions are involved, when you use the corresponding business functions, we will be able to open up the pop -up window again after your consent will be opened again.Essence"}
{"task": "rw_30.jsonl", "id": 47498, "text": "We hope that you will read and understand all the contents of this \"Privacy Policy\" before using BOSS direct employment services. I hope you can make appropriate choices based on your own understanding.", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47499, "text": "In addition, when we use your personal information for the use of this \"Privacy Policy\", we will ask your consent in advance.", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47500, "text": "2. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47501, "text": "(1) Basic functions and related personal information", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47502, "text": "In the following services or functions provided by your direct hire by BOSS, we will collect your necessary personal information based on the following basic functions.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47503, "text": "1. Account registration", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47504, "text": "You first need to register a BOSS direct account to become a registered user of BOSS direct hire.", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47505, "text": "When you register, you need to provide us with your own mobile phone number, and we will verify whether your identity is valid by sending a SMS verification code.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you register, you need to provide us with your mobile phone number."}
{"task": "rw_30.jsonl", "id": 47506, "text": "If you do not provide this information, it will not affect your visit to the recruitment position through the tourist mode or log in to www.zhipin.com.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you do not provide this information, it will not affect your visit to the recruitment position through the tourist mode or log in to www.zhipin.com."}
{"task": "rw_30.jsonl", "id": 47507, "text": "Note: Your mobile phone number will not be displayed to other users when you have no initiative or agreeing to exchange.", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47508, "text": "2. Improve the online resume", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47509, "text": "For job seekers, after your registration is successful, first of all, you need to improve the online resume (public), set your avatar, fill in your name, gender, job search identity, working hours, birth year, personal advantages, work experience (company companyName, industry, job time, position name, work content, skill label, work performance, affiliated department), project experience (project name, project role, project time, project description, project performance, project link), education experience (school school) (school school, Education, majors, school hours, school experience, graduation design/thesis title and description), qualification certificate, social homepage, volunteer service experience (project name, service time, project time, project description), job search expectations (Types of job hunting, expected cities, expectations, job preferences, salary requirements, expected industries), and job search status.", "label": ["Important", "First Party Collection Information"], "rewrite": "After your registration is successful, first of all, you need to improve the online resume (public), set your avatar, fill in your name, gender, job search identity, working hours, birthday, personal advantages, work experience (company name, industry you are located, where your industry is located, Having time, job name, work content, skill label, work performance, affiliated departments), project experience (project name, project role, project time, project description, project performance, project link), education experience (school, academic qualifications, majors, majors, majors, majors, majors, At school time period, school experience, graduation design/thesis topic and description), qualification certificate, social homepage, volunteer service experience (project name, service duration, project time, project description), job hunting expectations (type of job search, expectations of expectations, expectationsCities, expectations, job preferences, salary requirements, expected industries), and job search status."}
{"task": "rw_30.jsonl", "id": 47510, "text": "We will match your positions that may be suitable for you according to your above information, and recommend you to possible recruiters.", "label": ["Usage"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47511, "text": "Your personal information (including mobile phone numbers, WeChat signals) will not be displayed to other users without actively or agreed to exchange.", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47512, "text": "You can set the online resume information to hide in [Settings]-[Shield and Filter]. After hiding, the recruiter cannot browse your online resume content.", "label": ["Edit/Control", "Important"], "rewrite": "You can set the online resume information to hide in [Settings]-[Shield and Filter]."}
{"task": "rw_30.jsonl", "id": 47513, "text": "Please note: If you take the initiative to check a position and talk to the boss of the position, your hidden online resume will be visible.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you take the initiative to check a position and talk to the boss of the position, your hidden online resume will be visible."}
{"task": "rw_30.jsonl", "id": 47514, "text": "(2) Additional functions and related non -necessary personal information", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47515, "text": "1. Recruitment authentication", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47516, "text": "For recruiters, before you use recruitment services, you need to pass real -name authentication and real person certification.", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47517, "text": "You need to provide us your identity information for your identity test, including real names, ID numbers, face images and videos (delete it after implementing the test function);", "label": ["Important", "First Party Collection Information"], "rewrite": "You need to provide your identity information for your identity verification, including real names, ID numbers, face images and videos"}
{"task": "rw_30.jsonl", "id": 47518, "text": "At the same time, improve your work information, including the name of your work unit, title title, corporate mailbox, business card, and job certificate to prove that you can recruit on behalf of the unit to ensure the authenticity of the recruitment and safeguard the legitimate rights and interests of job seekers.", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47519, "text": "If the unit you submitted publish recruitment information on the BOSS for the first time, then you also need to provide a business license to verify the legitimacy of the recruitment unit.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If the unit you submitted publish recruitment information on the BOSS for the first time, then you also need to provide a business license to verify the legitimacy of the recruitment unit."}
{"task": "rw_30.jsonl", "id": 47520, "text": "After the certification is passed, your post can be displayed normally.", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47521, "text": "2. Submit your resume", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47522, "text": "For job seekers, you need to upload an attachment resume (including video works) before submitting resume delivery.Mail.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Before the resume delivery, you need to upload an attachment resume (including video works), and the BOSS direct hires collect your attachment resume."}
{"task": "rw_30.jsonl", "id": 47523, "text": "BOSS direct hire upgrade resume privacy protection function.", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47524, "text": "You can choose to use the resume editing tool provided by BOSS directly, edit and generate attachment resume based on your online resume and contact information, and you can set your mobile phone number in the attachment resume according to your own wishes.", "label": ["Edit/Control", "Important"], "rewrite": "You can choose to use the resume editing tool provided by BOSS directly, edit and generate attachment resume based on your online resume and contact information."}
{"task": "rw_30.jsonl", "id": 47525, "text": "After the setting is hidden and submitted, the recipient will not get your mobile phone number through the attachment resume, which will contact you through the virtual number.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After the setting is hidden and submitted, the recipient will not get your mobile phone number through the attachment resume, which will contact you through the virtual number."}
{"task": "rw_30.jsonl", "id": 47526, "text": "You can open/close the corresponding resume privacy protection function through [Hide Resume and Safety Center]-[Resume Privacy Protection].", "label": ["Important", "Edit/Control"], "rewrite": "You can open/close the corresponding resume privacy protection function through [Hide Resume and Safety Center]-[Resume Privacy Protection]."}
{"task": "rw_30.jsonl", "id": 47527, "text": "3. Find services related to positions such as nearby positions", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47528, "text": "Try and sign in, check and sign in, and fill in the position and home address (fill in the community), check the commuting route, calculate the commuting time, the company identity certification, release or modify recruitment information, open the job of commuting lines), fill in the position and family address (fill in the degree of the community).In the scenes and other scenarios, we will collect your location information to better provide you with job search, recruitment function, and products or services related to location.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We will collect your location information to better provide you with job hunting, recruitment functions, and products or services related to location."}
{"task": "rw_30.jsonl", "id": 47529, "text": "We will apply for your location information (GPS positioning) through pop -up windows for the first time;", "label": ["Permission Acquisition", "Important"], "rewrite": "We will apply for your location information (GPS positioning) in the first pop -up window."}
{"task": "rw_30.jsonl", "id": 47530, "text": "After you have authorized consent, you can get your location permissions, such as your city and region.", "label": ["Important", "First Party Collection Information"], "rewrite": "After you have authorized consent, you can get your location permissions, such as your city and region."}
{"task": "rw_30.jsonl", "id": 47531, "text": "We promise to obtain your location information only when you actively use related functions, and collect your location information only according to the minimum frequency required to provide related services, and will not track your travel trajectory.", "label": ["Important", "First Party Collection Information"], "rewrite": "We promise to obtain your location information only when you actively use related functions, and collect your location information only according to the minimum frequency required to provide related services, and will not track your travel trajectory."}
{"task": "rw_30.jsonl", "id": 47532, "text": "If you refuse to authorize, you can choose to manually enter the target job application location or use the recruitment or job search function that does not require location information, but it does not affect other services that you do not use.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you refuse to authorize, you can choose to manually enter the target job application location or use the recruitment or job search function that does not require location information, but it does not affect other services that you do not use."}
{"task": "rw_30.jsonl", "id": 47533, "text": "4. Personalized recommendation service", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47534, "text": "(1) You can use the recommendation page of direct hire in the BOSS to browse the recruitment information or job seekers who may meet your needs or expectations.", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47535, "text": "We will keep your keyword search records to avoid you repeatedly enter the search content.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will keep your keyword search records to avoid you repeatedly enter the search content."}
{"task": "rw_30.jsonl", "id": 47536, "text": "At the same time, we will be based on the job hunting intention or recruitment intention you submit (such as a job seeker, the online resume you fill in, such as job hunting expectations, work experience, etc., or if you are a recruiter, you fill in the post information published), you you can fill in the post information), you, you), you, you), you can fill in the post information), youOperation records (such as: keyword search records, browsing, attention, collection records, and talks about the types of corporate enterprises and talks), recommend, show you the positions and job seekers you may be interested in or match you,With the community related content or other products or services.", "label": ["Usage"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47537, "text": "Reminder: BOSS direct hire cannot guarantee the absolute accuracy of the recommendation algorithm, nor can you ensure that you are 100 % satisfied with the recommended service of BOSS direct hire, whether it is paid or free.", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47538, "text": "If you have any dissatisfaction with the matching of the recruitment information recommended by the algorithm/the matching degree of the boss you talked to you, you can feedback your opinion through artificial customer service.", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47539, "text": "(2) You can click the delete button in the search> history search to clear the search record. After you take the initiative to clear, we will not retain your search records.", "label": ["Important", "Edit/Control"], "rewrite": "You can click the deleted button in the history search to clear the search record. After you take the initiative, we will not retain your search records."}
{"task": "rw_30.jsonl", "id": 47540, "text": "(3) For job seekers, you can use [Mine]-[Settings]-[Black and filtering]-[Personalized recommendation]-[Personalized job recommendation]/[personalized content recommendation]/[personalized expectation recommendation recommendation recommendation]/[Personalized job search recommendations]/[Smart chat recommendation] Close the corresponding personalized recommendation service;", "label": ["Edit/Control", "Important"], "rewrite": "For job seekers, you can use [Mine]-[Settings]-[Black and filtering]-[Personalized recommendation]-[Personalized job recommendation]/[Personalized content recommendation]/[Personalized expectation recommendation]/[Personalized job recommendations]/[Smart Chat Suggestion] Close the corresponding personalized recommendation service."}
{"task": "rw_30.jsonl", "id": 47541, "text": "For recruiters, you can use [Mine]-[Settings]-[Privacy Settings]-[Personalized Bull Recommendation]/[Personalized content recommendation]/[Personalized Recruitment Recommendation] Close the corresponding personalized recommendation service.", "label": ["Edit/Control", "Important"], "rewrite": "For recruiters, you can use [Mine]-[Settings]-[Privacy Settings]-[Personalized Bull Recommendation]/[Personalized content recommendation]/[Personalized Recruitment Recommendation] Close the corresponding personalized recommendation service."}
{"task": "rw_30.jsonl", "id": 47542, "text": "When you close the corresponding personalized recommendation service, we will no longer be based on your keyword search records, job search intentions or recruitment intentions, as well as your operating records that recommend positions and job seekers who match you more.Related content and/or other products or services.", "label": ["Edit/Control", "Important"], "rewrite": "When you close the corresponding personalized recommendation service, we will no longer be based on your keyword search records, job search intentions or recruitment intentions, as well as your operating records that recommend positions and job applicants that match you."}
{"task": "rw_30.jsonl", "id": 47543, "text": "(4) We may also contact you through SMS, telephone, or other ways you agree with the contact information you provided, and recommend to you the positions or candidates you may be interested in and the products or services we provide.", "label": ["Important", "Usage"], "rewrite": "We may also contact you through text messages, telephones or other ways you agree with the contact information you provide, and recommend to you the positions or candidates you may be interested in and the products or services we provide."}
{"task": "rw_30.jsonl", "id": 47544, "text": "If you refuse to accept SMS or telephone marketing, you can withdraw our SMS or telephone marketing information according to the instructions in the SMS or phone (see the sixth part of this policy \"your right\" -In 3)\").", "label": ["Important", "Edit/Control"], "rewrite": "If you refuse to accept SMS or telephone marketing, you can withdraw our SMS or telephone marketing information according to the instructions in the SMS or phone (see the sixth part of this policy \"your right\" -In 3)\")."}
{"task": "rw_30.jsonl", "id": 47545, "text": "5. Online payment", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47546, "text": "When you choose to pay for value -added services such as online payment to buy our straight beans, virtual props, paid rights and interests, you can choose the payment service provided by a third -party payment institution.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "When you choose to pay for value -added services such as online payment to buy our straight beans, virtual props, paid rights and interests, you can choose the payment service provided by a third -party payment institution."}
{"task": "rw_30.jsonl", "id": 47547, "text": "In the payment function, we will obtain your ID and order transaction results from a third -party payment institution. At the same time, we need to share your purchase details, order numbers and transaction amount information with these payment institutionsPay.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "In the payment function, we will obtain your ID and order transaction results from a third -party payment institution. At the same time, we need to share your purchase details, order number and transaction amount information with these payment institutions."}
{"task": "rw_30.jsonl", "id": 47548, "text": "6. Open online", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47549, "text": "When you use BOSS direct employment with job seekers/recruiters to communicate online, you can exchange contact information (including telephone, WeChat) or send attachment resumes according to your own intentions.", "label": ["Important", "Edit/Control"], "rewrite": "In the payment function, we will obtain your ID and order transaction results from a third -party payment institution. At the same time, we need to share your purchase details, order number and transaction amount information with these payment institutions."}
{"task": "rw_30.jsonl", "id": 47550, "text": "Recruiters who have filled in the enterprise mailbox can also receive the attachment resumes proactively submitted to the job seekers through the enterprise mailbox.", "label": ["Important", "Edit/Control"], "rewrite": "Recruiters who have filled in the enterprise mailbox can also receive the attachment resumes proactively submitted to the job seekers through the enterprise mailbox."}
{"task": "rw_30.jsonl", "id": 47551, "text": "When you choose to use the online voice/video call function, you need to turn on your microphone and/or camera permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you choose to use the online voice/video call function, you need to turn on your microphone and/or camera permissions."}
{"task": "rw_30.jsonl", "id": 47552, "text": "When you use a smart chat recommendation function, you need to provide us with some text information you enter.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use a smart chat recommendation function, you need to provide us with some text information you enter."}
{"task": "rw_30.jsonl", "id": 47553, "text": "7. Interview", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47554, "text": "After you have reached an interview intention online with each other and successfully issued an interview invitation to the interview function provided by the BOSS directly, if the other party accepts your online test invitation, your mobile phone number needs to be displayed to the other party to avoid the other party from being on the other party.You can't get in touch with you when you go to the interview place;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If the other party accepts your online test invitation, your mobile phone number needs to be displayed to the other party."}
{"task": "rw_30.jsonl", "id": 47555, "text": "If the other party accepts the invitation of your online video interview, both parties need to turn on the camera and microphone rights before using the video interview function.", "label": ["Permission Acquisition", "Important"], "rewrite": "If the other party accepts the invitation of your online video interview, both parties need to turn on the camera and microphone rights before using the video interview function."}
{"task": "rw_30.jsonl", "id": 47556, "text": "8. Live recruitment", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47557, "text": "You can choose to use the live recruitment service provided by BOSS directly according to your own needs.", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47558, "text": "If you are a recruiter, you need to turn on your camera and microphone rights before you use live recruitment services.", "label": ["Permission Acquisition", "Important"], "rewrite": "The recruiter needs to turn on the camera and microphone rights before using the live recruitment service."}
{"task": "rw_30.jsonl", "id": 47559, "text": "Please know that if you refuse to authorize, we will not be able to provide you with corresponding services, but it will not affect other products or services directly hired by BOSS.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you refuse to authorize, we will not be able to provide you with corresponding services, but it will not affect other products or services you use directly hired by BOSS."}
{"task": "rw_30.jsonl", "id": 47560, "text": "9. job search security guarantee", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47561, "text": "In order to enhance the security of the job hunting recruitment and online interviews of the BOSS direct employment platform, we will try to ensure that the personal and property security of you or other users in the process of recruitment is exempted from infringing, and we will collect your personal information:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47562, "text": "(1), we will only use the considerations of handling your complaint reporting, appeal, and because of improving the security of the platform, and use the communication information, audio and video recruitment/interview records you generated in the business scenario, including your mobile phone number, including your mobile phone number, WeChat and communication records (you know and agree, your call for employment of artificial customer service directly with BOSS may be recorded), and your identity information, such as account ID, mobile phone number, ID number, to handle complaint reports and disputesEssence", "label": ["Important", "First Party Collection Information"], "rewrite": "We will only use your communication information, audio and video/live recruitment/interview records based on the consideration of handling your complaint reports, complaints, and considering the security of platform security."}
{"task": "rw_30.jsonl", "id": 47563, "text": "If you are a recruiter, we may also use your facial recognition information (delete after implementing the verification function).", "label": ["Important", "First Party Collection Information"], "rewrite": "We may also use the recruiter's facial recognition information (deleted after implementing the verification function) for identity testing and safety testing."}
{"task": "rw_30.jsonl", "id": 47564, "text": "(2) When we detect that your account and behavior are abnormal or illegal, and when you are reported by other users, we may ask you to provide your name and ID number to verify whether the current user is you.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may ask you to provide your name and ID number to verify whether the current user is yourself."}
{"task": "rw_30.jsonl", "id": 47565, "text": "If you refuse to provide the above information for your identity, you will not be able to use our products and/or services normally.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide the above information for your identity, you will not be able to use our products and/or services normally."}
{"task": "rw_30.jsonl", "id": 47566, "text": "(3) After you authorize us to open your position permissions, in order to discover, position and check the abnormal behavior, we need to obtain or update your device identification information, location information, and operating behavior.", "label": ["Important", "First Party Collection Information"], "rewrite": "We need to obtain or update your device identification information, location information, and operating behavior."}
{"task": "rw_30.jsonl", "id": 47567, "text": "For the personal and property safety of the job seekers, we will collect the position information of recruiters in the scenario of recruiters (environmental certification), release/modification positions, login through the PC side, online chat, etc.To prevent cheating risks and ensure recruitment and job safety.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect recruiters' location information in the scenario of recruiter identity authentication (environmental certification), release/modification positions, login through PC, and online chat."}
{"task": "rw_30.jsonl", "id": 47568, "text": "(4) In order to ensure the quality and efficiency of the safe operation and operation of software and services, we will collect your device information (including equipment identification information (IMEI/Meid/ESN, IMSI, IDFA, SIM during your login and use processCard serial number, hardware serial number, Android_id), IP address, MAC address, WIF information (bssid, SSID), network -related information (network access method, type, status, etc.)Process information and other application related information) and equipment parameters and system information (device model, operating system and hardware -related information).", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect your device information (including device logo information (IMEI/Meid/ESN, IMSI, IDFA, SIM card serial number, hardware serial number, Android_id), IP address, MAC address, WIF address, WIF address, WIF address, WIF address, MAC address, WIF addressInformation (BSSID, SSID), network -related information (network access methods, types, status, etc.), application information (specified application information, process information that is running, and other application related information) and device parameters and system information (device model, Operating system and hardware -related information)."}
{"task": "rw_30.jsonl", "id": 47569, "text": "(5) In order to prevent malicious procedures and ensure the quality and efficiency of operation, we will collect your service log information (including your operation information, such as browsing records, click records, search query records, collection records, publishing information, sharing information, and sharing information,And operation date and time).", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We will collect your service log information (including your operation information, such as browsing records, clicking records, search query records, collecting records, publishing information, sharing information, and operation date and time)."}
{"task": "rw_30.jsonl", "id": 47570, "text": "(6) In order to verify your identity information and prevent others from accessing your account without authorization, we will visit your device information and WeChat Openid after you authorize your consent.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "After you authorize your consent, visit your device information and WeChat Openid."}
{"task": "rw_30.jsonl", "id": 47571, "text": "If you are a recruiter, we may also verify your facial recognition information (delete it after realizing the verification function);", "label": ["Important", "First Party Collection Information"], "rewrite": "We may also verify the facial recognition information of the recruiter (delete it after implementing the verification function)."}
{"task": "rw_30.jsonl", "id": 47572, "text": "In the scenario of triggering mailbox security verification, we will send a verification code to your mailbox. If you do not fill in the enterprise mailbox address, you need to complete the binding first.", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47573, "text": "If you disagree with the corresponding identity verification above, we may not be able to use identity information verification to ensure your account security.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47574, "text": "10. The public release function of the \"with\" community", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47575, "text": "(1), you can publish information through the comments, Q & A, dynamic sharing, and personal homepage sharing function through the \"with\" community. You can also fill in your \"with\" community information directly on the personal homepage of the BOSS, including yourCommunity nicknames, career experience, self -introduction, constellation, industry, work place, work experience, education experience, hobbies, personal labels, etc., to increase your attention, not filling in the aforementioned information will not affect your product or serviceEssence", "label": ["Important", "First Party Collection Information", "Edit/Control"], "rewrite": "You can provide community nicknames, career experience, self -introduction, constellation, industry, work place, work experience, education experience, hobbies, personal labels, etc., will not affect use without filling."}
{"task": "rw_30.jsonl", "id": 47576, "text": "When you publicly publish information in the \"with\" community or participate in the \"with\" community -related activities, the relevant page will display your username/community nickname, avatar and other information.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47577, "text": "You may involve your personal information and even personal sensitive information in your public information. Please consider it carefully to publicly publish relevant information when using our services.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47578, "text": "If you involve the personal information of others in your public release, you need to obtain the consent of others before the release.", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47579, "text": "(2) In order to maintain network security and ensure a good ecology of the platform, the belonging regional information corresponding to your IP address will be displayed at your account homepage and other positions. The IP address shall be based on the network operator.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "The area information corresponding to your IP address will be displayed at your account homepage and other positions. The IP address is subject to the provided by network operators."}
{"task": "rw_30.jsonl", "id": 47580, "text": "(3) The platform will recommend you related or content that you may be interested in based on the topic of \"the community's likes, get or browsing topics or views.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The platform will recommend you related or content that you may be interested in based on the topic of \"the community's likes, get or browsing topics, or browsing topics or comments."}
{"task": "rw_30.jsonl", "id": 47581, "text": "For job seekers, you can use [Mine]-[Settings]-[Shield and filtering]-[Recommended by personalized content] Close the personalized content recommendation of the community;", "label": ["Important", "Edit/Control"], "rewrite": "You can use [Mine]-[Settings]-[Shield and filtering]-[Personalized content recommendation] Close the personalized content recommendation of the community."}
{"task": "rw_30.jsonl", "id": 47582, "text": "For recruiters, you can use [Mine]-[Settings]-[Privacy Settings]-[Personalized content recommendation] Close the personalized content recommendation of the community.", "label": ["Important", "Edit/Control"], "rewrite": "Recruiters can use [Mine]-[Settings]-[Privacy Settings]-[Personalized content recommendation] Close the personalized content recommendation of the community."}
{"task": "rw_30.jsonl", "id": 47583, "text": "When you close the recommendation of personalized content, we will no longer make recommendations for you to have relevant personalized content in the community.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47584, "text": "11. Niu Ren analyzer", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47585, "text": "We will collect the communication time preferences of job seekers, the number of communication recruiters, the popularity of the recruiter, the place where the recruiter's place of recruiters and the job salary analysis, and show the recruiters to the aforementioned job preference information to increase the recruitment success rate.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We will collect the communication time preferences of job seekers, the number of communication recruiters, the popularity of recruiters, and the place of salary analysis of job salary."}
{"task": "rw_30.jsonl", "id": 47586, "text": "After the recruiter opens the privilege of the cattle analyzer, you can check the communication time preferences of the job seeker, the willingness to apply for a job, the popularity, the company's scale preferences, the place of work place preferences, the salary distribution of the job, etc.Rate.", "label": ["Usage", "Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47587, "text": "Job seekers can use [Mine]-[Settings]-[Black and filtering]-[Hidden job-seeking preference for boss] to hide the above-mentioned job preference information for recruiters. At this time, the recipients will not be able to view the job search preference information of the job seekers.", "label": ["Important", "Edit/Control"], "rewrite": "Job seekers can use [Mine]-[Settings]-[Black and filtering]-[Hidden job-seeking preference for boss] to hide the above-mentioned job preference information for recruiters."}
{"task": "rw_30.jsonl", "id": 47588, "text": "Hidden information preference information may affect the job search efficiency of the job seeker, but it will not affect the use of other functions.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47589, "text": "12. Campus recruitment", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47590, "text": "Based on the commission of recruitment companies, the BOSS direct hiring platform provides students with campus recruitment products and services.", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47591, "text": "When you use campus recruitment products and services, you may need to follow the requirements of the recruitment enterprise, and at the same time, the recruitment company and we provide you provide you with richer personal information to complete the online application process of campus recruitment positions.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47592, "text": "For details of personal information collection, use, and protection, please click to view \"BOSS Direct Approval School Recruitment Products and Service Privacy Protection Statement\".", "label": ["Important", "First Party Collection Information"], "rewrite": "For details of personal information collection, use, and protection, please click to view \"BOSS Direct Approval School Recruitment Products and Service Privacy Protection Statement\"."}
{"task": "rw_30.jsonl", "id": 47593, "text": "13. Others", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47594, "text": "In the scenario of copying, sharing, or opening a copy of the copy, we need to access your shear plates locally, read the password links contained in it, so as to achieve the convenience of copying, sharing, and opening links for you.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "In the scenario of copying, sharing, or opening a copy of the copied links, we need to visit your shear plate locally to read the password links contained in it."}
{"task": "rw_30.jsonl", "id": 47595, "text": "When we read and identify the contents of the shear plate, when the contents of the shear plate are hired and shared the password for BOSS, we will upload it to our server as a check to feedback you what you need or bind related rights and interests you need.Essence", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47596, "text": "Please rest assured that we will not collect and store other information about your clipboard, and the separate clipboard information cannot identify your specific identity.", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47597, "text": "(3) You need to authorize consent to retrieve system authority", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47598, "text": "1. Based on the consideration of personal safety in the job of job hunting, and to meet the risk control needs of Internet platform services, the additional business functions of BOSS direct employment may require you to agree to the relevant system permissions in advance to collect and collect and collect and collect and collect and collect and collect and collect and collect and collect and collect and collect and collect and collect and collect and collect and collect and collect and collect and collect.Use your personal information.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "The additional business functions directly hired by BOSS may require you to agree with us in advance to collect relevant system permissions to collect and use your personal information."}
{"task": "rw_30.jsonl", "id": 47599, "text": "You can directly hire the [Mine]-[Settings]-[Account Security Center]-[Permanent Management] to check the specific personal information access permissions and its opening status through BOSS, and decide to open or close these permissions.", "label": ["Important", "Edit/Control"], "rewrite": "You can directly hire the [Mine]-[Settings]-[Account Security Center]-[Permanent Management] to check the specific personal information access permissions and its opening status through BOSS, and decide to open or close these permissions."}
{"task": "rw_30.jsonl", "id": 47600, "text": "If these permissions are turned on, it means you authorize us to collect and use these personal information.", "label": ["Permission Acquisition", "Important", "Risk"], "rewrite": "You can directly hire the [Mine]-[Settings]-[Account Security Center]-[Permanent Management] to check the specific personal information access permissions and its opening status through BOSS, and decide to open or close these permissions."}
{"task": "rw_30.jsonl", "id": 47601, "text": "We will only use your system permissions when you use related functions.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47602, "text": "Click to see the permissions we have retrieved.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47603, "text": "2. Close the above system permissions, which means that you withdraw these authorization. We will no longer continue to collect and use your personal information, but we cannot provide you with related functions corresponding to these authorization.", "label": ["Permission Acquisition", "Important"], "rewrite": "Closing the above system permissions means that you withdraw these authorization. We will no longer continue to collect and use your personal information, but we cannot provide you with related functions corresponding to these authorization."}
{"task": "rw_30.jsonl", "id": 47604, "text": "The decision of the above permissions will not affect the processing of personal information based on your authorization.", "label": ["Edit/Control", "Important"], "rewrite": "The decision of the above permissions will not affect the processing of personal information based on your authorization."}
{"task": "rw_30.jsonl", "id": 47605, "text": "(4) Other situations you need to authorize", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47606, "text": "1. We may combine the information from a certain service with the information obtained from other services for comprehensive statistical analysis to provide you with more accurate, personalized products, services and/or platform activities.", "label": ["Usage"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47607, "text": "2. Invite you to participate in investigations about our products, services, or some platform activities that you may be interested in to evaluate and improve the service effect of our platform and present a better service experience for you.", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47608, "text": "If you do not want to receive such invitation information, you can choose to unsubseal the book as we prompts.", "label": ["Important", "Edit/Control"], "rewrite": "If you do not want to receive such invitation information, you can choose to unsubseal the book as we prompts."}
{"task": "rw_30.jsonl", "id": 47609, "text": "3. Other purposes allowed by your consent or authorization or laws and regulations.", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47610, "text": "(5) Exception of obtaining authorization consent", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47611, "text": "According to the provisions of relevant laws and regulations, in the following circumstances, we can collect and use some necessary personal information without obtaining your authorization consent:", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In the following circumstances, we can collect and use some necessary personal information without obtaining your authorization consent:"}
{"task": "rw_30.jsonl", "id": 47612, "text": "(1) Related to the obligations stipulated in the performance of our laws and regulations;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collecting personal information related to obligations stipulated in laws and regulations, no consent is required."}
{"task": "rw_30.jsonl", "id": 47613, "text": "(2) Directly related to national security and national defense security;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collecting personal information directly related to national security and national defense security does not need to solicit consent."}
{"task": "rw_30.jsonl", "id": 47614, "text": "(3) Directly related to public safety, public health, and major public interests;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect personal information directly related to public safety, public health, and major public interests without soliciting consent."}
{"task": "rw_30.jsonl", "id": 47615, "text": "(4) Directly related to criminal investigation, prosecution, trial and judgment execution;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect direct personal information related to criminal investigation, prosecution, trial, and execution of judgment without asking for consent."}
{"task": "rw_30.jsonl", "id": 47616, "text": "(5) Out of maintaining major legitimate rights and interests of your or other individuals, but it is difficult to get my consent;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collecting major legitimate rights and interests such as life and property, but it is difficult to obtain personal information that I agree, without asking for consent."}
{"task": "rw_30.jsonl", "id": 47617, "text": "(6) The personal information collected is publicly disclosed to the public by itself;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The collected personal information is made to the public by itself without asking for consent."}
{"task": "rw_30.jsonl", "id": 47618, "text": "(7) Collect your personal information from the legal public disclosure information, such as legal news reports, government information disclosure and other channels; and other channels;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collecting your personal information from the legal disclosure information, without asking for consent."}
{"task": "rw_30.jsonl", "id": 47619, "text": "(8) Signing and fulfilling the contract according to your requirements;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collecting the personal information necessary for the signing and performing the contract without soliciting consent."}
{"task": "rw_30.jsonl", "id": 47620, "text": "(9) Academic research institutions are necessary to carry out statistics or academic research based on public interests, and provide the results of academic research or descriptions to identify the personal information contained in the results;", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47621, "text": "(10) The necessary and stable operation of the safe and stable operation of the product and/or service of the BOSS direct hiring platform products, including the failure of the discovery and disposal of the product or service;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collecting the personal information necessary for the secure and stable operation of the BOSS direct hire platform products and/or services, without asking for consent."}
{"task": "rw_30.jsonl", "id": 47622, "text": "(11) Other circumstances stipulated in legal administrative regulations;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect personal information under other circumstances stipulated in the legal administrative regulations without asking for consent."}
{"task": "rw_30.jsonl", "id": 47623, "text": "If you have any questions about us to collect and use your personal information or provide further information, please contact us through the contact information published by this \"Privacy Policy\".", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47624, "text": "3. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47625, "text": "To ensure the normal operation of the website, we will store data files named Cookie on your computer or mobile devices.", "label": ["Permission Acquisition", "Important"], "rewrite": "We will store data files named Cookie on your computer or mobile device."}
{"task": "rw_30.jsonl", "id": 47626, "text": "Cookie usually contains user identity identification, city names, and some characters.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47627, "text": "The main features of Cookie are convenient for you to use website products and services, as well as helping websites to count the number of independent visitors.", "label": ["Usage"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47628, "text": "Using cookie technology, we can provide you with more thoughtful services.", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47629, "text": "We will not use Cookie for any purpose outside of the purpose of this \"Privacy Policy\".", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47630, "text": "You can manage or delete Cookie according to your preferences.", "label": ["Important", "Edit/Control"], "rewrite": "You can manage or delete Cookie according to your preferences."}
{"task": "rw_30.jsonl", "id": 47631, "text": "See aboutcookies.org for details.", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47632, "text": "You can clear all the cookies saved on the computer, and most of the network browsers have the function of preventing cookies.", "label": ["Important", "Edit/Control"], "rewrite": "You can clear all the cookies saved on the computer, and most of the network browsers have the function of preventing cookies."}
{"task": "rw_30.jsonl", "id": 47633, "text": "But if you do this, you need to change the user settings when you visit our website, but you may not be able to log in or use the services or functions provided by the BOSS that depend on the BOSS dependent on Cookie because of these modifications.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47634, "text": "You can restrict the use of Cookie by changing your browser settings.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47635, "text": "Take Chrome browser as an example. You can select your cookie through \"Settings-Advanced-Clear Browse Data\" in the \"browser settings\" of the drop-down menu on the top right of the Chrome browser.", "label": ["Important", "Edit/Control"], "rewrite": "You can select your cookies through \"Settings-Advanced-Clear Browse Data\" in the \"Browser Settings\" of the drop-down menu at the top right of Chrome browser to select your cookies."}
{"task": "rw_30.jsonl", "id": 47636, "text": "4. How do we share, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47637, "text": "We will not share and transfer your personal information from a third party, unless you have authorized the consent in advance, or the personal information that shared or transferred is the information after identifying the processingmain body.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not share and transfer your personal information from a third party, unless you have authorized the consent in advance."}
{"task": "rw_30.jsonl", "id": 47638, "text": "(1) Sharing", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47639, "text": "We will treat your information with a high degree of diligence.", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47640, "text": "Except for the following situations, without your consent, we will not share your information with any third -party company, organization and individual except the affiliated company directly hired by BOSS::", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Except for the following situations, without your consent, we will not share your information with any third -party company, organization and individual:"}
{"task": "rw_30.jsonl", "id": 47641, "text": "1. Information sharing between related platforms", "label": ["Third Party Sharing/ Disclosure", "Risk"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47642, "text": "You can log in to other products or services we operate through a unified BOSS direct account.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You can log in to other products or services we operate through a unified BOSS direct account."}
{"task": "rw_30.jsonl", "id": 47643, "text": "When you log in to our service, BOSS direct employment may share your personal information (including ID information, mobile phone numbers, avatars, nicknames, nicknames, nicknames, nicknames, nicknames, nicknames, avatars, nicknames, and nicknames may, Gender, age, resume information, certification information, as well as identity logos, corporate information, recruitment positions, candidate information, etc.), to realize that the BOSS direct hire account can be logged in and used on the affiliated platformUnified accounts and information management, and ensure that BOSS direct hire user information is consistent with the display of related platforms.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "BOSS direct hires may share your personal information with the store manager directly hired, BOSS face domination, and seeking network (\"related platform\")."}
{"task": "rw_30.jsonl", "id": 47644, "text": "You will simultaneously authorize the BOSS direct hire account and related information to the BOSS direct employment school recruitment platform that we operate. After the selection, you can use BOSS direct hires and BOSS direct employment school recruitment through the same BOSS account.Platform and related services and functions of selecting small programs.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47645, "text": "Before the information is synchronized, we will obtain your authorization consent in the form of page pop -ups and other forms in the associated platform.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Before the information is synchronized, we will obtain your authorization consent in the form of page pop -ups and other forms in the associated platform."}
{"task": "rw_30.jsonl", "id": 47646, "text": "If you are an enterprise user, in order to improve the recruitment effect, we will use and process your historical data to analyze the recruitment trend of the company to provide a reference for job seekers. At the same time, we will put your recruitment positions published directly on BOSS monthly hires.Summary analysis of the name and quantity (the summary analysis will not include any user information), and the total number of recruitment positions published by the company's monthly hire and the top three hot recruitment positions is shared, And show the [Company Timetable] section of the quasi -network enterprise, so that more job seekers understand the company's recruitment information and better provide you with corporate recruitment services.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47647, "text": "2. Share it with business partners to achieve specific functions", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47648, "text": "In order to ensure the stable operation of the BOSS direct appointment or implementation of related functions, we may use the services provided by the affiliated app, or access the software development package (SDK) and other third -party suppliers provided by a third partyEssence", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may use the services provided by the affiliated app, or access the products provided by the software development package (SDK) and other third -party suppliers provided by a third party."}
{"task": "rw_30.jsonl", "id": 47649, "text": "Click to view BOSS direct hiring third -party sharing list.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47650, "text": "The third parties we access may involve collecting user information for services to users.", "label": ["Third Party Sharing/ Disclosure", "First Party Collection Information"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47651, "text": "We will test and evaluate the services provided by third parties, and strictly abide by relevant laws and regulations and regulatory requirements.", "label": ["Important", "Data Security"], "rewrite": "We will test and evaluate the services provided by third parties, and strictly abide by relevant laws and regulations and regulatory requirements."}
{"task": "rw_30.jsonl", "id": 47652, "text": "In order to provide users with more services, ensure the stability and quality of service, or upgrade related functions, we may need to adjust the third -party services we access.", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47653, "text": "We will explain the latest situation of third -party services to collect user information on this page. Third -party services may change the data processing of data processing due to its version upgrade and strategic adjustment.Essence", "label": ["Data Security"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47654, "text": "We will count our service usage and may share these statistics with the public or third parties to show the overall trend of our products or services.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will count our service usage and may share these statistics with the public or third parties."}
{"task": "rw_30.jsonl", "id": 47655, "text": "But these statistical information does not include any identity information.", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47656, "text": "We promise that in the process of sharing, we will do its best to ensure your data and privacy from being infringed, and to deal with this information with the confidentiality and security measures required by this \"Privacy Policy\".", "label": ["Data Security"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47657, "text": "If you refuse the content of this clause, please contact us through the contact information released by this \"Privacy Policy\".", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47658, "text": "We shared other companies, organizations and individuals (if.) We will sign a strict confidentiality agreement with them and ask the third party to deal with the confidentiality and security measures required by this \"Privacy Policy\" to deal withSome information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We shared other companies, organizations, and individuals (if.) We will sign a strict confidentiality agreement with them."}
{"task": "rw_30.jsonl", "id": 47659, "text": "(2) Transfer", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47660, "text": "We will not transfer your personal information to any company, organization, and individuals except the company directly hired by BOSS, except the following situations: except:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You will not transfer your personal information to any company, organization, and individuals except the company directly hired related companies, except for the following situations: the following situations:"}
{"task": "rw_30.jsonl", "id": 47661, "text": "1. Get your clear authorization or consent in advance;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you get your clear authorization or consent in advance, your personal information will be transferred."}
{"task": "rw_30.jsonl", "id": 47662, "text": "2. Meet the requirements or judicial rulings of laws and regulations, legal procedures or mandatory government requirements or judicial rulings;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Customizing the requirements of laws and regulations, legal procedures or government requirements or judicial rulings, personal information will be transferred."}
{"task": "rw_30.jsonl", "id": 47663, "text": "3. If we or our affiliated companies involve transactions such as mergers, separation, liquidation, assets or business acquisitions or sales, your personal information may be transferred as part of such transactions. We will ensure that such information is transferring to transferring transfer.The confidentiality of the time, and requires new companies and organizations holding your personal information to continue to be constrained by this privacy policy, otherwise we will ask the company and the organization to reconcile your authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If our affiliated company involves merging and separate transactions, your personal information may be transferred as part of such transactions, we will ensure that these information is confidential when transferring, and requires new holders to continue to sufferThe constraints of this privacy policy, otherwise we will ask the company to solicit with authorization."}
{"task": "rw_30.jsonl", "id": 47664, "text": "(3) Public disclosure", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47665, "text": "We will only disclose your personal information in the following situation:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Will disclose your personal information only in the following circumstances:"}
{"task": "rw_30.jsonl", "id": 47666, "text": "1. Get your clear consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the case of getting your clear consent, disclose personal information."}
{"task": "rw_30.jsonl", "id": 47667, "text": "2. Based on the requirements of laws and regulations, legal procedures, litigation or government authorities.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Based on laws and regulations, legal procedures, litigation, or the mandatory requirements of government authorities, personal information is made."}
{"task": "rw_30.jsonl", "id": 47668, "text": "(4) The exception", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47669, "text": "In the following circumstances, sharing, transfer, and publicly disclose your personal information without obtaining your authorization consent in advance:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the following circumstances, sharing, transfer, and publicly disclose your personal information without obtaining your authorization consent in advance:"}
{"task": "rw_30.jsonl", "id": 47670, "text": "1. Related to the obligations stipulated in the performance of our laws and regulations;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Sharing personal information related to the obligations stipulated in our laws and regulations does not need to solicit consent."}
{"task": "rw_30.jsonl", "id": 47671, "text": "2. Directly related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Personal information directly related to national security and national defense security does not need to solicit consent."}
{"task": "rw_30.jsonl", "id": 47672, "text": "3. Directly related to public safety, public health, and major public interests;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Personal information directly related to public safety, public health, and direct public interests does not need to solicit consent."}
{"task": "rw_30.jsonl", "id": 47673, "text": "4. Directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Direct related personal information such as criminal investigation, prosecution, trial and judgment execution does not need to solicit consent."}
{"task": "rw_30.jsonl", "id": 47674, "text": "5. For major legitimate rights and interests such as maintaining your or other individuals, but it is difficult to get my consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share major legitimate rights and interests such as life and property, but it is difficult to obtain personal information that I agree, without asking for consent."}
{"task": "rw_30.jsonl", "id": 47675, "text": "6. Personal information that you disclose to the public by yourself;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share personal information that you disclose to the public yourself without asking for consent."}
{"task": "rw_30.jsonl", "id": 47676, "text": "7. Collect personal information from legal public information, such as legal news reports and government information disclosure.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you collect personal information from the legal disclosure information, you do not need to ask for consent."}
{"task": "rw_30.jsonl", "id": 47677, "text": "8. Signing and fulfilling the contract according to the requirements of the personal information subject;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The personal information necessary for sharing and performance of the contract does not need to ask for consent."}
{"task": "rw_30.jsonl", "id": 47678, "text": "9. The necessary and stable operation of the products or services provided by the product provided, including the failure of discovering and disposing of products or services;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The personal information necessary for sharing the safe and stable operation of products or services does not require consent."}
{"task": "rw_30.jsonl", "id": 47679, "text": "10. Other circumstances stipulated in laws and regulations.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Sharing personal information stipulated in the laws and regulations does not need to solicit consent."}
{"task": "rw_30.jsonl", "id": 47680, "text": "5. How do we save and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47681, "text": "(1) Save information", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47682, "text": "1. Information storage", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47683, "text": "During your use of BOSS direct employment products and services, we will continue to save your personal information for you.", "label": ["Data Retention", "Important"], "rewrite": "During your use of BOSS direct employment products and services, we will continue to save your personal information for you."}
{"task": "rw_30.jsonl", "id": 47684, "text": "If you cancel your account or delete the above information actively, we will delete your personal information in time or perform anonymous processing, because the law needs to keep personal information, we will no longer use it in daily business activities.", "label": ["Data Retention", "Important"], "rewrite": "If you cancel your account or delete the above information actively, we will timely delete your personal information or perform anonymous processing."}
{"task": "rw_30.jsonl", "id": 47685, "text": "2. Save area", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47686, "text": "We promise that your personal information will only be stored on servers located in the People's Republic of China, and your information will not be transmitted overseas by us.", "label": ["Data Retention", "Important"], "rewrite": "We promise that your personal information will only be stored on servers located in the People's Republic of China, and your information will not be transmitted overseas by us."}
{"task": "rw_30.jsonl", "id": 47687, "text": "Carry out safety assessment according to law.", "label": ["Data Retention", "Important"], "rewrite": "Carry out safety assessment according to law."}
{"task": "rw_30.jsonl", "id": 47688, "text": "3. Exception", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47689, "text": "Generally speaking, we only retain your personal information for a reasonable time for the purpose of achieving the goal. After exceeding the reserved time, we will timely delete your personal information in time according to the requirements of applicable laws or perform anonymous processing.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "Generally speaking, we only retain your personal information for a reasonable time for the purpose of achieving the goal. After exceeding the reserved time, we will timely delete your personal information in time according to the requirements of applicable laws or perform anonymous processing."}
{"task": "rw_30.jsonl", "id": 47690, "text": "In the following cases, we may change the storage time of personal information due to the need to meet the legal requirements:", "label": ["Data Retention", "Important"], "rewrite": "In the following cases, we may change the storage time of personal information due to the need to meet the legal requirements:"}
{"task": "rw_30.jsonl", "id": 47691, "text": "(1) In order to comply with the application of relevant provisions such as laws and regulations;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47692, "text": "(2) In order to abide by the court's judgment, ruling or other legal procedures;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47693, "text": "(3) In order to comply with the requirements of relevant government agencies or legal authorized organizations;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47694, "text": "(4) To protect the safety of the personal property of our customers, users, or employees;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47695, "text": "(5) Reasonable necessary uses of other legitimate rights and interests.", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47696, "text": "4. When our products or services stop operating, we will notify users in accordance with the law. The notification method includes but not limited to message push, platform announcement, etc., and delete or processes your in a reasonable period.personal information.", "label": ["Important", "Cessation of Operations"], "rewrite": "When our products or services stop operation, we will notify users in accordance with the law."}
{"task": "rw_30.jsonl", "id": 47697, "text": "(2) Protection measures", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47698, "text": "1. We have adopted to protect your information that meets industry standards, reasonable and feasible security measures, and prevent personal information from being disclosed, publicized, modified, damaged, or lost.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47699, "text": "For example, when you exchange data between your browser and the server, the SSL protocol is encrypted;", "label": ["Important", "Data Security"], "rewrite": "When you exchange data between your browser and the server, the SSL protocol is encrypted and protected."}
{"task": "rw_30.jsonl", "id": 47700, "text": "We also provide the HTTPS protocol security browsing method for the BOSS direct hires at the same time;", "label": ["Important", "Data Security"], "rewrite": "We also provide the HTTPS protocol security browsing method for BOSS direct hires."}
{"task": "rw_30.jsonl", "id": 47701, "text": "We will use encryption technology to improve the security of personal information;", "label": ["Important", "Data Security"], "rewrite": "We will use encrypted technology to improve the security of personal information."}
{"task": "rw_30.jsonl", "id": 47702, "text": "We will use a trusted protection mechanism to prevent personal information from being maliciously attacked;", "label": ["Important", "Data Security"], "rewrite": "We will use a trusted protection mechanism to prevent personal information from being maliciously attacked."}
{"task": "rw_30.jsonl", "id": 47703, "text": "We will deploy the access control mechanism and try our best to ensure that only authorized personnel can access personal information;", "label": ["Important", "Data Security"], "rewrite": "We will deploy the access control mechanism to make every effort to ensure that only authorized personnel can access personal information."}
{"task": "rw_30.jsonl", "id": 47704, "text": "And we will organize security training courses to strengthen employees' awareness of protecting the importance of personal information.", "label": ["Important", "Data Security"], "rewrite": "We will organize safety training courses to strengthen employees' awareness of protecting the importance of personal information."}
{"task": "rw_30.jsonl", "id": 47705, "text": "2. We have improved the security of the entire system multi -dimensional in terms of organizational construction, system design, personnel management, and product technology.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47706, "text": "At present, our important information system has been protected by network security level protection.", "label": ["Important", "Data Security"], "rewrite": "Our important information system has been evaluated through network security level protection."}
{"task": "rw_30.jsonl", "id": 47707, "text": "3. We will take reasonable and feasible measures to avoid collecting unrelated personal information.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47708, "text": "We will only retain your personal information within the time limit of the purpose of the \"Privacy Policy\" (unless the law has compulsory deposit requirements or the two parties have another agreement).", "label": ["Important", "Data Security"], "rewrite": "We will only retain your personal information within the time limit of the purpose of the \"Privacy Policy\" (unless the law has compulsory deposit requirements or the two parties have another agreement)."}
{"task": "rw_30.jsonl", "id": 47709, "text": "4. The Internet is not an absolutely secure environment. When using BOSS direct hire platform services, we strongly recommend that you do not use the communication method recommended by non -BOSS direct hire platforms to send your information.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47710, "text": "You can establish contact and share content with others through our services.", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47711, "text": "When you communicate and share content through our services, you can choose the objects that communicate and share as a third party that can see your contact methods and communication information.", "label": ["Third Party Sharing/ Disclosure", "Edit/Control"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47712, "text": "5. When using BOSS direct employment services to communicate, please protect your personal information properly and provide others with only necessary situations.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47713, "text": "If you find your personal information, especially your account leak, please immediately contact us through the contact information published in the \"10. How to contact us\" in this \"Privacy Policy\" so that we can take corresponding measures according to your applicationEssence", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47714, "text": "Please note that when you use our service, you voluntarily share or even publicly share information, which may involve your or other people's personal information and even personal sensitive information, such as choosing pictures containing personal information when commenting and communication.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47715, "text": "Please consider whether to share or even publicly share relevant information when using our services.", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47716, "text": "Please keep your account properly and assist us to ensure your account security.", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47717, "text": "We will try our best to ensure the security of any information you send to us.", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47718, "text": "(3) Notice of security incident", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47719, "text": "1. We will develop emergency plans for cyber security incidents to deal with security risks such as system vulnerabilities, computer viruses, cyber attacks, and network invasion in a timely manner. When incidents that harm network security occur, we will immediately start the emergency plan and take corresponding remedies.And report to the relevant authorities in accordance with regulations.", "label": ["Important", "Data Security"], "rewrite": "We will formulate emergency plans for cyber security incidents to deal with risks in a timely manner. When incidents that endanger network security occur, we will immediately start the emergency plan, take corresponding remedial measures, and report to the relevant authorities in accordance with regulations."}
{"task": "rw_30.jsonl", "id": 47720, "text": "2. After the personal information security incident occurs unfortunately, we will inform you the basic situation and possible impact of the security incident through the requirements of the laws and regulations in accordance with the requirements of the laws and regulations.Advance measures, suggestions for your own risk of preventing and reducing your own prevention and reduction, and remedy measures.", "label": ["Important", "Data Security"], "rewrite": "After unfortunately a personal information security incident, we will inform you in a timely manner that the basic situation and possible impact, processing measures, suggestions, remedial measures, etc. will be informed."}
{"task": "rw_30.jsonl", "id": 47721, "text": "We will promptly inform you of the incident -related situation through the above way. It is difficult to inform them one by one in a reasonable and effective way to issue an announcement.", "label": ["Important", "Data Security"], "rewrite": "We will promptly inform you of the incident -related situation through the above method. It is difficult to inform them one by one. We will publish an announcement in a reasonable and effective way"}
{"task": "rw_30.jsonl", "id": 47722, "text": "At the same time, we will also actively report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "We will also take the initiative to report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities."}
{"task": "rw_30.jsonl", "id": 47723, "text": "6. Your rights", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47724, "text": "In accordance with China's relevant laws, regulations, standards, and the practice of other countries and regions, we guarantee that you exercise the following rights on your personal information:", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47725, "text": "(1) Visit and modify your personal information", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47726, "text": "1. Visit the name", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47727, "text": "(1) Candidates can modify your name through my> online resume> name;", "label": ["Important", "Edit/Control"], "rewrite": "Job seekers can modify your name through my> online resume> name."}
{"task": "rw_30.jsonl", "id": 47728, "text": "(2) Recruiters who have completed the real -name authentication on the BOSS side cannot directly modify their names. You can choose to display it as \"Mr. X/Lady\".", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47729, "text": "If you need to modify, you can first unbind the BOSS real -name authentication, and then re -authenticate the new name.", "label": ["Important", "Edit/Control"], "rewrite": "If you need to modify, you can first unbind the BOSS real -name authentication, and then re -authenticate the new name."}
{"task": "rw_30.jsonl", "id": 47730, "text": "Unbinding real -name authentication can be operated in my> Help Feedback> Account Management> Lift the real -name binding.", "label": ["Important", "Edit/Control"], "rewrite": "Unbinding real -name authentication can be operated in my> Help Feedback> Account Management> Lift the real -name binding."}
{"task": "rw_30.jsonl", "id": 47731, "text": "Reminder: After unbundling the real name certification, you will not be able to use the recruitment function.", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47732, "text": "If you need to continue to use the recruitment function, switch to the BOSS side and re -complete the real -name authentication according to the prompt.", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47733, "text": "2. Visit and modify gender", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47734, "text": "Job seekers can change gender through my> online resume> gender;", "label": ["Important", "Edit/Control"], "rewrite": "Job seekers can change gender through my> online resume> gender."}
{"task": "rw_30.jsonl", "id": 47735, "text": "Recruiters who have completed real -name certification cannot modify gender.", "label": ["Important", "Edit/Control"], "rewrite": "Recruiters who have completed real -name certification cannot modify gender."}
{"task": "rw_30.jsonl", "id": 47736, "text": "3. Visit and modify resume content", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47737, "text": "Job seekers can modify the resume content in my> online resume;", "label": ["Important", "Edit/Control"], "rewrite": "Job seekers can modify the resume content in my> online resume."}
{"task": "rw_30.jsonl", "id": 47738, "text": "Job seekers can modify the resume hidden or displayed in my> settings> shielding and filtering;", "label": ["Important", "Edit/Control"], "rewrite": "Job seekers can modify the resume hidden or displayed in my> settings> shielding and filtering."}
{"task": "rw_30.jsonl", "id": 47739, "text": "Job seekers can add new attachment resume files or delete existing attachment resume files in my> attachment resume.", "label": ["Important", "Edit/Control"], "rewrite": "Job seekers can add new attachment resume files or delete existing attachment resume files in my> attachment resume."}
{"task": "rw_30.jsonl", "id": 47740, "text": "4. Visit and modify the mobile phone number", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47741, "text": "Users can change the mobile phone number in my> Settings> Account and Security Center> Account Management> Modify the mobile phone number.", "label": ["Important", "Edit/Control"], "rewrite": "Users can change the mobile phone number in my> Settings> Account and Security Center> Account Management> Modify the mobile phone number."}
{"task": "rw_30.jsonl", "id": 47742, "text": "Users can set the mobile phone number to display or hide the mobile phone number in the related attachment resume in the hidden resume contact information in my> Settings> Account Privacy.", "label": ["Important", "Edit/Control"], "rewrite": "Users can set the mobile phone number to display or hide the mobile phone number in the related attachment resume in the hidden resume contact information in my> Settings> Account Privacy."}
{"task": "rw_30.jsonl", "id": 47743, "text": "5. Visit and modify WeChat", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47744, "text": "Recruiters can modify in my> avatar> WeChat;", "label": ["Important", "Edit/Control"], "rewrite": "Recruiters can modify in my> avatar> WeChat signal."}
{"task": "rw_30.jsonl", "id": 47745, "text": "Candidates can add or modify in my> online resume> click Name> WeChat;", "label": ["Important", "Edit/Control"], "rewrite": "Job seekers can add or modify in my> online resume> click Name> WeChat signal."}
{"task": "rw_30.jsonl", "id": 47746, "text": "Users can lift WeChat binding in my> Settings> Account and Security Center> Account Management> WeChat Binding> Lift the binding.", "label": ["Important", "Edit/Control"], "rewrite": "Users can lift WeChat binding in my> Settings> Account and Security Center> Account Management> WeChat Binding> Lift the binding."}
{"task": "rw_30.jsonl", "id": 47747, "text": "6. Visit and modify the mailbox", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47748, "text": "Job seekers can add or modify in my> online resume> click Name>", "label": ["Important", "Edit/Control"], "rewrite": "Job seekers can add or modify in my> Online Resume> Name> Email."}
{"task": "rw_30.jsonl", "id": 47749, "text": "Recruiters can add or modify to my> name> receiving resume mailbox.", "label": ["Edit/Control", "Important"], "rewrite": "Recruiters can add or modify to my> name> receiving resume mailbox."}
{"task": "rw_30.jsonl", "id": 47750, "text": "7. Visit and modify avatars", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47751, "text": "Job seekers can view and modify in my> online resume> click Name>", "label": ["Important", "Edit/Control"], "rewrite": "Job seekers can view and modify in my> Online Resume> click Name> Avatar."}
{"task": "rw_30.jsonl", "id": 47752, "text": "Recruiters can view and modify in my> name> avatar.", "label": ["Edit/Control", "Important"], "rewrite": "Recruiters can view and modify in my> name> avatar."}
{"task": "rw_30.jsonl", "id": 47753, "text": "8. Visit and modify the site", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47754, "text": "Job seekers can add or modify the address (nearly version 7.01) in the recommendation list> nearby> The target job search location.", "label": ["Important", "Edit/Control"], "rewrite": "Job seekers can add or modify the address (nearly version 7.01) in the recommendation list> nearby> The target job search location."}
{"task": "rw_30.jsonl", "id": 47755, "text": "9. If you cannot access these personal information through the above links, you can contact us through the contact information published by this \"Privacy Policy\".", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47756, "text": "10. We will provide you with other personal information that you generate in the process of using our products and services. For your reasonable request, we will provide you accordingly.", "label": ["Edit/Control", "Important"], "rewrite": "Other personal information you generated during our products and services, we will provide you with a reasonable request for your reasonable request."}
{"task": "rw_30.jsonl", "id": 47757, "text": "If you want to visit other personal information you generated during your products and services, please contact us through the contact information published in the \"Ten, how to contact us\" in this \"Privacy Policy\".", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47758, "text": "11. When you find that we have a mistake on your personal information, you have the right to make or update the errors or incomplete information. You can submit a correction or supplementary application through the above paragraph.", "label": ["Important", "Edit/Control"], "rewrite": "When you find that there is an error in your personal information, you have the right to make a more correct or update of the error or incomplete information. You can submit a correction or supplementary application through the above paragraph."}
{"task": "rw_30.jsonl", "id": 47759, "text": "To ensure security, we will verify your identity before you exercise corrective rights.", "label": ["Important", "Data Security"], "rewrite": "To ensure security, we will verify your identity before you exercise corrective rights."}
{"task": "rw_30.jsonl", "id": 47760, "text": "(2) Delete your personal information", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47761, "text": "You can delete some of your information in the way \"1. Access and Modify your personal information\".", "label": ["Important", "Edit/Control"], "rewrite": "You can delete some of your information in the way \"1. Access and Modify your personal information\"."}
{"task": "rw_30.jsonl", "id": 47762, "text": "You can click the deleted button in the history search to clear the search record. After you take the initiative, we will not retain your search records.", "label": ["Important", "Edit/Control"], "rewrite": "You can click the deleted button in the history search to clear the search record. After you take the initiative, we will not retain your search records."}
{"task": "rw_30.jsonl", "id": 47763, "text": "In the following circumstances, you can contact us through the contact information published by this \"Privacy Policy\" to make a request to delete your personal information:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47764, "text": "1. If we violate laws and regulations or collect, use, share or transfer your personal information with others.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47765, "text": "2. If we violate the provisions of laws and regulations or to disclose your personal information with your agreement, you have the right to ask us to immediately stop disclosing a public disclosure and issue notifications to require the relevant receiver to delete the corresponding information.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47766, "text": "3. We did not ask for your clear consent and collected your personal information.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47767, "text": "4. We violate your agreement to use and process your personal information.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47768, "text": "5. You log out the BOSS direct hire account.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47769, "text": "6. We stop serving you.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47770, "text": "(3) Change the scope of authorization", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47771, "text": "1. Change or withdraw sensitive information permissions", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47772, "text": "You can turn off the geographical location, camera, microphone and other permissions in the device operating system, or through my> settings> account and security center> permissions management change consent range or withdraw your authorization.", "label": ["Important", "Edit/Control"], "rewrite": "You can turn off the geographical location, camera, microphone and other permissions in the device operating system, or through my> settings> account and security center> permissions management change consent range or withdraw your authorization."}
{"task": "rw_30.jsonl", "id": 47773, "text": "2. Refuse to accept push and marketing information", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47774, "text": "You can explicitly refuse to receive the advertising information by refusing to refuse or turn off the \"Push Notice\" and the SMS reply \"TD\" through the mobile phone settings.Operators pay.", "label": ["Edit/Control", "Important"], "rewrite": "You can explicitly refuse to receive advertising information by refusing to refuse or turn off the \"Push Notice\" and the SMS reply \"TD\" through the mobile phone settings."}
{"task": "rw_30.jsonl", "id": 47775, "text": "3. Hide job search preferences", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47776, "text": "Candidates can modify the hidden or display status of job search preferences in my> settings> shielding and filtering> hidden job preferences for BOSS.", "label": ["Important", "Edit/Control"], "rewrite": "Candidates can modify the hidden or display status of job search preferences in my> settings> shielding and filtering> hidden job preferences for BOSS."}
{"task": "rw_30.jsonl", "id": 47777, "text": "After the job seeker hides a job preference for the recruiter, the recruiter will not be able to check the job search preference information of the job seeker.", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47778, "text": "Reminder: Hidden information preference information may affect the employment efficiency of the job seeker, but it will not affect the use of other functions.", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47779, "text": "4. Close personalized recommendations", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47780, "text": "For job seekers, you can use [Mine]-[Settings]-[Black and filtering]-[Personalized recommendation]-[Personalized job recommendation]/[Personalized content recommendation]/[Personalized expectation recommendation]/[Personalized job recommendations]/[Smart Chat Suggestion] Close the corresponding personalized recommendation service;", "label": ["Important", "Edit/Control"], "rewrite": "Job seekers can use [Mine]-[Settings]-[Black and filtering]-[Personalized recommendation]-[Personalized job recommendation]/[Personalized content recommendation]/[Personalized expectation recommendation]/[Personalized job hunting jobs]Recommendation]/[Smart Chat Suggestion] Close the corresponding personalized recommendation service."}
{"task": "rw_30.jsonl", "id": 47781, "text": "For recruiters, you can use [Mine]-[Settings]-[Privacy Settings]-[Personalized Bull Recommendation]/[Personalized content recommendation]/[Personalized Recruitment Recommendation] Close the corresponding personalized recommendation service.", "label": ["Important", "Edit/Control"], "rewrite": "Recruiters can use [Mine]-[Settings]-[Privacy Settings]-[Personalized Bull Recommendations]/[Personalized Content Recommendation]/[Personalized Recruitment Recommendation] Close the corresponding personalized recommendation service."}
{"task": "rw_30.jsonl", "id": 47782, "text": "When you close the corresponding personalized recommendation service, we will no longer be based on your keyword search records, job search intentions or recruitment intentions, and your operating records to recommend to you more matched positions, job seekers, community with community, with communityRelated content and/or other products or services.", "label": ["Edit/Control", "Important"], "rewrite": "When you close the corresponding personalized recommendation service, we will no longer recommend related content to you based on your keyword search records, job search intentions or recruitment intentions, and your operating records."}
{"task": "rw_30.jsonl", "id": 47783, "text": "5. Please understand that specific business functions and services will require your information to complete. When you withdraw consent or authorization, we cannot continue to provide you with the service corresponding to the withdrawal consent or authorization, and will not handle your corresponding corresponding correspondencePersonal information.", "label": ["Important", "Edit/Control"], "rewrite": "Specific business functions and services will require your information to complete. When you withdraw your consent or authorization, we cannot continue to provide you with the service corresponding to the withdrawal consent or authorization, and will no longer process your corresponding personal information."}
{"task": "rw_30.jsonl", "id": 47784, "text": "But your decision to withdraw consent or authorization will not affect personal information processing based on your consent or authorization before.", "label": ["Important", "Edit/Control"], "rewrite": "But your decision to withdraw consent or authorization will not affect personal information processing based on your consent or authorization before."}
{"task": "rw_30.jsonl", "id": 47785, "text": "(4) Logging out your account", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47786, "text": "You can apply for a cancellation of the account directly through my> Settings> Account and Security Center> Account Management> Logging out in the account. You can also apply for the cancellation of BOSS direct accounts through the contact information published by this \"Privacy Policy\".", "label": ["Important", "Edit/Control"], "rewrite": "You can apply for a cancellation of the account directly through my> Settings> Account and Security Center> Account Management> Logging out in the account. You can also apply for the cancellation of BOSS direct accounts through the contact information published by this \"Privacy Policy\"."}
{"task": "rw_30.jsonl", "id": 47787, "text": "We will immediately respond to your cancellation application and complete the cancellation within 15 days when you meet the cancellation conditions.", "label": ["Important", "Edit/Control"], "rewrite": "We will immediately respond to your cancellation application and complete the cancellation within 15 days when you meet the cancellation conditions."}
{"task": "rw_30.jsonl", "id": 47788, "text": "The cancellation application can be withdrawn within 15 days after the operation is successful. The relevant operation procedures and reminder notes are subject to the \"Logging out Agreement\".", "label": ["Important", "Edit/Control"], "rewrite": "The cancellation application can be withdrawn within 15 days after the operation is successful. The relevant operation procedures and reminder notes are subject to the \"Logging out Agreement\"."}
{"task": "rw_30.jsonl", "id": 47789, "text": "After you actively cancel your account, we will stop providing you with products or services, delete your personal information according to the requirements of the law, or perform anonymous processing of it. If we need to retain personal information, we will no longer be able to retain personal information.It is used in daily business activities.", "label": ["Important", "Data Security"], "rewrite": "After you take the initiative to cancel your account, we will stop providing you with products or services, delete your personal information according to the requirements of the law, or processes it anonymously."}
{"task": "rw_30.jsonl", "id": 47790, "text": "(5) Knowing the product and service in advance to stop operation", "label": ["Cessation of Operations"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47791, "text": "BOSS direct hires have always been accompanied by you. If the BOSS direct hire platform is forced to stop operation due to special reasons, we will follow the requirements of laws and regulations, on the homepage of products and/or services, or send you email or other other in -site or other.The appropriate way to reach your way to notify you and stop collecting your personal information. At the same time, you will delete or processes your personal information in accordance with the law.", "label": ["Important", "Data Security", "Cessation of Operations"], "rewrite": "If the BOSS direct hiring platform is forced to stop operation due to special reasons, we will notify you and stop collecting personal information, and at the same time delete or process your personal information."}
{"task": "rw_30.jsonl", "id": 47792, "text": "(6) Your other rights", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47793, "text": "In the case of legal permission, you can copy your personal information and request to transfer your personal information to the specified personal information processor, and you can also ask us to explain the rules for your personal information processing.", "label": ["Important", "Edit/Control"], "rewrite": "You can copy your personal information and ask for transferring your personal information to the specified personal information processor, you can also ask us to explain the rules for your personal information processing."}
{"task": "rw_30.jsonl", "id": 47794, "text": "You can contact us through contact information published by this policy to exercise the above rights.", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47795, "text": "(7) Responsive your above request", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47796, "text": "1. To ensure safety, you need to provide a written request or prove your identity in other ways.", "label": ["Important", "Data Security"], "rewrite": "You need to provide a written request or prove your identity in other ways."}
{"task": "rw_30.jsonl", "id": 47797, "text": "We may ask you to verify your identity first, and then process your request. We will respond to your above request within 15 working days after receiving your request and verifying your user identity.", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47798, "text": "2. For your reasonable requests, we do not charge fees in principle, but we will charge a certain cost fee as required for repeated and more reasonable requests.", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47799, "text": "For those who have no repetition and need too much technical means (for example, need to develop new systems or fundamentally change the current practice), bring risks to others' legitimate rights and interests or very unrealistic (for example, information involved in backup tapes)We may refuse.", "label": ["Important", "Data Security"], "rewrite": "We may refuse to reject those who have no repetition, need too much technical means, bring risks or very unrealistic requests to others."}
{"task": "rw_30.jsonl", "id": 47800, "text": "(8) The exception of response requests", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47801, "text": "In the following circumstances, in accordance with the requirements of laws and regulations, we will not be able to respond to your above request:", "label": ["Edit/Control", "Important"], "rewrite": "In the following circumstances, we will not be able to respond to your above request:"}
{"task": "rw_30.jsonl", "id": 47802, "text": "1. Related to the obligations stipulated in the performance of our laws and regulations", "label": ["Edit/Control", "Important"], "rewrite": "Those who are related to our obligations stipulated in our laws and regulations cannot respond to requests."}
{"task": "rw_30.jsonl", "id": 47803, "text": "2. Directly related to national security and national defense security;", "label": ["Important", "Edit/Control"], "rewrite": "Directly related to national security and national defense security cannot respond to requests."}
{"task": "rw_30.jsonl", "id": 47804, "text": "3. Directly related to public safety, public health, and major public interests;", "label": ["Important", "Edit/Control"], "rewrite": "Those who are directly related to public safety, public health, and major public interests cannot respond to requests."}
{"task": "rw_30.jsonl", "id": 47805, "text": "4. Directly related to criminal investigation, prosecution, trial, and execution judgment;", "label": ["Important", "Edit/Control"], "rewrite": "Those who are directly related to criminal investigation, prosecution, trial, and execution judgments cannot respond to requests."}
{"task": "rw_30.jsonl", "id": 47806, "text": "5. Evidence shows that you may have obvious maliciousness, abuse of rights and occupying platform resources, abuse of customer service personnel, etc.", "label": ["Important", "Edit/Control"], "rewrite": "Evidence shows that you may have obvious maliciousness, abuse of rights and occupying platform resources, and abusing customer service personnel, and cannot respond to requests."}
{"task": "rw_30.jsonl", "id": 47807, "text": "6. For the maintenance of major legitimate rights and interests such as the life and property of you or other individuals, it is difficult to get the consent of my authorization;", "label": ["Important", "Edit/Control"], "rewrite": "It is difficult to respond to requests that maintain your or other individuals' lives and property, but it is difficult to obtain the consent of my authorization."}
{"task": "rw_30.jsonl", "id": 47808, "text": "7. Your request exceeds the scope of general technical means and commercial costs;", "label": ["Important", "Edit/Control"], "rewrite": "Your request exceeds the scope of general technical means and commercial costs, and cannot respond to the request."}
{"task": "rw_30.jsonl", "id": 47809, "text": "8. Response your request will cause the legitimate rights and interests of you or other individuals and organizations to be seriously damaged;", "label": ["Edit/Control", "Important"], "rewrite": "In response to your request, if the legitimate rights and interests of you or other individuals and organizations are seriously damaged, the request cannot be responded."}
{"task": "rw_30.jsonl", "id": 47810, "text": "9. Involved business secrets.", "label": ["Important", "Edit/Control"], "rewrite": "Those who involve business secrets cannot respond to requests."}
{"task": "rw_30.jsonl", "id": 47811, "text": "7. How do we deal with the personal information of minors", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47812, "text": "BOSS direct employment attaches great importance to the protection of minors' information.", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47813, "text": "Based on the nature of our products, websites and services, we will not deliberately collect or maintain personal information on our products and services from those under 16 years old, and any part of our products and services will not target people under 16 years old.Essence", "label": ["Specific Audiences", "Important"], "rewrite": "We will not deliberately collect or maintain our personal information from people under 16 years of age, and any part of our products and services will not target people under 16 years old."}
{"task": "rw_30.jsonl", "id": 47814, "text": "If you are under 16, please do not use or access our products and services in any way.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are under 16, please do not use or access our products and services in any way."}
{"task": "rw_30.jsonl", "id": 47815, "text": "When we know that we have unintentionally collected personal information of people under 16 years old, we will delete or take other appropriate measures based on applicable laws and regulations.", "label": ["Specific Audiences", "Important"], "rewrite": "If the personal information of a person under 16 years old is unintentionally collected, delete or take other appropriate measures according to the applicable laws and regulations."}
{"task": "rw_30.jsonl", "id": 47816, "text": "8. We protect the personal information of the dead users", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47817, "text": "BOSS direct employment will strengthen the protection of the deceased's personal information in accordance with the relevant provisions of the Personal Information Protection Law of the People's Republic of China on November 1, 2021.", "label": ["Specific Audiences", "Important"], "rewrite": "BOSS direct employment will strengthen the protection of the deceased's personal information in accordance with the relevant provisions of the Personal Information Protection Law of the People's Republic of China on November 1, 2021."}
{"task": "rw_30.jsonl", "id": 47818, "text": "After the death of BOSS direct employment users (only natural persons), their close relatives can contact us through the contact information published by Article 10 of this policy for their own legal and legitimate interests.Right, delete, etc., except for other arrangements before their death.", "label": ["Specific Audiences", "Important"], "rewrite": "After the death of BOSS direct employment users (only natural persons), their close relatives can contact us through the contact information published by Article 10 of this policy for their own legal and legitimate interests.Right, delete the rights."}
{"task": "rw_30.jsonl", "id": 47819, "text": "Nine, the update of this \"Privacy Policy\"", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47820, "text": "We may revise the content of the \"Privacy Policy\" in a timely manner.", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47821, "text": "If these changes will cause the substantial changes in rights under this \"Privacy Policy\", we will notify you through system push, email, SMS or page announcement through system push, email, text messages, or page announcements.", "label": ["Policy Change", "Important"], "rewrite": "We will notify you through system push, email, SMS, or page announcement before changing effectiveness."}
{"task": "rw_30.jsonl", "id": 47822, "text": "If you do not agree that such changes should stop using BOSS direct hire platform products and services, or temporarily stop your account through contact information published by this \"Privacy Policy\".", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47823, "text": "If you continue to use our products or services, it means that you agree with the restrictions of the revised \"Privacy Policy\".", "label": ["Policy Change", "Important", "Risk"], "rewrite": "If you continue to use our products or services, it means that you agree with the restrictions of the revised \"Privacy Policy\"."}
{"task": "rw_30.jsonl", "id": 47824, "text": "The substantial changes referred to in this \"Privacy Policy\" include, but not limited to:", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47825, "text": "1. Our service model has changed significantly.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47826, "text": "Such as the purpose of handling personal information, the type of personal information, the use of personal information, etc.;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47827, "text": "2. The main object of personal information sharing, transfer or public disclosure changes;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47828, "text": "3. The right to participate in personal information processing and its exercise methods have changed significantly;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47829, "text": "4. Others may have a significant impact on your personal information rights and interests;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47830, "text": "5. When the outbound situation of personal information is changed.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47831, "text": "Ten, how to contact us", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47832, "text": "If you have any questions, opinions, suggestions for your personal information, or our personal information, or you find that there may be a leak of personal information, please contact us through the following ways:", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47833, "text": "1. We have set up a full -time department for personal information protection. You can contact us through its mailbox: pip@kanzhun.com.", "label": ["Important", "Contact Information"], "rewrite": "You can contact us through its mailbox: pip@kanzhun.com."}
{"task": "rw_30.jsonl", "id": 47834, "text": "2. We have set up a special line of personal information protection. You can reflect the relevant issues to us through the customer service hotline: the job seekers please call 400,065,5799-4, and recruiters please call 400,065,5799-7.", "label": ["Important", "Contact Information"], "rewrite": "Candidates please call 400 065 5799-4, and recruiters please call 400 065 5799-7."}
{"task": "rw_30.jsonl", "id": 47835, "text": "3. We have set up direct hotline in the elderly, and the elderly users can contact us by dialing the straight hotline: 400,661,6030.", "label": ["Important", "Contact Information"], "rewrite": "We have set up a direct hotline for the elderly, and the elderly users can contact us by dialing the straight hotline: 400 661 6030."}
{"task": "rw_30.jsonl", "id": 47836, "text": "For issues related to the protection of this policy or personal information, we will answer your requests within 15 working days after receiving your information.", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47837, "text": "11. Applicable laws", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47838, "text": "This \"Privacy Policy\" and \"BOSS Direct Appointment User Agreement\" together constitute the basic agreement documents for you to use BOSS direct services.", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47839, "text": "This \"Privacy Policy\" is applicable to the current laws and regulations of the People's Republic of China.", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47840, "text": "Appendix: Definition", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47841, "text": "The specific words used in this \"Privacy Policy\" have the following meanings:", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47842, "text": "1. \"We\" or \"BOSS Direct Appointment\" refers to Beijing Huapui Network Technology Co., Ltd..", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47843, "text": "2. \"Related Company\" refers to other affiliates of Beijing Renju Renren Network Technology Co., Ltd., Beijing Huaye Cornerstone Network Technology Co., Ltd. and Beijing Huapui Network Technology Co., Ltd..", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47844, "text": "3. \"You\" or \"user\" refers to the registered users of the platform products or services operating using Beijing Huapui Network Technology Co., Ltd. and the buyer of charging services.", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47845, "text": "4. \"BOSS Direct Hiring Platform\" or \"BOSS Direct Appointment Software\" refers to www.zhipin.com, BOSS direct hire mobile clients, BOSS direct hire WeChat mini -programs.", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47846, "text": "5. \"BOSS direct hiring affiliated platform\" refersLimited to see the website, the store manager direct hire, BOSS direct hire flexible use of the flexible employment platform, BOSS face domination, etc. The previous chapter 4 (1) disclosure is subject to.", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47847, "text": "6. \"Personal Information\" refers to the various information that can be recorded alone or with other information to identify specific natural persons or reflects the activity of specific natural persons alone or with other information.", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47848, "text": "Personal information includes personal information, personal identity information, personal biometric information, network identity identification information, personal health and physiological information, personal education work information, personal property information, personal communication information, contact information, personal Internet records, personal commonly used devices for individualsInformation, personal location information, etc.", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47849, "text": "To avoid doubt, personal information includes but is not limited to personal sensitive information.", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47850, "text": "7. \"The subject of personal information\" refers to the natural person identified by the personal information.", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47851, "text": "8. \"Personal sensitive information\" refers to personal information that once leaked, illegally provided or abuses the security of people's body and property, and it is easy to lead to personal information such as personal reputation, physical and mental health damage or discriminatory treatment.", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47852, "text": "Personal sensitive information includes personal property information, personal health and physiological information, and personal biometric information.", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47853, "text": "9. \"Location Information\": refers to the authorized GPS location, WIFI information (SSID, BSSID, and network quality and status data).", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47854, "text": "10. \"Delaid\" refers to the process of processing the subject of personal information without using the technical processing of personal information to make it impossible to recognize the subject of personal information without using additional information.", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47855, "text": "11. \"Anonymous\" refers to the process that the personal information subject cannot be recognized by the technical processing of personal information, and the processing information after processing cannot be restored.", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47856, "text": "historic version:", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47857, "text": "April 2017 Edition May 2018 Edition, September 2018 Edition, January 2019 Edition Edition", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47858, "text": "September 2019 Edition, December 2019 Edition, September 2020, 2021, January 2021", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47859, "text": "April 2021 Edition 2021, June 2021, July 2021, August 2021 Edition", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47860, "text": "October 2021 Edition, June 2022 Edition", "label": [], "rewrite": []}
{"task": "rw_30.jsonl", "id": 47861, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
