{"task": "rw_48.jsonl", "id": 53183, "text": "\"Sheltering\" privacy policy", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53184, "text": "Update date: August 10, 2022", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53185, "text": "Effective date: August 17, 2022", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53186, "text": "Shenzhen Facemeng Technology Co., Ltd. and its related parties (referred to as \"we\" or \"company\") as operators of \"sheltering\" are known to know the importance of personal information security and privacy protection to you. We will follow laws and regulationsIt stipulates to protect your personal information and privacy security.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53187, "text": "We formulate this \"Slocked Privacy Policy\" (referred to as \"this privacy policy\") and special reminders: I hope you can carefully read and understand the privacy policy before using the shelter and related services to make appropriate choices.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53188, "text": "overview", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53189, "text": "(1) We will introduce you how we handle personal information to different scenarios through this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53190, "text": "When you turn on or use the shelter, in order to achieve the functions, services you choose to use, or to comply with laws and regulations, we will collect and process relevant information.", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to realize the functions, services you choose, or to comply with laws and regulations, we will collect and process relevant information."}
{"task": "rw_48.jsonl", "id": 53191, "text": "In addition to implementing the basic functions of the shelter, the information required for services, and the required information required by laws and regulations, you can refuse us to collect and process other personal information, but this may cause us to not provide corresponding functions and services.Essence", "label": ["Important", "First Party Collection Information"], "rewrite": "You can refuse us to collect and handle other personal information, but this may cause us to be unable to provide corresponding functions and services."}
{"task": "rw_48.jsonl", "id": 53192, "text": "We will explain the relevant situation in the privacy policy. The important terms of your personal information rights and interests have been prompted in a bold form. Please pay special attention.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53193, "text": "(2) This privacy policy is suitable for your mobile Internet applications that may include multiple versions of mobile Internet applications (\"Conditioning Mobile\"), PC -side Application (\"Professional Edition\"), \"Professional Edition\"), \"Sheltering \"official website and\" cutting web version \"(\" Ishid web end \"),\" shelled \"related software development tool packs (SDK) and application programming interface (API) used by third -party websites and applications for third -party websites and applicationsTo visit and use the \"shelter\" products and related services.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53194, "text": "- Special Note:", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53195, "text": "a) As a special cooperative product of our special hardware equipment manufacturer, \"Shelter Demonstration Edition\" only provides some basic functional services to specific users to meet the user's basic trial experience needs.Do not support the cutting account registration login, Yuncao draft backup, intelligent subtitles, identification lyrics functions, export, etc., please refer to the actual function and service content of specific functions and service content;", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53196, "text": "If you want to use more cut services and functions, download various versions of cutting.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53197, "text": "b), we promise and guarantee that the \"Shelter Demonstration Edition\" will not collect any personal information, including but not limited to the use of any operating behavior of users, but in order to fulfill the security guarantee obligations required by laws and regulationsExcept for the equipment information and log information required for operation.", "label": ["Important", "First Party Collection Information"], "rewrite": "The \"Shelter Demonstration Edition\" does not collect any personal information, including but not limited to any operating behavior of users, but the security guarantee obligations required by laws and regulations and the equipment information and logs required for the normal operation of the softwareExcept for information."}
{"task": "rw_48.jsonl", "id": 53198, "text": "(3) The actual functions between the related versions of the shelter and the shelter may be slightly different, but if there is no independent privacy policy, we will follow this privacy policy collection and handle your personal information.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53199, "text": "If the related version of the cutting has an independent privacy policy, the affiliated version of the privacy policy is applicable at the same time.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53200, "text": "If the privacy policy and the privacy policy of this associated version are inconsistent, the affiliated version of the privacy policy is applicable.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53201, "text": "(4) In addition to this Privacy Policy, in specific scenarios, we will also explain to you the purpose, scope and use of the corresponding information collection through instant notifications (including pop-up windows, page prompts, etc.), function update instructions, etc. These instant notifications and function update instructions constitute a part of this Privacy Policy and have the same effect as this Privacy Policy.", "label": ["Important", "First Party Collection Information"], "rewrite": "In specific scenarios, we will also explain the corresponding information collection purposes, scope and usage methods through instant notifications (including pop -up windows, page prompts, etc.), functional update instructions."}
{"task": "rw_48.jsonl", "id": 53202, "text": "(5) When you fully read and agree to this privacy policy and the \"Slim\" User Agreement, it means that you have agreed to accept all the functional services you have received.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53203, "text": "If you only want to use the basic functional service of the screened, you can close the \"personalized content recommendation\" and \"personalized advertising recommendation\" before the pop -up window of \"cutting\" personal information protection guidelines for the first time.", "label": ["Permission Acquisition", "Important"], "rewrite": "You can close \"Personalized Content Recommendations\" and \"Personalized Advertising Recommendation\" before the pop -up guidance of \"cutting\" personal information protection guidance for the first time."}
{"task": "rw_48.jsonl", "id": 53204, "text": "Other value -added function services, we will pop up a separate pop -up window to remind you, and only provide you with the consent of your authorization and collect relevant necessary information;", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "For other value -added function services, we will pop up the window to remind you alone, and only provide you with the authorization and consent of your authorization and collect relevant necessary information."}
{"task": "rw_48.jsonl", "id": 53205, "text": "Please note that you will automatically exit the basic functional mode automatically after you make a separate authorization consent (including but not limited to your proactive login of the cutting, actively accepting the user experience improvement plan, etc.).", "label": ["Permission Acquisition", "Important"], "rewrite": "After you make a separate authorization consent, you will automatically exit the basic function mode."}
{"task": "rw_48.jsonl", "id": 53206, "text": "For details, please refer to Article 3.1.1 of this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53207, "text": "(6) If you do not log in to the account, we will ensure the basic functions of information push through the corresponding identifier information of the device.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53208, "text": "If you log in to your account, we will push information according to account information.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53209, "text": "(7) Camera, microphone, read/write local albums, read/write calendar permissions, will not be opened by default. Only by your explicit authorization will it be used when you are authorized to implement specific functions or services.Withdrawing authorization.", "label": ["Permission Acquisition", "Important"], "rewrite": "Camera, microphone, read/write local albums, read/write calendar permissions will not be opened by default. Only by your explicit authorization will you use it when you implement specific functions or services, and you can also withdraw authorization."}
{"task": "rw_48.jsonl", "id": 53210, "text": "In particular, it is necessary to point out that even after your authorization, we have obtained these sensitive permissions, and we will not collect your information when related functions or services are not needed.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Risk"], "rewrite": "Even after your authorization, we have obtained these sensitive permissions, and we will not collect your information when related functions or services are not needed."}
{"task": "rw_48.jsonl", "id": 53211, "text": "Refractive authority application and usage description", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53212, "text": "The following will help you understand how we collect, use, store, transmit, open and protect personal information;", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53213, "text": "Help you understand the way query, correct, supplement, delete, copy, and transfer personal information.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53214, "text": "Among them, the important part of the terms of your personal information rights and interests We have reminded in bold forms, please pay special attention.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53215, "text": "1. How do we collect and use personal information", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53216, "text": "2. Partners involved in the data use process, transfer, and disclose personal information", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53217, "text": "3. Manage your personal information", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53218, "text": "4. How do we protect the security of personal information", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53219, "text": "5. How do we store personal information", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53220, "text": "6. How do we protect minors", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53221, "text": "7. Consultation and revision of privacy policies", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53222, "text": "8. Contact us", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53223, "text": "1. How do we collect and use personal information", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53224, "text": "We will collect the information you actively provided when using the service, and collect the information you generated during the use of function or accepting service through automation:", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect information you actively provided when using the service, and the information you generate during the use of functions or receiving services."}
{"task": "rw_48.jsonl", "id": 53225, "text": "1.1 Registration, login, real -name certification", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53226, "text": "(1) You can use a third -party account (e.g.: Douyin account) to authorize login and use cutting and related services. To this end, you will authorize us to obtain the public on the third -party platform (such as: Douyin platform).Information (avatar, nickname, and other information you have authorized) will be used to create a shelter account for you simultaneously, and bind the third -party account you who have authorized to be with your shelter account in order to provide you with cutting relatedServe.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can use a third -party account (such as: Douyin Account) to authorize and use cutting and related services."}
{"task": "rw_48.jsonl", "id": 53227, "text": "After you use a third -party account to complete the authorization login and create a shelter account, you can also modify or improve the related cutting account information at any time (for example: avatar, nickname, sheltering number, gender, personal profile).", "label": ["Edit/Control", "Important"], "rewrite": "After you use a third -party account to complete the authorization login and create a shelter account, you can also modify or improve the related cutting account information at any time (for example: avatar, nickname, sheltering number, gender, personal profile)."}
{"task": "rw_48.jsonl", "id": 53228, "text": "In addition, when you are authorized to log in through the Douyin account, you can also take the initiative to agree and authorize the shelter to obtain the song list you collected in Douyin so that you can be more convenient and fast when you make video editing through cutting.Embeds the aforementioned songs into the audio. If you do not agree with the same Douyin collecting song list, we will respect your choices and do not obtain such information.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "When you are authorized to log in through the Douyin account, you can also take the initiative to agree and authorize the shelter to obtain the song list you collected in Douyin."}
{"task": "rw_48.jsonl", "id": 53229, "text": "(2) When logging in with a third -party account, you may need to write and read the information necessary to log in in the shear plate.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you are authorized to log in through the Douyin account, you can also take the initiative to agree and authorize the shelter to obtain the song list you collected in Douyin"}
{"task": "rw_48.jsonl", "id": 53230, "text": "This information is for the purpose of achieving the relevant purpose of login and will not collect your privacy information.", "label": ["Important", "First Party Collection Information"], "rewrite": "This information is for the purpose of achieving the relevant purpose of login and will not collect your privacy information."}
{"task": "rw_48.jsonl", "id": 53231, "text": "(3) We will still ask you to provide personal information that we need but third parties.", "label": ["Important", "First Party Collection Information"], "rewrite": "We still ask you to provide personal information that we need but third parties."}
{"task": "rw_48.jsonl", "id": 53232, "text": "If you refuse to provide it, it will cause you to be unable to use related services.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If you refuse to provide it, it will cause you to be unable to use related services."}
{"task": "rw_48.jsonl", "id": 53233, "text": "(4) You agree and understand that when you use the function or related services that you need identity authentication (for example: you can upload, publish, share, comment, etc.) that you implement the user content. According to relevant laws and regulations, you should guaranteeThe related third -party accounts you use have completed the real -name registration registration;", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the function or related services that you need to authenticate your identity, you should ensure that the relevant third -party account you use has completed the real -name system registration."}
{"task": "rw_48.jsonl", "id": 53234, "text": "Or you may need to provide your real identity information to complete the real -name authentication before you can use the relevant functions.", "label": ["Important", "First Party Collection Information"], "rewrite": "You may need to provide your real identity information to complete the real -name authentication before you can use related functions."}
{"task": "rw_48.jsonl", "id": 53235, "text": "You can refuse to provide it. If you choose to refuse, you may not be able to obtain related services, but it does not affect your normal use of other functions and services.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If you choose to refuse to provide real identity information, you may not be able to obtain related services, but it does not affect your normal use of other functions and services."}
{"task": "rw_48.jsonl", "id": 53236, "text": "1.2 Account Public Information", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53237, "text": "We will create a shelter account (sheltering number) for you when you register and log in. The cutting number is the public identification symbol of your shelter account.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53238, "text": "You can choose to set the shelter number according to your own needs.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53239, "text": "You can modify or fill in your avatars, nicknames, sheltering numbers, gender, and personal profile to improve your information.", "label": ["Important", "Edit/Control"], "rewrite": "You can modify or fill in your avatars, nicknames, sheltering numbers, gender, and personal profile to improve your information."}
{"task": "rw_48.jsonl", "id": 53240, "text": "Unwilling or filling in the aforementioned information will not affect your use of cut accounts and services.", "label": ["Important", "Edit/Control"], "rewrite": "Unwilling or filling in the aforementioned information will not affect your use of cut accounts and services."}
{"task": "rw_48.jsonl", "id": 53241, "text": "Your praise, the number of fans and the list of fans, the number of attention and the list of attention, the works you published publicly, the cut -and -cut of the same template video, tutorial video, etc.The same template draft, tutorial video, etc. will be displayed publicly on the personal homepage of the account.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53242, "text": "You can apply for a certification service provided by you (including but not limited to the certification of high -quality template creators, the certification of the vibrato template creator, etc.). After we review the certification materials you provide, we willComplete relevant certification for you.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53243, "text": "Certification marks and certification information will be publicly displayed in your clip account and/or you authorize to log in to the Douyin account.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53244, "text": "1.3 Conditioning unified account and associated version", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53245, "text": "If there is no special explanation, the related versions of the shelter use a unified shelter account service. The affiliated version includes but not limited to the name of the mobile Internet application that may contain multiple versions (\"cutting the mobile terminal\"), PC -side applications (\"Professional Edition\"), \"Sheltering\" official website and \"Screening Web Version\" (\"Cutting Web\"), and other version of the scales we launched from time to time.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53246, "text": "You can use the cut account to log in and use the related versions of the cutting to use the corresponding version of the function and services.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53247, "text": "If there are no other special descriptions, in order to provide a consistent service experience in the related versions of the cutting, we use SDK or other related technologies to synchronize the account and content in the related version of the related version, which may include: avatar, nickname, gender, gender, genderPersonal profile waiting for the public account information that you actively set;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53248, "text": "Simultaneous attention, fans and other user relationships;", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53249, "text": "Synchronize the content of the content published by this account and the service you purchased;", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53250, "text": "Synchronize other information you authorize.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53251, "text": "1.4 Video Creation Tool Capability", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53252, "text": "(1) The shelter provides you with a wealth of video creation tools, including but not limited to basic video creation, one -click film, shooting, graphic film, screen recording, creative script, litter, etc.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53253, "text": "a), when you perform video creation, shooting, recording, and/or editing, we will ask you to authorize albums, cameras, and microphones according to the function types you use.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you conduct video creation, shooting, recording, and/or editing, we will ask you to authorize the authorized album, camera, and microphone rights according to the function types you use."}
{"task": "rw_48.jsonl", "id": 53254, "text": "If you refuse to authorize, you will not be able to use the aforementioned function, but it does not affect your other functions and services that use it.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you refuse to authorize, you will not be able to use the aforementioned function, but it does not affect your other functions and services that use it."}
{"task": "rw_48.jsonl", "id": 53255, "text": "b), when you use the \"shooting\" function, in order to adapt to your device status, we will call the device dynamic sensor to identify your device direction status.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use the \"shooting\" function, we will call the device dynamic sensor to identify your device direction state."}
{"task": "rw_48.jsonl", "id": 53256, "text": "Special explanation: Simple sensor data is only equipment performance and equipment status data, and does not include your personal privacy information.", "label": ["Permission Acquisition", "Important", "Risk"], "rewrite": "Simple sensor data is only device performance and device status data, and does not include your personal privacy information."}
{"task": "rw_48.jsonl", "id": 53257, "text": "(2) The shelter supports you that you can still use the basic creation, shooting, screen recording, litter, and other offline materials and offline materials that are still available in the state where the device is not connected.accomplish.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53258, "text": "(3) You can use richer cutting functions and materials in the equipment networking state. Most of these creative processes are realized on the local client;", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53259, "text": "In a small amount of functions or service scenarios, we will pass all the materials you uploaded to our server for instant processing. These functions and service scenarios will beSpecial explanations will be notified and obtained your authorization consent on the product page.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "We will pass all the materials you uploaded to our server for instant processing. We will specifically explain in this guideline and the \"Slim\" Privacy Policy and will be notified and obtained authorized consent on the product page."}
{"task": "rw_48.jsonl", "id": 53260, "text": "(4) When you use the wearing web version/wearing the web side to create video creation, provide you with a more convenient, smooth, high -quality and safe product experience and trial opportunity for you. You are before you complete the registration account registration loginYou can try and upload the materials you will use for video creation and enter the video editing workbench on the web.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53261, "text": "Please understand and pay attention. To ensure the quality and safety of the service stage during the trial stage, we will temporarily exist our server to choose the material you choose.We will completely delete the aforementioned material within the corresponding time without notifying you.", "label": ["Data Retention", "Important", "First Party Collection Information", "Risk"], "rewrite": "We will temporarily have the server that you choose to upload. If you have never completed the registration and login and the further function or service of the web end, we will completely delete the aforementioned material within the corresponding time without notifying you."}
{"task": "rw_48.jsonl", "id": 53262, "text": "(5) When you use various video creation and editing functions, we will record your click, like/collection), search, query, browsing, downloading (export), sharing and other operating behavior information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will record operating behavior information such as clicking, like (like/collection), search, query, browsing, downloading (export), sharing and other operating behavior information."}
{"task": "rw_48.jsonl", "id": 53263, "text": "1.5 Identifying subtitles/lyrics, text read aloud, graphic films and other characteristic editing functions", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53264, "text": "(1) When you use the function of \"identifying subtitles\" and \"identifying lyrics\", in order to ensure the effectiveness of the function, we will transmit the video/audio file you actively selected to the server for identification and processing;", "label": ["Important", "First Party Collection Information"], "rewrite": "When using the \"Identification Subtitles\" and \"Identification Lyrics\", we will return the video/audio file you actively choose to the server for identification and processing."}
{"task": "rw_48.jsonl", "id": 53265, "text": "At the same time, in order to continuously optimize this service and improve the user experience, we will analyze internal data based on the aforementioned audio information, identified text information and/or text information you actively supplement.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will analyze internal data based on the aforementioned audio information, identified text information, and/or text information you actively supplement."}
{"task": "rw_48.jsonl", "id": 53266, "text": "We will not use the aforementioned information for any other purposes without your authorization, and will be encrypted safely throughout the process.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "We will not use the aforementioned information for any other purposes without your authorization, and will be encrypted safely throughout the process."}
{"task": "rw_48.jsonl", "id": 53267, "text": "(2) In the \"reading aloud\" function, in order to improve the accuracy and quality of the function results, we will collect the text information you actively enter for internal data analysis and we will share such text information and pass through the external authoritative institutions and pass throughOur independent technical processing audio information is read aloud to repair and verify the results.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We will collect the text information you actively entered for internal data analysis. We will share such text information from external authoritative agencies and read audio information after our autonomous technical processing."}
{"task": "rw_48.jsonl", "id": 53268, "text": "(3) In the \"Graphic Film\" function, we will collect the text information you entered and recognize the automatic matching of text, pictures, and audio and video materials by identifying keywords, and we will be based on the aforementioned text information of the aforementioned text informationInternal data analysis continues to optimize this service.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In the \"Graphic Film\" function, we will collect the text information you entered and recognize the automatic matching of text, pictures and audio and video material tags through recognition of keywords."}
{"task": "rw_48.jsonl", "id": 53269, "text": "We promise that the above information is not for identifying your personal identity. We will identify/anonymous desensitization processing on related data, and we will be encrypted and safely protected in accordance with the privacy policy in this privacy policy.It will not be used for any other purpose without your authorization.", "label": ["Important", "First Party Collection Information", "Data Security", "Risk"], "rewrite": "Back to, collecting, and/or outside sharing the above information is not for identifying your personal identity. We will identify/anonymous desensitization processing on related data, and perform encryption and security protection.The authorization agrees to use it for any other purpose."}
{"task": "rw_48.jsonl", "id": 53270, "text": "If you refuse to authorize this information, you will not be able to use the corresponding specific features, but it will not affect your normal use of other functions and services.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to authorize this information, you will not be able to use the corresponding specific functions, but it will not affect your normal use of other functions and services."}
{"task": "rw_48.jsonl", "id": 53271, "text": "1.6 Functions and services such as special effects props, beauty tools and other functions and services", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53272, "text": "When you take the initiative to use the unique special effect props, beauty tools (filters, beauty, beauty, etc.), stickers and other functions and services provided by you. In order to ensure the achievement effect and improve your experience, we willCollect and process the following information:", "label": ["Important", "First Party Collection Information"], "rewrite": "When you take the initiative to use the functions and services provided for you, in order to ensure the achievement effect and improve your experience, we will collect and process the following information:"}
{"task": "rw_48.jsonl", "id": 53273, "text": "(1) Most functions, beauty tools, stickers and other functions will only complete facial feature information recognition, effect rendering, adaptation, and functional implementation on the local client.", "label": ["Important", "First Party Collection Information"], "rewrite": "Most functions, beauty tools, stickers and other functions will only complete facial feature information recognition, effect rendering, adaptation, and functional implementation on the local client."}
{"task": "rw_48.jsonl", "id": 53274, "text": "We will not transmit this information to the server.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53275, "text": "(2) When you take the initiative to use some special special effect props, aesthetic tools, stickers and other functions, in order to provide you with better experience and effects, after the product page is prompted separately and after obtaining your authorization consent, we will collect it, and we will collect it.You upload the facial recognition information (if.) It is based on the relevant technologies of the server to analyze and statistics, thinking that you can achieve fast, accurate video/image processing and facial effect optimization.", "label": ["Important", "First Party Collection Information"], "rewrite": "After the product page is separately prompts and after obtaining the authorization consent, we will collect feature analysis and statistics through the relevant technologies of the server through the relevant technologies of the server."}
{"task": "rw_48.jsonl", "id": 53276, "text": "Facial recognition features are sensitive personal information. Refusing to provide this information will only make you unable to use some special features, but it does not affect other functions and services you use.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Facial recognition features are sensitive personal information. Rejecting to provide this information will only make you unable to use some special features, but it does not affect your other functions and services."}
{"task": "rw_48.jsonl", "id": 53277, "text": "We will not store the materials you upload and any information involved, or for any other goals other than that, or provide it to a third party.", "label": ["Important", "Risk"], "rewrite": "We will not store the materials you upload and any information involved, or for any other goals other than that, or provide it to a third party."}
{"task": "rw_48.jsonl", "id": 53278, "text": "After completing the relevant function processing and returning the effect content to you, we will immediately delete the relevant materials and all information involved from the server.", "label": ["Important", "Data Security"], "rewrite": "After completing the relevant function processing and returning the effect content to you, we will immediately delete the relevant materials and all information involved from the server."}
{"task": "rw_48.jsonl", "id": 53279, "text": "Please understand that when we collect and process the above information, we have de -identified processing/anonymous processing. The data analysis only corresponds to the identification of specific and cannot directly associate the user's personal identity.", "label": ["Important", "Data Security", "Risk"], "rewrite": "When we collect and process the above information, we all conduct de -identification/anonymous processing. The data analysis only corresponds to the identification of a specific and cannot directly associate the user's personal identity."}
{"task": "rw_48.jsonl", "id": 53280, "text": "(3) When you use some special effect props provided by the shelter for video creation, in order to provide you with better special effects loading and adaptation effects, we will call the device dynamic sensorProps.", "label": ["Permission Acquisition", "Important"], "rewrite": "We will call the device dynamic sensor to identify your device status to adapt to the props you choose."}
{"task": "rw_48.jsonl", "id": 53281, "text": "Special explanation: Simple sensor data is only equipment performance and equipment status data, and does not include your personal privacy information.", "label": ["Permission Acquisition", "Important", "Risk"], "rewrite": "Simple sensor data is only device performance and device status data, and does not include your personal privacy information."}
{"task": "rw_48.jsonl", "id": 53282, "text": "1.7 My Cloud Space/Group Cloud Function", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53283, "text": "(1) My cloud space", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53284, "text": "In order to provide you with functions and services such as cloud storage, cloud backup, and sharing of clinging drafts, materials, etc., we will ask you to authorize the authorized album permissions.Other functions and services.", "label": ["Permission Acquisition", "Important"], "rewrite": "We will ask you to authorize the authority of the album. If you refuse to authorize, you will not be able to use the aforementioned function, but it will not affect your use of other features and services."}
{"task": "rw_48.jsonl", "id": 53285, "text": "In order to provide the aforementioned service, we will take the initiative to store cloud storage, upload backups, choose to share pictures, videos and other information documents such as pictures, videos and other information documents in the cloud.", "label": ["Data Retention", "Important"], "rewrite": "We will take the initiative to store cloud storage, upload backups, choose pictures, videos and other information files such as pictures, videos and other information on the cloud."}
{"task": "rw_48.jsonl", "id": 53286, "text": "Without the consent of your authorization, we will not check, handle, delete your initiative to carry out cloud storage, upload backup, and choose to share any content and information involved in specific groups, unless laws and regulations have mandatory regulations.", "label": ["Permission Acquisition", "Important", "Risk"], "rewrite": "Without the consent of your authorization, we will not check, handle, delete your initiative to carry out cloud storage, upload backups, and choose to share any content and information involved in specific groups."}
{"task": "rw_48.jsonl", "id": 53287, "text": "(2) Group cloud", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53288, "text": "You can create a group cloud space and share the password or sharing code we generated for you through the outside world invite other users to join the group.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53289, "text": "In the group cloud space, the group members can upload, view, download, share, and delete sharing content.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53290, "text": "All the contents you uploaded, published, and shared in the group cloud space will be passed back to our server and will be safely stored in our server while you use the service.Related content in the space, the deleted and removed content will be completely deleted at the same time on our servers. Please operate carefully.", "label": ["Data Retention", "Important", "Risk"], "rewrite": "All the contents you uploaded, published, and shared in the group cloud space will be passed back to our server and stores it safely. You can choose to delete and remove the relevant content from the group cloud space at any time.At the same time, it is completely deleted on our server."}
{"task": "rw_48.jsonl", "id": 53291, "text": "The faults of you and/or other group members (including but not limited to the operations, data, and/or data caused by the operations caused by error deletion and removal of product prompts are not deleted, removed, etc.).Or the members of other groups are fully assumed.", "label": ["Risk"], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53292, "text": "1.8 Content browsing and search", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53293, "text": "In the process of browsing the contents and various information in the cutting end, we will record your browsing and usage.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "In the process of browsing the contents and various information in the cutting end, we will record your browsing and usage."}
{"task": "rw_48.jsonl", "id": 53294, "text": "If you do not log in to the account, we will record your browsing, clicking, downloading (export), sharing and other operating behavior information through the corresponding identifier information of the device.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If the account is not logged in, we will record your browsing, clicking, downloading (export), sharing and other operating behavior information through the corresponding identifier information of the device."}
{"task": "rw_48.jsonl", "id": 53295, "text": "If you have logged in to your account, we will record your browsing, clicking, downloading (export), sharing, attention, likes (like/collection), comment and other operating behavior information through your clip account.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If you have logged in to your account, we will record your browsing, clicking, downloading (export), sharing, attention, likes (like/collection), comment and other operating behavior information through your clip account."}
{"task": "rw_48.jsonl", "id": 53296, "text": "When you use search, we will collect your search keyword information and operating log records.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use search, we will collect your search keyword information and operating log records."}
{"task": "rw_48.jsonl", "id": 53297, "text": "Search keyword information will be temporarily stored in your device, so when you use the cut search function on the same device, we will show you your search history.", "label": ["Data Retention", "Important"], "rewrite": "Search keyword information will be temporarily stored in your device, so when you use the cutting search function on the same device, we will show the search history."}
{"task": "rw_48.jsonl", "id": 53298, "text": "When you take the initiative to close personalized recommendations or choose to use only the basic functional services of cutting, we will provide you with non -personalized content and search results.", "label": ["Edit/Control", "Usage", "Important"], "rewrite": "When you actively close personalized recommendations or choose to use only basic functional services, we will provide you with non -personalized content and search results."}
{"task": "rw_48.jsonl", "id": 53299, "text": "1.9 content release", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53300, "text": "When you release the active uploading and publish content (including but not limited to cutting the same templates, tutorials, comments, etc.), we will request your authorized album, camera, and microphone right according to the function and service types you use.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you cut the active uploading and publishing content, we will request your authorized album, camera, and microphone rights according to your specific functions and service types."}
{"task": "rw_48.jsonl", "id": 53301, "text": "If you refuse to authorize, you will not be able to use the aforementioned function, but it will not affect your other functions that use the screened.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you refuse to authorize, you will not be able to use the aforementioned function, but it will not affect your other functions that use the screened."}
{"task": "rw_48.jsonl", "id": 53302, "text": "We will store your active uploading and publishing content safely and properly in the cloud.", "label": ["Data Retention", "Important"], "rewrite": "We will store your active uploading and publishing content safely and properly in the cloud."}
{"task": "rw_48.jsonl", "id": 53303, "text": "The content you posted will show your avatar, nickname, sheltering number and other information.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53304, "text": "You can add the corresponding information link (referred to as the \"anchor point\") based on the functions and services provided by the sheet.", "label": ["Important", "Edit/Control"], "rewrite": "You can add the corresponding information link (referred to as the \"anchor point\") based on the functions and services provided in the shelter."}
{"task": "rw_48.jsonl", "id": 53305, "text": "1.10 Interactive communication", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53306, "text": "(1) [User Interaction] When you interact with other screening users, including but not limited to your active attention to other cutting users or attention by them, you take the initiative to like (like/collect), comment on other cutting users publishedThe works or by the works you posted (like/collection), comments, etc. In order to maintain the stability and security of the service, we may collect your interactive information with other cosmetic users, and for youForm list information and statistical information of attention, like (like/collection), fans, etc.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you interact with other screening users, we may collect the interaction information of you with other shelter users, and form list information and statistical information for you to pay attention to, like (like/collection), fans, etc."}
{"task": "rw_48.jsonl", "id": 53307, "text": "(2) [Interaction carried out by \"shaking\" and other dependent movements] When you \"shake\" and other interaction or activities that depend on the state of action, we will use your sensor information to identify your actions, andUsed to participate in or show you the next interactive scene.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you \"shake and shake\", such as interaction or activity dependent on the state of action, we will use your sensor information to identify your movements."}
{"task": "rw_48.jsonl", "id": 53308, "text": "Special explanation: Simple sensor data is only equipment performance and equipment status data, and does not include your personal privacy information.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Simple sensor data is only device performance and device status data, and does not include your personal privacy information."}
{"task": "rw_48.jsonl", "id": 53309, "text": "1.11 personalized recommendation service", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53310, "text": "In order to show you and recommend more information to you, provide services that fit your needs more, and automatically calculate and predict your preferences through the computer algorithm model to match your personal information to match the computer algorithm model.Information or other service content, the following we will explain to you in detail the operating mechanism of the personalized product service and the way you implement control.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collection and use of your personal information through the screened will automatically calculate and predict your preference for the computer algorithm model to match the information or other service content you may be interested in."}
{"task": "rw_48.jsonl", "id": 53311, "text": "1.11.1 Personalized recommendation mechanism", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53312, "text": "(1) The scope of we providing personalized recommendation services includes but not limited to display video content (cutting the same template, tutorial, etc.), providing search results, recommending products, services or advertising, application notification messages, etc.", "label": ["Important", "Usage"], "rewrite": "The scope of our personalized recommendation services includes but not limited to display video content, providing search results, recommending products, services or advertising, application notification messages, etc."}
{"task": "rw_48.jsonl", "id": 53313, "text": "(2) In order to predict your preferences, we may collect and use your equipment information and the behavior information when using the shelter. The behavior information includes your content browsing, various click behaviors, content playback durations on the screening end, Share, download (save to local), purchase records of paid courses, like (like/collection), cancel the likes (cancel your favorite/cancel collection) and other operations of use", "label": ["Important", "First Party Collection Information"], "rewrite": "We may collect and use your device information and the behavior information when using it."}
{"task": "rw_48.jsonl", "id": 53314, "text": "It also includes the account information (such as: gender) you actively fill in.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53315, "text": "(3) We will automatically analyze the above information through the computer algorithm, extract your user characteristics after calculating, and then predict the content of the content in the information candidate with other relevant characteristics, and conduct the content of the content of the prediction.Select and sort.", "label": ["Important", "Usage"], "rewrite": "We will automatically analyze the above information through the computer algorithm, extract your user characteristics after calculating, and then predict the content of the content in the information candidate pool with other relevant characteristics, and select and sort the content."}
{"task": "rw_48.jsonl", "id": 53316, "text": "After the processing of heavy, dispersing, etc., the final content recommendation list is displayed to you in turn.", "label": ["Important", "Usage"], "rewrite": "After the processing of heavy, dispersing, etc., the final content recommendation list is displayed to you in turn."}
{"task": "rw_48.jsonl", "id": 53317, "text": "(4) We will provide real -time feedback on the recommendation model based on your browsing behavior in the process of using the product, and constantly adjust the optimization results to better provide you with high -quality content.", "label": ["Important", "Usage"], "rewrite": "We will provide real -time feedback on the recommendation model based on your browsing behavior, and constantly adjust the optimization results to better provide you with high -quality content."}
{"task": "rw_48.jsonl", "id": 53318, "text": "Please know that the personalized recommendation algorithm in the shelter does not identify the true identity of a specific natural person, just to provide higher and richer information based on user behavior and characteristics.", "label": ["Important", "Risk"], "rewrite": "The personalized recommendation algorithm in the shelter does not identify the true identity of a specific natural person. It only provides higher and richer information based on user behavior and characteristics."}
{"task": "rw_48.jsonl", "id": 53319, "text": "1.11.2 Personalized recommendation control and management", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53320, "text": "(1) Autonomous decision to receive personalized recommendation content", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53321, "text": "a), you can open or close the personalized recommendation function in the path provided by [Settings]-[Personalized Recommendation Settings] through the [Personalized Recommendation Settings] or cutting the mobile client below this clause.Close personalized recommendations for all one -click. When you choose to close all personalized recommendations, you will no longer show you the recommendation information content. You cannot enjoy personalized recommendation services, but you can continue to browse attention, hot spots and other non -personal recommendation contentItems", "label": ["Edit/Control", "Usage", "Important"], "rewrite": "You can open or close the personalized recommendation function through the [Personalized Recommendation Settings] or cutting the mobile client under this clause- [Settings]-[Personalized Recommendation Settings]Close personalized recommendation."}
{"task": "rw_48.jsonl", "id": 53322, "text": "You can also choose to partially close personalized recommendations. You can close personalized recommendations based on search results or pay attention. After partial closure of personalized recommendation functions, we will not use the corresponding information to make personalized recommendations to you.", "label": ["Edit/Control", "Usage", "Important"], "rewrite": "You can also choose to partially close personalized recommendations. You can close personalized recommendations based on search results or pay attention."}
{"task": "rw_48.jsonl", "id": 53323, "text": "[Personalized recommendation settings]", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53324, "text": "b), when you are not interested in specific information or want to reduce some types of information, you can \"share\" in the lower right corner of the video, \"not interested\", and we will adjust the strategy based on your feedback.", "label": ["Important", "Edit/Control"], "rewrite": "When you are not interested in specific information or hope to reduce a certain type of information, you can \"share\" in the lower right corner of the video."}
{"task": "rw_48.jsonl", "id": 53325, "text": "At the same time, we also provide the entrance to the \"Feedback of Opinions\" to listen to your opinions and suggestions.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53326, "text": "(2) The content required for autonomous subscription.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53327, "text": "In the follow -up function, it will be displayed according to the account you actively choose to follow. You can choose to pay attention or cancel your attention.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53328, "text": "(3) When there is no content you are interested in, you can also enter the keywords interested in the search bar, click and access the search results.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53329, "text": "1.11.3 Manage your programmatic advertising push", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53330, "text": "In order to provide you with free and high -quality services, we will show you as much as possible to advertise you may be more interested and related procedures. At the same time, we will strive to ensure data in this process to ensure that dataSafety.", "label": ["Important", "Usage"], "rewrite": "We will show you as much as possible according to the situation of your related services as possible."}
{"task": "rw_48.jsonl", "id": 53331, "text": "(1) Autonomous decision to receive personalized advertising information:", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53332, "text": "Personalized advertising is one of the advertising display technology, and the advertisers are intelligent recommendation based on your preferences in its application.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53333, "text": "Sheltering only provides programmatic advertising docking technology, and may share information with partners who promote and advertise.Indirect portrait labels and device information or anonymous equipment, networks, channels and other information after anonymous to help them increase the effective touch rate of advertising without identifying your personal identity, and will not obtain you in other applications in other applicationsExamination or personal data.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will not share information that is used to identify your personal identity. We will only provide these partners with indirect portrait labels and device information that cannot be identified by your personal identity or device information or equipment, networks, and channels that are anonymous."}
{"task": "rw_48.jsonl", "id": 53334, "text": "You can use the path or sheltering mobile client provided by [Understanding and Management Advertising Push] below the \"Understanding and Management Advertising Push] [Settings]-[Advertising Display Settings].After closing, you no longer receive such personalized advertisements, but you will still see advertisements. The number of advertisements will not change, but the correlation of advertising will be reduced.", "label": ["Important", "Edit/Control"], "rewrite": "You can use the path or sheltering mobile client provided by [Understanding and Management Advertising Push] below the [Understanding and Management Advertising Push]. [Settings]-[Advertising Display Settings] provided by selecting or opening whether to receive programmatic ads."}
{"task": "rw_48.jsonl", "id": 53335, "text": "[Understand and manage advertising push]", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53336, "text": "(2) Autonomous advertising interest management:", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53337, "text": "To help you manage the interest of advertising, we will adjust the strategy based on your feedback.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53338, "text": "For example, if you are not interested in a certain type of advertisement, we will adjust the strategy based on your feedback.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53339, "text": "For example, you can accurately block the specific advertisements by clicking \"Close\", and the shelter will reduce the advertisement of this type for you.", "label": ["Edit/Control", "Usage", "Important"], "rewrite": "You can click \"Close\" for precise blocking of specific advertisements, and the shelter will reduce recommending this type of advertisement to you."}
{"task": "rw_48.jsonl", "id": 53340, "text": "At the same time, we also provide the entrance to the \"Feedback of Opinions\" to listen to your opinions and suggestions.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53341, "text": "1.12 message notification", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53342, "text": "If you know and agree, for the contact information you actively provided to us when using the shelter (for example: contact telephone, third -party social platform account account, etc.), we may send one or more of them during the operation process.Notification, for user messages, authentication, security verification, user experience research, complaint feedback communication, etc.;", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53343, "text": "We may also use one or more of the previous contact information to provide you with commercial information such as services, function introduction or activities that you may be interested in.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53344, "text": "If you do not want to accept this information, you can unsubscribe the booking method provided in the SMS/Information, or contact us directly to the withdrawal.", "label": ["Edit/Control", "Important"], "rewrite": "If you do not want to accept this information, you can unsubscribe the booking method provided in the SMS/Information, or contact us directly to the withdrawal."}
{"task": "rw_48.jsonl", "id": 53345, "text": "At the same time, we will push you your account dynamics, the user or content dynamics, recommendation content, etc. to you through the system notification of your device. You can choose to turn off the notification function of the scales in the device.", "label": ["Important", "Usage", "Edit/Control"], "rewrite": "You can choose to turn off the notification function of the screen in the device."}
{"task": "rw_48.jsonl", "id": 53346, "text": "1.13 Share and event participation", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53347, "text": "In the case of your sharing or receiving information, participating in activities, we may need to access your shear board and read the passwords, sharing code, and links contained in it to achieve functions or functions such as jumping, sharing, activity linkage or linkage.Serve.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "We may need to access your shear board and read the passwords, sharing codes, and links contained in it to achieve functions or services such as jumping, sharing, and activity linkage."}
{"task": "rw_48.jsonl", "id": 53348, "text": "The content of the shear is only uploaded to our server only when the content of the shear plate is cut, sharing, and activity linkage.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53349, "text": "In addition, the shear will not upload other information of your shear board to our server.", "label": ["Important", "Risk"], "rewrite": "The shear will not upload other information of your shear board to our server."}
{"task": "rw_48.jsonl", "id": 53350, "text": "In addition, we may need to read your mobile album to facilitate your sharing or receiving videos or pictures that have been shared.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "We may need to read your mobile phone album to facilitate the shared videos or pictures that have been shared."}
{"task": "rw_48.jsonl", "id": 53351, "text": "The system of some mobile phone equipment prompts that the application is reading shear or albums, but the system prompts that it cannot be distinguished by local processing or return to the server, and due to the differences in statistical methods, the possibility of misunderstanding is not ruled out.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53352, "text": "Therefore, if you find similar prompts and have questions, please contact us so that we can locate the problem.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53353, "text": "When you choose to participate in the activities we organized, you can provide information such as name, communication address, contact information, bank account and other information according to the event needs.", "label": ["Important", "First Party Collection Information"], "rewrite": "When participating in our activities, you can provide information such as names, communication addresses, contact information, bank accounts and other information."}
{"task": "rw_48.jsonl", "id": 53354, "text": "This information is personal sensitive information, which is necessary for you to receive transfer or gift. If you refuse to provide this information, we may not be able to transfer or distribute gifts to you.", "label": ["First Party Collection Information", "Risk"], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53355, "text": "1.14 Calendar reminder", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53356, "text": "After you complete the paid course purchase, after you authorize the permissions of the calendar, we will record your curriculum information on your calendar so that you can send you a notice to you and other related service reminders before the course starts.", "label": ["Permission Acquisition", "Important"], "rewrite": "After you authorize the permissions of the calendar, we will record your curriculum information on your calendar so that you can send you a notice to you and other related service reminders before the course starts."}
{"task": "rw_48.jsonl", "id": 53357, "text": "Refusing to be awarded the calendar permissions, the aforementioned function will not be used, but it will not affect the other functions and services you use.", "label": ["Permission Acquisition", "Important", "Risk"], "rewrite": "Refusing to be awarded the calendar permissions, the aforementioned function will not be used, but it will not affect the other functions and services you use."}
{"task": "rw_48.jsonl", "id": 53358, "text": "1.15 User experience improvement plan", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53359, "text": "If you take the initiative to participate in the \"User Experience Improvement Plan\", we will strictly protect your privacy and ensure the security of your information through all reasonable efforts.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53360, "text": "This plan will be used to collect related information such as how participants use the shelter for video clips, content export types, and the distribution of hot spots to help us improve the content category label library to provide you with a better user experience;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53361, "text": "After the authorization shelter obtains \"access to the photo\", visit your photos and perform a signature value. The label analysis results will help you build a more complete user portrait and experience a more accurate recommendation service.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "After the authorized shelter obtains \"access to photo permissions\", access your photos and perform feature values. The results of the label analysis will help you build a more complete user portrait."}
{"task": "rw_48.jsonl", "id": 53362, "text": "If you are unwilling to join this plan, you can close and exit at any time, and we will immediately delete the information collected and stored through the plan of this plan.", "label": ["Data Retention", "Edit/Control", "Important"], "rewrite": "If you are unwilling to join this plan, you can close and exit at any time, and we will immediately delete the information collected and stored through the plan of this plan."}
{"task": "rw_48.jsonl", "id": 53363, "text": "1.16 Operation and Security", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53364, "text": "We are committed to providing you with a safe, credible product and use environment, and providing high -quality and reliable services and information is our core goal.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53365, "text": "Please understand that in order to maintain the normal operation of our services and protect the legitimate interests of you or other users or the public from losses, we will collect the necessary information for the safe and stable operation of products or services.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53366, "text": "In addition, no other personal sensitive information is collected during the silent state and/or in the background operation.", "label": ["Important", "First Party Collection Information"], "rewrite": "It will not collect any other individual sensitive information in the silent state and/or during the background operation."}
{"task": "rw_48.jsonl", "id": 53367, "text": "(1) When you use cutting and related services, in order to ensure the quality and efficiency of the safe operation and operation of software and services, we will collect your hardware model, operating system version number, and equipment identifier (Android: such as Android: such as Android, ID, gaid, guid, etc.;", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect your hardware models, operating system versions, and equipment identifiers: such as Android ID, GAID, Guid, etc."}
{"task": "rw_48.jsonl", "id": 53368, "text": "iOS side: such as IDFA, IDFV, etc., different identifiers, different validity periods, different aspects of user reset, and acquisition methods), network equipment hardware address (MAC), hardware serial number, IP address, WLAN access point, Software version number, network access method and type, status, network quality data, equipment performance, operation, use, service log information, sensor information and other data.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53369, "text": "(2) In order to help us better understand the operation of the shelter and related services. At the same time, in order to prevent malicious procedures and ensure the quality and efficiency of operating operations, we will record the network log, collect the application information or the process information and application that is currently running, and apply the application information and application.The overall operation, usage and frequency of use, frequency, application crash, overall installation usage, performance data, and source of application.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will record the application information of the network, collect and install the process information, the overall operation of the application, the use of usage and frequency, the application crash, the overall installation of usage, the performance data, and the source of the application."}
{"task": "rw_48.jsonl", "id": 53370, "text": "(3) We may use your account information, equipment information, service log information, as well as the information that our affiliates and partners are obtained or provided by your authorization or provided by law to judge the security of accounts and transactions, conduct authentication, identify violations of laws and regulations illegal regulationsSituation, testing and preventing safety incidents, and adopting necessary records, analysis, and disposal measures in accordance with the law.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may use your account information, equipment information, service log information, and our related parties and partners to obtain information you authorize or provide according to law."}
{"task": "rw_48.jsonl", "id": 53371, "text": "1.17 Use", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53372, "text": "(1) Similar technologies such as cookies and equipment information identification are technologies commonly used in the Internet.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53373, "text": "When you use cutting and related services, we may use related technologies to send one or more cookies to your device, or anonymous identifier to collect and identify the information when you access and use this product.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may use related technologies to send one or more cookie or anonymous identifiers to your device to collect and identify the information when you access and use this product."}
{"task": "rw_48.jsonl", "id": 53374, "text": "We promise that cookies will not be used for any other purposes other than the purpose of this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53375, "text": "We use cookies and similar technologies to achieve the following functions or services:", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53376, "text": "(2) Ensure the safety and efficient operation of products and services.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53377, "text": "We may set up Cookie or anonymous identifier that guarantees security and ensure security, so that we can confirm whether you log in to the service safely, or whether you encounter dispersion, fraud and other illegal acts.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53378, "text": "These technologies also help us improve service efficiency, improve login and response speed.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53379, "text": "(3) Help you get a easier access experience.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53380, "text": "Using this kind of technology can also help you save the steps and processes of your personal information, enter the search content (example: record search, form filling), and repeat the steps and processes of video editing functions (for example: record filtering filtering filteringMirror settings, etc.) to help you get a easier access experience.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53381, "text": "(4) Recommend, display, and push you what you may be interested in.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53382, "text": "a), we may use such technologies to understand your preferences and use habits, and analyze data to improve information or functions that users are interested in, and optimize your choice of advertising.", "label": ["Important", "Usage"], "rewrite": "We may use such technologies to understand your preferences and use habits, and conduct data analysis to improve information or functions that users are interested in."}
{"task": "rw_48.jsonl", "id": 53383, "text": "b), in the sharing page of the shelter, we may use Cookie to record the browsing activities to recommend information and investigate the relevant abnormal conditions of collapse, delay, and explore better service methods.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may use Cookie to record the browsing activities to recommend information and investigate the related abnormal conditions of collapse, delay, and explore a better service method."}
{"task": "rw_48.jsonl", "id": 53384, "text": "(5) Clear of Cookie.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53385, "text": "Most browsers provide users with the function of removing browser cache data. You can perform the corresponding data clearance operation in the browser settings function.", "label": ["Important", "Edit/Control"], "rewrite": "You can perform the corresponding data clearance operation in the browser settings function."}
{"task": "rw_48.jsonl", "id": 53386, "text": "If you clear, you may not be able to use the services or corresponding functions that we depend on Cookie.", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "If you clear, you may not be able to use the services or corresponding functions that we depend on Cookie."}
{"task": "rw_48.jsonl", "id": 53387, "text": "1.18 Collect and use personal information purpose changes", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53388, "text": "Please understand that with the development of our business, it may be adjusted and changed to the functions of cutting and the services provided.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53389, "text": "In principle, when the new features or services are related to the functions or services we are currently provided, the personal information collected and used will be directly or reasonable to the original processing purpose.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53390, "text": "In the scenario that is not directly or reasonable with the original treatment purpose, we collect and use your personal information will be inform again and obtain your consent.", "label": ["Important", "First Party Collection Information"], "rewrite": "In the scenario that is not directly or reasonable with the original treatment purpose, we collect and use your personal information will be inform again and obtain your consent."}
{"task": "rw_48.jsonl", "id": 53391, "text": "1.19 Removal of personal information that obtains consent to collect and use in accordance with the law", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53392, "text": "Please understand that in the following situations, according to laws and regulations and related national standards, we collect and use your personal information without obtain your authorization consent:", "label": ["Important", "First Party Collection Information"], "rewrite": "In the following situations, we collect and use your personal information without obtain your authorization consent:"}
{"task": "rw_48.jsonl", "id": 53393, "text": "a. Directly related to national security and national defense security;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting personal information directly related to national security and national defense security does not need to solicit consent."}
{"task": "rw_48.jsonl", "id": 53394, "text": "b. It is directly related to public safety, public health, and major public interests;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect personal information directly related to public safety, public health, and major public interests without soliciting consent."}
{"task": "rw_48.jsonl", "id": 53395, "text": "c. Directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect direct personal information related to criminal investigation, prosecution, trial, and execution of judgments without asking for consent."}
{"task": "rw_48.jsonl", "id": 53396, "text": "d. Out of maintaining major legitimate rights and interests such as the life and property of the subject of personal information or other individuals, it is difficult to get my consent;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting and maintaining major legitimate rights and interests but difficult to get personal information that I agree, without asking for consent."}
{"task": "rw_48.jsonl", "id": 53397, "text": "e. The collected your personal information was made to the public by yourself;", "label": ["Important", "First Party Collection Information"], "rewrite": "The collected your personal information is publicly disclosed to the public by itself without asking for consent."}
{"task": "rw_48.jsonl", "id": 53398, "text": "f. Your personal information collected from the legal publicly disclosed information, such as legal news reports and government information disclosure;", "label": ["Important", "First Party Collection Information"], "rewrite": "If you collect your personal information from the legal disclosure information, you do not need to ask for consent."}
{"task": "rw_48.jsonl", "id": 53399, "text": "g. Sign or perform the contract according to your requirements;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collection of personal information necessary for signing or performing the contract does not need to solicit consent."}
{"task": "rw_48.jsonl", "id": 53400, "text": "h. It is necessary to maintain the safe and stable operation of software and related services, such as discovering and disposing of software and related services;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting the personal information necessary for the safe and stable operation of maintenance software and related services, there is no need to solicit consent."}
{"task": "rw_48.jsonl", "id": 53401, "text": "i. It is necessary for legal news reports;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting the personal information necessary for legal news reports does not need to solicit consent."}
{"task": "rw_48.jsonl", "id": 53402, "text": "j. Academic research institutions are necessary to carry out statistics or academic research in accordance with public interests, and when providing academic research or description results, the personal information contained in the results is identified by", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting academic research institutions based on public interests to carry out statistical or necessary personal information in the Institute of Academic Institutes, and identify the personal information contained in the results without soliciting consent."}
{"task": "rw_48.jsonl", "id": 53403, "text": "Other circumstances stipulated by law and regulations.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you collect personal information under other circumstances stipulated in laws and regulations, you do not need to solicit consent."}
{"task": "rw_48.jsonl", "id": 53404, "text": "Special reminder you pay attention, if the information cannot be identified alone or in combination with other information, it is not your personal information in the legal sense;", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53405, "text": "When your information can identify your personal identity alone or in combination with other information, or we will not be able to connect with any specific personal information with other personal information combined with other personal information, this information will be used as you during combination.Personal information is handled and protected in accordance with this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53406, "text": "2. Partners involved in the data use process, transfer, and disclose personal information", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53407, "text": "2.1 The partner involved in the data use process", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53408, "text": "2.1.1 Basic Principles", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53409, "text": "In the process of cooperating with the partners, we will comply with the following principles:", "label": ["Third Party Sharing/ Disclosure", "Data Security"], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53410, "text": "(1) Legal principle: If data processing activities are involved, the principle of legal principles shall be complied with.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Those who involve data processing activities shall abide by the legitimate principles."}
{"task": "rw_48.jsonl", "id": 53411, "text": "(2) The principle of authorization consent:, without your consent, we will not share your personal information. Unless the personal information shared is to identify the information after the processing, and the third party cannot re -identify the natural person.Essence", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Without your consent, we will not share personal information. Unless the share of personal information is to remove information after identifying, and sharing third parties cannot re -identify such information."}
{"task": "rw_48.jsonl", "id": 53412, "text": "If the purpose of third -party information uses information beyond the scope of the original authorization consent, they need to re -obtain your consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If the purpose of third -party information uses information beyond the scope of the original authorization consent, they need to re -obtain your consent."}
{"task": "rw_48.jsonl", "id": 53413, "text": "(3) Principles and minimum necessary principles: The shared data must have a legitimate and legitimate purpose, and the shared data is limited to the purpose of achieving the goal.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "The shared data must have a legitimate and proper purpose, and the shared data is limited to the purpose."}
{"task": "rw_48.jsonl", "id": 53414, "text": "(4) Principles of security and prudential: We will carefully evaluate the purpose of third -party use of shared information, comprehensively evaluate the security guarantee capabilities of these partners, and require them to follow the legal agreement of cooperation.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will carefully evaluate the purpose of third -party use of shared information, comprehensively evaluate the security and guarantee capabilities of these partners, and ask them to follow the legal agreement of cooperation."}
{"task": "rw_48.jsonl", "id": 53415, "text": "We will strictly monitor the software tool development package (SDK) and application interface (API) that the partners obtain information to protect data security.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will strictly monitor the software tool development package (SDK) and application interface (API) that the partners obtain information to protect data security."}
{"task": "rw_48.jsonl", "id": 53416, "text": "Access to a third -party SDK directory", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53417, "text": "2.1.2 Entrusted processing", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53418, "text": "For the scene of commissioning to handle personal information, we will sign the relevant processing agreement with the trustee and cooperation in accordance with the law and supervise the personal information usage activities.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For the scene of commissioning to handle personal information, we will sign the relevant processing agreement with the trustee and cooperation in accordance with the law and supervise the personal information usage activities."}
{"task": "rw_48.jsonl", "id": 53419, "text": "2.1.3 Common processing", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53420, "text": "For the scenario of jointly handling personal information, we will sign relevant agreements with the partners in accordance with the law and agreed that their rights and obligations to ensure that in the process of using relevant personal information and protect the security of data and protect data security.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For the scene of jointly handling personal information, we will sign relevant agreements with the partner and agreed to their respective rights and obligations to ensure that the relevant provisions of the law and protect data security."}
{"task": "rw_48.jsonl", "id": 53421, "text": "2.1.4 The scope of the partner", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53422, "text": "If the specific functions and scenarios involve our affiliates and third parties provide services, the scope of the partner includes our related parties and third parties.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53423, "text": "2.2 Scenes of cooperation", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53424, "text": "2.2.1 Sharing information of function or service", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53425, "text": "(1) Information release: When you choose to publish the information, you can synchronize to Douyin and/or other products or services that are legally operated by our affiliates or third -party or third -party, and may use SDK or related technologiesShare the content, comments, and like information of the providers of these products or services.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When you choose to publish the information to synchronize to our related parties or third -party products or services (Weibo, etc.), it may use the content, comments, and like information shared by SDK or related technologies to shared by SDK or related technologies.Essence"}
{"task": "rw_48.jsonl", "id": 53426, "text": "(2) Login and bind other third -party accounts: When you log in to other third -party products or services with a screened account, or bind the clip account with other third -party accounts, after your consentThe products or services will use your nickname, avatar and other information you authorize.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When you log in to other third -party products or services with a shelter account, or bind the cut account with other third -party accounts, after your consent, the above -mentioned third -party products or services will use your nickname and avatar.And other information you authorize."}
{"task": "rw_48.jsonl", "id": 53427, "text": "(3) Payment function: The payment service in the shelter is provided to you through SDK or related technologies that cooperate with our third -party payment institutions (such as Alipay Payment). To this end, we must synchronize you from these third -party payment institutions to youEquipment identification information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The payment service in the shelter is provided to you through SDK or related technologies that cooperate with our third -party payment institutions (such as Alipay Payment). To this end, we must synchronize your device identification information to these third -party payment institutions."}
{"task": "rw_48.jsonl", "id": 53428, "text": "In addition, other information (including but not limited to your name, bank card information, mobile phone number, etc.) to achieve specific payment functions or services will be applied to the specific agreement reached with you, and it will be collected directly from you to collect you.And assume data -related legal liability.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to realize the specific payment function or other information necessary for the service, the specific agreement reached with you will be applied to you, and it will directly collect and assume data -related legal liabilities."}
{"task": "rw_48.jsonl", "id": 53429, "text": "(4) Message notification: In order to push the message with the terminal model you use, we may use SDK and other technology and terminal equipment manufacturers (Huawei, Xiaomi, OPPO, vivo, etc.) to share mobile phone models, versions and related devicesinformation.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share mobile phone models, versions and related equipment information through SDK and other technologies and terminal equipment manufacturers (Huawei, Xiaomi, OPPO, Vivo, etc.)."}
{"task": "rw_48.jsonl", "id": 53430, "text": "(5) Event participation: When you choose to participate in the marketing activities co -organized by our partners, after your authorization consent, we and partners may need to use your name, communication address, contact information, bank account and other information, In order to cooperate in the direction of you to fulfill the activity reward.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After your authorization consent, we and partners may need to use your name, communication address, contact information, bank account and other information in order to cooperate with you to reward the event reward."}
{"task": "rw_48.jsonl", "id": 53431, "text": "When you participate in the marketing activities co -organized by our related parties, you may synchronize your account (including identifier) and participating progress in multiple participating mobile applications (referred to as \"activity platform\")., Income and other information to ensure that you get a complete service experience in the event.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When you participate in marketing activities, you may synchronize the account (including identifiers), participation progress, income and other information between multiple mobile applications participating in the event."}
{"task": "rw_48.jsonl", "id": 53432, "text": "() Customer service: In order to deal with your complaints, suggestions, and other demands in a timely manner, customer service providers need to use your account and related information, and to understand, process and respond to your needs in a timely manner.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Customer service providers need to use your account and related information, as well as understanding, processing and responding to your needs in a timely manner."}
{"task": "rw_48.jsonl", "id": 53433, "text": "If necessary, you may need to use your mobile phone number or to get in touch with you through other communication methods.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You may also need to use your mobile phone number or contact you through other communication methods."}
{"task": "rw_48.jsonl", "id": 53434, "text": "2.2.2 Implement information -related information sharing", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53435, "text": "We may share and analyze the identified device information or statistical information with advertising service providers, suppliers, and other partners (collectively referred to as \"advertising partners\"). This information is difficult or unable to associate with your true identity.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share with advertising partners to analyze device information or statistical information, which is difficult or unable to associate with your true identity."}
{"task": "rw_48.jsonl", "id": 53436, "text": "This information will help us analyze and measure the effectiveness of advertising and related services.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53437, "text": "(1) Advertising push and launch: We may use device, network, channel information, and label information with partners who are pushing/promoting and advertising.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may use de -identified or anonymous devices, networks, channel information and label information with partners who are pushing/promotion and advertising."}
{"task": "rw_48.jsonl", "id": 53438, "text": "Partners who provide advertisers with offering and promoting services may need to process the aforementioned information to achieve the effective touch rate of advertising, optimization and enhance advertising.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53439, "text": "(2) Advertising statistical analysis: Our related parties, business service providers, suppliers, and partners who push/promote/promote, advertise, and analyze may need to use your equipment, network, advertising click, browsing, display, and advertising.In conversion data and other information, we may also use the above information with the above partners to analyze, measure, and improve the effectiveness of advertising and related services.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Our partners may need to use information such as your device, network, advertising clicks, browsing, display, and advertising transformation data."}
{"task": "rw_48.jsonl", "id": 53440, "text": "(3) The processing of information partners: Advertising partners may combine the above information with other legal obtained data to optimize the effect of advertising.In protecting users' legitimate rights from being violated.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Advertising partners may combine the above information with other legal obtained data to optimize the effect of advertising. We will require it to follow the principles of legal, correct, and necessary principles."}
{"task": "rw_48.jsonl", "id": 53441, "text": "(4) Advertising information: When you actively fill in your contact information, addresses and other information in the advertising display page provided by the advertiser or the service provider you entrusted by the advertiser or its entrusted service provider, this information may be directly collected and processed by the advertiser.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "When you actively fill in your contact information, addresses and other information in the advertiser or the service provider provided by the advertiser or the service provider, this information may be directly collected and processed by the advertiser."}
{"task": "rw_48.jsonl", "id": 53442, "text": "2.2.3 Sharing information of safety and analysis statistics", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53443, "text": "(1) Safety use security: We attach great importance to accounts, services and content security. In order to ensure the account and property security of you and other users, so that you and our legitimate rights and interests are exempted from illegal infringement.It may share the necessary devices, accounts and log information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share the necessary devices, accounts and log information with related parties or service providers."}
{"task": "rw_48.jsonl", "id": 53444, "text": "(2) Analyze product usage: In order to analyze the use of our services and enhance the experience of user use, the statistical data of the use of the use of products (collapse and flashback) with related parties or third -party sharing products may beInformation combines your personal identity.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to analyze the usage of our services, the statistical data of the use of products (collapse and flashback) with related parties or third parties may be used to identify your personal identity with other information with other information."}
{"task": "rw_48.jsonl", "id": 53445, "text": "(3) Academic research and scientific research: In order to improve the scientific research capabilities in related fields and promote the level of scientific and technological development, we may share with scientific research institutes, colleges and other institutions such as scientific research institutes, universities and other institutions on the premiseThe data.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Under the premise of ensuring data security and purpose, we may share with scientific research institutes, universities and other institutions to identify or anonymous data."}
{"task": "rw_48.jsonl", "id": 53446, "text": "2.3 Operation subject change", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53447, "text": "With the continuous development of our business, we will be likely to carry out mergers, acquisitions, and asset transfer, and your personal information may be transferred as a result.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will be likely to be merged, acquired, asset transfer, and your personal information may be transferred as a result."}
{"task": "rw_48.jsonl", "id": 53448, "text": "When the previous description changes, we will require the recipient to protect your personal information in accordance with the laws and regulations and the security standards stated by the privacy policy.Fang Fang has re -obtained your authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will ask the recipient to protect your personal information. Following the party to change the original treatment purpose and method of processing, we will ask the Fang Fang to re -obtain your authorization consent."}
{"task": "rw_48.jsonl", "id": 53449, "text": "2.4 Stop operation", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53450, "text": "If we stop operating products or services, we will stop collecting your personal information in time.", "label": ["Important", "First Party Collection Information", "Cessation of Operations"], "rewrite": "If we stop operating products or services, we will stop collecting your personal information in time."}
{"task": "rw_48.jsonl", "id": 53451, "text": "We will deliver notifications one by one or send you a notification of stopping operations in the form of an announcement, and delete or processes the personal information related to the shutdown products or services that have been closed.", "label": ["Data Retention", "Important", "Cessation of Operations"], "rewrite": "We will deliver notifications one by one or send you a notification of stopping operations in the form of an announcement, and delete or anonymous personal information related to shutdown products or services."}
{"task": "rw_48.jsonl", "id": 53452, "text": "2.5 public", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53453, "text": "(1) We will not disclose your information publicly unless it follows national laws and regulations or obtains your consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not disclose your information publicly unless we follow the national laws and regulations or obtain your consent."}
{"task": "rw_48.jsonl", "id": 53454, "text": "We publicly disclose your personal information to adopt security measures that meet the standards of the industry.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We publicly disclose your personal information to adopt security measures that meet the standards of the industry."}
{"task": "rw_48.jsonl", "id": 53455, "text": "(2) When a penalty announcement of illegal accounts and fraud, we may disclose information about the relevant account.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When a punishment announcement of illegal accounts and fraud, we may disclose information about the relevant account."}
{"task": "rw_48.jsonl", "id": 53456, "text": "2.6 Personal information that obtains consent to sharing, transfer, and publicly disclosed in accordance with the law", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53457, "text": "Please understand that in the following circumstances, according to laws and regulations and national standards, partners use, or we transfer or disclose your personal information without obtain your authorization consent:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the following circumstances, according to laws and regulations and national standards, partners use, or we transfer or disclose your personal information without obtain your authorization consent:"}
{"task": "rw_48.jsonl", "id": 53458, "text": "(1) For the contract for the contract to establish and fulfill your contract as a party, or implement human resource management in accordance with the labor rules and regulations and collective contracts signed in accordance with the law in accordance with the law;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The personal information of the transfer, publicly concluding, and fulfilling the contract, or the implementation of the personal information necessary for human resource management does not need to solicit consent."}
{"task": "rw_48.jsonl", "id": 53459, "text": "(2) To fulfill the statutory duties or the requirements of the statutory volunteer;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The transfer, public performance of statutory duties, or personal information necessary for the legal obligations does not need to solicit consent."}
{"task": "rw_48.jsonl", "id": 53460, "text": "(3) Directly related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The transfer of personal information directly related to national security and national defense security does not need to ask for consent."}
{"task": "rw_48.jsonl", "id": 53461, "text": "(4) Directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Direct related personal information such as transfer, openness with criminal investigation, prosecution, trial, and judgment implementation does not need to solicit consent."}
{"task": "rw_48.jsonl", "id": 53462, "text": "(5) In order to deal with emergencies, or in emergency situations, it is necessary to protect the health and property safety of natural people;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Transfer, publicly respond to public health incidents, or personal information necessary for protecting life and health and property security under emergencies, without asking for consent."}
{"task": "rw_48.jsonl", "id": 53463, "text": "(6) Implement news reports, public opinion supervision and other behaviors for public interests, and handle personal information within a reasonable scope;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to implement news reports and supervision of public opinion, if you handle personal information within a reasonable range, you do not need to solicit consent."}
{"task": "rw_48.jsonl", "id": 53464, "text": "(7) Process your own personal information in accordance with relevant laws and regulations;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "It does not need to solicit consent according to the relevant laws and regulations, or other legal information that has been legal and disclosed."}
{"task": "rw_48.jsonl", "id": 53465, "text": "(8) Collect personal information from the information disclosed legal and publicly disclosed;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you collect personal information from the legal disclosure information, you do not need to ask for consent."}
{"task": "rw_48.jsonl", "id": 53466, "text": "(9) Other circumstances stipulated in laws and administrative regulations.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Dives and disclose personal information under other circumstances stipulated in laws and administrative regulations without asking for consent."}
{"task": "rw_48.jsonl", "id": 53467, "text": "3. Manage your personal information", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53468, "text": "We attach great importance to your management of personal information, and do our best to protect your personal information review, replication, correction, supplement, deletion, withdrawal of consent authorization, canceling account number, complaint reportingGuarantee your personal information security.", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "Do your best to protect your rights to check, copy, correct, replenish, delete, withdraw, cancel account number, and report reports such as consent, and withdraw from your personal information."}
{"task": "rw_48.jsonl", "id": 53469, "text": "But please understand that specific business functions and services will need your information to be completed. When you withdraw your consent or authorization, we cannot continue to provide you with the corresponding functions and services, and we will no longer deal with your corresponding personal information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Specific business functions and services will need your information to complete. When you withdraw consent or authorization, we cannot continue to provide you with the corresponding functions and services, and we will not process your corresponding personal information."}
{"task": "rw_48.jsonl", "id": 53470, "text": "But your decision to withdraw consent or authorization will not affect our personal information processing activities that we have carried out based on your previous authorization.", "label": ["Important", "First Party Collection Information"], "rewrite": "The decision you withdraw from consent or authorization will not affect our personal information processing activities that we have carried out based on your authorization."}
{"task": "rw_48.jsonl", "id": 53471, "text": "There may be differences in the paths of the management methods provided by different software versions or operating systems we cut, please refer to the actual situation.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53472, "text": "3.1 Setting management", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53473, "text": "3.1.1 Basic function mode", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53474, "text": "(1) The basic functional services of the shelter include basic video creation, editing functions, and basic video content browsing functions.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53475, "text": "(2) If you only want to use the basic functional service of the screened, you can closely close the \"personalized content recommendation\" and \"personalized advertising recommendation\" before the pop -up window of \"cutting\" personal information protection guidanceItems", "label": ["Important", "Edit/Control"], "rewrite": "You can close \"Personalized Content Recommendations\" and \"Personalized Advertising Recommendation\" before the pop -up guidance of \"cutting\" personal information protection guidance for the first time."}
{"task": "rw_48.jsonl", "id": 53476, "text": "Other value -added function services, we will pop up a separate pop -up window to remind you, and only provide you with the consent of your authorization and collect relevant necessary information;", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "For other value -added function services, we will pop up the window to remind you alone, and only provide you with the authorization and consent of your authorization and collect relevant necessary information."}
{"task": "rw_48.jsonl", "id": 53477, "text": "Please note that you will automatically exit the basic functional mode automatically after you make a separate authorization consent (including but not limited to your proactive login of the cutting, actively accepting the user experience improvement plan, etc.).", "label": ["Permission Acquisition", "Important"], "rewrite": "After you make a separate authorization consent (including but not limited to your proactive login of the cutting, actively accepting the user experience improvement plan, etc.), you will automatically exit the basic function mode."}
{"task": "rw_48.jsonl", "id": 53478, "text": "If you have previously accepted all functions and services/enter the normal service mode, at this time, you can close \"personalized content recommendation\", close \"personalized advertising recommendation\", withdraw from login, exit user experience improvement plan, and withdraw you with youEnter the basic functional mode after each individual authorization consent.", "label": ["Important", "Edit/Control"], "rewrite": "You can enter the basic functional model by closing \"personalized content recommendation\", closing \"personalized advertising recommendation\", withdrawing login, exit user experience improvement plan, and withdrawal of various separate authorization consent."}
{"task": "rw_48.jsonl", "id": 53479, "text": "(3) Under the basic function mode item of the shelter, we will only collect and process your necessary personal information based on the need to provide basic functional services and ensure the safety of operational operation.", "label": ["Important", "First Party Collection Information"], "rewrite": "Under the basic function mode item of screening, we will only collect and process your necessary personal information based on the need to provide basic functional services and ensure the needs of operational security."}
{"task": "rw_48.jsonl", "id": 53480, "text": "3.1.2 System permissions settings", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53481, "text": "a), you can go directly to the setting page of the device/system, or use [Settings]-[Personal Information Collection Settings] to jump the aforementioned device/system settings page through the clip end.Equipment to change the scope of authorization or withdraw your authorization.", "label": ["Important", "Edit/Control"], "rewrite": "You can go directly to the settings page, or through the [Settings]-[Personal Information Collection Settings], jump to the aforementioned device/system settings page, open or close the permissions you granted to the scales, change the scope of authorization or the scope of authorization orWithdrawing authorization."}
{"task": "rw_48.jsonl", "id": 53482, "text": "After withdrawal authorization, we will no longer collect information related to these permissions, but it will not affect our personal information processing activities that we have carried out based on your authorization.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "After withdrawal authorization, we will no longer collect information related to these permissions, but it will not affect our personal information processing activities that we have carried out based on your authorization."}
{"task": "rw_48.jsonl", "id": 53483, "text": "You can read the application and usage of cutting permissions to understand the situation of the application and use system permissions.", "label": ["Edit/Control", "Important"], "rewrite": "You can read the application and usage of cutting permissions to understand the situation of the application and use system permissions."}
{"task": "rw_48.jsonl", "id": 53484, "text": "b), you can select the system notification of whether to receive the shelter sent in the setting page of the device/system, or set the form of the system notification you want to receive.", "label": ["Edit/Control", "Important"], "rewrite": "You can select the system notification of whether to receive the shelter sent in the setting page of the device/system, or set the form of the system notification you want to receive."}
{"task": "rw_48.jsonl", "id": 53485, "text": "3.1.3 Management of personalized content recommendation", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53486, "text": "For details, please refer to Article 1.11.2 (1) [Personalized Recommended Settings].", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53487, "text": "3.1.4 Management Advertising Push", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53488, "text": "For details, please refer to Article 1.11.3 (1) [Understanding and Management Advertising Push] for details.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53489, "text": "3.2 Check, correct, supplement, and delete your personal information", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53490, "text": "(1) You can check your account information, basic information and other information by cutting [Settings]-[Personal Information Review and Management].", "label": ["Important", "Edit/Control"], "rewrite": "You can check your account information, basic information and other information by cutting [Settings]-[Personal Information Review and Management]."}
{"task": "rw_48.jsonl", "id": 53491, "text": "(2) You can check the summary of our personal information in the [Settings]-[Information Collection List and Access Partner Catalog] in the mobile terminal.", "label": ["Important", "Edit/Control"], "rewrite": "You can check the summary of our personal information we collected in the [Settings]-[Information Collection List and Access Catalog] in the mobile terminal."}
{"task": "rw_48.jsonl", "id": 53492, "text": "For details, please refer to the list of personal information collection and access partner catalog", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53493, "text": "(3) You can visit and check the account information you follow in [Mine]-[Follow] in the mobile terminal.According to the corresponding attention account homepage, you can choose to cancel the account.", "label": ["Important", "Edit/Control"], "rewrite": "You can visit and check your account information you follow in the [My]-[Follow] in the mobile terminal."}
{"task": "rw_48.jsonl", "id": 53494, "text": "(4) You can access/delete your work information, access/delete the information you like (like), or visit the template draft/deletion/delete the work information you posted in the mobile terminal.Tutorial and other content (if any).", "label": ["Important", "Edit/Control"], "rewrite": "You can access/delete your work information, access/delete the information you like (like), or visit the template draft/tutorials you posted in the [I]-[Works] in the mobile terminal.(If any)."}
{"task": "rw_48.jsonl", "id": 53495, "text": "(5) For consideration of security and identity, you may not be able to modify some registration information submitted during the registration or use during the registration (after the real -name authentication information, if there is); if there is);", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "You may not be able to modify some registered information submitted during the registration or use during the registration (after the real -name authentication information, if there is)."}
{"task": "rw_48.jsonl", "id": 53496, "text": "If you really need to modify this type of information, please contact us by email (jianying.service@bytedance.com), we will review the issues involved as soon as possible, and reply to your user identity in a timely manner.", "label": ["Important", "Contact Information"], "rewrite": "It is indeed necessary to modify this type of information, please contact us by email (jianying.service@bytedance.com)."}
{"task": "rw_48.jsonl", "id": 53497, "text": "3.3 Copy and transfer your personal information", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53498, "text": "If you need to copy your personal information that we collect and store, you can contact us through the contact information listed in Article 3.2 (7) mentioned above.", "label": ["Important", "Edit/Control"], "rewrite": "If you need to copy your personal information that we collect and store, you can contact us through the contact information listed in Article 3.2 (7) mentioned above."}
{"task": "rw_48.jsonl", "id": 53499, "text": "If you need to transfer your personal information we collect and store, we will provide you with a transfer path according to the requirements of laws and regulations.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53500, "text": "3.4 Account Logging", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53501, "text": "You can cut the mobile client [Settings],-[Feedback of Opinions] contact us to apply for a cancellation of your account. We will deal with it in time after receiving your application, and on 15 working days or laws and regulations requirementsReply to your request within the time limit.", "label": ["Important", "Edit/Control"], "rewrite": "You can cut the mobile client [Settings] -[Feedback of Opinions] contact us to apply for a cancellation of your account."}
{"task": "rw_48.jsonl", "id": 53502, "text": "Before you cancel your account, we will verify your personal identity, security state, equipment information, etc.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53503, "text": "You know and understand that the cancellation account is an irreversible behavior. When you cancel your account, we will delete relevant information about you or perform anonymous processing, except for the laws and regulations.", "label": ["Data Retention", "Edit/Control", "Important"], "rewrite": "When you cancel your account, we will delete the relevant information about you or perform anonymous processing, except for the laws and regulations."}
{"task": "rw_48.jsonl", "id": 53504, "text": "After you cancel your account, we will delete relevant information about you or perform anonymized processing, except for other provisions of laws and regulations.", "label": ["Important", "Edit/Control"], "rewrite": "After canceling the account, we will delete relevant information about your relevant information or perform anonymous processing, except for other provisions of laws and regulations."}
{"task": "rw_48.jsonl", "id": 53505, "text": "For details, please refer to the cancellation account cancellation agreement.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53506, "text": "In addition, if you have any claims, requirements, or questions that you have the right to personal information given by relevant laws and regulations, you can contact us through opinion feedback or sending emails to jianying.service@bytedance.com, we will review the office as soon as possible as soon as possibleInvolved in the question and recovered within 15 working days after verifying your user identity.", "label": ["Important", "Contact Information"], "rewrite": "You can contact us through opinion feedback or sending emails to jianying.service@bytedance.com."}
{"task": "rw_48.jsonl", "id": 53507, "text": "4. How do we protect personal information security", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53508, "text": "(1) We attach great importance to your personal information security, and we will strive to take reasonable security measures (including technical and management) to protect your personal information and prevent your personal information from being used in improperly or in unauthorized situations.It was interviewed, publicly disclosed, used, modified, damaged, lost or leaked.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53509, "text": "(2) We will use the encryption technology, anonymous treatment, and related reasonable and feasible methods that are not lower than industry peers to protect your personal information, and use a security protection mechanism to prevent your personal information from being maliciously attacked.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53510, "text": "(3) We will establish a special security department, security management system, and data security process to ensure your personal information security.", "label": ["Important", "Data Security"], "rewrite": "It will establish a special security department, security management system, data security process to ensure your personal information security."}
{"task": "rw_48.jsonl", "id": 53511, "text": "We adopt strict data use and access systems to ensure that only authorized personnel can access your personal information and conduct security audits of data and technology in a timely manner.", "label": ["Important", "Data Security"], "rewrite": "Adopt strict data use and access system to ensure that only authorized personnel can access your personal information and conduct security audits of data and technology in a timely manner."}
{"task": "rw_48.jsonl", "id": 53512, "text": "At present, the shelter has passed the evaluation and filing of national information security level protection (level three).", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53513, "text": "(4) Although the above -mentioned reasonable and effective measures have been taken and the standards required by relevant legal regulations have been adopted, please understand that due to the technical restrictions and various malicious means that there may beSecurity measures cannot always ensure that the information is 100 % security. We will try our best to ensure the security of our personal information.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53514, "text": "(5) You know and understand that the system and communication network you used to access our services may have problems due to factors outside the control scope.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53515, "text": "Therefore, we strongly recommend that you take positive measures to protect the security of personal information, including but not limited to the use of complex passwords, regularly modify the password, do not disclose your account password and related personal information to others.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53516, "text": "(6) We will develop an emergency treatment plan and immediately start the emergency plan when the user information security incident occurs, and strive to prevent the impact and consequences of these security events expand.", "label": ["Important", "Data Security"], "rewrite": "We will develop an emergency treatment plan and immediately start the emergency plan when the user information security incident occurs, and strive to prevent the impact and consequences of these security events expand."}
{"task": "rw_48.jsonl", "id": 53517, "text": "Once the user information security incident (leaked and lost) occurs, we will inform you in a timely manner in accordance with the requirements of the laws and regulations: the basic situation and possible impact of security incidents, the disposal measures we have taken or we will takeAnd reducing risk suggestions, remedy measures for you.", "label": ["Important", "Data Security"], "rewrite": "Once the user information security incident (leaked and lost) occurs, I will inform you in time: the basic situation and possible impact, disposal measures, suggestions, and remedy measures of the security incident."}
{"task": "rw_48.jsonl", "id": 53518, "text": "We will promptly inform you of the incident -related situation with push notifications, emails, letters, text messages, and related forms. When it is difficult to inform them one by one, we will publish a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "We will promptly inform you of the incident -related situation with push notifications, emails, letters, text messages, and related forms. When it is difficult to inform them one by one, we will publish a reasonable and effective way."}
{"task": "rw_48.jsonl", "id": 53519, "text": "At the same time, we will also report to the disposal of user information security incidents in accordance with the requirements of the relevant regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "We will also report to the disposal of user information security incidents in accordance with the requirements of the relevant regulatory authorities."}
{"task": "rw_48.jsonl", "id": 53520, "text": "(7) Once you leave the shelter and related services, browse or use other websites, services and content resources, we will not be able to protect your personal information submitted by software and website in other doors and related services.Whether you log in, browse, or use the above software, or whether the website is based on the clip -based link or guidance.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53521, "text": "5. How do we store personal information", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53522, "text": "5.1 Storage location", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53523, "text": "In accordance with the provisions of laws and regulations, we will store your personal information collected and generated during the domestic operation process in the territory of the People's Republic of China.", "label": ["Data Retention", "Important"], "rewrite": "In accordance with the provisions of laws and regulations, we will store your personal information collected and generated during the domestic operation process in the territory of the People's Republic of China."}
{"task": "rw_48.jsonl", "id": 53524, "text": "At present, we will not transmit the above information overseas. If we transmit to overseas, we will follow relevant state regulations or solicit your consent.", "label": ["Data Retention", "Important"], "rewrite": "We will not transmit the above information abroad. If we transmit to overseas, we will follow relevant state regulations or seek your consent."}
{"task": "rw_48.jsonl", "id": 53525, "text": "5.2 Storage period", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53526, "text": "5.2.1, we only retain your personal information during the period for providing the purpose of providing screening and related services: the information, comments, likes (likes) and related information you publishWe will retain relevant information during the period of not canceling the account.", "label": ["Data Retention", "Important"], "rewrite": "We only retain your personal information during the period for providing the purpose of providing scales and related services. We will retain relevant information when you have not withdrawn, delete or cancel accounts."}
{"task": "rw_48.jsonl", "id": 53527, "text": "After exceeding the necessary period, we will delete or processes your personal information, except for other regulations.", "label": ["Data Retention", "Important"], "rewrite": "After exceeding the necessary period, we will delete or processes your personal information, except for other regulations."}
{"task": "rw_48.jsonl", "id": 53528, "text": "5.2.2, if you cancel your account, take the initiative to delete your personal information, or go beyond the necessary period, we will delete or anonymous processing your personal information, except the following situations:", "label": ["Data Retention", "Important"], "rewrite": "After canceling the account, actively delete personal information, or exceed the necessary period, we will delete or processes your personal information, except for the following situations:"}
{"task": "rw_48.jsonl", "id": 53529, "text": "(1) Comply with the requirements for information retention of laws and regulations (for example: the \"E -commerce Law\" stipulates that the time for the saving time of goods and service information and transaction information is not less than three years from the date of completion of the transaction).", "label": ["Data Retention", "Important"], "rewrite": "If you comply with the requirements for information retention of laws and regulations, you will not delete or processes personal information."}
{"task": "rw_48.jsonl", "id": 53530, "text": "(2) For the purpose of finance, auditing, and dispute resolution, the period needs to be reasonably extended.", "label": ["Data Retention", "Important"], "rewrite": "For the purpose of financial, auditing, and dispute resolution, the period needs to be reasonably extended, and personal information will not be deleted or anonymized."}
{"task": "rw_48.jsonl", "id": 53531, "text": "6. Terms of minors", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53532, "text": "(1) If you are a minor under the age of 18, you should read and agree with your parents or other guardians under the supervision and guidance of your parents or other guardians before using the shelter and related services.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53533, "text": "(2) If you are a guardian of minors under the age of 14, you should read and agree to your privacy policy for your guardian before using the shelter and related services.", "label": ["Specific Audiences", "Important"], "rewrite": "The guardians of minors under the age of 14 should read and agree to the privacy policy for your guardian before using sheltering and related services."}
{"task": "rw_48.jsonl", "id": 53534, "text": "(3) In accordance with the provisions of relevant national laws and regulations, we can protect the personal information of minors in accordance with the provisions of the relevant national laws and regulations, and will only collect, use, share or disclose minors to collect, use, share, or disclose minors when legal permission, parents or other guardians need to protect or protect minors.Personal information;", "label": ["Specific Audiences", "Important"], "rewrite": "We will only collect, use, share, or disclose personal information of minors when legal permission, parents or other guardians need to collect or protect minors."}
{"task": "rw_48.jsonl", "id": 53535, "text": "If we find that the personal information of minors is collected without the consent of parents or other guardians who can be proven in advance, we will try to delete relevant information as soon as possible.", "label": ["Specific Audiences", "Important"], "rewrite": "If we find that the personal information of minors is collected without the consent of parents or other guardians who can be proven in advance, we will try to delete relevant information as soon as possible."}
{"task": "rw_48.jsonl", "id": 53536, "text": "(4) If you are the guardian of a minor, when you have any questions about the personal information of the minors you monitor, please contact us through the contact information of the privacy policy.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53537, "text": "7. Consultation and revision of privacy policies", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53538, "text": "7.1 Review", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53539, "text": "(1) You can check the privacy policy on the [Settings]- [Privacy Terms] page on the login page or log in to the clip account.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53540, "text": "(2) Please understand that in order to meet the needs of the operation, we may develop different versions according to factors such as the mobile phone model, system version, and mobile clients you use. ThereforeThere is a difference between this privacy policy, but it will not affect the purpose, method and scope of data processing. The specific available functions are based on the actual use of your use.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53541, "text": "7.2 Update and notice", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53542, "text": "(1) In order to provide you with better services, wearing products and services will be updated and changed from time to time, and we will revise this privacy policy in a timely manner.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53543, "text": "Without your clear consent, we will not reduce the rights you should enjoy based on the current effective privacy policy.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53544, "text": "(2) After the privacy policy is updated, we will issue an updated version in the shelter, and remind you of the updated content in the station or other appropriate methods so that you can understand the latest version of this privacy policy in time.", "label": ["Policy Change", "Important"], "rewrite": "After the privacy policy is updated, we will issue a updated version and remind you of the updated content through the letter or other appropriate ways in the site."}
{"task": "rw_48.jsonl", "id": 53545, "text": "(3) We may also help you better manage your personal information through functional updates. Please pay attention to the relevant function description.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53546, "text": "8 Contact us", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53547, "text": "8.1 Complaints and reports", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53548, "text": "If you think your personal information rights may be infringed, or you find a clue to infringe the right to personal information, you can use user feedback function or [jianying.service@bytedance.com] with us in [Settings]-[Opinion Feedback].get in touch.", "label": ["Important", "Contact Information"], "rewrite": "You can get in contact with us through user feedback function or via [jianying.service@bytedance.com] through user feedback function."}
{"task": "rw_48.jsonl", "id": 53549, "text": "After we verify our complaints and reports within 15 working days.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53550, "text": "8.2 Other problems", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53551, "text": "If you have questions or suggestions on personal information protection, you can choose to contact us through the following ways:", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53552, "text": "a), send mail to dataprivacy@bytedance.com or jianying.service@bytedance.com", "label": ["Important", "Contact Information"], "rewrite": "Send mail to dataprivacy@bytedance.com or jianying.service@bytedance.com."}
{"task": "rw_48.jsonl", "id": 53553, "text": "b), mail to the China Satellite Communications Building, Ministry of Legal Affairs, Data Security and Privacy Protection Center", "label": ["Important", "Contact Information"], "rewrite": "You can mail to the Data Security and Privacy Protection Center of the Ministry of Legal Affairs of China Satellite Communications Building, Haidian District, Beijing."}
{"task": "rw_48.jsonl", "id": 53554, "text": "We will review your questions or suggestions as soon as possible and reply within 15 working days after verifying your user identity.", "label": [], "rewrite": []}
{"task": "rw_48.jsonl", "id": 53555, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
