{"task": "rw_41.jsonl", "id": 50999, "text": "Privacy policy update (Date: December 3, 2021)", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51000, "text": "introduction", "label": [], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51001, "text": "Tencent strictly abides by laws and regulations, follows the following principles of privacy protection, and provides you with more secure and reliable services:", "label": ["Data Security"], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51002, "text": "·Safe and reliable:", "label": ["Data Security"], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51003, "text": "We do our best to prevent your information leakage, damage, and loss through reasonable and effective information security technology and management processes.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51004, "text": "· Autonomous choice:", "label": ["Data Security"], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51005, "text": "We provide you with convenient information management options so that you can make appropriate choices and manage your personal information.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51006, "text": "· Protect communication secret:", "label": ["Data Security"], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51007, "text": "We strictly follow laws and regulations to protect your communication secrets and provide you with secure communication services.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51008, "text": "· Reasonable necessity:", "label": ["Data Security"], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51009, "text": "In order to provide better services to you and other users, we only collect the necessary information.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51010, "text": "·Open and transparent:", "label": ["Data Security"], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51011, "text": "We strive to use concise and easy -to -understand expressions to introduce you privacy policies in order to clearly understand our information processing methods.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51012, "text": "· Incorporate privacy protection into product design:", "label": ["Data Security"], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51013, "text": "We are integrated into the concept of privacy protection in all aspects of product and service research and development and operation.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51014, "text": "\"Tencent Privacy Policy\" mainly explains you:", "label": [], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51015, "text": "What information do we collect", "label": [], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51016, "text": "We collect the use of information", "label": [], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51017, "text": "The right you enjoy", "label": [], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51018, "text": "You can read the \"Tencent Privacy Policy\" (hereinafter referred to as the \"Privacy Policy\"), and learn more about our collection and use of personal information in order to better understand our services and make appropriate choices.", "label": [], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51019, "text": "If our specific products and services have specific guidelines for privacy protection, you can check the guidance of this specific privacy protection to help you better protect your personal information.", "label": [], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51020, "text": "The products and services applicable to this privacy policy are provided by Shenzhen Tencent Computer Systems Co., Ltd.", "label": [], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51021, "text": "The registered address is the 35th floor of Tencent Building, Tencent Building, Miaoling Community, Yuehai Street, Nanshan District, Shenzhen.", "label": [], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51022, "text": "In addition to another agreement, the term used in this privacy policy has the same meaning as the terms in the Tencent Service Agreement.", "label": [], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51023, "text": "If you have any questions, please contact us.", "label": [], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51024, "text": "The information we collect", "label": [], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51025, "text": "In accordance with the requirements of laws and regulations, we follow the principles of legal, correctness, necessary, and integrity, and collect only personal information necessary for realizing product functions.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "Follow the principles of legal, correctness, necessary, and integrity, and collect only the necessary personal information."}
{"task": "rw_41.jsonl", "id": 51026, "text": "This information includes:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51027, "text": "You actively provide information when using our service", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51028, "text": "· When you register or use our products or services, you actively fill in or upload your nicknames, mobile phone numbers, avatars, pictures, etc.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect the information provided by you when registering or using products or services."}
{"task": "rw_41.jsonl", "id": 51029, "text": "· The information you submitted through our customer service or participating in the activities we organized.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect the information you submitted during customer service or participating in the event."}
{"task": "rw_41.jsonl", "id": 51030, "text": "· Some of our specific services may require you to provide specific personal information to achieve related functions.", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51031, "text": "If you choose not to provide such information, it will not affect other functions in your product or service.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51032, "text": "The information we get when you use the service", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51033, "text": "· Log information", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51034, "text": "For example, when you use our services, in order to maintain the safe and stable operation of products and services, we may collect related information such as equipment information, software information, service log information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect equipment information, software information, and service log information to maintain the safe and stable operation of products and services."}
{"task": "rw_41.jsonl", "id": 51035, "text": "·location information", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51036, "text": "For example, when you use the service related to the location, we may record the location of your device to provide you with related services.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Record the location information of your device to think you provide related services."}
{"task": "rw_41.jsonl", "id": 51037, "text": "You or other users may include the geographical information information provided by your service when using the service, such as the geographical mark information contained in the photos shared by you or others.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect information containing geographical information that you provide when using the service."}
{"task": "rw_41.jsonl", "id": 51038, "text": "GPS location information is a sensitive personal information. If you refuse to provide this information, it will not affect other functions of your product or service, which will only affect the function related to geographic location.", "label": ["Important", "First Party Collection Information"], "rewrite": "You refuse to provide the GPS information only affects the function related to geographical location."}
{"task": "rw_41.jsonl", "id": 51039, "text": "· Other related information", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51040, "text": "In order to help you better use our products or services, after your clear authorization, we may collect relevant information. For example, if you choose to open the introduction of the address book, we may encrypt your contact name and phone number, and we mayCollect only encrypted information.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "You have authorized the collection information to help you use the product or service, such as collecting the encrypted phone number and the name of the contact person to use the address book function."}
{"task": "rw_41.jsonl", "id": 51041, "text": "The information shared by other users contains your information", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting the information shared by other users contain your information."}
{"task": "rw_41.jsonl", "id": 51042, "text": "For example, photos or shared videos posted by other users may include your information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51043, "text": "Information obtained by other situations", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51044, "text": "In the case of law, after your consent, we may get information that you generate or shared when you use third -party partnership services.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will obtain or shared the information you generate or shared when you use the third -party partner service."}
{"task": "rw_41.jsonl", "id": 51045, "text": "For example, when you log in to third -party partner services with WeChat or QQ account, we will get information such as the name of your third -party partner service to facilitate your authorization management.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect information about the names of your login of the third -party partner service to facilitate your authorization management."}
{"task": "rw_41.jsonl", "id": 51046, "text": "You can read user agreements and privacy policies for third -party partners to understand the relevant content.", "label": [], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51047, "text": "How do we use information", "label": [], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51048, "text": "We strictly abide by the provisions of laws and regulations and the agreement with users, and use the collected information for the following uses.", "label": ["Usage"], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51049, "text": "If we use your information below, we will explain to you again and obtain your consent.", "label": ["Important", "Data Security"], "rewrite": "If you use information beyond your use, it will once again explain and obtain consent."}
{"task": "rw_41.jsonl", "id": 51050, "text": "Provide you with service", "label": ["Usage"], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51051, "text": "Meet your personalized needs", "label": ["Important", "Usage"], "rewrite": "Use your information to meet your personalized needs."}
{"task": "rw_41.jsonl", "id": 51052, "text": "For example, language settings, location settings, and personalized help services.", "label": ["Important", "Usage"], "rewrite": "Use your information for language settings, location settings, and personalized help services."}
{"task": "rw_41.jsonl", "id": 51053, "text": "Security", "label": ["Usage"], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51054, "text": "For example, we will use your information for authentication, security precautions, anti -fraud monitoring, archive backup, customer security services, etc.", "label": ["Important", "Usage"], "rewrite": "Use your information for authentication, security prevention, anti -fraud monitoring, archive backup, customer security services, etc."}
{"task": "rw_41.jsonl", "id": 51055, "text": "For example, the security software you downloaded or installed will detect malware or viruses or identify fraud information for you.", "label": ["Usage"], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51056, "text": "Recommend to you advertisement, information, etc. to you may be interested", "label": ["Important", "Usage"], "rewrite": "Use your information to recommend advertisements, information, etc. to you that you may be interested in."}
{"task": "rw_41.jsonl", "id": 51057, "text": "Evaluate and improve the effects of our advertising and other promotions and promotion activities", "label": ["Important", "Usage"], "rewrite": "Use your information assessment and improve the effects of our advertising and other promotions and promotion activities."}
{"task": "rw_41.jsonl", "id": 51058, "text": "Management software", "label": ["Important", "Usage"], "rewrite": "Use your information management software."}
{"task": "rw_41.jsonl", "id": 51059, "text": "For example, software certification, software upgrade, etc.", "label": ["Usage"], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51060, "text": "Invite you to participate in the survey of our service", "label": ["Usage"], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51061, "text": "In order to allow you to have a better experience, improve our services or other purposes you agree with, under the premise of compliance with relevant laws and regulations, we may use the information collected by certain services for our other services.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Use your information to improve services or other purposes you agree with."}
{"task": "rw_41.jsonl", "id": 51062, "text": "For example, the information of your information when using our service, for personalized service experience, user research and analysis and statistics.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The information of your information when using the service, for personalized service experience, user research and analysis and statistics."}
{"task": "rw_41.jsonl", "id": 51063, "text": "In order to ensure the security of services and help us better understand the operation of our application, we may record relevant information, for example, you use the frequency, failure information, overall usage conditions, performance data, and the source of the application.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Record your application information to ensure the security of the service."}
{"task": "rw_41.jsonl", "id": 51064, "text": "We will not store the information we store in the analysis software with the personal identity information you provided in the application.", "label": ["Important", "Usage"], "rewrite": "We will not combine the information stored in the analysis software with the personal identity information you provide."}
{"task": "rw_41.jsonl", "id": 51065, "text": "With the development of the business, the product functions and services we provide may be adjusted and changed. If the purpose of the treatment is changed, we will explain it to you again and obtain your consent.", "label": ["Important", "Data Security"], "rewrite": "If the purpose of the processing of personal information is changed, we will explain to you again and obtain your consent."}
{"task": "rw_41.jsonl", "id": 51066, "text": "How do we use cookie, identifier and related technologies", "label": [], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51067, "text": "Cookie, logo and related technologies are commonly used in the Internet industry.", "label": [], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51068, "text": "According to the relevant provisions of laws and regulations, we or our third -party partners may collect your information by putting safe cookies, identifiers, and related technologies in order to provide you with better user experience and services.", "label": ["Important", "First Party Collection Information"], "rewrite": "You may collect your information by putting safe cookies, identifiers, and related technologies."}
{"task": "rw_41.jsonl", "id": 51069, "text": "We will strictly require third -party partners to abide by the relevant provisions of this privacy policy.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51070, "text": "If you want to know more about the security of Cookie, please refer to the Cookie Policy Explanation.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51071, "text": "The information you share", "label": [], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51072, "text": "You can share your information with your friends, family and other users through our services.", "label": ["Important", "Edit/Control"], "rewrite": "You can share your relevant information with your friends, family and other users."}
{"task": "rw_41.jsonl", "id": 51073, "text": "Please note that this may include sensitive information such as your personal identity information and personal property information.", "label": ["Important", "Edit/Control"], "rewrite": "The information you share may include sensitive information such as your personal identity information, personal property information."}
{"task": "rw_41.jsonl", "id": 51074, "text": "Please consider disclosing your relevant personal sensitive information.", "label": ["Important", "Edit/Control"], "rewrite": "Please consider disclosing your relevant personal sensitive information."}
{"task": "rw_41.jsonl", "id": 51075, "text": "You can control the scope of your sharing information through the privacy settings in our service. You can also delete the information you shared publicly through the service settings or the guidelines we provide.", "label": ["Important", "Edit/Control"], "rewrite": "You can control the scope of your information through privacy settings, or delete the information you shared publicly through the service settings or guidelines in the service."}
{"task": "rw_41.jsonl", "id": 51076, "text": "But please note that this information may still be stored independently by other users or non -associated third parties that are not controlled by us.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "After deleting the information you actively shared, it may still be stored independently by other users or non -affiliated third parties that are not controlled by us."}
{"task": "rw_41.jsonl", "id": 51077, "text": "How do you manage your information", "label": [], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51078, "text": "In the process of using our service, you can manage your information by checking, replicating, correcting, completing, deleting, etc.", "label": ["Important", "Edit/Control"], "rewrite": "You can manage your information by checking, replication, correction, supplementation, deletion, etc."}
{"task": "rw_41.jsonl", "id": 51079, "text": "When you use our specific products and services, you can consult its independent privacy protection guidelines. We specifically described the ways and methods of your personal information in these guidelines to help you better protect your individualsinformation.", "label": ["Important", "Edit/Control"], "rewrite": "When you use specific products and services, you can consult its independent privacy protection guidelines."}
{"task": "rw_41.jsonl", "id": 51080, "text": "For example, if you use geographical related services, you want to stop sharing your geographical location information, you can stop sharing by the closing method of closing functions, software and hardware service providers and communication service providers through your mobile phone. It is recommended that you read related guidelines carefully.Essence", "label": ["Important", "Edit/Control"], "rewrite": "You can stop sharing geographical information through your mobile phone positioning function, software and hardware service providers and communication service providers."}
{"task": "rw_41.jsonl", "id": 51081, "text": "When you exercise the above rights, we may ask you to verify your identity to ensure account security.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51082, "text": "If you have any questions, please contact us through the contact information listed in this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51083, "text": "Please understand that due to technical restrictions, laws, or regulatory requirements, we may not be able to meet all your requirements, and we will feedback within the time limit stipulated by laws and regulations.", "label": ["Important", "Edit/Control"], "rewrite": "Due to technical restrictions, laws, or regulatory requirements, we may not be able to meet all your requirements and feedback within the time limit stipulated by laws and regulations."}
{"task": "rw_41.jsonl", "id": 51084, "text": "At the same time, we will continue to optimize products and services to protect your rights.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51085, "text": "Third -party data processing and information disclosure of information", "label": [], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51086, "text": "In the process of cooperating with third parties, we will comply with legal provisions and handle related data carefully and prudent relevant data in accordance with the principle of minimum necessary and necessary principles.", "label": ["Important", "Data Security"], "rewrite": "In the process of cooperating with third parties, we will process relevant data in accordance with the principle of minimum necessary principles."}
{"task": "rw_41.jsonl", "id": 51087, "text": "We will strictly restrict the third parties involved in data processing in accordance with the provisions of laws and regulations.", "label": ["Important", "Data Security"], "rewrite": "We have strict restrictions on third parties involved in data processing."}
{"task": "rw_41.jsonl", "id": 51088, "text": "It is required to strictly abide by our measures and requirements on data privacy protection, including but not limited to processing according to data protection agreements, commitments and related data processing policies to ensure data security.", "label": ["Important", "Data Security"], "rewrite": "We require third parties to abide by our measures and requirements on data privacy protection."}
{"task": "rw_41.jsonl", "id": 51089, "text": "For the purpose of providing you with services, we may entrust a third -party service provider to handle your personal information. These service providers will handle personal information strictly in accordance with the purpose of our entrustment and the relevant commissioning agreement.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We may entrust a third -party service provider to handle your personal information, thinking that you provide services, and the third party will handle it according to the purpose of the entrustment and the entrustment agreement."}
{"task": "rw_41.jsonl", "id": 51090, "text": "We will strictly protect your personal information, will not take the initiative to disclose your personal information, nor will it take the initiative to share information with your partners to identify your personal identity, unless you agree with your own consent or laws and regulations, such as:", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will not take the initiative to disclose your personal information, nor will we take the initiative to share information with your partners to identify your personal identity, unless you agree with your own consent or laws and regulations."}
{"task": "rw_41.jsonl", "id": 51091, "text": "· To establish and fulfill the contract as a party as a party, or to implement human resource management in accordance with the labor rules and regulations formulated in accordance with the law and the collective contract signed in accordance with the law;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to establish and fulfill the person's contract as a party, or to implement human resource management in accordance with the labor rules and regulations and collective contracts signed in accordance with the law, it may publicize your information publicly."}
{"task": "rw_41.jsonl", "id": 51092, "text": "· In order to fulfill the statutory duties or the requirements of the legal volunteer;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to fulfill the statutory duties or the necessary parties, you may disclose your information publicly."}
{"task": "rw_41.jsonl", "id": 51093, "text": "· In order to deal with emergencies, or in urgent situations to protect the health and property security of natural people;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Out of the major legitimate rights and interests of the life and property of the subject of personal information or other individuals, it is difficult to get shared or disclosed by my consent, and there is no need to solicit."}
{"task": "rw_41.jsonl", "id": 51094, "text": "· Implement news reports, public opinion supervision and other behaviors for public interests, and handle personal information within a reasonable range;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Implement news reports, public opinion supervision and other behaviors for public interests, and handle personal information within a reasonable scope without authorized consent."}
{"task": "rw_41.jsonl", "id": 51095, "text": "· Treatment of personal information on its own or other legal disclosure within a reasonable scope in accordance with the law;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In accordance with the law, handle individuals' self -disclosure or other personal information that have been legally disclosed within a reasonable scope without authorization consent."}
{"task": "rw_41.jsonl", "id": 51096, "text": "Other circumstances stipulated in laws and administrative regulations.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51097, "text": "With the sustainable development of our business, when transactions such as mergers, acquisitions, asset transfer cause your personal information to third parties, we will inform you of the relevant situations by pushing notifications and announcements.The standards required by this privacy policy continue to protect or require new managers to continue to protect your personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If business mergers, acquisitions, asset transfer and other transactions will be informed of the relevant situation, and it will continue to protect your personal information in accordance with laws and regulations and not lower than the standards required by this guideline."}
{"task": "rw_41.jsonl", "id": 51098, "text": "The information we may send to you", "label": [], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51099, "text": "Information notice", "label": [], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51100, "text": "When you use our services, we may send you email, text message, information or push notification to you.", "label": ["Important"], "rewrite": "When you use our services, we may send you email, text message, information or push notification to you."}
{"task": "rw_41.jsonl", "id": 51101, "text": "You can choose to cancel the subscription on the device according to our relevant tips.", "label": ["Important", "Edit/Control"], "rewrite": "You can choose to cancel the information notification subscription on the device."}
{"task": "rw_41.jsonl", "id": 51102, "text": "For example, there are personalized information on specific products and services, please check the specific privacy protection guidance of the product and service to obtain more information or close personalized recommendations.", "label": ["Important", "Edit/Control"], "rewrite": "Please check the specific privacy protection guidance of the product and service to obtain more information or close personalized recommendations."}
{"task": "rw_41.jsonl", "id": 51103, "text": "Announcement related to service", "label": [], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51104, "text": "We may issue an announcement related to the service -related announcement when necessary (for example, when the system maintenance is suspended due to system maintenance).", "label": ["Important", "Usage"], "rewrite": "We may issue an announcement related to service when necessary."}
{"task": "rw_41.jsonl", "id": 51105, "text": "You may not be able to cancel these announcements related to services and nature.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51106, "text": "Location and period of storage information", "label": [], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51107, "text": "Location of storage information", "label": [], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51108, "text": "We comply with laws and regulations to store personal information collected and generated in the territory of the People's Republic of China in the country.", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in domestic operations will be stored in China."}
{"task": "rw_41.jsonl", "id": 51109, "text": "The period of storage information", "label": [], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51110, "text": "Generally speaking, we only retain your personal information within the shortest time we must achieve the purpose, except for the following situations:", "label": ["Data Retention", "Important"], "rewrite": "Generally, your personal information is retained within the time limit required to achieve service purposes, unless the law has other requirements."}
{"task": "rw_41.jsonl", "id": 51111, "text": "· In order to comply with relevant regulations such as applicable laws and regulations;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51112, "text": "· In order to abide by the court's judgment, ruling or other legal procedures;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51113, "text": "· In order to comply with the requirements of the law enforcement of relevant government agencies;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51114, "text": "When our products or services stop operating, we will take a notification of push notification, announcement and other forms, and delete or processes your personal information within a reasonable period.", "label": ["Important", "Cessation of Operations"], "rewrite": "When stopping operations, we will notify and delete or processes your personal information."}
{"task": "rw_41.jsonl", "id": 51115, "text": "information security", "label": [], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51116, "text": "We provide corresponding security guarantees for your information to prevent information loss, improper use, unauthorized access or disclosure.", "label": ["Important", "Data Security"], "rewrite": "Provide corresponding security guarantees for your information to prevent information loss, improper use, unauthorized access or disclosure."}
{"task": "rw_41.jsonl", "id": 51117, "text": "We strictly abide by laws and regulations to protect users' communication secrets.", "label": ["Important", "Data Security"], "rewrite": "Strictly abide by laws and regulations to protect users' communication secrets."}
{"task": "rw_41.jsonl", "id": 51118, "text": "We will use various security protection measures within a reasonable security level to ensure information security.", "label": ["Important", "Data Security"], "rewrite": "Use various security protection measures to ensure information security."}
{"task": "rw_41.jsonl", "id": 51119, "text": "For example, we use encryption technology and anonymous processing to protect your personal information.", "label": ["Important", "Data Security"], "rewrite": "Use encrypted technology and anonymous processing to protect your personal information."}
{"task": "rw_41.jsonl", "id": 51120, "text": "We establish a special management system, process and organization to ensure information security.", "label": ["Important", "Data Security"], "rewrite": "Establish a specialized management system, process and organization to ensure information security."}
{"task": "rw_41.jsonl", "id": 51121, "text": "For example, we strictly restrict the scope of the personnel of access information, ask them to obey the confidentiality obligations and conduct review.", "label": ["Important", "Data Security"], "rewrite": "Strictly restrict the scope of the personnel of access information, and require them to comply with confidentiality obligations and review them."}
{"task": "rw_41.jsonl", "id": 51122, "text": "If personal information leaks such as personal information, we will start emergency plans to prevent the expansion of security events, and inform you in the form of push notifications and announcements.", "label": ["Important", "Data Security"], "rewrite": "We will start emergency plans to deal with information security incidents."}
{"task": "rw_41.jsonl", "id": 51123, "text": "advertise", "label": [], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51124, "text": "In order to provide a richer advertising experience, we may provide you with personalized advertising services. You can receive relevant advertising content on the websites, applications and other channels of Tencent and third -party.", "label": ["Important", "Usage"], "rewrite": "Provide you with personalized advertising services. You can receive relevant advertising content on the websites, applications and other channels of Tencent and third -party."}
{"task": "rw_41.jsonl", "id": 51125, "text": "You can check the guidance of the privacy protection of specific products to understand more.", "label": [], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51126, "text": "If you don't want to receive personalized advertisements, you can also close according to the guidelines in specific products.", "label": ["Important", "Edit/Control"], "rewrite": "If you don't want to receive personalized advertisements, you can also close according to the guidelines in specific products."}
{"task": "rw_41.jsonl", "id": 51127, "text": "Minor protection", "label": [], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51128, "text": "We attach great importance to the protection of personal information of minors.", "label": ["Specific Audiences", "Important"], "rewrite": "We attach great importance to the protection of personal information of minors."}
{"task": "rw_41.jsonl", "id": 51129, "text": "According to the relevant laws and regulations, if you are a minor under the age of 18, you should obtain the consent of your parents or legal guardians before using Tencent's service.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a minor under the age of 18, you should obtain the consent of the guardian before using Tencent's service."}
{"task": "rw_41.jsonl", "id": 51130, "text": "We have products or services, products or services provided by children under the age of 14, which include functional segments for children, or users need to enter products or services that can recognize users' age and other products such as birthdays and age information.", "label": ["Specific Audiences", "First Party Collection Information", "Important"], "rewrite": "Products or services provided by children under the age of 14 may require users to enter birthdays and age information."}
{"task": "rw_41.jsonl", "id": 51131, "text": "According to the relevant laws and regulations, if you are a child under the age of 14, you should obtain the consent of your parents or legal guardians in advance before using related products or services, and will be obtained in advance.The guardian helps you complete the product or service registration process so that you can use the products or services we provide.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a child under the age of 14, please use services or provide information under the consent and guidance of the guardian."}
{"task": "rw_41.jsonl", "id": 51132, "text": "If you are a child's guardian, when you help children complete the registration and use of products or services, you should carefully read the guidance of this policy and specific privacy protection of the product (such as) and \"Statement of Child Privacy Protection\".Policies and product specific privacy protection guidelines (if there are) and \"Child Privacy Protection Statement\" and help children register and use so that children can use the products or services we provide.", "label": ["Specific Audiences", "Important"], "rewrite": "The guardian should help children complete the registration and use of products or services after reading and agreeing to the policy."}
{"task": "rw_41.jsonl", "id": 51133, "text": "If you have relevant questions or claims for your personal information protection of your child's personal information, please contact us through the contact information disclosed in the seventh part of the \"Child Privacy Protection Statement\".", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51134, "text": "We will deal with and reply to you within a reasonable time.", "label": [], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51135, "text": "Scope", "label": [], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51136, "text": "The products and services applicable to this privacy policy are provided by Shenzhen Tencent Computer Systems Co., Ltd.", "label": [], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51137, "text": "Some services have their specific privacy guidelines/declarations, which shows that specific privacy guidelines/declares more specifically how we handle your information in the service.", "label": [], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51138, "text": "If this policy is inconsistent with the privacy guidelines/declarations of specific services, please prevail with this specific privacy guideline.", "label": [], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51139, "text": "Please note that this policy does not apply services provided by other companies or individuals.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51140, "text": "For example, you log in to the services provided by other companies or individuals by using WeChat accounts.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51141, "text": "You use these third -party services to be subject to its privacy policy (rather than this policy), and you need to read its policy content carefully.", "label": ["Policy Change", "Important"], "rewrite": "You use WeChat accounts to log in to use third -party services, which must be subject to its privacy policy (rather than this policy)."}
{"task": "rw_41.jsonl", "id": 51142, "text": "contact us", "label": [], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51143, "text": "We have set up a special person in personal information protection team and personal information protection person. If you have any questions or complaints or suggestions on the privacy policy or personal information protection related matters, you can contact us in the following ways:", "label": ["Important", "Contact Information"], "rewrite": "If you have any questions or complaints or suggestions on this privacy policy or personal information protection, you can contact us in the following ways:"}
{"task": "rw_41.jsonl", "id": 51144, "text": "1. You can fill in, feedback questionnaires for personal information protection and privacy issues, contact us;", "label": ["Important", "Contact Information"], "rewrite": "You can fill in personal information protection and privacy issues to contact us."}
{"task": "rw_41.jsonl", "id": 51145, "text": "2. Send the problem to dataprivacy@tencent.com;", "label": ["Important", "Contact Information"], "rewrite": "Send the problem to dataprivacy@tencent.com."}
{"task": "rw_41.jsonl", "id": 51146, "text": "3., contact us through https://kf.qq.com/;", "label": ["Important", "Contact Information"], "rewrite": "Contact us through https://kf.qq.com/."}
{"task": "rw_41.jsonl", "id": 51147, "text": "4. Mail your question to the following address:", "label": ["Important", "Contact Information"], "rewrite": "Mail your question to the following address: Data Privacy Protection Department (closed), Tencent Binhai Building, No. 33 Haitian Er Road, Nanshan District, Shenzhen, Guangdong Province, China."}
{"task": "rw_41.jsonl", "id": 51148, "text": "Tencent Binhai Building, No. 33 Haitian Er Road, Nanshan District, Guangdong Province, China, China, China, China Binhai Building data privacy protection department (closed)", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51149, "text": "Postcode: 518054", "label": ["Important", "Contact Information"], "rewrite": "Postcode: 518054"}
{"task": "rw_41.jsonl", "id": 51150, "text": "We will review the issues involved as soon as possible and give feedback within the period of 15 working days or laws and regulations.", "label": ["Important", "Contact Information"], "rewrite": "We give feedback within the period of 15 working days or laws and regulations."}
{"task": "rw_41.jsonl", "id": 51151, "text": "change", "label": [], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51152, "text": "We may amend the content of this privacy policy in a timely manner.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_41.jsonl", "id": 51153, "text": "If such changes will cause the substantial loss of rights under the privacy policy, we will prompt through a prominent position on the page before the change is effective.", "label": ["Policy Change", "Important"], "rewrite": "If the change of privacy policy has led to the substantial reduction of your rights under the privacy policy, we will prompt through a prominent position on the page before changing the effect."}
{"task": "rw_41.jsonl", "id": 51154, "text": "If the privacy protection guidance of specific products and services is changed, the types of personal information that are treated with personal information will be changed, and your consent will be re -obtained.", "label": ["Important", "Data Security"], "rewrite": "If the privacy protection guidance of specific products and services is changed, the types of personal information that are treated with personal information will be changed, and your consent will be re -obtained."}
{"task": "rw_41.jsonl", "id": 51155, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
