{"task": "rw_42.jsonl", "id": 51156, "text": "National Anti -Fraud Center user privacy policy", "label": [], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51157, "text": "Update date: September 2, 2022", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51158, "text": "We attach great importance to user privacy policies and strictly abide by relevant laws and regulations.", "label": [], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51159, "text": "Please read the \"User Privacy Policy\" carefully before continuing to use it.", "label": [], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51160, "text": "If you continue to use our services, it means that you have fully read, understand and agree with all the content of the privacy policy.", "label": ["Policy Change", "Important", "Risk"], "rewrite": "If you continue to use the service, you agree with all the contents of the privacy policy."}
{"task": "rw_42.jsonl", "id": 51161, "text": "The personal information collection, use, and disclosure of personal information involved under the user's privacy policy strictly abide by the following three principles:", "label": ["Data Security"], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51162, "text": "(1) Principles of national anti -fraud and personal rights protection.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51163, "text": "We strictly follow relevant laws and regulations, and all the services provided are good goals of achieving a good purpose of combating telecommunications network fraud and protecting the legitimate rights and interests of citizens.", "label": ["Important", "Usage"], "rewrite": "The services we provide are the purpose of cracking down on telecommunications network fraud and protecting the legitimate rights and interests of citizens."}
{"task": "rw_42.jsonl", "id": 51164, "text": "(2) Principles of explanation and authorization.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51165, "text": "All situations involved in the use of personal information in the service will give a clear reminder and set the selection option. Only after obtaining your clear authorization can we process the corresponding information.", "label": ["Important", "Data Security"], "rewrite": "We will process personal information after obtaining your clear authorization."}
{"task": "rw_42.jsonl", "id": 51166, "text": "(3) The principles of use and minimum use.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51167, "text": "We ensure that the personal information involved in the service process is essential to complete the service, and the information processing guarantees minimum frequency and minimum range.", "label": ["Important", "Data Security"], "rewrite": "The personal information involved in the service is not necessary to complete the service, and the information processing guarantees minimum frequency and minimum range."}
{"task": "rw_42.jsonl", "id": 51168, "text": "We respect and protect the personal privacy of all users.", "label": [], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51169, "text": "In order to provide you with more accurate and better services, we will collect, use and disclose your personal information in accordance with the provisions of privacy policies.", "label": [], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51170, "text": "Except for the other provisions of this privacy policy, we will not disclose this information to the outside world without obtaining your prior permission.", "label": ["Important", "Data Security"], "rewrite": "We will not provide your personal information to any third party."}
{"task": "rw_42.jsonl", "id": 51171, "text": "However, in the case of national security, we will strictly use relevant data in accordance with relevant laws and regulations.", "label": [], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51172, "text": "We will update the privacy policy from time to time and remind you to read in a timely manner. You should carefully read and decide whether to continue using the services we provide.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51173, "text": "This \"User Privacy Policy\" mainly explains you:", "label": [], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51174, "text": "1. The principle of privacy protection;", "label": [], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51175, "text": "2. What information do we collect;", "label": [], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51176, "text": "3. How do we use collected information;", "label": [], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51177, "text": "4. Sharing and disclosure of information;", "label": [], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51178, "text": "5. Storage and security of information;", "label": [], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51179, "text": "6. Update the privacy policy;", "label": [], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51180, "text": "7. Protection of personal information of children;", "label": [], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51181, "text": "8. The right you enjoy.", "label": [], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51182, "text": "1. Privacy Protection Principles", "label": [], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51183, "text": "We strictly abide by laws and regulations, follow the following principles of privacy protection, and provide you with safe and reliable services:", "label": ["Data Security"], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51184, "text": "(A) Safe and reliable", "label": ["Data Security"], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51185, "text": "Through reasonable and effective information security technology and management systems, we ensure your information security and prevent your information from leaking or tampering.", "label": ["Important", "Data Security"], "rewrite": "Make your information security through information security technology and management system, prevent information leakage or tampering."}
{"task": "rw_42.jsonl", "id": 51186, "text": "In all aspects of product or service development, we comprehensively integrate the concepts of privacy protection in comprehensive laws, products, and design.", "label": ["Important", "Data Security"], "rewrite": "We integrate the concept of privacy protection in all aspects of product or service development."}
{"task": "rw_42.jsonl", "id": 51187, "text": "(B) Autonomy and voluntary", "label": ["Data Security"], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51188, "text": "We provide you with convenient information management options so that you can make your own choice and protect your personal information.", "label": ["Important", "Edit/Control"], "rewrite": "You can use information management options to make selection and protect personal information."}
{"task": "rw_42.jsonl", "id": 51189, "text": "(C) Reasonable and necessary", "label": ["Data Security"], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51190, "text": "We strictly follow the \"Cyber Security Law of the People's Republic of China\" and relevant laws and regulations, and collect only the necessary limited information from you, and the information that has nothing to do with our services is prohibited from collecting.", "label": ["Important", "Data Security"], "rewrite": "We follow the necessary limited information in accordance with laws and regulations, and prohibit the collection of information that has nothing to do with services."}
{"task": "rw_42.jsonl", "id": 51191, "text": "(D) Clear and transparent", "label": ["Data Security"], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51192, "text": "We strive to use simple and easy -to -understand expressions to introduce our privacy policies to you so that you can easily master our information processing.", "label": ["Important", "Edit/Control"], "rewrite": "We use concise and easy -to -understand expressions to introduce privacy policies."}
{"task": "rw_42.jsonl", "id": 51193, "text": "You can check our use of information at any time, or you can ask us to correct or delete the collected information, and even cancel the account.", "label": ["Edit/Control", "Important"], "rewrite": "You can query the situation of collecting information, request more correct or delete the collected information or cancel the account."}
{"task": "rw_42.jsonl", "id": 51194, "text": "You can also complain or report on our services on information security. Welcome to contact us at any time.", "label": [], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51195, "text": "2. What information do we collect?", "label": [], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51196, "text": "According to the principles of legal, legitimate, and necessary, we only collect information necessary for the implementation of product functions.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "We collect the necessary information based on the principles of legal, fairness, and necessary principles."}
{"task": "rw_42.jsonl", "id": 51197, "text": "(1) The following is the information you actively provided when you use our service:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51198, "text": "(A) Personal information provided according to the requirements of the APP when registering an account", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your personal information provided according to the app requirements when registered accounts."}
{"task": "rw_42.jsonl", "id": 51199, "text": "-The mobile phone number, name, ID number you filled in;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51200, "text": "-Camera permissions", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51201, "text": "We will access your mobile phone front camera for facial feature recognition to obtain your face recognition characteristics;", "label": ["Important", "First Party Collection Information"], "rewrite": "Visit your mobile phone front camera for facial feature recognition to obtain facial recognition characteristics."}
{"task": "rw_42.jsonl", "id": 51202, "text": "-, you can also select information and other information according to your own needs.", "label": ["Important", "First Party Collection Information"], "rewrite": "Get the area information you fill in."}
{"task": "rw_42.jsonl", "id": 51203, "text": "(B) The information you actively uploaded when you use the report service provided by the APP", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the information uploaded when you use the report service."}
{"task": "rw_42.jsonl", "id": 51204, "text": "Suspected fraud mobile phone numbers, call records, text messages, apps, pictures, websites, audio and video, screen recording, social account number, transaction account, etc. The source of information includes:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51205, "text": "-Astellar information and call records", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51206, "text": "-StM message information", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51207, "text": "-The application file information", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51208, "text": "- image information", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51209, "text": "-E audio information", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51210, "text": "-Video information", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51211, "text": "-Mico air permissions", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51212, "text": "-Coce the screen display content", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51213, "text": "-Slip permissions", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51214, "text": "(C) The information provided when you use the authenticity function provided by the APP, -The mobile phone number, name, and ID number you fill in;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the information provided when you use your authentication function."}
{"task": "rw_42.jsonl", "id": 51215, "text": "-Adamed permissions -your face image.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51216, "text": "(2) The following is the information we get when you use our service:", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use your service, we get your device information."}
{"task": "rw_42.jsonl", "id": 51217, "text": "(A) Equipment information", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51218, "text": "The brand, device model, system version, equipment code and other information of your device.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51219, "text": "(3) Cookie policy", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51220, "text": "(A) The use of cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51221, "text": "Cookie and similar technologies are commonly used in the Internet.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51222, "text": "When you use the national anti -fraud centers and related services, we may use related technologies to send one or more, cookie, or anonymous identifies to collect and store information when you access and use this product.", "label": ["Important", "First Party Collection Information"], "rewrite": "Use cookie or anonymous identifiers to collect and store information when you access and use this product."}
{"task": "rw_42.jsonl", "id": 51223, "text": "We promise that it will not be used for any other uses besides the purpose of the privacy policy.", "label": ["Important", "First Party Collection Information"], "rewrite": "Cookie will not be used for any other purpose outside the purpose of this privacy policy."}
{"task": "rw_42.jsonl", "id": 51224, "text": "We use cookies and similar technologies to achieve the following functions or services:", "label": ["Usage"], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51225, "text": "Guarantee the safety and efficient operation of products and services", "label": ["Important", "Usage"], "rewrite": "Use Cookie and similar technology to ensure the safety and efficient operation of products and services."}
{"task": "rw_42.jsonl", "id": 51226, "text": "We may set up certification and guarantee security, cookies, or anonymous identifications to make us confirm whether you log in to the service safely, or whether you encounter stolen, fraud and other illegal acts.", "label": ["Important", "Usage"], "rewrite": "Set up cookie or anonymous identifiers to confirm whether you log in to the service safely, or whether you encounter dispersion, fraud and other illegal behaviors."}
{"task": "rw_42.jsonl", "id": 51227, "text": "These technologies also help us improve service efficiency, improve login and response speed.", "label": ["Important", "Usage"], "rewrite": "Use Cookie or anonymous identifiers to help improve service efficiency and improve login and response speed."}
{"task": "rw_42.jsonl", "id": 51228, "text": "(B) Cooking of cookies", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51229, "text": "Most browsers provide users with the function of removing browser cache data. You can perform the corresponding data clearance operation in the browser settings function.", "label": ["Important", "Edit/Control"], "rewrite": "The data can be cleared through the function of the browser cache data."}
{"task": "rw_42.jsonl", "id": 51230, "text": "If you are cleared, you may not be able to use the services or corresponding functions that we provide by Cookie for Cookie.", "label": ["Important", "Edit/Control"], "rewrite": "Clearing data may cause services or functions that cannot be used on cookies."}
{"task": "rw_42.jsonl", "id": 51231, "text": "(4) Information collected by third -party services", "label": [], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51232, "text": "The third -party services we access, including the Antian Mobile Virus and Killing Function and Friendly League Statistics, are all responsible for the operation.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The third -party service of access is operated by a third party."}
{"task": "rw_42.jsonl", "id": 51233, "text": "During use, third -party service providers may collect, use and store your relevant data or information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When using the services provided by third parties, third parties will collect, use and store your relevant data or information."}
{"task": "rw_42.jsonl", "id": 51234, "text": "Before you decide to use this type of service, you must be constrained by the third party's own service terms and information protection statements (not this \"Privacy Policy\"). Please read the terms carefully.", "label": [], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51235, "text": "This \"Privacy Policy\" is only applicable to any information we collected, and does not apply to any third -party service or third -party information use rules, and we do not responsibility for any third party's use of information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51236, "text": "For the privacy policy of third -party services, please refer to \"Antian Mobile Security AVL, SDK Privacy Policy\", \"[Friend League+] Privacy Policy\" and \"Tencent Mobile Security, SDK Personal Information Protection Rules\".", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For the privacy policies of third -party services, please refer to the \"Antian Mobile Security AVL SDK Privacy Policy\", \"[Friend League+] Privacy Policy\" and \"Tencent Mobile Security SDK Personal Information Protection Rules\"."}
{"task": "rw_42.jsonl", "id": 51237, "text": "Some of our services may require you to provide specific personal sensitive information to achieve specific functions.", "label": ["Important", "First Party Collection Information"], "rewrite": "Some services need to obtain personal sensitive information implementation."}
{"task": "rw_42.jsonl", "id": 51238, "text": "If you choose not to provide such information, you may not be able to use specific functions in the service normally, but it does not affect other functions in your service.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you do not provide personal sensitive information, you may not use specific functions, but do not affect normal function."}
{"task": "rw_42.jsonl", "id": 51239, "text": "If you take the initiative to provide your personal sensitive information, it means that you agree that we will process your personal sensitive information according to the purpose and method of this policy.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you take the initiative to provide personal sensitive information levels to agree to deal with this policy."}
{"task": "rw_42.jsonl", "id": 51240, "text": "3. How do we use collected information?", "label": [], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51241, "text": "We strictly abide by the provisions of laws and regulations and the agreement with users, and use the collected information for the following uses.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51242, "text": "If we use your information below, we will explain to you again and obtain your consent.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "If we exceed the use information, we will explain to you again and obtain consent."}
{"task": "rw_42.jsonl", "id": 51243, "text": "(A) We will not provide your personal login information to any unrelated third party.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not provide your personal login information to any of the third parties that do not related to third parties."}
{"task": "rw_42.jsonl", "id": 51244, "text": "If we store maintenance or upgrade, we will send a push message in advance to inform you, please allow us to notify us in advance.", "label": ["Important"], "rewrite": "We will inform you in advance the storage and maintenance or upgrade."}
{"task": "rw_42.jsonl", "id": 51245, "text": "(B) We do not allow any third parties that have nothing to do with us to collect, edit, sell, or disseminate your personal information in any means.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We are not allowed to collect, edit, sell, or disseminate your personal information that has nothing to do with services."}
{"task": "rw_42.jsonl", "id": 51246, "text": "Once we are engaged in the above -mentioned activities, once we find out, we have the right to immediately terminate the service agreement with the user.", "label": ["Important", "Data Security"], "rewrite": "If we find that platform users collect, edit, sell or disseminate your personal information, it will terminate the service agreement with the user."}
{"task": "rw_42.jsonl", "id": 51247, "text": "(C) We use the mobile phone number and ID number you provided when registering an account to identify your identity. This is the basic information necessary for us to serve you, and it is also the relevant laws and regulations for the compliance requirements of Internet services.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Use your mobile phone number and ID number when you register to identify your identity to provide you with services."}
{"task": "rw_42.jsonl", "id": 51248, "text": "We use the information that you take voluntarily uploaded to provide anti -fraud services to you. You should check before uploading the relevant information to avoid uploading unnecessary information or wrong information.You can delete or upload relevant information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Use your suspected fraud information to provide anti -fraud services, and you can delete or upload relevant information."}
{"task": "rw_42.jsonl", "id": 51249, "text": "The information collected by the \"virus detection\" function in our app is to provide services for services. You can choose whether to use this function. If you do not choose to use this function, we will not take the initiative to collect your relevant information.", "label": ["Edit/Control", "First Party Collection Information", "Usage", "Important"], "rewrite": "The information collected by the \"virus check\" function is to provide services for services. You can choose whether to use this function."}
{"task": "rw_42.jsonl", "id": 51250, "text": "The information collected by the \"authenticity\" function in our APP is to help you identify whether the identity of you and the other person is true.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The information collected by the \"authenticity\" function is to identify whether your and each other's identity is true."}
{"task": "rw_42.jsonl", "id": 51251, "text": "We collect facial recognition characteristics and pass to third -party verification agencies for verification. Third -party verification agencies collect information and verify your identity to units that legal preservation of your personal information.personal information.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Collect facial recognition characteristics and pass to third -party verification, but third parties do not save."}
{"task": "rw_42.jsonl", "id": 51252, "text": "You can choose to use this function. If you do not choose to use this function, we will not take the initiative to collect your relevant information.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you do not choose the \"identity test\" function, you will not take the initiative to collect your information."}
{"task": "rw_42.jsonl", "id": 51253, "text": "In order to ensure the security of services and help us better understand the operation of our application, we may record relevant information, for example, you use the frequency, failure information, overall usage conditions, performance data, and the source of the application.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Record the operation of the application to ensure the security of the service."}
{"task": "rw_42.jsonl", "id": 51254, "text": "We will not store the information we store in the analysis software with the personal identity information you provided in the application.", "label": ["Important", "Usage"], "rewrite": "The information in the analysis software will not be combined with your personal identity information."}
{"task": "rw_42.jsonl", "id": 51255, "text": "4. Share and disclosure of information", "label": [], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51256, "text": "We follow the provisions of laws and regulations to strictly restrict the sharing of information.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51257, "text": "In the following cases, we will share and disclose your information based on your personal wishes or legal provisions:", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51258, "text": "(A) We will not disclose to the third party without your pre -consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not disclose to third parties without your pre -consent."}
{"task": "rw_42.jsonl", "id": 51259, "text": "(B) To provide the products and services you are required, you must share your personal information with a third party;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "To provide your personal information with the necessary products and services you are required."}
{"task": "rw_42.jsonl", "id": 51260, "text": "(C) According to the relevant provisions of the law, or the requirements of administrative or judicial institutions, disclose to third parties or administrative and judicial institutions;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "According to the relevant provisions of the law, or the requirements of administrative or judicial institutions, disclose to third parties or administrative and judicial institutions."}
{"task": "rw_42.jsonl", "id": 51261, "text": "(D) If you have violated relevant Chinese laws, regulations or our service agreements or related rules, you need to disclose to a third party;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you violate China's relevant laws, regulations or our service agreements or related rules, disclose information to a third party."}
{"task": "rw_42.jsonl", "id": 51262, "text": "5. Storage and security of information", "label": [], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51263, "text": "The information and information we collect will be stored on the servers of our and (or) related units, and this information and information will be stored in the territory of the People's Republic of China.", "label": ["Data Retention", "Important"], "rewrite": "Your information and information are stored on the server in the country."}
{"task": "rw_42.jsonl", "id": 51264, "text": "Generally speaking, we only retain your personal information for the shortest time to achieve the goal.", "label": ["Data Retention", "Important"], "rewrite": "Keep your personal information for the shortest time to achieve the purpose."}
{"task": "rw_42.jsonl", "id": 51265, "text": "But in the following circumstances, we may change the storage time of personal information due to the need to meet the legal requirements:", "label": ["Data Retention", "Important"], "rewrite": "It may change the storage time of personal information due to the need to meet the requirements of legal requirements."}
{"task": "rw_42.jsonl", "id": 51266, "text": "· In order to comply with relevant regulations such as applicable laws and regulations;", "label": ["Data Retention", "Important"], "rewrite": "In order to comply with relevant provisions such as applicable laws and regulations, change the storage time of personal information."}
{"task": "rw_42.jsonl", "id": 51267, "text": "· In order to abide by the court's judgment, ruling or other legal procedures;", "label": ["Data Retention", "Important"], "rewrite": "In order to abide by the court's judgment, ruling or other legal procedures, the storage time of personal information is changed."}
{"task": "rw_42.jsonl", "id": 51268, "text": "· In order to comply with the requirements of relevant government agencies or legal authorization organizations;", "label": ["Data Retention", "Important"], "rewrite": "In order to comply with the requirements of relevant government agencies or legal authorized organizations, the storage time of personal information is changed."}
{"task": "rw_42.jsonl", "id": 51269, "text": "· We have reason to be convinced that we need to comply with relevant regulations such as laws and regulations;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51270, "text": "· In order to implement relevant service agreements or policies, safeguard the public interests of the society, to protect our users, or the personal property of our affiliated companies, other users or employees, or other legitimate rights and interests, it is reasonable.", "label": ["Data Retention", "Important"], "rewrite": "In order to implement relevant service agreements or policies, safeguard the public interests of the society, and protect the storage time of personal information in order to protect the safety of personal property or other legitimate rights and interests of all parties."}
{"task": "rw_42.jsonl", "id": 51271, "text": "When our products or services stop operating, we will take a notification of push notification, announcement and other forms, and delete or processes your personal information within a reasonable period.", "label": ["Important", "Cessation of Operations"], "rewrite": "When stopping operation, we will make an announcement notice and delete or processes your personal information."}
{"task": "rw_42.jsonl", "id": 51272, "text": "We provide corresponding security guarantees for your information to prevent information loss, improper use, unauthorized access or disclosure.", "label": ["Important", "Data Security"], "rewrite": "Provide security to prevent information loss, improper use, unauthorized access or disclosure."}
{"task": "rw_42.jsonl", "id": 51273, "text": "We strictly abide by laws and regulations to protect users' communication secrets.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51274, "text": "We will use various security protection measures within a reasonable security level to ensure information security.", "label": ["Important", "Data Security"], "rewrite": "Use various security protection measures to ensure information security."}
{"task": "rw_42.jsonl", "id": 51275, "text": "We establish a special management system, process and organization to ensure information security.", "label": ["Important", "Data Security"], "rewrite": "Establish a specialized management system, process and organization to ensure information security."}
{"task": "rw_42.jsonl", "id": 51276, "text": "If personal information leaks such as personal information, we will start emergency plans to prevent the expansion of security events, and inform you in the form of push notifications and announcements.", "label": ["Important", "Data Security"], "rewrite": "Start the emergency plan to deal with security incidents, prevent security incidents from expanding, and inform you in the form of push notifications and announcements."}
{"task": "rw_42.jsonl", "id": 51277, "text": "6. Update of this privacy policy", "label": [], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51278, "text": "(A) If you decide to change the privacy policy, we will publish these changes in this app and we think it is appropriate to understand how we collect, use your personal information, who can access this information, and under what circumstancesWe will disclose this information.", "label": ["Policy Change", "Important"], "rewrite": "After the privacy policy is updated, it will show you the transformed privacy policy and the updated situation."}
{"task": "rw_42.jsonl", "id": 51279, "text": "(B) We reserve the right to modify this policy at any time, so please check it frequently.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51280, "text": "If a major change in this policy, the unit will notify the form of the website notification.", "label": ["Policy Change", "Important"], "rewrite": "The major changes to the policy will be notified through the form of the website notification."}
{"task": "rw_42.jsonl", "id": 51281, "text": "(C) You should carefully read and decide whether to continue using the services we provide.", "label": ["Policy Change", "Important"], "rewrite": "You should read it carefully and decide whether to continue using the service by yourself."}
{"task": "rw_42.jsonl", "id": 51282, "text": "7. Protection of personal information of children", "label": [], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51283, "text": "We attach great importance to the protection of children's personal information.", "label": ["Specific Audiences", "Important"], "rewrite": "We attach great importance to the protection of children's personal information."}
{"task": "rw_42.jsonl", "id": 51284, "text": "According to the relevant laws and regulations, if you are a minor under the age of 18, you should obtain the consent of your parents or legal guardians before using our service, and will help you complete the product or the legal guardian to complete the product or the product or the legal guardianThe service registration process so that you can use the products or services we provide.", "label": ["Specific Audiences", "Important"], "rewrite": "Minors under the age of 18 should obtain the consent of the guardian before use."}
{"task": "rw_42.jsonl", "id": 51285, "text": "If you are a guardian of children (under 14 years of age), when you help children complete the registration and use of products or services, you should carefully read this policy and our \"National Anti -Fraud Center Child Privacy Protection Policy\", decide whether to decide whether to decide whether to decide whether toAgree with this policy and the \"National Anti -Fraud Center Child Privacy Protection Policy\" and help children register and use it so that children can use the products or services we provide.", "label": ["Specific Audiences", "Important"], "rewrite": "The guardian should help children complete the registration and use of products or services after reading and agreeing to the policy."}
{"task": "rw_42.jsonl", "id": 51286, "text": "If you have relevant questions or claims for your personal information protection of your child's personal information, please contact us through the contact information disclosed in the National Anti -Fraud Center Children's Privacy Protection Policy.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51287, "text": "We will deal with and reply to you within a reasonable time.", "label": [], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51288, "text": "8. The right you enjoy", "label": [], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51289, "text": "(1) How do you manage your own information", "label": [], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51290, "text": "You can access, modify and delete your registration information and other personal information in the process of using our services. You can also contact us according to the notice.", "label": ["Edit/Control", "Important"], "rewrite": "You can access, modify, and delete your registration information and other personal information, or you can also contact us."}
{"task": "rw_42.jsonl", "id": 51291, "text": "The scope and way you visit, modify and delete personal information will depend on the specific services you use.", "label": ["Important", "Edit/Control"], "rewrite": "The scope and method of accessing, modifying and deleting personal information will depend on specific services."}
{"task": "rw_42.jsonl", "id": 51292, "text": "If we violate the provisions of laws, administrative regulations, or the agreed collection, storage, use, transfer, disclosure of your personal information or if we are beyond the purpose or necessary period of collection, storage, use, transfer, and disclosure of personal information, you can withdraw consent and consentYou can terminate our products or services by canceling and other methods.", "label": ["Important", "Edit/Control"], "rewrite": "You can withdraw consent, or terminate the use of products or services by canceling."}
{"task": "rw_42.jsonl", "id": 51293, "text": "When you access, modify and delete related information, we may ask you to verify your identity to ensure account security.", "label": ["Important", "Edit/Control"], "rewrite": "When you visit, modify and delete related information, you need to verify your identity to ensure account security."}
{"task": "rw_42.jsonl", "id": 51294, "text": "(2) Account cancellation", "label": [], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51295, "text": "You can apply for your national anti -fraud center account through online independently.", "label": ["Edit/Control", "Important"], "rewrite": "You can apply for the national anti -fraud center account through online independently."}
{"task": "rw_42.jsonl", "id": 51296, "text": "By entering \"My-Settings-Account and Security-Logging out\", cancel your account online, when you cancel your account, you will no longer log in and use our product or service with this account, and the content under the account is, Information, data, records, etc. will be deleted or anonymous.", "label": ["Important", "Edit/Control"], "rewrite": "You can cancel your account online by entering the \"Settings-Account and Security-Logging out\". After cancellation, you cannot use it and the content will be deleted or anonymous."}
{"task": "rw_42.jsonl", "id": 51297, "text": "The national anti -fraud center account cancellation behavior and results are irreversible, and the accounts will not be recovered after cancellation, so please do it carefully.", "label": ["Important", "Edit/Control"], "rewrite": "The account will not be restored after canceling."}
{"task": "rw_42.jsonl", "id": 51298, "text": "(3) Contact us", "label": [], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51299, "text": "If you have any complaints or reports on personal information security and protection related matters, or have doubts about this policy or other related matters, please contact us through 010-67825000.", "label": ["Important", "Contact Information"], "rewrite": "Contact number: 010-67825000"}
{"task": "rw_42.jsonl", "id": 51300, "text": "We will review the issues involved as soon as possible and reply and deal with it within 15 working days after verifying your user identity.", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51301, "text": "Please protect your personal information properly and provide them with others only.", "label": ["Important", "Data Security"], "rewrite": "Protecting your personal information properly, it is provided to others only under the necessary situation."}
{"task": "rw_42.jsonl", "id": 51302, "text": "If you find your personal information disclosure, especially our username and password leak, please contact our customer service immediately so that we can take corresponding measures.", "label": ["Important", "Data Security"], "rewrite": "If the personal information discovered, please contact our customer service immediately."}
{"task": "rw_42.jsonl", "id": 51303, "text": "Thank you for reading and understanding our privacy policy!", "label": [], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51304, "text": "We will do our best to protect your personal information and legitimate rights and interests, and thank you again for your trust!", "label": [], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51305, "text": "Application name: National Anti -Fraud Center", "label": [], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51306, "text": "Developer Name: Criminal Investigation Bureau of the Ministry of Public Security", "label": [], "rewrite": []}
{"task": "rw_42.jsonl", "id": 51307, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
