{"task": "rw_45.jsonl", "id": 52188, "text": "Release date of this version: [2022-08-30]", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52189, "text": "Effective date: [2022-08-30]", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52190, "text": "Privacy policy of Migu Company", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52191, "text": "We pay great attention to protecting the personal information and privacy of users (\"you\"), and hope to simply introduce you how we collect, use and protect your personal information through the summary.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52192, "text": "The general summary is the attachment of \"Migu Privacy Policy\". If you want to understand our detailed privacy policy, please check the text of the privacy policy after the summary.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52193, "text": "First, how do we collect and use your personal information.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52194, "text": "1.1 Personal information", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52195, "text": "(1) When you register and log in to the \"Migu Video\" service, you can use it, the \"one -click login\" function, by authorizing us to collect and verify your mobile phone number, facilitate us to provide you with a fast login service.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "When registering and logging in to the \"Migu Video\" service, you can use the \"one -click login\" function to authorize us to collect and verify your mobile phone number, so that we provide you with a fast login service."}
{"task": "rw_45.jsonl", "id": 52196, "text": "You do not choose \"one -click login\", you can also use other login methods to fill in the mobile verification code, password login, and third -party account login.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52197, "text": "When you choose to create an account through your mobile phone number, we will verify whether your identity is valid by sending a SMS verification code.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52198, "text": "You can also fill in the avatars, nicknames, birthdays, regions, personalized signatures according to your own needs, and fill in the receiving address information including the consignee's name, telephone, detailed address, and postal encoding (only the receipt address information is used for you only for you for youThe use of the event prizes, when shopping in Migu Mall, filling in order courier products, it will not be used for other purposes.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can also choose to fill in the avatars, nicknames, birthdays, regions, and personalized signatures according to your needs, and fill in the receiving address information including the consignee's name, telephone, detailed address, and postal code."}
{"task": "rw_45.jsonl", "id": 52199, "text": ") Improve your personal information.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52200, "text": "When you use a modification password service, we need to verify your mobile phone number to reset the password, so you need to collect your mobile phone number.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use a modification password service, we need to verify your mobile phone number to reset the password, so you need to collect your mobile phone number."}
{"task": "rw_45.jsonl", "id": 52201, "text": "Midu video ticket purchase and Migu Mall service: Movie tickets and Migu Mall belong to Migu Company, so when you use these two services, you will use the same account as Migu Video.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52202, "text": "User's mobile phone number information will also be used for Migu and China Mobile's marketing activities, for users' prizes and verification of user participation.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52203, "text": "In order to protect your consumer rights, we will also collect relevant order information and trading information for the Migu Video to provide you with order information tracking and after -sales service.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will also collect related order information and transaction information in Migu Video to provide you with order information tracking and after -sales service."}
{"task": "rw_45.jsonl", "id": 52204, "text": "(2) You can also log in to \"Migu Video\" with a third -party account (WeChat, QQ, Weibo account, Appleid). At this time, you will authorize us to obtain the public information (including avatars, nicknames, nicknames, nicknames, nicknames, nicknames,Information), you can bind your third -party account with your Migu account after agreeing with your privacy policy, so that you can log in to and use this product and corresponding service through a third -party account (the first three parties authorize to log in to the binding.The mobile phone number is verified), where the Tencent login SDK needs to obtain your device IMSI information in order to provide a diverse and convenient login method.", "label": ["Important", "First Party Collection Information"], "rewrite": "You will authorize us to obtain the public information (including avatars and nickname information) registered on the third -party platform."}
{"task": "rw_45.jsonl", "id": 52205, "text": "1.2 position", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52206, "text": "Migu Video will request your geographical location information (including your authorized GPS position and WLAN access point, Bluetooth and base station sensor information) in the following scene.", "label": ["Important", "First Party Collection Information"], "rewrite": "Migu Video will request your geographical information in the following scene."}
{"task": "rw_45.jsonl", "id": 52207, "text": "(1) We will apply for targeted content recommendation based on your location information. If you refuse to provide geographical information, we will not push you content based on geographical location information, but will not affect other functions and services of \"Migu Video\"Normal use.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We will apply for targeted content based on your location information. If you refuse to provide geographical information, we will not push you content based on geographical location information, but will not affect the normal use of other functions and services of \"Migu Video\"."}
{"task": "rw_45.jsonl", "id": 52208, "text": "(2) When using Migu Video Film ticket purchase service, in order to determine your city and find the recent theater, we will apply for location information. You can also refuse. After you refuse, you need to manually select and screen cities and cinemas.", "label": ["Important", "First Party Collection Information"], "rewrite": "When using Migu Video Film Ticketing Service, in order to determine your city and find the recent theater, we will apply for location information."}
{"task": "rw_45.jsonl", "id": 52209, "text": "1.3 camera", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52210, "text": "When you use the functions of clouds, cloud boxes, and concerts when you use the colorful bell DIY function, we will ask you to authorize the right of microphone and camera to shoot your video screens and collect sounds to participate in real -time interaction of live broadcastsThen, then", "label": ["Permission Acquisition", "Important"], "rewrite": "We will ask you to authorize the microphone permissions and camera authority to shoot your video screen and collect sound to participate in real -time interaction of the live broadcast."}
{"task": "rw_45.jsonl", "id": 52211, "text": "Access camera: You can use the camera to scan the code to scan the search, scan the code to bind the TV box, scan the code to log in to the PC client or the WWW webpage, you need to use the camera function to shoot;", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52212, "text": "When you use the \"avatar\" function, take it directly and upload the picture to set the avatar;", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use the \"avatar\" function, take it directly and upload the picture for the avatar setting."}
{"task": "rw_45.jsonl", "id": 52213, "text": "When you use the content upload service (\"G customer video upload\"), the live broadcast function or service needs to be taken and uploaded directly;", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use the content upload service (\"G customer video upload\"), the live broadcast function or service needs to be taken and uploaded directly."}
{"task": "rw_45.jsonl", "id": 52214, "text": "Directly record the video and upload the video content;", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52215, "text": "When you use the feedback function of the opinion to take the photo upload;", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52216, "text": "Will apply for camera permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "Will apply for camera permissions."}
{"task": "rw_45.jsonl", "id": 52217, "text": "1.4 Album", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52218, "text": "When you replace your avatar, make picture poster sharing, pass the ticket gift, use content upload service (\"upload of GBR video\"), and use the feedback to upload the picture of the use of opinions, we will ask you to authorize to apply for the album access permissions for the album content of the album contentIn order to browse and choose upload content.", "label": ["Permission Acquisition", "Important"], "rewrite": "We will ask you to authorize to apply for album access permissions for album content for browsing and selection of uploading content."}
{"task": "rw_45.jsonl", "id": 52219, "text": "1.5 microphone", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52220, "text": "When you use your voice search, Gfei shooting videos, cloud audiences, cloud boxes, cloud shouts, and concerts to live wheat functions when you use the colorful bell function, we need to ask you to obtain microphone rights to obtain your voiceEnter information.", "label": ["Permission Acquisition", "Important"], "rewrite": "We need to ask you to obtain microphone rights to obtain your voice input information."}
{"task": "rw_45.jsonl", "id": 52221, "text": "1.6 calendar", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52222, "text": "When you use the \"Booking\" to watch the service, we need to request you to read, edit the permissions of the calendar, and set up event reminder permissions to set up system reminders.", "label": ["Permission Acquisition", "Important"], "rewrite": "We need to ask you to read, edit the calendar authority, and set up event reminders to set up system reminders."}
{"task": "rw_45.jsonl", "id": 52223, "text": "1.7 shear plate", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52224, "text": "In order to achieve the content of the shared link installation or quickly jump to the specified content of Migu Video, and analyze the effect of the sharing source, Migu Video will call your shear plate function when starting and read the shared link information.", "label": ["Permission Acquisition", "Important"], "rewrite": "When Migu Video starts, you will call your shear function and read the shared link information."}
{"task": "rw_45.jsonl", "id": 52225, "text": "1.8 Equipment Information", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52226, "text": "In order to ensure the normal operation of \"Migu Video\", when you use the \"Migu Video\" service, we will collect device attribute information including your end user [SDK version, operator information, IP address, system platform, system version, application, application, application, application, application, application, application, application, application, application, application, application, application, application, application, application, application, application, application, application, application, application, application, application, application, application, application, application, application, application, application, application, application, and applicationPackage name and version, before and after application, independent device logo, iOS advertising identifier (IDFA), network card (MAC) address, international mobile device recognition code (IMEI), anonymous device identifier (OAID), international mobile user recognitionInformation including network access methods and types, operation logs.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect device attribute information including your terminal user [SDK version, operator information, IP address, system platform, system version, application package name and version, before and after application, independent device logo, iOS advertising identifier (IDFA) (IDFA)Sensor information, Bluetooth information, WIFI status information, CPU information, memory information, equipment information, battery usage], software version number, network access method and type, type, and operation log."}
{"task": "rw_45.jsonl", "id": 52227, "text": "The above information is the basic information we must collect to you through \"Migu Video\".", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52228, "text": "Getting this information will ask you to authorize Migu Video to use phone permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "Getting this information will ask you to authorize Migu Video to use phone permissions."}
{"task": "rw_45.jsonl", "id": 52229, "text": "Due to the compatibility of the mobile phone system, some mobile phones, such as Redmi mobile phones, do not trigger the system pop -up window when applying for the equipment information we apply for mobile phones, so we collected equipment information after explaining the use scenario;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52230, "text": "When some Xiaomi mobile phones set the device information as inquiries, we ask if we have permissions that will also trigger the system pop -up window.", "label": ["Permission Acquisition", "Important"], "rewrite": "When some Xiaomi mobile phones set the device information as inquiries, we ask if we have permissions that will also trigger the system pop -up window."}
{"task": "rw_45.jsonl", "id": 52231, "text": "1.9 Account Information (Calculation Related)", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52232, "text": "In order to achieve multi -account login function, Migu Video uses the account management function under the communication record limit group, but it does not use access to user address book contact data.", "label": ["Permission Acquisition", "Important"], "rewrite": "Migu Video uses the account management function under the communication record limit group, but it does not use access to user address book contact data."}
{"task": "rw_45.jsonl", "id": 52233, "text": "1.10 Bluetooth", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52234, "text": "In order to realize the screening of the screen device, the screen playback function is achieved by adapting the screen.", "label": ["Permission Acquisition", "Important"], "rewrite": "We applied for Bluetooth permissions to connect to the screen."}
{"task": "rw_45.jsonl", "id": 52235, "text": "1.11 siri", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52236, "text": "In order to achieve Siri search and quickly use Siri voice instructions, we applied for Siri permissions on Apple mobile phones.", "label": ["Permission Acquisition", "Important"], "rewrite": "We applied for Siri permissions on Apple's mobile phone."}
{"task": "rw_45.jsonl", "id": 52237, "text": "2. How can we share your information", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52238, "text": "Please know that most of the products/services we provide for you cannot be completed alone, so we may share or entrust them to handle some of your personal information with third parties such as our affiliated companies and other partners.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52239, "text": "At present, in addition to getting your clear consent or authorization again, the main circumstances involved in such sharing or entrustment include: provide necessary information according to the requirements of administrative, judicial authority, etc.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52240, "text": "Provide account consistency services with affiliated companies.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52241, "text": "Necessary information;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52242, "text": "In order to provide services such as express delivery, third -party payment and other services related to relevant partners, third -party merchants, payment institutions, etc.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52243, "text": "We will sign strict information protection and confidentiality agreement with them, asking them to abide by the agreement and take relevant security measures to protect your personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will sign strict information protection and confidentiality agreement with them, asking them to abide by the agreement and take relevant security measures to protect your personal information."}
{"task": "rw_45.jsonl", "id": 52244, "text": "For the third -party software tool development package (\"SDK\") we use, you can view the full text of Migu Video's privacy policy, which contains access to third -party SDK information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For the third -party software tool development package (\"SDK\") we use, you can view the full text of Migu Video's privacy policy, which contains access to third -party SDK information."}
{"task": "rw_45.jsonl", "id": 52245, "text": "3. How do you manage your information", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52246, "text": "You have the right to manage your personal information, including query, correction, and booking your account information, address information, search records, review information, change the scope of your authorization consent or withdraw authorization, and cancel your account number.", "label": ["Important", "Edit/Control"], "rewrite": "You have the right to manage your personal information, including query, correction, and booking your account information, address information, search records, review information, change the scope of your authorization consent or withdraw authorization, and cancel your account number."}
{"task": "rw_45.jsonl", "id": 52247, "text": "You can perform the above operations through the function settings provided in our app.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52248, "text": "If you cannot manage through the above way, you can contact us through the contact information provided below, and we will reply to your requirements within 15 working days.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52249, "text": "4. How can we do a good job of minor protection", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52250, "text": "We attach great importance to the protection of personal information.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52251, "text": "Since our service is mainly for adults, if you are a minor, it is recommended that you ask your parents or guardians to read this privacy policy carefully and use our service or direction to your parents or guardian consent.We provide information.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a minor, it is recommended that you ask your parents or guardians to read the privacy policy carefully and use our services or provide information to us under the consent of your parents or guardians."}
{"task": "rw_45.jsonl", "id": 52252, "text": "We also provide adolescent models to provide suitable browsing content for minors. After the adolescent mode can be set up by parents or guardians, the youth mode can be browsed.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52253, "text": "If you are not satisfied with our response, you can also seek solution by filed a lawsuit to a court where the Migu Mimu's Miku company is located.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52254, "text": "5. How do you contact us", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52255, "text": "You can contact us in the following ways, and we will answer your request within 15 days.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52256, "text": "1. You can contact us through online customer service or customer service hotline.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52257, "text": "2. We have set up a personal information protection specialist. You can get in touch with it in the following ways: service@migu.cn.", "label": ["Important", "Contact Information"], "rewrite": "You can get in touch with it in the following ways: service@migu.cn."}
{"task": "rw_45.jsonl", "id": 52258, "text": "We will review the issues involved as soon as possible and reply within fifteen days after verifying your true identity.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52259, "text": "Migu Company attaches great importance to your personal information protection and will try its best to protect your personal information.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52260, "text": "This policy is applicable to the services provided by Migu's Midu product. Please read and understand this \"Privacy Policy\" before using Migu products.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52261, "text": "Part 1: Definition and noun explanation", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52262, "text": "Migu Company: Migu Culture Technology Co., Ltd. and its five subsidiaries Migu Music Co., Ltd., Migu Video Technology Co., Ltd., Migu Digital Media Co., Ltd., Migu Interactive Entertainment Co., Ltd. and Migu Anime Co., Ltd.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52263, "text": "Migu Music Co., Ltd. operates \"Migu Music\" and \"Migu Love Singing\" APP. The registered address is: China (Sichuan) Free Trade Pilot Zone Chengdu High -tech Zone Jiaozi Avenue No. 575 Zhonghai International Center No. 1 floor 103, 103, 103, and 103,No. 104 and Block J 3-10 floors;", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52264, "text": "Migu Video Technology Co., Ltd. operates \"Migu Video\" and \"Mobile Cloud VR\" APP. The registered address is: No. 636, Yunqiao Road, Shanghai Free Trade Pilot Zone;", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52265, "text": "Migu Digital Media Co., Ltd. operates \"Migu Reading\" and \"Migu Cloud Bookstore\" APP. The registered address is: Room 101, 1st floor of Xixi Ginza, Xixi District, Xihu District, Hangzhou City, Zhejiang Province;", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52266, "text": "Migu Interactive Entertainment Co., Ltd. operates \"Migu Tour\" and \"Migu Shan Run\" (including TV -side 'Migu Fitness') APP.9, 10, 11 floors, 3 floors of Building 5, Building 6, 3, 3, 4, and 5;", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52267, "text": "Migu Animation Co., Ltd. operates the \"Migu Circle\" APP. The registered address is: No. 1133, Jimei Avenue, Jimei District, Xiamen.", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52268, "text": "Migu products: Migu Midu Music Music, Migu Love, Migu Video, \"Mobile Cloud VR\", Migu Reading, Migu Run, Migu Circle, Mimu Circle, Mimu CircleGurun Bookstore, 5G Mercy Website or Mobile Application Software.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52269, "text": "Personal information: A variety of information that can be recorded in electronics or other ways to identify specific natural persons or reflects the activity of specific natural persons with other information.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52270, "text": "Personal information includes name, date of birth, ID number, personal biometric information, address, communication and communication contact information, communication records and content, account passwords, property information, credit information, trading information, trading information.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52271, "text": "Personal sensitive information: Once leaked, illegally provided or abuses the security of people and property, it is easy to lead to personal information that is treated with personal reputation, physical and mental health or discrimination.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52272, "text": "Personal sensitive information includes identity documents, personal biometric information, bank accounts, communication records and content, property information, credit information, trajectory trajectory, accommodation information, health and physiological information, transaction information, individuals under 14 years old (inclusive).information.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52273, "text": "The only device identifier: refers to a string of characters compiled by the equipment manufacturer into the device, which can be used to identify the corresponding equipment in a unique way.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52274, "text": "Specifically include: international mobile device recognition code (IMEI), anonymous device identifier (OAID), Android ID, iOS advertising identifier (IDFA), network card (MAC) address, international mobile user identification code (IMSI), OpenUDID, GUIDEssence", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52275, "text": "User portrait: By collecting, converging, and analyzing personal information, the personal characteristics of a specific natural person, such as their occupations, economy, health, education, personal preferences, credit, and behavior in terms of analysis or prediction, forming their personal characteristics models.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52276, "text": "Use personal information of specific natural persons to form a characteristic model of the natural person, called direct user portraits.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52277, "text": "The use of personal information from specific natural persons, such as the data of its group, forms a characteristic model of the natural person, called indirect user portraits.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52278, "text": "Devision: Through the technical processing of personal information, the process of personal information cannot be recognized, and the processing information after processing cannot be restored.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52279, "text": "The information obtained after the identification processing of personal information is not personal information.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52280, "text": "Part 2: Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52281, "text": "This policy includes the following:", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52282, "text": "1. What personal information do we collect", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52283, "text": "2. How do we use your personal information", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52284, "text": "3. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52285, "text": "4. How do we share, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52286, "text": "5. How do we save and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52287, "text": "6. Your rights", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52288, "text": "7. How do we deal with the personal information of minors", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52289, "text": "8. How can your personal information be transferred globally", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52290, "text": "Nine, how to update this policy", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52291, "text": "Ten, how to contact us", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52292, "text": "1. What personal information do we collect", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52293, "text": "The following products and services provided by Migu Company need to rely on some information to run. If you choose to use a service, you need to provide or allow us to collect the corresponding necessary information. If you refuse to provideAs a result, we cannot provide this service, but it will not affect your use of other products and services.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52294, "text": "(1) Migu Video:", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52295, "text": "1. Guarantee the normal operation of \"Migu Video\"", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52296, "text": "Application package name and version, before and after application, independent device logo, iOS advertising identifier (IDFA), network card (MAC) address, international mobile device recognition code (IMEI), anonymous device identifier (, OAID) ,,,,,,,,,,,,,,,,,,,International mobile user identification code (IMSI), device manufacturer, equipment model, equipment language, application list information, base station information, sensor information, Bluetooth information, WIFI status information, CPU information, memory information, equipment information, battery use conditions,], Software version number, network access method and type, type, operating log information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect device attribute information including your terminal user [SDK version, operator information, IP address, system platform, system version, application package name and version, before and after application, independent device logo, iOS advertising identifier (IDFA) (IDFA)Sensor information, Bluetooth information, WIFI status information, CPU information, memory information, equipment information, battery usage], software version number, network access method and type, type, and operation log."}
{"task": "rw_45.jsonl", "id": 52297, "text": "The above information is the basic information we must collect to you through \"Migu Video\".", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52298, "text": "In order to normalize mobile phone equipment and operator networks to ensure normal use of flow -free services and automatic login services, we requested you to authorize Migu Video to use phone permissions when running the APP for the first time.", "label": ["Permission Acquisition", "Important"], "rewrite": "When we run the app for the first time, we ask you to authorize Migu Video to use phone permissions."}
{"task": "rw_45.jsonl", "id": 52299, "text": "The permissions are described in different mobile terminals and different system versions: Get device information/get mobile phone recognition code/get mobile phone number and call status/call and manage call/get phone permissions/get mobile phone numbers, IMEI, IMSI.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52300, "text": "In order to ensure the function of the normally running picture display of Migu Video, we used the Fresco Library to improve the performance of the picture. Because the picture processing involves the storage function of the device, we will ask you to authorize the Midu video to use the storage permissions when running the APP for the first time.com.wireLove used by Fresco, three SDK packages of three SDK packages of three SDK packages of three SDK packages of three SDK packages of your device, com.wireless.security will visit mobile phone device information.", "label": ["Data Retention", "Permission Acquisition", "Important"], "rewrite": "When running the APP for the first time, we will ask you to authorize Migu Video to use the storage permissions. The com.wireless.Security, com.facebook.cache, com.facebook.Common three SDK package will read and write the storage information of your device.com.wireless.Sec \"can access mobile phone device information."}
{"task": "rw_45.jsonl", "id": 52301, "text": "In order to realize the content of the shared link installation or quickly jump to the specified content of Migu Video, and analyze the effect of the sharing source, Migu Video will call your shear plate function when startingPlate authority does not require manual authorization, but on some mobile phones, you can choose to close the permissions in the system settings-permissions management.", "label": ["Permission Acquisition", "Edit/Control", "Important"], "rewrite": "Migu video will call your shear plate function when starting, read the shared link information, and the scissor permissions do not need to be manually authorized, but you can choose to set up the system settings of the mobile phonePermissions."}
{"task": "rw_45.jsonl", "id": 52302, "text": "Reading device information and storage permissions is the necessary permissions required for Migu Video APP to implement basic functions. If refusal to provide, it will affect the realization of basic functions;", "label": ["Permission Acquisition", "Important"], "rewrite": "Reading device information and storage permissions is the necessary permissions required for the basic function of Migu Video APP. If it refuses to provide it, it will affect the realization of basic functions."}
{"task": "rw_45.jsonl", "id": 52303, "text": "Except for the above necessary permissions, other permissions will be called when the user uses specific functions. The app will apply for authorization consent through pop -up or floating layer.", "label": ["Permission Acquisition", "Important"], "rewrite": "Except for the above necessary permissions, other permissions will be called when the user uses specific functions. The app will apply for authorization consent through pop -up or floating layer."}
{"task": "rw_45.jsonl", "id": 52304, "text": "2. Register, certify, log in to the \"Migu Video\" service", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52305, "text": "(1) When you register and log in to the \"Migu Video\" service, you can use it, the \"one -click login\" function, by authorizing us to collect and verify your mobile phone number, facilitate us to provide you with a fast login service.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "You can use the \"one -click login\" function to authorize us to collect and verify your mobile phone number, so that we can provide you with a fast login service."}
{"task": "rw_45.jsonl", "id": 52306, "text": "You do not choose \"one -click login\", you can also use other login methods to fill in the mobile verification code, password login, and third -party account login.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52307, "text": "In order to enhance the user experience, Migu Video provides automatic registration and login functions with mobile phone numbers. When you are unwilling to automatically register and log in, you can choose to disagree with the user protocol at the first installation, and complete the registration login by yourself when you need it.", "label": ["Policy Change", "Important"], "rewrite": "When you are unwilling to register and log in automatically, you can choose to disagree with the user agreement at the first installation and complete the registration login when you need it."}
{"task": "rw_45.jsonl", "id": 52308, "text": "When you choose to create an account through your mobile phone number, we will verify whether your identity is valid by sending a SMS verification code, and you improve the network identity information (avatar, nickname and password). The collection of this information is to help you complete the registration.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you choose to create an account through your mobile phone number, we will verify whether your identity is valid by sending a SMS verification code, and you improve the network identity information (avatar, nickname and password). The collection of this information is to help you complete the registration."}
{"task": "rw_45.jsonl", "id": 52309, "text": "You can also choose to fill in gender, birthday, region, personality signature according to your own needs, and fill in the receiving address information including the consignee's name, telephone, detailed address, and postal code.The prizes, when shopping at Migu Mall, fill in the order courier products, will not be used for other purposes.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can also choose to fill in gender, birthday, region, personalized signature according to your own needs, and fill in the receiving address information including the consignee's name, telephone, detailed address, and postal code."}
{"task": "rw_45.jsonl", "id": 52310, "text": ") Improve your personal information.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52311, "text": "When you use the \"avatar\" function, we ask you to authorize the camera to store permissions for taking pictures, reading albums and publishing.", "label": ["Permission Acquisition", "Important"], "rewrite": "When using the \"avatar\" function, we will ask you to authorize the camera to store the permissions for taking pictures, reading albums and publishing."}
{"task": "rw_45.jsonl", "id": 52312, "text": "You refuse to authorize, you will not be able to use this feature, but it does not affect other functions of your use of \"Migu Video\" normally.", "label": ["Permission Acquisition", "Important"], "rewrite": "You refuse to authorize, you will not be able to use this feature, but it does not affect other functions of your use of \"Migu Video\" normally."}
{"task": "rw_45.jsonl", "id": 52313, "text": "Camera permissions and storage permissions need you to authorize \"Migu Video\". The above permissions are described in different mobile terminals and/or different system versions, including but not limited to: allow Migu Video to take photos and recording videos;", "label": ["Permission Acquisition", "Important"], "rewrite": "Camera permissions and storage permissions require you to authorize \"Migu Video\"."}
{"task": "rw_45.jsonl", "id": 52314, "text": "Allow Migu Video to visit photos, media content and files on your device.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52315, "text": "(2) You can also log in to \"Migu Video\" with a third -party account (WeChat, QQ, Weibo account, Appleid, mailbox). At this time, you will authorize us to obtain the public information registered on the third -party platform (including avatars, including avatars, avatars,Nickname information), you can bind your third -party account with your Migu account after agreeing with your privacy policy, so that you can log in to and use this product and the corresponding service through the third -party account (the first three parties authorize to log in to log inYou need to bind the mobile phone number for verification), where the Tencent login SDK needs to obtain your device IMSI information in order to provide a diverse and convenient login method.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "You will authorize us to obtain the public information (including avatars and nickname information) registered on the third -party platform."}
{"task": "rw_45.jsonl", "id": 52316, "text": "。", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52317, "text": "(3) When you use voice search, we need to request you to get microphone rights to obtain your voice input information.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "When you use voice search, we need to request you to get microphone rights to obtain your voice input information."}
{"task": "rw_45.jsonl", "id": 52318, "text": "The recording and voice search function requires you to authorize the \"Migu Video\". The above permissions are described in different mobile terminals and/or different system versions, including but not limited to: allow Migu Video to apply for microphone rights/recording rights.Essence", "label": ["Permission Acquisition", "Important"], "rewrite": "The recording and voice search function requires you to authorize the \"Migu Video\"."}
{"task": "rw_45.jsonl", "id": 52319, "text": "3. Provide personalized content recommendation service", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52320, "text": "(1) Page access, content use, social interaction and focus on sharing these behavior information, use time information;", "label": ["Important", "Usage"], "rewrite": "Page access, content use, social interaction and focus on sharing these behavior information of your use, use time information."}
{"task": "rw_45.jsonl", "id": 52321, "text": "(2) Feedback, release, likes, comments, collection, appointment, barrage information about the information you actively provide;", "label": ["Usage"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52322, "text": "(3) Get the geographical location information after your explicit consent.", "label": ["Usage"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52323, "text": "If you refuse to provide geographical information, we will not push you content based on geographical location information, but will not affect the normal use of other functions and services of \"Migu Video\".", "label": ["Important", "Usage"], "rewrite": "If you refuse to provide geographical information, we will not push you content based on geographical location information, but will not affect the normal use of other functions and services of \"Migu Video\"."}
{"task": "rw_45.jsonl", "id": 52324, "text": "You can use the geographical location information to be used after you authorize the \"Migu Video\". The above permissions may have different descriptions on different mobile terminals and/or different system versions, including but not limited to: allow Migu Video to obtain location information of the device.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52325, "text": "We may combine the above information with other services from other services. Through algorithm analysis, personalized recommendations, display or push you specific short video information or services that you may be interested in.", "label": ["Important", "Usage"], "rewrite": "We may combine the above information with other services from other services. Through algorithm analysis, personalized recommendations, display or push you specific short video information or services that you may be interested in."}
{"task": "rw_45.jsonl", "id": 52326, "text": "When you do not agree to provide the aforementioned service, you can choose to close through the \"Mine-> Settings-> Privacy-> Privacy Settings\" path, but it does not affect other functions of your normal use of \"Migu Video\".", "label": ["Important", "Edit/Control"], "rewrite": "When you do not agree to provide the aforementioned service, you can choose to close through the \"Mine-> Settings-> Privacy-> Privacy Settings\" path, but it does not affect other functions of your normal use of \"Migu Video\"."}
{"task": "rw_45.jsonl", "id": 52327, "text": "Please understand that when we collect and use the above information, we have identified it in accordance with laws and regulations.", "label": ["Important", "Data Security"], "rewrite": "When we collect and use the above information, we have identified it in accordance with laws and regulations."}
{"task": "rw_45.jsonl", "id": 52328, "text": "4. Provide content upload service", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52329, "text": "When you use the content upload service (\"G customer video upload\"), we may ask you to get the camera to read the rights of photos, storage, and access to the microphone for content shooting and local content upload.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use the content upload service (\"G customer video upload\"), we may ask you to get the camera to read the rights of photos, storage, and access to the microphone for content shooting and local content upload."}
{"task": "rw_45.jsonl", "id": 52330, "text": "When you refuse to authorize, you will not be able to use this function, but it does not affect other functions of your normal use of \"Migu Video\".", "label": ["Permission Acquisition", "Important"], "rewrite": "When you refuse to authorize, you will not be able to use this function, but it does not affect other functions of your normal use of \"Migu Video\"."}
{"task": "rw_45.jsonl", "id": 52331, "text": "You only need to authorize the \"Migu Video\" to take pictures and read the album function. The above permissions may have different descriptions on different mobile terminals and/or different system versions, including but not limited to: allow Migu Video to apply for microphone permeability/Recording permissions;", "label": ["Permission Acquisition", "Important"], "rewrite": "You only need to authorize \"Migu Video\" after taking pictures and reading albums."}
{"task": "rw_45.jsonl", "id": 52332, "text": "Allow Migu video to take photos and recording videos;", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52333, "text": "Allow Migu Video to visit photos, media content and files on your device.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52334, "text": "5. Provide \"investment TV\" service", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52335, "text": "When you use the \"Delivery TV\" service, we may ask you to obtain the permissions of connecting and binding TV devices to watch \"Migu Video\" content on TV devices.", "label": ["Permission Acquisition", "Important"], "rewrite": "We may ask you to obtain the permissions of connecting and binding TV devices for watching \"Migu Video\" content on TV devices."}
{"task": "rw_45.jsonl", "id": 52336, "text": "When you refuse to authorize, you will not be able to use this function, but it does not affect other functions of your normal use of \"Migu Video\".", "label": ["Permission Acquisition", "Important"], "rewrite": "When you refuse to authorize, you will not be able to use this function, but it does not affect other functions of your normal use of \"Migu Video\"."}
{"task": "rw_45.jsonl", "id": 52337, "text": "Please understand that due to the TV equipment model and functional reasons, the \"investment\" service may not apply to all TV devices.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52338, "text": "6. Provide \"appointment\" viewing service", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52339, "text": "When you use the \"Booking\" to watch the service, we need to request you to read and edit the permissions of the calendar to determine whether you have appointment to watch the program and set up a system reminder.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use the \"Booking\" to watch the service, we need to ask you to read and edit the permissions of the calendar."}
{"task": "rw_45.jsonl", "id": 52340, "text": "You only need to authorize the \"Migu Video\" to use the calendar function. The above permissions have different descriptions on different mobile terminals and/or different system versions, including but not limited to: allow Migu video to read and change your calendar.", "label": ["Permission Acquisition", "Important"], "rewrite": "The calendar function requires you to authorize \"Migu Video\"."}
{"task": "rw_45.jsonl", "id": 52341, "text": "7. Video Bell Service", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52342, "text": "When you use the color bell DIY function, we will ask you to authorize Macing wind and camera permissions for recording and making DIY colorful bells;", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use the colorful bell DIY function, we ask you to authorize the macro -wind and camera permissions."}
{"task": "rw_45.jsonl", "id": 52343, "text": "8. \"Cloud Audiences\", \"Cloud Box\" and Live Lian Mai service", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52344, "text": "When you use cloud audiences, cloud boxes, cloud shouts, and concert live broadcasts, we will ask you to authorize the microphone rights and camera permissions to shoot your video screen and collect sound to participate in real -time interaction of the live broadcast.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use cloud audiences, cloud boxes, cloud shouts, and concerts live, we will ask you to authorize the microphone rights and camera permissions."}
{"task": "rw_45.jsonl", "id": 52345, "text": "9. Share service", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52346, "text": "When you perform picture poster sharing and pass the coupon gift operation, we will ask you to authorize the application for the application of the album access permissions for the storage and sharing of the sharing of the picture for generating.", "label": ["Permission Acquisition", "Important"], "rewrite": "We will ask you to authorize the application of album access permissions to save and share the sharing or gifts for generating."}
{"task": "rw_45.jsonl", "id": 52347, "text": "You can use the text message sharing function of the page content or video in \"Migu Video\". You can send text messages to the address book contact or other numbers on the text message interface of the call system, but \"Migu Video\" does not apply forThe authority of SMS and reading address book contacts will not be obtained by sending text messages, text messages, and address book contact information.", "label": ["Permission Acquisition", "Important"], "rewrite": "You can send text messages to the address book contact or other numbers on the text message interface of the call system."}
{"task": "rw_45.jsonl", "id": 52348, "text": "You can share the page content or video in \"Migu Video\". In order to facilitate your use of the sharing function, we use Sina Weibo to share SDK, WeChat sharing SDK, QQ sharing SDK, MOB sharing SDK, Share sharing SDK, you use you to useWe may collect the unique identification information (IMEI) and the current mobile phone status information of your mobile terminal to achieve one -click sharing to Sina Weibo, WeChat friends, WeChat friends circle, QQ, QQ space function.", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to facilitate your use of the sharing function, we used Sina Weibo to share SDK, WeChat sharing SDK, QQ sharing SDK, MOB sharing SDK, Share sharing SDK."}
{"task": "rw_45.jsonl", "id": 52349, "text": "10. Code service", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52350, "text": "When you use a scanning, scanning code to bind the TV box, log in to the PC client or the WWW webpage, we will ask you to authorize the camera permissions to shoot the code scanning.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use a scanning, scanning code to bind the TV box, log in to the PC client or the WWW webpage, we will ask you to authorize the camera permissions to shoot the code scanning."}
{"task": "rw_45.jsonl", "id": 52351, "text": "11. Participate in vitality task", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52352, "text": "When you enter the dynamic value task center page from the homepage or my page, in order to increase the speed of opening and reduce traffic consumption, you need to download some page content to save it in the device storage space, so we will ask you to authorize access to the storage permission for storage for storage for storageThe necessary page content.", "label": ["Data Retention", "Important", "First Party Collection Information"], "rewrite": "We will ask you to authorize access to the storage right to store the necessary page content."}
{"task": "rw_45.jsonl", "id": 52353, "text": "12. Submit feedback and help service", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52354, "text": "When you use the feedback function of Migu Video, we will ask your camera, photos, media content, and file permissions of your authorized device to track, upload pictures, and submit them after submitting the content.", "label": ["Permission Acquisition", "Important"], "rewrite": "We will ask your camera, photos, media content and file permissions of your authorized device."}
{"task": "rw_45.jsonl", "id": 52355, "text": "When you use Migu Video's activity center-questionnaire filling function, we will ask your mobile phone number to follow the questionnaire tracking and return visit in subsequent questionnaires.", "label": ["Permission Acquisition", "Important"], "rewrite": "We will ask your mobile phone number to follow the questionnaire tracking and return visit in subsequent questionnaires."}
{"task": "rw_45.jsonl", "id": 52356, "text": "When you use the help and customer service functions of Migu Video, you need to upload pictures, so we ask you to authorize the authority of the camera and storage/album authority (iOS is the album permissions, the Android end is storage permissions), which is used to submit the content of the contentTime can be uploaded and followed after submitting.", "label": ["Permission Acquisition", "Important"], "rewrite": "We will ask you to authorize the camera permissions and storage/album permissions (iOS is the album permissions, and the Android end is the storage permissions), which can be tracked and processed after submitting the content and submitting."}
{"task": "rw_45.jsonl", "id": 52357, "text": "13. Apply for mobile business and traffic query", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52358, "text": "Migu Video APP provides you with an entrance to the mobile business online. Through this entrance, you can enter the Chinese mobile website to apply for mobile card cards and purchase traffic functions. When applying for mobile business, according to national laws and regulations, you need to collect your name and identity.The card number, phone number, and detailed address information. This information is collected by the business party when applying for business. Migu Video does not collect and store it. Please carefully check the business of the business party when applying for business to protect personal privacy information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52359, "text": "When you log in to the account number bound to the account is Chinese mobile users, Migu Video will provide you with traffic query and display services. If you want to close the traffic function of the personal center page, you can set it in the setting-privacy-privacy control.closure;", "label": ["Edit/Control", "Important"], "rewrite": "If you want to close the traffic function of the personal center page, you can close it in setting-privacy-privacy control."}
{"task": "rw_45.jsonl", "id": 52360, "text": "If you want to close the traffic reminder during playback, you can close it in the setting-non-WiFi network playback reminder.", "label": ["Edit/Control", "Important"], "rewrite": "If you want to close the traffic reminder during playback, you can close it in the setting-non-WiFi network playback reminder."}
{"task": "rw_45.jsonl", "id": 52361, "text": "14. Ticket purchase service", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52362, "text": "Migu Video APP provides you with online ticket purchase services. Through this entrance, you can choose a movie theater and movie tickets.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52363, "text": "In order to facilitate positioning your surrounding cinemas, the ticket purchase service needs to use your location information;", "label": ["Important", "First Party Collection Information"], "rewrite": "To facilitate positioning your surrounding cinemas, ticket purchase services need to use your location information."}
{"task": "rw_45.jsonl", "id": 52364, "text": "In addition, in accordance with national laws and regulations and epidemic prevention requirements, you need to provide your name, mobile phone number, and ID number information when purchasing tickets.", "label": ["Important", "First Party Collection Information"], "rewrite": "In addition, in accordance with national laws and regulations and epidemic prevention requirements, you need to provide your name, mobile phone number, and ID number information when purchasing tickets."}
{"task": "rw_45.jsonl", "id": 52365, "text": "15. Advertising service", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52366, "text": "Advertising push services are the core business functions of our products and/or services. In the process, we need to collect your personal information and equipment information to achieve advertising push and advertising effect analysis. Specifically include UA, application name and version, version, version, version, version, version, version, version, version, version, version, version, version, version, version, version, version, version, version, version, version, version, and versions, and versions, and versions, and versions, and versions.Mobile phone numbers, IMEI, IDFA, Adid, OAID, Openudid, AID, MAC address, IP address, device manufacturer, device type, operating system, networking method, geographical location information, operators, screen size, application startup and update timeWe will conduct irreversible encryption and storage.", "label": ["Important", "First Party Collection Information"], "rewrite": "We need to collect your personal information and equipment information to achieve advertising push and advertising effect analysis."}
{"task": "rw_45.jsonl", "id": 52367, "text": "Advertising services will be loaded when the APP is opened, so the above information will be collected at this time.", "label": ["Important", "First Party Collection Information"], "rewrite": "Advertising services will be loaded when the APP is opened, so the above information will be collected at this time."}
{"task": "rw_45.jsonl", "id": 52368, "text": "16. For users who use the Android system, when you use Migu videos, in order to provide, process, maintain, improve, and develop the purpose of our service, this software may obtain the following permissions of your terminal equipment. Of course, you can refuse to open the following belowPermanent, or turn off the following permissions in the mobile phone settings, but it does not affect your use of \"Migu Video\" other functions:", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52369, "text": "Visiting location: You can authorize Migu Video to use the location. After the authorization location, Migu Video will provide you with the content that you provide according to your location, and also provide you with the nearby theaters when using the \"movie ticket purchase\" service.", "label": ["Permission Acquisition", "Important"], "rewrite": "You can authorize Migu Video to use location."}
{"task": "rw_45.jsonl", "id": 52370, "text": "Access camera: You can use the camera to scan the code for scanning;", "label": ["Permission Acquisition", "Important"], "rewrite": "You can use the camera to scan the code for scanning."}
{"task": "rw_45.jsonl", "id": 52371, "text": "Take and upload pictures directly for avatar settings;", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52372, "text": "Take it directly and upload the picture;", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52373, "text": "Directly record the video and upload the video content;", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52374, "text": "Use live broadcast function or service;", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52375, "text": "When using the cloud box and cloud audiences, shoot and upload the content directly to achieve the cloud watching and virtual boxes.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52376, "text": "Visit microphone: You can use voice search or AI voice assistant by turning on the microphone right;", "label": ["Permission Acquisition", "Edit/Control", "Important"], "rewrite": "You can use voice search or AI voice assistant by turning on microphone rights."}
{"task": "rw_45.jsonl", "id": 52377, "text": "Direct video recording and uploading the video content.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52378, "text": "Visit the calendar: You can use the calendar function to use the calendar function through the authorization of Migu Video, set the calendar reminder for the reservation program, and obtain the viewing reminder of the program.", "label": ["Permission Acquisition", "Important"], "rewrite": "You can use the calendar function to use the calendar function of Migu Video, set the calendar reminder for the reservation program, and obtain the viewing reminder of the program."}
{"task": "rw_45.jsonl", "id": 52379, "text": "Visit local storage: You can save download videos by opening local storage permissions to save to your mobile phone storage;", "label": ["Permission Acquisition", "Important"], "rewrite": "You can save the download video to your mobile phone storage by turning on the local storage permissions."}
{"task": "rw_45.jsonl", "id": 52380, "text": "Upload and publish your local pictures by visiting local storage, and upload the video content and publish.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52381, "text": "Visit phone: Through your phone status permissions, we record your international mobile device recognition code (IMEI) and international mobile user identification code (IMSI) for statistics, security verification, advertising and risk control management.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52382, "text": "17. For users who use the iOS system, when you use Migu videos, in order to provide, process, maintain, improve, and develop the purpose of our service, this software may obtain the following permissions of your terminal equipment. Of course, you can refuse to open the followingPermanent, or turn off the following permissions in the mobile phone settings, but it does not affect your use of \"Migu Video\" other functions:", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52383, "text": "Visiting location: You can authorize Migu Video to use the location. After the authorization location, Migu Video will provide you with the content that you provide according to your location, and also provide you with the nearby theaters when using the \"movie ticket purchase\" service.", "label": ["Permission Acquisition", "Important"], "rewrite": "You can authorize Migu Video to use the location. After the location of the authorization, Migu Video will provide you with the content of your location, and also provide you with a nearby theater when using the \"movie ticket purchase\" service."}
{"task": "rw_45.jsonl", "id": 52384, "text": "Access camera: You can use the camera to scan the code for scanning;", "label": ["Permission Acquisition", "Important"], "rewrite": "You can use the camera to scan the code for scanning."}
{"task": "rw_45.jsonl", "id": 52385, "text": "Take and upload pictures directly for avatar settings;", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52386, "text": "Take it directly and upload the picture for sun -drawing or sharing;", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52387, "text": "Directly record the video and upload the video content;", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52388, "text": "Use live broadcast function or service;", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52389, "text": "When using the cloud box and cloud audiences, shoot and upload the content directly to realize the cloud viewing and virtual box viewing.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52390, "text": "Visit microphone: You can use voice search or AI voice assistant by turning on the microphone right;", "label": ["Permission Acquisition", "Important"], "rewrite": "You can use voice search or AI voice assistant by turning on microphone rights."}
{"task": "rw_45.jsonl", "id": 52391, "text": "Direct video recording and uploading the video content.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52392, "text": "Voice recognition permissions: You can authorize Migu Video to use voice recognition permissions to achieve voice search and AI assistant voice recognition, which is convenient for voice input.", "label": ["Permission Acquisition", "Important"], "rewrite": "You can authorize Migu Video to use voice recognition permissions to achieve voice search and AI assistant's voice recognition, which is convenient for voice input."}
{"task": "rw_45.jsonl", "id": 52393, "text": "Visit the permissions of calendar and reminder matters: You can use the reminder matters and calendar functions to use the authorized Midu video to set up event calendar reminders to obtain the viewing reminder of the program.", "label": ["Permission Acquisition", "Important"], "rewrite": "You can use reminders and calendar functions through authorized Migu Video to remind the reservation program setting event calendar reminders to obtain the viewing reminder of the program."}
{"task": "rw_45.jsonl", "id": 52394, "text": "Visiting photo album photos: Save the pictures of posters, upload and publish local pictures, publish and publish photos, set up photos as avatars and upload it as avatars and upload them.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52395, "text": "Bluetooth permissions: Implement the screen device distribution network, and realize the screen playback function by adapting the screen.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52396, "text": "Siri permissions to implement Siri search and use Siri voice instructions for Siri mobile phone users.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52397, "text": "Tracking IDFA: Statistics and advertising are achieved by tracking the iOS advertising identifier (IDFA).", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52398, "text": "News notification: The new message notification is opened by default, you can go to the \"Settings-> Notice-> Migu Video\" manually.", "label": ["Permission Acquisition", "Important", "Edit/Control"], "rewrite": "The new news notification is opened by default, you can go to the \"Settings-> Notice-> Migu Video\" manually."}
{"task": "rw_45.jsonl", "id": 52399, "text": "18. About withdrawal authorization", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52400, "text": "For the collection and use of additional personal information, you can give or withdraw your authorization consent at any time.", "label": ["Important", "Edit/Control"], "rewrite": "For the collection and use of additional personal information, you can give or withdraw your authorization consent at any time."}
{"task": "rw_45.jsonl", "id": 52401, "text": "You can change your authorization of the scope of personal information or withdraw your authorization by deleting information, closing the device function, and changing your authorization of personal information in \"My-> Settings-> Privacy Settings-> Permanent Settings\".", "label": ["Important", "Edit/Control"], "rewrite": "In \"My-> Settings-> Privacy Settings-> Permanent Settings\", changes your authorization of the scope of your personal information or withdraw your authorization."}
{"task": "rw_45.jsonl", "id": 52402, "text": "You can also cancel us through the way to cancel the account (my-> settings-> security center-> account), withdrawing us to continue collecting all your personal information.", "label": ["Important", "Edit/Control"], "rewrite": "You can also cancel us through the way to cancel the account (my-> settings-> security center-> account), withdrawing us to continue collecting all your personal information."}
{"task": "rw_45.jsonl", "id": 52403, "text": "After you withdraw or authorize, we cannot continue to provide you with the service corresponding to the withdrawal consent or authorization, and we will no longer deal with your corresponding personal information.", "label": ["Important", "Edit/Control"], "rewrite": "After you withdraw or authorize, we cannot continue to provide you with the service corresponding to the withdrawal consent or authorization, and we will no longer deal with your corresponding personal information."}
{"task": "rw_45.jsonl", "id": 52404, "text": "But your decision to withdraw consent or authorization will not affect personal information processing based on your consent or authorization before.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "But your decision to withdraw consent or authorization will not affect personal information processing based on your consent or authorization before."}
{"task": "rw_45.jsonl", "id": 52405, "text": "19. Third -party SDK collection and use information description", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52406, "text": "In order to ensure the stable operation of Migu Video or implementing specific functions, we may access the software development package (SDK) provided by a third party to achieve the previous purpose.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52407, "text": "We will fulfill their prudential obligations and strictly monitor the software tool development package (SDK) that partners obtain information to protect data security.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will fulfill their prudential obligations and strictly monitor the software tool development package (SDK) that partners obtain information to protect data security."}
{"task": "rw_45.jsonl", "id": 52408, "text": "The third -party SDK we access mainly serves the needs of you and other users. Therefore, we may adjust our third -party SDK when meeting the new service needs and changes in business functions.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52409, "text": "We will publicly explain to you in this description to explain the latest situation of accessing third -party SDKs.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52410, "text": "You can read Migu Video's third -party SDK list and third -party sharing list to understand the situation of Midu video third -party SDK collection and use information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You can read Migu Video's third -party SDK list and third -party sharing list to understand the situation of Midu video third -party SDK collection and use information."}
{"task": "rw_45.jsonl", "id": 52411, "text": "2. How do we use your personal information:", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52412, "text": "1. Provide you with products or services", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52413, "text": "2. Improve the products or services we provide", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52414, "text": "We will extract your browsing and search preferences, behavioral habits, and location information based on your browsing and search records, equipment information, location information, and subscription information.You provide information display, search and trading services that are more in line with your personal needs.", "label": ["Important", "Usage"], "rewrite": "We will extract your browsing and search preferences, behavioral habits, and location information based on your browsing and search records, equipment information, location information, and subscribing information."}
{"task": "rw_45.jsonl", "id": 52415, "text": "MAC address, IP address, device manufacturer, device type, operating system, networking method, geographical location information (fuzzy location information, only provincial and municipal particle size), operators, screen size, application startup and update time, advertising click coordinates, aboveWe will carry out an anonymous desensitization processing irreversible and dense transmission.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will share some of your personal information equipment information and behaviors with third -party companies, including UA, application names and versions, IMEI, IDFA, ADID, OPENUDID, AAID, MAC address, IP address, device manufacturer, device type, operation, operation, operation, operation, operation, operation, operationSystems, networking methods, geographical location information (fuzzy location information, only provincial and municipal particle size), operators, screen size, application startup and update time, and advertising click coordinates."}
{"task": "rw_45.jsonl", "id": 52416, "text": "You have authorized us to entrust our partners to use personal information collection that has been identified as a personal information collection to form indirect user portraits to help us make advertising decision -making suggestions and increase the effective touch rate of advertising.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "You have authorized us to entrust our partners to use personal information sets that have been identified to form indirect user portraits."}
{"task": "rw_45.jsonl", "id": 52417, "text": "To ensure personal information security, we will sign the \"Data Security Confidentiality Agreement\" with partners. Your data is only used for advertising business and will not be disclosed to unauthorized parties.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will sign the Data Security Confidentiality Agreement with a partner. Your data is only used for advertising business and will not be disclosed to unauthorized parties."}
{"task": "rw_45.jsonl", "id": 52418, "text": "3. Provide you with security guarantee", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52419, "text": "(1) When we provide services, it is used for authentication, customer service, security precautions, archives and backup purposes to ensure the safety of the products and services we provided to you;", "label": ["Data Security"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52420, "text": "(2) Software authentication or management software upgrade;", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52421, "text": "After collecting your personal information, we will identify the data through technical means.", "label": ["Important", "Data Security"], "rewrite": "After collecting your personal information, we will identify the data through technical means."}
{"task": "rw_45.jsonl", "id": 52422, "text": "The information processed can not identify the subject.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52423, "text": "Please understand and agree that in this case, we have the right to use the information that has been identified;", "label": ["Risk"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52424, "text": "And on the premise of compliance with relevant laws and regulations, we have the right to analyze and utilize the user database including your personal information (including commercial utilization);", "label": ["Important", "Risk", "Usage"], "rewrite": "After collecting your personal information, we will identify the data through technical means."}
{"task": "rw_45.jsonl", "id": 52425, "text": "(3) We collect the equipment attribute information of your end user will be used for security incident investigations, testing and preventing fraud, and testing and preventing network attacks and abuse to ensure network security and operational security.", "label": ["Data Retention", "Important"], "rewrite": "We collect the equipment attribute information of your terminal user will be used to investigate, detect and prevent fraud, and test and prevent network attacks and abuse to ensure network security and operational security."}
{"task": "rw_45.jsonl", "id": 52426, "text": "4. When we want to use other purposes that the information is not stated in this policy, we will solicit your consent through pop -up window in advance.", "label": ["Important", "Risk", "Usage"], "rewrite": "When we want to use other purposes that the information is not stated in this policy, we will solicit your consent through pop -up window."}
{"task": "rw_45.jsonl", "id": 52427, "text": "5. You fully know that in the following situations, we do not need to obtain your authorization consent using personal information:", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "You fully know that in the following situations, we use personal information to obtain your authorization consent:"}
{"task": "rw_45.jsonl", "id": 52428, "text": "(1) Directly related to national security and national defense security;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Using personal information directly with national security and national defense security, there is no need to solicit consent."}
{"task": "rw_45.jsonl", "id": 52429, "text": "(2) Directly related to public safety, public health, and major public interests;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Personal information is used in the case of public safety, public health, and major public interests, without asking for consent."}
{"task": "rw_45.jsonl", "id": 52430, "text": "(3) Directly related to the execution of criminal investigation, prosecution, trial and judgment;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Use personal information under the situation of directing criminal investigation, prosecution, trial, and judgment."}
{"task": "rw_45.jsonl", "id": 52431, "text": "(4) For the major legitimate rights and interests of the life and property of the main person or other individuals, it is difficult to get my consent;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Personal information is used to maintain major legitimate rights and interests but it is difficult to get personal information in the case of my consent, without asking for consent."}
{"task": "rw_45.jsonl", "id": 52432, "text": "(5) The collected personal information is made to the public by the public;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "The collected personal information is made by the subject of the personal information to the public by themselves without asking for consent."}
{"task": "rw_45.jsonl", "id": 52433, "text": "(6) Your personal information collected from legal news reports and information disclosed by government information disclosure channels;", "label": ["Important", "First Party Collection Information"], "rewrite": "If you collect personal information from legal news reports and information disclosed by government information disclosure channels, you do not need to solicit consent."}
{"task": "rw_45.jsonl", "id": 52434, "text": "(7) Signing the contract according to your requirements;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If you use personal information in the case of signing a contract, you do not need to solicit."}
{"task": "rw_45.jsonl", "id": 52435, "text": "(8) The necessary and stable operation of the products and/or services provided by the faults used to discover and dispose of products and/or services;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If you use personal information to discover and dispose of the product failure, you do not need to solicit consent."}
{"task": "rw_45.jsonl", "id": 52436, "text": "(9) It is necessary for legal news reports;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If you use personal information in the case of legal news reports, you do not need to ask for consent."}
{"task": "rw_45.jsonl", "id": 52437, "text": "(10) Academic research institutions are necessary to carry out statistics or academic research based on public interests, and provide the results of academic research or descriptions, to identify the personal information contained in the result;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If academic research institutions use personal information based on the situation necessary for public interests to carry out statistics or academic research institutes, they do not need to solicit consent."}
{"task": "rw_45.jsonl", "id": 52438, "text": "(11) Other circumstances stipulated in laws and regulations.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If personal information is used in other circumstances stipulated in laws and regulations, no consent is required."}
{"task": "rw_45.jsonl", "id": 52439, "text": "3. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52440, "text": "(1) Cookie", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52441, "text": "To ensure the normal operation of Migu products, we will store small data files, cookies, and small data files, Cookie, and mobile devices.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will store small data files named Cookie on your computer or mobile device."}
{"task": "rw_45.jsonl", "id": 52442, "text": "Cookie usually contains identifiers, site names, and some numbers and characters.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52443, "text": "With Cookie, we can understand your interest preferences and use habits.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52444, "text": "We will not use Cookie for any purpose outside the purpose of this policy.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52445, "text": "You can manage or delete according to your preferences, cookies.", "label": ["Important", "Edit/Control"], "rewrite": "You can manage or delete Cookie according to your preferences."}
{"task": "rw_45.jsonl", "id": 52446, "text": "For details, see aboutcookies.org.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52447, "text": "You can clear all the functions saved on the computer, cookies, and most of the network browsers have the functions of stopping, cookies.", "label": ["Important", "Edit/Control"], "rewrite": "You can clear all the cookies saved on the computer, and most of the network browsers have the function of preventing cookies."}
{"task": "rw_45.jsonl", "id": 52448, "text": "But if you do this, you need to change the user setting in person when you visit our product.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52449, "text": "(2) Website beacon and pixel label", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52450, "text": "In addition to Cookie, we may also use the website's beacon and pixel labels other similar technologies.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52451, "text": "The email we send to you may contain a link to the URL of the content of our website.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52452, "text": "If you click the link, we will track this click to help us understand your product or service preferences and improve customer service.", "label": ["Important", "Risk"], "rewrite": "If you click the link, we will track this click to help us understand your product or service preferences and improve customer service."}
{"task": "rw_45.jsonl", "id": 52453, "text": "Website beacon is usually a transparent image embedded in a website or email.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52454, "text": "With the pixel labels in emails, we can know whether the email has been opened.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52455, "text": "If you don't want your activities to be tracked in this way, you can withdraw from our signal list at any time.", "label": ["Important", "Edit/Control"], "rewrite": "If you don't want your activities to be tracked in this way, you can withdraw from our signal list at any time."}
{"task": "rw_45.jsonl", "id": 52456, "text": "(3) Do Not Track (Do not track)", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52457, "text": "Many network browsers have the Do not track function, which can release the DO Not Track request to the website.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52458, "text": "At present, the major Internet standard organization has not yet established relevant policies to stipulate how websites should respond to such requests.", "label": ["Important", "Risk"], "rewrite": "The main Internet standard organization has not yet established relevant policies to stipulate how websites should respond to such requests."}
{"task": "rw_45.jsonl", "id": 52459, "text": "But if your browser is enabled, do, not, track, then all our websites will respect your choices.", "label": ["Important", "Edit/Control"], "rewrite": "But if your browser enables Do Not Track, all our websites will respect your choices."}
{"task": "rw_45.jsonl", "id": 52460, "text": "4. How do we share, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52461, "text": "(1) Sharing", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52462, "text": "We will not share your personal information with any company, organization and individual other than Migu Company, except the following situations: except:", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52463, "text": "1. Shared with clear consent: After getting your clear consent, we will share your personal information with other parties, and the scope of personal information that shared is limited to the scope of your clear consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After getting your clear consent, we will share your personal information with other parties, and the scope of personal information that shares is limited to the scope of your clear consent."}
{"task": "rw_45.jsonl", "id": 52464, "text": "2. The information after the identification processing is shared with a third party, and the natural person subject that shared third parties cannot re -recognize such information;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The information after the identification processing is shared with a third party, and the natural person subject to sharing third parties cannot recognize such information."}
{"task": "rw_45.jsonl", "id": 52465, "text": "3. We may share your personal information to the outside world in accordance with the provisions of laws and regulations, or in accordance with the mandatory requirements of the government authority.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share your personal information to the outside world in accordance with the provisions of laws and regulations, or in accordance with the mandatory requirements of government authorities."}
{"task": "rw_45.jsonl", "id": 52466, "text": "4. Share with our affiliates: In order to facilitate us to provide services to you, I recommend information that you may be interested in or protect the safety of Migu affiliated company or other users or the public.Related company sharing personal information related to product business functions, including nicknames, avatars, mobile phone numbers, geographical location, page access, content use, social interaction, ordering consumption.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share personal information related to product business functions with our affiliates, including nicknames, avatars, mobile phone numbers, geographical location, page access, content use, social interaction, ordering consumption."}
{"task": "rw_45.jsonl", "id": 52467, "text": "If the related company wants to change the purpose of the above personal information, it will solicit your authorization consent again.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If the related company wants to change the purpose of the above personal information, it will solicit your authorization consent again."}
{"task": "rw_45.jsonl", "id": 52468, "text": "Our affiliated companies include Migu Culture Technology Co., Ltd. now may control, be controlled or controlled by any company, institution, and the legal heirs of the company or institutions under the common control;", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52469, "text": "And Migu Culture Technology Co., Ltd.'s parent company China Mobile Communications Co., Ltd. and any company, institutions and institutions, as well as the above -mentioned companies or institutions.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52470, "text": "Among them, \"control\" refers to the ability to directly or indirectly affect the company's management, whether it is a method that is identified by the ownership, the shares of the voting right, the contract, or the other by the people's court.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52471, "text": "5. Shared with authorized partners: In order to achieve the purpose of this policy, some of our services will be provided by authorized partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to achieve the purpose of this policy, some of our services will be provided by authorized partners."}
{"task": "rw_45.jsonl", "id": 52472, "text": "We may share some of your personal information with our partners to provide better customer service and user experience.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share some of your personal information with our partners to provide better customer service and user experience."}
{"task": "rw_45.jsonl", "id": 52473, "text": "At present, the situation of sharing information with authorized partners may include:", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52474, "text": "To share with business partners in order to achieve specific functions, when software service providers, smart device providers, or system service providers jointly provide services with us, take the service as an example.One feature, we may collect your geographical location information and related equipment information (including but not limited to hardware models, operating system versions, IMEI, MAC), and provide it to the aforementioned partners after de -identification processing.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may collect your geographical location information and related device information (including but not limited to hardware models, operating system versions, IMEI, MAC), and provide the aforementioned partners after de -identification processing."}
{"task": "rw_45.jsonl", "id": 52475, "text": "You can refuse to provide such information and not use the corresponding service, but it will not affect your other services.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You can refuse to provide such information and not use the corresponding service, but it will not affect your other services."}
{"task": "rw_45.jsonl", "id": 52476, "text": "For companies, organizations, and individuals that share information with us, we will sign the corresponding confidentiality agreement with them, asking them to handle personal information in accordance with our instructions, this personal information protection policy, and any other related confidentiality and security measures.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For companies, organizations and individuals who share information with us, we will sign the corresponding confidentiality agreement with them."}
{"task": "rw_45.jsonl", "id": 52477, "text": "(2) Transfer", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52478, "text": "We will not transfer your personal information to any company, organization and individual, except the following situations: except:", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52479, "text": "1. In the case of obtaining clear consent: After getting your clear consent, we will transfer your personal information to other parties;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After getting your clear consent, we will transfer your personal information to other parties."}
{"task": "rw_45.jsonl", "id": 52480, "text": "2. When involving mergers, acquisitions, or bankruptcy liquidation, if you involve personal information transfer, we will ask new companies that hold your personal information and organizations to continue to be subject to this personal information protection policy. Otherwise, we will ask the company,Organization re -solicit authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If it involves the transfer of personal information, we will require new companies and organizations that hold your personal information to continue to be constrained by this personal information protection policy. Otherwise, we will ask the company and the organization to re -soliciting the consent of authorization."}
{"task": "rw_45.jsonl", "id": 52481, "text": "(3) Public disclosure", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52482, "text": "We will only publicly disclose your personal information in the following circumstances:", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52483, "text": "1. After getting your clear consent;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52484, "text": "2. Based on legal disclosure: We may disclose your personal information to the subjects holding compulsory documents under the circumstances of legal, legal procedures, litigation or government authorities.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may disclose your personal information to the subjects holding compulsory documents under the circumstances of legal, legal procedures, litigation or government authorities."}
{"task": "rw_45.jsonl", "id": 52485, "text": "Including name, date of birth, ID number, personal biometric information, address, addressing contact information, communication records and content, account passwords, property information, credit information, trajectory trajectory, trading information.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52486, "text": "5. How do we save and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52487, "text": "(1) Save time limit", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52488, "text": "We will only retain your personal information within the time limit of the cost of reaching the cost policy, unless you extend the retention period or be permitted by law.", "label": ["Data Retention", "Important"], "rewrite": "We will only retain your personal information within the time limit of the cost of reaching the cost policy, unless you extend the retention period or be permitted by law."}
{"task": "rw_45.jsonl", "id": 52489, "text": "If you cancel your account or actively delete the above information, we will retain your existing personal information in accordance with the minimum period stipulated in laws and regulations, and within the shortest storage period required by laws and regulations, we will no longer commercialize your personal information.use.", "label": ["Data Retention", "Important"], "rewrite": "If you cancel your account or actively delete the above information, we will retain your existing personal information in accordance with the minimum period stipulated in laws and regulations, and within the shortest storage period required by laws and regulations, we will no longer commercialize your personal information.use."}
{"task": "rw_45.jsonl", "id": 52490, "text": "When your personal information exceeds the above -mentioned storage period, we will perform anonymous processing.", "label": ["Data Retention", "Important"], "rewrite": "When your personal information exceeds the above -mentioned storage period, we will perform anonymous processing."}
{"task": "rw_45.jsonl", "id": 52491, "text": "(2) Storage area", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52492, "text": "Your personal information is stored in the People's Republic of China;", "label": ["Data Retention", "Important"], "rewrite": "Your personal information is stored in the People's Republic of China."}
{"task": "rw_45.jsonl", "id": 52493, "text": "If we need cross -border transmission, we will obtain your authorization consent alone.", "label": ["Data Retention", "Important"], "rewrite": "If we need cross -border transmission, we will obtain your authorization consent alone."}
{"task": "rw_45.jsonl", "id": 52494, "text": "(3) Safety protection measures.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52495, "text": "1. We will collect, use, store, and transmit user information with the \"minimization\" principle, and inform you the purpose and scope of the relevant information through user agreements and privacy policies.", "label": ["Important", "Data Security"], "rewrite": "We will collect, use, store, and transmit user information with the \"minimization\" principle, and inform you the purpose and scope of the relevant information through user agreements and privacy policies."}
{"task": "rw_45.jsonl", "id": 52496, "text": "We will strictly follow the following \"Decision on Strengthening the Protection of Network Information\", \"Standing Committee of the National People's Congress of the National People's Congress\", \"Regulations for the Protection of Personal Information Protection of Telecom and Internet User\" (Order of the Ministry of Industry and Information Technology No. 24), \"No. 24),\"Regulations on the Registration of True Information Registration of Telephone Users \"(Order No. 25 of the Ministry of Industry and Information Technology No. 25), establish an information security guarantee system, and take technical measures and other necessary measures to protect your personal information security.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52497, "text": "2. Migu Company will use a variety of security technologies and procedures to establish a sound management system to protect your personal information, so as not to be accepted, used or disclosed.", "label": ["Important", "Data Security"], "rewrite": "Migu Company will use various security technologies and procedures to establish a sound management system to protect your personal information, so as not to be accepted, used or disclosed."}
{"task": "rw_45.jsonl", "id": 52498, "text": "Such as: use encryption technology to ensure the confidentiality of data;", "label": ["Data Security"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52499, "text": "Using a trusted protection mechanism to prevent data from being maliciously attacked;", "label": ["Data Security"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52500, "text": "Authorize related access;", "label": ["Data Security"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52501, "text": "Safety protection and testing measures for regular data security inspections;", "label": ["Data Security"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52502, "text": "The training of data security and the training of security capabilities for employees will strengthen employees' awareness of protecting the importance of personal information.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52503, "text": "3. Please understand: The Internet environment is not 100 % security. We will try our best to ensure or guarantee the security of any information you send to us.It is impossible to ensure that the information is 100 % safe.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52504, "text": "4. After the personal information security incident occurs unfortunately, we will inform you in a timely manner in accordance with the requirements of the laws and regulations: the basic situation and possible impact of the security incident, the disposal measures we have taken or we will take, you can take it alone to prevent and reduceSuggestions for risk, remedy measures.", "label": ["Important", "Data Security"], "rewrite": "After unfortunately a personal information security incident, we will tell you in a timely manner in accordance with the requirements of laws and regulations: basic situations and possible impacts, disposal measures, suggestions, remedy measures."}
{"task": "rw_45.jsonl", "id": 52505, "text": "We will timely inform you that the incident -related situation is informing the email, letter, telephone, and push notification. It is difficult to inform the subject of personal information one by one, and we will publish an announcement in a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "We will timely inform you that the incident -related situation is informing the email, letter, telephone, and push notification. It is difficult to inform the subject of personal information one by one, and we will publish an announcement in a reasonable and effective way."}
{"task": "rw_45.jsonl", "id": 52506, "text": "At the same time, we will also actively report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "We will also take the initiative to report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities."}
{"task": "rw_45.jsonl", "id": 52507, "text": "6. Your rights", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52508, "text": "(1) Query and correct your personal information", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52509, "text": "1. If you want to access or edit the personal data information and change your password in the account, you can log in to your personal account at any time and complete the above operations through \"setting\"-\"personal data\"/\"security center\".", "label": ["Important", "Edit/Control"], "rewrite": "You can log in to your personal account at any time and complete the above operations through \"Settings\"-\"Personal Information\"/\"Security Center\"."}
{"task": "rw_45.jsonl", "id": 52510, "text": "2. If you want to query personal browsing records, search records, upload content, order information, you can log in to your personal account at any time and complete the above operations through \"My\".", "label": ["Important", "Edit/Control"], "rewrite": "If you want to query personal browsing records, search records, upload content, order information, you can log in to your personal account at any time and complete the above operations through \"My\"."}
{"task": "rw_45.jsonl", "id": 52511, "text": "3. In the case of your user authentication and correct the objectivity and accuracy of the information, you have the right to make or update the error or incomplete information.", "label": ["Important", "Edit/Control"], "rewrite": "In the case of your user authentication and correction that does not affect the objectivity and accuracy of the information, you have the right to make or update the error or incomplete information."}
{"task": "rw_45.jsonl", "id": 52512, "text": "You can make corrections in Migu products, or make a correction to the application to be submitted to us through feedback or contact customer service.", "label": ["Important", "Edit/Control"], "rewrite": "You can make corrections in Migu products, or make a correction to the application to be submitted to us through feedback or contact customer service."}
{"task": "rw_45.jsonl", "id": 52513, "text": "(2) Delete personal information", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52514, "text": "You can directly remove or delete the information in our products and/or service pages, including browsing information, ordering information, collection information, delete personal information channels and methods, please see the product and service content under this policy.instruction of.", "label": ["Important", "Edit/Control"], "rewrite": "You can directly remove or delete the information in our products and/or service pages, including browsing information, ordering information, collection information, delete personal information channels and methods, please see the product and service content under this policy.instruction of."}
{"task": "rw_45.jsonl", "id": 52515, "text": "In the following circumstances, you can make a request to delete personal information:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52516, "text": "1. If our behavior of handling personal information violates laws and regulations;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52517, "text": "2. If we collect and use your personal information, it has not obtained your consent;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52518, "text": "3. If our behavior of handling personal information violates your agreement;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52519, "text": "4. If you no longer use our products or services, or you cancel your account;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52520, "text": "5. If we no longer provide products or services for you.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52521, "text": "When you delete the information from our services, we may not back up the corresponding information in the system, but will delete these information when the backup is updated.", "label": ["Important", "Edit/Control"], "rewrite": "When you delete the information from our services, we may not back up the corresponding information in the system, but will delete these information when the backup is updated."}
{"task": "rw_45.jsonl", "id": 52522, "text": "(3) Withdrawal consent", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52523, "text": "Each business function requires some basic personal information to complete.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52524, "text": "For the collection and use of additional personal information, you can give or withdraw your authorization consent at any time.", "label": ["Important", "Edit/Control"], "rewrite": "For the collection and use of additional personal information, you can give or withdraw your authorization consent at any time."}
{"task": "rw_45.jsonl", "id": 52525, "text": "1. You can change your privacy settings by deleting information, closing the device function, and changing your privacy settings in Migu or Migu products.The page is presented).", "label": ["Important", "Edit/Control"], "rewrite": "You can change your privacy settings by deleting information, closing the device function, and changing your privacy settings in the Migu website or Migu product."}
{"task": "rw_45.jsonl", "id": 52526, "text": "You can also withdraw all the authorization of our personal information by canceling the account of the account.", "label": ["Important", "Edit/Control"], "rewrite": "You can also withdraw all the authorization of our personal information by canceling the account of the account."}
{"task": "rw_45.jsonl", "id": 52527, "text": "2. When you withdraw or authorize, we cannot continue to provide you with the service corresponding to the withdrawal consent or authorization, and we will no longer handle your corresponding personal information.", "label": ["Important", "Edit/Control"], "rewrite": "After you withdraw or authorize, we cannot continue to provide you with the service corresponding to the withdrawal consent or authorization, and we will no longer deal with your corresponding personal information."}
{"task": "rw_45.jsonl", "id": 52528, "text": "But your decision to withdraw consent or authorization will not affect personal information processing based on your consent or authorization before.", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "The decision you withdraws from consent or authorization will not affect personal information processing based on your consent or authorization."}
{"task": "rw_45.jsonl", "id": 52529, "text": "(4) Logging out the account", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52530, "text": "After you cancel your account, we will stop providing you with products or services and delete your personal information according to your requirements.", "label": ["Important", "Edit/Control"], "rewrite": "After you cancel your account, we will stop providing you with products or services and delete your personal information according to your requirements."}
{"task": "rw_45.jsonl", "id": 52531, "text": "For a specific way to cancel the account, please refer to the \"Migu User Service Agreement\" related guidelines.", "label": ["Important", "Edit/Control"], "rewrite": "For a specific way to cancel the account, please refer to the \"Migu User Service Agreement\" related guidelines."}
{"task": "rw_45.jsonl", "id": 52532, "text": "If you need to cancel your account, you can complete the above operations by \"setting\"-\"security center\"-\"cancellation account\".", "label": ["Important", "Edit/Control"], "rewrite": "If you need to cancel your account, you can complete the above operations by \"setting\"-\"security center\"-\"cancellation account\"."}
{"task": "rw_45.jsonl", "id": 52533, "text": "7. How do we deal with the personal information of minors", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52534, "text": "(1) We attach great importance to the protection of personal information of minors.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52535, "text": "If you are a minor under the age of 14, before using our service, please read the privacy policy carefully and obtain the consent of your guardian in advance.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a minor under the age of 14, before using our service, please read the privacy policy carefully and obtain the consent of your guardian in advance."}
{"task": "rw_45.jsonl", "id": 52536, "text": "We will protect personal information of minors in accordance with the provisions of relevant national laws and regulations.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52537, "text": "Some of our services may require you to provide specific personal sensitive information to achieve specific functions (including functional segments that are specialized in children, or users need to enter birthdays and age information that can recognize users' age or services).", "label": ["Specific Audiences", "First Party Collection Information", "Risk", "Important"], "rewrite": "Some of our services may require you to provide specific personal sensitive information to achieve specific functions."}
{"task": "rw_45.jsonl", "id": 52538, "text": "If you choose not to provide such information, you may not be able to use specific functions in the service normally, but it does not affect other functions in your service.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you choose not to provide such information, you may not be able to use specific functions in the service normally, but it does not affect other functions in your service."}
{"task": "rw_45.jsonl", "id": 52539, "text": "If you take the initiative to provide your personal sensitive information, it means that you agree that we will process your personal sensitive information according to the purpose and method of this policy.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If you take the initiative to provide your personal sensitive information, it means that you agree that we will process your personal sensitive information according to the purpose and method of this policy."}
{"task": "rw_45.jsonl", "id": 52540, "text": "(2) For the consent of the guardian to collect personal information of minors, we will only use or disclose this information if they are allowed to be allowed, the guardian's clear consent or protecting minors.", "label": ["Specific Audiences", "Important"], "rewrite": "For the consent of the guardian to collect personal information of minors, we will only use or disclose this information if they are allowed to be allowed, the guardian clearly consent or protects the necessary minors."}
{"task": "rw_45.jsonl", "id": 52541, "text": "(3) If we find that we collect personal information of minors without obtaining the consent of the guardian in advance, we will try to delete relevant data as soon as possible.", "label": ["Specific Audiences", "Important"], "rewrite": "If we find that we collect personal information of minors without the consent of the guardian that can be confirmed in advance, they will try to delete relevant data as soon as possible."}
{"task": "rw_45.jsonl", "id": 52542, "text": "8. How can your personal information be transferred globally", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52543, "text": "We will be stored in the People's Republic of China in accordance with the personal information collected and generated by the People's Republic of China in accordance with this policy.", "label": ["Data Retention", "Important"], "rewrite": "We will be stored in the People's Republic of China in accordance with the personal information collected and generated by the People's Republic of China in accordance with this policy."}
{"task": "rw_45.jsonl", "id": 52544, "text": "If you need to transfer your personal information abroad, we will get your authorization consent.", "label": ["Data Retention", "Important"], "rewrite": "If you need to transfer your personal information abroad, we will get your authorization consent."}
{"task": "rw_45.jsonl", "id": 52545, "text": "In this case, we will protect your personal information in accordance with this policy.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52546, "text": "Nine, how to update this policy", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52547, "text": "(1) Our personal information protection policy may be changed.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52548, "text": "Without your clear consent, we will not reduce the rights you should enjoy in accordance with this personal information protection policy.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52549, "text": "(2) We will publish any changes to this policy on the website and APP.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52550, "text": "And after the update clause takes effect, when you log in to the website or start the app next time, we will remind you to update the content in a significant pop -up window so that you can understand the latest version of this privacy policy in time, and you confirm whether it will be confirmed whether Agree.", "label": ["Policy Change", "Important"], "rewrite": "After the update clause takes effect, when you log in to the website or start the app next time, we will remind you to update the content in a significant pop -up window so that you can understand the latest version of this privacy policy in time, and you confirm whether you agree with the consent. Essence"}
{"task": "rw_45.jsonl", "id": 52551, "text": "If the updated content requires you to authorize to collect audio and video, obtain address book, contact information, geographical location permissions, you will still solicit your consent again in a significant way.", "label": ["Policy Change", "Permission Acquisition", "Important"], "rewrite": "If the updated content requires you to authorize to collect audio and video, obtain address book, contact information, geographical location permissions, you will still solicit your consent again in a significant way."}
{"task": "rw_45.jsonl", "id": 52552, "text": "(3) If there is no special explanation, the revised privacy policy will take effect from the date of announcement.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52553, "text": "Ten, how to contact us", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52554, "text": "If you have any questions, opinions or suggestions on this personal information protection policy, you can contact us by dialing the customer service phone and login website at any time, and we will actively verify, handle, and answer as soon as possible.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52555, "text": "We have set up personal information protection specialists, and you can get in touch with it in the following ways: service@migu.cn.", "label": ["Important", "Contact Information"], "rewrite": "We have set up personal information protection specialists, and you can get in touch with it in the following ways: service@migu.cn."}
{"task": "rw_45.jsonl", "id": 52556, "text": "We will review the issues involved as soon as possible and reply within fifteen days after verifying your true identity.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52557, "text": "If you are not satisfied with our response, you can also seek solution by filed a lawsuit to a court where the Migu Mimu's Miku company is located.", "label": [], "rewrite": []}
{"task": "rw_45.jsonl", "id": 52558, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
