{"task": "rw_4.jsonl", "id": 37689, "text": "Bilibili Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37690, "text": "Updated: 2022 [8] month [8] Day", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37691, "text": "Effective time: 2022 [8] month [15] Day", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37692, "text": "Version update prompt:", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37693, "text": "Thank you for using Bilibili!", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37694, "text": "This time Bilibili (hereinafter called \"we\") updated some content in accordance with relevant laws and regulations and technical specifications, mainly including: increase account information disclosure description (third part 4.2), adjust the interactive function description (third part 4.7), Increase the function of virtual live facial capture (Part 3 4.10).", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37695, "text": "In order to better protect your personal information, it is recommended that you carefully read the updated \"Bilibili Privacy Policy\", especially the clause with black thickness.", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37696, "text": "If you have any objections or questions about this privacy policy clause, you can communicate with us through the contact information published in Article 10 of the \"Bilibili Privacy Policy\".", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37697, "text": "\"Bilibili Privacy Policy\" catalog", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37698, "text": "I. Introduction", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37699, "text": "2. About us", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37700, "text": "3. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37701, "text": "4. How do we share, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37702, "text": "5. The right to manage personal information", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37703, "text": "6. About the use of cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37704, "text": "7. We store and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37705, "text": "8. Our personal information for the personal information of minors", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37706, "text": "Nine, the protection of the personal information of the dead users", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37707, "text": "10. Contact us", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37708, "text": "11. How to update this policy", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37709, "text": "Twelve, dispute resolution", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37710, "text": "Thirteen, term explanation", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37711, "text": "I. Introduction", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37712, "text": "1. This \"Bilibili Privacy Policy\" (hereinafter referred to as \"this privacy policy\") is suitable for all client applications, official websites, and third -party websites and applications for Bilibili to directly operate or cooperate with third -party operationsThe software development tool package (SDK) and application programming interface (API) used by the program. The terminal devices of the above -mentioned products/services include, but not limited to PC, tablet, mobile phone, TV, set -top box, wearable device, car intake tablet device, intelligent intelligentSpeaker equipment, etc.", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37713, "text": "Special reminder: Because Bilibili has a lot of products/services, the contents of the products and services provided for you are also different. This privacy policy is the general privacy policy terms that Bilibili uniformly applied.", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37714, "text": "In response to some specific products/services of Bilibili, Bilibili will also formulate specific privacy policies. You should use this specific product/service after fully reading and agreeing with all the contents of specific privacy policies.", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37715, "text": "2. Please read and fully understand all the contents of the privacy policy before using Bilibili various products/services.", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37716, "text": "Once you use or continue to use Bilibili's products/services, it means that you agree that we will use and process your relevant information in accordance with this privacy policy.", "label": ["Policy Change", "Important"], "rewrite": "Once you use or continue to use Bilibili's products/services, you agree that we agree that we will use and process your relevant information in accordance with this privacy policy."}
{"task": "rw_4.jsonl", "id": 37717, "text": "3. We may revise the privacy policy in accordance with laws and regulations or business adjustments from time to time.", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37718, "text": "When this privacy policy is changed, we will show you the contents of the change after the version is updated or pushed the notification, message and other forms after the version is updated.", "label": ["Policy Change", "Important"], "rewrite": "When this privacy policy is changed, we will show you the contents of the change after the version is updated or pushed the notification, message and other forms after the version is updated."}
{"task": "rw_4.jsonl", "id": 37719, "text": "4. You need to understand that only after you confirm and agree to the change of the change of the change, we will collect, use, process and store your personal information based on the change of privacy policy after the change;", "label": ["Policy Change", "Important"], "rewrite": "Only after you confirm and agree to the change of \"Bilibili Privacy Policy\", will we collect, use, process, and store your personal information."}
{"task": "rw_4.jsonl", "id": 37720, "text": "You have the right to refuse to agree to the privacy policy after the change, but please know that once you refuse to agree to the change of privacy policy, you may not be able to continue to use Bilibili's related services and functions in fullThe service effect reached.", "label": ["Policy Change", "Important", "Risk"], "rewrite": "Once you refuse to agree to the privacy policy after the change, it may cause you to be unable or not to continue using related services and functions, or to achieve the service effect."}
{"task": "rw_4.jsonl", "id": 37721, "text": "2. About us", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37722, "text": "1. Bilibili refers to Shanghai Kuanyu Digital Technology Co., Ltd. (hereinafter referred to as \"Shanghai Kuan Entertainment\") and its affiliates (hereinafter referred to as \"us\").", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37723, "text": "2. related companies refer to companies and institutions under the control of Shanghai Kuan Entertainment Digital Technology Co., Ltd., under the control of Shanghai Kuanyu Digital Technology Co., Ltd. or under the control of Shanghai Kuanyu Digital Technology Co., Ltd.", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37724, "text": "Control refers to the ability to directly or indirectly affected the controlled management/operation of the controlled objects directly or indirectly through ownership, contract, actual operation association, or other methods identified in accordance with the law.", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37725, "text": "3. The basic information of our main operating entity is as follows: Shanghai Kuanyu Digital Technology Co., Ltd., established on August 12, 2005, the contact number is 021-25099888, and the registered address is Room 801, No. 489, Zhengli Road, Yangpu District, ShanghaiThe commonly used office address is Building 3, Guozheng Center, No. 485, Zhengli Road, Yangpu District, Shanghai.", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37726, "text": "3. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37727, "text": "1. Bilibili collects and uses personal information that you take the initiative to provide or use your personal information in the process of using the service in accordance with laws and regulations and follow the principles of legitimate, legal, and necessary principles.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "Bilibili collects and uses personal information that you actively provide or use your initiative to provide or generate personal information due to product/service needs in accordance with laws and regulations."}
{"task": "rw_4.jsonl", "id": 37728, "text": "If we want to use your personal information for other purposes that have not been stated in this privacy policy, or use the information collected for other purposes based on specific purposes, we will inform you in a reasonable way and before use, and before use, and before use, we willGet your consent again.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If we want to use your personal information for other purposes that have not been stated in this privacy policy, or use the information collected for other purposes based on specific purposes, we will inform you in time and obtain your consent again."}
{"task": "rw_4.jsonl", "id": 37729, "text": "2. The types of personal information we collect and use include two types: first: information necessary for the core business functions of our product/service: This type of information is a must -have information for the normal operation of the product/service. You must authorizeWe collect.", "label": ["Usage"], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37730, "text": "If you refuse to provide it, you will not be able to use our product/service normally;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37731, "text": "The second: additional business functions may need to be collected: This information is the information required for non -core business functions. You can choose whether to authorize us to collect it.", "label": ["Usage"], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37732, "text": "If you refuse to provide it, it will cause additional business functions to be unable to achieve or achieve the effect we intend to achieve, but it will not affect your normal use of core business functions.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37733, "text": "3., you can check our collection and use your personal information through \"Personal Information Collection List\".", "label": ["Important", "First Party Collection Information"], "rewrite": "You can check the collection and use your personal information through the \"Personal Information Collection List\"."}
{"task": "rw_4.jsonl", "id": 37734, "text": "4. Usually, we will collect and use your personal information in the following scene:", "label": ["Important", "First Party Collection Information"], "rewrite": "Under normal circumstances, we will collect and use your personal information in the following scenarios:"}
{"task": "rw_4.jsonl", "id": 37735, "text": "4.1 Account Registration", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37736, "text": "(1) When you register and log in to Bilibili account, you need to complete a series of registration procedures in accordance with our guidance. In the process, you need to provide us with the following information: account nickname, mobile phone number or e -mail (sensitive individualInformation is used to accept the authentication code to match personal identity).", "label": ["Important", "First Party Collection Information"], "rewrite": "When you register and log in to Bilibili account, you need to provide us with account nickname, mobile phone number or email."}
{"task": "rw_4.jsonl", "id": 37737, "text": "Only when you provide the true and accurate above information can you successfully register the Bilibili account and use the core function of the product/service.", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37738, "text": "If you choose not to provide the above necessary information to achieve Bilibili core product function, or it will cause us to be unable to provide you with the core product function.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37739, "text": "(2), our products support you to log in with the account number of the third -party platform (Weibo account/QQ account). If you log in to the account of the third -party platform, we will obtain the third -party account based on your authorizationRelated information (including: user ID, nickname, avatar), and authentication information (sensitive personal information).", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "If you log in with an account on a third -party platform, we will obtain relevant information and authentication information under the third -party account based on your authorization."}
{"task": "rw_4.jsonl", "id": 37740, "text": "We promise that collecting the above information is used to provide you with account login service and ensure your account security and prevent security risks.", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37741, "text": "If you refuse to authorize such information, you will not be able to log in to our platform with an account on a third -party platform, but it will not affect the normal use of other products/services we provide.", "label": ["First Party Collection Information", "Permission Acquisition"], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37742, "text": "(3) At the same time, you need to understand that the matching result of the mobile phone number or email address and verification code belongs to your sensitive personal information. We collect this type of information based on the relevant requirements of laws and regulations.Account and use related product functions, please consider it carefully before selecting whether it is provided.", "label": ["Important", "First Party Collection Information"], "rewrite": "The result of the matching result of the mobile phone number or email address and verification code belongs to your sensitive personal information."}
{"task": "rw_4.jsonl", "id": 37743, "text": "4.2 Account Information Disclosure", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37744, "text": "(1) After you register the Bilibili account, you can fill in your personal information independently to complete your personal information.", "label": ["Important", "First Party Collection Information"], "rewrite": "After you register the Bilibili account, you can fill in gender, birthday, and regional personality signatures."}
{"task": "rw_4.jsonl", "id": 37745, "text": "The personal information of the above account and your praise, the number of attention and the list of attention, the number of fans and the list of fan lists, the public release works, your likes, and the videos of coins will be displayed on the personal homepage of the account.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Account personal information and your praise, the number of attention and the list of attention, the number of fans and the list of fan lists, the works released publicly, the videos you like, coin investment, etc., will be displayed publicly on the personal homepage of the account."}
{"task": "rw_4.jsonl", "id": 37746, "text": "(2) You can also apply for the official certification of Bilibili. After we will review the certification materials you provide, we will complete the occupational certification or other identity you choose for you.", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37747, "text": "Certification signs and certification information will be displayed publicly in your account.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Bilibili official certification logo and certification information will be publicly displayed in your account."}
{"task": "rw_4.jsonl", "id": 37748, "text": "(3) When we publish announcements such as illegal punishment, event awards, and recommendation of popularity, we will publish information such as avatars and nicknames of relevant accounts.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When we publish announcements such as illegal punishment, prize in the event, and recommendation of hot recommendations, we will publish information such as avatars and nicknames of relevant accounts."}
{"task": "rw_4.jsonl", "id": 37749, "text": "(4) In order to maintain the real and orderly community atmosphere and further strengthen the platform content ecological governance, we will display the Internet agreement (IP) address of the account (IP) address of the account information on your account information page to the province (autonomous region, municipality), Overseas display to the country (region).", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will display the Internet protocol address of the account on your account information page to the land information."}
{"task": "rw_4.jsonl", "id": 37750, "text": "The information of the IP address belonging is based on the information provided by the network operator, and the relevant display does not support manual opening or closing.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The information of the IP address belonging is based on the information provided by the network operator, and the relevant display does not support manual opening or closing."}
{"task": "rw_4.jsonl", "id": 37751, "text": "4.3 Real -name authentication", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37752, "text": "(1) Some products or services provided by Bilibili (live broadcast, withdrawal) need to complete the real-name certification in accordance with relevant laws and regulations and our guidelines.Serve.", "label": ["Important", "Edit/Control"], "rewrite": "Some products or services need you to complete the real-name authentication. You can also use the real-name authentication service through the [Personal Center-Real-name Certification] page."}
{"task": "rw_4.jsonl", "id": 37753, "text": "We provide the following three real -name authentication channels. Some scenes temporarily only support some real -name authentication channels. For details, please refer to the real -name authentication page display.", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37754, "text": "a), you can choose the face recognition method to complete the real -name authentication process. In order to complete the real -name authentication service, we will obtain your personal identity information and personal biological identification information according to relevant laws and regulations, including the following: name, ID number (sensitive individual individual individualInformation), facial recognition features (sensitive personal information).", "label": ["Important", "First Party Collection Information"], "rewrite": "You can choose a face recognition method to complete the real -name authentication process, and we will obtain your personal identity information and personal biometric information."}
{"task": "rw_4.jsonl", "id": 37755, "text": "In order to accurately verify your identity, we need to transmit the above information to Beijing Kuangxin Technology Co., Ltd. (hereinafter referred to as \"Kuangxin\"), and the above information will be provided to a third -party institution with your personal information (the relevant governmentDepartment) Perform a comparison test.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to accurately verify your identity, we need to transmit information to Beijing Kuangxin Technology Co., Ltd., and it will be provided to the rights agencies for comparison and verification."}
{"task": "rw_4.jsonl", "id": 37756, "text": "We promise you that the above information is only for the purpose of real -name authentication. After completing the identity test, we will immediately be deleted by itself;", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "We promise you that personal identity information and personal biometric information are only used for the purpose of real -name authentication. After completing the authentication, we will immediately delete it and ask for deletion."}
{"task": "rw_4.jsonl", "id": 37757, "text": "However, in order to fulfill the obligation of storage registration information, we will store your name (sensitive personal information) and ID number (sensitive personal information).", "label": ["Data Retention", "Important"], "rewrite": "In order to fulfill the obligation of storage registration information, we will store your name and ID number."}
{"task": "rw_4.jsonl", "id": 37758, "text": "You understand and confirm that we will ensure your personal information security with the greatest efforts, and strictly require the confidentiality of your personal information. You can only learn and use with real -name authentication, and we must not leak or do any other use of the party.", "label": ["Important", "Data Security"], "rewrite": "We will strictly ask for confidentiality of your personal information, and only learn and use with real -name certification."}
{"task": "rw_4.jsonl", "id": 37759, "text": "b) You can choose to use Alipay's real -name authentication procedures.", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37760, "text": "In order to complete the real -name authentication service, Alipay will obtain your personal identity information and personal biometric information according to relevant laws and regulations, including the following: name, ID number (sensitive personal information), facial recognition features (sensitive personal information).", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to complete the real -name authentication service, Alipay will obtain your personal identity information and personal biometric information in accordance with relevant laws and regulations."}
{"task": "rw_4.jsonl", "id": 37761, "text": "In order to accurately verify your identity, Alipay needs to compare the above information with the legal information of your legal information.", "label": ["Important", "Data Security"], "rewrite": "In order to accurately verify your identity, Alipay needs to compare and verify your information with your legal information."}
{"task": "rw_4.jsonl", "id": 37762, "text": "We promise you that the above information is only used for the purpose of real -name authentication. After completing the identity test, it will be immediately deleted by Alipay;", "label": ["Important", "Data Security"], "rewrite": "Personal information and personal biometric information are only used for real -name authentication. After completing the identity verification, it will be immediately required to delete Alipay."}
{"task": "rw_4.jsonl", "id": 37763, "text": "However, in order to fulfill the obligation of storage registration information, we will store your name (sensitive personal information) and ID number (sensitive personal information).", "label": ["Data Retention", "Important"], "rewrite": "In order to fulfill the obligation of storage registration information, we will store your name and ID number."}
{"task": "rw_4.jsonl", "id": 37764, "text": "We promise you that we will ensure your personal information security with the greatest efforts and strictly ask Alipay to keep your personal information confidential. You can only learn and use with real -name authentication, and we must not leak or do any other uses.", "label": ["Data Retention", "Important"], "rewrite": "We will strictly require Alipay to keep your personal information confidential, and only learn and use with real -name authentication."}
{"task": "rw_4.jsonl", "id": 37765, "text": "c), you can choose to complete the real -name authentication procedure for manual certification. In order to complete the real -name authentication service, we will obtain and store your personal identity information according to relevant laws and regulations, including: name (sensitive personal information), identity card type (including the typeHowever, it is not limited to the corresponding ID card, officer certificate, passport, Taiwan residents traveling and going to the mainland, Hong Kong and Macao residents to travel to the Mainland, etc.), and the corresponding picture of the front and back of the corresponding document (sensitive personal information), the photos of your corresponding ID (sensitive personal informationTo.", "label": ["Data Retention", "Important", "First Party Collection Information"], "rewrite": "In order to complete the authentication service of the real -name manual certification method, we will obtain and store your name, identity document type and corresponding documents on the front and back pictures of the corresponding identity documents based on relevant laws and regulations."}
{"task": "rw_4.jsonl", "id": 37766, "text": "In order to accurately verify your identity, we need to transmit the name and ID number you uploaded to Shanghai Junji Digital Technology Co., Ltd. (hereinafter referred to as \"Junye\").The third -party institution (relevant government departments) conducts comparison tests.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to accurately verify your identity, we need to transmit the name and ID number you uploaded to Shanghai Junji Digital Technology Co., Ltd., and Jun Yan provided a comparison verification to legal institutions."}
{"task": "rw_4.jsonl", "id": 37767, "text": "We promise you that the above information is only used for the purpose of real -name authentication. After completing the identity test, Jun Yi will immediately ask Jun to delete it.", "label": ["Important", "Data Security"], "rewrite": "After completing the authentication, Jun Yan will be immediately asked to delete it."}
{"task": "rw_4.jsonl", "id": 37768, "text": "You understand and confirm that we will ensure your personal information security with the greatest efforts, and strictly ask Jun to keep your personal information confidential. You can only learn and use with the purpose of real -name authentication, and we must not leak or do any other use of the party.", "label": ["Important", "Data Security"], "rewrite": "We will strictly ask Junye to keep your personal information confidential and only learn and use with real -name authentication."}
{"task": "rw_4.jsonl", "id": 37769, "text": "(2) If you need to change your real -name authentication information for reasons, immigration, etc., you can contact artificial customer service to complete the real -name authentication unbinding process.", "label": ["Important", "Edit/Control"], "rewrite": "If you need to change the real -name authentication information for reasons such as changing names, immigration, you can contact artificial customer service to complete."}
{"task": "rw_4.jsonl", "id": 37770, "text": "In order to complete the real -name authentication unbinding process, we need to provide you with a new ID photo (sensitive personal information) or the positive and negative photos (sensitive personal information) of the overseas new documents in order to verify your identity information to complete your unbinding process.Essence", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to complete the real -name authentication unbinding process, we need to provide you with a new ID photo of the ID card or the front and back photos of the overseas new documents."}
{"task": "rw_4.jsonl", "id": 37771, "text": "You understand and confirm that we will ensure your personal information security with the greatest efforts, and only learn and use only the purpose of unbinding real -name certification, and we must not leak or do any other use of the other party.", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37772, "text": "(3) At the same time, you need to understand that the name, ID number, facial recognition characteristics, and photos you hold your ID belong to your personal sensitive information. We collect this type of information based on the requirements of the real -name authentication procedure. If you refuse to provide possible provisionAs a result, you cannot log in to your account and use related product functions, please consider it carefully before selecting whether it is provided.", "label": ["Important", "First Party Collection Information"], "rewrite": "We collect names, ID numbers, facial recognition features, and your photo with your ID is based on real -name authentication requirements."}
{"task": "rw_4.jsonl", "id": 37773, "text": "4.4 Search", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37774, "text": "When you use the search function in our products, we need to collect some of your information, including the following personal information: your equipment information, your log information, including the words or words you searched, your browsing records and timeThe time and number of you search.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the search function in our products, we need to collect your equipment information and log information."}
{"task": "rw_4.jsonl", "id": 37775, "text": "We collect this information to quickly match the content you need and what you may be interested in, but also to improve our product/service.", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37776, "text": "4.5 Video display and playback", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37777, "text": "(1), our products/services provide you with video display and playback services. In the process, we need to collect (including collected in the background state).Browser types and settings, language settings, operating systems and application versions, login IP address, method of accessing networks, network quality data, mobile network information, product version number, network log information (operation log, service log).", "label": ["Important", "First Party Collection Information"], "rewrite": "In the process of providing you with video display and playback services, we need to collect your equipment information, network information, and log information."}
{"task": "rw_4.jsonl", "id": 37778, "text": "We collect this information to provide you with video display and playback services. If you refuse to provide the above permissions, it may cause you to be unable to use our related products and services.", "label": ["Important", "Usage"], "rewrite": "We need to collect your equipment information, network information, and log information to provide you with video display and playback services."}
{"task": "rw_4.jsonl", "id": 37779, "text": "Please understand that separate devices and log information are information that cannot recognize specific natural person status.", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37780, "text": "If we use this type of non -personal information with other information to identify a specific natural person or use it with personal information, during the combination of use, such non -personal information will be regarded as personal information, except for obtaining your authorization.Or in addition to other provisions of laws and regulations, we will anonymous and de -identification processing of this type of personal information.", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37781, "text": "(2) When you log in to our products with Android devices and use video display and playback, you can open/cancel the mobile network information permissions by using the relevant function settings of our product/service.", "label": ["Edit/Control", "Important"], "rewrite": "When you log in with Android devices, you can set up/cancel the mobile network information authority by using the relevant function settings of our product/service."}
{"task": "rw_4.jsonl", "id": 37782, "text": "Android Duan Bilibili App mobile network information access permission setting path is: \"My-Settings-Privacy Permanent Settings-Allow Bilibili to view phone information\".", "label": ["Important", "Edit/Control"], "rewrite": "Android Duan Bilibili App mobile network information access permission setting path is: \"My-Settings-Privacy Permanent Settings-Allow Bilibili to view phone information\"."}
{"task": "rw_4.jsonl", "id": 37783, "text": "If you turn on this permission, you deepen that you authorize us to access, obtain, collect, and use your personal information;", "label": ["Permission Acquisition", "Important", "Edit/Control"], "rewrite": "If you turn on mobile network information access rights, you are deemed that you can authorize us to access, obtain, collect, and use your personal information."}
{"task": "rw_4.jsonl", "id": 37784, "text": "But when you cancel the authorization, we will no longer collect this information, nor can it provide you with the above -mentioned services;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37785, "text": "But unless you delete your personal information in accordance with the law, your cancellation behavior will not affect the processing and storage of our personal information based on your previous authorization.", "label": ["Permission Acquisition", "Edit/Control", "Risk", "Important"], "rewrite": "Your cancellation authorization will not affect the processing and storage of your personal information based on your previous authorization."}
{"task": "rw_4.jsonl", "id": 37786, "text": "After you update the APP version, without your clear consent, we will not change the authority you set before.", "label": ["Important", "Edit/Control"], "rewrite": "After you update the APP version, without your clear consent, we will not change the authority you set before."}
{"task": "rw_4.jsonl", "id": 37787, "text": "(3) Please understand that you can only use the above information to use the core function of Bilibili product/service. If you choose not to provide the above necessary information to achieve the core product function of Bilibili orProvide you with this core product function.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37788, "text": "4.6 Customer service", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37789, "text": "When you initiate a complaint, appeal or consultation with Bilibili, for your account and system security, we may need you to provide account information first and match your previous personal information to verify your user identity.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you initiate a complaint, appeal, or consult, we may need you to provide account information first and match your previous personal information to verify your user identity."}
{"task": "rw_4.jsonl", "id": 37790, "text": "At the same time, in order to contact you or help you solve the problem, we may also need you to provide the following sensitive personal information: name, mobile phone number, email and other contact information, city/regional information.", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to facilitate contact with you or help you solve the problem, we may also need you to provide the following sensitive personal information: name, mobile phone number, email and other contact information, city/regional information."}
{"task": "rw_4.jsonl", "id": 37791, "text": "When you need to reset the password of the youth mode, we also need to upload your hand -held ID photo information to artificial appeal.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you need to reset the password of the youth mode, we need to upload your hand -held photo information to artificial appeal."}
{"task": "rw_4.jsonl", "id": 37792, "text": "In addition, we will collect your communication information (including text/picture/audio and video/call records), and other necessary information associated with your needs.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect your communication information with us and other necessary information related to your needs."}
{"task": "rw_4.jsonl", "id": 37793, "text": "We collect this information to investigate the facts and help you solve the problem. If you refuse to provide the above information, we may not be able to feed you a timely feedback to complain, appeal or consult the results.", "label": ["Important", "First Party Collection Information"], "rewrite": "We collect this information to investigate the facts and help you solve the problem."}
{"task": "rw_4.jsonl", "id": 37794, "text": "4.7 Interactive function", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37795, "text": "When you use comments, barrage, sharing, posts (including submission, dynamics, notes, and albums), we will collect the above -mentioned graphic and video content information that you actively provide, read, share or be sharedWhen the short -chain, sharing code, etc. perform automatic jump and password jump, sharing and other functions/services, your clipboard function will be called.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the interactive function, we will call your clipboard function to collect the graphic and video content information you actively provide, and read the short chain and sharing code that shared or shared."}
{"task": "rw_4.jsonl", "id": 37796, "text": "At the same time, we will also access your mobile phone album authority after you have shared videos and pictures.", "label": ["Permission Acquisition", "Important"], "rewrite": "We will access your mobile phone album permissions after you have shared videos and pictures."}
{"task": "rw_4.jsonl", "id": 37797, "text": "At the same time, you can also open/cancel the permissions through your device system or the related feature settings of our product/service.", "label": ["Edit/Control", "Important"], "rewrite": "You can open/cancel the permissions through your device system or using our product/service related feature settings."}
{"task": "rw_4.jsonl", "id": 37798, "text": "Bilibili APP's album permissions setting path is: \"My-Settings-Privacy Permanent Settings-Allow Bilibili to access the album permissions\".", "label": ["Important", "Edit/Control"], "rewrite": "The path setting path of the album is: \"My-Settings-Privacy Permanent Settings-Allow Bilibili to access the album permissions\"."}
{"task": "rw_4.jsonl", "id": 37799, "text": "If you turn on this permission, you deepen that you authorize us to access, obtain, collect, and use your personal information;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "The entry authority is deemed that you authorize us to access, obtain, collect, and use your personal information."}
{"task": "rw_4.jsonl", "id": 37800, "text": "When you cancel the authorization, we will no longer collect the information, and we will no longer provide you with the above -mentioned services;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37801, "text": "But unless you delete your personal information in accordance with the law, your cancellation behavior will not affect our personal information based on your previous authorization.", "label": ["Permission Acquisition", "Edit/Control", "Risk", "Important"], "rewrite": "Your cancellation authorization will not affect our personal information based on your previous authorization."}
{"task": "rw_4.jsonl", "id": 37802, "text": "After you update the APP version, without your clear consent, we will not change the authority you set before.", "label": ["Important", "Edit/Control"], "rewrite": "After you update the APP version, without your clear consent, we will not change the authority you set before."}
{"task": "rw_4.jsonl", "id": 37803, "text": "4.8 Scan QR code, take photos (including shooting video services, live broadcast services)", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37804, "text": "When you use the device camera to scan the QR code, take photos, and shoot videos (including live broadcast), we will access your device camera -related permissions and collect the scanning QR code, shooting photos, shooting videos you provided to us.Uploaded pictures, video information.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "When you use the device camera to scan the QR code, take photos, and shoot videos, we will access your device camera related permissions and collect pictures and video information you uploaded to us."}
{"task": "rw_4.jsonl", "id": 37805, "text": "If you refuse to provide this permissions and content, it will only make you unable to use this function, but it does not affect other functions of your normal use of the product/service.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37806, "text": "At the same time, you can also open/cancel the permissions through your device system or the related feature settings of our product/service.", "label": ["Edit/Control", "Important"], "rewrite": "You can open/cancel the permissions through your device system or using our product/service related feature settings."}
{"task": "rw_4.jsonl", "id": 37807, "text": "The camera permission setting path of Bilibili App is: \"My - Settings -Privacy Permanent Settings -Allow Bilibili to access the camera\".", "label": ["Important", "Edit/Control"], "rewrite": "The camera authority setting path is: \"My - Settings -Privacy Permanent Settings -Allow Bilibili to access the camera.\""}
{"task": "rw_4.jsonl", "id": 37808, "text": "If you turn on this permission, you deepen that you authorize us to access, obtain, collect, and use your personal information;", "label": ["Edit/Control", "Important"], "rewrite": "If you turn on the camera permissions, you deepen that you authorize us to access, obtain, collect, and use your personal information."}
{"task": "rw_4.jsonl", "id": 37809, "text": "When you cancel the authorization, we will no longer collect the information, and we will no longer provide you with the above -mentioned services;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37810, "text": "But unless you delete your personal information in accordance with the law, your cancellation behavior will not affect the processing and storage of our personal information based on your previous authorization.", "label": ["Permission Acquisition", "Edit/Control", "Risk", "Important"], "rewrite": "Your cancellation authorization will not affect the processing and storage of your personal information based on your previous authorization."}
{"task": "rw_4.jsonl", "id": 37811, "text": "After you update the APP version, without your clear consent, we will not change the authority you set before.", "label": ["Important", "Edit/Control"], "rewrite": "After you update the APP version, without your clear consent, we will not change the authority you set before."}
{"task": "rw_4.jsonl", "id": 37812, "text": "4.9 Recording video, live broadcast, real -time voice", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37813, "text": "(1) When you use recording videos, live broadcasts, or real -time voice (including real -time game voice voice voice) service), we will obtain access to your device recording (microphone) related permissions. We need to collect your voice information, voice interaction information(personal information).", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "When you use recording videos, live or real -time voice services, we will get access your device recording to collect your voice information and voice interaction information."}
{"task": "rw_4.jsonl", "id": 37814, "text": "If you refuse to provide it, it will only make you unable to use this function, but it does not affect other functions of your normal use of products/services.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37815, "text": "At the same time, you can also open/cancel the permissions through your device system or the related feature settings of our product/service.", "label": ["Edit/Control", "Important"], "rewrite": "You can open/cancel the permissions through your device system or using our product/service related feature settings."}
{"task": "rw_4.jsonl", "id": 37816, "text": "The microphone right setting path of Bilibili App is: \"My - Settings -Privacy Permission Settings -Allow Bilibili to access microphone permissions\".", "label": ["Important", "Edit/Control"], "rewrite": "The microphone right setting path is: \"My - Settings -Privacy Permanent Settings -Allow Bilibili to access microphone rights.\""}
{"task": "rw_4.jsonl", "id": 37817, "text": "After you update the APP version, without your clear consent, we will not change the authority you set before.", "label": ["Important", "Edit/Control"], "rewrite": "After you update the APP version, without your clear consent, we will not change the authority you set before."}
{"task": "rw_4.jsonl", "id": 37818, "text": "(2) When you use a live background music service, we will obtain the relevant permissions of your device storage file, and we need to read the audio file (personal information) you store.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use the service of inserting live background music, we will obtain the relevant permission to access your device storage files and read your stored audio files."}
{"task": "rw_4.jsonl", "id": 37819, "text": "If you refuse to provide it, it will only make you unable to use this function, but it does not affect other functions of your normal use of products/services.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37820, "text": "At the same time, you can also open/cancel the permissions through your device system or the related feature settings of our product/service.", "label": ["Edit/Control", "Important"], "rewrite": "You can also open/cancel the permissions through your device system or using the relevant feature settings of our product/service at any time."}
{"task": "rw_4.jsonl", "id": 37821, "text": "The storage authority setting path of Android Bilibili App is: \"My - Settings -Privacy Permissions Settings -Allow Bilibili to use file storage and access functions.\"", "label": ["Important", "Edit/Control"], "rewrite": "The storage permissions setting path is: \"My - Settings -Privacy Permanent Settings -Allow Bilibili to use file storage and access functions.\""}
{"task": "rw_4.jsonl", "id": 37822, "text": "The storage authority (media library) setting path of Bilibili APP is: \"My - Settings -Privacy Permanent Settings -Allow Bilibili to access the media library\".", "label": ["Important", "Edit/Control"], "rewrite": "The storage permissions (media library) setting path is: \"My - Settings -Privacy Permanent Settings -Allow Bilibili to access the media library\"."}
{"task": "rw_4.jsonl", "id": 37823, "text": "If you turn on the above permissions, it deemed that you can authorize us to access, obtain, collect, and use your personal information;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "If you turn on the storage permissions, you are deemed to authorize us to access, obtain, collect, and use your personal information."}
{"task": "rw_4.jsonl", "id": 37824, "text": "After you cancel the authorization, we will no longer collect this information, and we can no longer provide you with the above -mentioned services;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37825, "text": "But unless you delete your personal information in accordance with the law, your cancellation behavior will not affect the processing and storage of our personal information based on your previous authorization.", "label": ["Permission Acquisition", "Edit/Control", "Risk", "Important"], "rewrite": "Your cancellation will not affect the processing and storage of your personal information based on your previous authorization."}
{"task": "rw_4.jsonl", "id": 37826, "text": "After you update the APP version, without your clear consent, we will not change the authority you set before.", "label": ["Important", "Edit/Control"], "rewrite": "After you update the APP version, without your clear consent, we will not change the authority you set before."}
{"task": "rw_4.jsonl", "id": 37827, "text": "4.10 Virtual live broadcast facial capture function", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37828, "text": "(1) When you use the virtual live facial capture function, in order to achieve better face image processing and imitation of human face emoticons, third -party virtual live facial capture suppliers will use the Bilibili client interfaceLive video data, obtain your facial features (sensitive personal information, including: skin and facial features) and optimize the operation according to different facial types.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use a virtual live facial capture function, third -party virtual live facial capture suppliers will use live video data in the interface to obtain your facial features."}
{"task": "rw_4.jsonl", "id": 37829, "text": "After completing the optimization of the virtual image, Bilibili and third -party suppliers will delete the aforementioned data (Bilibili only temporarily cached the data) obtained.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "After completing the optimization of virtual image, Bilibili and third -party suppliers will delete the facial feature data obtained."}
{"task": "rw_4.jsonl", "id": 37830, "text": "(2) We promise you that we will ensure your personal information security with the greatest efforts, strictly require third -party service providers to keep your personal information confidential, and we must not leak or do any other use of the party.", "label": ["Important", "Data Security"], "rewrite": "We will ask third -party service providers to keep your personal information confidential, and shall not leak or do any other purpose of unrelated party."}
{"task": "rw_4.jsonl", "id": 37831, "text": "At the same time, you can also open the permission through the \"virtual\" mode of the pre -broadcast page at any time, and turn off the permissions after cutting out the \"virtual\" mode.", "label": ["Edit/Control", "Important"], "rewrite": "You can open this permissions by clicking the \"virtual\" mode of the pre -broadcast page at any time, and turn off the permissions after cutting out the \"virtual\" mode."}
{"task": "rw_4.jsonl", "id": 37832, "text": "(3) The above permissions are deemed to be authorized by you can access, obtain, collect, and use your personal information;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37833, "text": "After you cancel the authorization, we will no longer collect this information, and we can no longer provide you with the above -mentioned services;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37834, "text": "But unless you delete your personal information in accordance with the law, your cancellation behavior will not affect the processing and storage of your personal information based on your previous authorization.", "label": ["Permission Acquisition", "Edit/Control", "Risk", "Important"], "rewrite": "Your cancellation will not affect the processing and storage of your personal information based on your previous authorization."}
{"task": "rw_4.jsonl", "id": 37835, "text": "After you update the APP version, without your clear consent, we will not change the authority you set before.", "label": ["Important", "Edit/Control"], "rewrite": "After you update the APP version, without your clear consent, we will not change the authority you set before."}
{"task": "rw_4.jsonl", "id": 37836, "text": "4.11 Appointment, product online reminder reminder", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37837, "text": "When you use the appointment (such as chasing Fan), the product is online (such as ticket booking, and the hand -made reservation) reminder function, we will visit your device calendar -related permissions, and we need to collect your calendar information (personal information).", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the appointment and the online reminder function, we will visit your device calendar related permissions to collect your calendar information."}
{"task": "rw_4.jsonl", "id": 37838, "text": "If you refuse to provide it, it will only make you unable to use this function, but it does not affect other functions of your normal use of products/services.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37839, "text": "At the same time, you can also open/cancel the permissions through your device system or the related feature settings of our product/service.", "label": ["Important", "Edit/Control"], "rewrite": "You can open/cancel the calendar authority through your device system or use our product/service related feature settings."}
{"task": "rw_4.jsonl", "id": 37840, "text": "Bilibili APP's calendar permissions setting path is: my-setting-privacy permissions settings-Allow Bilibili to access the calendar \".", "label": ["Important", "Edit/Control"], "rewrite": "Calendar authority setting path is: my-setting-privacy permissions settings-Allow Bilibili to access the calendar \"."}
{"task": "rw_4.jsonl", "id": 37841, "text": "If you turn on the above permissions, it deemed that you can authorize us to access, obtain, collect, and use your personal information;", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "If you open your calendar permissions, you deepen that you authorize us to access, obtain, collect, and use your personal information."}
{"task": "rw_4.jsonl", "id": 37842, "text": "After you cancel the authorization, we will no longer collect this information, and we can no longer provide you with the above -mentioned services;", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "After you cancel the authorization, we will no longer collect the information, and we will no longer provide you with the above -mentioned services."}
{"task": "rw_4.jsonl", "id": 37843, "text": "But unless you delete your personal information in accordance with the law, your cancellation behavior will not affect the processing and storage of our personal information based on your previous authorization.", "label": ["Permission Acquisition", "Edit/Control", "Risk", "Important"], "rewrite": "Your cancellation will not affect the processing and storage of your personal information based on your previous authorization."}
{"task": "rw_4.jsonl", "id": 37844, "text": "After you update the APP version, without your clear consent, we will not change the authority you set before.", "label": ["Important", "Edit/Control"], "rewrite": "After you update the APP version, without your clear consent, we will not change the authority you set before."}
{"task": "rw_4.jsonl", "id": 37845, "text": "4.12 Commodity transaction", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37846, "text": "(1) When you buy goods (such as buying hand -made in membership) in our products/services, you need to provide some information related to completing the transaction, including the following: the product or service information of the transaction, The consignee information (the name of the consignee, the receipt address and its contact number) (sensitive personal information).", "label": ["Important", "First Party Collection Information"], "rewrite": "When you buy goods or services in our products/services, you need to provide some information related to completing the transaction."}
{"task": "rw_4.jsonl", "id": 37847, "text": "In addition, we may also collect some other information related to orders, including: transaction amount, order time, order number, order status, payment method, payment of water number, payment status, we collect this information to help you go smoothly smoothlyComplete transactions, ensure your transaction security, query order information, and provide customer service.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may also collect some other information related to orders to help you successfully complete the transaction, ensure your transaction security, query order information, and provide customer service."}
{"task": "rw_4.jsonl", "id": 37848, "text": "Furthermore, if your transaction is a cross -border product purchase transaction, according to relevant laws and regulations, we also need to collect your personal identity information, including the front and back photos (sensitive personal information) of the ID number and ID card.", "label": ["Important", "First Party Collection Information"], "rewrite": "If your transaction is purchased by cross -border goods, we also need to collect your personal identity information, including the front and back photos of ID card numbers and ID cards."}
{"task": "rw_4.jsonl", "id": 37849, "text": "(2) When you successfully place an order, such as the third -party seller provided by a third -party seller or the product needs a third -party distribution, we will complete the delivery and distribution of goods to you in order to smoothly, safe and accurately complete the goods.It will inevitably know your related distribution information (personal information) within the delivery and distribution session.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "When you successfully place an order, such as the third -party distribution provided by the third -party seller of the product department, the third party will know your related distribution information."}
{"task": "rw_4.jsonl", "id": 37850, "text": "We promise you that we will ensure your personal information security with the greatest efforts, strictly require merchants and third -party distribution companies to keep your personal information confidential, and only learn and use only for distribution. We must not leak or do any other use.", "label": ["Important", "Data Security"], "rewrite": "We will strictly require merchants and third -party distribution companies to keep your personal information confidential and only learn and use only for the purpose of distribution."}
{"task": "rw_4.jsonl", "id": 37851, "text": "4.13 Electronic contract", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37852, "text": "(1), before you use some of our products/services, you need to complete the electronic contracting system through the online electronic contract system. When using the online electronic signing system, according to relevant laws and regulations, we need to collect your personal identity information, personal biological identification information, andPersonal property information, including as follows: electronic contract text, signing party information (signed Fang's name, address, and its contact number) (sensitive personal information), the identity card number (sensitive personal information) of the signing party, facial recognition features (sensitive personal information), Bank account (personal information).", "label": ["Important", "First Party Collection Information"], "rewrite": "You need to complete the electronic contract through the online electronic contract system before using some of our products/services. We need to collect your personal identity information, personal biometric information, and personal property information."}
{"task": "rw_4.jsonl", "id": 37853, "text": "In addition, we may also collect some other information related to electronic contracts, including: contract amount, contract period, contract time, contract number, contract status, payment method, payment of flowing water number, payment status, we collect this information to be used for this information to be used for the purposeHelp you successfully complete the electronic contract, ensure your contract security, query contract information, and provide contract management services.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may collect some other information related to electronic contracts to help you successfully complete the electronic contract, ensure your contract security, inquire about contract information, and provide contract management services."}
{"task": "rw_4.jsonl", "id": 37854, "text": "(2) When you use the online electronic contract system, in order to complete the real -name authentication service, we will provide your personal identity information and personal biological identification to the online electronic contract system supplier according to the relevant laws and regulations, and on the need for different authentication methods.Information and personal property information, including as follows: signeder information (signed Fang's name, contact number) (sensitive personal information), the identity card number (sensitive personal information) of the signing party, the characteristics of facial recognition (sensitive personal information), the bank account (personal information);", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "When you use an online electronic contract system, we will provide your personal identity information, personal biometric information, and personal property information to the online electronic contract system supplier."}
{"task": "rw_4.jsonl", "id": 37855, "text": "In order to accurately verify your identity, the supplier of the online electronic contract system must provide the above information to a third -party institution (relevant government departments, telecommunications operators, China UnionPay, and Alipay) with your personal information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "In order to accurately verify your identity, the supplier of the online electronic contract system needs to provide personal information to a third -party institution with your personal information for a comparison test."}
{"task": "rw_4.jsonl", "id": 37856, "text": "We promise you that we will ensure your personal information security with the greatest efforts, and strictly require the supplier of the online electronic contract system supplier to keep your personal information confidential. Only the purpose of real -name authentication can be learned and used.Any use.", "label": ["Important", "Data Security"], "rewrite": "We will strictly require the supplier of the online electronic contract system to keep your personal information confidential and only learn and use with real -name authentication."}
{"task": "rw_4.jsonl", "id": 37857, "text": "4.14 Payment", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37858, "text": "You need to use the payment function when you open a large member service, ordering goods/services, and buying B coins/batteries on Bilibili, you need to use the payment function.", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37859, "text": "During the payment process, we may collect the user of your third -party payment channel, ID (such as Alipay User, ID, WeChat Open, ID, QQ Wallet Open, ID card information) (sensitive personal information).", "label": ["Important", "First Party Collection Information"], "rewrite": "During the payment process, we may collect the User ID of your third -party payment channel."}
{"task": "rw_4.jsonl", "id": 37860, "text": "The above information provides you with information necessary for you to buy goods and/or services. We cannot obtain your personal property information based on this information, nor can we recognize specific natural person identity information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37861, "text": "4.15 Direct recommendation, maintenance/improvement of our product/service must", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37862, "text": "(1), we will analyze your preferences, habits, and location based on the collected information and user portraits in order to provide you with more suitable customized services, such as showing or recommended to youThe search results, video content, offline activities, information flow or advertising/promotion information results of the search results.", "label": ["Important", "Usage"], "rewrite": "Based on the collection of information, we will analyze your preferences, habits, and location, and user portraits in order to provide you with more suitable customized services."}
{"task": "rw_4.jsonl", "id": 37863, "text": "To this end, we need to collect your information (including collecting in the background state), including your device information (such as hardware models, device MAC addresses, IMEI, IDFA, IMSI, necessary software lists), browser model, log information, log information, Browse records, likes/sharing/review/interaction objects, searches, gender, age, personal location information (of which gender, age, and accurate positioning information are sensitive personal information).", "label": ["Important", "First Party Collection Information"], "rewrite": "Provide you with more suitable customized services, we need to collect your equipment information, browser models, log information, etc."}
{"task": "rw_4.jsonl", "id": 37864, "text": "For example: Recommend the drama, advertising, exhibition of current cities, etc. you may like.", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37865, "text": "In order to ensure the autonomy of your receiving information, you have the right to control and decide whether to use personalized recommendation functions:", "label": ["Important", "Edit/Control"], "rewrite": "In order to ensure the autonomy of your receiving information, you have the right to control and decide whether to use personalized recommendation functions:"}
{"task": "rw_4.jsonl", "id": 37866, "text": "When you are not interested in the personalized content we recommend or want to reduce some information recommendation, you can click the button or long press the content in the lower right corner of the recommended content in the app, select [Not interested] for precise shielding;", "label": ["Edit/Control", "Important"], "rewrite": "You can use the button or long press the content in the lower right corner of the recommended content in the app, and select [Not interested] to make the information recommendation accurate shielding."}
{"task": "rw_4.jsonl", "id": 37867, "text": "If you don't want to be recommended to be personalized content, you can close the personalized content recommendation through \"my - setting -privacy settings -personalized recommendation content management\".", "label": ["Edit/Control", "Important"], "rewrite": "You can close personalized content recommendation through \"my - setting -privacy permissions settings -personalized recommendation content management\"."}
{"task": "rw_4.jsonl", "id": 37868, "text": "When you choose to close the personalized content recommendation, you will not be able to enjoy personalized content recommendation services. We will show you the content based on non -personalized factors such as content heat. You may see what you are not interested in or even dislikes.The experience may be affected.", "label": ["Important", "Edit/Control"], "rewrite": "When you choose to close personalized content recommendation, you will not be able to enjoy personalized content recommendation services."}
{"task": "rw_4.jsonl", "id": 37869, "text": "When you are not interested in personalized advertisements we recommend or want to no longer receive such personalized advertisements, you can use our product/service related feature settings page to open/close personalized advertisement recommendation.", "label": ["Edit/Control", "Important"], "rewrite": "You can use our product/service related feature setting page to open/close personalized advertising recommendation."}
{"task": "rw_4.jsonl", "id": 37870, "text": "The setting path for the personalized advertisement of Bilibili App is: \"My - Settings -Privacy Permanent Settings -Allow Bilibili Personalized Personalized Advertising Recommendation\".", "label": ["Important", "Edit/Control"], "rewrite": "The setting path recommended by personalized advertising is: \"My - Settings -Privacy Permanent Settings -Allow Bilibili Personalized Personalized Advertising Recommendations.\""}
{"task": "rw_4.jsonl", "id": 37871, "text": "After you update the APP version, without your clear consent, we will not change the authority you set before.", "label": ["Important", "Edit/Control"], "rewrite": "After you update the APP version, without your clear consent, we will not change the authority you set before."}
{"task": "rw_4.jsonl", "id": 37872, "text": "(2) In particular, in order to satisfy member purchasing ticket business to locate the offline activity information function around your location, we will obtain the IP address of your device (including in the background state) and your personal location information (of which accurate accuratePositioning information is sensitive personal information), you can authorize to provide us with your location information (you know and agree, in some specific business scenarios, in order to improve business processing capabilities, reduce costs, or other aspects, we may use that there are anyThird -party positioning SDK to obtain your relevant information, such as: \"Tencent Positioning\" SDK to get your IMEI information.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "In order to meet the offline activity information function around your place of ticket purchase business, we will obtain the IP address of your device and your personal location information, and may use a third -party positioning SDK."}
{"task": "rw_4.jsonl", "id": 37873, "text": "But without your consent, we will not take the initiative to transmit the aforementioned information to the third party) so that we can recommend the latest news or more suitable for your service content to you.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37874, "text": "If you decide to withdraw from our personalized recommendation/directional push based on position information, you can set up/cancel the permissions through the relevant functions of your device.", "label": ["Important", "Edit/Control"], "rewrite": "If you decide to withdraw from our personalized recommendation/directional push based on position information, you can set up/cancel the permissions through the relevant functions of your device."}
{"task": "rw_4.jsonl", "id": 37875, "text": "The position of the position of the position of the Bilibili app is: \"My - Settings -Privacy Permanent Settings -Allow Bilibili access location information\".", "label": ["Important", "Edit/Control"], "rewrite": "The location of the location of the location of the location is: \"My - Settings -Privacy Permanent Settings -Allow Bilibili Access Information\"."}
{"task": "rw_4.jsonl", "id": 37876, "text": "After you update the APP version, without your clear consent, we will not change the authority you set before.", "label": ["Important", "Edit/Control"], "rewrite": "After you update the APP version, without your clear consent, we will not change the authority you set before."}
{"task": "rw_4.jsonl", "id": 37877, "text": "(3), further, we may collect your search records, browsing records, collection records, watch information, equipment information, likes/sharing/review/interaction objects when using our product/serviceYour portable network behavior, interest preference, homepage recommendation form, play settings preference information form user portrait to help us know how to access and use our products/services, maintain and improve our products/services or to you to youMake other responses.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may collect your use of behavior information to form a user portrait to help us know how to access and use our products/services, maintain and improve our products/services or make other responses to you."}
{"task": "rw_4.jsonl", "id": 37878, "text": "When you are not interested in the specific information pushed by our personalized content recommendation strategy or want to reduce the recommendation of certain types of information, you can click the button in the lower right corner of the recommendation content and select \"Not interested\". We will adjust the strategy based on your feedback.", "label": ["Important", "Usage", "Edit/Control"], "rewrite": "When you are not interested in the specific information pushed by personalized content recommendation strategies or want to reduce a certain type of information recommendation, you can click the button in the lower right corner of the recommendation content and select \"Not interested\"."}
{"task": "rw_4.jsonl", "id": 37879, "text": "If you do not want to be recommended to be personalized content, you can close it through \"My - Settings -Privacy Settings -Personalized Content Recommendation Management\".", "label": ["Important", "Edit/Control"], "rewrite": "If you do not want to be recommended to be personalized content, you can close it through \"My - Settings -Privacy Settings -Personalized Content Recommendation Management\"."}
{"task": "rw_4.jsonl", "id": 37880, "text": "(4) If you log in to our product with iOS device and your device system is iOS14 or above, you can choose to close the precise positioning information (sensitive personal information).Information, closing the precise positioning information will not affect your normal use of this function.", "label": ["Important", "Edit/Control"], "rewrite": "If you log in to our product with iOS device and your device system is iOS14 or above, you can choose to close the precise positioning information."}
{"task": "rw_4.jsonl", "id": 37881, "text": "You can also open/cancel the permissions through the relevant function settings of your device system at any time.", "label": ["Important", "Edit/Control"], "rewrite": "You can open/cancel precision positioning permissions through the relevant function settings of your device system at any time."}
{"task": "rw_4.jsonl", "id": 37882, "text": "After you update the APP version, without your clear consent, we will not change the authority you set before.", "label": ["Important", "Edit/Control"], "rewrite": "After you update the APP version, without your clear consent, we will not change the authority you set before."}
{"task": "rw_4.jsonl", "id": 37883, "text": "4.16 dynamic, applet", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37884, "text": "(1), when you start your device positioning function and select the positioning function of the positioning of our geographical location when publishing a dynamic or running mini -program (mini -game), we may collect) Regarding your personal location information (the precise positioning information is sensitive personal information).", "label": ["Important", "First Party Collection Information", "Edit/Control"], "rewrite": "When you turn on your device positioning function and use the positioning function when you release dynamic or run the applet at the same time, we may collect information about your personal location."}
{"task": "rw_4.jsonl", "id": 37885, "text": "If you refuse to provide it, it will only make you unable to use this function, but it does not affect other functions of your normal use of products/services.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37886, "text": "At the same time, you can also open/cancel the permissions through your device system or the related feature settings of our product/service.", "label": ["Important", "Edit/Control"], "rewrite": "You can open/cancel the location permissions through your device system or using our product/service related features."}
{"task": "rw_4.jsonl", "id": 37887, "text": "The position of the position permissions of the Bilibili app is: \"My-Settings-Privacy Permanent Settings-Allow Bilibili access location information\".", "label": ["Important", "Edit/Control"], "rewrite": "The location of the position permissions is: \"My-Settings-Privacy Permanent Settings-Allow Bilibili access to the location information\"."}
{"task": "rw_4.jsonl", "id": 37888, "text": "If you turn on this permission, you deepen that you authorize us to access, obtain, collect, and use your personal information;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "If you open your position permissions, you deepen that you authorize us to access, obtain, collect, and use your personal information."}
{"task": "rw_4.jsonl", "id": 37889, "text": "But when you cancel the authorization, we will no longer collect this information, nor can it provide you with the above -mentioned services;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "When you cancel the authorization, we will no longer collect the information, and we will no longer provide you with the above -mentioned services."}
{"task": "rw_4.jsonl", "id": 37890, "text": "But unless you delete your personal information in accordance with the law, your cancellation behavior will not affect the processing and storage of our personal information based on your previous authorization.", "label": ["Permission Acquisition", "Edit/Control", "Risk", "Important"], "rewrite": "Your cancellation will not affect the processing and storage of your personal information based on your previous authorization."}
{"task": "rw_4.jsonl", "id": 37891, "text": "After you update the APP version, without your clear consent, we will not change the authority you set before.", "label": ["Important", "Edit/Control"], "rewrite": "After you update the APP version, without your clear consent, we will not change the authority you set before."}
{"task": "rw_4.jsonl", "id": 37892, "text": "(2) If you log in to our product with iOS device and your device system is iOS14 or above, you can choose to close the precise positioning information (sensitive personal information).) Your approximate geographical location (personal information), closing the precise positioning information will not affect your normal use.", "label": ["Important", "Edit/Control"], "rewrite": "If you log in to our product with iOS device and your device system is iOS14 or above, you can choose to close the precise positioning information."}
{"task": "rw_4.jsonl", "id": 37893, "text": "You can also open/cancel the permissions through your device system or using the relevant feature settings of our product/service at any time.", "label": ["Important", "Edit/Control"], "rewrite": "You can open/cancel the location permissions through your device system or using our product/service related features."}
{"task": "rw_4.jsonl", "id": 37894, "text": "After you update the APP version, without your clear consent, we will not change the authority you set before.", "label": ["Important", "Edit/Control"], "rewrite": "After you update the APP version, without your clear consent, we will not change the authority you set before."}
{"task": "rw_4.jsonl", "id": 37895, "text": "4.17 acceleration meter", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37896, "text": "When you use dry campaign, Kanniang, IM photo, dynamic photo, video shooting, live broadcast beauty, mini -program capabilities, panoramic maps, magic rewards, member purchase search search, BW exhibition offline interactive game, etc.At the same time, we will access your device motion trajectory (acceleration measure) related permissions and collect the device sensor data.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "When you use the functions of a toast activity, a look -up mother, IM photo, etc., we will access your device motion trajectory (acceleration measure) related permissions and collect your device sensor data."}
{"task": "rw_4.jsonl", "id": 37897, "text": "Please understand that the separate equipment movement trajectory (acceleration) does not involve any personal location information and cannot be combined with other information to identify a specific natural person.", "label": ["Important"], "rewrite": "Solid equipment movement trajectory (acceleration) does not involve any personal location information and cannot be combined with other information to identify the identity of a specific natural person."}
{"task": "rw_4.jsonl", "id": 37898, "text": "If the above information is used in combination with personal information, during the combination of combination, such non -personal information will be regarded as personal information. In addition to obtaining your authorization or laws and regulations, we will anonymous such personal information andRemove the processing.", "label": ["Important", "Data Security"], "rewrite": "During the combination of equipment motion trajectory and personal information, such non -personal information will be regarded as personal information during the combination of use. We will make such personal information anonymous and de -identified processing."}
{"task": "rw_4.jsonl", "id": 37899, "text": "After you update the APP version, without your clear consent, we will not change the authority you set before.", "label": ["Important", "Edit/Control"], "rewrite": "After you update the APP version, without your clear consent, we will not change the authority you set before."}
{"task": "rw_4.jsonl", "id": 37900, "text": "4.18 Campus", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37901, "text": "(1) When you use campus service, we will show you the dynamic information of your school and push the dynamic information that may be published to the alumni circle. To this endThe address and your vague geographical location.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use campus services, we may collect the school information, the IP address of your device, and your vague geographical location."}
{"task": "rw_4.jsonl", "id": 37902, "text": "We collect IP address information to provide you with services to display campus dynamics. If you refuse to provide the above permissions, it may cause you to be unable to use our related products and services.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "We collect IP address information to provide you with services to display campus dynamics."}
{"task": "rw_4.jsonl", "id": 37903, "text": "Please understand that a separate IP address is information that cannot identify a specific natural person.", "label": ["Important"], "rewrite": "The separate IP address is information that cannot recognize the identity of a specific natural person."}
{"task": "rw_4.jsonl", "id": 37904, "text": "If we use this type of non -personal information with other information to identify a specific natural person or use it with personal information, during the combination of use, such non -personal information will be regarded as personal information, except for obtaining your authorization.Or in addition to other provisions of laws and regulations, we will anonymous and de -identification processing of this type of personal information.", "label": ["Important", "Data Security"], "rewrite": "If we combine this type of non -personal information with other information to identify a specific natural person, we will anonymous and de -identifiable processing of this type of personal information."}
{"task": "rw_4.jsonl", "id": 37905, "text": "(2) You refuse to display the dynamic information you posted on the campus page does not affect your normal use of this function, but it will make the dynamic information you published cannot be browsed by other campus users.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37906, "text": "You can open/cancel the above permissions through our relevant function settings page at any time.", "label": ["Edit/Control", "Important"], "rewrite": "You can open/cancel the IP permissions through our relevant function settings page at any time."}
{"task": "rw_4.jsonl", "id": 37907, "text": "Bilibili APP's campus dynamic authority setting path is: \"My-Settings-Privacy Permanent Settings-Allow me to be displayed on the campus.\"", "label": ["Important", "Edit/Control"], "rewrite": "Campus dynamic authority setting path is: \"Mine-setting-privacy permissions settings-allow me to be released on campus.\""}
{"task": "rw_4.jsonl", "id": 37908, "text": "If you turn on this permission, you deepen that you authorize us to display your submission information on the campus page;", "label": ["Important", "Edit/Control"], "rewrite": "If you open the campus dynamic permissions, it is deemed that you can authorize us to display your submission information on the campus page."}
{"task": "rw_4.jsonl", "id": 37909, "text": "But when you cancel the authorization, we will no longer show the information, and we will no longer provide you with the above -mentioned services;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37910, "text": "But unless you delete your personal information in accordance with the law, your cancellation behavior will not affect the processing and storage of our personal information based on your previous authorization.", "label": ["Permission Acquisition", "Edit/Control", "Risk", "Important"], "rewrite": "Your cancellation will not affect the processing and storage of your personal information based on your previous authorization."}
{"task": "rw_4.jsonl", "id": 37911, "text": "After you update the APP version, without your clear consent, we will not change the authority you set before.", "label": ["Important", "Edit/Control"], "rewrite": "After you update the APP version, without your clear consent, we will not change the authority you set before."}
{"task": "rw_4.jsonl", "id": 37912, "text": "4.19 Certification Service", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37913, "text": "We provide personal users with identity authentication services on the Bilibili platform.", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37914, "text": "When you apply for identity authentication for you, we need to collect your name, identity document number, and relevant identity certification materials (sensitive personal information) to prove your personal identity.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you apply for identity authentication for you, we need to collect your name, identity document number, and relevant identity certification materials."}
{"task": "rw_4.jsonl", "id": 37915, "text": "After reviewing the authenticity of your personal information, we will mark you for certification logo and provide exclusive services for certification accounts.", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37916, "text": "4.20 audio and video, screenshot and picture cache", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37917, "text": "When you log in to our products with mobile devices and use audio and video cache, screenshot cache and picture storage function, we may obtain storage rights for your device.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you log in to our products with mobile devices and use audio and video cache, screenshot cache and picture storage function, we may obtain storage rights for your device."}
{"task": "rw_4.jsonl", "id": 37918, "text": "If you refuse to provide it, it will only make you unable to use this function, but it does not affect other functions of your normal use of products/services.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37919, "text": "At the same time, you can also open/cancel the permissions through your device system or the related feature settings of our product/service.", "label": ["Important", "Edit/Control"], "rewrite": "You can open/cancel the storage permissions through your device system or using our product/service related feature settings."}
{"task": "rw_4.jsonl", "id": 37920, "text": "The storage authority setting path of Bilibili app is: \"My-Settings-Privacy Permanent Settings-Allow Bilibili to use file storage and access functions.\"", "label": ["Edit/Control", "Important"], "rewrite": "The storage authority setting path is: \"My-Settings-Privacy Permanent Settings-Allow Bilibili to use file storage and access functions.\""}
{"task": "rw_4.jsonl", "id": 37921, "text": "If you turn on this permission, you deepen that you authorize us to access, obtain, collect, and use your personal information;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "If you turn on the storage permissions, you are deemed to authorize us to access, obtain, collect, and use your personal information."}
{"task": "rw_4.jsonl", "id": 37922, "text": "But when you cancel the authorization, we will no longer collect this information, nor can it provide you with the above -mentioned services;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "When you cancel the authorization, we will no longer collect the information, and we will no longer provide you with the above -mentioned services."}
{"task": "rw_4.jsonl", "id": 37923, "text": "But unless you delete your personal information in accordance with the law, your cancellation behavior will not affect the processing and storage of our personal information based on your previous authorization.", "label": ["Permission Acquisition", "Edit/Control", "Risk", "Important"], "rewrite": "Your cancellation will not affect the processing and storage of your personal information based on your previous authorization."}
{"task": "rw_4.jsonl", "id": 37924, "text": "After you update the APP version, without your clear consent, we will not change the authority you set before.", "label": ["Important", "Edit/Control"], "rewrite": "After you update the APP version, without your clear consent, we will not change the authority you set before."}
{"task": "rw_4.jsonl", "id": 37925, "text": "4.21 dynamic wallpaper", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37926, "text": "When you log in to our products with Android devices and use the dynamic wallpaper function, we may obtain access permissions and Android wallpaper authority about your equipment and the authority of Android system wallpaper, and collect equipment information in the local network (including hardware models, models, models, models, models, models, models, models, models, including hardware models, as well asManufacturer, system version, operator).", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "When you log in to our products with Android devices and use dynamic wallpaper functions, we may obtain access permissions on the local network of your device and Android wallpaper authority, and collect equipment information in the local network."}
{"task": "rw_4.jsonl", "id": 37927, "text": "If you refuse to provide it, it will only make you unable to use this function, but it does not affect other functions of your normal use of products/services.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37928, "text": "At the same time, you can also open/cancel the permissions through the relevant function settings of your device system.", "label": ["Important", "Edit/Control"], "rewrite": "You can open/cancel the permissions through the relevant function settings of your device system at any time."}
{"task": "rw_4.jsonl", "id": 37929, "text": "If you turn on this permission, you deepen that you authorize us to access, obtain, collect, and use your personal information;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "If you open the access permissions of your local network, you deepen that you can authorize us to access, obtain, collect, and use your personal information."}
{"task": "rw_4.jsonl", "id": 37930, "text": "But when you cancel the authorization, we will no longer collect this information, nor can it provide you with the above -mentioned services;", "label": ["Important", "Edit/Control"], "rewrite": "After you cancel the local network authorization, we will no longer collect this information, nor can we provide you with the above -mentioned services."}
{"task": "rw_4.jsonl", "id": 37931, "text": "But unless you delete your personal information in accordance with the law, your cancellation behavior will not affect the processing and storage of our personal information based on your previous authorization.", "label": ["Permission Acquisition", "Edit/Control", "Risk", "Important"], "rewrite": "Your cancellation will not affect the processing and storage of your personal information based on your previous authorization."}
{"task": "rw_4.jsonl", "id": 37932, "text": "Please understand that separate equipment information cannot identify specific natural person status.", "label": ["Important"], "rewrite": "Please understand that separate equipment information cannot identify specific natural person status."}
{"task": "rw_4.jsonl", "id": 37933, "text": "If the above information is used in combination with personal information, during the combination of combination, such non -personal information will be regarded as personal information. In addition to obtaining your authorization or laws and regulations, we will anonymous such personal information andRemove the processing.", "label": ["Important", "Data Security"], "rewrite": "The combination of equipment information and personal information will be regarded as personal information, and we will anonymous and de -identifiable processing of this type of personal information."}
{"task": "rw_4.jsonl", "id": 37934, "text": "After you update the APP version, without your clear consent, we will not change the authority you set before.", "label": ["Important", "Edit/Control"], "rewrite": "After you update the APP version, without your clear consent, we will not change the authority you set before."}
{"task": "rw_4.jsonl", "id": 37935, "text": "4.22 shot screen", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37936, "text": "When you log in to our products with iOS device and use the screen function, we may obtain access rights about your equipment located, and collect equipment information in the local network (including hardware models, manufacturers, equipment decodingInstrument information).", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "When you log in to our products with iOS device and use the screen function, we may obtain access rights about your device's local network and collect equipment information on the local network."}
{"task": "rw_4.jsonl", "id": 37937, "text": "If you refuse to provide it, it will only make you unable to use this function, but it does not affect other functions of your normal use of products/services.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37938, "text": "At the same time, if your device system is iOS14 or above, you can also open/cancel the permissions through your device system or the relevant function setting page of our product/service.", "label": ["Important", "Edit/Control"], "rewrite": "If your device system is iOS14 or above, you can set up/cancel the local network access rights through your device system or the relevant feature settings of our product/service at any time."}
{"task": "rw_4.jsonl", "id": 37939, "text": "The local network access right setting path of iOS Bilibili App is: \"My-Settings-Privacy Permanent Settings-Allow Bilibili to access the local network.\"", "label": ["Important", "Edit/Control"], "rewrite": "Local network access permissions setting paths are: \"My-Settings-Privacy Permanent Settings-Allow Bilibili to access the local network.\""}
{"task": "rw_4.jsonl", "id": 37940, "text": "If you turn on this permission, you deepen that you authorize us to access, obtain, collect, and use your personal information;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "If you turn on this permission, you deepen that you authorize us to access, obtain, collect, and use your personal information."}
{"task": "rw_4.jsonl", "id": 37941, "text": "But when you cancel the authorization, we will no longer collect this information, nor can it provide you with the above -mentioned services;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37942, "text": "But unless you delete your personal information in accordance with the law, your cancellation behavior will not affect the processing and storage of our personal information based on your previous authorization.", "label": ["Permission Acquisition", "Edit/Control", "Risk", "Important"], "rewrite": "Your cancellation will not affect the processing and storage of your personal information based on your previous authorization."}
{"task": "rw_4.jsonl", "id": 37943, "text": "After you update the APP version, without your clear consent, we will not change the authority you set before.", "label": ["Important", "Edit/Control"], "rewrite": "After you update the APP version, without your clear consent, we will not change the authority you set before."}
{"task": "rw_4.jsonl", "id": 37944, "text": "4.23 shortcut (Siri)", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37945, "text": "When you log in to our products with iOS devices and use shortcut functions, we may obtain the Siri use permissions of your device and collect your voice information, voice interaction information (personal information).", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "When you log in with iOS devices and use shortcut functions, we may obtain the Siri usage permissions of your device and collect your voice information and voice interaction information."}
{"task": "rw_4.jsonl", "id": 37946, "text": "You understand and confirm that we will not collect or store your voice data and personal information. If you refuse to provide it, it will only make you unable to use this function, but it does not affect other functions that use your product/service normally.", "label": ["Data Retention", "Important", "First Party Collection Information"], "rewrite": "We will not collect or store your voice data and personal information."}
{"task": "rw_4.jsonl", "id": 37947, "text": "At the same time, if your device system is iOS10 and above, you can also open/cancel the permissions through your device system or the relevant function settings of our product/service.", "label": ["Important", "Edit/Control"], "rewrite": "If your device system is iOS10 and above, you can also set up/cancel Siri use permissions through your device system or related feature settings of our product/service at any time."}
{"task": "rw_4.jsonl", "id": 37948, "text": "The SIRI use right setting path of the iOS Bilibili App is: \"My - Settings -Privacy Permanent Settings -Allow Bilibili to access Siri\".", "label": ["Important", "Edit/Control"], "rewrite": "The Siri use right setting path is: \"My - Settings -Privacy Permanent Settings -Allow Bilibili to access Siri\"."}
{"task": "rw_4.jsonl", "id": 37949, "text": "If you turn on the above permissions, it deemed that you can authorize us to access, obtain, collect, and use your personal information;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "If you turn on Siri's right to use, it is deemed that you can authorize us to access, obtain, collect, and use your personal information."}
{"task": "rw_4.jsonl", "id": 37950, "text": "But when you cancel the authorization, we will no longer collect this information, nor can it provide you with the above -mentioned services;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37951, "text": "But unless you delete your personal information in accordance with the law, your cancellation behavior will not affect the processing of your personal information based on your previous authorization.", "label": ["Permission Acquisition", "Edit/Control", "Risk", "Important"], "rewrite": "Your cancellation will not affect our personal information processing based on your previous authorization."}
{"task": "rw_4.jsonl", "id": 37952, "text": "After you update the APP version, without your clear consent, we will not change the authority you set before.", "label": ["Important", "Edit/Control"], "rewrite": "After you update the APP version, without your clear consent, we will not change the authority you set before."}
{"task": "rw_4.jsonl", "id": 37953, "text": "4.24 Hidden message list", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37954, "text": "When you use the hidden message list function (this function allows you to log in and run our product at the same time on multiple devices, select only a list of message lists in a certain device and hide other devices), we may mayCollect the software list currently in use.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the hidden message list function, we may collect the software list of your device is currently in use."}
{"task": "rw_4.jsonl", "id": 37955, "text": "Please understand that the software list in separate use cannot identify the identity information of a specific natural person.", "label": ["Important"], "rewrite": "The software list in separate use cannot identify the identity information of a specific natural person."}
{"task": "rw_4.jsonl", "id": 37956, "text": "If we use this type of non -personal information with other information to identify a specific natural person or use it with personal information, during the combination of use, such non -personal information will be regarded as personal information, except for obtaining your authorization.Or in addition to other provisions of laws and regulations, we will anonymous and de -identification processing of this type of personal information.", "label": ["Important", "Data Security"], "rewrite": "If we use this type of non -personal information with other information to identify a specific natural person, or use it with personal information, during the combination of use, such non -personal information will be regarded as anonymous and to goIdentification processing."}
{"task": "rw_4.jsonl", "id": 37957, "text": "4.25 Use Bluetooth equipment and offline exhibition interactive games", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37958, "text": "(1) When you use the Bluetooth device and turn on the Bluetooth function, we may collect your device's current Bluetooth device connection status, and provide Bluetooth headset volume adjustment, control video playback and suspension, control video recording and pausePraise for video, monitor the connection status of Bluetooth equipment, and find the surrounding equipment functions.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use Bluetooth device and turn on the Bluetooth function, we may collect your device's current Bluetooth device connection status."}
{"task": "rw_4.jsonl", "id": 37959, "text": "Please understand that the connection status of a separate Bluetooth device cannot recognize the identity information of a specific natural person.", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37960, "text": "If we use this type of non -personal information with other information to identify a specific natural person or use it with personal information, during the combination of use, such non -personal information will be regarded as personal information, except for obtaining your authorization.Or in addition to other provisions of laws and regulations, we will anonymous and de -identification processing of this type of personal information.", "label": ["Important", "Data Security"], "rewrite": "If we use this type of non -personal information with other information to identify a specific natural person, or use it with personal information, during the combination of use, such non -personal information will be regarded as anonymous and to goIdentification processing."}
{"task": "rw_4.jsonl", "id": 37961, "text": "(2) When you participate in the Bilibiliworld offline exhibition and start the Bluetooth function, we will provide the corresponding exhibition tasks (such as exploring and capturing the UP owner around us) and interactive games.", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37962, "text": "To this end, we need to collect your Bluetooth connection status and scan the surrounding Bluetooth list.", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37963, "text": "Please understand that the individual Bluetooth connection status and the surrounding Bluetooth list cannot identify the identity information of a specific natural person.", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37964, "text": "If we use this type of non -personal information with other information to identify a specific natural person or use it with personal information, during the combination of use, such non -personal information will be regarded as personal information, except for obtaining your authorization.Or in addition to other provisions of laws and regulations, we will anonymous and de -identification processing of this type of personal information.", "label": ["Important", "Data Security"], "rewrite": "If we use this type of non -personal information with other information to identify a specific natural person, or use it with personal information, during the combination of use, such non -personal information will be regarded as anonymous and to goIdentification processing."}
{"task": "rw_4.jsonl", "id": 37965, "text": "(3) If you don't want to use the above features, you can open/cancel the Bluetooth function through the relevant function settings of your device system.", "label": ["Important", "Edit/Control"], "rewrite": "You can open/cancel the Bluetooth function through the relevant function settings of your device system at any time."}
{"task": "rw_4.jsonl", "id": 37966, "text": "If you turn on the Vampus function of the device, it is deemed that you can authorize us to access, obtain, collect, and use your personal information;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "If you turn on the Vampus function of the device, it is deemed that you can authorize us to access, obtain, collect, and use your personal information."}
{"task": "rw_4.jsonl", "id": 37967, "text": "But when you turn off the device Bluetooth function, we will no longer collect this information, and we can no longer provide you with the above -mentioned services;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37968, "text": "But unless you delete your personal information in accordance with the law, your cancellation behavior will not affect the processing and storage of our personal information based on your previous authorization.", "label": ["Permission Acquisition", "Edit/Control", "Risk", "Important"], "rewrite": "Your cancellation will not affect the processing and storage of your personal information based on your previous authorization."}
{"task": "rw_4.jsonl", "id": 37969, "text": "At the same time, if you use the above features using the above function and your device system is iOS13.1 or above, you can also open/cancel the permissions by using the relevant function settings of our product/service.", "label": ["Important", "Edit/Control"], "rewrite": "If you use the above features with the above function and your device system is iOS13.1 or above, you can also open/cancel the Bluetooth authority through the relevant function settings page at any time."}
{"task": "rw_4.jsonl", "id": 37970, "text": "The Siri use right setting path of the iOS Bilibili App is: \"My - Settings -Privacy Permissions Settings -Allow Bilibili to access Bluetooth.\"", "label": ["Important", "Edit/Control"], "rewrite": "The Siri use right setting path is: \"My - Settings -Privacy Permanent Settings -Allow Bilibili to access Bluetooth.\""}
{"task": "rw_4.jsonl", "id": 37971, "text": "After you update the APP version, without your clear consent, we will not change the authority you set before.", "label": ["Important", "Edit/Control"], "rewrite": "After you update the APP version, without your clear consent, we will not change the authority you set before."}
{"task": "rw_4.jsonl", "id": 37972, "text": "5. In addition to the above situation, we may also collect and use your personal information in the following scenes:", "label": ["Important", "First Party Collection Information"], "rewrite": "In addition to the above situations, we may also collect and use your personal information in the following scenes:"}
{"task": "rw_4.jsonl", "id": 37973, "text": "5.1 Your personal information collected from third parties", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37974, "text": "(1), you understand and know, the personal information provided by the external third parties (the affiliated company under Bilibili is not limited to this), or your personal information collected by the outside third party, we cannot obtainUnconventional ways (such as: malicious intervention in the opponent series APP data) to obtain your personal information with software program without authorization.", "label": ["Important", "First Party Collection Information"], "rewrite": "We cannot obtain personal information provided by external third parties, or your personal information collected by external third parties, and we will not obtain your personal information in unconventional ways."}
{"task": "rw_4.jsonl", "id": 37975, "text": "Bilibili may really need to be collected indirectly (such as sharing, etc.) from third parties due to the needs of business development, and we can provide you with products or services directly or together. We (or third parties) are inBefore the collection, the source, type, purpose, method, and business functions, and scope of authorization consent will be used to share your personal information (if the method and scope of the use exceeds the scope of the original authorized scope of the third party, we will recruit againYour authorization consent).", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "If you really need to collect indirectly from a third party (such as sharing, etc.), we will show you the source, type, use purpose, method, and business function, authorization consent of your personal information that you shared before collecting.scope."}
{"task": "rw_4.jsonl", "id": 37976, "text": "When some of our products or services are provided or provided by third -party business partners, in order to carry out business in order to carry out business, we may indirectly collected your information from some business partners./Provide information about you during service.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "When some products or services are provided or provided by third -party business partners, we may indirectly collected your information and other parties from some business partners to provide information about you."}
{"task": "rw_4.jsonl", "id": 37977, "text": "(2) Our professional security team will strengthen personal information (including sensitive information reporting, sensitive information encryption storage, access permissions control, etc.).", "label": ["Important", "Data Security"], "rewrite": "Our professional security team will strengthen personal information."}
{"task": "rw_4.jsonl", "id": 37978, "text": "We will use more than our personal information obtained from our personal information that are the same protection means and measures that are the same protection means and measures.", "label": ["Important", "Data Security"], "rewrite": "Using is not lower than our personal information of the same protection of our personal information and measures to protect the personal information obtained indirectly."}
{"task": "rw_4.jsonl", "id": 37979, "text": "5.2 Message Notification and Marketing Promotion", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37980, "text": "We may send you one or more types of notifications to you through the contact information (such as the phone number) provided during the useResearch;", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37981, "text": "In addition, we may also provide you with commercial information such as services, functions or activities that you may be interested in by text messages and telephones.", "label": ["Important", "Usage"], "rewrite": "We may provide you with commercial information such as services, functions, or activities that you may be interested in through text messages and telephones."}
{"task": "rw_4.jsonl", "id": 37982, "text": "If you do not want to receive our commercial information, you can use the withdrawal method provided in the mobile phone text message to be withdrawn, and you can also contact us to withdraw bips (this \"Bilibili Privacy Policy\" Article 10 \"Contact Us\"To.", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37983, "text": "5.3 For other reasonable and necessary purposes", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37984, "text": "If a product/service that needs to collect your personal information is not explained in this privacy policy, or we will be beyond the purpose of the purpose of the personal information and the scope of a direct or reasonable relationship, we willBefore collecting and using your personal information, it will explain to you by updating this privacy policy, page prompts, pop -ups, on -site letters, website announcements, or other ways to facilitate your knowledge, and provide you with the way you choose to consent, and you and you, and you canCollect and use it after obtaining your consent.", "label": ["Important", "First Party Collection Information"], "rewrite": "If the purpose of the privacy policy explanation or the purpose claimed at the time of collection does not have the scope of direct or reasonable correlation, we will explain to you in advance and collect and use it after obtaining your consent."}
{"task": "rw_4.jsonl", "id": 37985, "text": "5.4 Removal of consent in accordance with the law", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37986, "text": "You understand and agree. In the following circumstances, we can collect and use your personal information without obtaining your authorization consent:", "label": ["Important", "First Party Collection Information"], "rewrite": "In the following circumstances, we can collect and use your personal information without obtaining your authorization consent:"}
{"task": "rw_4.jsonl", "id": 37987, "text": "(1) It is necessary for the contract to establish and fulfill our contract with you;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "In order to establish and fulfill the collection and use information we signed with you, there is no need to solicit authorization consent."}
{"task": "rw_4.jsonl", "id": 37988, "text": "(2) In order to fulfill the statutory responsibility or legal responsibilities or legal obligations such as national security, defense security, criminal investigation, prosecution, trial and judgment implementation with national security, national security, national defense security, national investigation, prosecution, trial, and judgment implementation;", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to fulfill the statutory duties or the collection and usage information necessary for the statutory volunteer, there is no need to solicit authorization consent."}
{"task": "rw_4.jsonl", "id": 37989, "text": "(3) In order to cope with emergencies, or in urgent situations, it is necessary to protect the health and property safety of natural people;", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to cope with emergencies, or in urgent cases to protect the life and health of natural persons and the necessary collection and use information, no need to solicit authorization."}
{"task": "rw_4.jsonl", "id": 37990, "text": "(4) In order to implement news reports and supervision of public opinion for public interests, handle personal information within a reasonable range;", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to implement news reports and public opinion supervision, deal with personal information within a reasonable scope without soliciting authorization consent."}
{"task": "rw_4.jsonl", "id": 37991, "text": "(5) Treatment of personal information of individuals or other legal disclosure within a reasonable range;", "label": ["Important", "First Party Collection Information"], "rewrite": "To handle individuals and other personal information that have been disclosed by themselves within a reasonable scope, no need to solicit authorization consent."}
{"task": "rw_4.jsonl", "id": 37992, "text": "(6), other circumstances stipulated in laws and regulations.", "label": ["Important", "First Party Collection Information"], "rewrite": "Other collection and use information stipulated in laws and regulations does not need to solicit authorization."}
{"task": "rw_4.jsonl", "id": 37993, "text": "4. How do we share, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37994, "text": "1. Sharing", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37995, "text": "Under normal circumstances, we will not share your personal information with any company, organization, and personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Under normal circumstances, we will not share your personal information with any company, organization, and personal information."}
{"task": "rw_4.jsonl", "id": 37996, "text": "However, in order to provide you with a more complete and high -quality product/service, we may share some of your personal information with third -party partners on the premise of abide by the \"legitimate, legitimate, minimized, and clear principles of purpose.\"", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We may share some of your personal information with third -party partners on the premise of complying with the \"legitimate, legitimate, minimum necessary, and clear principles of purpose, and clear the principles of purpose.\""}
{"task": "rw_4.jsonl", "id": 37997, "text": "At this time, we will sign a strict confidentiality agreement with the partners, asking them to handle your personal information in accordance with our instructions, privacy policies, and any other related confidentiality and security measures.The personal information necessary for providing services will cause you to be unable to use the third -party service on our platform.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will sign a confidentiality agreement with a partner, asking them to handle your personal information in accordance with our instructions, privacy policies, and any other related confidentiality and security measures."}
{"task": "rw_4.jsonl", "id": 37998, "text": "Usually our partners have the following categories:", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_4.jsonl", "id": 37999, "text": "1.1 Service providers for our products/services to support functional support: For exampleProvider (such as the developer who is in the open platform in Bilibili and obtains your authorization), and provides authentication agencies with real -name authentication functions. The purpose of our sharing information is only to realize the function of our product/service;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38000, "text": "1.2, third -party merchants of our platform: In order to realize your needs for purchasing products or services (including enjoying after -sales service), we will share your order information with transaction -related information to our platform's third -party merchants.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to realize your needs for purchasing products or services, we will share your order information with transaction -related information with third -party merchants."}
{"task": "rw_4.jsonl", "id": 38001, "text": "For example, when you purchase or order performance tickets at Bilibili members, Bilibili will provide your necessary information to the organizer of the performance in order to send you a performance ticket.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When you purchase or order tickets at Bilibili members, you will provide your necessary information to the organizer of the performance."}
{"task": "rw_4.jsonl", "id": 38002, "text": "1.3, third -party SDK service provider: Our products may contain third -party SDKs or other similar applications. If you use such services provided by third parties on our platform, you agreeProcess your information (such as embedded code, plug -in, etc.).", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "If you use such services provided by third -party on our platform, you agree to collect and process your information directly."}
{"task": "rw_4.jsonl", "id": 38003, "text": "At present, the third -party SDK service contained in our products should consult the \"Bilibili third -party information sharing list\" in detail.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For the third -party SDK service contained in our products, please refer to the \"Bilibili Third -Party Information Sharing List\"."}
{"task": "rw_4.jsonl", "id": 38004, "text": "The aforementioned service providers collect and handle information such as information such as their own privacy clauses, not applicable to this policy.", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38005, "text": "In order to ensure your information security to the greatest extent, we recommend that you check your privacy clauses before using any third -party SDK service.", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38006, "text": "In order to protect your legitimate rights and interests, if you find that there are risks such as SDK or other similar applications, it is recommended that you immediately terminate related operations and contact us in time.", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38007, "text": "1.4, partner of information promotion and advertising: You confirm that our partners who have the right to share with information promotion and advertising sharing indirect user portraits, de -identification or anonymous analysis after the collection of your relevant information collection/ analysis/Statistical information (such as \"Twenty -generation men in Shanghai, like music\") and de -identified user equipment identification code to help them make advertising or decision -making suggestions, increase the effective touch rate of advertising, and further understand user needs.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "You confirm that we have the right to share the analysis/statistical information information after the indirect user portrait, de -identification or anonymous processing formed by the collection of relevant information collection with advertising partners."}
{"task": "rw_4.jsonl", "id": 38008, "text": "We promise: Without your consent, we will not share personal information that can recognize your identity with it.", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38009, "text": "2. Transfer", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38010, "text": "Except for your explicit consent, we will not transfer your personal information to any company, organization or individual.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Except for your explicit consent, we will not transfer your personal information to any company, organization or individual."}
{"task": "rw_4.jsonl", "id": 38011, "text": "If you need to transfer your personal information due to the situation of merging, acquisition or bankruptcy liquidation, we will tell you the name or name of the receiver and ask the receiver to continue to be subject to the privacy policy.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you need to transfer your personal information due to the situation of merging, acquisition or bankruptcy liquidation, we will inform the receiver's name or name and ask them to continue to be bound by the privacy policy."}
{"task": "rw_4.jsonl", "id": 38012, "text": "If the receiver changes the personal information processing purpose and method of processing agreed in the privacy policy, we will ask the receiver to re -obtain your authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If the receiver changes the personal information processing purpose and method of processing agreed in the privacy policy, we will ask the receiver to re -obtain your authorization consent."}
{"task": "rw_4.jsonl", "id": 38013, "text": "3. Public disclosure", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38014, "text": "Except for public disclosure or obtaining an accident in accordance with the provisions of laws and regulations, we will not disclose public information that you have not disclosed or unreasonably disclosed.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Except for public disclosure or obtaining an accident in accordance with the provisions of laws and regulations, we will not disclose public information that you have not disclosed or unreasonably disclosed."}
{"task": "rw_4.jsonl", "id": 38015, "text": "If you need to disclose your personal information publicly, we will conduct the impact assessment of personal information protection in advance, and adopt security measures and methods that meet the standards of the industry to protect your personal information security.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "If you need to disclose your personal information publicly, we will conduct the influence evaluation of personal information protection in advance and protect your personal information security."}
{"task": "rw_4.jsonl", "id": 38016, "text": "4. The exception of sharing, transfer, and public disclosure of your personal information", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38017, "text": "Please know that in accordance with the provisions of laws and regulations, in the following circumstances, sharing, transfer, and publicly disclose your personal information without requiring your authorization consent in advance:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "According to the provisions of laws and regulations, in the following circumstances, sharing, transfer, and publicly disclose your personal information without requiring your authorization consent in advance:"}
{"task": "rw_4.jsonl", "id": 38018, "text": "4.1, must be established and fulfilled the contract we signed with you;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to establish and fulfill the sharing, transfer or disclosure of the contract we signed with you, no authorization is required."}
{"task": "rw_4.jsonl", "id": 38019, "text": "4.2, in order to fulfill the statutory responsibility or statutory obligations such as national security, defense security, criminal investigation, prosecution, trial and judgment implementation with national security, national security, national defense security, criminal investigation, prosecution, trial and judgment implementation;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to fulfill the shared, transferred or disclosed by the statutory duties or the necessary sharing, transfer, or disclosure necessary for the statutory duty, no authorization is required."}
{"task": "rw_4.jsonl", "id": 38020, "text": "4.3, in order to deal with emergencies, or in urgent situations to protect the health and property safety of natural people;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to cope with emergencies, or in urgent situations to protect the health of natural people and the must -sharing, transfer or disclosure of property security, no authorization is required."}
{"task": "rw_4.jsonl", "id": 38021, "text": "4.4, implement news reports and supervision of public opinion for public interest, handle personal information within a reasonable range;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to implement news reports and supervision of public opinion, deal with personal information within a reasonable scope without authorization."}
{"task": "rw_4.jsonl", "id": 38022, "text": "4.5, handle personal information on your own or other legal disclosure within a reasonable range;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "To handle individuals' self -disclosure or other legitimate personal information within a reasonable scope, no authorization is required."}
{"task": "rw_4.jsonl", "id": 38023, "text": "4.6, other circumstances stipulated in laws and regulations.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The sharing or disclosure of other laws and regulations and other regulations does not need to be authorized."}
{"task": "rw_4.jsonl", "id": 38024, "text": "5. The right to manage personal information", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38025, "text": "We understand your attention to personal information and make every effort to ensure that you have the right to access, correct, delete, and withdraw authorization of your personal information, so that you have full ability to ensure your privacy and security.", "label": ["Important", "Edit/Control"], "rewrite": "We make sure you have the right to access, correct, delete, and withdraw authorization of your personal information."}
{"task": "rw_4.jsonl", "id": 38026, "text": "Your rights include:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38027, "text": "1. You have the right to access your personal information", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38028, "text": "You can check in accordance with the relevant instructions (or settings) of the product/service we provided to check the relevant personal information you have provided to us.", "label": ["Important", "Edit/Control"], "rewrite": "You can check in accordance with the relevant instructions (or settings) of the product/service we provided to check the relevant personal information you have provided to us."}
{"task": "rw_4.jsonl", "id": 38029, "text": "include:", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38030, "text": "1.1, account information: You can log in to your personal center at any time through the related product page to visit your personal information information in your account, including: avatar, nickname, UID, QR code business card, gender, birth month, personal signature, etc.Items", "label": ["Important", "Edit/Control"], "rewrite": "You can log in to your personal center at any time through the related product page to access your personal account information information in your account."}
{"task": "rw_4.jsonl", "id": 38031, "text": "1.2, use information: You can check your use information at any time through the related product page, including: dynamic release content, submission content, collection records, historical records, order information, address information, bill records, etc.;", "label": ["Edit/Control", "Important"], "rewrite": "You can check your use information at any time through the related product page."}
{"task": "rw_4.jsonl", "id": 38032, "text": "1.3, other information: If you encounter operating problems during the access process, you need to get other personal information content that cannot be known in the aforementioned foregoing. You can contact us through the method provided by this privacy policy.", "label": ["Edit/Control", "Important"], "rewrite": "You can contact us if you need to get other personal information content that can be known."}
{"task": "rw_4.jsonl", "id": 38033, "text": "2. You have the right to correct/modify your personal information", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38034, "text": "When you find that you have a registration error, incomplete or updated personal information you provide, you can correct/modify your personal information in our products/services.", "label": ["Edit/Control", "Important"], "rewrite": "When you find that you have a registration error, incomplete or updated personal information you provide, you can correct/modify your personal information in our products/services."}
{"task": "rw_4.jsonl", "id": 38035, "text": "The correction/modification path in the Bili iOS client is: Click the avatar-edit information.", "label": ["Important", "Edit/Control"], "rewrite": "For some of your personal information, you can directly correct/modify by the operation settings."}
{"task": "rw_4.jsonl", "id": 38036, "text": "2.2, for the difficulties you encountered in the process of exercising the above rights, or other may not be able to provide you with online correction/modification services, after verification of your identity, and correcting/modifying the objectivity and accuracy of the information does not affect the information of the informationIn the case of sex, you have the right to correct or modify the errors or incomplete information, or in specific circumstances, especially when the data error is wrong, your correction/modification application is submitted to the feedback and error reports that we publish it toWe ask us to correct or modify your data, but except for laws and regulations.", "label": ["Important", "Edit/Control"], "rewrite": "You have the right to correct or modify the error or incomplete information, or submit your correction/modification application to us through feedback and error reporting, asking us to correct or modify, except for laws and regulations."}
{"task": "rw_4.jsonl", "id": 38037, "text": "But for the consideration of security and identification, you may not be able to modify some initial registration information submitted during registration.", "label": ["Important", "Edit/Control"], "rewrite": "For the consideration of security and identity, you may not be able to modify some initial registration information submitted during registration."}
{"task": "rw_4.jsonl", "id": 38038, "text": "3. You have the right to delete your personal information", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38039, "text": "3.1, for some of your personal information, you can also actively delete your information through the functional pages of the related products/services we provided by yourself.", "label": ["Important", "Edit/Control"], "rewrite": "You can actively delete your information through the functional pages of the related products/service you provided by yourself."}
{"task": "rw_4.jsonl", "id": 38040, "text": "For example: The deletion path of the \"Historical Record\" information in the Bilibili IOS client is: Mine-Historical Record-Edit.", "label": ["Important", "Edit/Control"], "rewrite": "The deletion path of the \"Historical Record\" information in the Bilibili IOS client is: Mine-Historical Record-Edit."}
{"task": "rw_4.jsonl", "id": 38041, "text": "You can also delete your own video, dynamics, pictures, etc.", "label": ["Important", "Edit/Control"], "rewrite": "You can delete the videos, dynamics, pictures, etc. you posted independently."}
{"task": "rw_4.jsonl", "id": 38042, "text": "Once you delete, we will delete or processes such information, unless laws and regulations have other provisions.", "label": ["Edit/Control", "Data Security", "Important"], "rewrite": "Once you delete, we will delete or processes such information, unless laws and regulations have other provisions."}
{"task": "rw_4.jsonl", "id": 38043, "text": "3.2, when the following situation occurs, you can directly ask us to delete your personal information, but except for anonymous treatment or other regulations:", "label": ["Important", "Edit/Control"], "rewrite": "When the following situations occur, you can directly ask us to delete your personal information, but except for anonymous treatment or other provisions: (1) When our handling of personal information violates laws and regulations; (2)When we collect and use your personal information, but not obtained your consent; (3) When our behavior of handling personal information is violated with your agreed; (4) When you cancel the Bilibili account; (5) When we terminate our services and operations."}
{"task": "rw_4.jsonl", "id": 38044, "text": "(1) When our behavior of handling personal information violates laws and regulations;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38045, "text": "(2) When we collect and use your personal information, but not obtained your consent;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38046, "text": "(3) When our behavior of handling personal information is violated with your agreed;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38047, "text": "(4) When you cancel the Bilibili account;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38048, "text": "(5) When we terminate our services and operations.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38049, "text": "4. You have the right to withdraw your authorization of personal information", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38050, "text": "As mentioned earlier, some of the functions of the product/service provided by us need to obtain the relevant permissions of your equipment (including: location, camera, microphone, schedule arrangement, etc., which are specifically based on Article 3 of this privacy policy).", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38051, "text": "You can continue to authorize the permissions at any time after authorization.", "label": ["Edit/Control", "Important"], "rewrite": "You can continue to authorize permissions at any time after authorization."}
{"task": "rw_4.jsonl", "id": 38052, "text": "After you update the APP version, without your clear consent, we will not change the authority you set before.", "label": ["Important", "Edit/Control"], "rewrite": "After you update the APP version, without your clear consent, we will not change the authority you set before."}
{"task": "rw_4.jsonl", "id": 38053, "text": "For example, you can close your authorization of mobile phone albums by \"setting-privacy-photos\" in mobile devices.", "label": ["Important", "Edit/Control"], "rewrite": "You can close your authorization of mobile phone albums by \"setting-privacy-photo\" in mobile devices."}
{"task": "rw_4.jsonl", "id": 38054, "text": "You can also retreat us through the way to cancel your account. We will continue to collect all your personal information.", "label": ["Important", "Edit/Control"], "rewrite": "You can permanently withdraw all authorization by canceling the account."}
{"task": "rw_4.jsonl", "id": 38055, "text": "You need to understand that when you withdraw authorization, we cannot continue to provide you with a specific exercise product/service corresponding to the withdrawal authorization.", "label": ["Important", "Edit/Control"], "rewrite": "When you withdraw authorization, we cannot continue to provide you with a specific exercise product/service corresponding to the withdrawal authorization."}
{"task": "rw_4.jsonl", "id": 38056, "text": "But your decision to withdraw authorization will not affect personal information processing based on your authorization.", "label": ["Permission Acquisition", "Edit/Control", "Risk", "Important"], "rewrite": "Your decision to withdraw authorization will not affect personal information processing based on your authorization."}
{"task": "rw_4.jsonl", "id": 38057, "text": "5. You have the right to cancel your account", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38058, "text": "You can apply for a cancellation of your account through online application or customer service or other publicity methods.", "label": ["Important", "Edit/Control"], "rewrite": "You can apply for a cancellation of your account through online application or customer service or other publicity methods."}
{"task": "rw_4.jsonl", "id": 38059, "text": "When you log out the account, you will no longer log in and use our products and services with this account;", "label": ["Important", "Edit/Control"], "rewrite": "When you cancel your account, you will no longer log in and use this account."}
{"task": "rw_4.jsonl", "id": 38060, "text": "And this account will be cleared during the use of the rights and interests that has been generated during the use of Bilibili and other products and services.", "label": ["Important", "Edit/Control"], "rewrite": "After the cancellation, all the rights such as this account but not consumed and the future overdue interests will be cleared."}
{"task": "rw_4.jsonl", "id": 38061, "text": "The content, information, data, records, etc. under this account will be deleted or anonymous (but the laws and regulations have other regulations or other requirements, such as the \"Cyber Security Law of the People's Republic of China\", youThe network operation log will be kept at least six months);", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "The content, information, data, records, etc. under this account will be deleted or anonymous."}
{"task": "rw_4.jsonl", "id": 38062, "text": "After the cancellation of Bilibili account is completed, it will not be recovered.", "label": ["Important", "Edit/Control"], "rewrite": "After the account cancellation is complete, it will not be recovered."}
{"task": "rw_4.jsonl", "id": 38063, "text": "For more things about the cancellation of Bilibili account, please refer to the \"Account Logging out\".", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38064, "text": "If you still insist on deciding to cancel your Bilibili account after careful consideration, you can set the application page of the relevant function settings of our product/service you use or submit to us according to the operation guidance.The cancellation path is: \"My-Settings-Privacy Permanent Settings-Account Logging\".", "label": ["Important", "Edit/Control"], "rewrite": "The cancellation path is: \"My-Settings-Privacy Permanent Settings-Account Logging\"."}
{"task": "rw_4.jsonl", "id": 38065, "text": "We will reply to you within 15 working days after receiving your cancellation application and verifying your user identity.", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38066, "text": "If you have any questions when dealing with your personal information, you can communicate with us through the contact information of \"contact us\" through Article 10 of this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38067, "text": "6. About the use of cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38068, "text": "1. When you use our products/services, we may use Cookie and similar technologies to collect some of your personal information, including: your habit of visiting the website, your browsing information, your login information, cookies and similar technologiesCollect this type of information for your need for your product/service, simplify your repeated operation steps (such as registration, login), facilitate your viewing history (such as video viewing history), and provide you with more in lineThe content of the service is more interested in what you may be more interested in, protect your information and account security, and improve our product/service.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may use cookies and similar technologies to collect some of your personal information to simplify your operation and facilitate your use."}
{"task": "rw_4.jsonl", "id": 38069, "text": "2. If you refuse us to collect and use your relevant information with Cookie and similar technologies, you can use your browser to manage, (part/all) to reject Cookie and reject Cookie and (part/all) on the premise of the browser./Or similar technology;", "label": ["Edit/Control", "Important"], "rewrite": "You can reject Cookie and/or similar technologies through the settings of your browser."}
{"task": "rw_4.jsonl", "id": 38070, "text": "Or delete Cookie and/or similar technologies that have been stored in your computer, mobile devices or other devices, so as to achieve all or partially tracking your personal information.", "label": ["Edit/Control", "First Party Collection Information"], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38071, "text": "If you need to learn more about how to change the browser settings in detail, please check the relevant setting page of your browser you use.", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38072, "text": "You understand and know: some of our products/services can only be achieved by using cookies or similar technologies. If you refuse to use or delete, you may not be able to use our related products/services or through our unable to pass our related products or cannot pass us through ourThe product/service obtains the best service experience, and it may also affect your information protection and account security.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38073, "text": "7. We store and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38074, "text": "1. Information storage", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38075, "text": "1.1, storage location: In accordance with the provisions of laws and regulations, we will only store the collected personal information in the territory of the People's Republic of China.", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in domestic operations will be stored in China."}
{"task": "rw_4.jsonl", "id": 38076, "text": "At present, we do not have a scenario that stores your personal information or provide personal information overseas for the time being.", "label": ["Data Retention", "Important"], "rewrite": "At present, we do not have a scenario that stores your personal information or provide personal information overseas for the time being."}
{"task": "rw_4.jsonl", "id": 38077, "text": "If it is really necessary to perform cross -border transmission of data, we will clearly notify you alone (including the purpose of data outbound, receiving, use method and scope, use content, security guarantee measures, security risks, etc.), and obtain yourWith the consent of authorization, we will ensure that the data receiver has sufficient data protection capabilities to protect your personal information.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "If it is necessary to conduct data cross -border transmission, we will clearly inform you alone and obtain your authorization consent to ensure that the data receiver has sufficient data protection capabilities to protect your personal information."}
{"task": "rw_4.jsonl", "id": 38078, "text": "When you provide it and during your function, we need to continue to save your mobile phone number to provide you with the function and ensure your account and system security normally.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "Keep your personal information within the time limit required to achieve service purposes."}
{"task": "rw_4.jsonl", "id": 38079, "text": "In addition, we may preserve the necessary periods stipulated by your relevant information (for example, the E -commerce Law stipulates that the time for the saving time of goods and service information and transaction information is not less than three years from the date of the transaction).", "label": ["Data Retention", "Important"], "rewrite": "We may preserve your relevant information to the necessary period stipulated by relevant laws."}
{"task": "rw_4.jsonl", "id": 38080, "text": "1.3, after exceeding the above storage period, we will delete or processes your personal information.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "After exceeding the storage period, we will delete or processes your personal information."}
{"task": "rw_4.jsonl", "id": 38081, "text": "2. Information protection", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38082, "text": "2.1 Your personal information security is critical to us.", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38083, "text": "We will strictly abide by relevant laws and regulations and take reasonable and feasible measures recognized in the industry to protect your personal information.", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38084, "text": "Prevent information from unauthorized access, disclosure, use, and modification to avoid damage or loss of information.", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38085, "text": "2.2, security technical measures: We use security protection measures that meet the industry standards to protect your personal information, prevent data from being interviewed, publicly disclosed, used, and modified, and data prevent data from damage or loss.", "label": ["Important", "Data Security"], "rewrite": "We use security measures that meet industry standards to protect your personal information."}
{"task": "rw_4.jsonl", "id": 38086, "text": "We will take all reasonable and feasible measures to protect your personal information, such as using SSL to encrypt data.", "label": ["Important", "Data Security"], "rewrite": "We will take all reasonable and feasible measures such as SSL to protect your personal information."}
{"task": "rw_4.jsonl", "id": 38087, "text": "2.3 Management System: We have established a special information security department and formulated a security management system and a proper security accident early warning mechanism and emergency plan.", "label": ["Important", "Data Security"], "rewrite": "We set up a special information security department and formulated a security management system and a proper safety accident early warning mechanism and emergency plan."}
{"task": "rw_4.jsonl", "id": 38088, "text": "By establishing an access control mechanism, we can ensure that only authorized personnel can access personal information;", "label": ["Important", "Data Security"], "rewrite": "By establishing an access control mechanism, we ensure that only authorized personnel can access personal information."}
{"task": "rw_4.jsonl", "id": 38089, "text": "From time to time, we organize safety and privacy protection training courses to strengthen employees' awareness of protecting the importance of personal information.", "label": ["Important", "Data Security"], "rewrite": "From time to time, we organize safety and privacy protection training courses to strengthen employees' awareness of protecting the importance of personal information."}
{"task": "rw_4.jsonl", "id": 38090, "text": "Once a personal information security incident occurs, we will inform you in a timely manner in accordance with the requirements of the laws and regulations: the basic situation and possible impact of the security incident, the disposal measures we have taken or we are going to take, the suggestions and suggestions and suggestions for reducing the risk of autonomy and reducing risksThe emergency plan for your remedy and immediately start the emergency plan to minimize the loss.", "label": ["Important", "Data Security"], "rewrite": "If a personal information security incident occurs, we will inform your basic situation, possible impact, disposal measures, independent prevention suggestions, etc."}
{"task": "rw_4.jsonl", "id": 38091, "text": "We will inform you of the incident -related situation in time by telephone, push notification.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38092, "text": "At the same time, we also set up a Bilibili Safety Emergency response center (https://security.bilibili.com). It is maintained by a professional security technology and operation team to facilitate timely and effective response, dispose of various security vulnerabilities and emergenciesIn the event, the relevant departments carried out the source of safety incidents and strikes.", "label": ["Important", "Data Security"], "rewrite": "We also set up a Bilibili Safety Emergency response center, which is responsible for maintenance by a professional security technology and operating team."}
{"task": "rw_4.jsonl", "id": 38093, "text": "Security reminder: Although the above reasonable and effective measures have been taken, and the standards of relevant laws and regulations have been adopted, please understand that due to the technical restrictions and various malicious means of malicious means, we cannot always guarantee that the information is 100 % security, but but but the information is 100 % secure, but it is 100 % security, but it is 100 % security, but it is 100 % security, but it is 100 % security. HoweverWe will do our best to provide security measures to ensure the security of your personal information provided by us.", "label": ["Important", "Data Security"], "rewrite": "Although there are security measures, it is impossible to fully guarantee that there is no security problem."}
{"task": "rw_4.jsonl", "id": 38094, "text": "You know and understand that the system and communication network you use to access our services may occur security issues outside the control scope.", "label": ["Important", "Data Security"], "rewrite": "Systems and communication networks may have problems due to unprepared factors."}
{"task": "rw_4.jsonl", "id": 38095, "text": "Therefore, we strongly recommend that you take positive measures to protect the security of personal information, including but not limited to the use of complex passwords, regularly modify the password, do not disclose your account password and related personal information to others.", "label": ["Important", "Data Security"], "rewrite": "It is recommended that you take positive measures to protect the security of personal information."}
{"task": "rw_4.jsonl", "id": 38096, "text": "If you leave Bilibili and go to the browsing page or other products/services provided by a third party, we will not be able to protect any personal information submitted to the third party, whether you log in, browse or use the above products or services.Whether it is based on the link or guidance of Bilibili.", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38097, "text": "But we will prompt you to pay attention to entering third -party products or services so that you can better protect your personal information.", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38098, "text": "8. Our personal information for the personal information of minors", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38099, "text": "1. Minors should obtain the consent of their guardians before using our products/services.", "label": ["Specific Audiences", "Important"], "rewrite": "Minors should obtain the consent of their guardians before using our products/services."}
{"task": "rw_4.jsonl", "id": 38100, "text": "If you are a minor, before using our products/services, you should jointly read this privacy policy under the guardian monitoring and guidance and the \"Guidelines for the Protection of Personal Information Protection of the Bilibili Minor\" andUse our products/services and submit personal information.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a minor, we should use our products/services and submit personal information under the guardian's clear consent and guidance."}
{"task": "rw_4.jsonl", "id": 38101, "text": "In accordance with the provisions of relevant national laws and regulations, the personal information of minors will only collect, use, or publicly disclose personal information of minors with the permission of laws and regulations, the guardian clearly agree or protect your rights and interests.", "label": ["Specific Audiences", "Important"], "rewrite": "We will only collect, use, or publicly disclose personal information of minors when laws and regulations are allowed, guardians to clearly agree or protect your rights and interests."}
{"task": "rw_4.jsonl", "id": 38102, "text": "2. If you are the guardian of minors, when you have any questions about the personal information of the minors you monitor, you can use the contact information of the \"contact us\" in Article 10 of this privacy policy.Communication solution.", "label": ["Specific Audiences", "Important"], "rewrite": "If you have any questions about the personal information of the minors you monitor, you can contact us to communicate and solve it."}
{"task": "rw_4.jsonl", "id": 38103, "text": "If we find the personal information of minors without obtaining the consent of the guardian in advance, the relevant data will be deleted as soon as possible.", "label": ["Specific Audiences", "Important"], "rewrite": "If the personal information of minors was collected without the consent of the legal guardian, he would try to delete relevant information as soon as possible."}
{"task": "rw_4.jsonl", "id": 38104, "text": "Nine, the protection of the personal information of the dead users", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38105, "text": "1. Bilibili will protect the personal information of the deceased in accordance with the relevant provisions of the Personal Information Protection Law.", "label": ["Specific Audiences", "Important"], "rewrite": "Bilibili will protect personal information of the deceased in accordance with the relevant provisions of the Personal Information Protection Law."}
{"task": "rw_4.jsonl", "id": 38106, "text": "After the death of Bilibili (only natural person), its close relatives can exercise the relevant personal information of the relevant personal information of the dead users through the contact information of \"contact us\" through Article 10 of the Privacy Policy in Article 10 of the Privacy Policy.Review, copy, correct, delete the rights, but except for other arrangements during their lifetime.", "label": ["Specific Audiences", "Important"], "rewrite": "For the close relatives of the dead users, for their own legal and legitimate interests, they can exercise the rights of personal information of the dead users to review, copy, correct, delete, etc., except for other arrangements during their lifetime."}
{"task": "rw_4.jsonl", "id": 38107, "text": "2., you understand and confirm that in order to fully protect the personal information rights and interests of the dead users, the close relatives who apply for exercise of the rights of this article need to submit the identity document and death certificate of the dead user according to the specified process or customer service prompts of Bilibili.The document of the document, the applicant's identity document, the proof of the relative relationship of the applicant and the dead user, and provide the types and purpose of the right to exercise.", "label": ["Specific Audiences", "Important"], "rewrite": "A close relatives who apply to exercise the rights of this article need to submit the identity document, death certificate document, the identity document of the applicant, the applicant's identity document, the relative relationship document of the applicant and the dead user, and provide the types and purposes of the right to exercise."}
{"task": "rw_4.jsonl", "id": 38108, "text": "For more personal information protection processes, conditions and other matters of the dead users, please refer to \"Help Center\".", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38109, "text": "10. Contact us", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38110, "text": "1. If you have any questions or consultation or complaints when you have any questions related to privacy protection when using the content of this \"Bilibili Privacy Policy\" or using our service.get in touch:", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38111, "text": "1.1 You can find the functional page of the product/service page on our platform to contact the online customer service to contact it or submit feedback online;", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38112, "text": "1.2, you can send emails to us to contact us with help@bilibili.com customer service mailbox;", "label": ["Important", "Contact Information"], "rewrite": "Customer service mailbox: help@bilibili.com."}
{"task": "rw_4.jsonl", "id": 38113, "text": "1.3, you can write to: Building 3, Guozheng Center, No. 485, Zhengli Road, Yangpu District, Shanghai, Ministry of Legal Affairs (closed);", "label": ["Important", "Contact Information"], "rewrite": "Write letters: Ministry of Law, Building 3, No. 485, Zhengli Road, Yangpu District, Shanghai (received);"}
{"task": "rw_4.jsonl", "id": 38114, "text": "Postal code: 200082.", "label": ["Important", "Contact Information"], "rewrite": "Postal code: 200082."}
{"task": "rw_4.jsonl", "id": 38115, "text": "2. After receiving your opinions and suggestions, we will reply to you as soon as possible within 15 working days after verifying your user identity.", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38116, "text": "In addition, you understand and know that in the following situations related to personal information, we will not be able to reply to your request:", "label": ["Edit/Control", "Important"], "rewrite": "In the following situations related to personal information, we will not be able to reply to your request:"}
{"task": "rw_4.jsonl", "id": 38117, "text": "2.1, related to national security and national defense security;", "label": ["Edit/Control", "Important"], "rewrite": "If your request is directly related to national security and national defense security, you may not be responded."}
{"task": "rw_4.jsonl", "id": 38118, "text": "2.2, related to public safety, public health, and major public interests;", "label": ["Important", "Edit/Control"], "rewrite": "Your request is directly related to public safety, public health, and major public interests and may not be responded."}
{"task": "rw_4.jsonl", "id": 38119, "text": "2.3, related to criminal investigation, prosecution, and trial;", "label": ["Important", "Edit/Control"], "rewrite": "Your request is related to criminal investigation, prosecution, and trial, and may not be responded."}
{"task": "rw_4.jsonl", "id": 38120, "text": "2.4, there is sufficient evidence that you have subjective malice or abuse of rights;", "label": ["Edit/Control", "Important"], "rewrite": "We have sufficient evidence that if you have subjective malice or abuse of rights, you may not be able to respond to the request."}
{"task": "rw_4.jsonl", "id": 38121, "text": "2.5, responding to your request will cause the legitimate rights and interests of you or other individuals and organizations to be seriously damaged;", "label": ["Important", "Edit/Control"], "rewrite": "We may not be able to respond to requests that exceed the storage range, exceed the reasonable limit, or the legitimate rights and interests of personal information subjects or other individuals and organizations will be seriously damaged."}
{"task": "rw_4.jsonl", "id": 38122, "text": "2.6, involved business secrets;", "label": ["Important", "Edit/Control"], "rewrite": "We may not be able to respond."}
{"task": "rw_4.jsonl", "id": 38123, "text": "2.7, other circumstances stipulated in laws and regulations.", "label": ["Important", "Edit/Control"], "rewrite": "Other irresponsible circumstances stipulated in laws and regulations and other regulations."}
{"task": "rw_4.jsonl", "id": 38124, "text": "11. How to update this policy", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38125, "text": "1. In order to provide you with better services, we will update the terms of the \"Privacy Policy\" according to the product update and the relevant requirements of laws and regulations, which constitute a part of the \"Privacy Policy\".", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38126, "text": "Without your clear consent, we will not reduce the rights you should enjoy in accordance with this policy.", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38127, "text": "We will prompt or send you a message to you in a significant position or send a message to you or in other ways before the updated privacy policy takes effect. Will ask your consent again.", "label": ["Policy Change", "Important"], "rewrite": "We will notify you before the updated privacy policy takes effect. If such updates have caused the substantial reduction or major change of your rights, we will ask your consent again."}
{"task": "rw_4.jsonl", "id": 38128, "text": "2. Major changes include but not limited to:", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38129, "text": "2.1 Our service model has changed significantly.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38130, "text": "Such as the purpose of handling personal information, the type of personal information, the use of personal information, etc.;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38131, "text": "2.2 We have undergone major changes in the aspects of ownership structure and organizational structure.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38132, "text": "Such as changes caused by business adjustments, bankruptcy mergers and acquisitions, etc.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38133, "text": "2.3 The main objects of personal information sharing, transfer or public disclosure have changed;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38134, "text": "2.4 The right to participate in personal information processing and its exercise methods have changed significantly;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38135, "text": "2.5 We are responsible for handling the responsibility departments, contact methods and complaint channels for handling personal information security;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38136, "text": "2.6 Personal information security impact assessment report shows that there is a high risk.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38137, "text": "Twelve, dispute resolution", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38138, "text": "1. The interpretation and dispute resolution of this privacy policy shall apply the laws of the People's Republic of China.", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38139, "text": "Any controversy caused by our privacy policy and our personal information, you agree with the Shanghai Arbitration Commission for arbitration solution;", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38140, "text": "The end of the arbitration is legal binding on both sides.", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38141, "text": "2. If you think that our handling of personal information has harm your legitimate rights and interests, you can also choose to report it to the relevant government departments.", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38142, "text": "3. The title of this privacy policy is only for convenience and reading, and it does not affect any of the meaning or explanations of any provisions of the text.", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38143, "text": "Thirteen, term explanation", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38144, "text": "Unless there is another agreement, the term used in this privacy policy usually has the following definitions:", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38145, "text": "1. Personal information (from the \"Personal Information Protection Law\"): It refers to the various information related to the recognized or recognizable natural person recorded in electronics or other methods, excluding information after anonymous processing.", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38146, "text": "2. Sensitive personal information (from the \"Personal Information Protection Law\"): It refers to personal information that can easily lead to the personality and dignity of natural people once leaked or illegally used, which is harmful to the personality and property security of natural people, including biometrics, religious beliefs, and religious beliefs.Specific identity, medical health, financial accounts, trajectory and other information, as well as personal information of minors under the age of 14.", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38147, "text": "3. Equipment information: usually includes device name, device model, hardware serial number, MAC address, device logo informationSoftware feature information, operating systems and application versions, language settings, resolution, service provider network ID (PLMN), IP address, browser types such as operating systems and application versions, language settings, resolution, resolution, resolution, resolution, resolution, resolution, resolution, resolution, resolution, resolution, resolution, resolution, resolution, resolution, resolution, resolution, resolution, service provider network ID (PLMN).", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38148, "text": "4. SSL: SSL (Secure Socket Layer), also known as convergence, is a security protocol implemented on the transmission communication protocol (TCP/IP).", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38149, "text": "SSL supports various types of networks, and also provides three basic security services. Both use public key and symmetrical key technology to achieve the effect of information confidentiality.", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38150, "text": "5. Cookie: Cookie is a small file containing string. When you log in and use your website or other network content, you send and store in your computer, mobile device or other devices (usually encrypted).", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38151, "text": "Similar cookies are other technologies that can be used as similar to cookies, such as: Web Beacon, Proxy, embedded script, etc.", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38152, "text": "6. Anonymous: It refers to the process that the subject of personal information cannot be recognized or associated by the technical processing of personal information, and the processing information cannot be restored.", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38153, "text": "7. Devision: It refers to the process of processing or associated with personal information subjects without using additional information through technical processing of personal information.", "label": [], "rewrite": []}
{"task": "rw_4.jsonl", "id": 38154, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
