{"task": "rw_49.jsonl", "id": 53556, "text": "Han Station Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53557, "text": "Update date: July 4, 2022", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53558, "text": "Effective date: July 4, 2022", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53559, "text": "Version update prompt", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53560, "text": "Thank you for using the Korean station!", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53561, "text": "This time, the Korean station (hereinafter referred to as \"we\") has updated some content in accordance with the \"Cyber Security Law of the People's Republic of China\", \"GB/T 35273-2017), and other related laws and regulations and technical specifications.It mainly includes the following content: the interpretation of the words of the \"Privacy Policy of the Korean Station\", how we collect and use your personal information, how we share, transfer, and publicly disclose your personal information.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53562, "text": "Please read and fully understand the full text before using/continue to use the Korean station's products and/or service, and use/continue to use after agreeing with all the content.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53563, "text": "preface", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53564, "text": "Han Station (also known as \"we\") knows the importance of personal information to you, so we attach great importance to protecting your privacy and personal information.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53565, "text": "We hope to clearly introduce you how to handle your personal information and the service of your product and/or service, and what we provide for you when using our product and/or service through this \"this policy\")Manage and protect this way.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53566, "text": "Involving the terms of major relationships with your rights (possibilities) in this policy and the processing of sensitive personal information, we have reminded you to read in the font bold, down or other reasonable ways.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53567, "text": "Please read this \"Korean Station Privacy Policy\" (especially the contents of the font and the lower lines) before registering, logging in and using our service) and fully understand all the content of this privacy policy:", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53568, "text": "You agree that the privacy policy only means that you have understood the functions provided by the application and the required personal information required for functional operation. It does not mean that you have agreed that we can collect non -required personal information. Non -required personal information will be authorized according to your authorization process.Solo your consent alone.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53569, "text": "The corresponding equipment permissions will not be turned on by default. When important or sensitive equipment permissions are involved, we will open another pop -up window when you use the corresponding business functions.", "label": ["Permission Acquisition", "Important"], "rewrite": "The corresponding equipment permissions will not be turned on by default. When an important or sensitive equipment permissions involved, the pop -up will be launched again and will be opened again."}
{"task": "rw_49.jsonl", "id": 53570, "text": "After the authority is turned on, you can also set off the permissions at any time through the device;", "label": ["Important", "Edit/Control"], "rewrite": "After the authority is turned on, you can also set off the permissions at any time."}
{"task": "rw_49.jsonl", "id": 53571, "text": "If you do not agree to open permissions, it will not affect the normal use of other non -related business functions.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you do not agree to open permissions, it will not affect the normal use of other non -related business functions."}
{"task": "rw_49.jsonl", "id": 53572, "text": "In response to personal sensitive information, we will get your consent separately.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "We will get personal sensitive information after your consent."}
{"task": "rw_49.jsonl", "id": 53573, "text": "If you refuse to this \"Privacy Policy\", you can still use the basic functions such as browsing, searching, and playback without registration/login.", "label": ["Policy Change", "Important"], "rewrite": "If you refuse the \"Privacy Policy\", you can still use basic functions such as browsing, searching, and playback without registration/login."}
{"task": "rw_49.jsonl", "id": 53574, "text": "You can also be authorized separately in the subsequent service process.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53575, "text": "Please note that if you use the Korean station service by using third -party products and/or services (such as third -party accounts), your information should also apply the third -party privacy policy.", "label": ["Important"], "rewrite": "If the Korean station service is used by using third -party products and/or services (such as third -party accounts), the third -party privacy policy should also be applied."}
{"task": "rw_49.jsonl", "id": 53576, "text": "about Us", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53577, "text": "Han Station is an Internet service provided by Chongqing Baoyun Technology Co., Ltd. and its affiliated companies.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53578, "text": "● related companies refer to companies and institutions under the control of Chongqing Baoyun Technology Co., Ltd., under the control of Chongqing Baoyun Technology Co., Ltd., under the control of Chongqing Baoyun Technology Co., Ltd. or Chongqing Baoyun Technology Co., Ltd.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53579, "text": "Control refers to the ability to directly or indirectly affected the controlled management/operation of the controlled objects directly or indirectly through ownership, contract, actual operation association, or other methods identified in accordance with the law.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53580, "text": "● The basic situation of our main operating companies is as follows: Chongqing Baoyun Technology Co., Ltd., established in May 2021, registered address/common office address: No. 3, No. 3, No. 3, No. 3, No. 2, No. 2, Yangjiang Road, Tianmen Street, Yuzhong District, ChongqingEssence", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53581, "text": "● If you want to learn more about our company and platform in detail, you can contact us through the contact information provided by this policy.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53582, "text": "This \"Korean Privacy Policy\" will help you understand the following", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53583, "text": "1. The scope of the \"Korean Privacy Policy\" and the meaning of related words", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53584, "text": "2. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53585, "text": "3. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53586, "text": "4. How do we share, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53587, "text": "5. The control of your personal information", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53588, "text": "6. How do we store and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53589, "text": "7. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53590, "text": "8. Update of \"Korean Privacy Policy\"", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53591, "text": "Nine, how to contact us", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53592, "text": "Ten, others", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53593, "text": "1. The scope of the \"Korean Privacy Policy\" and the meaning of related words", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53594, "text": "(1) Scope of application of \"Korean Privacy Policy\"", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53595, "text": "This \"Han Station Privacy Policy\" is a uniform content suitable for all our products and/or services. When you use any of our products and/or services, this \"Korean Privacy Policy\" is applicable, but if the product and the/Or if the service is set separately, the privacy clause/privacy agreement, the separate privacy terms/privacy agreements are preferred;", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53596, "text": "The content of the privacy clause/privacy agreement is not mentioned, and this policy is applicable.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53597, "text": "But please note that this \"Korean Privacy Policy\" is not applicable to the following situations:", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53598, "text": "● Provide third -party information collection/processing practices for our products and/or services;", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53599, "text": "● Our products and/or services may include information and/or third -party services provided by third parties (including any third -party applications, websites, products, services, etc.).Operation, your use of this information is not related to/or service.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53600, "text": "We will remind you here that when you use third -party information and/or services, you should pay attention to and carefully read the relevant user agreements and privacy policies you show in the third direction, and provide your personal information properly and carefully.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53601, "text": "This \"Korean Privacy Policy\" is only applicable to your personal information we collected, and it is not applicable to the collection of your personal information of any third party, as well as any third -party service or third -party information use rules. WeThe behavior of your personal information collected, stored, and used in any third party is not responsible for the scope of the law;", "label": ["Important", "First Party Collection Information"], "rewrite": "We do not take any responsibility for any third -party collection, storage, and use of your personal information within the scope of legal permission."}
{"task": "rw_49.jsonl", "id": 53602, "text": "● The products and/or service content provided by other non -Korean stations to you.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53603, "text": "(2) Related word meaning", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53604, "text": "● Personal information (from GB/T 35273-2020 \"Information Security Technology Personal Information Security Specification\"): refersVarious information.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53605, "text": "The personal information involved in this privacy policy includes the basic information of natural persons (including personal name, birthday, gender, address, personal phone number, email address address), personal identity information (including ID number), personal biometric information (including fingerprints (including fingerprints), Facial features), network identity identification information (including system accounts, IP addresses, personal digital certificates, etc.), personal property information (including bank accounts, passwords, transactions and consumption records, virtual currency, virtual transactions, exchange codes and other virtual property informationThe only device recognition code), personal location information (including the general geographical location and accurate positioning information).", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53606, "text": "The following texts we actually collected are described below.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53607, "text": "● Personal sensitive information (from GB/T 35273-2020 \"Information Security Technology Personal Information Security Specification\"): It means that once it is leaked, illegally provided or abused may endanger people's body and property, it is easyOr personal information of discriminatory treatment.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53608, "text": "Personal sensitive information involved in this privacy policy includes your personal property information, personal identity information, personal biometric information, network identity information, address book information, accurate positioning information, and receiving address.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53609, "text": "The description of the personal sensitive information of personal sensitive information we actually collected is subject to.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53610, "text": "● Equipment: refers to devices that can be used to access our products and/or services, such as desktop computers, laptops, tablets, or smartphones.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53611, "text": "● The only device recognition code (exclusive ID or UUID): refers to a string of characters compiled by the device manufacturer into the device, which can be used to identify the corresponding devices in the unique way (such as IMEI/Android ID/idfa/Openudid/Guid/SIM card IMSI information, etc.).", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53612, "text": "The only device recognition code has a variety of uses, which can be used to provide advertisements when COOKIE (such as in mobile applications).", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53613, "text": "● IP address: Each internet device will specify a number, called the Internet protocol (IP) address.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53614, "text": "These numbers are usually specified according to geographical areas.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53615, "text": "IP addresses can usually be used to identify the location where device is connected to the Internet.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53616, "text": "● SSL: SSL (Secure Socket Layer), also known as convergence, is a security protocol implemented on the transmission communication protocol (TCP/IP).", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53617, "text": "SSL supports various types of networks, and also provides three basic security services. Both use public key and symmetrical key technology to achieve the effect of information confidentiality.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53618, "text": "● Cookie: Cookie is a small file containing string. When you log in and use your website or other network content, you will send and store in your computer, mobile device or other devices (usually encrypted).", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53619, "text": "Similar cookies are other technologies that can be used as similar to cookies, such as: Web Beacon, Proxy, embedded script, etc.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53620, "text": "● Account: When you register your account and provide us with some personal information, you can better use our service.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53621, "text": "When you visit the Korean station, the system will use these account information to verify your identity to prevent unauthorized personnel from accessing your account.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53622, "text": "● Anonymous: It refers to the process that the subject of personal information cannot be recognized or associated by the technical processing of personal information, and the processing information cannot be restored.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53623, "text": "● Devitization: It refers to the process of processing or associating personal information subjects without using additional information through technical processing of personal information.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53624, "text": "● Server log: Usually, our server will automatically record the web request you emitted when visiting the website.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53625, "text": "These \"server logs\" usually include your network request, Internet protocol address, browser type, browser language, date and time of request, and one or more cookies that can recognize your browser.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53626, "text": "2. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53627, "text": "When you use our products and/or services, we need/may need to collect and use some of your personal information. The types of personal information we collect and use include two types: the first: our product and/or serviceInformation necessary for core business functions: This kind of information is a necessary information for products and/or services. You must authorize us to collect it.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53628, "text": "If you refuse to provide, you will not be able to use our products and/or services normally;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53629, "text": "The second: additional business functions may need to be collected: This information is the information required for non -core business functions. You can choose whether to authorize us to collect it.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53630, "text": "If you refuse to provide it, it will cause additional business functions to be unable to achieve or achieve the effect we intend to achieve, but it will not affect your normal use of core business functions.", "label": ["First Party Collection Information", "Risk"], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53631, "text": "We need to remind you in particular: Because we have a lot of products and services, the content provided for you is different, so core business functions (including the type of personal information it collected) will also be due to different contents of the product/service contentThere is something different, and the specific product/service is prevailing.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53632, "text": "In addition, you understand and agree, and we hope that the products and services that you provide to you are perfect, so we will continue to improve our products and services, including technology, which means that we may often launch new business functions.It may be necessary to collect new personal information or change the purpose or method of using personal information.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53633, "text": "If a function or product/service that needs to collect your personal information is not explained in this \"Korean Privacy Policy\", we will use the update of this policy, system prompts, pop -ups, announcements, and in -site letters.You explain the purpose, content, usage and scope of the collection of the information, and provide you with the way you choose to consent, and collect it after obtaining your consent.", "label": ["Important", "First Party Collection Information"], "rewrite": "If a function or product/service that needs to collect your personal information is not described, we will explain to you one another to explain the purpose, content, usage method, and scope of the information collection, and provide you with the way you choose your own consent, and and the way you choose to choose your consent, and and the way you choose your own consent, and it will beCollect your consent after obtaining your consent."}
{"task": "rw_49.jsonl", "id": 53634, "text": "In the process, if you have any doubts about related matters, you can contact us through the way provided by the end of the text, and we will answer it as soon as possible.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53635, "text": "Specific business function scenarios include:", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53636, "text": "(1) Registration and login function", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53637, "text": "(1) The range of required information, non -necessary information:", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53638, "text": "● Registration/login: When you register and log in to our products and/or services, in order to help you successfully complete the registration/login process, you need to provide us with your mobile phone number.", "label": ["Important", "First Party Collection Information"], "rewrite": "To help you complete the registration/login process, you need to provide us with your mobile phone number."}
{"task": "rw_49.jsonl", "id": 53639, "text": "Collecting the aforementioned information is to meet the real -name system requirements of relevant laws and regulations. Only by providing real and accurate above information can you successfully register and use the core functions of products and/or services.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53640, "text": "If you choose not to provide the above necessary information to achieve the functional function of the core product, or it will cause us to be unable to provide you with the function of this core product.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you choose not to provide the above necessary information, it will cause us to be unable to provide you with the core product function."}
{"task": "rw_49.jsonl", "id": 53641, "text": "If you refuse to provide a mobile phone number for verification, it will lead to the failure of registration/login, but it does not affect your viewing, searching, and playback functions that use video.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide a mobile phone number for verification, it will lead to the failure of registration/login, but it does not affect your viewing, searching, and playback functions that use video."}
{"task": "rw_49.jsonl", "id": 53642, "text": "● One -click login: Based on our cooperation with communication operators, when you use and \"one -click login\" function, after your consent, the operator will send us your mobile phone numberServe.", "label": ["Important", "First Party Collection Information"], "rewrite": "After your consent, the operator will send us your mobile phone number to us, so that we can provide you with a fast login service."}
{"task": "rw_49.jsonl", "id": 53643, "text": "● Authorized login: Our product supports you to log in with the account number of the third -party platform (Weibo account/QQ account/WeChat account). If you log in with the account of the third -party platformRelated information (including: user ID, nickname, avatar) and identity verification information (personal sensitive information).", "label": ["Important", "First Party Collection Information"], "rewrite": "If you log in with a third -party platform account, we will obtain relevant information (including: user ID, nickname, avatar) and authentication information (personal sensitive information) under your authorization based on your authorization."}
{"task": "rw_49.jsonl", "id": 53644, "text": "We promise that collecting the above information is used to provide you with account login service and ensure your account security and prevent security risks.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53645, "text": "Such information is a necessary information about this function. If you refuse to authorize such information, you will not be able to log in to our platform with an account on the third -party platform, but it will not affect the use of mobile phone numbers to log in normally.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If you refuse to authorize such information, you will not be able to log in to our platform with an account on the third -party platform, but it will not affect the use of mobile phone numbers to log in to normal use."}
{"task": "rw_49.jsonl", "id": 53646, "text": "● Data maintenance: You can choose to fill in your gender, nickname, avatar, birthday, brief introduction information, which will help us provide you with a better product experience.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can choose to fill in your gender, nickname, avatar, birthday, and profile information, which will help us provide you with a better product experience."}
{"task": "rw_49.jsonl", "id": 53647, "text": "Such information is non -essential information. If you fail to fill in, it does not affect your functions of using our products and/or services.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53648, "text": "(2) The sensitive permissions of the call:", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53649, "text": "● When you use the code scan login function, we will ask you to authorize the camera permissions to complete the QR code scanning the code smoothly.", "label": ["Permission Acquisition", "Important"], "rewrite": "When using the code scanning function, we will ask you to authorize the camera authority to complete the QR code scanning code smoothly."}
{"task": "rw_49.jsonl", "id": 53650, "text": "This permissions are non -essential permissions. When you use the specific functional point, you will be triggered. If you refuse the relevant system permissions, you will not be able to log in with the code scanning, but it will not affect your login in other ways.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53651, "text": "● When you are upload/replace your avatars in data maintenance, we will ask your camera and album permissions and collect the picture information you upload/replacement.", "label": ["Permission Acquisition", "Important"], "rewrite": "When the data maintenance upload/replace the avatar, we will ask your camera, album permissions, and collect the picture information you upload/replacement."}
{"task": "rw_49.jsonl", "id": 53652, "text": "(3) The third -party SDK used:", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53653, "text": "When you log in with one -click login, Alibaba Cloud Number Authentication SDK, China Mobile SDK, China Unicom SDK, China Telecom SDK, you need to collect the above network information, mask of the current mobile phone number, device logo, operator information, network information, and network information.To achieve one -click login function.", "label": ["Important", "First Party Collection Information"], "rewrite": "Alibaba Cloud Number Certification SDK, China Mobile SDK, China Unicom SDK, China Telecom SDK, need to collect the above network information, mask of the current mobile phone number, device identifier, operator information, and network information to achieve one -click login function."}
{"task": "rw_49.jsonl", "id": 53654, "text": "(2) Video display/play/download", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53655, "text": "(1) The range of required information, non -necessary information:", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53656, "text": "Our products or services provide you with video display and playback services. In the process, we need to collect some of your information (including in the background state), including the following personal information: device model, equipment name, operating system and applicationProgram version, login IP address, access network method, network quality data, mobile network information, product version number, network log information (operation log, service log).", "label": ["Important", "First Party Collection Information"], "rewrite": "Video display and playback services need to be collected (including collected in the background state), including the following personal information: device model, device name, operating system and application version, login IP address, access to network, network quality, quality of network qualityData, mobile network information, product version number, network log information (operation log, service log)."}
{"task": "rw_49.jsonl", "id": 53657, "text": "We collect this information to provide you with video display and playback services. Such information is a necessary information for this feature. If you refuse to provide us, it will cause us to not provide you with the core product function.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53658, "text": "(2) The sensitive permissions of the call:", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53659, "text": "When you use the video download function, you need to retrieve the storage permissions of your device (Android system) to cache the video. This is the essential permissions of the download function. If you refuse to authorize, you will not be able to cache the video normally.", "label": ["Permission Acquisition", "Important"], "rewrite": "When using the video download function, you need to retrieve the storage permissions (Android system) of your device to cache the video. This is the essential permissions of the download function. If you refuse to authorize, you will not be able to cache the video normally."}
{"task": "rw_49.jsonl", "id": 53660, "text": "(3) The third -party SDK used:", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53661, "text": "When you use video playback, we optimize your play experience through third -party SDK Tencent P2P, Seven Niu PCDN, Ali PCDN. At this time, you will collect your network information and read the network status.Information will reduce the fluency of video playback, but does not affect the use of video playback functions.", "label": ["Important", "First Party Collection Information"], "rewrite": "We optimize your play experience through third -party SDK Tencent P2P, Qi Niu PCDN, Ali PCDN. At this time, we will collect and use your network information and read the network status. Rejecting to provide this type of information will reduce video playback fluency, but notIt affects the use of video playback function."}
{"task": "rw_49.jsonl", "id": 53662, "text": "(3) Search function", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53663, "text": "(1) The range of required information, non -necessary information:", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53664, "text": "When you use the search function, we will automatically collect some of your information, including the following personal information: search content, browsing records and time, search time, and the number of times to interact with them.", "label": ["Important", "First Party Collection Information"], "rewrite": "When using the search function, we will automatically collect some of your information, including the following personal information: search content, browsing records and time, search time, and the number of interaction with them."}
{"task": "rw_49.jsonl", "id": 53665, "text": "In order to provide efficient search services, some of the aforementioned information will temporarily store on your local device and show you search history.", "label": ["Data Retention", "Important"], "rewrite": "Some of the aforementioned information will temporarily store on your local device and show you search history."}
{"task": "rw_49.jsonl", "id": 53666, "text": "This kind of information is a non -essential information of this function. If you refuse to provide such information, you will reduce the accuracy of the content you need, but it does not affect the use of search functions.", "label": ["Important", "First Party Collection Information"], "rewrite": "This kind of information is a non -essential information of this function. If you refuse to provide such information, you will reduce the accuracy of the content you need, but it does not affect the use of search functions."}
{"task": "rw_49.jsonl", "id": 53667, "text": "(4) Information production and release", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53668, "text": "(1) The range of required information, non -necessary information:", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53669, "text": "When you use the functions of submission, posting, barrage, comment, etc., you may actively provide relevant graphic/video content information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When using submissions, posts, barrage, comment and other functions, you may actively provide relevant graphic/video content information."}
{"task": "rw_49.jsonl", "id": 53670, "text": "We will collect your above information and show your nicknames, avatars, and publishing content.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect your above information and show your nicknames, avatars, and publishing content."}
{"task": "rw_49.jsonl", "id": 53671, "text": "The information you posted may include the personal information of others. Please obtain the legal authorization of others to avoid illegally leaking the personal information of others.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "The information you posted may include personal information of others. Please obtain legal authorization of others to avoid illegally leaking personal information of others."}
{"task": "rw_49.jsonl", "id": 53672, "text": "Graphic/video content information is a necessary information about this function. If you refuse to provide this type of information, you will not be able to publish graphic/video content normally.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Graphic/video content information is a necessary information for this function. If you refuse to provide this type of information, you will not be able to publish graphic/video content normally."}
{"task": "rw_49.jsonl", "id": 53673, "text": "(2) The sensitive permissions of the call:", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53674, "text": "If you refuse the relevant system permissions, you will not be able to achieve the corresponding function, but it will not affect your information publishing through text.", "label": ["Permission Acquisition", "Important"], "rewrite": "When publishing graphic/video content, you need to call the storage permissions (Android system)/album permissions (iOS system) of your device."}
{"task": "rw_49.jsonl", "id": 53675, "text": "(3) The third -party SDK used:", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53676, "text": "The review of the release of the content requires the use of Netease Yidun SDK. At this time, you will collect your device information. You can prevent the SDK from obtaining your personal information by rejecting the authority of the relevant system or not using related functions.", "label": ["Important", "First Party Collection Information"], "rewrite": "The review of the release of the content requires the use of Netease Yidun SDK. At this time, you will collect your device information. You can prevent the SDK from obtaining your personal information by rejecting the authority of the relevant system or not using related functions."}
{"task": "rw_49.jsonl", "id": 53677, "text": "(5) Sharing function", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53678, "text": "(1) The range of required information, non -necessary information:", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53679, "text": "When you use the post/video sharing function, since the sharing to QQ friends depends on the third -party SDK \"QQ sharing (QQ interconnection)\", sharing to WeChat friends or WeChat friends circle depends on the third -party SDK \"WeChat Sharing\", andShare to Weibo depends on third -party SDK \"Weibo Sharing\". We need to collect your, equipment type, equipment model, operating system information, and share it to third -party SDK.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "We need to collect your equipment type, device model, operating system information and share it to a third -party SDK."}
{"task": "rw_49.jsonl", "id": 53680, "text": "This kind of information is necessary to use the sharing function. When you click the sharing button for operation, you will not process it. If you do not collect this type of information, you will not be able to use it to the external function of the APP.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53681, "text": "(2) The sensitive permissions of the call:", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53682, "text": "When you use the sharing function, if you want to display the information sharing as a picture form or save, you need to retrieve your device, the storage permissions (Android system)/album permissions (iOS system).", "label": ["Permission Acquisition", "Important"], "rewrite": "If you want to display the shared information as a picture form or save, you need to retrieve the storage permissions (Android system)/album permissions (iOS system) of your device."}
{"task": "rw_49.jsonl", "id": 53683, "text": "These system permissions are non -essential permissions for sharing functions, triggering when you use specific function points, and if you refuse to authorize, you can share it through other forms.", "label": ["Permission Acquisition", "Important"], "rewrite": "The system permissions are non -essential permissions of the sharing function, triggering when you use specific function points, if you refuse to authorize, you can share it through other forms."}
{"task": "rw_49.jsonl", "id": 53684, "text": "(3) The third -party SDK used:", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53685, "text": "Share until QQ friends use \"QQ sharing (QQ interconnection)\" SDK, share to WeChat friends or WeChat friends circle to use \"WeChat sharing\" SDK, and share on Weibo to use \"Weibo Sharing\" SDK.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53686, "text": "(6) Place order, order management and delivery", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53687, "text": "(1) The range of required information, non -necessary information:", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53688, "text": "We collect this information to help you successfully complete the purchase of goods/services, ensure your transaction security, and facilitate your understanding and querying order information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We need to collect the following personal information according to the type of product/service type, including: your equipment information, trading product/service information, order number, order time, order amount, and your remarks information. We collect this information to help you complete the successful completionBuying and guaranteeing your transaction security for goods/services, so that you can understand and inquire about order information."}
{"task": "rw_49.jsonl", "id": 53689, "text": "Such information is a necessary information about this function. If you do not agree with such information, you cannot use the purchase of goods/service functions normally.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Such information is a necessary information about this function. If you do not agree with such information, you cannot use the purchase of goods/service functions normally."}
{"task": "rw_49.jsonl", "id": 53690, "text": "● In order to complete the order payment and ensure the security of transactions, we need to collect your payment information (transaction amount, order time, order merchant, order number, payment method, payment account, payment status information), and through security methods and payment institutions (For example, WeChat, Alipay) information sharing.", "label": ["Important", "First Party Collection Information"], "rewrite": "We need to collect your payment information (transaction amount, order time, order merchant, order number, payment method, payment account, payment status information), and share information sharing with the payment institution (such as WeChat, Alipay) through security methods."}
{"task": "rw_49.jsonl", "id": 53691, "text": "Such information is a necessary information about this function. If you do not agree to collect and share such information, you cannot use the online payment function normally.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Such information is a necessary information about this function. If you do not agree to collect and share such information, you cannot use the online payment function normally."}
{"task": "rw_49.jsonl", "id": 53692, "text": "● After you successfully place an order, such as providing or product/services in the product/service department requires third -party distribution, you need to know your consignee information (including name, address, contact number).", "label": ["Important", "First Party Collection Information"], "rewrite": "For example, a third -party merchant provided or the product/service requires third -party distribution. You need to know your consignee information (including name, address, contact number)."}
{"task": "rw_49.jsonl", "id": 53693, "text": "At the same time, we need to provide you with better after -sales service, we need to learn and confirm the delivery progress and status in a timely manner.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53694, "text": "Such information is a necessary information about this function. If this type of information is not collected, the delivery and delivery of goods/services cannot be completed.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53695, "text": "(2) The third -party SDK used:", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53696, "text": "Payment function is implemented through WeChat payment SDK/Ali Pay SDK. If the above payment information is not provided, the payment function will not be able to achieve the payment function.", "label": ["Important", "First Party Collection Information"], "rewrite": "Payment function is implemented through WeChat payment SDK/Ali Pay SDK. If the above payment information is not provided, the payment function will not be able to achieve the payment function."}
{"task": "rw_49.jsonl", "id": 53697, "text": "(7) Customer service", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53698, "text": "(1) Must -information, non -necessary information range: When you initiate complaints and user feedback, for your account number and system security, we may need you to provide account information first and match your previous personal information to verify you to verify youUser identity.", "label": ["Important", "First Party Collection Information"], "rewrite": "For your account and system security, we may need you to provide account information first and match your previous personal information to verify your user identity."}
{"task": "rw_49.jsonl", "id": 53699, "text": "At the same time, in order to facilitate contact with you or help you solve the problem, we may also need you to provide the following personal sensitive information: name, mobile phone number, email and other contact information, city/regional information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may also need you to provide the following personal sensitive information: name, mobile phone number, email and other contact information, the city/regional information."}
{"task": "rw_49.jsonl", "id": 53700, "text": "When you need to reset the password of the youth mode, we also need to upload your hand -held ID photo information to artificial appeal.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you need to reset the password of the youth mode, we also need to upload your hand -held ID photo information to artificial appeal."}
{"task": "rw_49.jsonl", "id": 53701, "text": "In addition, we will collect you and us, communication information (including text/picture/call record forms), and others related to your needs.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will also collect your communication information (including text/picture/call records), and other necessary information associated with your needs."}
{"task": "rw_49.jsonl", "id": 53702, "text": "We collect this information to investigate the facts and help you solve the problem. Such information is a necessary information about this function. If you refuse to provide the above information, we may not be able to give you timely feedback", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53703, "text": "(2) Sensitive permissions of calling: When you feedback the problem through the picture, you need to call your device, the storage permissions (Android system), and these system permissions are the non -essential permissions of the user feedback, and you use the specific functional points to use the specific functional point.Time trigger, if you refuse the relevant system permissions, the corresponding function will not be achieved, but it will not affect your feedback through text feedback.", "label": ["Permission Acquisition", "Important"], "rewrite": "When feedback through the picture, you need to call the storage permissions (Android system) of your device. These system permissions are non -essential permissions to realize user feedback. If you refuse the relevant system permissions, the corresponding function will not be achieved, but it will not affect your text through text.Feedback issues."}
{"task": "rw_49.jsonl", "id": 53704, "text": "(3) The third -party SDK used: user feedback needs to use Alibaba Cloud feedback SDK. At this timeMailbox feedback issues.", "label": ["Important", "First Party Collection Information"], "rewrite": "User feedback needs to use Alibaba Cloud feedback SDK. At this time, you will collect your device information and network information. If you refuse to provide such information, you can use customer service WeChat and email feedback."}
{"task": "rw_49.jsonl", "id": 53705, "text": "(8) The screen function", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53706, "text": "(1) The range of required information, non -necessary information:", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53707, "text": "When you use the screen function, we need to collect your, device -related information (including Serial, device models, operating systems and versions, client versions, device resolution, package name, equipment settings, software and hardware feature information, equipment names, equipment names) The relevant information of the device (including IP address, Bluetooth information), log information, and because the screen uses the music broadcast screen SDK, we will share the aforementioned information to the third -party SDK.", "label": ["Important", "First Party Collection Information"], "rewrite": "The relevant information of the location (including IP address, Bluetooth information) and log information, we will share the aforementioned information to a third -party SDK."}
{"task": "rw_49.jsonl", "id": 53708, "text": "Such information is a necessary information. When you click on the screen button, you will not use it. If you refuse to provide such information, you will not be able to use the screen function.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53709, "text": "(2) The third -party SDK used:", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53710, "text": "The screening function passed the implementation of the LeBang screen SDK. If the above necessary information is not provided, the screen function will not be used.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53711, "text": "(9) Personalized advertising recommendation", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53712, "text": "(1) The range of required information, non -necessary information:", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53713, "text": "In order to provide you with more convenient and more accumulating advertising information display in your personal needs, we need to collect your information (including collecting in the background state), including equipment information (such as hardware models, equipment MAC addresses, IDFA, necessary, necessarySoftware list), browser model, log information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We need to collect your information (including collecting in the background state), including device information (such as hardware models, device MAC addresses, IDFA, necessary software lists), browser models, log information."}
{"task": "rw_49.jsonl", "id": 53714, "text": "Such information is necessary information. If you refuse to provide, we will not be able to recommend personalized advertising information or services.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53715, "text": "In the process of advertising to you, we will strictly protect your personal information in accordance with relevant laws and regulations and ensure data security.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53716, "text": "If you don't want us to recommend personalized services for you, you can, [Mine-Settings-Personalized Recommendation Settings], select the personalized recommendation service by clicking the \"Personalized Advertising Recommendation\" button.", "label": ["Edit/Control", "Important"], "rewrite": "You can choose to close the personalized recommendation service by clicking the \"Personalized Advertising Recommendation\" button in [Mine-Settings-Personalized Recommendation Settings]."}
{"task": "rw_49.jsonl", "id": 53717, "text": "If you choose to close, the number of ads you see will not decrease, but we will no longer push you accurate personalized advertising content, and the advertising correlation you see will be reduced.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53718, "text": "(10) BUG repair and safety", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53719, "text": "(1) The range of required information, non -necessary information:", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53720, "text": "In order to solve the situation of procedure crash, running errors, and ensure the security of the APP installation package, we need to collect and use your device type, device model, and operating system information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We need to collect and use your device type, device model, and operating system information."}
{"task": "rw_49.jsonl", "id": 53721, "text": "Such information is an essential information required for analysis and repairing bugs and guaranteeing security.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53722, "text": "If you do not provide such information, the app may not run normally.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53723, "text": "(2) The third -party SDK used:", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53724, "text": "We use Tencent Bugly, SDK to detect abnormalities, and use the goddess SDK and Friend League SDK to analyze the specific bug problems. Do not provide the above necessary information, and will not be able to detect program problems in time to ensure system security.", "label": ["Important", "First Party Collection Information"], "rewrite": "We use Tencent Bugly SDK to detect abnormalities, and use the goddess SDK and Friend League SDK to analyze the specific bug problem."}
{"task": "rw_49.jsonl", "id": 53725, "text": "(11) Others", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53726, "text": "As described above, if a function or product/service that needs to collect your personal information cannot be explained in this \"Korean Privacy Policy\", or we have exceeded the purpose of the personal information that collects your personal informationAnd with the scope of direct or reasonable correlation, we will use the \"Korean Station Privacy Policy\", page prompts, pop -ups, message notifications, website announcements or other ways to facilitate your knowledge before collecting and using your personal information.Explain to you and provide you with the way you choose to consent, and collect and use it after obtaining your consent.", "label": ["Important", "First Party Collection Information"], "rewrite": "If a function or product/service that needs to collect your personal information is not explained, or we have exceeded the scope of direct or reasonable connection, we will explain to you separately and provide you with the way of self -choice consent, and we willCollect and use it after obtaining your consent."}
{"task": "rw_49.jsonl", "id": 53727, "text": "Exception", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53728, "text": "In addition, you fully understand and agree that we collect and use your personal information in the following circumstances without your authorization consent:", "label": ["Important", "First Party Collection Information"], "rewrite": "In the following circumstances, we collect and use your personal information without your authorization consent:"}
{"task": "rw_49.jsonl", "id": 53729, "text": "●, related to national security and national defense security;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting personal information related to national security and national defense security does not need to be authorized."}
{"task": "rw_49.jsonl", "id": 53730, "text": "●, related to public safety, public health, major public interests;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting personal information related to public safety, public health, and major public interests does not need to be authorized."}
{"task": "rw_49.jsonl", "id": 53731, "text": "●, directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect direct personal information related to criminal investigation, prosecution, trial, and execution of judgment without authorization."}
{"task": "rw_49.jsonl", "id": 53732, "text": "● For major legitimate rights and interests such as maintaining your or other individuals, but it is difficult to get your consent;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting and maintaining major legitimate rights and interests, but it is difficult to get personal information you agree with, no need to authorize consent."}
{"task": "rw_49.jsonl", "id": 53733, "text": "● The collected information is collected by your own or from legal public channels (such as legal news reports, government information disclosure and other channels);", "label": ["Important", "First Party Collection Information"], "rewrite": "The collected information is collected by your own or from legal and disclosed channels without authorization."}
{"task": "rw_49.jsonl", "id": 53734, "text": "●, according to the signing and fulfilling related agreements or other written documents for you;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting and submitting and fulfilling the personal information necessary for related agreements or other written documents without authorization."}
{"task": "rw_49.jsonl", "id": 53735, "text": "●, the necessary and stable operations for maintaining our products and/or services, including: discovery and disposal of products and/or service failures;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting the personal information necessary for the safe and stable operation of our products and/or services, there is no need to authorize consent."}
{"task": "rw_49.jsonl", "id": 53736, "text": "●, the requirements of the authority, other circumstances, other circumstances, and other circumstances.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect personal information under the requirements of the authority, laws and regulations, etc., and do not need to be authorized."}
{"task": "rw_49.jsonl", "id": 53737, "text": "3. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53738, "text": "(1) About Cookie and similar technologies", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53739, "text": "Cookie is a small file containing string. When you log in and use the website or other network content, you send and store in your computer, mobile device or other devices (usually encrypted).", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53740, "text": "Similar cookies are other technologies that can be used in similar uses as Cookie, including: web beacon, Proxy, embedded script.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53741, "text": "At present, we mainly use cookies to collect your personal information.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53742, "text": "You know and agree that with the development of technology and the further improvement of our products and services, we may also use similar Cookie technology.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53743, "text": "(2) How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53744, "text": "When you use our products and/or services, we may use cookies and similar technologies to collect some of your personal information, including: your habit of visiting the website, your browsing information, your login information, Cookie and similar technologies collectionThis type of information is for your use of our products and/or services, simplify your repeated operation steps (such as registration, login), and facilitate your viewing history (such as video viewing history), protecting your information and account security, Improve our products and services.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may use cookies and similar technologies to collect some of your personal information, including: your habit of accessing the website, your browsing information, and your login information."}
{"task": "rw_49.jsonl", "id": 53745, "text": "We promise to use Cookie and similar technologies within the purpose of the \"Korean Privacy Policy\".", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53746, "text": "If your browser allows, you can reject Cookie and/or similar technologies through the settings of your browser to manage, (part/all);", "label": ["Important", "First Party Collection Information", "Edit/Control"], "rewrite": "If your browser allows, you can reject Cookie and/or similar technologies through the settings of your browser."}
{"task": "rw_49.jsonl", "id": 53747, "text": "Or delete Cookie and/or similar technologies that have been stored in your computer, mobile devices or other devices, so as to achieve all or partially tracking your personal information.", "label": ["Edit/Control", "First Party Collection Information"], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53748, "text": "If you need to learn more about how to change the browser settings in detail, please check the relevant setting page of your browser you use.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53749, "text": "You understand and know: Some of our products/services can only be implemented by using Cookie or similar technologies. If you refuse to use or delete, you may not be able to use our related products and/or services or unable to pass the service normally or cannot pass through the service or cannot pass the service.Our products and/or services get the best service experience, and it may also affect your information protection and account security.", "label": ["First Party Collection Information", "Risk"], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53750, "text": "4. How do we share, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53751, "text": "(1) Sharing", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53752, "text": "We share your personal information on the premise that we follow the premise of \"legitimate legitimacy, minimum necessity, and clear principle of purpose.\"", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We share your personal information on the premise that we follow the premise of \"legitimate legitimacy, minimum necessity, and clear principle of purpose.\""}
{"task": "rw_49.jsonl", "id": 53753, "text": "At the same time, we will evaluate the impact of personal information protection on personal information in advance, and take effective technical protection measures on the output form, circulation, use, etc.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will conduct an evaluation of personal information protection for the shared activities of personal information, and take effective technical protection measures on the output form, circulation, use, etc."}
{"task": "rw_49.jsonl", "id": 53754, "text": "At the level of the cooperation agreement, the information protection obligations and responsibilities of the partners are strictly required, and the protection agreement on data security with business partners before cooperation with business partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "At the level of the cooperation agreement, the information protection obligations and responsibilities of the partners are strictly required, and the protection agreement on data security with business partners before cooperation with business partners."}
{"task": "rw_49.jsonl", "id": 53755, "text": "We have developed the situation of \"Third -Party SDK Catalog\" to clearly and concisely introduce our main personal information sharing and access software tool development packs (SDK).", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We have developed the situation of \"Third -Party SDK Catalog\" to clearly and concisely introduce our main personal information sharing and access software tool development packs (SDK)."}
{"task": "rw_49.jsonl", "id": 53756, "text": "Click to view \"Third -Party SDK Catalog\".", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53757, "text": "For the purpose of the necessary/reasonable business, meet your requirements, fulfill our obligations in relevant user agreements or in this privacy policy, exercise our rights or comply with legal regulations, we may need to share you from some business partnersPart of the information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may need to share some of your information from some business partners."}
{"task": "rw_49.jsonl", "id": 53758, "text": "But we promise that we will only share your necessary personal information. If we share your personal sensitive information or change the purpose of the use and processing of personal information, we will solicit your authorization consent again.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only share your necessary personal information. If we share your personal sensitive information or change the purpose of the use and processing of personal information, we will solicit your authorization consent again."}
{"task": "rw_49.jsonl", "id": 53759, "text": "Our business partners include:", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53760, "text": "(1) Service provider providing functional support for our products and/or services: including: the operator of one -click login service, the purpose of our sharing information is to achieve the function of our products and/or services, so that you canNormal use;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53761, "text": "(2) Third -party merchants of our platform: In order to realize your needs for purchasing products or services (including enjoying after -sales service), we will share your order information with transaction -related information to our platform's third -party merchants;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53762, "text": "(3) Third -party SDK service providers: In order to ensure the stable operation and functional implementation of our client, so that you can use and enjoy more services and functions. Our application will embed business partners SDK or other similar similar toapplication.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53763, "text": "We will strictly monitor the software tool development package (SDK) and application interface (API) of business partners to obtain information, so that it will handle personal information in accordance with this policy and any other related confidentiality and security measures to protectData Security.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will strictly monitor the software tool development package (SDK) and application interface (API) of the software tools obtained by business partners."}
{"task": "rw_49.jsonl", "id": 53764, "text": "You can click to view the \"Third -Party SDK Catalog\", and learn more about the name of the third -party SDK service provider we access, the type of personal information collected and the purpose of the use of the purpose of the collection.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You can click to view the \"Third -Party SDK Catalog\" to learn more about the name of the third -party SDK service provider we access, the types of personal information collected, and the purpose of the collection."}
{"task": "rw_49.jsonl", "id": 53765, "text": "(4) Partners who provide a certain service with us include: we and our partners carry out marketing activities. In order to provide you with normal service and meet your service needs, we will obtain your authorization separately and you will be in yourAfter authorization, synchronize your relevant information (specifically your authorization content) to the partner.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53766, "text": "●, shared the identified information, and the third party who accepts the information shared cannot re -identify the information of the information;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The shared information is to be identified, and a third party who accepts the information shared cannot re -identify the information of the information."}
{"task": "rw_49.jsonl", "id": 53767, "text": "● To protect you, other users or employees, Korean stations or social public interests, property or security (including: fraud or credit risk, etc.) are shared with third parties;", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53768, "text": "● In some cases, only by sharing your personal information can we realize the core functions of our products and/or services, or provide the services you need, or handle disputes or disputes with others;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53769, "text": "●, shared according to the related agreements (including: online agreements, platform rules, etc.) or legal documents based on the related agreements you signed;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share personal information based on the relevant agreements or legal documents you signed with us."}
{"task": "rw_49.jsonl", "id": 53770, "text": "●, in line with the relevant agreement between you and other third parties;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share personal information according to the relevant agreement between you and other third parties."}
{"task": "rw_49.jsonl", "id": 53771, "text": "● It is shared based on reasonable business habits, including: winning/winners in joint marketing activities with third parties, so that they can distribute prizes/gifts to you in time;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share personal information based on reasonable business habits."}
{"task": "rw_49.jsonl", "id": 53772, "text": "When we accept the diligence, wait;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share personal information when accepting diligence."}
{"task": "rw_49.jsonl", "id": 53773, "text": "●, the requirements of the authority, the needs of litigation disputes, laws and regulations, and other situations that need to be shared.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share personal information under the requirements of the requirements of the authority, the need for litigation disputes, the laws and regulations, and other conditions."}
{"task": "rw_49.jsonl", "id": 53774, "text": "You can share your personal information or other information based on the platform's platform with a third person (including unspecified objects), but the information leakage and use of information caused by your shared behavior have nothing to do with the Han Station.Take the corresponding legal responsibility.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "It can share personal information based on the platform of Han Station with a third person (including unspecified objects), but the information leakage and use of information caused by your shared behavior have nothing to do with the Korean station. You need to bear the corresponding legal responsibility yourself.Essence"}
{"task": "rw_49.jsonl", "id": 53775, "text": "We will only share your personal information for legal, correct, necessary, specific, and clear purposes, and only share the necessary personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only share your personal information for legal, correct, necessary, specific, and clear purposes, and only share the necessary personal information."}
{"task": "rw_49.jsonl", "id": 53776, "text": "When we share information with business partners, we will protect your personal information in various ways, including but not limited to: (1) If you have the above -mentioned directors and we need to authorize the consent, we will inform you before sharing to youThe purpose and type of shared information (if you involve your personal sensitive information, we will also tell you the content of sensitive information involved) and share it after obtaining your authorization consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When we share information with business partners, we will protect your personal information in various ways, including but not limited to: (1) If you need to authorize consent, we will tell you the purpose of sharing information before sharing.Type and sharing after obtaining your authorization consent."}
{"task": "rw_49.jsonl", "id": 53777, "text": "(2) At the level of cooperation agreement, we will strictly require partners' information protection obligations and responsibilities. To this end, our legal department requires business partners to sign a protection agreement on data security before cooperation.The user information confidentiality obligations of business partners, including information storage, use, and circulation, etc., they should meet our management and control requirements, and accept our review and supervision. Once there is any violation, we must bear the corresponding legal liability;", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will strictly require partners' information protection obligations and responsibilities. To this end, we require business partners to sign a protection agreement on data security with the Korean station. Once there is any violation, we must bear the corresponding legal liability."}
{"task": "rw_49.jsonl", "id": 53778, "text": "(3) In addition, our security team will make security assessment and processing of the output, circulation, and use of information data.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Our security team will evaluate and process the output form, circulation, use, etc. of information data."}
{"task": "rw_49.jsonl", "id": 53779, "text": "Please know that even if you have obtained your authorization consent, we will only share your personal information for legal, fair, necessary, specific, and clear goals, and try to treat personal information in the shared content as anonymous.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Even if you have obtained your authorization consent, we will only share your personal information for the legal, correct, necessary, specific, and clear goals, and try to be anonymous to the personal information in the shared content."}
{"task": "rw_49.jsonl", "id": 53780, "text": "You understand and know that the information after anonymous processing cannot be directed and identified, and it is no longer a personal information in the legal sense. Its processing, use, sharing, and transfer no need to obtain your authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "The information after anonymous processing cannot point to and identify you. It is no longer a personal information in the legal sense. Its processing, use, sharing, and transfer no need to obtain your authorization consent."}
{"task": "rw_49.jsonl", "id": 53781, "text": "(2) Transfer", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53782, "text": "Transfer refers to the process of transferring personal information control to other companies, organizations or individuals.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53783, "text": "In principle, we will not transfer your personal information, except the following situations:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In principle, we will not transfer your personal information, except the following situations:"}
{"task": "rw_49.jsonl", "id": 53784, "text": "●, you make a request yourself;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you make your own request, you will transfer personal information."}
{"task": "rw_49.jsonl", "id": 53785, "text": "●, have obtained your clear authorization consent in advance;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If your clear authorization has been obtained in advance, personal information will be transferred."}
{"task": "rw_49.jsonl", "id": 53786, "text": "● For example, if we do mergers, acquisitions, reorganization, separation, bankruptcy, asset transfer or similar transactions, your personal information may be transferred as part of such transactions. We will ask new holdersThe entire content of the \"Korean Privacy Policy\" (including the purpose, rules of use, security measures, etc.), otherwise we will ask it to re -obtain your explicit authorization consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Your personal information may be transferred as part of the transactions such as mergers. We will ask the new holders to continue and fulfill all the contents of the \"Korean Privacy Policy\", otherwise we will ask it to re -obtain your explicit authorization consent consentEssence"}
{"task": "rw_49.jsonl", "id": 53787, "text": "● Other circumstances stipulated in laws and regulations.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Personal information will be transferred under other circumstances such as laws and regulations."}
{"task": "rw_49.jsonl", "id": 53788, "text": "If you have the above reasons to be transferred, we will inform you the purpose and type of the transfer information before the transfer (if it involves your personal sensitive information, we will also inform you that the content of sensitive information involved) isAfter obtaining your authorization consent, transfer, except for laws and regulations or other agreed in this policy.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will inform you the purpose and type of the transfer information before the transfer (if you involve your personal sensitive information, we will also inform you the content of the sensitive information involved) and transferEssence"}
{"task": "rw_49.jsonl", "id": 53789, "text": "(3) Public disclosure", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53790, "text": "Public disclosure refers to the act of publishing information to society or unspecified people.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53791, "text": "In addition to the necessary disclosure of the necessary issues such as desensitization of illegal accounts and fraudulent behaviors, etc., when the winning/winner, etc. need to be made.If you have the disclosure of the directors, we will tell you the purpose and type of the information disclosed publicly before public disclosure (if you involve your personal sensitive information, we will also tell you the content of the sensitive information involved),And disclosed publicly after obtaining your authorization consent, except that the laws and regulations have other provisions or except for this policy.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Except for the necessary disclosure, we will not disclose your personal information publicly. If there is a disclosure of the reasons for the reasons of the co -disclosure, we will tell you the purpose and type of the information disclosed publicly before public disclosure, and obtain you to obtain you.After the authorization consent, disclose it publicly."}
{"task": "rw_49.jsonl", "id": 53792, "text": "For your personal information that publicly disclosed, we will fully attach great importance to risks. After receiving the public disclosure application, it will be carefully reviewed and carefully reviewed.The degree of personal information security protection measures and methods stipulated in the \"Korean Privacy Policy\" to protect it.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For your personal information that disclosed publicly, we will fully attach great importance to risks, and carefully examine its legitimacy, rationality, and legitimacy after receiving the application for public disclosure."}
{"task": "rw_49.jsonl", "id": 53793, "text": "Please know, even if you have obtained your authorization consent, we will only disclose your personal information publicly for legal, fair, necessary, specific, and clear purposes, and try to disclose the personal information in the public content anonymous processing.Essence", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Even if you have obtained your authorization consent, we will only disclose your personal information publicly for legal, correct, necessary, specific, and clear purposes, and try to disclose the personal information in the public content as anonymous."}
{"task": "rw_49.jsonl", "id": 53794, "text": "Exception", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53795, "text": "According to laws and regulations, in the following circumstances, sharing, transfer, and publicly disclose your personal information without obtaining your authorization consent in advance:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the following circumstances, sharing, transfer, and publicly disclose your personal information without obtaining your authorization consent in advance:"}
{"task": "rw_49.jsonl", "id": 53796, "text": "●, directly related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Personal information directly related to national security and national defense security does not need to solicit consent."}
{"task": "rw_49.jsonl", "id": 53797, "text": "●, directly related to public safety, public health, major public interests;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Personal information directly related to public safety, public health, and direct public interests does not need to solicit consent."}
{"task": "rw_49.jsonl", "id": 53798, "text": "●, directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Direct related personal information such as sharing with criminal investigation, prosecution, trial and judgment execution does not need to solicit consent."}
{"task": "rw_49.jsonl", "id": 53799, "text": "Or, in accordance with the requirements of laws and regulations, administrative organs or public prosecution laws, etc., the requirements of the authority;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In accordance with the requirements of laws and regulations, the requirements of the administrative organs or public prosecution laws shared personal information, no consent is required."}
{"task": "rw_49.jsonl", "id": 53800, "text": "● For major legitimate rights and interests such as maintaining your or other individuals, but it is difficult to get your consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Sharing and maintaining major legitimate rights and interests, but it is difficult to get personal information you agree with, without asking for consent."}
{"task": "rw_49.jsonl", "id": 53801, "text": "● Personal information is collected by your own or from legal public channels (such as legal news reports, government information disclosure and other channels);", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If personal information is collected by your own public or from legal and disclosed channels, you do not need to solicit consent."}
{"task": "rw_49.jsonl", "id": 53802, "text": "●, according to the signing and fulfilling related agreements or other written documents for you;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The personal information of sharing and fulfilling relevant agreements or other written documents does not need to solicit consent."}
{"task": "rw_49.jsonl", "id": 53803, "text": "● Other circumstances stipulated in laws and regulations.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Sharing personal information under other circumstances such as laws and regulations, etc., does not need to solicit consent."}
{"task": "rw_49.jsonl", "id": 53804, "text": "(4) Relevant responsibilities of sharing, transfer, and public disclosure", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53805, "text": "We will implement the operation, transfer, and public disclosure of personal information in strict accordance with the agreement of this privacy policy and the requirements of related laws and regulations. If your legitimate rights and interests are damaged due to our faultAlert you to the corresponding damage compensation liability within the scope of the law.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53806, "text": "5. The control of your personal information", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53807, "text": "You have multiple ways to control your personal information in our products and/or services, including: you can access, correct/modify, delete your personal information, or withdraw the consent of your personal information previously madeEssence", "label": ["Important", "Edit/Control"], "rewrite": "You have multiple ways to control your personal information in our products and/or services, including: you can access, correct/modify, delete your personal information, or withdraw the consent of your personal information previously madeEssence"}
{"task": "rw_49.jsonl", "id": 53808, "text": "In order to facilitate your above -mentioned control, we provide you with operational guidelines and operation settings on the related functional pages of the product. You can operate yourself. If you have doubts or difficulties in the operation processLet's control it, we will deal with you in time.", "label": ["Important", "Edit/Control"], "rewrite": "In order to facilitate your control, we provide you with operational guidelines and operation settings on the related functional pages of the product. You can operate yourself. You can contact us to control it at the end of the text. We will deal with you in time."}
{"task": "rw_49.jsonl", "id": 53809, "text": "(1) The right to access", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53810, "text": "You can query or access your relevant personal information in our products and/or services, including:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53811, "text": "●, account information: You can log in to your personal account at any time through the related product page to access your personal information information in your account, including: avatar, nickname, birthday, gender, including: \"avatar/nickname/birthday/gender/Personal signature \"information in\" Mobile Phone Station, APP \"is correct/modifying path: My — avatar -editing information;", "label": ["Important", "Edit/Control"], "rewrite": "You can log in to your personal account at any time through related product pages to access your personal information information in your account, including: avatar, nickname, birthday, gender, including: \"avatar/nickname/birthday/gender/personal signature\" information on the information onThe correction/modification path in the \"Mobile Phone Station APP\" is: Mine -Avatar -Edit Information."}
{"task": "rw_49.jsonl", "id": 53812, "text": "● Use information: You can check your use information at any time through the related product page, including: collection records, viewing historical records, offline cache records, search records, upload content, points information, including: \"watch historical records\" information in \"The access path in the mobile phone side Han Station, APP \"is: Mine -historical records;", "label": ["Edit/Control", "Important"], "rewrite": "You can check your use information at any time through the related product page."}
{"task": "rw_49.jsonl", "id": 53813, "text": "● Other information: If you encounter operating problems in the process of accessing this or you need to get other personal information content that you cannot know, you can contact us through the method provided by the end of the text. We will be in the reasonable period after verifying your identity.Internal provided by you, but the laws and regulations have other provisions or except for this policy.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53814, "text": "(2) Correction/right to modify", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53815, "text": "You can correct/modify your personal information in our products and/or services.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53816, "text": "In order to facilitate your above -mentioned rights, we provide you with two ways: online correction/modification and correct/modification application to us.", "label": ["Important", "Edit/Control"], "rewrite": "We provide you with two methods: online correction/modification and proposal/modification application to us."}
{"task": "rw_49.jsonl", "id": 53817, "text": "For some of your personal information, we provide you with operational guidelines and operation settings on the related functional page of the product., APP \"correct/modify path: Mine -Avatar -Edit Information;", "label": ["Important", "Edit/Control"], "rewrite": "You can directly correct the correction/modification, including: \"avatar/nickname/birthday/gender\" information in the \"mobile phone Korean station APP\" is correct/modified path: my avatar -editing information."}
{"task": "rw_49.jsonl", "id": 53818, "text": "For the difficulties you encountered in the process of exercising the above rights, or other may not/cannot provide you with online correction/modification permissions, verify your identity, and correct the objectivity and accuracy that does not affect the information of the information.In the case, you have the right to correct or modify the error or incomplete information, or in specific circumstances, especially when the data is wrong, you will submit your correction/modification application to us through the feedback and error reports that we publish.We are required to correct or modify your data, but except for laws and regulations.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53819, "text": "But for the consideration of security and identification, you may not be able to modify some initial registration information submitted during registration.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "You may not be able to modify some initial registration information submitted during registration."}
{"task": "rw_49.jsonl", "id": 53820, "text": "(3) Delete right", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53821, "text": "Generally speaking, we only save your personal information stipulated in laws and regulations or necessary and shortest times.", "label": ["Data Retention", "Important"], "rewrite": "We will only save your personal information as stipulated in laws and regulations or the shortest and shortest time."}
{"task": "rw_49.jsonl", "id": 53822, "text": "To facilitate your exercise of your above -mentioned deletion right, we provide you with two ways to delete online and ask us to delete your application.", "label": ["Important", "Edit/Control"], "rewrite": "We provide you with two ways to delete online and ask us to delete your application."}
{"task": "rw_49.jsonl", "id": 53823, "text": "For some of your personal information, we provide you with operational guidelines and operation settings on the related functional page of the product. You can directly delete it, including: \"Historical Record\" information on the deletion path of \"mobile phone side Korean station, APP\"For: Mine -historical record -editor.", "label": ["Edit/Control", "Important"], "rewrite": "We provide you with operational guidelines and operation settings on the related functional page of the product. You can directly delete it, including: \"Historical Record\" information in the \"mobile phone side Korean station APP\" is: My — historical records-edit."}
{"task": "rw_49.jsonl", "id": 53824, "text": "Once you delete, we will delete or processes such information, unless laws and regulations have other provisions.", "label": ["Edit/Control", "Data Security", "Important"], "rewrite": "We provide you with operational guidelines and operation settings on the related functional page of the product. You can directly delete it, including: \"Historical Record\" information in the \"mobile phone side Korean station APP\" is: My — historical records-edit."}
{"task": "rw_49.jsonl", "id": 53825, "text": "In the following circumstances, you can directly make a request to delete your personal information, but except for anonymous data processing or other provisions of laws and regulations.", "label": ["Important", "Edit/Control"], "rewrite": "In the following circumstances, you can directly make a request to delete your personal information, but except for anonymous data processing or other provisions of laws and regulations."}
{"task": "rw_49.jsonl", "id": 53826, "text": "●, we violate laws and regulations, collect and use your personal information;", "label": ["Important", "Edit/Control"], "rewrite": "If we violate laws and regulations and collect and use your personal information, you can apply for deleting personal information."}
{"task": "rw_49.jsonl", "id": 53827, "text": "●, we violate your agreement, collect and use your personal information;", "label": ["Edit/Control", "Important"], "rewrite": "We can apply for deleting personal information in violation of agreed collection and using your personal information."}
{"task": "rw_49.jsonl", "id": 53828, "text": "● Other circumstances stipulated in laws and regulations.", "label": ["Important", "Edit/Control"], "rewrite": "In other circumstances stipulated in laws and regulations, you can apply for deleting personal information."}
{"task": "rw_49.jsonl", "id": 53829, "text": "After you no longer use the products and/or services we are provided, and after we terminate some or all products and/or services, we will handle your personal information. We will make in detail in other special chapters/sections in this articleillustrate.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53830, "text": "You understand and agree: When you delete information from our products and/or services, we may not immediately delete the corresponding information from the backup system, but this information will be deleted when the backup is updated.", "label": ["Important", "Risk"], "rewrite": "When you delete information from our products and/or services, we may not immediately delete the corresponding information from the backup system, but this information will be deleted when the backup is updated."}
{"task": "rw_49.jsonl", "id": 53831, "text": "(4)", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53832, "text": "If you need a copy of your personal data, you can contact us through the method provided by this \"Korean Privacy Policy\" at the end of this article. After verifying your identity, we will provide you with your personal information copy (Including basic information, identity information), but other provisions of laws and regulations, except for other provisions of this policy.", "label": ["Important", "Edit/Control"], "rewrite": "If you need a copy of your personal data, you can contact us through the method provided at the end of this \"Korean Privacy Policy\"."}
{"task": "rw_49.jsonl", "id": 53833, "text": "(5) Withdrawal of consent", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53834, "text": "If you want to change the authorization of relevant permissions (including: location, album, etc.), you can modify it through your hardware equipment.", "label": ["Important", "Edit/Control"], "rewrite": "If you want to change the authorization of relevant permissions (including: location, album, etc.), you can modify it through your hardware equipment."}
{"task": "rw_49.jsonl", "id": 53835, "text": "If you encounter operating problems in this process, you can contact us through the method provided by the \"Korean Privacy Policy\" at the end of this article.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53836, "text": "When you cancel the authorization of relevant personal information collection, we will no longer collect this information, and we can no longer provide you with the above -mentioned services;", "label": ["Edit/Control", "Important"], "rewrite": "When you cancel the authorization of relevant personal information collection, we will no longer collect this information, and we can no longer provide you with the above -mentioned services."}
{"task": "rw_49.jsonl", "id": 53837, "text": "But you know and agree that unless you exercise the aforementioned \"right to delete\", your behavior will not affect the processing and storage of our personal information based on your previous authorization.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Unless you exercise the aforementioned \"deletion right\", your behavior will not affect the processing and storage of our personal information based on your previous authorization."}
{"task": "rw_49.jsonl", "id": 53838, "text": "(6) List of cancellation", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53839, "text": "We provide you with the cancellation authority of the Korean station account. You can cancel your account by sending mail to Hanzhan@baoshangyun.com. We will process your account cancellation application within 7 working days.", "label": ["Edit/Control", "Contact Information", "Important"], "rewrite": "We provide you with the cancellation authority of the Korean station account. You can cancel your account by sending an email to Hanzhan@baoshangyun.com's mailbox."}
{"task": "rw_49.jsonl", "id": 53840, "text": "Once you cancel your account, you cannot use the products and services we provide and deemed to automatically abandon the existing rights, so please do it with caution.", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "Once you cancel your account, you cannot use the products and services we provide and deemed to automatically abandon the existing rights."}
{"task": "rw_49.jsonl", "id": 53841, "text": "Except for other provisions of laws and regulations, after canceling the account, we will stop providing you all our products and services. All the contents, information, data, and records under our products and services you have used through this account will beDelete or anonymous treatment.", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "After canceling the account, we will stop providing all products and services. You have been deleted or anonymous to use all the contents, information, data, and records under the product and service through this account."}
{"task": "rw_49.jsonl", "id": 53842, "text": "(7) Knowing the right of product and/or service in advance", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53843, "text": "We will continue to provide you with high -quality services. If our part or all products and/or services are forced to stop operations for special reasons, we will send push messages to you in advance After the collection of your personal information will be stopped, and at the same time, after the necessary and short period of time stipulated by laws and regulations, we will delete or processes your personal information.", "label": ["Important", "Cessation of Operations"], "rewrite": "If the operation is stopped, we will send you a push message or notify you in other ways, and will stop collecting. At the same time, after exceeding the necessary and short period of time, we will delete or anonymous processing."}
{"task": "rw_49.jsonl", "id": 53844, "text": "(8) Help feedback right", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53845, "text": "We provide you with a variety of feedback channels. For details, please see the chapter of \"How to contact us\" in this policy.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53846, "text": "Exception", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53847, "text": "Please understand and know that in accordance with laws and regulations, in the following circumstances, we may not respond to your request to access, correct/modify the right to correct/modify, delete the right to delete, withdraw the right to consent, and obtain right:", "label": ["Important", "Edit/Control"], "rewrite": "In the following circumstances, we may not respond to your request to access, correct/modify the right to correct/modify, delete the right to delete, withdraw the right to consent, and obtain the right:"}
{"task": "rw_49.jsonl", "id": 53848, "text": "●, related to national security and national defense security;", "label": ["Important", "Edit/Control"], "rewrite": "It is related to national security and national defense security, and may not respond to requests."}
{"task": "rw_49.jsonl", "id": 53849, "text": "●, related to public safety, public health, major public interests;", "label": ["Important", "Edit/Control"], "rewrite": "Those who are related to public safety, public health, and major public interests may not respond to requests."}
{"task": "rw_49.jsonl", "id": 53850, "text": "●, related to criminal investigation, prosecution, trial, and execution of judgment;", "label": ["Important", "Edit/Control"], "rewrite": "It will not respond to the request with criminal investigation, prosecution, trial, and judgment execution."}
{"task": "rw_49.jsonl", "id": 53851, "text": "● We have sufficient evidence that you have subjective malicious or abuse of rights;", "label": ["Important", "Edit/Control"], "rewrite": "We have sufficient evidence that if you have subjective malice or abuse of rights, we will not respond to requests."}
{"task": "rw_49.jsonl", "id": 53852, "text": "●, responding to your request will cause the legitimate rights and interests of you or other individuals and organizations to be seriously damaged;", "label": ["Edit/Control", "Important"], "rewrite": "Responding to your request will cause serious damage to the legitimate rights and interests of you or other individuals and organizations, and will not respond to the request."}
{"task": "rw_49.jsonl", "id": 53853, "text": "●, involved business secrets;", "label": ["Important", "Edit/Control"], "rewrite": "Those involved in business secrets will not respond to requests."}
{"task": "rw_49.jsonl", "id": 53854, "text": "● Other circumstances stipulated in laws and regulations.", "label": ["Important", "Edit/Control"], "rewrite": "In other circumstances stipulated in laws and regulations, the request may not be responded."}
{"task": "rw_49.jsonl", "id": 53855, "text": "6. How do we store and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53856, "text": "(1) Storage of personal information", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53857, "text": "● Storage location: We will store your personal information in the territory of the People's Republic of China in accordance with the provisions of laws and regulations.", "label": ["Data Retention", "Important"], "rewrite": "We store your personal information in the territory of the People's Republic of China in accordance with the provisions of laws and regulations."}
{"task": "rw_49.jsonl", "id": 53858, "text": "At present, we do not have a scenario that stores your personal information or provide personal information overseas for the time being.", "label": ["Data Retention", "Important"], "rewrite": "At present, we do not have a scenario that stores your personal information or provide personal information overseas for the time being."}
{"task": "rw_49.jsonl", "id": 53859, "text": "If you need to store cross -border storage or provide personal information overseas, we will clearly notify you (including the purpose of the outbound, the receiver, the use method and scope, the content of the use, the security measures, the security risk)The authorization agrees, and strictly requires the receiver to handle your personal information in accordance with this \"Korean Privacy Policy\" and other relevant requirements;", "label": ["Data Retention", "Important"], "rewrite": "If you need to store cross -border storage or provide personal information overseas, we will clearly notify you (including the purpose of the outbound, the receiver, the use method and scope, the content of the use, the security measures, the security risk)Authorized consent."}
{"task": "rw_49.jsonl", "id": 53860, "text": "● Storage period: We will retain your personal information during the purpose of providing our products and services, including: when you use our registration function, we need to collect your mobile phone number, and we are inAfter you provide and during your function, we need to keep your mobile phone number for you to provide you with the function and ensure your account number and system security normally.", "label": ["Data Retention", "Important"], "rewrite": "We keep your personal information for the purpose of providing our products and services."}
{"task": "rw_49.jsonl", "id": 53861, "text": "After below the above storage period, we will delete or processes your personal information.", "label": ["Data Retention", "Important"], "rewrite": "After below the above storage period, we will delete or processes your personal information."}
{"task": "rw_49.jsonl", "id": 53862, "text": "However, except that you exercise the right to delete the right to delete or laws and regulations (including: the E -commerce Law stipulates that the time for the preservation time of goods and service information and transaction information is not less than three years from the date of the transaction).", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53863, "text": "(2) Protection measures for personal information", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53864, "text": "We have always attached great importance to protecting users' personal information security. To this end, we have adopted multi -level protection measures such as security technical measures and supporting organizational structures that meet industry standards and supporting systems.The risk of use, non -authorized access, non -authorized disclosure and changes.", "label": ["Important", "Data Security"], "rewrite": "We have adopted multi -level protection measures such as security technical measures and supporting organizational structures and management systems that meet industry standards to minimize the risk of leaking, damage, misuse, non -authorized disclosure and changes to your information."}
{"task": "rw_49.jsonl", "id": 53865, "text": "include:", "label": ["Data Security"], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53866, "text": "● Data security technical measures", "label": ["Data Security"], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53867, "text": "(1) In terms of data security collection, the legality, legitimacy and necessity of the data collection through the influence of personal information security, identify and inform users in a clear and accurate way to obtain consent, and at the same timeRecord the log;", "label": ["Important", "Data Security"], "rewrite": "Through personal information security influence, the legality, legitimacy, and necessity of data collection is recognized and informing users in a clear and accurate way to obtain consent, and at the same time, the user's authorization and consent collection behavior is recorded."}
{"task": "rw_49.jsonl", "id": 53868, "text": "Use sensitive recognition tools to classify the collected user data, set different levels of security strategies for different levels of data;", "label": ["Important", "Data Security"], "rewrite": "Use sensitive recognition tools to classify the collected user data, setting different levels of security strategies for different levels of data."}
{"task": "rw_49.jsonl", "id": 53869, "text": "Use technical measures to identify the source of collecting or generating data to ensure the accuracy and resistance of the source of the data;", "label": ["Important", "Data Security"], "rewrite": "Use technical measures to identify the source of collecting or generating data to ensure the accuracy and resistance of the source of the data."}
{"task": "rw_49.jsonl", "id": 53870, "text": "(2) In terms of data security transmission, use security channels to transmit personal information, and use the appropriate encryption algorithm for security encryption and desensitization processing to ensure the secrets and integrity of personal information during the data transmission process;", "label": ["Important", "Data Security"], "rewrite": "In terms of data security transmission, personal information is used to use security channels, and security encryption and desensitization processing are used to ensure the secrets and integrity of personal information during the data transmission process."}
{"task": "rw_49.jsonl", "id": 53871, "text": "(3) In terms of data security storage, the data classification classification management system is adopted, and different information storage strategies are adopted for data classification and classification results;", "label": ["Data Retention", "Important", "Edit/Control"], "rewrite": "In terms of data security storage, the data classification classification management system is adopted, and different information storage strategies are adopted for data classification and classification results."}
{"task": "rw_49.jsonl", "id": 53872, "text": "The data classification classification management system is adopted to adopt different information storage strategies for data classification hierarchical results;", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "The data classification hierarchical management system is adopted to adopt different information storage strategies for data classification and hierarchical results."}
{"task": "rw_49.jsonl", "id": 53873, "text": "Personal sensitive information needs to be encrypted and stored to ensure that the data secure use specifications can be implemented in place;", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "Personal sensitive information needs to be encrypted and stored to ensure that the data secure use specifications can be implemented in place."}
{"task": "rw_49.jsonl", "id": 53874, "text": "For databases that store personal information, enhanced permissions control and security audit;", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "For databases with personal information, database strengthening permissions control and security audit."}
{"task": "rw_49.jsonl", "id": 53875, "text": "Perform personal information on a regular basis to ensure the integrity of personal information in the storage process;", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "Perform personal information to backup and restore to ensure the integrity of personal information during the storage and use process."}
{"task": "rw_49.jsonl", "id": 53876, "text": "(4) In terms of data security processing, personal information is desensitized according to the use scenario and security needs, including: before the front end shows personal sensitive information", "label": ["Important", "Data Security"], "rewrite": "In terms of data security processing, personal information is desertured according to the use scenarios and security needs."}
{"task": "rw_49.jsonl", "id": 53877, "text": "Development and testing environment is strictly prohibited to use real user information;", "label": ["Data Security"], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53878, "text": "Implement strict data permissions control mechanisms, adopt multiple identity authentication, network/data isolation technical measures to ensure effective monitoring of behaviors that can handle personal information, avoiding data from illegal access and unauthorized use;", "label": ["Important", "Data Security"], "rewrite": "Implement strict data permissions control mechanisms, and adopt multiple identity authentication, network/data isolation technical measures to ensure effective monitoring of acts of handling personal information."}
{"task": "rw_49.jsonl", "id": 53879, "text": "(5) In terms of data security destruction, the minimum available period of personal information storage is set in accordance with the requirements of laws and regulations and actual business requirements. The data that matches the data is processed through security deletion technology to ensure that the data has been destroyed.Limited to the thorough clearing of the data, disk destruction, physical destruction, etc.;", "label": ["Important", "Data Security"], "rewrite": "In terms of data security destruction, the minimum available period of personal information storage is set in accordance with the requirements of laws and regulations and actual business requirements. The data expired data is processed through security deletion technology to ensure that the destroyed data has not recovered."}
{"task": "rw_49.jsonl", "id": 53880, "text": "(6) Establish a complete audit mechanism to monitor and audit the full process of the data life cycle to prevent your personal information from being unauthorized access, public disclosure, use, modification, artificial or unexpected damage or loss;", "label": ["Important", "Data Security"], "rewrite": "Establish a complete audit mechanism to monitor and audit the full process of the data life cycle to prevent your personal information from encountering unauthorized access, public disclosure, use, modification, artificial or unexpected damage or loss."}
{"task": "rw_49.jsonl", "id": 53881, "text": "(7) Other measures to implement data security protection.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53882, "text": "● Data security organization and management measures", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53883, "text": "(1) Establish a special person in personal information protection responsibility departments, establish a related internal control management process, and adopt the principle of minimizing authority for the staff who may contact your information;", "label": ["Important", "Data Security"], "rewrite": "Establish a dedicated personal information protection responsibility department to establish a related internal control management process, and adopt the principle of minimizing authority for staff who may contact your information."}
{"task": "rw_49.jsonl", "id": 53884, "text": "(2) Establish a management system such as data classification and grading system, business data secure use specifications, and data cooperation specifications to ensure the disposal of your information to meet the relevant regulations and security requirements of laws and regulations in the collection, transmission, use, storage, transfer, and destruction.Items", "label": ["Important", "Data Security"], "rewrite": "Establish a management system such as data classification hierarchical system, business data secure use specifications, and data cooperation specifications."}
{"task": "rw_49.jsonl", "id": 53885, "text": "(3) Regularly organize employees to participate in related training related training for safety and privacy protection and require the assessment of the prescribed regulations to strengthen employees' awareness of protecting the importance of personal information;", "label": ["Important", "Data Security"], "rewrite": "Regularly organize employees to participate in the training of safety and privacy protection and require the assessment of the prescribed regulations to strengthen employees' awareness of protecting the importance of personal information."}
{"task": "rw_49.jsonl", "id": 53886, "text": "(4) Other feasible security organizations and management measures.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53887, "text": "● Cooperation agreement clause guarantee", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53888, "text": "(1) Before we indirectly collect your personal information from the third party, we will clearly require the third party to collect and process personal information in writing (such as cooperation agreements and commitments) to request the third party after obtaining your consent.At the level of the written agreement, the third party promises the legality and compliance of the source of personal information. If the third party violates the behavior, we will clearly require the third party to bear the corresponding legal responsibility;", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Before we indirectly collect your personal information from the third party, we will clearly require the third party to collect and process personal information (such as sharing) personal information in writing in writing. At the written agreement level, the third party has personal information for personal informationThe legality and compliance of the source make a commitment."}
{"task": "rw_49.jsonl", "id": 53889, "text": "(2) Before we share your personal information with business partners, we will strictly require partners' information protection obligations and responsibilities, and ask business partners to sign a protection agreement on data security before cooperation. Once the business partners haveAny violation of the agreement will bear the corresponding legal responsibility;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Before we share your personal information with business partners, we will strictly require partners' information protection obligations and responsibilities, and ask business partners to sign a protection agreement on data security before cooperation."}
{"task": "rw_49.jsonl", "id": 53890, "text": "(3) The contents of other cooperation agreements are clearly stipulated.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53891, "text": "● The handling of safety events", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53892, "text": "(1) If the personal information security incident occurs unfortunately, we will inform you the basic situation and possible impact of the security incident in accordance with the requirements of the laws and regulations.Suggestions for risk, remedy measures, etc.", "label": ["Important", "Data Security"], "rewrite": "If there is a personal information security incident, we will inform you the basic situation and possible impact of the security incident in accordance with the requirements of the laws and regulations, disposal measures, suggestions, and remedy measures."}
{"task": "rw_49.jsonl", "id": 53893, "text": "We will inform you in a timely manner about the incident -related situation in one or more ways such as SMS, push notification, and in -site messages. When it is difficult to inform the subject of personal information one by one, we will publish a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "We will inform you of the incident -related situation in time. It is difficult to inform the subject of personal information one by one, and we will publish an announcement in a reasonable and effective way."}
{"task": "rw_49.jsonl", "id": 53894, "text": "At the same time, we will also actively report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities;", "label": ["Important", "Data Security"], "rewrite": "We will also take the initiative to report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities."}
{"task": "rw_49.jsonl", "id": 53895, "text": "(2) Please know and understand that the Internet is not an absolute security environment. We strongly recommend that you help us ensure your account security through a security method and complex password.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53896, "text": "If you find your personal information disclosure, especially your account or password leak, please contact us according to the contact information provided by the privacy policy at the end of this privacy policy so that we can take corresponding measures to protect your information security.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53897, "text": "7. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53898, "text": "Han Station has always paid great attention to the protection of minors and is committed to practicing our corporate social responsibility.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53899, "text": "Most of the products and/or services of Han Station are mainly provided for adults. For this part of the product and/or service, we will not take the initiative to collect their personal information directly to the minors. If the minor needs to use itGet the consent of the guardian (including this policy), use and submit personal information after the guardian's consent and guidance;", "label": ["Specific Audiences", "Important"], "rewrite": "Most of the products and/or services of Han Station are mainly provided for adults. For this part of the product and/or service, we will not take the initiative to collect their personal information directly to the minors. If the minor needs to use itGet the consent of his guardian (including this policy)."}
{"task": "rw_49.jsonl", "id": 53900, "text": "We hope that guardians can also actively educate and guide minors to enhance their personal information protection awareness and ability to protect the personal information security of minors.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53901, "text": "The Korean station will strictly fulfill the obligations and responsibilities of the protection of minors stipulated in the law. We will only collect, use, share, transfer or disclose personal information of minors with the consent of the guardian, the consent of the guardian, or protect the minors.If we find that minors use our products and/or services without the consent of their guardians in advance, we will do our best to get in touch with the guardian and delete the relevant juvenile personal information as soon as possible at the request of the guardian as soon as possible.Essence", "label": ["Specific Audiences", "Important"], "rewrite": "We will only collect, use, share, transfer, or disclose the personal information of minors under the necessary circumstances. If we find that the minor uses the product service without the consent of the guardian in advance, we will contact the guardian to get in touch withAnd delete personal information of related minors as soon as possible."}
{"task": "rw_49.jsonl", "id": 53902, "text": "8. Update of \"Korean Privacy Policy\"", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53903, "text": "We encourage you to check our \"Korean Privacy Policy\" every time you use our products or services.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53904, "text": "In order to provide you with better services, we will update the terms of this \"Korean Privacy Policy\" in accordance with the update of the product and the relevant requirements of the laws and regulations, which constitutes part of the \"Korean Privacy Policy\".", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53905, "text": "If the update causes the substantial reduction or major change of rights under this \"Korean Privacy Policy\", we will prompt or send you a message to you or notify you in other ways before this policy takes effect. Continue to use our services, which means that you fully read, understand and agree to the restrictions of the \"Korean Privacy Policy\" revised.", "label": ["Policy Change", "Important"], "rewrite": "If the update causes the substantial reduction or significant change of rights under this \"Korean Privacy Policy\", we will notify you through a prominent position before this policy takes effect. If you continue to use our service, it means that you fully read the full reading , Understand and agree to the constraints of the \"Korean Privacy Policy\" revised."}
{"task": "rw_49.jsonl", "id": 53906, "text": "To protect your legitimate rights and interests, we recommend that you can view this policy on the settings page of our platform.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53907, "text": "The above -mentioned \"major changes\" include, but not limited to:", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53908, "text": "● Our service model has changed significantly.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53909, "text": "Such as the purpose of handling personal information, the type of personal information of the processing, the way of use of personal information, etc.;", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53910, "text": "● We have changed significantly in the aspects of ownership structure and organizational structure.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53911, "text": "Such as changes caused by business adjustments, bankruptcy mergers and acquisitions, etc.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53912, "text": "● The main objects of personal information sharing, transfer or public disclosure have changed;", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53913, "text": "● The right to participate in personal information processing and its exercise methods have changed significantly;", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53914, "text": "● When we are responsible for handling the responsibility department, contact methods and complaint channels of personal information security;", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53915, "text": "● Personal information security impact assessment report shows that there is a high risk;", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53916, "text": "● Other important or may seriously affect your personal rights and interests.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53917, "text": "Nine, how to contact us", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53918, "text": "(1) If you have any problems related to privacy protection (including questions, complaints, etc.) encountered in the implementation of this \"Privacy Policy of the Korean Station\" or using our service, we will provide you with multiple feedbackChannel, I hope to provide you with a satisfactory solution:", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53919, "text": "● Customer service/other online opinion feedback channels: You can contact the customer service page of the product function page on our platform or submit feedback on online submission;", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53920, "text": "● Special email channel: In order to better protect your rights, we set up a mailbox of Hanzhan@baoshangyun.com, you can contact us through this mailbox;", "label": ["Important", "Contact Information"], "rewrite": "We set up a mailbox of Hanzhan@baoshangyun.com, and you can contact us through this mailbox."}
{"task": "rw_49.jsonl", "id": 53921, "text": "(2) After receiving your opinions and suggestions, we will reply to you within 15 working days after verifying your user identity or within the time limit stipulated by laws and regulations. Generally, we will not be right.You charge the service fee.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53922, "text": "However, in the following circumstances, you understand and know that we will not be able to respond to your request:", "label": ["Important", "Risk"], "rewrite": "In the following circumstances, you understand and know that we will not be able to respond to your request:"}
{"task": "rw_49.jsonl", "id": 53923, "text": "●, related to national security and national defense security;", "label": ["Important", "Risk"], "rewrite": "Requesting the request with national security and national defense security cannot be responded."}
{"task": "rw_49.jsonl", "id": 53924, "text": "●, related to public safety, public health, major public interests;", "label": ["Important", "Risk"], "rewrite": "If it is related to public safety, public health, and major public interests, the request cannot be responded."}
{"task": "rw_49.jsonl", "id": 53925, "text": "●, related to criminal investigation, prosecution, and trial;", "label": ["Important", "Risk"], "rewrite": "Those who are related to criminal investigation, prosecution, and trial cannot respond to the request."}
{"task": "rw_49.jsonl", "id": 53926, "text": "● There is sufficient evidence that you have subjective malice or abuse of rights;", "label": ["Important", "Risk"], "rewrite": "If there is sufficient evidence that you have subjective malicious or abuse of rights, you cannot respond to the request."}
{"task": "rw_49.jsonl", "id": 53927, "text": "●, responding to your request will cause the legitimate rights and interests of you or other individuals and organizations to be seriously damaged;", "label": ["Important", "Risk"], "rewrite": "In response to your request, if the legitimate rights and interests of you or other individuals and organizations are seriously damaged, the request cannot be responded."}
{"task": "rw_49.jsonl", "id": 53928, "text": "●, involved business secrets;", "label": ["Important", "Risk"], "rewrite": "Those who involve business secrets cannot respond to requests."}
{"task": "rw_49.jsonl", "id": 53929, "text": "● Other circumstances stipulated in laws and regulations.", "label": ["Important", "Risk"], "rewrite": "In other circumstances stipulated in laws and regulations, the request cannot be responded."}
{"task": "rw_49.jsonl", "id": 53930, "text": "(3) If you are not satisfied with our reply, or our personal information processing method infringes your legitimate rights and interests, and after feedback to us we still refuse to improve, you canComplaint and report.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53931, "text": "Ten, others", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53932, "text": "(1) The interpretation and dispute resolution of the \"Korean Privacy Policy\" shall apply laws of the People's Republic of China in mainland China.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53933, "text": "Any disputes related to this \"Korean Privacy Policy\", the two parties shall negotiate friendly solutions;", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53934, "text": "If you cannot negotiate, you agreed to submit the dispute to the Litigation of the People's Court of Pudong New District, Shanghai.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53935, "text": "(2) The title of this \"Korean Privacy Policy\" is only for convenience and reading, and does not affect any of the meaning or explanations of any provisions of the text.", "label": [], "rewrite": []}
{"task": "rw_49.jsonl", "id": 53936, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
