{"task": "rw_47.jsonl", "id": 52902, "text": "Understand the privacy policy of Emperor Che Emperor", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 52903, "text": "Update date: May 11, 2021", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 52904, "text": "Effective date: May 18, 2021", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 52905, "text": "Beijing Space Transformation Technology Co., Ltd. (Registration Address: Room 507, Building 5, Building No. 4, No. 43, North Third Ring Road, Haidian District, Beijing. The following is known as \"we\" or \"company\").A security measures will be adopted in accordance with the requirements of laws and regulations to protect your personal information and privacy security.", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 52906, "text": "Therefore, we formulate \"Understanding the Privacy Policy of the Emperor\" (hereinafter referred to as \"Privacy Policy\") and reminds you: before using the \"Knowing the Emperor\" and related services (define the \"User Agreement with the Emperor\"), please be sure to be sure to be sure toRead carefully and thoroughly understand this \"Privacy Policy\". After confirming and fully understanding and agreeing, your appropriate choice is made in accordance with the guidance.", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 52907, "text": "This privacy policy will help you understand:", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 52908, "text": "• We will follow your information to collect and use your information, but we will not collect personal information in a package of compulsory binding because you agree with your consent of the privacy policy.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will follow your information to collect and use your information, but we will not collect personal information in a package of compulsory binding because you agree with your consent of this privacy policy."}
{"task": "rw_47.jsonl", "id": 52909, "text": "• When you use or turn on related functions or use services, we will collect and use relevant information for the implementation of functions and services.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_47.jsonl", "id": 52910, "text": "Unless it is necessary to realize basic business functions or the necessary information necessary in accordance with the requirements of laws and regulations, you can refuse to provide and not affect other functions or services.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_47.jsonl", "id": 52911, "text": "We will explain in the privacy policy which is the necessary information.", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 52912, "text": "• If you do not log in to the account, we will ensure the basic functions of information push through the corresponding identifier information of the device.", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 52913, "text": "If you log in to your account, we will push information according to account information.", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 52914, "text": "•, accurate geographical location, camera, microphone, album (storage), telephone, and calendar permissions will not be opened by default. Only by your explicit authorization will you use it when you implement specific functions or services, and you can also withdraw authorization.", "label": ["Permission Acquisition", "Important"], "rewrite": "Accurate geographical location, camera, microphone, album (storage), telephone, and calendar permissions will not be opened by default. Only after your explicit authorization will be used when you implement specific functions or services, you can also withdraw authorization."}
{"task": "rw_47.jsonl", "id": 52915, "text": "In particular, it is necessary to point out that even after your authorization, we have obtained these sensitive permissions, and we will not collect your information when related functions or services are not needed.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "Even after your authorization, we have obtained these sensitive permissions, and we will not collect your information sometimes in related functions or services."}
{"task": "rw_47.jsonl", "id": 52916, "text": "For specific permissions application and authority usage, please see: Understand the application permission application and usage of the Emperor Emperor", "label": ["Permission Acquisition", "Important"], "rewrite": "For specific permissions application and authority usage, please refer to: Understand the application permission application and usage of the Emperor Emperor."}
{"task": "rw_47.jsonl", "id": 52917, "text": "• This privacy policy is suitable for accessing by understanding the Emperor Emperor Software Development Tool Pack (SDK) and application programming interface (API) by understanding the Emperor's application, the official website of the Emperor of the Che Emperor, the official website of the Emperor Emperor, the official website for third -party websites and applications.And use our products and services.", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 52918, "text": "The following will help you understand how we collect, use, store, transmit, share, transfer (applicable) and protect personal information;", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 52919, "text": "Help you understand the way query, access, delete, correction, and withdrawn authorized personal information.", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 52920, "text": "Among them, important contents of your personal information rights and interests We have prompted in bold forms, please pay special attention.", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 52921, "text": "1. How do we collect and use personal information", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 52922, "text": "2. The use of Cookie and similar technologies", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 52923, "text": "3. How do we store personal information", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 52924, "text": "4. How do we share, transfer, and publicly disclose personal information", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 52925, "text": "5. How do we protect the security of personal information", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 52926, "text": "6. Your rights", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 52927, "text": "7. Terms of use of minors", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 52928, "text": "8. Amendment and notice of privacy policy", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 52929, "text": "Nine, scope of application", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 52930, "text": "Ten, others", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 52931, "text": "1. How do we collect and use personal information", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 52932, "text": "(1) We actively collect and use personal information", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 52933, "text": "We will collect the information you actively provided when using the service as follows, and collect the information you generate during the use of the function or accept the service through automation:", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect information you actively provided when using the service, and the information you generate during the use of functions or receiving services."}
{"task": "rw_47.jsonl", "id": 52934, "text": "1. Register, certify, log in to \"Know the Emperor\" and related services", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 52935, "text": "(1) When you register and log in to \"Know the Emperor\" and related services, you can create an account through the mobile phone number. We will verify whether your identity is valid by sending the SMS verification code, and you can improve the relevant network identity recognition.Information (avatar, user name), collecting this information to help you complete registration.", "label": ["Important", "First Party Collection Information"], "rewrite": "When registering and logging in to \"Knowing the Emperor\" and related services, you can create an account through your mobile phone number. You can improve the relevant network identity identification information (avatar, user name). Collecting this information is to help you complete the registration."}
{"task": "rw_47.jsonl", "id": 52936, "text": "You can also select your personal information such as personal introduction and other information according to your own needs.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can also select your personal information such as personal introduction and other information according to your own needs."}
{"task": "rw_47.jsonl", "id": 52937, "text": "(2) You can also use a third -party account to log in to understand the Emperor of the Car. At this time, you will authorize us to obtain the public information (avatar, nickname, region, gender, and other information you authorized) on the third -party platform, and inYou agree that this \"Privacy Policy\" will bind your third -party account with your Know Emperor's account, so that you can log in to the third -party account and use the car emperor's products and related services.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can also use a third -party account to log in to the Emperor Knowing the Emperor. At this time, you will authorize us to obtain the public information (avatar, nickname, region, gender, and other information you authorized) on the third -party platform."}
{"task": "rw_47.jsonl", "id": 52938, "text": "(3) The account you registered can use or log in to understand the affiliated parties of the Emperor (such as today's headlines, watermelon videos), and get related services or use related functions.", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 52939, "text": "(4) When you need to use your identity authentication or related services, according to relevant laws and regulations, you may need to provide your real identity information (real name, ID number, and other information required for real -name authentication) to complete to complete to completeReal -name verification.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use your identity authentication function or related services, according to relevant laws and regulations, you may need to provide your real identity information (real name, ID number, and other information required for real -name authentication) to complete the real -name verification."}
{"task": "rw_47.jsonl", "id": 52940, "text": "This information is a personal sensitive information. You can refuse to provide it. If you refuse to provide you, you may not be able to obtain related services, but do not affect the normal use of other functions and services.", "label": ["First Party Collection Information", "Risk"], "rewrite": []}
{"task": "rw_47.jsonl", "id": 52941, "text": "2. Information browsing and consulting services", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 52942, "text": "(1) In order to ensure the quality of the recommended content and recommend the information that may be interested in or provide you with the consultant consulting service that is more suitable for you, we may collect the necessary log information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may collect the necessary log information."}
{"task": "rw_47.jsonl", "id": 52943, "text": "(2) Log information used for information display and consulting services includes:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_47.jsonl", "id": 52944, "text": "The behavior information you operate and use: click, follow, collect, search, browse, and share", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_47.jsonl", "id": 52945, "text": "The information you provide: feedback, release, likes, comments", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_47.jsonl", "id": 52946, "text": "Geographical location information: GPS information, WLAN access point, Bluetooth and base station and other sensor information", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect geographical location information: GPS information, WLAN access points, Bluetooth and base stations and other sensor information."}
{"task": "rw_47.jsonl", "id": 52947, "text": "(3) GPS information is a sensitive personal information. If you refuse to provide it, we will not recommend information to you according to GPS information, and will not affect the normal use of other functions of the Emperor.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "GPS information is a sensitive personal information. If you refuse to provide it, we will not recommend information to you according to GPS information, and will not affect the normal use of other functions of the Emperor."}
{"task": "rw_47.jsonl", "id": 52948, "text": "(4) We will show you, recommend local relevant information in your area or provide corresponding consulting services based on the cities corresponding to the IP address.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We will show you, recommend local relevant information in your area or provide corresponding consulting services based on the cities corresponding to the IP address."}
{"task": "rw_47.jsonl", "id": 52949, "text": "(5) The above information we collected and used is identified. The data analysis only corresponds to the coding that cannot directly associate your identity and will not be associated with your true identity.", "label": ["Important", "First Party Collection Information"], "rewrite": "We collected and used the above information to identify it. The data analysis only corresponds to a specific code that cannot directly associate your identity and will not be associated with your true identity."}
{"task": "rw_47.jsonl", "id": 52950, "text": "3. Provide you with information release function or service", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 52951, "text": "(1) When you publish content, comments, evaluations, questions or answers, we will collect the information you published and show your nickname, avatar, publishing content, etc.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you publish content, comments, evaluations, questions, or answers, we will collect the information you posted and show your nicknames, avatars, publishing content, etc."}
{"task": "rw_47.jsonl", "id": 52952, "text": "(2) When you use uploading pictures and publishing audio and video functions, we will ask you to authorize the camera, album (storage), photos, microphone rights.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use uploading pictures and publishing audio and video functions, we will ask you to authorize cameras, albums (storage), photos, microphone rights."}
{"task": "rw_47.jsonl", "id": 52953, "text": "If you refuse to authorize, you will not be able to use this function, but it will not affect the other functions of \"Knowing the Emperor\" normally.", "label": ["Permission Acquisition", "Important", "Risk"], "rewrite": "If you refuse to authorize, you will not be able to use this function, but it will not affect the other functions of \"Knowing the Emperor\" normally."}
{"task": "rw_47.jsonl", "id": 52954, "text": "(3) When you publish the information and select the display location, we will ask you to authorize the geographical location permissions and collect location information related to this service.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you publish information and select the display location, we will request you to authorize geographical location permissions and collect location information related to this service."}
{"task": "rw_47.jsonl", "id": 52955, "text": "If you refuse to authorize, you will not be able to use this function, but it will not affect the other functions of \"Knowing the Emperor\" normally.", "label": ["Permission Acquisition", "Important", "Risk"], "rewrite": "If you refuse to authorize, you will not be able to use this function, but it will not affect the other functions of \"Knowing the Emperor\" normally."}
{"task": "rw_47.jsonl", "id": 52956, "text": "(4) When using the live broadcast function, according to the requirements of laws and regulations, you may need to perform real -name authentication through \"face recognition\" to verify your identity.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "When you use the live broadcast function, according to the requirements of laws and regulations, you may need to perform real -name authentication through the \"face recognition\" method to verify your identity."}
{"task": "rw_47.jsonl", "id": 52957, "text": "In the process of real -name authentication, we and third -party certification agencies that provide certification services need you to provide real names, ID numbers, facial feature values, and other information required for real -name authentication.", "label": ["Important", "First Party Collection Information"], "rewrite": "We and a third -party certification agency providing certification services require you to provide real names, ID numbers, facial features, and other information required for real -name certification."}
{"task": "rw_47.jsonl", "id": 52958, "text": "In addition, in order to realize the live broadcast function, we will ask you to authorize the camera and microphone rights.", "label": ["Permission Acquisition", "Important"], "rewrite": "In order to realize the live broadcast function, we will ask you to authorize the camera and microphone rights."}
{"task": "rw_47.jsonl", "id": 52959, "text": "This information is personal sensitive information. You can refuse to provide it without affecting the normal use of other functions of the Emperor.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "This information is personal sensitive information. You can refuse to provide it without affecting the normal use of other functions of the Emperor."}
{"task": "rw_47.jsonl", "id": 52960, "text": "This information is for the purpose stipulated in the real -name certification and laws and regulations. It will not be used as other purposes without authorization.", "label": ["Important", "First Party Collection Information"], "rewrite": "This information is for the purpose stipulated in the real -name certification and laws and regulations. It will not be used as other purposes without authorization."}
{"task": "rw_47.jsonl", "id": 52961, "text": "4. Provide you with interactive functions or services", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 52962, "text": "(1) When you take the initiative to pay attention to your interesting account, topic, and interact with them, we will collect your attention accounts when browsing, commenting, collecting, praising, or sharing content.Essence", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect the account you follow and show you the content of your account publishing."}
{"task": "rw_47.jsonl", "id": 52963, "text": "(2) You know and agree, for your contact information (for example: contact telephone number) provided by your use of products and/or services, we may send one or more of them in operationNotice, used for user messages, authentication, security verification, user experience research research, etc.;", "label": ["Important", "First Party Collection Information"], "rewrite": "We may send multiple types of notifications to one or more in operation, for user messages, authentication, security verification, and user experience research."}
{"task": "rw_47.jsonl", "id": 52964, "text": "In addition, we may also provide you with the use of commercial information such as services, functions or activities that you may be interested in through text messages and telephones that are collected in the aforementioned process.I would like to accept this information. You can be withdrawn through the withdrawal method provided in the mobile phone text message, or you can contact us directly to the withdrawal.", "label": ["Edit/Control", "First Party Collection Information", "Important"], "rewrite": "We may also use SMS and telephone to provide you with the use of commercial information such as services, functions or activities that you may be interested in through SMS and telephones."}
{"task": "rw_47.jsonl", "id": 52965, "text": "(3) In order to achieve the sharing function of the oral order, we need to access your shear plate, and read the passwords, sharing codes, and links contained in it to achieve functions or services such as jumping, sharing, and activity linkage.", "label": ["Important", "First Party Collection Information"], "rewrite": "We need to access your shear board and read the passwords, sharing code, and links contained in it to achieve functions or services such as jumping, sharing, and activity linkage."}
{"task": "rw_47.jsonl", "id": 52966, "text": "5. Provide you with search, vehicle information display, inquiry, new car listing reminder service", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 52967, "text": "(1) When you use the search service of \"Knowing the Emperor\", we will collect your search keyword information and log records.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the search service of \"Knowing the Emperor\", we will collect your search keyword information and log records."}
{"task": "rw_47.jsonl", "id": 52968, "text": "In order to provide efficient search services, some of the aforementioned information will be temporarily stored in your local storage device, and you can show you the search results and search history records.", "label": ["Data Retention", "Important"], "rewrite": "Some of the aforementioned information will be temporarily stored in your local storage device, and you can show you the content of the search results and search history."}
{"task": "rw_47.jsonl", "id": 52969, "text": "(2) To help you find the vehicle you need quickly, we may collect your equipment information and browser types to provide you with the best way to display vehicle information display.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may collect your equipment information and browser types to provide you with the best way to display vehicle information display."}
{"task": "rw_47.jsonl", "id": 52970, "text": "We will also use your above personal information to continuously improve and optimize the above functions.", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 52971, "text": "(3) When you understand the \"take pictures and know the car\" function of the Emperor, we will ask you to authorize the camera, album (storage) permissions, collect the photos in the above function process to realize the feedback function, and further optimize the service to improve you to improve youExperience experience.", "label": ["Permission Acquisition", "Important"], "rewrite": "When using the \"photo -recognition car\" function of the car emperor, we will ask you to authorize the camera, album (storage) permissions, and collect the photos in the above function process to achieve the feedback function."}
{"task": "rw_47.jsonl", "id": 52972, "text": "If you refuse to authorize, you will not be able to use this function, but it will not affect the other functions of \"Knowing the Emperor\" normally.", "label": ["Permission Acquisition", "Important", "Risk"], "rewrite": "If you refuse to authorize, you will not be able to use this function, but it will not affect the other functions of \"Knowing the Emperor\" normally."}
{"task": "rw_47.jsonl", "id": 52973, "text": "(4) When you understand the \"listing reminder\" function of the Emperor, we will ask you to grant the permissions of the calendar so that you can understand the information of the new car listing in time.", "label": ["Permission Acquisition", "Important"], "rewrite": "When using the \"listing reminder\" function of the Emperor, we will ask you to grant the permission of the calendar so that you can learn about the information of the new car in time."}
{"task": "rw_47.jsonl", "id": 52974, "text": "If you refuse to authorize, this function will not be used, but it will not affect other functions of \"understanding the Emperor\" normally.", "label": ["Permission Acquisition", "Important", "Risk"], "rewrite": "If you refuse to authorize, this function will not be used, but it will not affect other functions of \"understanding the Emperor\" normally."}
{"task": "rw_47.jsonl", "id": 52975, "text": "6. Carry out marketing activities", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 52976, "text": "When you choose to participate in the relevant marketing activities organized by the Emperor, you may need to provide you with name, communication address, contact information, ID number, bank account information according to the event.", "label": ["Important", "First Party Collection Information"], "rewrite": "When choosing to participate in the relevant marketing activities organized by the Emperor, according to the event, you may need to provide you with name, communication address, contact information, ID number, and bank account information."}
{"task": "rw_47.jsonl", "id": 52977, "text": "This information may include personal sensitive information. If you refuse to provide this information, it may affect your participation in related activities or receive prizes, but it will not affect other functions.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "This information may include personal sensitive information. If you refuse to provide this information, it may affect your participation in related activities or receive prizes, but it will not affect other functions."}
{"task": "rw_47.jsonl", "id": 52978, "text": "7. Purchase preferential equity order, payment function", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 52979, "text": "(1) When you understand the special promotion, group purchase discounts, financial discounts and other car purchase preferential rights and interest activities by knowing the participation of car dealers/manufacturers/groups and related financial service providers, you need to provide your contact during the order.Telephone, at the same time, the order will indicate the content of the preferential equity content, specific order number, order creation time, the amount of intent to pay (if any), and the preferential equity provider information. We collect this information isIn order to help you successfully complete the purpose of locking the preferential rights and interests of the car purchase, protecting your transaction security, querying order information, and providing customer service and after -sales service.", "label": ["Important", "First Party Collection Information"], "rewrite": "You need to provide your contact phone number. At the same time, the order will indicate that the content of the preferential equity content, specific order number, order creation time, the amount/deposit amount (if.)Essence"}
{"task": "rw_47.jsonl", "id": 52980, "text": "We will collect the order information you generated during our service to display it to you to manage the order.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect the order information you generated during our service to display it to you to manage the order."}
{"task": "rw_47.jsonl", "id": 52981, "text": "(2) For the preferential rights and interests of some car purchase, you need to pay a certain amount of intention gold/deposit for locking in preferential rights. After you place an order, you can choose the payment service provided by a third -party payment institution that you know to cooperate with the Emperor.", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 52982, "text": "We need to share your order transaction amount information and order payment related information with these payment institutions to achieve its payment instructions and complete the payment.", "label": ["Important", "First Party Collection Information"], "rewrite": "We need to share your order transaction amount information and order payment related information with these payment institutions to achieve its payment instructions and complete the payment."}
{"task": "rw_47.jsonl", "id": 52983, "text": "In order to allow us to learn and confirm your payment progress and status in a timely manner, and provide you with after -sales and dispute solutions, you agree that we can collect and pay the progress related information from the transaction objects you choose or other financial institutions you choose.", "label": ["Important", "First Party Collection Information"], "rewrite": "You agree that we can collect and pay the progress related information from the transaction objects you choose or other financial institutions you choose."}
{"task": "rw_47.jsonl", "id": 52984, "text": "8. customer service", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 52985, "text": "(1) When you contact us or submit consultations, complaints, dispute disputes, etc., in order to ensure your account and system security, we need you to provide the necessary personal information to verify your identity and provide you with related services.", "label": ["Important", "First Party Collection Information"], "rewrite": "You agree that we can collect and pay the progress related information from the transaction objects you choose or other financial institutions you choose."}
{"task": "rw_47.jsonl", "id": 52986, "text": "(2) In order to facilitate you, help you solve the problem or record related issues as soon as possible, we may save your communication/call records and related content with us (including account information, order information, you to prove to prove it to proveOther information provided by related facts, or contact information you leave).", "label": ["Important", "First Party Collection Information"], "rewrite": "We may save your communication/call records and related content (including account information, order information, other information you provided in order to prove the relevant facts, or the contact information you leave)."}
{"task": "rw_47.jsonl", "id": 52987, "text": "(3) In order to provide reasonable needs of services and improve service quality, we may also use your other information, including the relevant information you provided when you contact the customer service.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may also use your other information, including the relevant information you provided when you contact your customer service."}
{"task": "rw_47.jsonl", "id": 52988, "text": "9. Safety of product, service and user use safety", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 52989, "text": "(1) Safety guarantee function", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 52990, "text": "We are committed to providing you with a safe, credible product and use environment, and providing high -quality and reliable services is our core goal.", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 52991, "text": "The information collected for the security guarantee function is a necessary information.", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 52992, "text": "(2) Equipment information and log information", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 52993, "text": "Base stations, software version numbers, network access methods, types, status, network quality data, operation, use, service log.", "label": ["Important", "First Party Collection Information"], "rewrite": "Type, status, network quality data, operation, use, service log."}
{"task": "rw_47.jsonl", "id": 52994, "text": "b. In order to prevent malicious procedures and safe operations, we will collect the installation of the application information or the process information of the current operation, the overall operation of the application, the frequency of use, the application collapse, the overall installation of usage, performance data, application, application, application, applicationsource.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect the installation application information or the process information that is running, the overall operation of the application, the usage and frequency, the application crash, the overall installation usage, performance data, and the source of application."}
{"task": "rw_47.jsonl", "id": 52995, "text": "c. We may use your account information, equipment information, service log information, and our related companies and partners to obtain information that you can share or shared according to law to judge account security, conduct authentication, test and prevent security incidents.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may use your account information, equipment information, service log information, and our related companies and partners to obtain information that you can share or shared according to law to judge account security, verify, test and prevent security incidents."}
{"task": "rw_47.jsonl", "id": 52996, "text": "10. Others", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 52997, "text": "(1) When you want to contact the relevant service provider directly in the application, we will apply for phone permissions. The purpose of applying for this permissions is only to help you hang your mobile phone dial -up keyboard and display the other party's phoneDial by phone, please rest assured that we will not get your phone number and call content through this permissions, nor will we call without your knowledge.", "label": ["Permission Acquisition", "Important"], "rewrite": "We will apply for phone permissions. The purpose of applying for this permissions is only to help you hang your mobile phone dial -up keyboard and display the other party's phone to realize that you can make a phone call in the APP."}
{"task": "rw_47.jsonl", "id": 52998, "text": "If you refuse to provide authorization, you will not be able to use this function, but it will not affect your normal use of other functions of the Emperor of the Emperor.", "label": ["Permission Acquisition", "Important", "Risk"], "rewrite": "If you refuse to provide authorization, you will not be able to use this function, but it will not affect your normal use of other functions of the Emperor of the Emperor."}
{"task": "rw_47.jsonl", "id": 52999, "text": "(2) In order to improve your efficiency and experience of inquiry and appointment consultation/test drive session, we will help you fill in your login or recent inquiry on the page where you conduct inquiry and appointment consultation/test drive.The mobile phone number used (displayed in the middle four -bit encryption processing), and it will only be shared based on your authorization after you click the submission button.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "We will help you fill in your phone number when you log in to you in advance when you log in or retain your mobile phone number (four -bit encryption processing at the time of display) when you log in to your login."}
{"task": "rw_47.jsonl", "id": 53000, "text": "If you refuse to use the mobile phone number pre -filled function, you can also actively enter the relevant information on the page and continue to use our product/service.", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53001, "text": "(2) Your personal information we may get from the third party", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53002, "text": "1. When you log in to \"Knowing the Emperor\" with a third -party account, after your explicit consent, we will collect the nicknames, avatars, regions, gender and other information you have authorized by the third -party account.", "label": ["Important", "First Party Collection Information"], "rewrite": "After your explicit consent, we will collect the nicknames, avatars, regions, gender and other information of the third -party account."}
{"task": "rw_47.jsonl", "id": 53003, "text": "2. Users that users are collected by our products or services, such as the information published by other users may contain some of your information (such as: comments, comments, release graphics, audio and video involvedInformation).", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53004, "text": "3. You can fill in the reserved information filled in the reserved information from the products or services provided by our affiliated parties (eum of the relevant reserved reserved capital when you use the \"car emperor channel in today's\" today's headlines \"information).", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the information you filled in in the product or service provided by your related parties to the Emperor."}
{"task": "rw_47.jsonl", "id": 53005, "text": "4. In order to provide better services (such as more accurate personalized recommendations), if you understand the emperor's inquiry from relevant auto dealers, manufacturers and groups, and you finally buy through these auto dealers, manufacturers and groups.Related vehicles, you agree to understand the actual transaction situation (excluding personal sensitive information) under the premise of these auto dealers, manufacturers and groups.", "label": ["Important", "First Party Collection Information"], "rewrite": "You agree to collect your actual transactions (excluding personal sensitive information) on the premise of understanding the licenses of these auto dealers, manufacturers and groups."}
{"task": "rw_47.jsonl", "id": 53006, "text": "(3) Treatment of changes in collecting and using personal information.", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53007, "text": "Please understand that with the development of our business, it may be adjusted and changed to the function of \"understanding the Emperor\" and the services provided.", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53008, "text": "In principle, when the new features or services are related to the functions or services we are currently provided, the personal information collected and used will be directly or reasonable to the original processing purpose.", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53009, "text": "In the scenario that is not directly or reasonable to be related to the purpose of the original treatment, we collect and use your personal information will be inform again and obtain your consent.", "label": ["Important", "First Party Collection Information"], "rewrite": "We collect and use your personal information, we will inform again and obtain your consent."}
{"task": "rw_47.jsonl", "id": 53010, "text": "(4) Removal of personal information that obtains consent and use in accordance with the law", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53011, "text": "Please understand that in the following situations, according to laws and regulations and related national standards, we collect and use your personal information without obtain your authorization consent:", "label": ["Important", "First Party Collection Information"], "rewrite": "In the following situations, according to laws and regulations and related national standards, we collect and use your personal information without obtain your authorization consent:"}
{"task": "rw_47.jsonl", "id": 53012, "text": "(1) Directly related to national security and national defense security;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting personal information directly related to national security and national defense security does not need to solicit consent."}
{"task": "rw_47.jsonl", "id": 53013, "text": "(2) Directly related to public safety, public health, and major public interests;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect personal information directly related to public safety, public health, and major public interests without soliciting consent."}
{"task": "rw_47.jsonl", "id": 53014, "text": "(3) Directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect direct personal information related to criminal investigation, prosecution, trial, and execution of judgments without asking for consent."}
{"task": "rw_47.jsonl", "id": 53015, "text": "(4) For major legitimate rights and interests such as the life and property of the subject of personal information or other individuals, it is difficult to get my consent;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting and maintaining major legitimate rights and interests but difficult to get personal information that I agree, without asking for consent."}
{"task": "rw_47.jsonl", "id": 53016, "text": "(5) The collected personal information is made to the public by yourself;", "label": ["Important", "First Party Collection Information"], "rewrite": "The collected your personal information is publicly disclosed to the public by itself without asking for consent."}
{"task": "rw_47.jsonl", "id": 53017, "text": "(6) Your personal information collected from the information disclosed by legal publicly disclosed, such as legal news reports and government information disclosure;", "label": ["Important", "First Party Collection Information"], "rewrite": "Your personal information collected from the legal disclosure information does not need to ask for consent."}
{"task": "rw_47.jsonl", "id": 53018, "text": "(7) Sign or perform the contract according to your requirements;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collection of personal information necessary for signing or performing the contract does not need to solicit consent."}
{"task": "rw_47.jsonl", "id": 53019, "text": "(8) It is necessary to maintain the safe and stable operation of \"understanding the Emperor\" and related services.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting the personal information necessary for the safe and stable operation of \"understanding the Emperor\" and related services, there is no need to solicit consent."}
{"task": "rw_47.jsonl", "id": 53020, "text": "(9) It is necessary for legal news reports;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting the personal information necessary for legal news reports does not need to solicit consent."}
{"task": "rw_47.jsonl", "id": 53021, "text": "(10) Academic research institutions are necessary to carry out statistics or academic research based on public interests, and provide the results of academic research or descriptions, to identify the personal information contained in the result;", "label": ["Important", "First Party Collection Information"], "rewrite": "Academic research institutions are necessary to carry out statistics or academic research based on public interests, and when providing results to the outside world, it is not required to identify the personal information contained in the results without asking for consent."}
{"task": "rw_47.jsonl", "id": 53022, "text": "(11) Other circumstances stipulated in laws and regulations.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you collect personal information under other circumstances stipulated in laws and regulations, you do not need to solicit consent."}
{"task": "rw_47.jsonl", "id": 53023, "text": "Special prompt you note that if the information cannot be identified alone or in combination with other information, it is not your personal information in the legal sense;", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53024, "text": "When your information can identify your personal identity alone or in combination with other information, or we will not be able to connect with any specific personal information with other personal information combined with other personal information, this information will be used as you during combination.Personal information is handled and protected in accordance with this privacy policy.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53025, "text": "Second, the use of cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53026, "text": "Cookie and similar technologies are common common technologies in the Internet.", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53027, "text": "When you use \"Knowing the Emperor\" and related services, we may use related technologies to send one or more cookies or anonymous identifies to your device to collect and store information when you access and use the product.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may use related technologies to send one or more cookies or anonymous identifies to your device to collect and store information when you access and use this product."}
{"task": "rw_47.jsonl", "id": 53028, "text": "We use cookies and similar technologies to achieve the following functions or services:", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53029, "text": "(1) Ensure the safety and efficient operation of products and services", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53030, "text": "We may set up Cookie, or anonymous identifier that guarantees security, so that we can confirm whether you log in to the service safely, or whether you encounter illegal behaviors such as stolen or fraud.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "We may set COOKIE or anonymous identifier that guarantees security and security."}
{"task": "rw_47.jsonl", "id": 53031, "text": "These technologies also help us improve service efficiency, improve login and response speed.", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53032, "text": "(2) Help you get a easier access experience", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53033, "text": "Using this kind of technology can help you save the steps and processes of your personal information and enter search content (example: record search, form filling).", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53034, "text": "(3) Recommend, display, and push the content or account you may be interested in", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53035, "text": "We may use cookies and similar technologies to understand your preferences and use habits, conduct consultation or data analysis, to improve information or functions that users are interested in, and optimize your choice of advertising.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may use cookies and similar technologies to understand your preferences and use habits, and conduct consultation or data analysis."}
{"task": "rw_47.jsonl", "id": 53036, "text": "In the sharing page of the Emperor, we may use Cookie to record the browsing activities to recommend information and investigate the collapse, delay related abnormal conditions, and explore better service methods.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In the sharing page of the Emperor, we may use Cookie to record the browsing activities."}
{"task": "rw_47.jsonl", "id": 53037, "text": "Most browsers provide users with the function of removing browser cache data. You can perform the corresponding data clearance operation in the browser settings function.", "label": ["Important", "Edit/Control"], "rewrite": "Most browsers provide users with the function of removing browser cache data. You can perform the corresponding data clearance operation in the browser settings function."}
{"task": "rw_47.jsonl", "id": 53038, "text": "If you are cleared, you may not be able to use the services or corresponding functions provided by the company by the company by the company because of these modifications.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "If you are cleared, you may not be able to use the services or corresponding functions provided by the company by the company by the company because of these modifications."}
{"task": "rw_47.jsonl", "id": 53039, "text": "3. How do we store personal information", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53040, "text": "(1) Place of information storage", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53041, "text": "In accordance with the provisions of laws and regulations, we will store your personal information collected and generated during the domestic operation process in the territory of the People's Republic of China.", "label": ["Data Retention", "Important"], "rewrite": "In accordance with the provisions of laws and regulations, we will store your personal information collected and generated during the domestic operation process in the territory of the People's Republic of China."}
{"task": "rw_47.jsonl", "id": 53042, "text": "At present, we will not transmit the above information overseas. If we transmit to overseas, we will follow the provisions of laws and regulations and solicit your self -choice consent.", "label": ["Data Retention", "Important"], "rewrite": "We will not transmit the above information abroad. If we transmit them overseas, we will follow the provisions of laws and regulations and solicit your independent choice."}
{"task": "rw_47.jsonl", "id": 53043, "text": "(2) Storage period", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53044, "text": "We only retain your personal information during the period for providing the purpose of \"understanding the Emperor\" and related services, and the information, comments, likes and other information you posted, during the period of not being withdrawn, deleted or unable to cancel the account,We will retain relevant information.", "label": ["Data Retention", "Important"], "rewrite": "We only retain your personal information during the period of providing the purpose of \"understanding the Emperor\" and related services. We will retain relevant information when you have not withdrawn, delete or cancel accounts."}
{"task": "rw_47.jsonl", "id": 53045, "text": "After exceeding the necessary period, we will delete or processes your personal information, except for other regulations.", "label": ["Data Retention", "Important"], "rewrite": "After exceeding the necessary period, we will delete or processes your personal information, except for other regulations."}
{"task": "rw_47.jsonl", "id": 53046, "text": "4. How do we share, transfer, and publicly disclose personal information", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53047, "text": "(1) Sharing and transfer of personal information", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53048, "text": "We will not share and transfer your personal information from a third party, unless you have authorized the consent in advance, or the personal information that shared or transferred is the information after identifying the processingmain body.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not share and transfer your personal information from a third party, unless you have authorized the consent in advance, or the personal information that shared or transferred is the information after identifying the processingmain body."}
{"task": "rw_47.jsonl", "id": 53049, "text": "1. In the following circumstances, after your self -choice consent, we may share the personal information that we may share", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53050, "text": "(1) Share it to realize related functions or services with related parties and partners", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53051, "text": "a. Vehicle inquiry function:", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53052, "text": "In order to ensure the consistency of the services that you and the affiliates provided by the affiliated parties, and to facilitate the unified management of your information, we may share your personal information with these related parties.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53053, "text": "We may have to related car dealers, manufacturers and groups (including but not limited to dealers you actively choose, and when you choose only the brand and not clearly select the specific dealer, we are based on the dealers and dealers who are recommended for you according to your area.In order to better match your needs, we combine the brand/model you choose to share with the same high -quality dealers of your area where you are recommended by you) to share your information in the form.Use in -use (for example, contact you in time).", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share the information you actively provided in the form for relevant car dealers, manufacturers and groups."}
{"task": "rw_47.jsonl", "id": 53054, "text": "In addition, in order to ensure that you get a better service experience, we may share with relevant auto dealers, manufacturers and groups that are difficult to identify with your personal identity.Related contact content and contact time are more in line with your needs).", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share with relevant auto dealers, manufacturers and groups that are difficult to identify with your personal identity. The necessary user portrait label information is used and used it within a legal and legitimate range."}
{"task": "rw_47.jsonl", "id": 53055, "text": "We may follow your choice (for example, you can make inquiries through the entrance of the \"Installation of the Car\", take the initiative to select \"Get 10 % Payment Payment Payment Plan\", improve the inquiry information page after the inquiry is completedChe Di showed that there is a installment intention to purchase car purchase during the phone call, and only when the brand is not clearly selected to choose the specific service provider when inquiry), and our business partners (such as related car dealers, manufacturers and groups with installment car purchase service capabilities,The necessary personal information of the Automobile Financing Leasing Platform/Company, Automobile Financial Company, Second -hand Car Platform, Automobile Related Service and Information Platform) shared the necessary personal information and used it within a legal and legitimate range (for example, contact you in time and provide you with the above and providing you and the above and providing youCar -related functions or services);", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share the necessary personal information with our business partners based on your choice and use it within a legal and legitimate range."}
{"task": "rw_47.jsonl", "id": 53056, "text": "In addition, in order to ensure that you get a better service experience, we may share part of the necessary information after the identification processing with our business partners, and use it within the legal and legitimate range (such as promoting related services or functions that can be promoted to be possible.Better match your needs and provide you with stronger associations).", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share part of the necessary information after the identification processing with our business partners, and use it within a legally legitimate range."}
{"task": "rw_47.jsonl", "id": 53057, "text": "We have to contact you with affiliated companies, related car dealers, manufacturers, groups, and other business partners to meet your needs.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may contact you with affiliated companies, related car dealers, manufacturers, groups, and other business partners to meet your needs."}
{"task": "rw_47.jsonl", "id": 53058, "text": "It may also send you information about products, services or related activities on a regular basis.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may also send you information about products, services or related activities on a regular basis."}
{"task": "rw_47.jsonl", "id": 53059, "text": "b. Payment function: Payment function will provide you with a third -party payment institution that cooperates with us.", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53060, "text": "Third -party payment institutions may need to collect your name, bank card type and card number, validity period and mobile phone number.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Third -party payment institutions may need to collect your name, bank card type and card number, validity period and mobile phone number."}
{"task": "rw_47.jsonl", "id": 53061, "text": "The bank card number and the validity period are personal sensitive information. This information is the required information for payment functions. It refuses to provide normal use that will cause you to be unable to use this function, but does not affect the normal use of other functions.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "The bank card number and the validity period are personal sensitive information. This information is the required information for payment functions. It refuses to provide normal use that will cause you to be unable to use this function, but does not affect the normal use of other functions."}
{"task": "rw_47.jsonl", "id": 53062, "text": "c. Wallet function: The related services in the wallet function are provided by our related parties and partners. When you use wallet -related functions, our related parties and partners will collect information within the necessary limit according to the function or service.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "When you use wallet -related functions, our affiliates and partners will collect information within the necessary limit according to the function or service."}
{"task": "rw_47.jsonl", "id": 53063, "text": "d. Order function: When you use the \"My Order\" function, we may share your order information with the relevant service provider placed by order to realize your needs for purchasing goods or services from it, and to promote it to completeSubsequent service.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When you use the \"My Order\" function, we may share your order information with the relevant service provider placed by order."}
{"task": "rw_47.jsonl", "id": 53064, "text": "e. When you use the functions provided by our affiliated parties, third parties, or when software service providers, smart equipment providers, system service providers are used to provide you with services with usThe information necessary for the business shared with these related parties and third parties.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you understand the functions provided by our affiliates and third parties in the use of the Emperor, we will share the information necessary for the business to share with these related parties and third parties."}
{"task": "rw_47.jsonl", "id": 53065, "text": "f. Login and bind other products: When you log in to third -party products or services with your account, or bind your account with other third -party accounts. After your consent, we will make your nicknames, avatars, attention, fans, etc.The communication relationship and other information you authorize are shared with the aforementioned product or service.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When you log in to a third -party product or service with your account, or bind your account with other third -party accounts. After your consent, we will share your communication relationship and other information you authorize with the aforementioned product or service."}
{"task": "rw_47.jsonl", "id": 53066, "text": "g. Geographical location service: When you use the function of geographical location (such as nearby dealers and other functions), we will share your equipment logo information and GPS information with location service provider (Gaode Map) to share with youFeedback geographical results.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When you use geographical location -related services (such as nearby dealers and other functions), we will share your equipment identification information and GPS information with location service provider (Gaode Map)."}
{"task": "rw_47.jsonl", "id": 53067, "text": "If you refuse to provide GPS information, it will affect the geographical location service function, but it will not affect the normal use of other functions.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide GPS information, it will affect the geographical location service function, but it will not affect the normal use of other functions."}
{"task": "rw_47.jsonl", "id": 53068, "text": "(2) Realizing advertising -related shared information", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53069, "text": "a. Advertising push: We may share information with partners who commissioned us to promote and advertising, but we will not share information that uses your personal identity, such as your name, ID number, etc.Partners provide indirect portrait labels and information that can be identified or anonymous to identify your personal identity to help them increase the effective touch rate of advertising without identifying your personal identity.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share information with partners who entrust us to promote and advertise, but we will not share information that uses your personal identity."}
{"task": "rw_47.jsonl", "id": 53070, "text": "b. Advertising statistics: We may share and analyze de -identified device information or statistical information with business service providers, suppliers and other partners. This information is difficult to associate with your identity information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share the analysis of de -identified device information or statistical information with business service providers, suppliers and other partners, which is difficult to associate with your identity information."}
{"task": "rw_47.jsonl", "id": 53071, "text": "This information will help us analyze and measure the effectiveness of advertising and related services.", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53072, "text": "(3) Help you participate in marketing promotion activities", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53073, "text": "When you choose to participate in related marketing activities organized by us and our affiliates or third parties, you may need to provide you with name, communication address, contact information, and bank account information according to the event.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "When you choose to participate in related marketing activities organized by us and our affiliates or third parties, you may need to provide you with name, communication address, contact information, and bank account information according to the event."}
{"task": "rw_47.jsonl", "id": 53074, "text": "This information may include personal sensitive information (such as personal phone number). If you refuse to provide this information, it may affect your participation in related activities or receive prizes, but it will not affect other functions.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "When you choose to participate in related marketing activities organized by us and our affiliates or third parties, you may need to provide you with name, communication address, contact information, and bank account information according to the event."}
{"task": "rw_47.jsonl", "id": 53075, "text": "After your explicit consent, we will share the above information with a third party to ensure that you have consistent services in the joint event, or entrust a third party to provide you with prizes in time.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After your explicit consent, we will share the above information with the third party."}
{"task": "rw_47.jsonl", "id": 53076, "text": "(4) Sharing information of safety and analysis statistics", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53077, "text": "a. Guarantee use of security: We attach great importance to accounts and service security. In order to ensure the security of your and other users' accounts and property security, so that you and our legitimate rights and interests are exempted from illegal infringement. We may share with related companies or service providers to shareThe necessary device, account number and log information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share the necessary equipment, accounts and log information with affiliated companies or service providers."}
{"task": "rw_47.jsonl", "id": 53078, "text": "b. Analysis of product usage: In order to analyze the usage of our services and enhance the experience of user use, the statistical data of the use of products (collapse, flashing) with related parties or third parties may beCombine your personal identity.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share the statistical data of the use of products (collapse, flashing) with related parties or third parties, and it is difficult to combine your personal identity with other information."}
{"task": "rw_47.jsonl", "id": 53079, "text": "2. Sharing principle", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53080, "text": "(1) The principle of authorization consent: sharing your personal information from our related parties and third parties, you need to pass your authorization consent. Unless the share of personal information is to identify the information after the processing, and sharing third parties cannot re -identify the third parties.The natural person of this kind of information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Sharing your personal information from our affiliated parties and third parties need to be authorized by your authorization. Unless the shared personal information is to identify the information after the processing, and sharing third parties cannot re -identify such information."}
{"task": "rw_47.jsonl", "id": 53081, "text": "If the purpose of related parties and third parties use information to surpass the scope of the original authorization consent, they need to re -obtain your consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If the purpose of related parties and third parties use information to surpass the scope of the original authorization consent, they need to re -obtain your consent."}
{"task": "rw_47.jsonl", "id": 53082, "text": "(2) Principles of legitimate legitimacy and minimum:, data shared to related parties and third parties must have a legal and legitimate purpose, and the shared data is limited to the purpose of achievement.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "The data shared from related parties and third parties must have a legitimate and legitimate purpose, and the shared data is limited to the purpose of achieving the goal."}
{"task": "rw_47.jsonl", "id": 53083, "text": "(3) Principles of security and prudential: We will carefully evaluate the purpose of sharing information to use shared information to use shared information, comprehensively evaluate the security and guarantee capabilities of these partners, and ask them to follow the legal agreement of cooperation.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will carefully evaluate the purpose of sharing information for related parties and third -party data, comprehensively evaluate the security and guarantee capabilities of these partners, and ask them to follow the legal agreement of cooperation."}
{"task": "rw_47.jsonl", "id": 53084, "text": "We will strictly monitor the software tool development package (SDK) and application interface (API) that the partners obtain information to protect data security.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will strictly monitor the software tool development package (SDK) and application interface (API) that the partners obtain information to protect data security."}
{"task": "rw_47.jsonl", "id": 53085, "text": "Please see the third -party SDK situation. Please see: Know the Emperor's access to a third -party SDK directory", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Please see the third -party SDK situation. Please see: Know the Emperor's access to the third -party SDK directory."}
{"task": "rw_47.jsonl", "id": 53086, "text": "3. Transfer", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53087, "text": "(1) We will not transfer your personal information to any other third party, unless you obtain your clear consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not transfer your personal information to any other third party, unless you obtain your clear consent."}
{"task": "rw_47.jsonl", "id": 53088, "text": "(2) With the continuous development of our business, we will be likely to be merged, acquired, and transfer of assets, and your personal information may be transferred as a result.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "With the continuous development of our business, we will be likely to carry out mergers, acquisitions, and asset transfer, and your personal information may be transferred as a result."}
{"task": "rw_47.jsonl", "id": 53089, "text": "When changes before, we will continue to protect your personal information in accordance with laws and regulations and the security standards that are not lower than the privacy policy.Your authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "When changes before, we will continue to protect or request personal information to continue to protect your personal information, otherwise we will ask the recipient to re -obtain your authorization consent."}
{"task": "rw_47.jsonl", "id": 53090, "text": "(2) Public disclosure of personal information", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53091, "text": "1. We will not disclose your information publicly unless it follows national laws and regulations or obtains your consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not disclose your information publicly unless it follows the provisions of national laws and regulations or obtains your consent."}
{"task": "rw_47.jsonl", "id": 53092, "text": "We publicly disclose your personal information to adopt security measures that meet the standards of the industry.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We publicly disclose your personal information to adopt security measures that meet the standards of the industry."}
{"task": "rw_47.jsonl", "id": 53093, "text": "2. When a penalty announcement of illegal accounts and fraud, we will disclose the necessary information about the relevant account.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When an announcement of illegal accounts and fraudulent behaviors, we will disclose the necessary information about the relevant account."}
{"task": "rw_47.jsonl", "id": 53094, "text": "3. The works and attention you published will be displayed on the personal homepage.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The works and attention you publish will be displayed on the personal homepage."}
{"task": "rw_47.jsonl", "id": 53095, "text": "4. When you participate in the activities organized by the platform, your avatar and nicknames may be displayed in the list, winning list and other lists.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When you participate in the activities organized by the platform, your avatar and nicknames may be displayed in the list, winning list and other lists."}
{"task": "rw_47.jsonl", "id": 53096, "text": "(3) Removal of personal information that obtains consent to sharing, transfer, and publicly disclosed in accordance with the law", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53097, "text": "Please understand that in the following situations, according to laws and regulations and national standards, we shared, transferred, and publicly disclosed your personal information without obtaining your authorization consent:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the following situations, according to laws and regulations and national standards, we shared, transferred, and publicly disclosed your personal information without obtaining your authorization consent:"}
{"task": "rw_47.jsonl", "id": 53098, "text": "(1) Directly related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Personal information directly related to national security and national defense security does not need to solicit consent."}
{"task": "rw_47.jsonl", "id": 53099, "text": "(2) Directly related to public safety, public health, and major public interests;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Personal information directly related to public safety, public health, and direct public interests does not need to solicit consent."}
{"task": "rw_47.jsonl", "id": 53100, "text": "(3) Directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Direct related personal information such as sharing with criminal investigation, prosecution, trial and judgment execution does not need to solicit consent."}
{"task": "rw_47.jsonl", "id": 53101, "text": "(4) Out of maintaining major legitimate rights and interests of your or other individuals, but it is difficult to get my consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Sharing and maintaining major legitimate rights and interests but difficult to get personal information that I agree, without asking for consent."}
{"task": "rw_47.jsonl", "id": 53102, "text": "(5) Personal information that you disclose to the public by yourself;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share personal information that you disclose to the public yourself without asking for consent."}
{"task": "rw_47.jsonl", "id": 53103, "text": "(6) Collect personal information from legal public information, such as legal news reports and government information disclosure.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you collect personal information from the legal disclosure information, you do not need to ask for consent."}
{"task": "rw_47.jsonl", "id": 53104, "text": "5. How do we protect personal information security", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53105, "text": "(1) We attach great importance to the security of your personal information, and we will strive to take reasonable security measures (including technical and management) to protect your personal information and prevent your personal information from being improperly used or unauthorizedIt was interviewed, publicly disclosed, used, modified, damaged, lost or leaked.", "label": ["Important", "Data Security"], "rewrite": "We attach great importance to the security of your personal information, and we will strive to take reasonable security measures (including technology and management) to protect your personal information."}
{"task": "rw_47.jsonl", "id": 53106, "text": "(2) We will use reasonable and feasible methods such as encryption technology and anonymous treatment that are not lower than industry peers to protect your personal information, and use a security protection mechanism to prevent your personal information from being maliciously attacked.", "label": ["Important", "Data Security"], "rewrite": "We will use reasonable and feasible methods such as encryption technology and anonymous treatment that are not lower than industry peers to protect your personal information, and use a security protection mechanism to prevent your personal information from being maliciously attacked."}
{"task": "rw_47.jsonl", "id": 53107, "text": "(3) We will establish a special security department, security management system, and data security process to ensure your personal information security.", "label": ["Important", "Data Security"], "rewrite": "We will establish a special security department, security management system, and data security process to ensure your personal information security."}
{"task": "rw_47.jsonl", "id": 53108, "text": "We adopt strict data use and access systems to ensure that only authorized personnel can access your personal information and conduct security audits of data and technology in a timely manner.", "label": ["Important", "Data Security"], "rewrite": "We adopt strict data use and access systems to ensure that only authorized personnel can access your personal information and conduct security audits of data and technology in a timely manner."}
{"task": "rw_47.jsonl", "id": 53109, "text": "(4) Although the above -mentioned reasonable and effective measures have been taken and the standards required by relevant legal regulations have been adopted, please understand that due to the technical restrictions and various malicious means that possible existingSafety measures cannot always ensure 100 % security of information. We will try our best to ensure the security of our personal information.", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53110, "text": "You know and understand that the systems and communication networks you use to access our services may be due to factors outside the control scope.", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53111, "text": "Therefore, we strongly recommend that you take positive measures to protect the security of personal information, including but not limited to the use of complex passwords, regularly modify passwords, do not disclose personal information such as your account number and password, SMS verification code to others.", "label": ["Important", "Data Security"], "rewrite": "We strongly recommend that you take positive measures to protect the security of personal information, including but not limited to the use of complex passwords, regularly modify passwords, do not disclose personal information such as your account number and password, SMS verification code to others."}
{"task": "rw_47.jsonl", "id": 53112, "text": "(5) We will develop an emergency treatment plan and immediately start the emergency plan when the user information security incident occurs, and strives to prevent the impact and consequences of such security incidents from expanding.", "label": ["Important", "Data Security"], "rewrite": "We will develop an emergency treatment plan and immediately start the emergency plan when the user information security incident occurs, and strives to prevent the impact and consequences of such security incidents."}
{"task": "rw_47.jsonl", "id": 53113, "text": "Once the user information security incident (leakage, loss, etc.) occurs, we will inform you in a timely manner in accordance with the requirements of the laws and regulations: the basic situation and possible impact of security events, the disposal measures we have adopted or we will take, you can autonomous autonomous autonomySuggestions for preventing and reducing risks, remedial measures for your remedy.", "label": ["Important", "Data Security"], "rewrite": "Once the user information security incident (leakage, loss, etc.) occur, we will inform you in a timely manner in accordance with the requirements of laws and regulations: basic situations and possible impacts, disposal measures, suggestions, remedial measures, etc."}
{"task": "rw_47.jsonl", "id": 53114, "text": "We will promptly inform you in the form of push notifications, emails, letters, text messages, etc. When it is difficult to inform them one by one, we will publish an announcement in a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "We will promptly inform you in the form of push notifications, emails, letters, text messages, etc. When it is difficult to inform them one by one, we will publish an announcement in a reasonable and effective way."}
{"task": "rw_47.jsonl", "id": 53115, "text": "At the same time, we will also report to the disposal of user information security incidents in accordance with the requirements of the relevant regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "We will also report to the disposal of user information security incidents in accordance with the requirements of the relevant regulatory authorities."}
{"task": "rw_47.jsonl", "id": 53116, "text": "(6) We should particularly remind you that the personal information protection measures provided by this \"Privacy Policy\" are only applicable to \"understanding the Emperor\" and related services.", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53117, "text": "Once you leave the \"Knowing the Emperor\" and related services, browse or use other websites, services and content resources, we are not capable and obliged to protect your software and any individual submitted by software and websites other than \"Know Emperor\" and related services.Information, whether you log in, browse or use the above software, whether the website is based on the link or guidance of \"Knowing the Emperor\".", "label": ["Data Security", "Risk"], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53118, "text": "6. Your rights", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53119, "text": "We attach great importance to your management of personal information, and do our best to protect your rights of inquiries, access, modification, delete, withdrawn, withdrawing, canceling account number, complaint reports, and setting privacy functions for your personal information, so that you have sufficientCapability to ensure your privacy and security.", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53120, "text": "(1) Visit, delete, correct your personal information", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53121, "text": "You can manage your information in the following way:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53122, "text": "1. Visit personal account information:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53123, "text": "You can inquire, access, correct your avatars, user names, profiles and other basic information. You can query, access, and correct them in the \"editing information\" or \"system settings\" of the Emperor of the Emperor.", "label": ["Important", "Edit/Control"], "rewrite": "You can inquire, access, correct your avatars, user names, profiles and other basic information. You can query, access, and correct them in the \"editing information\" or \"system settings\" of the Emperor of the Emperor."}
{"task": "rw_47.jsonl", "id": 53124, "text": "2. Query access, correction, and cancel your account;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53125, "text": "Query visiting fans and visitors:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53126, "text": "Enter the Emperor Che -click \"My\" - Click \"Following\" to access the follow account, you can also cancel the attention;", "label": ["Important", "Edit/Control"], "rewrite": "Enter the Emperor Che — click \"My\" - Click \"Follow\" to access the follow account, you can also cancel your attention."}
{"task": "rw_47.jsonl", "id": 53127, "text": "Click \"Fans\" to query the number of fans -click the fan quantity to display the fan name and avatar of the fan.", "label": ["Important", "Edit/Control"], "rewrite": "Click \"Fans\" to query the number of fans -click the fan quantity to display the fan name and avatar of the fan."}
{"task": "rw_47.jsonl", "id": 53128, "text": "3. Query access, change, and delete your collection record: Click \"My\" - Click \"My Favorites\" to enter the query access and delete.", "label": ["Important", "Edit/Control"], "rewrite": "Query access, change, and delete your collection record: Click \"My\" - Click \"My Favorites\" to enter the query access and delete."}
{"task": "rw_47.jsonl", "id": 53129, "text": "4. Delete publishing content, questions and answers, content, comments content:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53130, "text": "(1) Release of content: Enter to understand the Emperor of the Che Emperor and click \"My\" to enter \"Dynamic\" — Click on the upper right corner of the single content \"...\" symbol operation and delete;", "label": ["Important", "Edit/Control"], "rewrite": "Enter the Emperor of the Che Emperor and click \"Mine\" to enter \"Dynamic\" — click on the \"...\" symbol operation to delete the \"...\" symbol operation."}
{"task": "rw_47.jsonl", "id": 53131, "text": "(2) Comment content: You can delete your comments by accessing a single comment content and accessing the page.", "label": ["Important", "Edit/Control"], "rewrite": "You can delete your comments by accessing a single comment content and accessing the page."}
{"task": "rw_47.jsonl", "id": 53132, "text": "5. Query Order: Enter the Emperor of the Che Emperor and click \"My\" — Click \"My Order\" for inquiries.", "label": ["Important", "Edit/Control"], "rewrite": "Enter the Emperor of the Che Emperor and click \"My Order\" -click \"My Order\" for query."}
{"task": "rw_47.jsonl", "id": 53133, "text": "(2) Self -selection of controlling personalized recommendation information", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53134, "text": "1. Autonomous decision to receive information", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53135, "text": "Our related information recommendation and other functions may be made according to the non -artificial automatic decision mechanism, including information systems, algorithms, etc. When you are not interested in the information we push or want to reduce certain information recommendations, you can click on the push information bar\"X\" in China, and select related reasons to block.", "label": ["Important", "Edit/Control"], "rewrite": "When you are not interested in the information we push or want to reduce some information recommendations, you can click \"X\" in the push information bar and select relevant reasons to block it."}
{"task": "rw_47.jsonl", "id": 53136, "text": "This will help you control the control and independent decision -making.", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53137, "text": "2. Autonomous subscription information required", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53138, "text": "In the follow -up channel, you will display the account information you actively choose to follow, and you can choose to pay attention or cancel your attention.", "label": ["Important", "Edit/Control"], "rewrite": "In the follow -up channel, you will display the account information you actively choose to follow, and you can choose to pay attention or cancel your attention."}
{"task": "rw_47.jsonl", "id": 53139, "text": "3. You can also contact us by logging in to the \"User Feedback\" page of the \"Understanding Emperor\" client. Your feedback will deal with the reply in time.", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53140, "text": "(3) Change your authorization consent or cancel authorization", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53141, "text": "You can turn off the scope of consent in the device's operating system or withdraw your authorization.", "label": ["Important", "Edit/Control"], "rewrite": "You can turn off the scope of consent in the device's operating system or withdraw your authorization."}
{"task": "rw_47.jsonl", "id": 53142, "text": "After withdrawal authorization, we will no longer collect information related to these permissions.", "label": ["Important", "Edit/Control"], "rewrite": "After withdrawal authorization, we will no longer collect information related to these permissions."}
{"task": "rw_47.jsonl", "id": 53143, "text": "Please understand that specific business functions and services will need your information to be completed. When you withdraw consent or authorization, we cannot continue to provide you with the function and services corresponding to the withdrawal consent or authorization.Personal information.", "label": ["Permission Acquisition", "Important", "Risk"], "rewrite": "When you withdraw or authorize, we cannot continue to provide you with the function and services corresponding to the withdrawal consent or authorization, and no longer process your corresponding personal information."}
{"task": "rw_47.jsonl", "id": 53144, "text": "But your decision to withdraw consent or authorization will not affect the company's personal information processing based on your previous authorization.", "label": ["Permission Acquisition", "Important", "Risk"], "rewrite": "But your decision to withdraw consent or authorization will not affect the company's personal information processing based on your previous authorization."}
{"task": "rw_47.jsonl", "id": 53145, "text": "(4) Logging out your account", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53146, "text": "You can apply for a cancellation account on the \"I understand the Emperor\" client \"click\" My \"-\" Edit Information \"-\" Account Logging \".", "label": ["Important", "Edit/Control"], "rewrite": "You can apply for a cancellation account on the \"I understand the Emperor\" client \"click\" My \"-\" Edit Information \"-\" Account Logging \"."}
{"task": "rw_47.jsonl", "id": 53147, "text": "For the process and content of the injection, see the \"Account Logging out\".", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53148, "text": "Before you cancel your account, we will verify your personal identity, safety status, equipment information, etc.", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53149, "text": "You know and understand that the behavior of canceling the account is irreversible behavior. When you cancel your account, we will delete relevant information about your relevant information or perform anonymous processing, except for the laws and regulations.", "label": ["Important", "Edit/Control"], "rewrite": "The behavior of canceling the account is irreversible behavior. When you cancel your account, we will delete relevant information about your relevant information or perform anonymous processing, except for the laws and regulations."}
{"task": "rw_47.jsonl", "id": 53150, "text": "(5) Complaint report", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53151, "text": "If you think your personal information rights may be infringed, or you find a clue to infringe the right to personal information (for example: believe that we collect your personal information that violates the law or the agreement between the two parties), you can use \"my\"-\"user feedback\"Contact us.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53152, "text": "We will report your complaints and reports in time after verification.", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53153, "text": "(6) Visiting Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53154, "text": "You can check all the contents of this \"Privacy Policy\" on the registration page or log in to the personal account \"My-Settings\" page or check all the contents of this \"Privacy Policy\" by understanding the homepage of the Emperor's web page.", "label": ["Important", "Edit/Control"], "rewrite": "You can check all the contents of this \"Privacy Policy\" on the registration page or log in to the personal account \"My-Settings\" page or check all the contents of this \"Privacy Policy\" by understanding the homepage of the Emperor's web page."}
{"task": "rw_47.jsonl", "id": 53155, "text": "(7) Stopping operations to inform you", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53156, "text": "If we stop operations, we will stop collecting your personal information in time, notify you in the form of notification of operation in the form of one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one service, and delete or processes your personal information.", "label": ["Important", "Cessation of Operations"], "rewrite": "If we stop operation, we will stop collecting your personal information in time, to stop the operation notification, and delete or anonymous processing of your personal information."}
{"task": "rw_47.jsonl", "id": 53157, "text": "7. Terms of minors", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53158, "text": "If you are a minor under the age of 18, you should read and agree to this \"Privacy Policy\" together under your parents or other guardian monitoring and guidance.", "label": ["Specific Audiences", "Important"], "rewrite": "Minors under the age of 18 should read and agree to this \"Privacy Policy\" under the supervision and guidance of your parents or guardians under the supervision and guidance of your parents or guardians."}
{"task": "rw_47.jsonl", "id": 53159, "text": "In accordance with the provisions of relevant national laws and regulations, the protection of personal information of minors will only collect, use, store, share, share, transfer, or disclose unpaid without legal permission, parents or other guardians who clearly agree or protect minors.Personal information of adults;", "label": ["Specific Audiences", "Important"], "rewrite": "It will only collect, use, store, share, share, transfer, transfer or disclose the personal information of minors when legal permission, parents or other guardians."}
{"task": "rw_47.jsonl", "id": 53160, "text": "If we find the personal information of minors without obtaining proven parents in advance, we will try to delete relevant information as soon as possible.", "label": ["Specific Audiences", "Important"], "rewrite": "If we find the personal information of minors without obtaining proven parents in advance, we will try to delete relevant information as soon as possible."}
{"task": "rw_47.jsonl", "id": 53161, "text": "If you are the guardian of minors, when you have any questions about the personal information of the minors you monitor, please contact us through the contact information of the privacy policy.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53162, "text": "8. Amendment and notice of privacy policy", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53163, "text": "(1) In order to provide you with better services, \"understanding the Emperor\" and related services will be updated and changed from time to time. We will revise this \"Privacy Policy\" in a timely manner.In this \"Privacy Policy\", without your clear consent, we will not reduce the rights you should enjoy based on the current effective \"Privacy Policy\".", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53164, "text": "(2) After the \"Privacy Policy\" is updated, we will issue a updated version in \"Understanding Emperor\", and remind you of the updated content through the official website announcement or other appropriate ways before the update.The latest version of this \"Privacy Policy\".", "label": ["Policy Change", "Important"], "rewrite": "After this \"Privacy Policy\" is updated, we will issue a updated version in \"Understanding the Emperor of the Car\" and remind you of the updated content through the official website announcement or other appropriate ways before the update."}
{"task": "rw_47.jsonl", "id": 53165, "text": "Nine, scope of application", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53166, "text": "This \"Privacy Policy\" is suitable for all services provided by the main body of the car emperor. In addition to the other provisions of this \"Privacy Policy\", the words used in the \"Privacy Policy\" are the sameThe meaning.", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53167, "text": "This \"Privacy Policy\" is not applicable to:", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53168, "text": "1. Other third -party products or services may include other products or websites connected to the products or websites displayed to you in personalized recommendations or other products or websites linking in the \"Knowing Emperor\" service;", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53169, "text": "2. Other third parties to advertise for the \"Knowing the Emperor\" service", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53170, "text": "You use these third -party services (including any personal information you provided to these third parties), and will be subject to these third -party service terms and privacy policies (instead of this \"Privacy Policy\"). For specific regulationsTerms.", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53171, "text": "Please protect your personal information properly and provide third parties only if necessary.", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53172, "text": "3. Please understand that the \"Know Emperor\" and related services described in this \"Privacy Policy\" may be different according to factors such as the mobile phone model, system version, software application version, mobile client and other factors you use.Essence", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53173, "text": "The final product and service are based on the \"Knowing Emperor\" and related services you use.", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53174, "text": "Ten, others", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53175, "text": "1. If you have complaints, suggestions, and questions on the protection of personal information, you can send the problem to (dataprivacy@bytedance.com) or mail to the following address:", "label": ["Important", "Contact Information"], "rewrite": "You can send the problem to (dataprivacy@bytedance.com)."}
{"task": "rw_47.jsonl", "id": 53176, "text": "Data Security and Privacy Protection Center of the Ministry of Legal Affairs of China Satellite Communications Building, Haidian District, Beijing", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53177, "text": "We will review the issues involved as soon as possible and reply within 15 working days after verifying your user identity.", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53178, "text": "2. If you have any questions, opinions or suggestions on the content of this \"Privacy Policy\", you can contact us by logging in to the \"user feedback\" page in the \"Understanding Emperor\" client", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53179, "text": "帝 2021 Understanding Che Di www.dcdapp.com Jinggong.com Anmi 11010802026035 Beijing ICP No. 17027026 -2 value-added telecommunications business business license (Beijing B2-20180202) Broadcasting and TV show production and business license", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53180, "text": "Company Name: Beijing Byte Beat Technology Co., Ltd., the Central Cyberspace Office illegal and bad information reporting center, illegal and bad information report telephone: 010-58341833", "label": ["Important", "Contact Information"], "rewrite": "Company Name: Beijing Bitting Technology Co., Ltd. Central Network Information Office illegal and bad information reporting centers illegal and bad information reports: 010-58341833."}
{"task": "rw_47.jsonl", "id": 53181, "text": "Understand the User Agreement of the Emperor | Understand the Privacy Policy of the Emperor of the Emperor | Business License", "label": [], "rewrite": []}
{"task": "rw_47.jsonl", "id": 53182, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
