{"task": "rw_43.jsonl", "id": 51308, "text": "Dear users: We have updated the Privacy Policy.", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51309, "text": "The update content of this version of \"Privacy Policy\" is mainly: adjusting the type of collection information and adjusting the type of information collected by a third -party SDK.", "label": ["Policy Change", "Important"], "rewrite": "The update content of this version of \"Privacy Policy\" is mainly: adjusting the type of collection information and adjusting the type of information collected by a third -party SDK."}
{"task": "rw_43.jsonl", "id": 51310, "text": "Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51311, "text": "This policy is only applicable to the \"Delu\" product of Beijing Dajie Technology Co., Ltd. (hereinafter referred to as \"Deman Technology\").", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51312, "text": "Operator: Beijing Dega Technology Co., Ltd.", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51313, "text": "Recent Updated Date: [2020] Year [12] month [14].", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51314, "text": "This policy will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51315, "text": "1. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51316, "text": "2. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51317, "text": "3. How can we share, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51318, "text": "4. How do we protect your personal information", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51319, "text": "5. Your rights", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51320, "text": "6. How do we deal with children's personal information", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51321, "text": "7. How can your personal information be transferred globally", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51322, "text": "8. How to update this policy", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51323, "text": "9. Application of this policy", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51324, "text": "10. How to contact us", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51325, "text": "Tech technology knows the importance of personal information to you, and will do its best to protect your personal information security and reliable.", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51326, "text": "We are committed to maintaining your trust in us, abiding by the following principles, and protecting your personal information: the principles of consistency and responsibility, the principles of clear purpose, the principles of consent, the principle of minimum necessary necessary, the principles of safety, the principles of subject participation, and the principle of openness and transparency.", "label": ["Important", "Data Security"], "rewrite": "We adhere to the following principles to protect your personal information: the principles of consistent power and responsibility, the principles of clear purpose, the principle of consent, the principle of minimum necessary necessary, the principles of safety, the principles of subject participation, and the principle of openness and transparency."}
{"task": "rw_43.jsonl", "id": 51327, "text": "At the same time, the science and technology commitment of Daomao promised that we will take corresponding security protection measures to protect your personal information in accordance with the mature safety standards of the industry.", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51328, "text": "Please read and understand this \"Privacy Policy\" before using our products.", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51329, "text": "1. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51330, "text": "Personal information refers to a variety of information that can identify specific natural persons or reflects the activity of specific natural persons in a single or other information with other information.", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51331, "text": "In the following goals described in this policy, Gengoma Technology will collect and use your personal information when providing reading services for you:", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51332, "text": "1. Business function one: Registration becomes a user", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51333, "text": "In order to complete the creation account, you need to provide the following information: your mobile phone number.", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to complete the creation account, you need to provide the following information: your mobile phone number."}
{"task": "rw_43.jsonl", "id": 51334, "text": "You can also log in to get a third -party account (such as WeChat, QQ).", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51335, "text": "You will not affect your search and browsing functions during your login, but it may affect your additional business functions such as purchasing members and publishing comments.", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51336, "text": "The above information you provide will continue to authorize us to use it during your service.", "label": ["Important", "First Party Collection Information"], "rewrite": "The above information you provide will continue to authorize us to use it during your service."}
{"task": "rw_43.jsonl", "id": 51337, "text": "When you cancel your account, we will stop using and delete the above information.", "label": ["Edit/Control", "Important"], "rewrite": "When you cancel your account, we will stop using and delete the above information."}
{"task": "rw_43.jsonl", "id": 51338, "text": "2. Business function two: user portrait, personalized recommendation", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51339, "text": "When you use our service, this software will record your inter -operation logs, including searching keywords, accumulated use time, read books and chapters, bookshelves.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use our service, this software will record your inter -operation logs, including searching keywords, accumulated use time, read books and chapters, bookshelves."}
{"task": "rw_43.jsonl", "id": 51340, "text": "In order to better customize exclusive recommendations for you, you can also choose to fill in reading preferences according to your own needs.", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51341, "text": "We will extract your preferences based on the aforementioned information and your data, and based on the preference characteristic output indirect user portrait, so that you can provide you with customized services that are more suitable for you, to show you or recommend a higher degree of search results.", "label": ["Important", "Usage"], "rewrite": "We will extract your preferences based on the aforementioned information and your data, and based on the output of indirect user portraits of preferences."}
{"task": "rw_43.jsonl", "id": 51342, "text": "If you do not agree to provide the aforementioned information, or are not interested in the personalized content we recommend, you can use our product and/or service related feature settings to open/close recommendation when you want to close personalized recommendations.", "label": ["Edit/Control", "Usage", "Important"], "rewrite": "If you do not agree to provide the aforementioned information, or are not interested in the personalized content we recommend, you can use our product and/or service related feature settings to open/close recommendation when you want to close personalized recommendations."}
{"task": "rw_43.jsonl", "id": 51343, "text": "The personalized recommendation setting path in the app is: \"My - Settings -Reading Settings -Personalized Recommendation\".", "label": ["Edit/Control", "Important"], "rewrite": "The personalized recommendation setting path in the app is: \"My - Settings -Reading Settings -Personalized Recommendation\"."}
{"task": "rw_43.jsonl", "id": 51344, "text": "3. Business function three: ordering, payment and withdrawal", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51345, "text": "You can store records and consumption records generated by the members when ordering members, and this information will be stored in our servers.", "label": ["Data Retention", "Important"], "rewrite": "You can store records and consumption records generated by the members when ordering members, and this information will be stored in our servers."}
{"task": "rw_43.jsonl", "id": 51346, "text": "The above information is the information necessary for software functions. If you do not agree with us to record the aforementioned information, we will not be able to provide you with members and reading services.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51347, "text": "If you use ordering and payment functions, the third direction of the company that you provide payment services will directly collect information related to payment.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you use ordering and payment functions, the third direction of the company that you provide payment services will directly collect information related to payment."}
{"task": "rw_43.jsonl", "id": 51348, "text": "If you use the gold coin withdrawal function, we need to collect your Alipay account and WeChat account", "label": ["Important", "First Party Collection Information"], "rewrite": "If you use the gold coin withdrawal function, we need to collect your Alipay account and WeChat account."}
{"task": "rw_43.jsonl", "id": 51349, "text": "4. Business Function 4: Communicate with other users", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51350, "text": "The information contained in the content you shared through our service, including your reviews, notes, ideas, and your information will be stored in our server.", "label": ["Data Retention", "Important"], "rewrite": "The information contained in the content you shared through our service, including your reviews, notes, ideas, and your information will be stored in our server."}
{"task": "rw_43.jsonl", "id": 51351, "text": "You can delete the above information at any time, and deleting the above information will not affect your normal use of this software.", "label": ["Edit/Control", "Important"], "rewrite": "You can delete the above information at any time, and deleting the above information will not affect your normal use of this software."}
{"task": "rw_43.jsonl", "id": 51352, "text": "5. Safety management function:", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51353, "text": "To provide you with safe and stable services, ensure your account property security, and prevent names, we need to record your device model, IP address, device software version information, and device recognition code.", "label": ["Important", "First Party Collection Information"], "rewrite": "We need to record your device model, IP address, device software version information, and device recognition code."}
{"task": "rw_43.jsonl", "id": 51354, "text": "If you do not agree with us to record the aforementioned information, you may not be able to complete risk control verification and cannot use our software.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you do not agree with us to record the aforementioned information, you may not be able to complete risk control verification and cannot use our software."}
{"task": "rw_43.jsonl", "id": 51355, "text": "6. When you use this software, in order to provide you with the purpose of service, this software may obtain the following permissions of your terminal equipment. Of course, you can refuse to turn on the following permissions, or close the following authority in the settings of the mobile phone, close the following authority, close the shutdown, turn offThe following permissions will not affect your use of other functions of this software:", "label": ["Important", "Edit/Control"], "rewrite": "When you use this software, in order to provide you, this software may obtain the following permissions of your terminal device. Of course, you can refuse to turn on the following permissions or close the following permissions of the software in the setting of the phone."}
{"task": "rw_43.jsonl", "id": 51356, "text": "Access camera: You can use the camera to scan the code for scanning, shooting and uploading pictures directly for sun drawings or sharing;", "label": ["Important", "Edit/Control"], "rewrite": "You can use the camera to scan the code for scanning, shooting directly and uploading pictures for sun -drawn or sharing."}
{"task": "rw_43.jsonl", "id": 51357, "text": "Visit local storage: By opening the local storage authority, download books in the software to your mobile phone storage, and upload your local book to this software through mobile phone storage;", "label": ["Important", "Edit/Control"], "rewrite": "By opening local storage permissions, download books in this software to your mobile phone storage, and upload your local book to this software through mobile phone storage."}
{"task": "rw_43.jsonl", "id": 51358, "text": "Access photos: You can directly select photos or pictures in your mobile phone for uploading comments or providing proof when communicating with customer service;", "label": ["Edit/Control", "Important"], "rewrite": "You can directly select photos or pictures in your mobile phone for uploading comments or providing proof when communicating with customer service."}
{"task": "rw_43.jsonl", "id": 51359, "text": "Open push: You can receive the message of push by opening the push authority;", "label": ["Important", "Edit/Control"], "rewrite": "You can receive messages by opening push permissions."}
{"task": "rw_43.jsonl", "id": 51360, "text": "Turn on wireless data: You can achieve the network function required by the software by connecting the wireless network or opening the honeycomb network;", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51361, "text": "Visit phone: By obtaining your phone status permissions, we record your device recognition code (ie, IMEI or IMSI code) for anonymized processing for statistics and security verification.", "label": ["Important", "Edit/Control"], "rewrite": "Once you obtain your phone status permissions, we record your device recognition code (ie the IMEI or IMSI code) for anonymized processing for statistics and security verification."}
{"task": "rw_43.jsonl", "id": 51362, "text": "List of access to the installation program: By obtaining the list of your installation program, we can confirm whether you have installed the software we promoted so that we can issue the corresponding rewards to you in time.", "label": ["Important", "Edit/Control"], "rewrite": "By obtaining your installation program list, we can confirm whether you have installed the software we have promoted so that we can issue the corresponding rewards to you in time."}
{"task": "rw_43.jsonl", "id": 51363, "text": "Open Siri and Search: You can directly retrieve the content of this software by turning on Siri and search function;", "label": ["Important", "Edit/Control"], "rewrite": "You can directly retrieve the content of this software by turning on the Siri and search function."}
{"task": "rw_43.jsonl", "id": 51364, "text": "Open the microphone and voice recognition: You can control the voice reading function and voice control function of this software through voice;", "label": ["Important", "Edit/Control"], "rewrite": "You can control the software's voice reading function and voice control function of this software."}
{"task": "rw_43.jsonl", "id": 51365, "text": "Open the background application refresh: After opening, you can realize the listening book and voice loud reading that is not affected by the switching of the APP to the background.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51366, "text": "Open the eye protection mode: After you turn on the eye protection mode, you will add the floating window of the eye protection mode, and you need to get your process list to ensure the state of the suspension window.", "label": ["Edit/Control", "Important"], "rewrite": "After opening the eye protection mode, you will add the floating window of the eye protection mode, and you need to get your process list to ensure the state of the suspension window."}
{"task": "rw_43.jsonl", "id": 51367, "text": "Visit the calendar: You can receive the calendar reminder between the calendar by opening the calendar authority", "label": ["Important", "Edit/Control"], "rewrite": "You can receive the calendar reminder between the calendar by opening the permissions of the calendar."}
{"task": "rw_43.jsonl", "id": 51368, "text": "7. The authority required for third -party SDK access services.", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51369, "text": "Our products and services may include third -party products and services, as well as links for third -party websites.", "label": ["Important", "First Party Collection Information"], "rewrite": "Our products and services may include third -party products and services, as well as links for third -party websites."}
{"task": "rw_43.jsonl", "id": 51370, "text": "You may also collect your information when you use these products or services.", "label": ["Important", "First Party Collection Information"], "rewrite": "You may also collect your information when you use these products or services."}
{"task": "rw_43.jsonl", "id": 51371, "text": "The third -party SKD columns we currently access are as follows:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51372, "text": "Serial number SDK Name Scene Description Personal Information Field Privacy Policy Link Third -Party Institution Name", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51373, "text": "1 Baidu TTS voice reading equipment information (operating system version, unique device identifier, international mobile device identity code IMEI), log information, etc.Co., Ltd.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51374, "text": "2 Baidu Advertising Advertising Equipment Information, Log Information, Location Information, Application List Information, Reading/Write to external memory cards, obtain network status, access to Wi-Fi status, obtain rough positions, obtain task list https://union.baidu.com/bqt#/policies Beijing Baidu Net News Technology Co., Ltd.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51375, "text": "3 Point -paging advertisements Putting hardware models, operating system versions number, international mobile device recognition code (IMEI), network device hardware address (MAC), IP address, software version number, network access method and type, operation log and other information https:///Ad.oceenengine.com/union/media/privacy Hubei Toutiao Technology Co., Ltd.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51376, "text": "4 Guangxian Tong Advertising Equipment's unique identification code, MAC address, software list https://www.tencent.com/zh-cn/privacy-policy.html Tencent Technology (Shenzhen) Co., Ltd.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51377, "text": "5 seconds needle judgment equipment uniqueness, risk control and safety equipment unique identification code, model, mobile system version https://www.miaozhen.com/cn/privacy second needle information technology Co., Ltd.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51378, "text": "6 Tencent Bugly analysis and statistical system error equipment unique identification code, SD card capacity, APP package name and version and process name, CRASH information and thread stack https://privacy.qq.com/ Shenzhen Tencent Computer System Co., Ltd.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51379, "text": "7 Tencent QQ login, share the page to QQ friends or friends circle equipment unique identification code https://ti.qq.com/agreement/qqface.html?", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51380, "text": "appName = mqq_2019 Shenzhen Tencent Computer System Co., Ltd.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51381, "text": "8 WeChat login, share the page to WeChat friend or circle of friends, use WeChat payment device unique identifiers https://weixin.qq.com/cgi-bin/readtemplate?", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51382, "text": "Lang = zh_cn & t = weixin_agreement & s = Privacy Shenzhen Tencent Computer System Co., Ltd.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51383, "text": "9 Friend League SDK message push, one -click login device unique identification code, device MAC address, software list https://www.umeng.com/page/policy", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51384, "text": "10 Alipay payment device unique identifier, device MAC address https://render.alipay.com/p/c/k2cx0tg8 Alipay (China) Network Technology Co., Ltd. Network Technology Co., Ltd.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51385, "text": "11 Sogou advertisement release equipment name, equipment model, device recognition code, operating system and application version, language settings, resolution, service provider network ID (PLMN) related information, IP address http://support.union.sogou.com/union/html/help/newhand/sdkprivacyagreement.html Beijing Sogou Information Service Co., Ltd.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51386, "text": "12 HTTPS://www.kuaishou.com/about/policy?", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51387, "text": "tab = Privacy Beijing Kuaishou Advertising Co., Ltd.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51388, "text": "13 TALKINGATA data statistical application logo, application version, application distribution channels, IDFV, IDFA, Android advertising main identity symbol, IP address, network card (MAC) address, IMEI, device model, terminal manufacturer, terminal equipment operating system version HTTPS HTTPS: //www.talkingdata.com/privacy.jsp?", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51389, "text": "LanguageType = zh_cn Beijing Tengyun World Technology Co., Ltd.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51390, "text": "14 APPIC Advertising Putting Hardware model, operating system version number, international mobile device recognition code (IMEI), network device hardware address (MAC), IP address, software version number, network access method and type, operation log https: // wwwww.Appicad.com/Privacy.html Chongqing Aoyi Network Technology Co., Ltd.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51391, "text": "15 Huawei Push to users to send message device logo information https://developer.huawei.com/Consumer/cn/doc/development/hmscore-godes- v5/privacyable-00000050042021 Huawei Terminal Co., Ltd.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51392, "text": "16 OPPO Push to users to push message device logo information https://muc.heytap.com/document/heytap/privacypolicy/privacypolicy_zh-cn.html?", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51393, "text": "callback = https%3A // Open.oppomobile.com/NewService/Capability%3FPAGENAME%3DPush Guangdong Huan Tai Technology Co., Ltd.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51394, "text": "17 vivo push to users to push message device logo information https://dev.vivo.com.cn/documentcenter/doc/36-1-08512613 Guangdong Tianxun Network Technology Co., Ltd.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51395, "text": "18 Xiaomi Push to users to push message device logo information https://dev.mi.com/console/doc/detail?", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51396, "text": "PID = 1822 Beijing Xiaomi Mobile Software Co., Ltd.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51397, "text": "19 MOBGC advertisements to device information, device recognition code, Google advertising logo, country, language https://www.mobgc.com/privacy_policy.html Beijing Hui Niu Technology Co., Ltd.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51398, "text": "20 Drive advertising equipment information (equipment brand, model, system version), international mobile device identification code (IMEI), network device hardware address (MAC), IP address, software version number, network access method and type, operation log, etc.Information https://cyad.zhangyue01.com/ssp/privacy.html Palm Reading Technology Co., Ltd.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51399, "text": "2. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51400, "text": "To ensure normal operation, we will store small data files named Cookie on your mobile devices.", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51401, "text": "Cookie usually contains identifiers, site names, and some numbers and characters.", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51402, "text": "With the help of Cookie, we will record your login information and the operating information in the APP, so that we can store your preferences and use habits, help you save the steps to repeatedly enter the registration information, and help judge your account security status.I think you provide a easier user experience and service.", "label": ["Important", "First Party Collection Information"], "rewrite": "With the help of cookies, we will record your login information and the operating information in the APP, so that we can store your preferences and usage habits."}
{"task": "rw_43.jsonl", "id": 51403, "text": "We will not use Cookie for any purpose outside the purpose of this policy.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will not use Cookie for any purpose outside the purpose of this policy."}
{"task": "rw_43.jsonl", "id": 51404, "text": "You can manage or stop cookies according to your preferences.", "label": ["Important", "Edit/Control"], "rewrite": "You can manage or stop cookies according to your preferences."}
{"task": "rw_43.jsonl", "id": 51405, "text": "3. How can we entrust your personal information to deal with, share, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51406, "text": "(1) Entrusted processing", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51407, "text": "Some specific modules or functions in this business function are provided by external suppliers.", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51408, "text": "For example, we will hire service providers to assist us with customer support.", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51409, "text": "For companies, organizations, and individuals who commission our personal information, we will sign a strict confidentiality agreement with them, asking them to handle personal information in accordance with our requirements, this privacy policy, and any other related confidentiality and security measures.", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51410, "text": "(2) Sharing", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51411, "text": "We will not share your personal information with any companies, organizations and individuals other than Teng Technology, except the following situations: except:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not share your personal information with any companies, organizations and individuals other than Teng Technology, except the following situations: except:"}
{"task": "rw_43.jsonl", "id": 51412, "text": "1. Shared with clear consent: After getting your clear consent, we will share your personal information with other parties.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After getting your clear consent, we will share your personal information with other parties."}
{"task": "rw_43.jsonl", "id": 51413, "text": "2. We may share your personal information to the outside world in accordance with the provisions of laws and regulations, or in accordance with the mandatory requirements of the government authority.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share your personal information to the outside world in accordance with the provisions of laws and regulations, or in accordance with the mandatory requirements of government authorities."}
{"task": "rw_43.jsonl", "id": 51414, "text": "3. Sharing with authorized partners: Only in order to achieve the purpose of this policy, some of our services will be provided by authorized partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to achieve the purpose of this policy, some of our services will be provided by authorized partners."}
{"task": "rw_43.jsonl", "id": 51415, "text": "We may share some of your personal information with our partners to provide better customer service and user experience.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share some of your personal information with our partners to provide better customer service and user experience."}
{"task": "rw_43.jsonl", "id": 51416, "text": "We will only share your personal information for legal, correct, necessary, specific, and clear purposes, and only share the personal information necessary for providing services.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only share your personal information for legal, correct, necessary, specific, and clear purposes, and only share the personal information necessary for providing services."}
{"task": "rw_43.jsonl", "id": 51417, "text": "Our partners have no right to use the personal information they shared for any other purpose.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Our partners have no right to use the personal information they shared for any other purpose."}
{"task": "rw_43.jsonl", "id": 51418, "text": "At present, our authorized partners include the following types:", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51419, "text": "1) Authorized partners of advertising and analysis services.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share with the authorized partners of advertising and analysis services"}
{"task": "rw_43.jsonl", "id": 51420, "text": "Unless you get your permission, we will not share your personal identity information (referring to information that can identify your identity, and you can contact you or identify your identity through this information) to share with partners who provide advertising and analysis services.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Unless you get your permission, we will not share your personal identity information (referring to information that can identify your identity, and you can contact you or identify your identity through this information) to share with partners who provide advertising and analysis services."}
{"task": "rw_43.jsonl", "id": 51421, "text": "But we may share your anonymous user portrait with the authorized partners of advertising and analysis of service categories to help them increase the effective touch rate of advertising without identifying your personal premise.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share your anonymous user portraits with the authorized partners of advertising and analysis of service categories to help them increase the effective reach of advertising without identifying your personal premise."}
{"task": "rw_43.jsonl", "id": 51422, "text": "2) Suppliers, service providers and other partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share with suppliers, service providers and other partners."}
{"task": "rw_43.jsonl", "id": 51423, "text": "We send information to suppliers, service providers, and other partners that support our business worldwide. These support include providing technical infrastructure services, analyzing the usage methods of our services, measuring the effectiveness of advertising and services, providing customers to provide customersServices, payment convenience or academic research and investigation.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We send information to suppliers, service providers and other partners that support our business worldwide."}
{"task": "rw_43.jsonl", "id": 51424, "text": "Companies, organizations and individuals who share personal information with us, we will sign a strict confidentiality agreement with them, asking them to handle personal information in accordance with our instructions, privacy policies, and any other related confidentiality and security measures.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Companies, organizations and individuals who share personal information with us, we will sign a strict confidentiality agreement with them, asking them to handle personal information in accordance with our instructions, privacy policies, and any other related confidentiality and security measures."}
{"task": "rw_43.jsonl", "id": 51425, "text": "(3) Transfer", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51426, "text": "We will not transfer your personal information to any company, organization and individual, except the following situations: except:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not transfer your personal information to any company, organization and individual, except the following situations: except:"}
{"task": "rw_43.jsonl", "id": 51427, "text": "1. In the case of obtaining clear consent: After getting your clear consent, we will transfer your personal information to other parties;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After getting your clear consent, we will transfer your personal information to other parties."}
{"task": "rw_43.jsonl", "id": 51428, "text": "2. When involving mergers, acquisitions, or bankruptcy liquidation, if personal information is transferred, we will require new companies and organizations that hold your personal information to continue to be subject to this privacy policy. Otherwise, we will ask the company and organization to organize the organization and organizationRe -solicitting authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If it involves the transfer of personal information, we will continue to be constrained by this privacy policy, otherwise we will ask the company and the organization to reconcile your authorization consent."}
{"task": "rw_43.jsonl", "id": 51429, "text": "(4) Public disclosure", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51430, "text": "We will only publicly disclose your personal information in the following circumstances:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only publicly disclose your personal information in the following circumstances:"}
{"task": "rw_43.jsonl", "id": 51431, "text": "1. After getting your clear consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After getting your clear consent, you will disclose personal information."}
{"task": "rw_43.jsonl", "id": 51432, "text": "2. Based on legal disclosure: In the case of compulsory requirements of legal, legal procedures, litigation or government authorities, we may disclose your personal information publicly.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the case of compulsory requirements of legal, legal procedures, litigation, or government authorities, we may disclose your personal information publicly."}
{"task": "rw_43.jsonl", "id": 51433, "text": "(5) Personal information types that may involve external sharing: device recognition code, software version information;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Personal information types that may involve external sharing: device recognition code, software version information."}
{"task": "rw_43.jsonl", "id": 51434, "text": "Publicly disclosed the type of personal information that may be involved: reading books, reading duration, publishing comments/ideas, book scores.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Publicly disclosed the type of personal information that may be involved: reading books, reading duration, publishing comments/ideas, book scores."}
{"task": "rw_43.jsonl", "id": 51435, "text": "We know that the corresponding legal liability shared, transferred, and publicly disclosed the personal information, and will take reasonable measures to ensure personal information security.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We know that the corresponding legal liability shared, transferred, and publicly disclosed the personal information, and will take reasonable measures to ensure personal information security."}
{"task": "rw_43.jsonl", "id": 51436, "text": "4. How do we protect your personal information", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51437, "text": "(1) We have used security measures that meet the industry standards to protect your personal information, prevent data from being unauthorized, publicly disclosed, used, modified, damaged or lost.", "label": ["Important", "Data Security"], "rewrite": "We have used security measures that meet the industry standards to protect your personal information, prevent data from being unauthorized, publicly disclosed, used, modified, damaged or lost."}
{"task": "rw_43.jsonl", "id": 51438, "text": "We will take all reasonable and feasible measures to protect your personal information.", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51439, "text": "For example, when you exchange data (such as credit card information) between your browser and \"service\";", "label": ["Important", "Data Security"], "rewrite": "Exchange data (such as credit card information) between your browser and \"service\" (such as credit card information) is protected by SSL."}
{"task": "rw_43.jsonl", "id": 51440, "text": "We will use encryption technology to ensure the confidentiality of the data;", "label": ["Important", "Data Security"], "rewrite": "We will use encryption technology to ensure the confidentiality of data."}
{"task": "rw_43.jsonl", "id": 51441, "text": "We will use a trusted protection mechanism to prevent data from being maliciously attacked;", "label": ["Important", "Data Security"], "rewrite": "We will use a trusted protection mechanism to prevent data from being maliciously attacked."}
{"task": "rw_43.jsonl", "id": 51442, "text": "We will deploy the access control mechanism to ensure that only authorized personnel can access personal information;", "label": ["Important", "Data Security"], "rewrite": "We will deploy the access control mechanism to ensure that only authorized personnel can access personal information."}
{"task": "rw_43.jsonl", "id": 51443, "text": "And we will organize safety and privacy protection training courses to strengthen employees' awareness of protecting the importance of personal information.", "label": ["Important", "Data Security"], "rewrite": "We will organize safety and privacy protection training courses to strengthen employees' awareness of protecting the importance of personal information."}
{"task": "rw_43.jsonl", "id": 51444, "text": "(2) Storage period: We only store your personal information in mainland China.", "label": ["Data Retention", "Important"], "rewrite": "We only store your personal information in mainland China."}
{"task": "rw_43.jsonl", "id": 51445, "text": "We will take all reasonable and feasible measures to ensure unrelated personal information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will take all reasonable and feasible measures to ensure unrelated personal information."}
{"task": "rw_43.jsonl", "id": 51446, "text": "We will only retain your personal information within the minimum period of the purpose of the cost of reaching the cost of the cost policy, unless the retention period is required or permitted by the law.", "label": ["Data Retention", "Important"], "rewrite": "We will only retain your personal information within the minimum period of the purpose of the cost of reaching the cost of the cost policy, unless the retention period is required or permitted by the law."}
{"task": "rw_43.jsonl", "id": 51447, "text": "After your personal information is exceeded, we will delete your personal information or anonymous processing according to the requirements of laws and regulations.", "label": ["Data Retention", "Important"], "rewrite": "After your personal information is exceeded, we will delete your personal information or anonymous processing according to the requirements of laws and regulations."}
{"task": "rw_43.jsonl", "id": 51448, "text": "(3) The Internet is not an absolutely secure environment, and email, instant communication, and communication methods with other users are not encrypted. We strongly recommend that you do not send personal information in this way.", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51449, "text": "Please use complex passwords to help us guarantee your account security.", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51450, "text": "(4) The Internet environment is not 100 % security. We will try our best to ensure or guarantee the security of any information you send to us.", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51451, "text": "If our physics, technology, or management protection facilities are damaged, the information is caused by unauthorized access, public disclosure, tampering, or destruction, leading to damage to your legitimate rights and interests, we will bear the corresponding legal responsibility.", "label": ["Important", "Data Security"], "rewrite": "If our physics, technology, or management protection facilities are damaged, the information is caused by unauthorized access, public disclosure, tampering, or destruction, leading to damage to your legitimate rights and interests, we will bear the corresponding legal responsibility."}
{"task": "rw_43.jsonl", "id": 51452, "text": "(5) After the personal information security incident occurs unfortunately, we will inform you in a timely manner in accordance with the requirements of laws and regulations: the basic situation and possible impact of security incidents, the disposal measures we have adopted or we will take, you can take it independently, and you can take it autonomously and that you can take it autonomously and to take it alone and to prevent and prevent it and be autonomously.Suggestions for reducing risk, remedial measures, etc.", "label": ["Important", "Data Security"], "rewrite": "After unfortunately a personal information security incident, we will inform you in a timely manner in accordance with the requirements of the laws and regulations: basic situations and possible impacts, disposal measures, suggestions, remedy measures, etc."}
{"task": "rw_43.jsonl", "id": 51453, "text": "We will promptly inform you that the incident -related situation is informing the email, letter, telephone, push notification, etc. When it is difficult to inform the subject of personal information one by one, we will publish an announcement in a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "We will promptly inform you that the incident -related situation is informing the email, letter, telephone, push notification, etc. When it is difficult to inform the subject of personal information one by one, we will publish an announcement in a reasonable and effective way."}
{"task": "rw_43.jsonl", "id": 51454, "text": "At the same time, we will also actively report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "We will also take the initiative to report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities."}
{"task": "rw_43.jsonl", "id": 51455, "text": "5. Your rights", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51456, "text": "In accordance with China's relevant laws, regulations, standards, and the practice of other countries and regions, we guarantee that you exercise the following rights on your personal information:", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51457, "text": "(1) Visit your personal information", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51458, "text": "You have the right to access your personal information, except for the exception stipulated in laws and regulations.", "label": ["Edit/Control", "Important"], "rewrite": "You have the right to access your personal information, except for the exception stipulated in laws and regulations."}
{"task": "rw_43.jsonl", "id": 51459, "text": "If you want to exercise the right to access, you can access it by yourself through the following ways:", "label": ["Important", "Edit/Control"], "rewrite": "If you want to exercise the right to access, you can access it by yourself through the following ways:"}
{"task": "rw_43.jsonl", "id": 51460, "text": "1. Visit basic information such as avatars and nicknames:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51461, "text": "1) After entering the time, click \"My\"", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51462, "text": "2) Click on the avatar bar", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51463, "text": "3) For information query and access", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51464, "text": "2. Visit the mobile phone number:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51465, "text": "1) After entering the time, click \"My\"", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51466, "text": "2) Click \"Settings\"", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51467, "text": "3) Click \"Change the phone\"", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51468, "text": "4) For information query and access", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51469, "text": "(2) Correct your personal information", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51470, "text": "When you find that we have the error about your personal information, you have the right to ask us to make corrections.", "label": ["Important", "Edit/Control"], "rewrite": "When you find that we have the error about your personal information, you have the right to ask us to make corrections."}
{"task": "rw_43.jsonl", "id": 51471, "text": "You can make a correction application through the \"(1) access to your personal information\".", "label": ["Important", "Edit/Control"], "rewrite": "You can make a correction application through the \"(1) access to your personal information\"."}
{"task": "rw_43.jsonl", "id": 51472, "text": "(3) Delete your personal information In the following situation, you can make a request to delete personal information:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51473, "text": "1. If our behavior of handling personal information violates laws and regulations;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51474, "text": "2. If we collect and use your personal information, it has not obtained your consent;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51475, "text": "3. If our behavior of handling personal information violates your agreement;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51476, "text": "4. If you no longer use our products or services, or you cancel your account;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51477, "text": "5. If we no longer provide products or services for you.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51478, "text": "If we decide to respond to your deletion request, we will also also notify the entities that obtain your personal information from our personal information and ask them to delete them in time, unless laws and regulations have other regulations, or these entities have obtained your independent authorization.", "label": ["Important", "Edit/Control"], "rewrite": "If we decide to respond to your deletion request, we will also also notify the entities that obtain your personal information from our personal information and ask them to delete them in time, unless laws and regulations have other regulations, or these entities have obtained your independent authorization."}
{"task": "rw_43.jsonl", "id": 51479, "text": "When you delete the information from our services, we may not back up the corresponding information in the system, but will delete these information when the backup is updated.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "When you delete the information from our services, we may not back up the corresponding information in the system, but will delete these information when the backup is updated."}
{"task": "rw_43.jsonl", "id": 51480, "text": "(4) Change the scope of your authorization", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51481, "text": "Each business function requires some basic personal information to complete.", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51482, "text": "For the collection and use of additional personal information, you can give or withdraw your authorization consent at any time.", "label": ["Important", "First Party Collection Information", "Edit/Control"], "rewrite": "For the collection and use of additional personal information, you can give or withdraw your authorization consent at any time."}
{"task": "rw_43.jsonl", "id": 51483, "text": "When you recover your consent, we will no longer process the corresponding personal information.", "label": ["Important", "Edit/Control"], "rewrite": "When you recover your consent, we will no longer process the corresponding personal information."}
{"task": "rw_43.jsonl", "id": 51484, "text": "But your decision to recover the consent will not affect personal information processing based on your authorization.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "But your decision to recover the consent will not affect personal information processing based on your authorization."}
{"task": "rw_43.jsonl", "id": 51485, "text": "If you intend to change the scope of authorization or do not want to accept the commercial advertisement we send to you, you can contact us according to the contact information we provided.", "label": ["Edit/Control", "Important"], "rewrite": "If you intend to change the scope of authorization or do not want to accept the commercial advertisement we send to you, you can contact us according to the contact information we provided."}
{"task": "rw_43.jsonl", "id": 51486, "text": "(5) Logging out the account", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51487, "text": "You can cancel the previously registered account at any time, and you can operate yourself by yourself:", "label": ["Important", "Edit/Control"], "rewrite": "You can cancel the previously registered account at any time, and you can operate yourself by yourself:"}
{"task": "rw_43.jsonl", "id": 51488, "text": "1. After entering the time, click \"My\"", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51489, "text": "2. Click \"Settings\"", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51490, "text": "3. Click \"Logging out\"", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51491, "text": "After canceling the account, we will stop providing you with products or services and delete your personal information according to your requirements.", "label": ["Important", "Edit/Control"], "rewrite": "After canceling the account, we will stop providing you with products or services and delete your personal information according to your requirements."}
{"task": "rw_43.jsonl", "id": 51492, "text": "(6) Personal information subject obtain a copy of personal information", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51493, "text": "You have the right to get your personal information copy, and you can contact us through the contact information we provided.", "label": ["Important", "Edit/Control"], "rewrite": "You have the right to get your personal information copy, and you can contact us through the contact information we provided."}
{"task": "rw_43.jsonl", "id": 51494, "text": "Under the premise of technical feasibility, such as data interface matching, we can also transmit your personal information copy directly to your designated third party according to your requirements.", "label": ["Important", "Edit/Control"], "rewrite": "Under the premise of technical feasibility, such as data interface matching, we can also transmit your personal information copy directly to your designated third party according to your requirements."}
{"task": "rw_43.jsonl", "id": 51495, "text": "(7) Automatic decision -making of information system", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51496, "text": "In certain business functions, we may make decisions only based on the non -artificial automatic decision -making mechanism, including information systems, algorithms, etc.", "label": ["Important", "Usage"], "rewrite": "In certain business functions, we may make decisions only based on the non -artificial automatic decision -making mechanism, including information systems, algorithms, etc."}
{"task": "rw_43.jsonl", "id": 51497, "text": "If these decisions significantly affect your legitimate rights and interests, you have the right to ask us to explain, and we will also provide appropriate relief methods.", "label": ["Usage"], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51498, "text": "(8) Responsive your above request", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51499, "text": "To ensure safety, you may need to provide a written request or prove your identity in other ways.", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51500, "text": "We may ask you to verify your identity first, and then process your request.", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51501, "text": "We will answer within 30 days after verifying your identity.", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51502, "text": "If you are not satisfied, you can also complain to the government or industry authorities in accordance with the law.", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51503, "text": "For your reasonable request, we do not charge fees in principle, but we will charge a certain cost fee depending on the request that repeats and beyond the reasonable limit.", "label": ["Important"], "rewrite": "For your reasonable request, we do not charge fees in principle, but we will charge a certain cost fee depending on the request that repeats and beyond the reasonable limit."}
{"task": "rw_43.jsonl", "id": 51504, "text": "For those who have no repetition and need too much technical means (for example, need to develop new systems or fundamentally change the current practice), bring risks to others' legitimate rights and interests or very unrealistic (for example, information involved in backup tapes)We may refuse.", "label": ["Important"], "rewrite": "We may refuse to reject those who have no repetition, need too much technical means, bring risks or very unrealistic requests to others."}
{"task": "rw_43.jsonl", "id": 51505, "text": "In the following circumstances, we will not be able to respond to your request:", "label": ["Important", "Risk"], "rewrite": "In the following circumstances, we will not be able to respond to your request:"}
{"task": "rw_43.jsonl", "id": 51506, "text": "1. What is related to the obligations stipulated in the performance of the personal information controller;", "label": ["Important", "Risk"], "rewrite": "If the obligations stipulated by the Personal Information Controller's Performance of Laws and Regulations, the request cannot be responded."}
{"task": "rw_43.jsonl", "id": 51507, "text": "2. Directly related to national security and national defense security;", "label": ["Important", "Risk"], "rewrite": "Directly related to national security and national defense security cannot respond to requests."}
{"task": "rw_43.jsonl", "id": 51508, "text": "3. Directly related to public safety, public health, and major public interests;", "label": ["Important", "Risk"], "rewrite": "Those who are directly related to public safety, public health, and major public interests cannot respond to requests."}
{"task": "rw_43.jsonl", "id": 51509, "text": "4. Directly related to criminal investigation, prosecution, trial and execution judgment;", "label": ["Important", "Risk"], "rewrite": "Those who are directly related to criminal investigation, prosecution, trial, and execution judgments cannot respond to requests."}
{"task": "rw_43.jsonl", "id": 51510, "text": "5. Personal information controller has sufficient evidence to indicate that the subject of personal information has subjective malice or abuse of rights;", "label": ["Important", "Risk"], "rewrite": "Personal information controller has sufficient evidence to indicate that the subject of personal information has subjective malice or abuse of rights, and cannot respond to the request."}
{"task": "rw_43.jsonl", "id": 51511, "text": "6. For major legitimate rights and interests such as the life and property of the subject of personal information or other individuals, it is difficult to get my consent;", "label": ["Important", "Risk"], "rewrite": "It is difficult to respond to the request that maintains major legitimate rights and interests such as life and property, but it is difficult to get my consent."}
{"task": "rw_43.jsonl", "id": 51512, "text": "7. The request of the person in response to the subject of the personal information will cause the legitimate rights and interests of the personal information subject or other individuals and organizations to be seriously damaged;", "label": ["Important", "Risk"], "rewrite": "In response to the request of the subject of personal information, if the legitimate rights and interests are severely damaged, the request cannot be responded."}
{"task": "rw_43.jsonl", "id": 51513, "text": "8. Involved in business secrets.", "label": ["Important", "Risk"], "rewrite": "Those who involve business secrets cannot respond to requests."}
{"task": "rw_43.jsonl", "id": 51514, "text": "6. How do we deal with children's personal information", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51515, "text": "Our products, websites and services are mainly adults.", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51516, "text": "Without the consent of parents or guardians, children must not create their own user account.", "label": ["Specific Audiences", "Important"], "rewrite": "Without the consent of parents or guardians, children must not create their own user account."}
{"task": "rw_43.jsonl", "id": 51517, "text": "Regarding the case of collecting children's personal information with the consent of parents, we will only use or disclose this information if they are allowed to be allowed, parents or guardians to clearly consent or protect children.", "label": ["Specific Audiences", "Important"], "rewrite": "Regarding the case of collecting children's personal information with the consent of parents, we will only use or disclose this information if they are allowed to be allowed, parents or guardians to clearly consent or protect children."}
{"task": "rw_43.jsonl", "id": 51518, "text": "Although local laws and customs have different definitions of children, we regard anyone under the age of 14 as children.", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51519, "text": "If we find that we collect their personal information without the consent of the parents who can be confirmed in advance, they will try to delete relevant data as soon as possible.", "label": ["Specific Audiences", "Important"], "rewrite": "If we find that we collect their personal information without the consent of the parents who can be confirmed in advance, they will try to delete relevant data as soon as possible."}
{"task": "rw_43.jsonl", "id": 51520, "text": "7. How can your personal information be transferred globally", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51521, "text": "At present, we will not transmit or store your personal information cross -border.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "At present, we will not transmit or store your personal information cross -border."}
{"task": "rw_43.jsonl", "id": 51522, "text": "If you need to transmit or store cross -border in the future, we will inform you that the purpose of information outbound, receiving party, security measures and security risks, and obtain your consent.", "label": ["Data Retention", "Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you need to transmit or store cross -border in the future, we will inform you that the purpose of information outbound, receiving party, security measures and security risks, and obtain your consent."}
{"task": "rw_43.jsonl", "id": 51523, "text": "8. How to update this policy", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51524, "text": "Our privacy policy may change.", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51525, "text": "Without your clear consent, we will not reduce the rights you should enjoy in accordance with this privacy policy.", "label": ["Important"], "rewrite": "Without your clear consent, we will not reduce the rights you should enjoy in accordance with this privacy policy."}
{"task": "rw_43.jsonl", "id": 51526, "text": "We will post any changes to this policy on this page.", "label": ["Policy Change", "Important"], "rewrite": "We will post any changes to this policy on this page."}
{"task": "rw_43.jsonl", "id": 51527, "text": "We will send a updated version by the mobile terminal or the official website between the Dest or the official website or remind you to update the relevant content in other appropriate ways.", "label": ["Policy Change", "Important"], "rewrite": "We will send a updated version by the mobile terminal or the official website between the Dest or the official website or remind you to update the relevant content in other appropriate ways."}
{"task": "rw_43.jsonl", "id": 51528, "text": "For major changes, we will also provide a more significant notice (we will include the specific change content of the privacy policy through the method that includes but not limited to APP push notifications or make special prompts on the browsing page).", "label": ["Policy Change", "Important"], "rewrite": "For major changes, we will also provide a more significant notice."}
{"task": "rw_43.jsonl", "id": 51529, "text": "The major changes in this policy include, but not limited to:", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51530, "text": "1. Make a major change in our service model.", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51531, "text": "Such as the purpose of handling personal information, the type of personal information, the use of personal information, etc.;", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51532, "text": "2. We have changed significantly in the aspects of ownership structure and organizational structure.", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51533, "text": "Such as changes caused by business adjustments, bankruptcy mergers and acquisitions, etc.", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51534, "text": "3. The main object of personal information sharing, transfer or public disclosure changes;", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51535, "text": "4. The right to participate in personal information processing and its exercise methods have changed significantly;", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51536, "text": "5. When we are responsible for handling the responsible departments, contact methods and complaint channels of personal information security;", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51537, "text": "6. Personal information security impact assessment report shows that there is a high risk.", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51538, "text": "We will also archive the old version of this policy for you to check.", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51539, "text": "Nine, the application of this policy", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51540, "text": "All services of this software are applicable to this policy.", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51541, "text": "When you log in to this software for the first time, we will prompt you to read this policy and obtain your consent.", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51542, "text": "If you refuse, it will not affect you to continue using this software, but some software functions will not be used. Please understand and understand.", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51543, "text": "Ten, how to contact us", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51544, "text": "Our contact information: Beijing Dega Technology Co., Ltd.", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51545, "text": "Registered address: 4319, 4th Floor, No. 4, No. 4, Henan Street, Gaobeidian Township, Chaoyang District, Chaoyang District, Beijing", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51546, "text": "Contact information of the person in charge of personal information protection: [010-59231388, turn, 827]", "label": ["Important", "Contact Information"], "rewrite": "Contact information of the person in charge of personal information protection: [010-59231388 to 827]."}
{"task": "rw_43.jsonl", "id": 51547, "text": "Customer service email: de Jiankefu@163.com", "label": ["Important", "Contact Information"], "rewrite": "Customer service email: dejiankefu@163.com."}
{"task": "rw_43.jsonl", "id": 51548, "text": "Customer Service Tel: 4008813311", "label": ["Important", "Contact Information"], "rewrite": "Customer service phone: 4008813311."}
{"task": "rw_43.jsonl", "id": 51549, "text": "If you have any questions, opinions, and suggestions during the process of software use and any questions, opinions, and suggestions on the privacy policy, you can contact us through the above contact information.", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51550, "text": "historic version:", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51551, "text": "Privacy Policy (August 2020)", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51552, "text": "Privacy Policy (November 2019)", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51553, "text": "Privacy Policy (August 2019)", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51554, "text": "Privacy Policy (December 2018)", "label": [], "rewrite": []}
{"task": "rw_43.jsonl", "id": 51555, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
