{"task": "rw_44.jsonl", "id": 51942, "text": "Pinduoduo privacy policy", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 51943, "text": "(EXPRESS", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 51944, "text": "Update date: December 11, 2020", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 51945, "text": "Special Note:", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 51946, "text": "Pinduoduo Privacy Policy (V3.2.1) Update Date: December 11, 2020", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 51947, "text": "Pinduoduo (Shanghai Xunmeng Information Technology Co., Ltd., the following or \"we\") pays great attention to protecting the personal information and privacy of users (\"you\"). In view of your use of our service, we may collect and use your use of your serviceRelated information, in order to clarify the rules of collecting, using, sharing, management and protection of user information, this \"Pinduoduo Privacy Policy\" (hereinafter or \"this policy\") is specially formulated.", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 51948, "text": "Before using Pinduoduo's products or services, please be sure to read and thoroughly understand this policy (especially the contents of bold or lower lines), and use related products or services after confirming and agreeing.", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 51949, "text": "Once you start to use Pinduoduo's various products or services, it means that you have fully understood and agree with this policy.", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 51950, "text": "1. Scope and revision", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 51951, "text": "1.1. This \"Pinduoduo Privacy Policy\" is the component of the \"Pinduoduo User Service Agreement\", which is the same as the \"Pinduoduo User Service Agreement\".", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 51952, "text": "1.2. You understand and agree that Pinduoduo has the right to unilaterally revise this policy according to the needs of business development, and completely replace the version before the revised version.", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 51953, "text": "Please pay attention to and understand the revision of this policy in time. If you do not agree with the revised version, you should immediately stop using the Pinduoduo service, otherwise you will depend on your consent and fully accept the revised version.", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 51954, "text": "2. Collect and use user information", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 51955, "text": "2.1. The personal information referred to in this policy refers to the various information that can be recorded alone or to identify the personal identity of the natural person with other information in electronics or other methods.", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 51956, "text": "The personal sensitive information referred to in this policy refers to personal information that once leaked, illegally provided or abuses the security of people and property, which can easily lead to personal information such as personal reputation, physical and mental health, or discriminatory treatment.Biometric information, bank accounts, property information, travel trajectory and transaction information.", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 51957, "text": "Solid device information, log information, search keyword information, and other information or data that cannot be directly established with specific individuals are not personal information or personal sensitive information.", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 51958, "text": "2.2. You fully understand and agree to achieve online shopping, optimize our products and/services and guarantee safety necessary", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 51959, "text": "Function, you must authorize Pinduoduo to collect and use your following information:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 51960, "text": "2.2.1. User registration information required", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 51961, "text": "When you use your mobile phone number to register as a Pinduoduo user, we will verify whether your identity is valid by sending a SMS verification code.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use your mobile phone number to register as a Pinduoduo user, we will verify whether your identity is valid by sending a SMS verification code."}
{"task": "rw_44.jsonl", "id": 51962, "text": "In the process of registering as a Pinduoduo user, if you provide the following additional information to supplement your information, it will help us provide you with better and more personalized services.Earth, birthday, personality signature.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 51963, "text": "If you do not provide these additional information, it will not affect the basic functions of your online shopping.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 51964, "text": "2.2.2. Show the information required for goods and/services", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 51965, "text": "To provide you with page display and search results that meet your needs, we will collect information on your service and use information and associate this information. This information includes:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 51966, "text": "1) Equipment information: Pinduoduo may read your access to Pinduoduo platform or use the Pinduoduo service. Equipment information, including but not limited to equipment types, equipment models, equipment settings, equipment recognition codes, equipment, storage storage, storageSpace, operating system and application versions, language settings, resolution, software and hardware feature information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Pinduoduo may read your access to Pinduoduo platform or use the equipment information used when using Pinduoduo."}
{"task": "rw_44.jsonl", "id": 51967, "text": "In addition, Pinduoduo may write the storage space for your access to Pinduoduo platform or use the equipment used by Pinduoduo.", "label": ["Important", "First Party Collection Information"], "rewrite": "Pinduoduo may write a storage space for your access to Pinduoduo platform or using the equipment used when using Pinduoduo."}
{"task": "rw_44.jsonl", "id": 51968, "text": "Search, records, browsing records, browsing habits, use of language, visit date and time, telecommunications operators and records, recorded web records you need).", "label": ["Important", "First Party Collection Information"], "rewrite": "When you access the Pinduoduo platform or use the Pinduoduo service, the system may automatically receive and record information on your browser and computer."}
{"task": "rw_44.jsonl", "id": 51969, "text": "2.2.3. Information required for transactions and after -sales 1) Order information", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 51970, "text": "When you place an order to buy goods/services, Pinduoduo system will generate orders for you to buy the product/service.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you place an order to buy goods/services, Pinduoduo system will generate orders for you to buy the product/service."}
{"task": "rw_44.jsonl", "id": 51971, "text": "You need to fill in at least your consignee's name (or name), the receiving address and phone number in the order. This order will also stipulate the order number, the product or service information you purchasedThe amount you actually pay and the payment method you use.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 51972, "text": "According to the characteristics of some goods or services and the requirements of applicable laws, you may also need to provide relevant identity information (such as your ID card, officer card, passport, Hong Kong, Macao and Taiwan pass, driving, social security card, student ID, or related relevant relatedCertificate numbers), email, photos or videos of your own, if you do not, buy/do not use certain goods/services, you do not need to provide relevant information.", "label": ["Important", "First Party Collection Information"], "rewrite": "You may also need to provide relevant identity information, emails, photos or videos of your own, if you do not buy/do not use certain goods/services, you do not need to provide relevant information."}
{"task": "rw_44.jsonl", "id": 51973, "text": "If you understand and agree, we will use your order information to perform your identity verification, determine transactions, pay for calculations, query orders for you, provide customer service consultation and after -sales service;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 51974, "text": "We may also use your order information to determine whether your transaction is abnormal to protect your transaction security.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may also use your order information to determine whether your transaction is abnormal to protect your transaction security."}
{"task": "rw_44.jsonl", "id": 51975, "text": "2) Payment information, after you place an order, you can complete the payment through the third -party payment institution supported by Pinduoduo. The payment function itself does not collect your personal information, but we need to put your order number and transaction amount amount and transaction amount.And the transaction information required by the agency to share with the payment institutions you choose to share it to realize its confirmation of your payment instructions and complete the support, and pay.", "label": ["Important", "First Party Collection Information"], "rewrite": "We need to share your order number, transaction amount, and other transaction information with the payment institutions you choose to confirm your payment instructions and complete the payment."}
{"task": "rw_44.jsonl", "id": 51976, "text": "3) The information required for customer service and/after -sales service Our customer service and after -sales function will use your account information and order information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 51977, "text": "To ensure your account security, our customer service will use your account information to verify your identity.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 51978, "text": "When you need us to provide your order information, customer service or after -sales function, we will check your order information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you need us to provide customer service or after -sales function related to your order information, we will check your order information."}
{"task": "rw_44.jsonl", "id": 51979, "text": "According to the service content you required, you may provide other information other than the above information when communicating with our customer service staff to assist customer service staff to complete the services you required.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 51980, "text": "4) Ensure the information required for transaction security", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 51981, "text": "To confirm the transaction status and provide you with after -sales and dispute solutions, we must be determined based on the exchange", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 51982, "text": "Trading objects, third -party payment institutions, logistics companies, etc.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 51983, "text": "Logistics information, or share your transaction information with the above -mentioned service providers.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 51984, "text": "2.2.4., Optimize the information required by the product and/service, we may collect your order information, browsing records, browsing habits for data analysis to describe the user's special, sign, to show you or recommend products you are interested inOr service information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may collect your order information, browsing records, browsing habits for data analysis to describe user characteristics to show you or recommend product or service information for you."}
{"task": "rw_44.jsonl", "id": 51985, "text": "In addition to the above information, we may also collect your other information to provide the reasonable needs of service or improve the qualityEssence", "label": ["Important", "First Party Collection Information"], "rewrite": "We may also collect your other information to provide the reasonable needs of services or improve service quality, including the information provided by you when contacting our customer service, and the information sent to us when participating in the questionnaire survey."}
{"task": "rw_44.jsonl", "id": 51986, "text": "We may come from the information of a service from the Pinduoduo platform with other services from the Pinduoduo platform to provide you with services, personalized content and suggestions.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may combine the information from the Pinduoduo platform with other services from the Pinduoduo platform to provide you with service, personalized content and suggestions."}
{"task": "rw_44.jsonl", "id": 51987, "text": "For information collected from your various devices, we may associate them so that we can provide you with consistent services on these devices.", "label": ["Important", "First Party Collection Information"], "rewrite": "For information collected from your various devices, we may associate them so that we can provide you with consistent services on these devices."}
{"task": "rw_44.jsonl", "id": 51988, "text": "When we conduct the products and/service optimization of these clauses, we only use your information on the Pinduoduo platform.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 51989, "text": "2.2.5., To ensure the information required by account security, in order to improve the security of your use of Pinduoduo service, and more accurately prevent the security of fishing websites fraud and protect account security, we may understand your order information, browsing records, browsing browsingHabits, software installation lists, equipment letter, interest, equipment, Mac, address, account number, gmail, list to determine the risk of your account, and may record some of me, which think of risk links (\"url\").", "label": ["Important", "First Party Collection Information"], "rewrite": "We may judge the risk of your account by understanding your order information, browsing records, browsing habits, software installation lists, equipment information, equipment MAC addresses, account Gmail lists, and may record some links that we think are risky (\"\"URL \")."}
{"task": "rw_44.jsonl", "id": 51990, "text": "2.3. Users can choose information about whether it is authorized to collect and use", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 51991, "text": "In order to provide you with better, satisfactory and personalized services, and strive to improve your user experience, we may add and use your information.", "label": ["Important", "First Party Collection Information"], "rewrite": "To provide you with better services and strive to improve your user experience, you may collect and use your information."}
{"task": "rw_44.jsonl", "id": 51992, "text": "If you do not provide this information, you can still get the services that Pinduoduo provides you, but you may not get the user experience brought by these additional information to you.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 51993, "text": "2.3.1., Location Information: We may collect your location information to judge the location of your place, and recommend your area for you", "label": ["Important", "First Party Collection Information"], "rewrite": "We may collect your location information to judge where you are."}
{"task": "rw_44.jsonl", "id": 51994, "text": "The goods or services that can be purchased in the domain (we only collect the geographical location you were at that time, and will not give you different time periods.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 51995, "text": "Location information is connected and combined to judge your whereabouts).", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 51996, "text": "2.3.2. Camera (camera), album (picture library) information: You can upload photos or pictures on Pinduoduo to take a list,", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 51997, "text": "Post comments, we may use the photos or pictures you uploaded to identify the products or services you need to buy, or use the review information containing the photos or pictures you uploaded.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may use the photos or pictures you uploaded to identify the products or services you need to buy, or use comment information."}
{"task": "rw_44.jsonl", "id": 51998, "text": "If you support your face, identify login or authentication, we will collect your facial information.", "label": ["Important", "First Party Collection Information"], "rewrite": "If Pinduoduo service supports your face recognition login or authentication, we will collect your facial information."}
{"task": "rw_44.jsonl", "id": 51999, "text": "2.3.3., Microphone (Voice) Information: To better use Pinduoduo service, you may enable microphones to communicate with us, buns, and other subjects. We may collect your voice information to identify your needsEssence", "label": ["Important", "First Party Collection Information"], "rewrite": "You may open a microphone to communicate with us, Pinduoduo merchants or other subjects, and we may collect your voice information to identify your needs."}
{"task": "rw_44.jsonl", "id": 52000, "text": "2.3.4. Contact information: We may collect your contact information to facilitate you without your hands when buying goods or services, and input your contact information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may collect your contact information to facilitate you without manually entering your contact information when buying goods or services."}
{"task": "rw_44.jsonl", "id": 52001, "text": "In the case of obtaining your consent or in accordance with the provisions of laws and regulations, we may judge whether your contacts are both Pinduoduo users, so as to establish a joint department for your exchanges.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52002, "text": "2.3.5., Calendar Information: We will collect your calendar information to provide you with related records and mentioned records and interests, wake up.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect your calendar information to provide you with records and reminders of shopping or receiving equity."}
{"task": "rw_44.jsonl", "id": 52003, "text": "2.3.6., You understand and agree, in the above situation, we may need you to open your geographical location, (location information), camera (camera), album (picture library), microphone (voice) in your device, Calculation and calendar, etc., wait for access to the collection and use of information involved in these permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "We may need you to open your geographical location (location information), camera (camera), album (picture library), microphone (voice), address book, and calendar in your device to realize the information involved in these permissionsCollection and use."}
{"task": "rw_44.jsonl", "id": 52004, "text": "You can check item by item in your device, see the state of the above permissions, and determine the opening or closing of these permissions (as applicable).", "label": ["Permission Acquisition", "Important"], "rewrite": "You can view the state of the above permissions in your device one by one, and you can determine the opening or closing of these permissions (as applicable)."}
{"task": "rw_44.jsonl", "id": 52005, "text": "When you open any one, the permission means that you authorize us to collect and use the information to achieve the corresponding goal.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you open the right permissions, it means that you authorize us to collect and use the information to achieve the corresponding goals."}
{"task": "rw_44.jsonl", "id": 52006, "text": "Once you turn off your authority, it means that you cancel the authorization. We will no longer continue to collect and use this personal information, nor can it be achieved for you.", "label": ["Permission Acquisition", "Important"], "rewrite": "Once you turn off the right, it means that you cancel the authorization. We will no longer continue to collect and use this personal information, and we cannot achieve the corresponding goals for you."}
{"task": "rw_44.jsonl", "id": 52007, "text": "However, your decision to close permissions will not affect the collection, processing and use of information based on your authorization.", "label": ["Permission Acquisition", "Important"], "rewrite": "The decision to close permissions will not affect the collection, processing and use of information based on your authorization."}
{"task": "rw_44.jsonl", "id": 52008, "text": "2.4. Exception of obtaining authorization consent", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52009, "text": "You fully know that in accordance with the relevant laws and regulations, in the following situations, we collect and use your personal letter, and you do not need to obtain your authorization consent:", "label": ["Important", "First Party Collection Information"], "rewrite": "In the following circumstances, we collect and use your personal information without obtain your authorization consent:"}
{"task": "rw_44.jsonl", "id": 52010, "text": "2.4.1., Related to national security and national defense security;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting personal information related to national security and national defense security does not need to solicit consent."}
{"task": "rw_44.jsonl", "id": 52011, "text": "2.4.2., Related to public safety, public health, major public interests;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting personal information related to public safety, public health, and major public interests does not require consent."}
{"task": "rw_44.jsonl", "id": 52012, "text": "2.4.3., Related to criminal investigation, prosecution, trial, and execution of judgment;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting related personal information related to criminal investigation, prosecution, trial, and execution of judgments does not need to ask for consent."}
{"task": "rw_44.jsonl", "id": 52013, "text": "2.4.4. Out of major legitimate rights and interests of the life and property of the subject of personal information or other individuals, it is difficult to get me", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting major legitimate rights and interests such as life and property, but it is difficult to obtain personal information that I agree, without asking for consent."}
{"task": "rw_44.jsonl", "id": 52014, "text": "Agree;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52015, "text": "2.4.5., The collected personal information is made by your own public;", "label": ["Important", "First Party Collection Information"], "rewrite": "The collected personal information is made to the public by itself without asking for consent."}
{"task": "rw_44.jsonl", "id": 52016, "text": "2.4.6. Collect personal information from the information disclosed by legal and publicly disclosed, such as legal news reports, government information disclosure, etc.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you collect personal information from the legal disclosure information, you do not need to ask for consent."}
{"task": "rw_44.jsonl", "id": 52017, "text": "road;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52018, "text": "2.4.7., Sign the contract required according to your requirements;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting the personal information necessary for the signing of the contract does not need to ask for consent."}
{"task": "rw_44.jsonl", "id": 52019, "text": "2.4.8., To maintain the safe and stable operation of the products or services provided by maintenance, such as discovering, disposing of products or services", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting personal information necessary for the safe and stable operation of products or services, there is no need to solicit consent."}
{"task": "rw_44.jsonl", "id": 52020, "text": "Handling failure;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52021, "text": "2.4.9., It is necessary for legal news reports;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting the personal information necessary for legal news reports does not need to solicit consent."}
{"task": "rw_44.jsonl", "id": 52022, "text": "2.4.10. Academic research institutions need to carry out statistics or academic research based on public interests, and provide academic research or descriptions outside the outside world", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52023, "text": "When describing the results, identify the personal information contained in the result;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52024, "text": "2.4.11., Other circumstances stipulated in laws and regulations.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect personal information under other circumstances stipulated in the laws and regulations without asking for consent."}
{"task": "rw_44.jsonl", "id": 52025, "text": "2.5. Information from third parties", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52026, "text": "2.5.1. You understand and agree. In the process of registering Pinduoduo account and service process, you authorize Pinduoduo", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52027, "text": "Related parties and partners obtain the relevant information collected.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52028, "text": "2.5.2. If you use a third -party account to log in to Pinduoduo, we can get the account information you authorized shared from the third party, and", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52029, "text": "Your third -party account is bound to your Pinduoduo account so that you can log in and use it directly through a third -party account", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52030, "text": "2.5.3. The information provided or shared by other users may contain your information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52031, "text": "For example, the logistics address provided by other users may contain your information in the content shared.", "label": ["Important", "First Party Collection Information"], "rewrite": "The logistics address or share provided by other users may contain your information."}
{"task": "rw_44.jsonl", "id": 52032, "text": "2.6. User information authorization use", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52033, "text": "To provide you with satisfactory and high -quality services, you understand, agree and authorize us to use your information for the following uses:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52034, "text": "2.6.1. Provide you all the services you use and maintain and improve these services.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52035, "text": "2.6.2.,, According to your device information and your browsing information when you use the Pinduoduo platform, we will extract your preferences, signs, and based on feature tagsIncluding but not, it is limited to sending products, service information to you, or showing you a personalized third -party promotion information to you, or sharing information with Pinduoduo partners with Pinduoduo with your consent so that they can to you to you to youSend information about its products, and services.", "label": ["Important", "Usage"], "rewrite": "We will recommend your preferences based on your device information and your browsing information when using the Pinduoduo platform, and recommend the content you may be interested in based on the indirect user portrait formed based on feature labels."}
{"task": "rw_44.jsonl", "id": 52036, "text": "When we recommend the content you may be interested in, we only use what you are in the Pinduoduo platform.", "label": ["Important", "Usage"], "rewrite": "When we recommend the content you may be interested in, we only use the information on your Pinduoduo platform."}
{"task": "rw_44.jsonl", "id": 52037, "text": "If you do not want to receive the above information, you can withdraw bips through the withdrawal function;", "label": ["Usage"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52038, "text": "We have been improving and optimizing the recommendation mechanism. When you open the homepage of our client or enter the personal center, and the recommended page of the chat page, you can achieve the recommendation content of the recommended content according to the prompts through the pictures of the product or service.Management operations, such as choice, do not want to see the corresponding goods or services, or choose the preference category that does not want to see the product or service;", "label": ["Important", "Usage"], "rewrite": "You can manage the management operation of the recommended content by long pressing the picture of the product or service according to the prompts."}
{"task": "rw_44.jsonl", "id": 52039, "text": "You can also pass through the \"Personal Center-Settings-Frequently Asked Questions-Personalized Advertising\" page to close personalized advertising functions.", "label": ["Important", "Edit/Control"], "rewrite": "You can also enter the \"Personal Center-Settings-Common Questions-Personalized Advertising\" page to close the personalized advertising function."}
{"task": "rw_44.jsonl", "id": 52040, "text": "2.6.3. We may use your personal information to verify the identity, prevention, discovery, investigation, harm, safety, illegal or violation of our affairs, policies, or rules that violate us or related parties, in order to protect you and other Pinduoduouser,", "label": ["Usage"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52041, "text": "Or the legitimate rights and interests of our or its affiliated parties;", "label": ["Usage"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52042, "text": "2.6.4., We may combine the information from a certain service with the information obtained from other services to provide you with more personalized services.", "label": ["Important", "Usage"], "rewrite": "We may combine information from a certain service with the information obtained from other services to provide you with more personalized services."}
{"task": "rw_44.jsonl", "id": 52043, "text": "2.6.5., We will count our service usage, and may share these statistical letters and interests with the public or third parties to show the overall trend of our products or services.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We will statistics on our service usage and may share these statistical information with the public or third parties to show the overall trend of our products or services."}
{"task": "rw_44.jsonl", "id": 52044, "text": "But these statistical information does not contain any body of your body, identifying information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "These statistical information does not include any identification information of your identity."}
{"task": "rw_44.jsonl", "id": 52045, "text": "2.6.6. Invite you to participate in the survey of our products and services;", "label": ["Usage", "Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52046, "text": "2.6.7. Other purposes allowed by your consent or authorization or laws and regulations.", "label": ["Usage"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52047, "text": "3. Cookie and the use of similar technologies", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52048, "text": "3.1., You understand and agree to make you get a easier access experience, you access the Pinduoduo platform or use the Pinduoduo service. At that time, we may use various technical collection and storage related information, including using small data file identification to identifyYour identity, to understand your habits, help you save the steps to repeatedly enter the registration information, or help judge you, account security.", "label": ["Data Retention", "Important", "First Party Collection Information"], "rewrite": "When you access the Pinduoduo platform or use the Pinduoduo service, we may use various technical collection and storage related information, including using small data files to identify your identity to understand your habits."}
{"task": "rw_44.jsonl", "id": 52049, "text": "These data files may be Cookie, Flash Cookie, or other local storage provided by your browser or associated application (collectively referred to as \"Cookie\").", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52050, "text": "3.2. You understand and agree that some of our services may only be realized by using cookies.", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52051, "text": "If your browser or browser additional service allows, you can modify the degree of acceptance of Cookie or refuse to fight a lot of cookies, but if you refuse to fight a lot, Cookie may affect your security access Pinduoduo platform and the Pinduoduo platform andUse Pinduoduo service.", "label": ["Important", "Edit/Control"], "rewrite": "You can modify the degree of acceptance of Cookie or Cookie who refuses to fight a lot, but Cookie, which refuses to Pinduoduo, may affect your security access Pinduoduo platform and use Pinduoduo service in some cases."}
{"task": "rw_44.jsonl", "id": 52052, "text": "3.3., You understand and agree, you may exist in the process of visiting Pinduoduo platform or using Pinduoduo service.(Collectively referred to as \"network, beacon\"), and it can help the website to calculate the users of the webpage or access certain cookies.", "label": ["Important", "First Party Collection Information"], "rewrite": "In the process of visiting Pinduoduo platform or using Pinduoduo service, there may be some electronic images, called \"single pixel GIF files\", \"network beacon\" or other similar technologies (collectively referred to as \"Internet Beacon\"), which can help the websiteCalculate users who browse webs or visit certain cookies."}
{"task": "rw_44.jsonl", "id": 52053, "text": "We may collect your browsing web activity information through the Internet Beacon, such as the page address you visited, the address of the quoted page you previously visited, the time you stay on the page, your browsing environment and display settings.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may collect your browsing web activity information through the Internet BEACON, such as the page address you visited, the address of the quoted page you have previously visited, the time you stay on the page, your browsing environment and display settings."}
{"task": "rw_44.jsonl", "id": 52054, "text": "4. The sharing, transfer and public disclosure of user information 4.1. Sharing of user information", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52055, "text": "4.1.1., Except for the following situations, we will not provide your personal information to any individual, company or group other than Pinduoduo, weaving and sharing:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Except for the following situations, we will not provide your personal information to any individual, company or organization other than Pinduoduo:"}
{"task": "rw_44.jsonl", "id": 52056, "text": "1), you have obtained your clear consent or authorization in accordance with this policy or in advance;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Personal information may be shared according to your clear consent or authorization in advance if you have obtained your clear consent or authorization in advance."}
{"task": "rw_44.jsonl", "id": 52057, "text": "2), time according to the requirements of applicable laws, regulations, legal procedures, administrative or judicial compulsory requirements;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Personal information may be shared according to the requirements of applicable laws, regulations, legal procedures, administrative or judicial compulsory requirements."}
{"task": "rw_44.jsonl", "id": 52058, "text": "3) Within the scope of law and regulations, to maintain Pinduoduo and related parties or partners, you or other Pinduoduo", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52059, "text": "When multi -user or social public interest, property or security is exempted from damage;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52060, "text": "4), to achieve the core function of our service or provide the services you need;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Personal information may be shared to realize the core function of our service or provides the service you need."}
{"task": "rw_44.jsonl", "id": 52061, "text": "5), deal with your needs to deal with your disputes or disputes with others;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You may share your personal information when you deal with your disputes or disputes with others."}
{"task": "rw_44.jsonl", "id": 52062, "text": "6), according to the agreement or other legal documents signed with you;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "According to the agreement signed with you or other legal documents, personal information may be shared."}
{"task": "rw_44.jsonl", "id": 52063, "text": "7), used based on academic research;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Academic research may share personal information."}
{"task": "rw_44.jsonl", "id": 52064, "text": "8) Public interests based on the public interests stipulated in laws and regulations.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Social public interests based on laws and regulations may share personal information."}
{"task": "rw_44.jsonl", "id": 52065, "text": "4.1.2., You fully understand and agree, we may share your personal information with our related parties.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You fully understand and agree, we may share your personal information with our affiliates."}
{"task": "rw_44.jsonl", "id": 52066, "text": "But we can only share the necessary personal information and be restricted by the purpose declared in this policy.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only share the necessary personal information and be restricted by the purpose declared in this policy."}
{"task": "rw_44.jsonl", "id": 52067, "text": "If we share your personal sensitivity, feel information, or our affiliates to change the purpose of the use and processing of personal information, we will solicit your authorization and meaning again.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If we share your personal sensitive information or our affiliates need to change the purpose of the use and processing of personal information, we will solicit your authorization consent again."}
{"task": "rw_44.jsonl", "id": 52068, "text": "4.1.3., You fully understand and agree, we may share your information from your partners or other third parties to ensure that the services you provide are successfully completed.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You fully understand and agree that we may share your information from your partners or other third parties to ensure the smooth completion of the services provided by you."}
{"task": "rw_44.jsonl", "id": 52069, "text": "But we will only enjoy your information for the legal, correct, necessary, specific and clear goals, and only share the individual information necessary for providing services.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only share your information for legal, correct, necessary, specific, and clear goals, and only share the personal information necessary for providing services."}
{"task": "rw_44.jsonl", "id": 52070, "text": "We will have strict data protection measures with third parties such as partners to deal with personal information in accordance with this policy and any other related confidentiality and security measures.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will agreed with strict data protection measures with third parties such as partners to deal with personal information in accordance with this policy and any other related confidentiality and security measures."}
{"task": "rw_44.jsonl", "id": 52071, "text": "These third parties do not have the right to use the personal information that share it for any other purpose.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52072, "text": "For details of the SDK directory of third parties such as the partners we take, see here.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52073, "text": "At present, our partners include the following types:", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52074, "text": "1) Advertising partners.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52075, "text": "Unless you get your permission, we will not share your personal identity information and provide partners for advertising services.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Unless you get your permission, we will not share your personal identity information with a partner providing advertising services."}
{"task": "rw_44.jsonl", "id": 52076, "text": "We will entrust these partners to handle information related to advertising coverage and efficiency related information, but we will not provide your personal identity information, or we will target this information and identify processing so that it will not identify you.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will entrust these partners to process information related to advertising coverage and effectiveness, but we will not provide your personal identity information, or we will identify this information to identify it so that it will not recognize your individual."}
{"task": "rw_44.jsonl", "id": 52077, "text": "Such partners may combine the above information with other data from their legally obtained to implement the advertising services or decision -making suggestions that we entrust.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52078, "text": "2) Supplier of commodity or technical services.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52079, "text": "We may share your personal information with suppliers of Pinduoduo merchants or things, flow, technology and other services.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share your personal information with Pinduoduo merchants or suppliers of logistics, technology and other services."}
{"task": "rw_44.jsonl", "id": 52080, "text": "The purpose of our sharing of this information is to achieve our products/services, core shopping functions or technical support. For example, we must share your order information and receipt information, and enjoy the merchant and logistics service providers to indicate that it is deliveredCommodity or service.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The purpose of our sharing of this information is to achieve the core shopping function of our product/service or obtain technical support."}
{"task": "rw_44.jsonl", "id": 52081, "text": "3) Entrust our partners for promotion.", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52082, "text": "Sometimes we will accept other companies commissioned to promote promotion to user groups using our products/ services.", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52083, "text": "We may use your personal information and your non -personal letter. The indirect user portrait formed by the collection of interest collection is shared with these enterprises, but we will only provide promotion to these enterprises.Provide your personal identity information or make this information and summarize so that providing such information will not identify you.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may use your personal information and the indirect user portrait formed by your non -personal information collection to share with these enterprises."}
{"task": "rw_44.jsonl", "id": 52084, "text": "For example, to provide such companies with statistical information that cannot recognize personal identity to help them understand the audience or customers.", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52085, "text": "4.1.4., You fully understand and agree. We may be exchanged for personal information of user or organization in the case of preventing illegal activities such as fraud and reducing credit risks, but do not include violating the commitment made in this policy.In order to make a profit, the sale, rental, sharing or personal information disclosed in any other way.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may exchange personal information with other companies or organizations with other companies or organizations in case of preventing illegal activities such as fraud and reducing credit risks."}
{"task": "rw_44.jsonl", "id": 52086, "text": "4.2. Transfer of user information", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52087, "text": "Except for the following situations, we will not transfer your personal information to any individual, company or organization:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Except for the following situations, we will not transfer your personal information to any individual, company or organization:"}
{"task": "rw_44.jsonl", "id": 52088, "text": "4.2.1., Get your clear consent or authorization in advance;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Personal information may be transferred in the case of obtaining your clear consent or authorization in advance."}
{"task": "rw_44.jsonl", "id": 52089, "text": "4.2.2.,, According to the requirements of the applicable laws, regulations, legal procedures, administrative or judicial compulsory requirements;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Personal information may be transferred when the applicable laws, regulations, and legal procedures are required, administrative or judicial compulsory requirements must be transferred."}
{"task": "rw_44.jsonl", "id": 52090, "text": "4.2.3., According to the agreement signed with the agreement or other legal documents you signed;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Personal information may be transferred according to the relevant agreements signed by you or other legal documents."}
{"task": "rw_44.jsonl", "id": 52091, "text": "4.2.4., Involved in cooperation, joint venture, mergers, acquisitions, asset transfer or other similar transactions.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Personal information may be transferred to cooperation, associates, mergers, acquisitions, asset transfer or other similar transactions."}
{"task": "rw_44.jsonl", "id": 52092, "text": "4.3. Public disclosure of user information", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52093, "text": "Pinduoduo attaches great importance to protecting your personal information. Without your consent, Pinduoduo will not disclose it to an unrelated third party, let alone make it public, except for the following reasons: except for the following reasons: except for the following reasons: except for disclosure:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Without your consent, Pinduoduo will not disclose it to the unrelated third parties, let alone make it public, but except for the following reasons:"}
{"task": "rw_44.jsonl", "id": 52094, "text": "4.3.1., Get your clear consent or based on your active choice;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Get your clear consent or disclose personal information based on your active choice."}
{"task": "rw_44.jsonl", "id": 52095, "text": "4.3.2.,, According to the requirements of laws, regulations, mandatory administrative law enforcement or judicial requirements that must provide your personal information, we may disclose your personal personal information type and disclosure method according to the required personal information types and disclosure methods.information;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In accordance with the requirements of laws and regulations, mandatory administrative law enforcement or judicial requirements, we may disclose your personal information according to the types of personal information and disclosure required."}
{"task": "rw_44.jsonl", "id": 52096, "text": "4.3.3. Other circumstances that can be disclosed in accordance with the law or the agreed between the two parties.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52097, "text": "4.3.4., You understand and agree, sharing and transfer personal information to the identification processing according to the law, and ensure that the number", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "According to the law, the personal information of sharing and transferred the identification processing, and ensure that the data receiver cannot restore and re -identify the subject of personal information, which does not belong to the external sharing, transfer and public disclosure of personal information.Save and processing will not be notified to you separately and obtain your consent."}
{"task": "rw_44.jsonl", "id": 52098, "text": "If the receiver cannot restore and re -identify the subject of personal information, it does not belong to the external sharing, transfer and public disclosure of personal information. The preservation and processing of such data will not be notified to you separately and obtain your consent.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52099, "text": "5. Protection of user personal information", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52100, "text": "5.1. Data security measures", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52101, "text": "We have used security measures that meet the industry standards to protect your personal information, prevent data from being unprepared, authorized access, public disclosure, use, modification, damage or loss.", "label": ["Important", "Data Security"], "rewrite": "We have used security measures that meet the industry standards to protect your personal information, prevent data from being unauthorized, publicly disclosed, used, modified, damaged or lost."}
{"task": "rw_44.jsonl", "id": 52102, "text": "We will take all reasonable and feasible measures to protect your personal information.", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52103, "text": "For example, when you exchange data (such as credit card information) between your browser and \"service\", you, SSL, encryption protection;", "label": ["Important", "Data Security"], "rewrite": "Exchange data (such as credit card information) between your browser and \"service\" (such as credit card information) is protected by SSL."}
{"task": "rw_44.jsonl", "id": 52104, "text": "We also provide, https, safe browsing mode;", "label": ["Important", "Data Security"], "rewrite": "We also provide HTTPS security browsing models on Pinduoduo website at the same time."}
{"task": "rw_44.jsonl", "id": 52105, "text": "We will use add and secret technology to ensure the confidentiality of the data;", "label": ["Important", "Data Security"], "rewrite": "We will use encryption technology to ensure the confidentiality of data."}
{"task": "rw_44.jsonl", "id": 52106, "text": "We will use a trusted protection mechanism to prevent data from being maliciously attacked;", "label": ["Important", "Data Security"], "rewrite": "We will use a trusted protection mechanism to prevent data from being maliciously attacked."}
{"task": "rw_44.jsonl", "id": 52107, "text": "I, we will deploy the access control mechanism to ensure that only authorized personnel can access personal information;", "label": ["Important", "Data Security"], "rewrite": "We will deploy the access control mechanism to ensure that only authorized personnel can access personal information."}
{"task": "rw_44.jsonl", "id": 52108, "text": "And we will organize safety, and privacy protection training courses to strengthen employees' awareness of protecting the importance of personal information.", "label": ["Important", "Data Security"], "rewrite": "We will deploy the access control mechanism to ensure that only authorized personnel can access personal information."}
{"task": "rw_44.jsonl", "id": 52109, "text": "5.2., We will take reasonable and feasible measures to avoid collecting unrelated personal information.", "label": ["Important", "Data Security"], "rewrite": "We will take reasonable and feasible measures to avoid collecting unrelated personal information."}
{"task": "rw_44.jsonl", "id": 52110, "text": "We will only retain your personal information within the time limit of the cost of reaching the cost, unless you need to extend the retention period or the permission or requirements of the laws and regulations.", "label": ["Data Retention", "Important"], "rewrite": "We will only retain your personal information within the time required for the purpose of the cost of reaching the cost policy, unless you need to extend the retention period or the permission or requirements of the laws and regulations."}
{"task": "rw_44.jsonl", "id": 52111, "text": "If you log out of the Pinduoduo account or we terminate the service or operation, we will delete or anonymous treatment of human information according to the provisions of Article 6.4, Article 6.4, and Article.", "label": ["Data Retention", "Important"], "rewrite": "If you cancel the Pinduoduo account or we terminate the service or operation, we will delete or processes your personal information in accordance with Article 6.4."}
{"task": "rw_44.jsonl", "id": 52112, "text": "5.3. The Internet is not an absolutely safe environment. We strongly recommend that you do not use the communication methods recommended by Bong Duo more than Pinduoduo to send personal information.", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52113, "text": "You can build connections and share with each other through our services.", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52114, "text": "When you create communication, transactions or sharing through our services, you can choose the objects that communicate, trades or share as a third party that can see your transaction content, contact methods, exchange information or share content.", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52115, "text": "5.4. When using the Pinduoduo service for online transactions, you inevitably expose your personal information to the other party or the potential transaction of the transaction, such as contact or contact address.", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52116, "text": "Please protect your personal information properly and provide others in the necessary situation.", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52117, "text": "If you find your personal information, especially your account or password, please contact Pinduoduo immediately so that we can take corresponding measures according to your application.", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52118, "text": "5.5. Special reminding you to note that when you use our service, you voluntarily shared or even publicly shared information may involve your or other people's personal information and even personal sensitive information. If you choose to upload pictures containing personal information when evaluating.", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52119, "text": "Please consider whether to share or even publicly share relevant information when using our services.", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52120, "text": "5.6. As mentioned above, Pinduoduo will use various security technologies, procedures and systems to prevent the loss and improper loss of personal information of the user, and use or disclosed unauthorized reading or disclosure.", "label": ["Important", "Data Security"], "rewrite": "Pinduoduo will use various security technologies, procedures and systems to prevent the loss of personal information, improper use, and unauthorized reading or disclosure of personal information."}
{"task": "rw_44.jsonl", "id": 52121, "text": "But you fully understand and agree: Due to technical restrictions and various malicious means of malicious means, in the Internet industry, even if you can do your best to strengthen security measures, it is impossible to ensure 100 % security of information.", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52122, "text": "5.7. After the personal information security incident occurred unfortunately, we will tell you in accordance with the requirements of the laws and regulations: the basic situation and possible impact, the disposal measures we have adopted or we will takeWind, dangerous suggestions, remedy measures, etc.", "label": ["Important", "Data Security"], "rewrite": "After unfortunately a personal information security incident, we will informed you in accordance with the requirements of laws and regulations: basic situations and possible impacts, disposal measures, suggestions, remedial measures, etc."}
{"task": "rw_44.jsonl", "id": 52123, "text": "In the event of the incident, we will inform you in a letter, telephone, push notification, etc. When it is difficult to inform the subject of personal information one by one, we will publish an announcement in a reasonable and effective way.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52124, "text": "At the same time, we will also report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "We will also report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities."}
{"task": "rw_44.jsonl", "id": 52125, "text": "6. Save, cross -border transmission, deletion, access and management of user personal information", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52126, "text": "6.1. Save and cross -border transmission of user personal information", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52127, "text": "Your personal information will be stored in the territory of the People's Republic of China, except for the following situations:", "label": ["Data Retention", "Important"], "rewrite": "Your personal information will be stored in the territory of the People's Republic of China, except for the following situations:"}
{"task": "rw_44.jsonl", "id": 52128, "text": "6.1.1.1., Laws and regulations have clearly stipulated;", "label": ["Data Retention", "Important"], "rewrite": "If the laws and regulations are also clearly stipulated, personal information will be stored abroad."}
{"task": "rw_44.jsonl", "id": 52129, "text": "6.1.2., Get your clear authorization;", "label": ["Data Retention", "Important"], "rewrite": "If you get your clear authorization, personal information will be stored abroad."}
{"task": "rw_44.jsonl", "id": 52130, "text": "6.1.3., You conduct cross -border transactions such as cross -border transactions through the Internet;", "label": ["Data Retention", "Important"], "rewrite": "If you actively conduct personal active behavior such as cross -border transactions through the Internet, personal information will be stored abroad."}
{"task": "rw_44.jsonl", "id": 52131, "text": "6.1.4., In response to the above circumstances, we will protect your personal information based on this policy and related laws and regulations.", "label": ["Data Retention", "Important"], "rewrite": "In response to the above situations, we will protect your personal information in accordance with this policy and related laws and regulations."}
{"task": "rw_44.jsonl", "id": 52132, "text": "6.2. Interview of user personal information", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52133, "text": "You have the right to access your personal information through the following methods, but the laws and regulations have other provisions, or the policy and the \"Pinduoduo Duoduo Service Agreement\" are also agreed.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52134, "text": "6.2.1., Account Information-If you want to access or edit the personal information and other information in your account, you can log in to the account number and perform such operations through \"Personal Center-My Information\".", "label": ["Important", "Edit/Control"], "rewrite": "If you want to access or edit your personal information and other information in your account, you can log in to the account to perform such operations through \"Personal Center-My Information\"."}
{"task": "rw_44.jsonl", "id": 52135, "text": "6.2.2., Search Information -You can log in to the account to access or clear your search records by \"search\".", "label": ["Edit/Control", "Important"], "rewrite": "You can log in to the account to access or clear your search records through \"Search\"."}
{"task": "rw_44.jsonl", "id": 52136, "text": "6.2.3., Browse information-You can log in to the account to visit or clear your browsing record through \"Personal Center-History Browse\".", "label": ["Important", "Edit/Control"], "rewrite": "You can log in to your account or remove your browsing records through \"Personal Center-History Browse\"."}
{"task": "rw_44.jsonl", "id": 52137, "text": "6.2.4., Order Information: You can log in to the account to access or clear your order records, spelling, records, transaction records, etc. through \"Personal Center-My Order\".", "label": ["Important", "Edit/Control"], "rewrite": "You can log in to the account to access or clear your order records, spelling records, transaction records, etc. through \"Personal Center-My Order\"."}
{"task": "rw_44.jsonl", "id": 52138, "text": "6.2.5. If you cannot access these information through the above path, you can contact us by Pinduoduo customer service.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52139, "text": "For other personal information you generated during our products or services, we will provide you based on the relevant arrangements of \"responding to your above request\" in Article 6.7.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52140, "text": "6.3. Correction and supplement to user personal information", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52141, "text": "When you find that your personal information is wrong or needs to be supplemented, you can submit a correct or supplementary application through \"6.2, access to user personal information\".", "label": ["Important", "Edit/Control"], "rewrite": "When you find that your personal information is wrong or needs to be supplemented, you can make a correct or supplementary application through the \"6.2 User Personal Information Interview\" method."}
{"task": "rw_44.jsonl", "id": 52142, "text": "6.4. Delete of user personal information", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52143, "text": "You can delete some of your personal information in the way \"6.2, access to user personal information\", except for laws and regulations stipulated.", "label": ["Important", "Edit/Control"], "rewrite": "You can delete some of your personal information listed in the method of \"6.2 User Personal Information\", except for laws and regulations."}
{"task": "rw_44.jsonl", "id": 52144, "text": "In the following circumstances, you can make a request to delete personal information:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52145, "text": "1) Our behavior of handling personal information violates laws and regulations;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52146, "text": "2) We collect and use your personal information, but have not obtained your clear consent;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52147, "text": "3) The behavior of our personal information seriously violates your agreement;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52148, "text": "4) You cancel your account and no longer use our products or services;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52149, "text": "5) We will no longer provide you with products or services.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52150, "text": "6.5. Change the scope of your authorization consent or withdraw your authorization", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52151, "text": "You can change your authorization of the scope of personal information by deleting information and closing the device function, or withdraw your authorization.", "label": ["Edit/Control", "Important"], "rewrite": "You can change your authorization of the scope of personal information or withdraw your authorization by deleting information and closing the device function."}
{"task": "rw_44.jsonl", "id": 52152, "text": "You can withdraw the entire collection of your personal information and authorize by canceling the account of the account.", "label": ["Edit/Control", "Important"], "rewrite": "You can withdraw all the authorization of our personal information by canceling the account of the account."}
{"task": "rw_44.jsonl", "id": 52153, "text": "Please understand that each business function requires some basic personal information to complete. When you withdraw your consent or authorization, we cannot continue to provide you with the service corresponding to the withdrawal consent or authorization, and no longer process your personal information.", "label": ["Important", "Edit/Control"], "rewrite": "Each business function requires some basic personal information to complete. When you withdraw consent or authorization, we cannot continue to provide you with the service corresponding to the withdrawal consent or authorization, and no longer process your personal information."}
{"task": "rw_44.jsonl", "id": 52154, "text": "However, your decision to withdraw consent or authorization will not affect the collection, processing, and use of information based on your authorized information.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "The decision you withdraw from consent or authorization will not affect the collection, processing and use of information based on your authorization."}
{"task": "rw_44.jsonl", "id": 52155, "text": "6.6. Logging out the account", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52156, "text": "6.6.1. You can help the center of Pinduoduo's official website-account related-account security and account information- \"How to Log still Pinduoduo Account\" or contact Pinduoduo official customer service through the Pinduoduo client chat windowThe way and the conditions you should meet.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52157, "text": "When you successfully apply for cancellation of Pinduoduo account, we will apply for your application, complete the audit within 48 hours later, and after the review is approved, we will delete or processes your personal information.Essence", "label": ["Edit/Control", "Important"], "rewrite": "When you successfully apply for cancellation of Pinduoduo account, we will complete the review within 48 hours after you submit your application. After the review is passed, we will delete or anonymous processing of your personal information, except for other provisions of laws and regulations."}
{"task": "rw_44.jsonl", "id": 52158, "text": "6.6.2. If we terminate our services or operations, we will notify you at least 30 days in advance, and delete or anonymous processing of your personal information after terminating services or operation.", "label": ["Important", "Cessation of Operations"], "rewrite": "If we terminate our services or operations, we will notify you at least 30 days in advance, and delete or processes your personal information after terminating services or operation."}
{"task": "rw_44.jsonl", "id": 52159, "text": "6.7. In response to your above request", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52160, "text": "To ensure safety, you may need to provide a written request or prove your identity in other ways.", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52161, "text": "We may ask you to verify your identity first, and then process your request.", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52162, "text": "We will respond within 15 working days.", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52163, "text": "If you are not satisfied, you can also launch a complaint through Pinduoduo customer service and report phone calls, 021-61897088.", "label": ["Important", "Contact Information"], "rewrite": "If you are not satisfied, you can also initiate a complaint through Pinduoduo customer service and reporting phone 021-61897088."}
{"task": "rw_44.jsonl", "id": 52164, "text": "For you, reasonable requests, we do not charge fees in principle, but we will charge a certain cost fee depending on the situation for requests that repeat and beyond the reasonable limit.", "label": ["Important", "Risk"], "rewrite": "For your reasonable requests, we do not charge fees in principle, but we will charge a certain cost fee as required for multiple repeated and more reasonable limit."}
{"task": "rw_44.jsonl", "id": 52165, "text": "For those unprocessed, too many technical means (for example, need to develop, new systems may fundamentally change the current practice), bring risks to others' legitimate rights and interests or very unrealistic, please, we may refuse.", "label": ["Important", "Risk"], "rewrite": "We may refuse to reject those who have no repetition, need too much technical means, bring risks or very unrealistic requests to others."}
{"task": "rw_44.jsonl", "id": 52166, "text": "6.8., You understand and agree, in the following situations, in accordance with the requirements of laws and regulations, we will not be able to respond to your request:", "label": ["Important", "Risk"], "rewrite": "In the following circumstances, in accordance with the requirements of laws and regulations, we will not be able to respond to your request:"}
{"task": "rw_44.jsonl", "id": 52167, "text": "1), related to national security and national defense security;", "label": ["Important", "Risk"], "rewrite": "Requesting the request with national security and national defense security cannot be responded."}
{"task": "rw_44.jsonl", "id": 52168, "text": "2), related to public safety, public health, major public interests;", "label": ["Important", "Risk"], "rewrite": "If it is related to public safety, public health, and major public interests, the request cannot be responded."}
{"task": "rw_44.jsonl", "id": 52169, "text": "3), related to criminal investigation, prosecution, trial, and execution judgment;", "label": ["Important", "Risk"], "rewrite": "It cannot be responded to the request that is related to criminal investigation, prosecution, trial, and execution judgment."}
{"task": "rw_44.jsonl", "id": 52170, "text": "4) If there is sufficient evidence that the subject of personal information has subjective malicious or abuse of rights;", "label": ["Important", "Risk"], "rewrite": "If there is sufficient evidence that the subject of personal information has subjective malice or abuse of rights, the request cannot be responded."}
{"task": "rw_44.jsonl", "id": 52171, "text": "5), responding to your request will cause the legitimate rights and interests of you or other individuals and organizations to be seriously damaged;", "label": ["Important", "Risk"], "rewrite": "In response to your request, if the legitimate rights and interests of you or other individuals and organizations are seriously damaged, the request cannot be responded."}
{"task": "rw_44.jsonl", "id": 52172, "text": "6), involved business secrets.", "label": ["Important", "Risk"], "rewrite": "Those who involve business secrets cannot respond to requests."}
{"task": "rw_44.jsonl", "id": 52173, "text": "7. Minor information protection", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52174, "text": "We attach great importance to the protection of personal information of minors. In e -commerce activities, we predecessors you have the corresponding ability of civilian behavior.", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52175, "text": "If you are, minors under the age of 18, below you, please and your guardian to read this policy carefully, and use our services or provide information to us under the premise of obtaining your guardian's consent.", "label": ["Specific Audiences", "Important"], "rewrite": "Minors should use our services or provide information to us under the premise of obtaining the consent of your guardian."}
{"task": "rw_44.jsonl", "id": 52176, "text": "8. Others", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52177, "text": "8.1. Independence of Terms", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52178, "text": "If any part of this policy or any part of this policy or any part of this policy is invalid, illegal or not executive, this invalid, illegal or not affected any other terms or any other terms or any other terms or any other terms orThe effectiveness of any other part of these clauses.", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52179, "text": "8.2. Contact us", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52180, "text": "8.2.1. If you have any questions, opinions or suggestions on this policy or your personal information related matters, please contact us with \"feedback feedback\" in \"setting\" in the personal center \"settings\".", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52181, "text": "8.2.2., We also set up a full -time information protection group. You can contact us by sending emails to privacy@pinduoduo.com.", "label": ["Important", "Contact Information"], "rewrite": "We also set up a full -time personal information protection group, and you can contact us by sending emails to privacy@pinduoduo.com."}
{"task": "rw_44.jsonl", "id": 52182, "text": "Our registered address is: 533 Lou Shanguan Road, Changning District, Shanghai, Room 2902-2913.", "label": ["Important", "Contact Information"], "rewrite": "Our registered address is: Room 2902-2913, 533, Lou Shanguan Road, Changning District, Shanghai."}
{"task": "rw_44.jsonl", "id": 52183, "text": "8.2.3. Generally, we will reply within 15 working days.", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52184, "text": "If you are not satisfied with our response, especially our personal information processing behavior harms your legitimate rights and interests, you can also seek solutions by filed a lawsuit to courts with jurisdictions in the place of residence in the defendant.", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52185, "text": "8.3. Effective date", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52186, "text": "This policy took effect for the first time on August 29, 2017, and the latest revisions came into effect on December 11, 2020", "label": [], "rewrite": []}
{"task": "rw_44.jsonl", "id": 52187, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
