{"task": "rw_40.jsonl", "id": 50613, "text": "Starting point Reading Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50614, "text": "Version update date: October 29, 2021", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50615, "text": "Version Effective Date: October 29, 2021", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50616, "text": "introduction", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50617, "text": "Welcome to read the starting point!", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50618, "text": "\"Starting Point Reading Privacy Policy\" (hereinafter referred to as \"this policy\") is only applicable to the functions and services provided by Shanghai Xuan Ting Entertainment Information Technology Co., Ltd. and its related companies (hereinafter referred to as \"us\" or \"starting point\")Including the starting point reading APP, the website of the starting point Chinese website, the applet, and the new forms that appear with the development of technology (hereinafter referred to as the \"starting point reading\").", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50619, "text": "If a product or service we provides has a separate privacy policy, the privacy policy of the product or service will be preferred;", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50620, "text": "The content that this product or service privacy policy is not covered is based on the content of this policy.", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50621, "text": "Please read it carefully, fully understand the content of each terms, and determine our understanding of our personal information.", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50622, "text": "During the reading process, if you have any questions, you can consult us through the contact information provided in this policy.", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50623, "text": "If you are under the age of 18, please read this policy accompanied by the guardian, especially the terms of personal information on minors, and obtain the consent of your parents or legal guardians in advance.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50624, "text": "If you are the guardian of minors, when you have any questions about the personal information of the minors you monitor, please contact us through customer service.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50625, "text": "Special, if you are under 14 years old, before completing your account registration, please read it carefully", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50626, "text": "\"Starting Points to Reading Child Privacy Policy\".", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50627, "text": "After your guardian agrees to \"Starting Points for Child Privacy Policy\", children under the age of 14 can use the starting point to read.", "label": ["Specific Audiences", "Important"], "rewrite": "Children under 14 years of age can use the starting point after the guardian consent."}
{"task": "rw_40.jsonl", "id": 50628, "text": "about Us", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50629, "text": "(1) The starting point is provided by Shanghai Xuan Ting Entertainment Information Technology Co., Ltd. and its affiliated companies.", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50630, "text": "(2) Related companies refer to companies and institutions under the control of Shanghai Xuanting Entertainment Information Technology Co., Ltd., under the control of Shanghai Xuan Ting Entertainment Information Technology Co., Ltd. or Shanghai Xuan Ting Entertainment Information Technology Co., Ltd.", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50631, "text": "Control refers to the ability to directly or indirectly affected the controlled management/operation of the controlled objects directly or indirectly through ownership, contract, actual operation association, or other methods identified in accordance with the law.", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50632, "text": "(3) The basic information of our main operating entity is as follows: Shanghai Xuanting Entertainment Information Technology Co., Ltd., a company owned by the Reading Group, was established on August 26, 2004. The registered address is Bibo Road, China (Shanghai) Free Trade Zone.Room 101 and Room 201, 690, and 6th Building 6, Bobo Road, China (Shanghai) Free Trade Zone, China (Shanghai) Free Trade Zone.", "label": ["Important", "Contact Information"], "rewrite": "Registration address: Room 101, Room 201, 690, Bobo Road, China (Shanghai) Free Trade Zone, 690, 690, 690, 690; common office address: 69, Bobo Road, China (Shanghai) Free Trade Zone, China (Shanghai) Free Trade Zone"}
{"task": "rw_40.jsonl", "id": 50633, "text": "This privacy policy will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50634, "text": "1. Related word explanation", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50635, "text": "2. How do we collect and use information", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50636, "text": "3. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50637, "text": "4. How do we share, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50638, "text": "5. How to access and control your personal information", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50639, "text": "6. How do we store and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50640, "text": "7. How do we deal with the personal information of minors", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50641, "text": "8. Privacy policy update", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50642, "text": "Nine, how to contact us", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50643, "text": "1. Related word explanation", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50644, "text": "Personal information: refers to the various information that can be recorded alone or with other information with other information with other information or other information that reflects the activity of specific natural persons, including name, birth date, identity document number, personal biometric information, address, address, address, address, address, address, address, address, address, address, address, address, address, address, address, address, address, address, address, address, address, address, address, address, address, address, address, address, address, address, address, address, address, address, address, address, address, address, address, address, address, address, address, address, address, address, address., Communication and communication contact information,", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50645, "text": "Communication records and content, account passwords, property information, credit information, travel trajectory, accommodation information, health and physiological information, transaction information, etc.", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50646, "text": "(From GB/T35273 \"Personal Information Security Specification\")", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50647, "text": "Personal sensitive information: It refers to personal information such as leakage, illegal provision or abuse that may endanger people's body and property, which can easily lead to personal information that causes personal reputation, physical and mental health, or discriminatory treatment.", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50648, "text": "For example, personal sensitive information includes identity documents, personal biometric information, bank accounts, communication content, health and physiological information, etc.", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50649, "text": "Personal sensitive information will make a thickest star in this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50650, "text": "(From GB/T35273-2020", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50651, "text": "\"Information Security Technology Personal Information Security Standards\")", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50652, "text": "Minor: Nature people under eighteen years old are minors.", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50653, "text": "Minors over the age of sixteen, who are the main source of life with their own labor income, are deemed to be full of civil ability.", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50654, "text": "(From the \"People's Republic of China\")", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50655, "text": "Authorization Agree: It means that you have a clear authorization of your personal information, including authorization (that is, explicit consent) through positive behaviors, as well as authorization through negative inaction.", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50656, "text": "(From GB/T35273-2020 \"Information Security Technology", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50657, "text": "Personal Information Security Standards \") Please know that\" authorization consent \"sometimes also expresses\" authorization \"and\" consent \"in this policy.", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50658, "text": "Anonymous: Refers to the process that the subject of personal information cannot be recognized or associated by the technical processing of personal information, and the processing information after processing cannot be restored.", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50659, "text": "(From GB/T 35273-2020 \"Personal Information Security Standards for Information Security Technology\")", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50660, "text": "Delete: Refers to the removal of personal information in a system involved in daily business functions, so that it keeps it from being retrieved and accessed.", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50661, "text": "(From GB/T 35273-2020 \"Personal Information Security Standards for Information Security Technology\")", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50662, "text": "2. How do we collect and use information", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50663, "text": "Because there are many types of products and/or services provided to you, we will collect and use your personal information based on the specific products and/or service scope and different functions, and follow the principles of legal, legitimate and necessary principles.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "According to the specific product and/or service scope and different functions, collect and use your personal information in accordance with the principles of legal, legitimacy and necessary principles."}
{"task": "rw_40.jsonl", "id": 50664, "text": "If we want to use your personal information for other purposes that have not been stated in this privacy policy, or use the information collected for other purposes based on specific purposes, we will inform you in a reasonable way and before use, and before use, and before use, we willGet your consent again.", "label": ["Important", "Data Security", "Usage"], "rewrite": "If your personal information is used to exceed the agreed use, you will inform you in time and obtain your consent again before use."}
{"task": "rw_40.jsonl", "id": 50665, "text": "Below we will tell you one of the personal information types required for each function one by one, and prompt you to be authorized to be authorized when you use specific functional scenarios:", "label": ["First Party Collection Information", "Permission Acquisition"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50666, "text": "2.1 Account Registration, Login", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50667, "text": "(1) Account creation and login", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50668, "text": "Mobile phone number registration/login: We will collect some information that you actively provided by you to identify your real -name identity, including: mobile phone number*, verification code matching result*.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect some of the information that you actively provide or combined with your real -name identity to identify your real -name identity to register/log in for mobile phone numbers."}
{"task": "rw_40.jsonl", "id": 50669, "text": "You should know that the matching result of the mobile phone number*and the verification code*belongs to your personal sensitive information. Only by providing the real and accurate above information can you successfully create and/or log in to the relevant functions provided by the product.", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50670, "text": "If you refuse to provide this feature that you may not be able to use, please consider it carefully before providing.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50671, "text": "When you choose one -click login/registration function, based on our cooperation with communication operators, we will collect your mobile phone number*and mobile phone operator information in order to provide you with a quick login service.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your mobile phone number*and mobile phone operator information in order to provide you with one -click login/registration function."}
{"task": "rw_40.jsonl", "id": 50672, "text": "Third -party login (QQ/WeChat/Apple account): The starting point reading platform currently supports users to use QQ/WeChat/Apple account for login operation. If you log in with the account of a third -party platformThe relevant information under the account (nickname, avatar, region, and gender information, specifically your authorization content), please carefully read the user agreement or privacy policy of the third -party partner service:", "label": ["Important", "First Party Collection Information"], "rewrite": "When registering and logging in with a third -party account, visit and collect your personal information after your authorization."}
{"task": "rw_40.jsonl", "id": 50673, "text": "\"QQ Privacy Protection Guide\"", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50674, "text": "\"WeChat Privacy Protection Guide\"", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50675, "text": "\"Apple Privacy Policy\" (Note: The link address may change, subject to the official information of QQ/WeChat/Apple).", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50676, "text": "We promise that obtaining the above information is used to provide you with account login service and ensure your account security and prevent security risks.", "label": ["Usage", "Data Security"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50677, "text": "If you refuse to authorize such information, you will not be able to log in to our platform with an account on a third -party platform, but it does not affect the normal use of other functions we provides.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50678, "text": "Please note that if you log in with a third -party account, before you use the functions and services that are published, comments, and other real -name authentication, in order to meet the requirements of the online real -name system, we will collect your mobile phone number*to complete the real -name authentication to complete the real -name authenticationEssence", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50679, "text": "Please provide such information after careful consideration. If you refuse to provide it, you may not be able to use the corresponding features.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50680, "text": "Account password login: After you can choose to create an account, create or modify the password in the <Settings-Security Center-Modify Password> Create or modify the password.Log in to your starting point to read account*.", "label": ["Important", "First Party Collection Information", "Edit/Control"], "rewrite": "You can choose to create an account, create or modify the password in the <Settings-Security Center-Modify Password>, and log in with the account password subsequent."}
{"task": "rw_40.jsonl", "id": 50681, "text": "Your password will be automatically storage, transmission, and verification in the form of encryption, and we will not store, transmit, and verify your passwords in a clear text.", "label": ["Important", "Data Security"], "rewrite": "Your password will be automatically stored, transmitted, and verified in the form of encryption."}
{"task": "rw_40.jsonl", "id": 50682, "text": "When you keep, enter, and use your password, you should carefully evaluate the physical and electronic environment to prevent the password from leaking.", "label": ["Important", "Data Security"], "rewrite": "When storage, input, and use your password, the physical environment and electronic environment should be carefully evaluated."}
{"task": "rw_40.jsonl", "id": 50683, "text": "(2) Data maintenance", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50684, "text": "In order to maintain your basic information and improve your service experience, you can choose to fill in perfect personal information, including your avatar, nickname, community profile, reading preference.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "You can choose to fill in perfect personal information and improve the experience."}
{"task": "rw_40.jsonl", "id": 50685, "text": "If you choose not to provide this information, it will not affect your basic service function.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50686, "text": "Among them, when you set/change your avatar, we will ask you to authorize the shooting permissions*or storage permissions (Android system)/album permissions (iOS system)*. If you refuse to provideUse the starting point to read other functions.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "When you set/change your avatar, we ask you to authorize the shooting permissions*or storage permissions (Android system)/album permissions (iOS system)."}
{"task": "rw_40.jsonl", "id": 50687, "text": "2.2 Content display, browsing, downloading, and broadcasting", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50688, "text": "We will provide you with the display, browsing, broadcasting and downloading functions of the service content of electronic readings (books, comics), audio, live broadcasts, games.Accept your necessary device information to allocate your exclusive identifier for you, and record the operating information under your current identity based on this identifier, that is, you can browse, collecting, etc., and save it in the form of log files.The", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Provide you with the display, browsing, playing, and downloading functions of electronic readings (books, comics), audio, live broadcasts, games and other services. It will collect your necessary device information and record your operating information."}
{"task": "rw_40.jsonl", "id": 50689, "text": "(1) Equipment information: Equipment unique identification symbol*(Android: MAC address*, IMEI*, IMSI*, Meid*, AndroidId*, Android advertising ID*, OAID*, hardware serial number*;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50690, "text": "iOS: Device MAC address*, IDFA*, IDFV*, hardware serial number*, hereinafter collectively referred to as \"device unique identifiers*\"), SIM card serial number*, IP address*, device brand and model, operating system and application versions, Network information, device screen information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50691, "text": "In order to collect the above basic personal equipment information, we will apply for access to your device information permissions and obtain relevant information based on your authorization.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50692, "text": "(2) Log information: When you use our products and/or services, we will automatically collect your personal Internet records and save it as a log information, including your operating log*(Browse record*, collection record*, reading, readingRecord*, search record*, click behavior*, download behavior*, like/sharing/review/interactive record*, reading duration*, visit date and time*), service log, development log, and flashback log.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50693, "text": "(3) Software installation list information: In order to check whether the game is installed and help determine whether the desktop has created shortcuts, we will collect your software installation list*information to facilitate creating game shortcuts on the desktop.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect your software installation list*information for easy creating game shortcuts on the desktop."}
{"task": "rw_40.jsonl", "id": 50694, "text": "2.3 Search", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50695, "text": "When you use the search function of the starting point, we will collect the words and collection records you query.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the search function, we will collect the words and collection records you query."}
{"task": "rw_40.jsonl", "id": 50696, "text": "We collect this information to provide you with the content you need and the services that may be more interested in, and at the same time, we can also improve our products and/or services.", "label": ["Important", "First Party Collection Information"], "rewrite": "The collection of search records is to provide you with what you need and the service that may be more interested."}
{"task": "rw_40.jsonl", "id": 50697, "text": "2.4 Information release, communication and interaction", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50698, "text": "When you use services such as communication and interaction in the platform (posting, comments, barrage), praise, sharing and other services, and participating in the submission of the platform (uploading graphics and video), in addition to registering and logging inGraphic/video/audio content, interactive information (including but not limited to posts, comments, barrage, likes, sharing communication and interactive information).", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use services such as communication, likes, sharing, and participation in the platform, you will collect your initiative to provide relevant graphic/video/audio content and interactive information."}
{"task": "rw_40.jsonl", "id": 50699, "text": "To facilitate you to share graphic/video/audio content, after your consent, we will access your storage authority (Android system)/album permissions (iOS system)*.", "label": ["Permission Acquisition", "Important"], "rewrite": "To facilitate you to share graphic/video/audio content, we agree to visit your storage permissions (Android system)/album permissions (iOS system)*."}
{"task": "rw_40.jsonl", "id": 50700, "text": "We will automatically collect your above information and show your nickname, avatar, and published information content.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Automatically collect your communication, information publishing information, and display your nickname, avatar, and published information content."}
{"task": "rw_40.jsonl", "id": 50701, "text": "Please know that the information you posted may include personal information of others. Please obtain legal authorization of others to avoid illegally leaking personal information of others.", "label": ["Important", "First Party Collection Information"], "rewrite": "The information you posted may include personal information of others, please be able to obtain legal authorization of others."}
{"task": "rw_40.jsonl", "id": 50702, "text": "If you do not agree with us to collect the above information, you will not be able to use our information release function, but it will not affect the other products and/or services you provide for you.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50703, "text": "2.5 Buy, query, use virtual property", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50704, "text": "When you recharge the purchase of virtual property in our products and/or services, we need to collect the following or all personal information according to the type of goods or service types, including: user account information*, purchase of items, recharge information (recharge amount*amount*amount*amount*, Recharge the flowing number*, recharge gear*, recharge channel*), use coupon information, equipment unique identifier*, IP address*, we collect this information to help you successfully complete transactions, ensure your transaction security, query, query, queryRecharge records, provide customer service, etc.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you recharge the purchase of virtual property, we need to collect your user account information, purchase items, recharge information, use coupon information, device unique identifier*, IP address*, and IP address*according to the type of goods or service type*."}
{"task": "rw_40.jsonl", "id": 50705, "text": "At the same time, in order to facilitate your inquiry of virtual property and minimize the possible risks, we will show your virtual currency balance in your application in <my account>*, recharge record*, consumption record*, and at the same time use virtual propertyThe scene of the scene shows your virtual currency balance*to facilitate your use (including reading page paid chapters, book details page subscription entrance, role gift, new book chase & beta, work reward, card call and online payment related operation activities)Essence", "label": ["Important", "Usage"], "rewrite": "In <my account>, it shows that you use the virtual currency balance*, recharge record*, consumer record*, and at the same time display your virtual currency balance*in the scene of virtual property*to facilitate your use."}
{"task": "rw_40.jsonl", "id": 50706, "text": "According to the relevant laws and regulations of personal information protection, we will not provide your information to any third party unless you are authorized.", "label": ["Important", "Data Security"], "rewrite": "We will not provide your information to any third party unless you get your authorization."}
{"task": "rw_40.jsonl", "id": 50707, "text": "2.6 Purchase of physical goods", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50708, "text": "When you buy or get physical products in our products and/or services, we need to collect the following or all personal information according to the typeCard address*and its contact number*), product information (transaction goods, product amount), order information*(order time*, order number*, order status*), payment information*(payment method*, payment flow number*number*water number*2. Payment status*), we collect this information to help you successfully complete transactions, ensure your transaction security, query order information, provide customer service, etc.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you buy or get physical products, we need to collect personal information such as the consignee, product information, and order information according to the product or service type."}
{"task": "rw_40.jsonl", "id": 50709, "text": "After you successfully place an order, if the product is provided by a third -party seller or the product needs a third -party distribution, we may share your consignee information*, product information, order information*, payment information*to support our functions to support our functionsSupplier.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "The products you place your order are provided by a third -party seller. We may share your consignee information, product information, order information, and payment information with third parties."}
{"task": "rw_40.jsonl", "id": 50710, "text": "These supports include providing or providing infrastructure technical services for us, logistics distribution services, payment services, after -sales and customer service services.", "label": ["Usage"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50711, "text": "The purpose of our sharing of this information is to achieve the shopping function. For example, we must share the product information in your order with logistics service providers and the consignee information*to arrange delivery;", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "The purpose of sharing information with suppliers is to achieve shopping function."}
{"task": "rw_40.jsonl", "id": 50712, "text": "When the goods or services you place your order are directly shipped or provided by the supplier, we need to share your consignee information*, product information, order information*to the supplier to indicate that they will deliver the goods or provide services;", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "When the goods or services you place your order are directly shipped or provided by the supplier, we need to share your consignee information, product information, and order information to the supplier."}
{"task": "rw_40.jsonl", "id": 50713, "text": "When you apply for after -sales or customer service support, we need to share your consignee information*, product information, order information*, payment information*shared after -sales and customer service support suppliers, thinking that you will solve shopping, refund, return and exchangeProblems encountered.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "When you apply for after -sales or customer service support, we need to share your consignee information, product information, order information, payment information with post -sales and customer service support suppliers."}
{"task": "rw_40.jsonl", "id": 50714, "text": "You can buy physical products for others. You need to provide the aforementioned personal information of the actual consignee and make sure that the consent of the actual consignee has been obtained.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you buy physical products for others, you need to provide the personal information of the actual consignee."}
{"task": "rw_40.jsonl", "id": 50715, "text": "We promise you that we will ensure your personal information security with the greatest efforts, and strictly require partners such as sellers and third -party distribution companies to keep your personal information confidential.use.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will strictly require partners such as sellers and third -party distribution companies to keep your personal information confidential and not be used for other uses."}
{"task": "rw_40.jsonl", "id": 50716, "text": "2.7 Personalized recommendation", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50717, "text": "In order to provide you with more convenient and more compliance with your personalized needs, search and push services, we will be based on your device's unique identifier., Search Record*,", "label": ["Important", "Usage"], "rewrite": "According to your device's unique identification symbols and your reading records, browsing records, collecting records, search records, reading preferences, and extraction of your preferences, you can use it to show you and push messages to you."}
{"task": "rw_40.jsonl", "id": 50718, "text": "Reading preferences (the classification information you actively fills in), extract your preference features to display and push messages to you.", "label": ["Usage"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50719, "text": "You can independently control whether to use personalized recommendation functions in our products, and through the path <My-Settings-Privacy Settings> in \"Starting Points, APP,\" to control whether personalized recommendations and personalized advertising functions are needed.", "label": ["Important", "Edit/Control"], "rewrite": "Path <My-Settings-Privacy Settings> to control whether to open personalized recommendations and personalized advertising functions."}
{"task": "rw_40.jsonl", "id": 50720, "text": "2.8 Identity certification and account recovery", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50721, "text": "(1) Real -name authentication", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50722, "text": "When you use our real -name authentication functions, in order to meet the relevant laws and regulations and regulatory requirements, ensure the authenticity of the user's identity, and realize the needs of anti -fraud and other risk control, ensure the security of the system and service security, or provide servicesIdentity information (including real name*, mobile phone number*, ID card or passport certificate number*, certificate photo*) to complete the real -name authentication.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your real identity information (including real names, mobile phone numbers, ID cards or passport certificates, and certificate photos) to complete the real -name authentication."}
{"task": "rw_40.jsonl", "id": 50723, "text": "You understand and confirm that we will ensure your personal information security with the greatest efforts and strictly keep your personal information confidential, and only learn and use your personal information with the purpose of real -name authentication.", "label": ["Data Security", "First Party Collection Information"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50724, "text": "(2) Student certification", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50725, "text": "In order to provide you with campus -related services, you need to provide \"student certification\". We need to collect your school information, including: school name, type of education, admission year, graduation year, you can choose to provide us with your professional information;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your information in school so that you can provide you with campus -related services."}
{"task": "rw_40.jsonl", "id": 50726, "text": "At the same time, we need to confirm your student identity to complete the student identity authentication. We need to collect your school email address*for rapid verification. If you cannot conduct fast verification, you need to agree with us to collect your student ID photos*For manual verification.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your school email address to quickly complete the student identity authentication. When you cannot perform fast verification, you need to agree to collect your student certificate photos to perform manual verification.piece"}
{"task": "rw_40.jsonl", "id": 50727, "text": "(3) Account retrieved", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50728, "text": "If your account is lost, you can reset the password through mobile phone SMS verification or take the account appeal process.", "label": ["Edit/Control", "Important"], "rewrite": "If your account is lost, you can reset the password through mobile phone SMS verification or take the account appeal process."}
{"task": "rw_40.jsonl", "id": 50729, "text": "But in the process, you need to provide some information to verify your identity.", "label": ["Important", "First Party Collection Information"], "rewrite": "In the account appeal process, you need to provide some information to verify your identity."}
{"task": "rw_40.jsonl", "id": 50730, "text": "When you choose to reset the password for mobile phone SMS verification, you need to provide mobile phone numbers*, verification code matching result*as an account identity verification;", "label": ["Important", "First Party Collection Information"], "rewrite": "When you choose the phone SMS verification method to reset the password, you need to provide the mobile phone number and the verification code matching result as an account authentication."}
{"task": "rw_40.jsonl", "id": 50731, "text": "When you choose to appeal account, the personal information you need to provide include: real name*, ID number/passport number*, mobile phone number*(selected), email address*(selected), account information (service life, registered place of registration, registered place of registrationIn the past year, the recharge is located*, the works that have been seen, the subscribed works), the recharge information (selected: recharge site, recharge channel, recharge time, merchant order number*, screenshot of recharge), more information can be provided for more information.Improve the success rate of account appeal.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you choose to appeal account, you need to provide real names, ID numbers/passport numbers, mobile phone numbers, email address, account information, recharge information."}
{"task": "rw_40.jsonl", "id": 50732, "text": "2.9 Event participation", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50733, "text": "If you participate in the operation and interactive activities of our platform, such as lottery, quiz, answering, questionnaire surveys, you may need to take the initiative to submit relevant information about participating activities.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you participate in the operation and interactive activities of our platform, you may need to take the initiative to submit the relevant information for participating activities."}
{"task": "rw_40.jsonl", "id": 50734, "text": "Including: In order to send you prizes or event gifts, you need to provide the consignee information*(the consignee name*, the receiving address*and its contact number*).", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to send you prizes or event gifts, you need to provide the consignee information."}
{"task": "rw_40.jsonl", "id": 50735, "text": "Regarding how to collect and use your personal information about this type of operation, you can refer to the information collection and use of the information collection and use of the information in the corresponding activity page. We will confirm with you when you submit the information to obtain your consent.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "How to collect and use your personal information will be confirmed to you when you submit the information to obtain your consent."}
{"task": "rw_40.jsonl", "id": 50736, "text": "2.10 message notification", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50737, "text": "The starting point will interact with you through message push, in -site letters, and text messages.", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50738, "text": "Please know and agree that we may send multiple types of notifications through the aforementioned one or more in operation to be used for user messages, authentication, and security verification.", "label": ["Important"], "rewrite": "In operation, multiple types of notifications may be sent in one or more ways for user messages, authentication, and security verification."}
{"task": "rw_40.jsonl", "id": 50739, "text": "You can independently control the receiving mechanism of the message notification in our products. You can control the specific type of notification of receiving message notifications and receiving information in the starting point of reading apps in the starting point.", "label": ["Important", "Edit/Control"], "rewrite": "You can control the specific type of notification of whether the receiving message notification and the receiving message notification through the path <My-Settings-Push Notification Settings>."}
{"task": "rw_40.jsonl", "id": 50740, "text": "In addition, we may also use the mobile phone number collected in the aforementioned process.If you do not want to accept the commercial information, you can be withdrawing through the withdrawal method provided by mobile phone text messages.", "label": ["Edit/Control", "Usage", "Important"], "rewrite": "The collected mobile phone number is used by SMS and telephone to provide you with commercial information that you may be interested in services, functions, or marketing activities, and you can withdraw bips."}
{"task": "rw_40.jsonl", "id": 50741, "text": "2.11 Customer Service, Feedback of Opinions", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50742, "text": "When you consult with the customer service or use the feedback function of the app, for your account and system security, we may need to provide you with account information*and match your previous personal information to verify your user identity.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you consult and feedback, for your account and system security, we will verify the user identity of your account information."}
{"task": "rw_40.jsonl", "id": 50743, "text": "When you use customer service or other users to respond, we may also need to collect your personal sensitive information: contact information (the mobile phone number you use when you contact us*or other contact information you actively provided to us), youCommunication information (including text/picture/audio and video/call records), other necessary information associated with your needs.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use customer service or other users to respond, collect your contact information, communicate information with us, and other necessary information associated with your needs."}
{"task": "rw_40.jsonl", "id": 50744, "text": "We collect this information to investigate the facts and help you solve the problem.", "label": ["Important", "Usage"], "rewrite": "Collecting the information provided when you use customer service or other users to respond to investigating the facts and helping you solve the problem."}
{"task": "rw_40.jsonl", "id": 50745, "text": "2.12 Product safety guarantee function", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50746, "text": "We need to collect some of your information to ensure and evaluate the stable operation of account numbers and system security and system security when using our products and/or services, and assist in improving the security, reliability and stability of our products and/or services, This function may collect your personal information:", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your account information, login information, and equipment information to ensure and evaluate the account and system security when you use our products and/or services."}
{"task": "rw_40.jsonl", "id": 50747, "text": "(1) Account information: Starting point reading account number*, mobile phone number*, email address*, secret insurance question*, real -name authentication information*;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50748, "text": "(2) Login information: login time, IP address*;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50749, "text": "(3) Equipment information: Equipment unique identification symbol*(Android: MAC address*, IMEI*, IMSI*, Meid*, AndroidId*, Android advertising ID*, OAID*;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50750, "text": "iOS: Device MAC address*, IDFA*, IDFV*)*, device brand and model, device hardware information (device sensor information, CPU model and frequency, battery information, kernel version), operating system and application versions;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50751, "text": "(4) Other information: consumption amount*, operation log*.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50752, "text": "We will comprehensively judge your account, account and transaction risk based on the above information, and conduct identity verification, customer service, testing and prevention of security incidents, fraud monitoring, archiving and backup purposes, and take necessary records, audit, analysis, disposal measures in accordance with the lawOnce we detect or suspected account security risks, we will use relevant information to perform security verification and risk exclusion to ensure the security of the products and/or services we provide to you to ensure that your rights and interests are not subject to being unwilling.Instead.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We will comprehensively judge your account, account and transaction risk based on the collected information, and take necessary records, audit, analysis, and disposal measures in accordance with the law."}
{"task": "rw_40.jsonl", "id": 50753, "text": "At the same time, when account or system security issues occur, we will collect this information to optimize our products and/or services.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When account or system security issues occur, we collect information to optimize our products and/or services."}
{"task": "rw_40.jsonl", "id": 50754, "text": "2.13 Extension function provided by the calling device permissions", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50755, "text": "In order to enhance your reading experience at the starting point, our following expansion functions will involve the authority of calling the device, and may collect and use your personal information.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "The expansion function will involve the authority of the calling device, which may be collected and used by your personal information."}
{"task": "rw_40.jsonl", "id": 50756, "text": "If you do not provide these personal information, you can still use basic functions, but you may not be able to enjoy the fun brought by the corresponding expansion function.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50757, "text": "Equipment permissions and its corresponding extensions involved include:", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50758, "text": "(1), shooting permissions*(Camera): When you use upload/update account avatar, sweep, graphic/video production and release, comment (with pictures/video content) and other business functions, we will need to obtain youCamera permissions*and collect the pictures and video content information you provide.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "When you use upload/update account avatars, sweeping, graphic/video production and publishing, comments (with pictures/video content) and other business functions, we will obtain your camera permissions and collect the pictures and videos you provideContent information."}
{"task": "rw_40.jsonl", "id": 50759, "text": "If you refuse to provide this permissions, it may cause you to be unable to use the extension function related to camera permissions, but it does not affect your other functions.", "label": ["First Party Collection Information", "Permission Acquisition"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50760, "text": "(2), device microphone permission*(record_audio): When you use the character dubbing function and sentence dubbing function, we will need to obtain your device microphone permission and collect the voice content information you recorded.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the character dubbing function and the sentence dubbing function, we will obtain your device microphone permission and collect the voice content information you recorded."}
{"task": "rw_40.jsonl", "id": 50761, "text": "If you refuse to provide this permissions, it may cause you to be unable to use extensions related to microphones, but it does not affect your other functions.", "label": ["First Party Collection Information", "Permission Acquisition"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50762, "text": "(3), telephone status authority*(read_phone_state- Only Android): When you first start the starting point of the reading app (system below Android10), we will apply for you to obtain phone status permissions., In order to complete safety risk control, statistical and service push;", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "When you start the starting point for the first time, we will apply for you to obtain phone status permissions in order to complete security risk control, statistical and service push."}
{"task": "rw_40.jsonl", "id": 50763, "text": "At the same time, it is also to avoid interrupting your recording or live broadcast process, so that we can detect your call status.", "label": ["Important", "Usage"], "rewrite": "Get the phone status permissions to avoid interrupting your recording or live broadcast process and facilitate us to detect your call status."}
{"task": "rw_40.jsonl", "id": 50764, "text": "If you refuse to provide this permissions, it may cause you to be unable to use related extensions, but it does not affect your other functions.", "label": ["First Party Collection Information", "Permission Acquisition"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50765, "text": "(4) Read and/or write to read external memory permissions*(Read_external_Storage, Write_external_Storage-Only Android): When you use the function of depositing the book data into the SD card, or using the book data in the SDYou need to obtain your read/write external memory permissions, and read/write file information.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the function of depositing the book data into the SD card, or using the book data in the SD, you need to obtain your read/write to the external memory permissions, and read/write the file information."}
{"task": "rw_40.jsonl", "id": 50766, "text": "When you open the starting point, if the game you downloaded in the game center has not been downloaded, we will automatically continue to download for you, and we need to use the SD card to write/delete the internal storage permissions;", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "When you open the starting point, if the game downloaded before is not completed, we will automatically continue to download for you. You need to use the SD card to write/delete the internal storage permissions."}
{"task": "rw_40.jsonl", "id": 50767, "text": "You can go to the game center to suspend or delete the downloaded games that are being downloaded. This service is only provided under WIFI or other free networks.", "label": ["Important", "Edit/Control"], "rewrite": "You can go to the game center to suspend or delete the downloaded game."}
{"task": "rw_40.jsonl", "id": 50768, "text": "If you refuse to provide this permissions, it may cause you to be unable to use related extensions, but it does not affect your other functions.", "label": ["First Party Collection Information", "Permission Acquisition"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50769, "text": "(5) Add/use album permissions*(Photo-only iOS side): When you use upload/update account avatars, sweep, graphic/video production and release, comment (with pictures/video content) and other business functions such asWhen selecting upload/saving to album photos, we will need to obtain your album authority and collect the pictures and video content information you provide.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "When you use upload/update account avatars, sweeping, graphic/video production and release, review and other business functions, when selecting upload/saving to album photos, we will need to obtain your album permissions and collect pictures you provide., Video content information."}
{"task": "rw_40.jsonl", "id": 50770, "text": "If you refuse to provide this permissions, it may cause you to be unable to use related extensions, but it does not affect your other functions.", "label": ["First Party Collection Information", "Permission Acquisition"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50771, "text": "(6) Network permissions (LOCAL", "label": ["Usage", "First Party Collection Information", "Permission Acquisition"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50772, "text": "Network-alone): Since IOS supports users to choose whether to use cellular networks or WIFI, and the network permissions will not be able to use any network products and functions, so we can provide you with products and services and platform content reading and reading and reading and platform content reading and platform content.Update, you need to obtain your network permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "You need to obtain your network permissions to provide you with products and services and platform content reading and update."}
{"task": "rw_40.jsonl", "id": 50773, "text": "If you refuse to provide this permissions, it may cause you to be unable to use related extensions, but it does not affect your other functions.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50774, "text": "(7), advertising tracking authority*(Tracking-only iOS side): When you use the iOS system to start the starting point for the first time, we will apply for youPick up targeted advertisements, monitor operations performed for advertising or share your information with data agents.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the iOS system to start the reading app for the first time, we will apply for you to obtain advertising tracking permissions in order to place targeted advertising."}
{"task": "rw_40.jsonl", "id": 50775, "text": "If you refuse to provide this permissions, it may cause you to be unable to use related extensions, but it does not affect your other functions.", "label": ["First Party Collection Information", "Permission Acquisition"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50776, "text": "(8), ClipboardManager: When you copy text information, title, SMS verification code, share or receive shared information, your shear plate function may be called.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "When you copy the text information, title, SMS verification code, share or receive the shared information, you may call your scissors permissions."}
{"task": "rw_40.jsonl", "id": 50777, "text": "The shear information will only be processed on your device, and we will not store your shear information for any other way.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will not store your shear information for any other way."}
{"task": "rw_40.jsonl", "id": 50778, "text": "If you refuse to provide this permissions, it may cause you to be unable to use related extensions, but it does not affect your other functions.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50779, "text": "(9), Get_Tasks- Only Android): When you use listening books, push services, advertising services, abnormal feedback functions, you need to obtain the current or recent operation tasks.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use listening, push services, advertising services, and abnormal feedback functions, you need to obtain the current or recent tasks."}
{"task": "rw_40.jsonl", "id": 50780, "text": "The above extension function may require you to turn on your shooting permissions to us in your device*, device microphone rights*, telephone status permissions*, external memory permissions*, album permissions*, network permissions, advertising tracking authority*, shear, cuttingPlate authority*and task information permissions to achieve information collection and use involved in these functions.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "You need to obtain your shooting permissions, equipment microphone permissions, telephone status permissions, external memory permissions, album permissions, network permissions, advertising tracking permissions, shear permissions, task information permissions to achieve information collection and use."}
{"task": "rw_40.jsonl", "id": 50781, "text": "You can check and open/close the state of the above permissions in the starting point of reading APP or device system.", "label": ["Edit/Control", "Important"], "rewrite": "You can check and open/close the state of the above permissions in the starting point of reading APP or device system."}
{"task": "rw_40.jsonl", "id": 50782, "text": "Please note that when you turn on these permissions, it means that you authorize us to collect and use these personal information to achieve the above functions. If you close the authority, it means that you have canceled these authorization. We will not continue to collect and use your personal informationIt is also impossible to provide you with the above functions corresponding to these authorization.", "label": ["Permission Acquisition", "Important", "Edit/Control"], "rewrite": "The opening of one authority means that the authorization is authorized to collect and use the relevant information to provide corresponding services. Close the authority to cancel the authorization representative, and no longer continue to collect and use relevant information based on the corresponding permissions."}
{"task": "rw_40.jsonl", "id": 50783, "text": "If you refuse to provide it, it will only make you unable to use this function, but it does not affect other functions of your normal use of products and/or services.", "label": ["First Party Collection Information", "Permission Acquisition"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50784, "text": "Please understand and know that according to relevant laws and regulations and national standards, in the following circumstances, we will collect and use your personal information without asking for your consent:", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "According to relevant laws and regulations and national standards, in the following circumstances, we will collect and use your personal information without asking for your consent:"}
{"task": "rw_40.jsonl", "id": 50785, "text": "(1) Directly related to national interests such as national security and national defense security;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The collection and use information directly related to national security and national defense security does not need to solicit authorization consent."}
{"task": "rw_40.jsonl", "id": 50786, "text": "(2) Directly related to major public interests such as public safety, public health, public knowledge;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect information directly related to public safety, public health, and public interest, and no need to solicit authorization."}
{"task": "rw_40.jsonl", "id": 50787, "text": "(3) Directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Direct related collection and use information such as criminal investigation, prosecution, trial, and execution of judgments does not need to solicit authorization consent."}
{"task": "rw_40.jsonl", "id": 50788, "text": "(4) Performing our statutory duties or the need for the statutory voluntary office;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We do not need to solicit authorization consent for the collection and use information necessary for us to fulfill our statutory duties or collect information necessary for the law."}
{"task": "rw_40.jsonl", "id": 50789, "text": "(5) In order to deal with emergencies, or in emergency situations, it is necessary to protect the health and property safety of natural people;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to cope with emergencies, or in urgent cases to protect the life and health of natural persons and the necessary collection and use information, no need to solicit authorization."}
{"task": "rw_40.jsonl", "id": 50790, "text": "(6) Treatment your personal information that you disclose your own or other legal disclosure within a reasonable range;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In accordance with laws and regulations, personal information is processed by individuals or other legal disclosure within a reasonable range, and no authorization consent is required."}
{"task": "rw_40.jsonl", "id": 50791, "text": "(7) It is necessary for the contract to establish or fulfill your contract as one party;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to set up and fulfill your collection and use information for the contract as a party, no need to solicit authorization."}
{"task": "rw_40.jsonl", "id": 50792, "text": "(8) Implement news reports for public interests, public opinion supervision and other behaviors to deal with your personal information within a reasonable range;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to implement news reports and public opinion supervision, deal with personal information within a reasonable scope without soliciting authorization consent."}
{"task": "rw_40.jsonl", "id": 50793, "text": "(9) Other circumstances stipulated in laws and regulations.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Other collection and use information stipulated in laws and regulations does not need to solicit authorization."}
{"task": "rw_40.jsonl", "id": 50794, "text": "Please understand that the functions and services we provide to you are constantly updated and developed. If a function or service may not be collected in the aforementioned instructions and may collect your personal information, we will pass the above function or service.Page prompts, interaction processes, website announcement, etc. to explain the content, scope and purpose of information collection to you to obtain your consent.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "If a function or service exceeds the scope of the instructions, we will explain to you the situation of information collection to obtain your consent."}
{"task": "rw_40.jsonl", "id": 50795, "text": "3. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50796, "text": "When you use our products and/or services, we may collect your information by putting safe cookies and related technologies, including: your login information*, browsing information*, preference settings.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use our products and/or services, you may collect your information through safe cookies and related technologies."}
{"task": "rw_40.jsonl", "id": 50797, "text": "Cookie and similar technologies collect this kind of information for your need to use our products and/or services, simplify your repeated operation steps (such as registration, login), facilitate your viewing history (such as reading, searching history), to youProvide the content that is more interested in your personal needs and the content you may be more interested in, protect your information and account security, and improve our products and services.", "label": ["Important", "Usage"], "rewrite": "Cookie and similar technologies collect information to simplify the use of use, to see the use of history, and provide you with the service content that meets your personal needs."}
{"task": "rw_40.jsonl", "id": 50798, "text": "We promise that we will not use Cookie and similar technologies for any purpose outside of the purpose of this privacy policy.", "label": ["Important", "Data Security"], "rewrite": "We will not use Cookie with similar technologies for any purpose outside of the purpose of this privacy policy."}
{"task": "rw_40.jsonl", "id": 50799, "text": "You can manage or delete Cookie according to your preferences.", "label": ["Important", "Edit/Control"], "rewrite": "You can manage or delete Cookie according to your preferences."}
{"task": "rw_40.jsonl", "id": 50800, "text": "You can clear all the cookies saved on the computer or mobile device, you have the right to accept or reject cookies, and you can also manage cookies through the browser.", "label": ["Edit/Control", "Important"], "rewrite": "You can clear all the cookies saved on the computer or mobile device."}
{"task": "rw_40.jsonl", "id": 50801, "text": "You understand and know: Some of our products/services can only be implemented by using Cookie or similar technologies. If you refuse to use or delete, you may not be able to use our related products and/or services or unable to pass the service normally or cannot pass through the service or cannot pass the service.Our products and/or services get the best service experience.", "label": ["Edit/Control", "Important"], "rewrite": "If you refuse to use or delete Cookie or similar technologies, you may not be able to use related products and/or services normally or get the best service experience."}
{"task": "rw_40.jsonl", "id": 50802, "text": "Cookie", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50803, "text": "It is very important for improving the user's network experience. We generally use Cookie for the following goals:", "label": ["Usage"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50804, "text": "(1) Optimize the login experience:, Cookie can register and log in, to store account information, help you fill in the account name you finally logged in, simplify your repeated operation steps;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Cookie can help you fill in your last login account name when you register and log in and simplify your repeated operation steps."}
{"task": "rw_40.jsonl", "id": 50805, "text": "(2) Safety: Cookie can help us ensure the security of data and services, and check cheating, hacking, fraud at our products and/or services;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Cookie helps us guarantee the security of data and services."}
{"task": "rw_40.jsonl", "id": 50806, "text": "(3) Preference settings: Use cookies and similar technologies to preserve users' simple personalized settings.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Use cookies and similar technologies to preserve users' simple personalized settings."}
{"task": "rw_40.jsonl", "id": 50807, "text": "4. How do we share, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50808, "text": "4.1 Sharing of information", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50809, "text": "We attach great importance to protecting your personal information.", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50810, "text": "Without your authorization consent, we will not share your personal information with any company, organization and individual, unless there is the following or more situations:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Without your authorization consent, we will not share your personal information with any company, organization and individual, unless there is the following or more situations:"}
{"task": "rw_40.jsonl", "id": 50811, "text": "4.1.1, sharing if you get your clear consent or authorization or your active choice", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share your personal information with your clear consent or authorization or your active choice."}
{"task": "rw_40.jsonl", "id": 50812, "text": "Special reminder, the personal information you actively disclosed during the reading process of the starting point (including the posts, comments, barrage published by you participating in the communication and interaction published in the platform, and the graphic, audio, video of the submission in your submission in the platform)Reading, collecting and using any third party may synchronize to our related products QQ reading, mobile QQ penguin reading, QQ browser, Xiaoxiang Academy, and can be copied and stored independently by third parties that have no relationship with us.Essence", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "The personal information you actively disclosed during the use point of the starting point can be read, collected and used by any third party, and may be synchronized to related products."}
{"task": "rw_40.jsonl", "id": 50813, "text": "Please note that your active personal information may include sensitive information such as your personal identity information and personal property information.", "label": ["Third Party Sharing/ Disclosure", "Risk"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50814, "text": "Please consider disclosing your relevant personal sensitive information.", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50815, "text": "You may include the personal information of others in your active information. Please obtain the legal authorization of others to avoid illegally leaking the personal information of others.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You may include the personal information of others in your active information, please be able to obtain the legal authorization of others."}
{"task": "rw_40.jsonl", "id": 50816, "text": "You can control the scope of your sharing information. You can also contact us through the path settings in the service or the guidelines we provide to delete the information you shared publicly.", "label": ["Edit/Control", "Important"], "rewrite": "You can control the scope of your sharing information. You can also contact us through the path settings in the service or the guidelines we provide to delete the information you shared publicly."}
{"task": "rw_40.jsonl", "id": 50817, "text": "But please note that this information may still be stored independently by other users or non -associated third parties that are not controlled by us.", "label": ["Important", "Edit/Control"], "rewrite": "The information you take the initiative may be independently preserved by other users or non -associated third parties that are not controlled by us."}
{"task": "rw_40.jsonl", "id": 50818, "text": "4.1.2 Sharing in statutory situations", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50819, "text": "We may share your personal information to the outside world in accordance with the requirements of laws and regulations, litigation disputes, or in accordance with the requirements of administrative and judicial organs in accordance with law.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share your personal information to the outside world in accordance with the requirements of laws and regulations, litigation disputes, or in accordance with the requirements of administrative and judicial organs in accordance with law."}
{"task": "rw_40.jsonl", "id": 50820, "text": "4.1.3 Share your personal information with related companies", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50821, "text": "In order to facilitate us to provide you with a service based on related accounts (you can use the starting point account information, you can log in on the read -related account platform without registering again, including QQ reading, red sleeve reading, writer assistant), recommended you may be interested inInformation or protection of personal property of our affiliated companies or other users or the public is exempted from infringement, and your personal information may be shared with our affiliated companies.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Your personal information may be shared with our affiliates, so that you can provide you with services and personalized recommendations to you based on related accounts to protect the property of all parties from infringing."}
{"task": "rw_40.jsonl", "id": 50822, "text": "We will only share the necessary personal information and be subject to the purpose of the purpose of this policy. The affiliated company will also take the same security measures according to this policy to ensure your personal information security;", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Only sharing the necessary personal information with related companies and restricted by the purpose declared in this policy will ensure your personal information security in accordance with this policy."}
{"task": "rw_40.jsonl", "id": 50823, "text": "If related companies want to change the purpose of personal information, they will solicit your authorization consent again.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "If related companies want to change the purpose of personal information, they will solicit your authorization consent again."}
{"task": "rw_40.jsonl", "id": 50824, "text": "4.1.4 The sharing that must be performed for our products and/or services", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50825, "text": "Please know and agree that in some cases, to provide you with our services or the business function of our products and/or services, or based on reasonable business habits, we must share your personal information with a third party to achieveOur products and/or service core functions or services you need.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "To achieve products and/or services, we will share your personal information with third parties."}
{"task": "rw_40.jsonl", "id": 50826, "text": "We will only share your personal information for legal, correct, necessary, specific, and clear purposes, and only share the personal information necessary for providing services.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "It will only share personal information for legal, correct, necessary, specific, and clear purposes, and only share personal information necessary for providing services."}
{"task": "rw_40.jsonl", "id": 50827, "text": "At the same time, we will sign a strict confidentiality agreement with our partners, asking them to handle your personal information in accordance with our instructions, privacy policies, and any other related confidentiality and security measures.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will sign the confidentiality agreement with the partner to process your personal information in accordance with our instructions, this privacy policy, and any other related confidentiality and security measures."}
{"task": "rw_40.jsonl", "id": 50828, "text": "Our partners have no right to use the personal information they shared for any other purpose.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Our partners have no right to use the personal information they shared for any other purpose."}
{"task": "rw_40.jsonl", "id": 50829, "text": "Usually the third -party and scenes we shared include: the win/winner information in joint marketing activities with third parties, so that they can distribute prizes/gifts to you in time;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share the winning/winner information in joint marketing activities with third parties so that they can distribute prizes/gifts to you in time."}
{"task": "rw_40.jsonl", "id": 50830, "text": "Share the personal information necessary for the agencies that conduct due diligence or audit to achieve the purpose of survey or audit, so that we can successfully accept due diligence or audit.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share the personal information necessary for the agencies that conduct due diligence or audit to achieve the purpose of investigation or audit, so as to successfully receive due diligence or audit."}
{"task": "rw_40.jsonl", "id": 50831, "text": "4.1.5 It is necessary to share with authorized business partners", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50832, "text": "Please understand and agree. In order to smoothly develop the necessary/reasonable business and meet your requirements, our products may include third -party SDK or other similar applications to share some of your information from some business partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Our products may contain third -party SDKs or other similar applications to share some of your information from some business partners."}
{"task": "rw_40.jsonl", "id": 50833, "text": "We will evaluate the data security capacity and data sharing risk of authorized partners before data sharing, and will restrict the information required for the performance of their duties through the agreement.Any purpose.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We will conduct risk assessment of the partners before the data sharing and restrict it through the agreement."}
{"task": "rw_40.jsonl", "id": 50834, "text": "If you use your personal information that exceeds or changes the sharing, we will ask it to follow your clear consent.", "label": ["Important", "Data Security"], "rewrite": "If the partner is beyond or changing your personal information of sharing, we will ask it to follow your clear consent."}
{"task": "rw_40.jsonl", "id": 50835, "text": "At present, our authorized partners include the following types:", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50836, "text": "(1) Provide service providers for our products and/or services.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50837, "text": "Including payment institutions that provide payment services (Ali Payment, PayPal Pay, QQ Wallet), operators who provide one -click login service (China Telecom, Mobile, Unicom), third -party login method providers (QQ, WeChat, Apple), goodsWith order management provider (Zanzan), BUG/collapse statistics provider (Tencent Bugly), and other service providers.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50838, "text": "The purpose of our sharing information is to achieve the function of our products and/or services, so that you can use it normally;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We sharing information with products and/or service providers can realize the functions of our products and/or services."}
{"task": "rw_40.jsonl", "id": 50839, "text": "(2) Partners who provide data services (including online advertising monitoring, data statistics, and data analysis).", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50840, "text": "In order to maintain and improve our products and/or/services to provide you with better content, at the same time, it is convenient for us to be based on the advertising touch rate and effectiveness statistics and billing. We may access the designated partner of the service (Broad -point, You can win, quest", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We may access designated partners providing data services in order to facilitate our statistics and billing based on advertising -based touch rates and effectiveness."}
{"task": "rw_40.jsonl", "id": 50841, "text": "Mobile, Tencent Lighthouse), to analyze your service situation and optimize advertising.", "label": ["Usage", "Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50842, "text": "The aforementioned service providers collect and handle information such as information such as their own privacy clauses, not applicable to this policy.", "label": ["Important"], "rewrite": "Services that provide data services to collect and process information to comply with their own privacy clauses, not applicable to this policy."}
{"task": "rw_40.jsonl", "id": 50843, "text": "However, we will also strive to review the business access qualifications of the third party and strive to require the legal compliance and security of the service provider.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will also review the business access qualifications of third -party and strive to require the legal compliance and security of the service provider."}
{"task": "rw_40.jsonl", "id": 50844, "text": "Please rest assured that when we will be able to contact or identify your identity personal information to share with the authorized partners, we will ensure your information security to the greatest extent.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "When we share your personal information that can contact or recognize your identity, we will guarantee your information security to the greatest extent."}
{"task": "rw_40.jsonl", "id": 50845, "text": "In addition, we strongly recommend that you check your privacy clauses before using any third -party SDK service. Please refer to the SDK's specific information collection and usage.", "label": ["Important"], "rewrite": "DK's specific information collection and usage are based on the privacy policy or related statement of the SDK operator."}
{"task": "rw_40.jsonl", "id": 50846, "text": "To protect your legitimate rights and interests, when you find that there are risks of such SDK or other similar applications, it is recommended that you immediately terminate related operations and contact us in time.", "label": ["Important", "Data Security"], "rewrite": "When you find that SDK or similar programs have risks, it is recommended that you immediately terminate the relevant operations and contact us."}
{"task": "rw_40.jsonl", "id": 50847, "text": "For the current starting point, the SDK and its corresponding privacy policy website involved in personal information transmission is different.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For the SDK and its corresponding privacy policy website involved in personal information transmission, please refer to the \"SDK Condition Form involved in personal information transmission\"."}
{"task": "rw_40.jsonl", "id": 50848, "text": "4.2 Transfer of information", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50849, "text": "Transfer refers to the process of transferring personal information control to other companies, organizations or individuals.", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50850, "text": "In principle, we will not transfer your personal information, except the following situations:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In principle, we will not transfer your personal information, except the following situations:"}
{"task": "rw_40.jsonl", "id": 50851, "text": "(1), you make a request yourself;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you make your own request, you may transfer your personal information."}
{"task": "rw_40.jsonl", "id": 50852, "text": "(2), you have obtained your clear authorization consent in advance;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Those who have obtained your clear authorization in advance may transfer your personal information."}
{"task": "rw_40.jsonl", "id": 50853, "text": "3", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50854, "text": "If we do mergers, acquisitions, reorganization, separation, bankruptcy, asset transfer or similar transactions, and your personal information may be transferred as part of such transactions, we will ask new holders to continue and fulfill the privacyAll the contents of the policy (including the purpose of the use, the rules of use, the security measures, etc.), otherwise we will ask it to re -obtain your explicit authorization consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When involving mergers, acquisitions, or bankruptcy liquidation, if personal information transfer is involved, it will be required to continue to be bound by the policy, otherwise it will request that it will re -solicit authorization consent."}
{"task": "rw_40.jsonl", "id": 50855, "text": "(4) Other circumstances stipulated in laws and regulations.", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50856, "text": "If you have the above reasons, you will indeed be transferred, and we will tell you the purpose and type of the transfer of information to you by pushing notifications and announcement before the transfer (if you involve your personal sensitive information, we will also inform you that the sensitive information involved isThe content), and inform the receiver's name or name and contact information, and then transfer it after obtaining your authorization consent, except for the laws and regulations or other provisions of this policy.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will inform you the purpose and type of the transfer information by pushing notifications and announcement before the transfer, and inform the receiver's name or name and contact information to obtain your authorization consent.Except for another agreement."}
{"task": "rw_40.jsonl", "id": 50857, "text": "4.3 Public disclosure of information", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50858, "text": "Public disclosure refers to the act of publishing information to society or unspecified people.", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50859, "text": "In addition to the necessary disclosure of the necessary issues such as desensitization of illegal accounts and fraudulent behaviors, etc., when the winning/winner, etc. need to be made.If it is authorized by law or the reasons to be disclosed publicly, we will tell you the purpose and type of the information disclosed publicly before public disclosure (if you involve your personal sensitive information, we will also tell you the sensitivity involved in youThe content of information), and disclosed it publicly after obtaining your consent, except for the laws and regulations or other agreed in this policy.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In addition to the necessary matters such as punishment announcement and announcement of winning prizes, we will not disclose your personal information publicly. If you really need to disclose it publicly, we will inform you in advance the purpose and type of disclosure.Except for other provisions or this policy."}
{"task": "rw_40.jsonl", "id": 50860, "text": "In accordance with the requirements of laws and regulations, mandatory administrative law enforcement or judicial requirements that must provide your personal information, we may disclose your personal information according to the types and disclosure methods required.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In accordance with the requirements of laws and regulations, mandatory administrative law enforcement or judicial requirements that must provide your personal information, we may publicly disclose your personal information."}
{"task": "rw_40.jsonl", "id": 50861, "text": "Under the premise of compliance with laws and regulations, when we receive the above -mentioned disclosure requests and carefully examine their legitimacy, rationality, and legitimacy, we will require corresponding legal documents, such as tickets or investigationsletter.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will carefully review the legitimacy, rationality, and legality of the request to disclose information, and require the applicant to issue corresponding legal documents."}
{"task": "rw_40.jsonl", "id": 50862, "text": "We firmly believe that for the information requested by us, it should be as transparent as much as possible within the scope of law.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For information required by us, it should be as transparent as much as possible within the scope allowed by law."}
{"task": "rw_40.jsonl", "id": 50863, "text": "We have carefully reviewed all the requests to ensure that it has a legal basis and is limited to data obtained by law enforcement agencies because of specific investigations and legitimate rights.", "label": ["Important", "Data Security"], "rewrite": "We conducted a cautious review of the requests disclosed in public, and were limited to data obtained by law enforcement agencies because of the purpose of specific investigations and had legal rights."}
{"task": "rw_40.jsonl", "id": 50864, "text": "Under the premise of laws and regulations, the documents we have disclosed are under the protection of the encryption key.", "label": ["Important", "Data Security"], "rewrite": "The documents we disclosed are under the protection of the encryption key."}
{"task": "rw_40.jsonl", "id": 50865, "text": "4.4 Exception", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50866, "text": "Without your consent, the starting point will not share, transfer, and openly disclose your personal information to any company, organization and individual other than the starting point, except the following situations: except:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Without your consent, the starting point will not share, transfer, and openly disclose your personal information to any company, organization and individual other than the starting point, except the following situations: except:"}
{"task": "rw_40.jsonl", "id": 50867, "text": "(1), related to the obligations stipulated by our performance and regulations;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Sharing or disclosure related to the obligations stipulated in our laws and regulations does not need to be authorized."}
{"task": "rw_40.jsonl", "id": 50868, "text": "(2), directly related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The sharing or disclosure directly related to national security and national defense security does not require authorization."}
{"task": "rw_40.jsonl", "id": 50869, "text": "(3) directly related to public safety, public health, and major public interests;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Sharing or disclosure directly related to public safety, public health and major public interests does not need to be authorized."}
{"task": "rw_40.jsonl", "id": 50870, "text": "(4) Directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Sharing or disclosure related to criminal investigation, prosecution, trial, and judgment execution does not need to be authorized."}
{"task": "rw_40.jsonl", "id": 50871, "text": "Or, in accordance with the requirements of laws and regulations, administrative organs or public prosecution laws, etc., the requirements of the authority;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50872, "text": "(5) For the maintenance of major legitimate rights and interests such as the life and property of you or other individuals, it is difficult to get your consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Out of the major legitimate rights and interests of the life and property of the subject of personal information or other individuals, it is difficult to get shared or disclosed by my consent, and there is no need to solicit."}
{"task": "rw_40.jsonl", "id": 50873, "text": "(6) Personal information is collected by your own public information or from the channels we disclosed in legal publicly (such as legal news reports, government information disclosure and other channels);", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The collected personal information is the sharing or disclosure of the subject of the personal information to the public by themselves without authorization."}
{"task": "rw_40.jsonl", "id": 50874, "text": "(7) What is necessary to sign and perform related agreements or other written documents with you;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "According to the sharing, transfer or disclosure necessary for signing and fulfilling related agreements or other written documents, no authorization is required."}
{"task": "rw_40.jsonl", "id": 50875, "text": "(8) Other situations stipulated in laws and regulations.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Other provisions of laws and regulations do not need to solicit authorization."}
{"task": "rw_40.jsonl", "id": 50876, "text": "5. How to access and control your personal information", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50877, "text": "You have the right to access and control your personal information in our products and/or services, including: you can access, copy, correct/modify, delete your personal information, or withdraw your personal information you made beforeAgree, you can also cancel your account.", "label": ["Edit/Control", "Important"], "rewrite": "You can access, copy, correct/modify, delete your personal information, or withdraw your previous consent of your personal information, and you can also cancel your account."}
{"task": "rw_40.jsonl", "id": 50878, "text": "In order to facilitate your above -mentioned access and control, we provide you with operational guidelines and operation settings on the related functional page of the product. You can operate yourself. If you have doubts or difficulties during the operation processContact us to control, and we will deal with you in time.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50879, "text": "5.1 Visit your personal information", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50880, "text": "You can query or access your relevant personal information in our products and/or services, including:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50881, "text": "(1) Account Information: You can log in to your personal account, and the personal information information in the account visited by <My Personal Home> includes: avatar, nickname, community profile;", "label": ["Important", "Edit/Control"], "rewrite": "You can log in to your personal account and pass the personal data information in the account visited by <My Homepage>."}
{"task": "rw_40.jsonl", "id": 50882, "text": "(2) Use information: You can check your browsing records, collection records, and search records at any time through the bookshelf page, search page, and my page;", "label": ["Important", "Edit/Control"], "rewrite": "You can check your browsing records, collection records, and search records at any time through the bookshelf page, search page, and my page."}
{"task": "rw_40.jsonl", "id": 50883, "text": "(3) Trading consumption information*: You can view your transaction records by accessing <Mine-account balance>*and consumer record*;", "label": ["Important", "Edit/Control"], "rewrite": "You can check your transaction records and consumption records by visiting <My-Account balance>."}
{"task": "rw_40.jsonl", "id": 50884, "text": "(4) Other information: If you encounter operating problems in the process of accessing this or you need to get other personal information content that you cannot know, you can contact us through the method provided by the end of the text. We will be in your identityProvided to you within the reasonable period, but laws and regulations have other provisions or except for this policy.", "label": ["Important", "Edit/Control"], "rewrite": "If you encounter operating problems or you need to obtain other personal information content that can be known above, you can contact us."}
{"task": "rw_40.jsonl", "id": 50885, "text": "5.2 Copy your personal information", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50886, "text": "You have the right to obtain your personal information copy.", "label": ["Edit/Control", "Important"], "rewrite": "You have the right to obtain your personal information copy."}
{"task": "rw_40.jsonl", "id": 50887, "text": "If you need to get the copy of your personal information we collected, please contact us at any time (see \"Nine, how to contact us\").", "label": ["Important", "Edit/Control"], "rewrite": "If you need to get a copy of your personal information, please contact us."}
{"task": "rw_40.jsonl", "id": 50888, "text": "Under the premise of compliance with relevant laws and technical feasibility, we will provide you with your personal information copy according to your requirements.", "label": ["Important", "Edit/Control"], "rewrite": "Under the premise of compliance with relevant laws and technical feasibility, we will provide you with your personal information copy according to your requirements."}
{"task": "rw_40.jsonl", "id": 50889, "text": "5.3 Correction/Modify your personal information", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50890, "text": "You can correct/modify your personal information in our products and/or services.", "label": ["Edit/Control", "Important"], "rewrite": "You can correct/modify your personal information in our products and/or services."}
{"task": "rw_40.jsonl", "id": 50891, "text": "In order to facilitate your above -mentioned rights, we provide you with two ways: online correction/modification and correct/modification application to us.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50892, "text": "For security and identification (such as number appeal services), you may not be able to modify the initial registration information and other verification information provided when registering.", "label": ["Important", "Edit/Control"], "rewrite": "For security and identification, you may not be able to modify the initial registration information and other verification information provided when registering."}
{"task": "rw_40.jsonl", "id": 50893, "text": "For some of your personal information, we provide you with operational guidelines and operation settings on the related functional page of the product. You can directly correct/modify the operation guidance as follows:", "label": ["Important", "Edit/Control"], "rewrite": "You can directly correct/modify some of your personal information according to the operation guidelines and operation settings."}
{"task": "rw_40.jsonl", "id": 50894, "text": "(1) The correction/modification interface of \"Avatar/Nickname/Community Introduction\" information is <My-Personal Homepage-Edit Information>;;", "label": ["Edit/Control", "Important"], "rewrite": "The correction/modification interface of the \"Avatar/Nickname/Community Introduction\" information is <My-Personal Homepage-Edit Information>."}
{"task": "rw_40.jsonl", "id": 50895, "text": "(2) The correction/modification interface of \"mobile phone number*/email address*/account password*/third-party account\" information is <Mine-Settings-Security Center>.", "label": ["Important", "Edit/Control"], "rewrite": "\"Mobile phone number/email address/account password/third-party account\" information information correction/modification interface is <Mine-Settings-Security Center>."}
{"task": "rw_40.jsonl", "id": 50896, "text": "5.4 Delete your personal information", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50897, "text": "Generally speaking, we only save your personal information stipulated in laws and regulations or necessary and shortest times.", "label": ["Data Retention", "Important"], "rewrite": "Save your personal information only in laws and regulations or must be saved in the shortest and shortest time."}
{"task": "rw_40.jsonl", "id": 50898, "text": "To facilitate your exercise of your above -mentioned deletion right, we provide you with two ways to delete online and ask us to delete your application.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50899, "text": "For some of your personal information, we provide you with operational guidelines and operation settings on the related functional page of the product. You can directly delete it. Once you delete, we will delete or processes such informationThere are other provisions of laws and regulations:", "label": ["Important", "Edit/Control"], "rewrite": "You can directly delete some of your personal information by operating guidelines and operation settings. Such information will be deleted or anonymous after deleting."}
{"task": "rw_40.jsonl", "id": 50900, "text": "(1) The deletion interface of \"Search History\" information in the APP is <lian/Selected/Discovery-Search-Search History>;", "label": ["Important", "Edit/Control"], "rewrite": "The deletion interface of \"Search History\" information in the APP is <lian/Selected/Discovery-Search-Search History>."}
{"task": "rw_40.jsonl", "id": 50901, "text": "(2) The delete interface of the \"Browse Record\" information in the APP is <I-Browse Record>;", "label": ["Important", "Edit/Control"], "rewrite": "The deletion interface of the \"Browse Record\" information in the APP is <Mine-Browse Record>."}
{"task": "rw_40.jsonl", "id": 50902, "text": "In the following circumstances, you can directly make a request to delete your personal information, but except for the anonymous processing of data or other provisions of laws and regulations:", "label": ["Important", "Edit/Control"], "rewrite": "In the following circumstances, you can directly make a request to delete your personal information, but except for the anonymous processing of data or other provisions of laws and regulations:"}
{"task": "rw_40.jsonl", "id": 50903, "text": "(1) If our behavior of handling personal information violates laws and regulations;", "label": ["Important", "Edit/Control"], "rewrite": "If our behavior of handling personal information violates laws and regulations, you can make a request to delete personal information."}
{"task": "rw_40.jsonl", "id": 50904, "text": "(2) If we collect and use your personal information, it has not obtained your consent;", "label": ["Important", "Edit/Control"], "rewrite": "If we collect and use your personal information, but not obtain your consent, you can make a request to delete information."}
{"task": "rw_40.jsonl", "id": 50905, "text": "(3) If our behavior of handling personal information violates your agreement;", "label": ["Edit/Control", "Important"], "rewrite": "If our behavior of handling personal information violates your agreement, you can make a request to delete information."}
{"task": "rw_40.jsonl", "id": 50906, "text": "(4) If you no longer use our products and/or services, or you cancel your account;", "label": ["Important", "Edit/Control"], "rewrite": "If you no longer use our products and/or services, or you cancel your account, you can make a request to delete information."}
{"task": "rw_40.jsonl", "id": 50907, "text": "(5) If we no longer provide products and/or services for you.", "label": ["Edit/Control", "Important"], "rewrite": "If we no longer provide you with products and/or services, you can make a request to delete information."}
{"task": "rw_40.jsonl", "id": 50908, "text": "5.5 Withdrawal of consent", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50909, "text": "As mentioned earlier, the functions of the products and/or services we provide need to obtain the relevant permissions, push switches, and personalized recommendation switches you use.Continue to authorize.", "label": ["Edit/Control", "Important"], "rewrite": "You can withdraw (or stop) the corresponding permissions/functions at any time after the relevant permissions of the device, the push switch, and the personalized recommendation switch are authorized."}
{"task": "rw_40.jsonl", "id": 50910, "text": "The operation path of the withdrawal of the consent right is as follows:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50911, "text": "(1) Storage permissions: <Equipment System Settings-Application Details Page-Permanent Settings> or <From Point Reading APP-I-Settings-Privacy Settings>;", "label": ["Edit/Control", "Important"], "rewrite": "Storage permissions: <Development System Settings-Application Details Page-Permanent Settings> or <From Point Reading APP-I-Settings-Privacy Settings>."}
{"task": "rw_40.jsonl", "id": 50912, "text": "(2) Camera permissions: <Development System Settings-Application Details Page-Permanent Settings> or <From Point Reading APP-I-Settings-Privacy Settings>;", "label": ["Important", "Edit/Control"], "rewrite": "Camera permissions: <Development system settings-application details page-permissions settings> or <starting point reading app-me-settings-privacy settings>."}
{"task": "rw_40.jsonl", "id": 50913, "text": "(3), microphone permission: <Devitary System Settings-Application Details Page-Permanent Settings> or <From Point Reading APP-I-Settings-Privacy Settings>;", "label": ["Important", "Edit/Control"], "rewrite": "Microphone permission: <Devices system settings-application details page-permissions settings> or <starting point reading app-me-setting-privacy settings>."}
{"task": "rw_40.jsonl", "id": 50914, "text": "(4), telephone permissions (below Android10): <Device system settings-application details page-permissions settings> or <starting point reading app-me-Settings-Privacy Settings>;", "label": ["Important", "Edit/Control"], "rewrite": "Phone permissions (below Android10): <Devitary System Settings-Application Details Page-Permanent Settings> or <Ten Study App-I-Settings-Privacy Settings>."}
{"task": "rw_40.jsonl", "id": 50915, "text": "(5), camera permissions (iOS side): <Reading APP-I-Settings-Privacy Settings>;", "label": ["Important", "Edit/Control"], "rewrite": "Camera permissions (iOS): <Reading APP-I-Settings-Privacy Settings>."}
{"task": "rw_40.jsonl", "id": 50916, "text": "(6), advertising tracking permissions (iOS side): <Devices system settings-Application details page-Allow tracking>;", "label": ["Important", "Edit/Control"], "rewrite": "Advertising tracking permissions (iOS side): <Devices system settings-Application details page-Allow tracking>."}
{"task": "rw_40.jsonl", "id": 50917, "text": "(7) Personalized recommendation function: <Reading App-I-Settings-Privacy Settings>;;", "label": ["Important", "Edit/Control"], "rewrite": "Personalized recommendation function: <Reading APP-Me-Settings-Privacy Settings>."}
{"task": "rw_40.jsonl", "id": 50918, "text": "(8) Personalized advertising functions: <From Point Reading APP-I-Settings-Privacy Settings>", "label": ["Important", "Edit/Control"], "rewrite": "Personalized advertising functions: <From Point Reading APP-I-Settings-Privacy Settings>."}
{"task": "rw_40.jsonl", "id": 50919, "text": "(9), push function: <Equipment System Settings-Application Details Page-Notification Settings> or <From Point Reading APP-I-Settings-Push Notification Settings>;", "label": ["Important", "Edit/Control"], "rewrite": "Push function: <Devitar System Settings-Application Details Page-Notification Settings> or <Taking Reading APP-I-Settings-Push Notification Settings>."}
{"task": "rw_40.jsonl", "id": 50920, "text": "(10) Community information can be seen: <starting point reading app-me-settings-privacy settings>.", "label": ["Important", "Edit/Control"], "rewrite": "Community information can be seen: <From Point Reading APP-I-Settings-Privacy Settings>."}
{"task": "rw_40.jsonl", "id": 50921, "text": "When you cancel the authorization of relevant personal information collection, we will no longer collect this information, and we can no longer provide you with the above -mentioned services.", "label": ["Important", "Edit/Control"], "rewrite": "When you cancel the authorization of relevant personal information collection, we will no longer collect the information and cannot provide corresponding services."}
{"task": "rw_40.jsonl", "id": 50922, "text": "But your decision to withdraw authorization will not affect personal information processing based on your authorization.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "The decision to withdraw authorization will not affect the personal information processing carried out based on authorization."}
{"task": "rw_40.jsonl", "id": 50923, "text": "5.6 Logging out your account", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50924, "text": "We provide you with account cancellation permissions. You can use functional operations or contact our customer service to cancel your account through the APP. Operation path <Mine-Settings-Security Center-Account Logging up>.", "label": ["Important", "Edit/Control"], "rewrite": "You can cancel your account through the function operation or contact our customer service through the APP."}
{"task": "rw_40.jsonl", "id": 50925, "text": "Once you cancel your account, you will not be able to use the entire line of user products and/or services we provide, and automatically abandon the existing rights and interests, so please do it carefully.", "label": ["Important", "Edit/Control"], "rewrite": "Once the account is canceled, it will not be able to use the product or service and automatically give up the existing rights."}
{"task": "rw_40.jsonl", "id": 50926, "text": "In addition to the other provisions of laws and regulations, after canceling the account, we will stop providing you all our products and/or services. Our products and/or services you have used through this accountThe record will be deleted or anonymous (but the laws and regulations have other regulations or the regulatory authorities have other requirements. For example, according to the \"Cyber Security Law of the People's Republic of China\", your network operation log will keep at least six months.To.", "label": ["Important", "Edit/Control"], "rewrite": "After canceling the account, we will stop providing you with products and/or services. The information record will be deleted or anonymous. The laws and regulations will be otherwise stipulated or otherwise requires other requirements."}
{"task": "rw_40.jsonl", "id": 50927, "text": "When you visit, modify and delete related information, we may ask you to verify your identity to ensure the security of the account.", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "When you visit, modify and delete related information, we may ask you to verify your identity to ensure the security of the account."}
{"task": "rw_40.jsonl", "id": 50928, "text": "Please understand that due to technical restrictions, laws or regulatory requirements, we may not be able to meet all your requirements, and we will answer your request within a reasonable period.", "label": ["Important", "Edit/Control"], "rewrite": "We may not be able to meet all your requirements, but we will answer your request within a reasonable period."}
{"task": "rw_40.jsonl", "id": 50929, "text": "6. How do we store and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50930, "text": "6.1 Information storage", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50931, "text": "In the process of registering accounts or using this service, you may need to collect and use some necessary information (see 2-how we collect and use information).", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50932, "text": "If the real information you fill in is incomplete, it may be limited during the corresponding service process.", "label": ["Important", "First Party Collection Information"], "rewrite": "If the real information you fill in is incomplete, it may be limited during the corresponding service process."}
{"task": "rw_40.jsonl", "id": 50933, "text": "Generally speaking, we only retain your personal information for the shortest time to achieve the goal.", "label": ["Data Retention", "Important"], "rewrite": "Keep your personal information for the shortest time to achieve the purpose."}
{"task": "rw_40.jsonl", "id": 50934, "text": "When our products and/or services stop operation, we will notify you in the form of notification or announcement, and delete or processed your personal information within a reasonable period.", "label": ["Important", "Cessation of Operations"], "rewrite": "When stopping operation, we will make an announcement notice and delete or processes your personal information."}
{"task": "rw_40.jsonl", "id": 50935, "text": "Personal information storage and overdue processing method:", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50936, "text": "(1) The personal information we collected and generated in the operation of the People's Republic of China is stored in China.", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in domestic operations will be stored in China."}
{"task": "rw_40.jsonl", "id": 50937, "text": "(2) According to relevant laws and regulations, the diary information storage period is not less than 6 months;", "label": ["Data Retention", "Important"], "rewrite": "According to relevant laws and regulations, log information storage period is not less than 6 months."}
{"task": "rw_40.jsonl", "id": 50938, "text": "The preservation time of transaction information is not less than three years from the date of the transaction;", "label": ["Data Retention", "Important"], "rewrite": "The preservation time of transaction information is not less than three years from the date of the transaction."}
{"task": "rw_40.jsonl", "id": 50939, "text": "The record backup saving time is not less than 60 days.", "label": ["Data Retention", "Important"], "rewrite": "The record backup saving time is not less than 60 days."}
{"task": "rw_40.jsonl", "id": 50940, "text": "(3) Unless the law has compulsory depository requirements;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50941, "text": "After your personal information exceeds the retention period, we will delete your personal information according to the applicable feedback requirements or make it anonymous processing.", "label": ["Data Retention", "Important"], "rewrite": "Delete personal information that exceeds the reserved period according to the applicable feedback requirements, or anonymous processing."}
{"task": "rw_40.jsonl", "id": 50942, "text": "6.2 Information protection", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50943, "text": "6.2.1", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50944, "text": "Protecting user personal information is a basic principle of the starting point.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50945, "text": "We regard user information security and privacy protection for our own \"lifeline\".", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50946, "text": "We are committed to improving information processing transparency, enhancing your convenience of information management, and ensuring your information and communication security.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50947, "text": "Strictly abide by laws and regulations, follow the following principles of privacy protection, and provide you with more secure and reliable services:", "label": ["Data Security"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50948, "text": "(1) Security and reliable: We do our best through a reasonable and effective information security technology and management process to prevent your information from leaking, damage, and loss;", "label": ["Important", "Data Security"], "rewrite": "Through reasonable and effective information security technology and management processes, you can prevent your information leakage, damage, and loss."}
{"task": "rw_40.jsonl", "id": 50949, "text": "(2) Protect communication secrets: We strictly follow laws and regulations, protect your communication secrets, and provide you with secure communication services;", "label": ["Important", "Data Security"], "rewrite": "Strictly follow laws and regulations to protect your communication secrets."}
{"task": "rw_40.jsonl", "id": 50950, "text": "(3) Reasonable necessity: In order to provide better services to you and other users, we only collect the necessary information;", "label": ["Important", "Data Security"], "rewrite": "In order to provide better services to you and other users, we only collect the necessary information."}
{"task": "rw_40.jsonl", "id": 50951, "text": "(4) Clear and transparent: We strive to use concise and easy -to -understand expressions to introduce you privacy policy in order to clearly understand our information processing methods;", "label": ["Important", "Data Security"], "rewrite": "Use simple and easy -to -understand expressions to introduce you privacy policies."}
{"task": "rw_40.jsonl", "id": 50952, "text": "(5) Incorporate privacy protection into the product design: We are integrated into the concept of privacy protection in all aspects of product and/or service development, comprehensive law, product, and design.", "label": ["Important", "Data Security"], "rewrite": "In all aspects of product and/or service development, privacy protection is integrated into product design."}
{"task": "rw_40.jsonl", "id": 50953, "text": "6.2.2, the starting point will adopt professional encryption storage and transmission methods for related information to ensure the security of user personal information, and use various security technologies and procedures to establish a sound management system to protect your personal information, so as not to suffer unauthorized access to access., Use or disclose.", "label": ["Important", "Data Security"], "rewrite": "Professional encryption storage and transmission methods are used to establish a sound management system with various security technologies and procedures to protect your personal information."}
{"task": "rw_40.jsonl", "id": 50954, "text": "(1) In terms of data security transmission, password technologies such as transportation layer security protocols are adopted to prevent the risk of being eavesdropped and intercepted by HTTPS and other methods, establishing a secure privacy data collection environment, and ensuring the privacy and integrity of data collection.Items", "label": ["Important", "Data Security"], "rewrite": "The password technology such as the transport layer security protocol is used to prevent the risk of being tapped and intercepted by HTTPS and other methods."}
{"task": "rw_40.jsonl", "id": 50955, "text": "(2) In terms of data security storage, the data is categorized and disposed of and adopted additional security protection measures such as independent and encrypted storage on the user's personal sensitive information;", "label": ["Important", "Data Security"], "rewrite": "In terms of data security storage, the data is classified and disposed of and adopted additional security protection measures such as independent and encrypted storage on the user's personal sensitive information."}
{"task": "rw_40.jsonl", "id": 50956, "text": "(3) In terms of data access and use security control, implement strict data permissions control mechanisms, adopt multiple identity authentication technology, and monitor behaviors that can process your information to avoid data from illegal access and unauthorized use;", "label": ["Important", "Data Security"], "rewrite": "Implement strict data permissions control mechanisms, adopt multiple identity authentication technologies, and monitor the behavior of processing information."}
{"task": "rw_40.jsonl", "id": 50957, "text": "(4) Other measures to implement data security protection.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50958, "text": "6.2.3", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50959, "text": "To prevent safety accidents, we have formulated a proper early warning mechanism and emergency plan.", "label": ["Important", "Data Security"], "rewrite": "Formulate an early warning mechanism and emergency plan to prevent safety accidents."}
{"task": "rw_40.jsonl", "id": 50960, "text": "Once a personal information security incident occurs, we will inform you in a timely manner in accordance with the requirements of the laws and regulations: the basic situation and possible impact of the security incident, the disposal measures we have taken or we are going to take, the suggestions and suggestions and suggestions for reducing the risk of autonomy and reducing risksThe emergency plan for your remedy and immediately start the emergency plan to minimize the loss.", "label": ["Important", "Data Security"], "rewrite": "If a personal information security incident occurs, we will inform your basic situation, possible impact, disposal measures, independent prevention suggestions, etc."}
{"task": "rw_40.jsonl", "id": 50961, "text": "We will inform you of the incident -related situation in time by telephone, push notification.", "label": ["Important", "Data Security"], "rewrite": "We will inform you of the relevant situation of security incidents by phone, push notification, etc. in time."}
{"task": "rw_40.jsonl", "id": 50962, "text": "7. How do we deal with the personal information of minors", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50963, "text": "7.1", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50964, "text": "We attach great importance to the protection of personal information of minors and continue to explore the updated personal information protection methods of minors.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50965, "text": "If you are a minor under the age of 18 (especially a minor under the age of 14), if you are under the age of 18, please read this policy accompanied by the guardian, especially the terms of personal information about minors.And obtain the consent of your parents or legal guardians in advance.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are under the age of 18, please read this policy accompanied by the guardian and obtain the consent of the guardian in advance."}
{"task": "rw_40.jsonl", "id": 50966, "text": "If you are the guardian of minors, when you have any questions about the personal information of the minors you monitor, please contact us through customer service.", "label": ["Specific Audiences", "Important"], "rewrite": "When the guardian of the minor has relevant questions about the personal information of the minors you monitor, please contact us."}
{"task": "rw_40.jsonl", "id": 50967, "text": "In particular, if you are less than 14 years old, before completing your account registration, please read the \"Starting Point Reading Child Privacy Policy\".", "label": ["Specific Audiences", "Important"], "rewrite": "If you are under the age of 14, before completing your account registration, please read the \"Starting Points to Read the Child Privacy Policy\"."}
{"task": "rw_40.jsonl", "id": 50968, "text": "After your guardian agrees to \"Starting Points for Child Privacy Policy\", children under the age of 14 can use the starting point to read.", "label": ["Specific Audiences", "Important"], "rewrite": "After your guardian agrees to \"Starting Points for Child Privacy Policy\", children under the age of 14 can use the starting point to read."}
{"task": "rw_40.jsonl", "id": 50969, "text": "7.2, if you are under 18 years old, in order to protect your legitimate rights and interests, we may use the information related to the starting point (including but not limited to the login information of your account number*, use time*, etc.) to provide you withYour guardian can understand the situation where you use the starting point in time or synchronously.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are under 18 years old, we may provide you with information related to the starting point to your guardian."}
{"task": "rw_40.jsonl", "id": 50970, "text": "7.3", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50971, "text": "If you are the guardian of the minor, please pay attention to whether the minors you are monitored use your starting point to read or provide your personal information after obtaining your authorization consent.", "label": ["Specific Audiences", "Important"], "rewrite": "Please pay attention to whether the minors you are monitoring are after obtaining your authorization consent to use the starting point to read or provide their personal information."}
{"task": "rw_40.jsonl", "id": 50972, "text": "If you have doubts about the personal information of the minors you monitor, please contact us through the bottom of this policy.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50973, "text": "If we find the personal information of minors without obtaining the consent of the guardian in advance, the relevant data will be deleted as soon as possible.", "label": ["Specific Audiences", "Important"], "rewrite": "If the personal information of minors was collected without the consent of the legal guardian, he would try to delete relevant information as soon as possible."}
{"task": "rw_40.jsonl", "id": 50974, "text": "8. Privacy policy update", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50975, "text": "The starting point may be modified from time to time. After the agreement is modified, we will explain the scope and content of the policy through the in -site letter, page prompts, and marking red dots.", "label": ["Policy Change", "Important"], "rewrite": "After the privacy policy is modified, we will explain to you the scope and content of the policy through in -site letters, page prompts, and marking red spots."}
{"task": "rw_40.jsonl", "id": 50976, "text": "According to the requirements of laws and regulations, we will list the previous version of this policy on the official website", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50977, "text": ", So that you can check.", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50978, "text": "For major changes, we will also provide a more significant notice (including the notification of the platform publicity and even the pop -up prompt to you), and provide you with the way of self -selection consent, and collect and use it after obtaining your consent, use it, use it. Your personal information.", "label": ["Policy Change", "Important"], "rewrite": "For major changes, we will also provide more significant notifications, provide you with the way you choose to consent, and collect and use your personal information after obtaining your consent."}
{"task": "rw_40.jsonl", "id": 50979, "text": "(1) Major changes in our service model: such as the purpose of handling personal information, the type of personal information, and the use of personal information;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50980, "text": "(2) We have changed significantly in control: if the owner of the merger acquisition and reorganization changes;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50981, "text": "(3) The main object of personal information sharing, transfer or public disclosure changes;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50982, "text": "(4) The right to participate in personal information processing and its exercise methods have changed significantly;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50983, "text": "(5) When we are responsible for handling the responsibility departments, contact methods and complaint channels of personal information security;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50984, "text": "(6) Evaluation report on personal information security impact indicates that there is a high risk of high risk", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50985, "text": "In order to receive notifications in time, it is recommended that you notify us in time when your personal contact information is updated.", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50986, "text": "We encourage you to check this policy every time you use our service. You can read it at the starting point", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50987, "text": "<My-Settings-Privacy Policy> View this policy.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50988, "text": "If you continue to use our services after the policy update is effective, it means that you have fully read, understand and accept the updated policy and are willing to be constrained by the updated policy;", "label": ["Policy Change", "Important", "Risk"], "rewrite": "If you continue to use our services after the policy update is effective, it means that you accept the updated policy."}
{"task": "rw_40.jsonl", "id": 50989, "text": "If you do not agree with the amendment of this agreement, please stop using the platform or cancel the services you have obtained.", "label": ["Policy Change", "Important", "Risk"], "rewrite": "If you do not agree with the amendment of this agreement, please stop using the platform or cancel the services you have obtained."}
{"task": "rw_40.jsonl", "id": 50990, "text": "Nine, how to contact us", "label": [], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50991, "text": "We have set up a special person in personal information protection. The contact information of the person in charge of personal information is 021-61870500-86018.", "label": ["Important", "Contact Information"], "rewrite": "The person in charge of personal information protection is 021-61870500-86018."}
{"task": "rw_40.jsonl", "id": 50992, "text": "If you have other complaints, suggestions, and personal information related to the minor, you can contact us in the following ways:", "label": ["Important", "Contact Information"], "rewrite": "If you have other complaints, suggestions, and personal information related to the minor, you can contact us in the following ways:"}
{"task": "rw_40.jsonl", "id": 50993, "text": "(1) Dial customer service phone 010-59357051 contact us.", "label": ["Important", "Contact Information"], "rewrite": "Customer Service Tel: 010-59357051"}
{"task": "rw_40.jsonl", "id": 50994, "text": "(2) Through the customer service page, https://help.yuewen.com/help/?", "label": ["Important", "Contact Information"], "rewrite": "Customer service page: https://help.yuewen.com/help/? Siteid = 10000 & cat = 10001"}
{"task": "rw_40.jsonl", "id": 50995, "text": "Siteid = 10000 & cat = 10001 contact us.", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50996, "text": "We will review the issues involved as soon as possible and answer your request within 15 working days or laws and regulations.", "label": ["Important", "Contact Information"], "rewrite": "We will answer your request within 15 working days or laws and regulations."}
{"task": "rw_40.jsonl", "id": 50997, "text": "Note: The update date of this privacy policy version is October 29, 2021, click to view the old version of \"Privacy Policy\"", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_40.jsonl", "id": 50998, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
