{"task": "rw_57.jsonl", "id": 57109, "text": "Version update prompt", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57110, "text": "Version update prompt:", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57111, "text": "In order to better protect your rights and interests, we have recently updated the \"Guidelines for Privacy Property Privacy of the People\".", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57112, "text": "The content of this update mainly includes:", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57113, "text": "(1) Refine the relevant situation of targeted push so that you can understand and manage your personal information in detail.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57114, "text": "Reading prompt", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57115, "text": "Please read carefully before using/continue to use the products and/or services of the national K song, and fully understand the full text of the full version of \"Guidelines for the Privacy Property Property Protection of the National K Song\".", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57116, "text": "Unless otherwise explained, do not agree with the \"Guidelines for the Privacy of the National K Songs\" or its update (we will inform you in time) may affect your products and/or services that will continue to use normally or continue to use normally.", "label": ["Policy Change", "Important"], "rewrite": "Do not agree that the \"Guidelines for Privacy Property Privacy of the People\" or its renewal may affect your products and/or services that will continue to use normally or continue to use them normally."}
{"task": "rw_57.jsonl", "id": 57117, "text": "1. The information we collect", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57118, "text": "The National K song is a product and service provided by Shenzhen Tencent Computer System Co., Ltd. (hereinafter referred to as \"We\").", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57119, "text": "Shenzhen Tencent Computer System Co., Ltd.'s registration address is the 35th floor of Tencent Building, Tencent Building, Maging Community Science and Technology Middle School, Yuehai Street, Nanshan District, Shenzhen.", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57120, "text": "During the product operation process, it will also jointly operate with affiliated companies, such as channel cooperation and brand linkage.", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57121, "text": "In the process of using the national K song service, the National K song will collect the information you actively provided by your service when using the service as follows, to provide you with services, optimize our services, and ensure your service to ensure youraccount security:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57122, "text": "All people K song third -party information sharing list", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57123, "text": "1.1, we use QQ or WeChat as our account system. When you log in to the national K song with QQ or WeChat association, we will collect your QQ or WeChat's unique logo, avatar, nickname, VIP information, friends information, possible knowing, you may know what possible you knowHuman information is used to save your login information so that you can synchronize your data when logging in with different devices, and learn about the listening information of your friends in the nation's K song.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect the only identification, avatar, nickname, VIP information, friends information, and people you may know about your QQ or WeChat."}
{"task": "rw_57.jsonl", "id": 57124, "text": "Among them, friends information and people you may know belong to your personal sensitive information. You can refuse to provide it by rejecting authorization when landing.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "Friends information and people you may know belong to your personal sensitive information. You can refuse to provide it by rejecting authorization when logging in."}
{"task": "rw_57.jsonl", "id": 57125, "text": "If you refuse to provide such information, we will not be able to provide you with services related to friends such as friends listening to song information, but the other functions of K songs are not affected.", "label": ["Important", "First Party Collection Information"], "rewrite": "Refusing to provide personal sensitive information, it will not be able to provide friends related services, but other functions of K songs are not affected."}
{"task": "rw_57.jsonl", "id": 57126, "text": "1.2, when you use the national K song service, we will collect your music playback record so that you can view your point accompaniment and play history.", "label": ["Important", "First Party Collection Information"], "rewrite": "When using the national K song service, we will collect your music playback records."}
{"task": "rw_57.jsonl", "id": 57127, "text": "We will also collect channel information such as MV and song lists you added to in the collection function, so that you can play your interesting music and visit your collection more easily and quickly.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will also collect channel information such as MV and song lists you added to in the collection function."}
{"task": "rw_57.jsonl", "id": 57128, "text": "We will also collect your fan list at the same time to show your related fans.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will also collect your fan list at the same time to show your related fans."}
{"task": "rw_57.jsonl", "id": 57129, "text": "You have stored the accompaniment, play history, collection, and fan lists in our servers so that you can use the above features when logging in through multiple terminals, and you can also delete this information at any client at any time.", "label": ["Data Retention", "Important"], "rewrite": "You have been stored in our servers at any client at any client."}
{"task": "rw_57.jsonl", "id": 57130, "text": "1.3, in order to ensure your normal use of our services, maintain the normal operation of our service, improve and optimize your service experience and ensure your account security, we will collect your device model, operating system, unique device identifier, equipment SN, Log in to IP address, MAC address, local application list, IMSI, operation log information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect your device model, operating system, unique device identifier, device SN, login IP address, MAC address, local application installation list, IMSI, operation log information."}
{"task": "rw_57.jsonl", "id": 57131, "text": "To help improve your network experience, we will collect Wi-Fi information nearby at the same time.", "label": ["Important", "First Party Collection Information"], "rewrite": "To help improve your network experience, we will collect Wi-Fi information nearby at the same time."}
{"task": "rw_57.jsonl", "id": 57132, "text": "In addition, for the purpose of advertising and statistics, we will use the unique device identifier (including IMEI), MAC address, Android, ID, equipment model information to complete advertising and statistical related matters.", "label": ["Important", "Usage"], "rewrite": "We will use the unique device identifier (including IMEI), MAC address, Android ID, installed application list, device model information to complete advertising and statistical related matters."}
{"task": "rw_57.jsonl", "id": 57133, "text": "In addition, in order to combat black production, maintain the rights and interests of the platform and users, we will collect the value of light sensors, acceleration sensors, and gravity sensors. Manufacturers, sensor name information to determine whether related devices are simulators rather than real devices.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect the values of light sensors, acceleration sensors, and gravity sensors. Manufacturers, sensor name information to determine whether the relevant equipment is an simulator rather than a real device."}
{"task": "rw_57.jsonl", "id": 57134, "text": "1.4, we may collect your information through cookies, identifiers, and related technologies, including your device information, browsing information, click information, and store these information as a log information to provide you with personalized user experience and guarantee servicesSafety.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may collect your information through cookies, identifiers, and related technologies, including your device information, browsing information, click information, and store these information as log information."}
{"task": "rw_57.jsonl", "id": 57135, "text": "1.5, in order to ensure the stable operation or implementation of the relevant functions of the national K song, we may access the software development package (SDK) provided by a third party to achieve the previous purpose.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may access the software development package (SDK) provided by a third party to ensure the stable operation of the K song of the whole people."}
{"task": "rw_57.jsonl", "id": 57136, "text": "See this link for third -party SDK accessed by K song.", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57137, "text": "1.6, when you use live broadcasts, song rooms, clear singing, Lianmai, group chat, local uploading audio and video, anchor settled, etc., due to relevant laws and regulations, you need to provide the real identity information required for identity authentication services.", "label": ["Important", "First Party Collection Information"], "rewrite": "You need to provide the real identity information required for identity authentication services."}
{"task": "rw_57.jsonl", "id": 57138, "text": "This type of information includes names, contact information, ID card information, facial feature information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect name, contact information, ID information, facial feature information."}
{"task": "rw_57.jsonl", "id": 57139, "text": "Among them, ID information and facial feature information are personal sensitive information. After obtaining your explicit consent, we will use encrypted technology to collect, transmit, store, and use it only for real -name authentication and laws and regulations.Agree, we will not be used as other purposes.", "label": ["Important", "First Party Collection Information", "Data Security"], "rewrite": "After obtaining the consent of the statement, we will use encrypted technology to collect, transmit, and store ID card information, and only use it for real -name authentication and the purpose stipulated in laws and regulations. Without your explicit authorization consent, it will not be used as other purposes."}
{"task": "rw_57.jsonl", "id": 57140, "text": "If you refuse to provide it, you cannot use related functions, but it will not affect other services of your normally using K song.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide ID information, you cannot use related functions, but will not affect normal use of other services."}
{"task": "rw_57.jsonl", "id": 57141, "text": "1.7, you can set the WeChat account number and mobile phone number you related to the avatar-account management office to improve your information. When you actively increase the relevant contact information, we may contact you in special circumstances (if you invite you to become become a become you to be a will become aOur anchor, etc.).", "label": ["Important", "Edit/Control"], "rewrite": "You can set up your related WeChat account and mobile phone number to set your information at the Settings-Avatar-Account Management Office to improve your information."}
{"task": "rw_57.jsonl", "id": 57142, "text": "You can choose whether to provide us with your address book information to help you and others find friends and K song with more people.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can choose whether to provide us with your address book information."}
{"task": "rw_57.jsonl", "id": 57143, "text": "The address book information belongs to your personal sensitive information. If you refuse to provide the address book information, it will not affect your normally use the service of the national K song.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide address book information, it will not affect your normally use the service of the national K song."}
{"task": "rw_57.jsonl", "id": 57144, "text": "1.8, when you use the functions of fast singing and clearing, we will collect the voice information of you use the microphone input, thinking that you provide the function of uploading the singing content.", "label": ["Important", "First Party Collection Information"], "rewrite": "When using the fast singing and singing function, we will collect the voice information you use the microphone."}
{"task": "rw_57.jsonl", "id": 57145, "text": "Among them, voice information is your personal sensitive information. If you refuse to provide other services that will not be able to use the quick singing and clearing function, but do not affect the normal use of the normally use the national K song.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide a voice mailbox, you will not be able to use the functions of the quick singing and singing, but it does not affect the normal use of other services."}
{"task": "rw_57.jsonl", "id": 57146, "text": "1.9, when you use the function of grabbing wheat, chorus, and recitation, we will collect your voice information and geographical location information in your use of microphone.The information is to recommend your work in the \"near\" column.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect the voice information and geographical location information you use microphone."}
{"task": "rw_57.jsonl", "id": 57147, "text": "Audio and video information and geographical location information are sensitive personal information.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide audio and video information, it will not be able to complete the corresponding function, but it does not affect other services of normally using K songs."}
{"task": "rw_57.jsonl", "id": 57148, "text": "1.10, when you use the function of the song room, we will collect the voice information and video information you entered, thinking that you provide a voice and video on the wheat function of the video.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect the voice information and video information you enter, thinking that you provide the function of sending voice and video on the video."}
{"task": "rw_57.jsonl", "id": 57149, "text": "Among them, voice information and video information are personal sensitive information.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide audio and video information, you will not be able to use the corresponding function, but it does not affect the normal use of other services."}
{"task": "rw_57.jsonl", "id": 57150, "text": "1.11, when you use the even wheat function, we will collect your microphone input voice information and video information entered by the camera, thinking that you provide the sending voice and video on the wheat function. In addition, the microphone voice information will also be used for your singing score.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect the voice information entered by your microphone and the video information entered by the camera to provide you with the function of sending voice and video on the video."}
{"task": "rw_57.jsonl", "id": 57151, "text": "Among them, voice information and video information are personal sensitive information.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide voice information and video information, you will not be able to use the corresponding function, but it does not affect the normal use of other services."}
{"task": "rw_57.jsonl", "id": 57152, "text": "1.12, when you use the group chat function, we will collect the voice information of your microphone input, thinking that you provide the function of sending voice with other users.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the group chat function, we will collect the voice information of your microphone input."}
{"task": "rw_57.jsonl", "id": 57153, "text": "Among them, voice information is a personal sensitive information. If you refuse to provide other services that will not be able to use the corresponding function, but do not affect other services that use the normally use the national K song.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide voice information, you will not be able to use the corresponding function, but it does not affect the normal use of other services."}
{"task": "rw_57.jsonl", "id": 57154, "text": "1.13, when you use a short video function, we will collect the audio and video information and geographical location information you entered. The purpose of collecting audio and video information is to achieve the function of uploading the recording works. The collection of geographical location information is to \"nearby nearby nearby nearby\" nearby nearby\"The column recommends your work.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide other services that will not be able to use the corresponding function, but do not affect the normal use of the normally use the national K song."}
{"task": "rw_57.jsonl", "id": 57155, "text": "Audio and video information and geographical location information are sensitive personal information. If you refuse to provide your work that will not be able to complete short video uploading or recommend your work in \"nearby\", it does not affect other services that use K song normally.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide audio and video information and geographical location information, you cannot complete the short video upload or recommend your work in the \"nearby\", but it does not affect the normal use of other services."}
{"task": "rw_57.jsonl", "id": 57156, "text": "1.14, if you apply to become an anchor, according to relevant laws and regulations, you need to provide the real identity information required for identity authentication services.", "label": ["Important", "First Party Collection Information"], "rewrite": "According to relevant laws and regulations, you need to provide real identity information required for identity authentication services."}
{"task": "rw_57.jsonl", "id": 57157, "text": "This type of information includes names, contact information, ID card information, facial feature information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Need to collect names, contact information, ID card information, facial feature information."}
{"task": "rw_57.jsonl", "id": 57158, "text": "The aforementioned information is a personal sensitive information. After obtaining your explicit consent, we will use encrypted technology to collect, transmit, store, and use it only for real -name authentication and the purpose stipulated in laws and regulations. Without your authorization consent, we will not use it.Do other purposes.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "After obtaining your explicit consent, we will use encrypted technology to collect, transmit, store personal information, and use it only for real -name authentication and the purpose stipulated in laws and regulations. Without the consent of your explicit authorization, we will not be used as other purposes."}
{"task": "rw_57.jsonl", "id": 57159, "text": "If you refuse to provide it, you cannot register as an anchor, but it does not affect other services of the normally use K song.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide personal information, you cannot register as an anchor, but do not affect the normal use of other services."}
{"task": "rw_57.jsonl", "id": 57160, "text": "1.15, when you use the live broadcast function for live broadcast, we will collect your cell, ID, and audio and video information and geographical information you entered.In order to achieve the function of your work, the collection of geographical information is to recommend your work in the \"nearby\" column.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect your Cell ID and the audio and video information and geographical location information you enter."}
{"task": "rw_57.jsonl", "id": 57161, "text": "Audio and video information and geographical location information are sensitive personal information. If you refuse to provide your work that will not be able to complete the live broadcast matters or recommend your work in the \"nearby\", it does not affect the normal use of other services of the national K song.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide audio and video information and geographical location information, you will not be able to complete the live broadcast matters or recommend your work in \"nearby\", but it does not affect the normal use of other services."}
{"task": "rw_57.jsonl", "id": 57162, "text": "1.16, when you look at the works of others with KMed by the whole people, we will collect your user's nicknames and avatars, K coins and related virtual asset information, to provide comments, give gifts to the anchor (the owner of the work), participate in various APPs to various APPsServices of internal activities.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you look at the works of others with Ksamu, we will collect your user's nicknames and avatars, K coins, and related virtual asset information."}
{"task": "rw_57.jsonl", "id": 57163, "text": "K coins and related virtual asset information are personal sensitive information. If you refuse to provide it, you will not be able to give gifts to the anchor (the owner of the work), but it will not affect other services of the normally use K song.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide K coins and related virtual asset information, you will not be able to give gifts to the anchor (the owner of the work), but it will not affect the normal use of other services."}
{"task": "rw_57.jsonl", "id": 57164, "text": "1.17, if you use virtual currency recharge, virtual items to purchase gifts, member rights opening services, we will collect your recharge, transactions and related virtual asset information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect your recharge, transactions and related virtual asset information."}
{"task": "rw_57.jsonl", "id": 57165, "text": "The above information is a sensitive information. If you refuse to provide it, you will not be able to use related services, but the other functions of K songs of the whole people are not affected.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide relevant virtual asset information, you will not be able to use related services, but other functions are not affected."}
{"task": "rw_57.jsonl", "id": 57166, "text": "1.18, if you are an anchor user, you need to carry out income withdrawal. We need to collect your withdrawal account information, ID card information, withdrawal record information to complete the withdrawal work.", "label": ["Important", "First Party Collection Information"], "rewrite": "We need to collect your withdrawal account information, ID information, and withdrawal record information to complete the withdrawal work."}
{"task": "rw_57.jsonl", "id": 57167, "text": "The above information belongs to your personal sensitive information.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide withdrawal information, you will not be able to use the withdrawal function, but it does not affect your use of other functions of the national K song."}
{"task": "rw_57.jsonl", "id": 57168, "text": "1.19, when you use the K song mall service, you need to provide us with the consignee, mobile phone number, address information, transaction records, order information to realize the service transactions and express the product to your services.", "label": ["Important", "First Party Collection Information"], "rewrite": "You need to provide us with the consignee, mobile phone number, address information, transaction records, order information to realize the service transactions and express the product to your services."}
{"task": "rw_57.jsonl", "id": 57169, "text": "Among them, mobile phone numbers, address information, transaction records, and order information are personal sensitive information. The purpose of collecting such information is to confirm the transaction to reach and contact you in time for courier.", "label": ["Important", "First Party Collection Information"], "rewrite": "Mobile phone numbers, address information, transaction records, and order information are personal sensitive information. The collection of such information is to confirm the transaction reached and contact you in time for courier."}
{"task": "rw_57.jsonl", "id": 57170, "text": "If you refuse to provide such information, we will not be able to complete the transaction and normal delivery for you, but the other functions of the national K song are not affected.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide such information, we will not be able to complete the transaction and normal delivery for you, but other functions are not affected."}
{"task": "rw_57.jsonl", "id": 57171, "text": "1.20, when you use uploading pictures, videos, etc. When you need to initiate pictures and video upload functions, we will collect photos, media content and documents on your device that you actively upload to provide corresponding services.", "label": ["Important", "First Party Collection Information"], "rewrite": "When actively launched pictures and video upload functions, we will collect photos, media content and files on your device that you actively upload, to provide corresponding services."}
{"task": "rw_57.jsonl", "id": 57172, "text": "1.21 When you use the recording video editing function, K song album function, music short film function, uploading local works functions, the national K song needs to access multimedia files such as local pictures and videos of your mobile phone according to actual needs.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "The K song of the whole people needs to access multimedia files such as local pictures, videos and other multimedia files according to actual needs."}
{"task": "rw_57.jsonl", "id": 57173, "text": "After obtaining your active selection and explicit consent, these multimedia files will be used for the production and release of the work, and the personality display of personal data.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After obtaining active selection and explicit consent, these multimedia files will be used for the production and release of the work, and the personality display of personal data."}
{"task": "rw_57.jsonl", "id": 57174, "text": "If you refuse to authorize access and use, you will not be able to use the corresponding specific function, but it will not affect your normally use the national K song.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you refuse to authorize access and use, you will not be able to use the corresponding specific function, but it will not affect your normally use the national K song."}
{"task": "rw_57.jsonl", "id": 57175, "text": "1.22, when you use listening to the original singing works, making MVs, etc., you need to jump other applications (such as QQ music, cool dog music, sound rabbit, etc.), we need to collect your application installation list to determine whether you have installed your installation.Corresponding application and jump.", "label": ["Important", "First Party Collection Information"], "rewrite": "We need to collect your application installation list to determine whether you have installed the corresponding application and make a jump."}
{"task": "rw_57.jsonl", "id": 57176, "text": "1.23, when you use nearby and same city functions, we will collect your cell, ID (assisted locally information) and accurate geographical location information to provide hot content services for nearby and the same city (including recommending your works to other usersTo.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect your Cell ID (auxiliary acquisition location information) and accurate geographical location information to provide recommendations for hot content services in the same and city cities."}
{"task": "rw_57.jsonl", "id": 57177, "text": "Accurate geographical information is a personal sensitive information. If you do not provide this information, you may not be able to use the aforementioned function, but it will not affect your other services.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you do not provide accurate geographical location information, the aforementioned function may not be used, but it will not affect your other services."}
{"task": "rw_57.jsonl", "id": 57178, "text": "It should be clear that when you refuse the location permissions, the same city function will not be able to obtain your precise geographical location information, but it will still provide you with relevant content services based on your IP address to obtain your rough position.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you refuse your location permissions, the same city function will not be able to obtain your accurate geographical location information, but you will still provide you with relevant content services based on your IP address to obtain your rough position."}
{"task": "rw_57.jsonl", "id": 57179, "text": "1.24, when you use the fast -loading private chat function, we will collect your geographical location information with user songs and singer preferences to recommend nearby users and users of the same music taste.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect your geographical information and user songs, singer preference information, to recommend nearby users and users of the same music taste."}
{"task": "rw_57.jsonl", "id": 57180, "text": "The geographical location information is a personal sensitive information. If you do not provide the information, you may not be able to use the aforementioned function, but it will not affect your other services.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you do not provide geographical information, you may not be able to use the aforementioned function, but it will not affect your other services."}
{"task": "rw_57.jsonl", "id": 57181, "text": "1.25, if you participate in our questionnaire survey, online activities (such as live room activities, etc.), marketing activities, transaction refunds, and cancellation account functions, we will collect your name, mobile phone number, ID card, collection, collection, collection, collection, collectionPersonal name, contact address, contact information, payment channels, payment accounts, payment network statistics, order information, transaction and consumption information, award -winning information, virtual property information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect your name, mobile phone number, ID card, recipient name, contact address, contact information, payment channels, payment account number, order information, transaction and consumption information, award -winning information, virtual property, virtual property, virtual property, virtual propertyinformation."}
{"task": "rw_57.jsonl", "id": 57182, "text": "ID card, payment channels, payment accounts, payment network quotes, order information, transaction and consumption information, award -winning information, virtual property information are personal sensitive information. After obtaining your explicit consent, we will use encrypted technology to collect and store it.The scope of collection of class information will be explicitly stated in the aforementioned activities and its rules.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "After obtaining your explicit consent, we will use encrypted technology to collect and store personal sensitive information. The scope of the collection of such information will be expressed to you in the aforementioned activities and its rules."}
{"task": "rw_57.jsonl", "id": 57183, "text": "If you refuse to provide relevant information, you will not be able to use the corresponding specific functions, but it will not affect your normally use the service of the national K song.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide information, you will not be able to use the corresponding specific features, but it will not affect your normally use the service of the national K song."}
{"task": "rw_57.jsonl", "id": 57184, "text": "1.26, if you visit the event page or external advertising from the National K song (if you download it through the H5 page of a competition), we will generate a only time based on time and random data generated on your mobile phone cutting plate.ID, and read this unique ID on the cutting plate after using the nationwide K song to make the jump of the corresponding activity page and provide you with a good user experience.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will generate a unique ID based on time and random data on your mobile phone cutting plate, and read it."}
{"task": "rw_57.jsonl", "id": 57185, "text": "Based on the above purposes, when the National K Song Club is installed and launched for the first time, it calls to read your shear board to achieve the previous purpose.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "The National K song will call and read your shear plate when you are installed and started for the first time."}
{"task": "rw_57.jsonl", "id": 57186, "text": "In addition, when you use a song room sharing function, we will automatically generate invitation content, room invitation code, and link to enter the house and automatically copy the invitation content to the cutting plate. Then you can directly paste the content in other scenarios or external apps directly., Send the invitation content for friends, your friends can go directly to the song room.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use a song room sharing function, we will automatically generate invitation content such as invitation copywriting, room invitation code, and link to enter the house and automatically copy the invitation content to the shear plate."}
{"task": "rw_57.jsonl", "id": 57187, "text": "Based on the above purposes, we need to read your shear plate information when the K song is launched by the whole people to complete the above actions.", "label": ["Important", "First Party Collection Information"], "rewrite": "We need to read your shear information when the K song is launched."}
{"task": "rw_57.jsonl", "id": 57188, "text": "1.27, to optimize your experience in watching works, recording song loading, watching live song rooms, etc., we need to collect your IMSI to obtain the current network environment operator to further optimize the network experience.", "label": ["Important", "First Party Collection Information"], "rewrite": "We need to collect your IMSI to obtain the current network environment operator to further optimize the network experience."}
{"task": "rw_57.jsonl", "id": 57189, "text": "1.28, you can use the editor's personal data function to fill in or edit related personal data to display on your homepage and enable access users to see the relevant content.", "label": ["Important", "Edit/Control"], "rewrite": "You can use the editing personal data function to fill in or edit related personal information."}
{"task": "rw_57.jsonl", "id": 57190, "text": "You can choose to provide us with relevant personal information, including gender, birthday, current residence, school, occupation, region, height, preference singer, personal signature information, if you refuse to provide relevant information, it does not affect the normal use of the national K song.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can choose to provide us with relevant personal information. If you refuse to provide relevant information, it does not affect the use of K song normally."}
{"task": "rw_57.jsonl", "id": 57191, "text": "The above information is provided by the user's own initiative. The platform does not provide any requirements for the relevant information, nor does it make any identification or guarantee for its authenticity.", "label": ["Important", "First Party Collection Information"], "rewrite": "Personal information is provided by the user's own initiative, and the platform does not provide any requirements for the relevant information, nor does it make any identification or guarantee for its authenticity."}
{"task": "rw_57.jsonl", "id": 57192, "text": "1.29, we may recommend the person you might know based on your friend relationship chain, favorite style style, etc., you can authorize related recommendations to delete the basic friend relationship by closing the friend relationship chain.Close through the path of \"setting-privacy-personalized content recommendation and listening dynamics\".", "label": ["Important", "Edit/Control"], "rewrite": "You can complete the relevant recommendations of the friend relationship to delete the basic friend relationship by closing the friend relationship chain, and you can also complete the path of \"setting-privacy-personalized content recommendation and listening dynamics\"."}
{"task": "rw_57.jsonl", "id": 57193, "text": "1.30, when you use the uploading device local audio files, we will scan audio files in the MP3, M4A and other formats in the device system, and provide users to choose to transform into the works in the K song station for release.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "We will scan audio files in the MP3, M4A and other formats in the device system, and provide users to choose to transform into the works in the K song station for release."}
{"task": "rw_57.jsonl", "id": 57194, "text": "1.31 In order to facilitate you to provide you with more convenient services. When you use our products or services, our product or service may have the following functional scenarios that start or start from the association. Among them, we will provide you with corresponding shutdown.Buttons, you can choose whether to open or close the corresponding function by yourself;", "label": ["Important", "Edit/Control"], "rewrite": "We provide you with the corresponding shutdown button, and you can choose whether to open or close the corresponding features yourself."}
{"task": "rw_57.jsonl", "id": 57195, "text": "In some functional scenarios, when you actively operate, you will trigger the function scenario related to starting or associated. When you do not perform such operations, you will not start or start", "label": ["Important", "Edit/Control"], "rewrite": "In some functional scenarios, when you actively operate, you will trigger a functional scenario related to start or associated."}
{"task": "rw_57.jsonl", "id": 57196, "text": "The association in some functional scenarios is the ability of the system equipment itself. The corresponding behavior is carried out locally in the user's device, which does not involve content upload:", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57197, "text": "1), to provide you with message push technical services, we need to use your Android, ID, QIMEI, OAID, and IP address for link adjustment to promote the closing SDK push process of each other to ensure that you can receive us in time to receive us in timeThe message pushed to you.", "label": ["Important", "Edit/Control"], "rewrite": "To provide you with message push technology services, we need to use your Android ID, Qimei, OAID and IP addresses for link adjustment."}
{"task": "rw_57.jsonl", "id": 57198, "text": "If you want to close this function, you can turn off the function by setting-message notification-whether to allow the association to start the sending notification message. Closing this function does not affect your normal use of this application.", "label": ["Important", "Edit/Control"], "rewrite": "You can close the function by setting-message notification-whether to allow the association to start the sending notification message. Closing this function does not affect your normal use of this application."}
{"task": "rw_57.jsonl", "id": 57199, "text": "2) When you use audio and headphones, etc., when the media played equipment played by media control functions, you can take the initiative to start the recently used multimedia application by double -clicking (specifically based on media playback equipment instructions). If you have recently recentlyWhen the media application is used for our products or services, our products or services can be awakened by instructions.", "label": ["Important", "Edit/Control"], "rewrite": "You can take the initiative to start the most recently used multimedia application through double -clicking and other instructions."}
{"task": "rw_57.jsonl", "id": 57200, "text": "The purpose of our system function is to avoid your song recording operations from being interrupted by other software.", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57201, "text": "3) When you cut the National K song app to the background, we use the system characteristics of the set of time tasks through Alarm, Manager, and check whether there is news push in the background at a certain time frequency.Your work has new comments and so on.", "label": ["Important", "Edit/Control"], "rewrite": "Our set of system characteristics through Alarm Manager timing task, check whether there is message push to display at a certain time frequency."}
{"task": "rw_57.jsonl", "id": 57202, "text": "This function does not involve collecting your personal information in the background.", "label": ["Important", "First Party Collection Information", "Edit/Control"], "rewrite": "This function does not involve collecting your personal information in the background."}
{"task": "rw_57.jsonl", "id": 57203, "text": "4) When you use the Widget desktop component, the system will sound the application household operation to start the national K song, and jump to the corresponding page;", "label": ["Important", "Edit/Control"], "rewrite": "When you use the Widget desktop component, the system will sound the application household operation to start the national K song and jump to the corresponding page."}
{"task": "rw_57.jsonl", "id": 57204, "text": "When you add and delete the desktop component, the system responds to your operation and automatically start the national K song to notify the app to update the UI.", "label": ["Important", "Edit/Control"], "rewrite": "When adding and deleting the desktop component, the system responds to your operation and automatically start the national K song to notify the app to update the UI."}
{"task": "rw_57.jsonl", "id": 57205, "text": "1.32, for information that may need to be collected using the additional business functions of our product or service, you can choose whether to authorize us to collect it.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "You can choose whether to authorize us to collect information required by using additional business functions."}
{"task": "rw_57.jsonl", "id": 57206, "text": "If you refuse to provide it, it will cause the additional business functions to be unable to achieve or to achieve the effect we intend to achieve, but it will not affect your normal use of core business functions.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "If you refuse to provide it, it will cause the additional business functions to be unable to achieve or achieve effect, but it will not affect the normal use of core business functions."}
{"task": "rw_57.jsonl", "id": 57207, "text": "This information generally requires you to cooperate with the corresponding device authority to obtain, so you can manage the corresponding permissions of the device settings page.", "label": ["Important", "Edit/Control"], "rewrite": "You can manage the additional business function information by collecting the corresponding permissions of the device setting page."}
{"task": "rw_57.jsonl", "id": 57208, "text": "At the same time, you can also open/cancel the corresponding permissions through \"Settings-Application-Application-Application-National K Song-Permissions\" (there may be subtle differences) or \"setting of iOS device-national K song\".", "label": ["Important", "Edit/Control"], "rewrite": "You can also open/cancel the corresponding permissions through \"Settings-Application-Application-National K Song-Permissions\" (may have subtle differences) or \"Settings of iOS Device-National K Songs\"."}
{"task": "rw_57.jsonl", "id": 57209, "text": "If you turn on this permission, you deepen that you authorize us to access, obtain, collect, and use your corresponding personal information;", "label": ["Important", "Edit/Control"], "rewrite": "The entry authority is deemed that you authorize us to access, obtain, collect, and use your corresponding personal information."}
{"task": "rw_57.jsonl", "id": 57210, "text": "When you cancel the authorization, we will no longer collect the information, and we will no longer provide you with the above -mentioned services;", "label": ["Important", "Edit/Control"], "rewrite": "When you cancel the authorization, we will no longer collect information and can no longer provide you with corresponding services."}
{"task": "rw_57.jsonl", "id": 57211, "text": "But your cancellation will not affect the processing and storage of our personal information based on your previous authorization.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "The cancellation of authorization will not affect the processing and storage of personal information based on previous authorization."}
{"task": "rw_57.jsonl", "id": 57212, "text": "You can choose whether to provide personal information in the following situation:", "label": ["Important", "First Party Collection Information"], "rewrite": "You can choose whether to provide personal information in the following situation:"}
{"task": "rw_57.jsonl", "id": 57213, "text": "Android:", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57214, "text": "1) Related functions based on storage permissions: When you use the device in the song room scene, use codes to upload dry sound;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57215, "text": "In the lock screen scene, it is used to obtain pictures for sharing;", "label": ["Important", "First Party Collection Information"], "rewrite": "In the lock screen scene, collect pictures for sharing."}
{"task": "rw_57.jsonl", "id": 57216, "text": "In the recording scene, when storing user works and dry sounds, we need to obtain your storage permissions and collect user files you choose to upload, such as pictures, videos, and local music to achieve corresponding functions.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "In the recording scene, when storing user works and dry sounds, you need to obtain the storage authority and collect the user files you choose to upload, such as pictures, videos, and local music."}
{"task": "rw_57.jsonl", "id": 57217, "text": "2) Related functions based on microphones: When you use fast singing, singing, live broadcast, Lianmai, grabbing wheat, chorus, recitation, group chat, song room and song recording function, we need to obtain your microphone rights,And obtain real -time microphone information to achieve the corresponding function.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "We need to obtain your microphone rights and obtain real -time microphone information to achieve the corresponding function."}
{"task": "rw_57.jsonl", "id": 57218, "text": "3) Related functions based on camera permissions: When you use live broadcast, Lianmai, song room on wheat, recording songs (recording videos), sweeping and real -name authentication functions, we need to obtain your camera permissions and get real -time timeCamera video information to achieve the corresponding function.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "We need to obtain your camera permissions and get real -time camera video information to achieve the corresponding function."}
{"task": "rw_57.jsonl", "id": 57219, "text": "4) Related functions based on telephone permissions: In order to determine the device, the ID is to ensure the normal playback, download and your account security of the song, we will apply for the phone permissions to obtain IMEI (only collected in Android 9 and below, Android 9 or aboveThe version is not collected), Android, ID, MAC address to achieve the above goals.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "We will apply for your phone permissions to obtain IMEI, Android ID, and MAC addresses to achieve the above goals."}
{"task": "rw_57.jsonl", "id": 57220, "text": "5) Related functions based on notification permissions: To provide you with the latest news services such as display push messages, work comments, and live broadcast houses that are concerned about, we need to obtain your notification permissions to achieve the above goals.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "We need to obtain your notification permissions."}
{"task": "rw_57.jsonl", "id": 57221, "text": "The permissions will be used locally in your device and will not collect any data.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "The notification authority will be used locally in your device and does not collect any data."}
{"task": "rw_57.jsonl", "id": 57222, "text": "6) Related functions based on location permissions: When you use grabbing wheat, chorus, recitation, singing, short videos (recommending your work), live broadcast (recommending your live broadcast), and city functions (recommending works with similar geographical location), Songfang Square (recommended in the same city song house), discover friends (recommended people nearby), fast -loading private chat function (recommended nearby people), \"to receive VIP benefits\" (regional list), and family square functions (regional lists list) When function, we need to obtain your location permissions and collect your geographical location information to complete the implementation of the aforementioned function.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "We need to obtain your location permissions and collect your geographical information to complete the aforementioned function."}
{"task": "rw_57.jsonl", "id": 57223, "text": "7) Related functions based on calendar permissions: When you use live activities such as live broadcast activities, date reminders, event reminders, and other related calendar reminders, we need to obtain your calendar authority to realize local reading and setting calendar reminders.In these functions, we only complete relevant actions locally without collecting relevant information.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "We need to obtain your calendar authority to achieve local reading and setting calendar reminders."}
{"task": "rw_57.jsonl", "id": 57224, "text": "8) Related features based on contact human rights: When you use the function of the nation -friend K song in the contact of contact, we need to obtain your contact human rights and collect the contact information on your device to achieve the aforementioned function.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "We need to get your contact human rights and collect contact information on your device."}
{"task": "rw_57.jsonl", "id": 57225, "text": "In terms of iOS:", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57226, "text": "1) Related features based on photo permissions: When you use a live room cover or picture release function in the song room, and using audio and video functions in the recording scene, we need to obtain your photo permissions and collect you manually manuallySelect the uploaded pictures or videos to achieve the corresponding function.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "We need to obtain your photo permissions and collect the pictures or videos you manually choose to achieve the corresponding function."}
{"task": "rw_57.jsonl", "id": 57227, "text": "2) Power -related authority related to location permissions: When you use grabbing, chorus, recitation, singing, short videos (recommended your work), live broadcast (recommending your live broadcast), and city functions (recommending works with similar geographical location), Songfang Square (recommended in the same city song house), discover friends (recommended people nearby), fast -loading private chat function (recommended nearby people), \"to receive VIP benefits\" (regional list), and family square functions (regional lists list) At that time, we need to obtain your location permissions and collect your geographical location information to complete the implementation of the aforementioned function.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "We need to obtain your location permissions and collect your geographical location information to complete the implementation of the aforementioned function."}
{"task": "rw_57.jsonl", "id": 57228, "text": "3) Functions related to microphone rights: When you use fast singing, light singing, live broadcast, Lianmai, grabbing wheat, chorus, recitation, group chat, song houses and song recording functionsGet real -time microphone information to achieve the corresponding function.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "We need to obtain your microphone rights and obtain real -time microphone information to achieve the corresponding function."}
{"task": "rw_57.jsonl", "id": 57229, "text": "4) Functions related to camera permissions: When you use live broadcast, Lianmai, song room on wheat, recording songs (recording videos), sweeping and real -name authentication functions, we need to obtain your camera permissions and obtain real -time camerasVideo information to achieve corresponding functions.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "We need to obtain your camera permissions and get real -time camera video information to achieve the corresponding function."}
{"task": "rw_57.jsonl", "id": 57230, "text": "5) Related functions based on notification permissions: To provide you with the latest news services such as displaying private messages, work reviews, and live broadcast room broadcast, we need to obtain your notification permissions to achieve the above goals.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "We need to obtain your notification permissions."}
{"task": "rw_57.jsonl", "id": 57231, "text": "The permissions will be used locally in your device and will not collect any data.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "The notification authority will be used locally in your device and does not collect any data."}
{"task": "rw_57.jsonl", "id": 57232, "text": "6) Related functions based on advertising tracking permissions: In order to realize third -party advertising users to undertake and equipment recognition functions, we will apply for advertising tracking permissions and obtain IDFA to achieve the above purposes.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "We will apply for advertising tracking permissions and obtain IDFA to achieve the above purposes."}
{"task": "rw_57.jsonl", "id": 57233, "text": "7) Related functions based on calendar permissions: When you use live activities such as live broadcast activities, date reminders, event reminders, and other related calendar reminders, we need to obtain your calendar authority to realize local reading and setting calendar reminders.In these functions, we only complete relevant actions locally without collecting relevant information.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "We need to obtain your calendar authority to achieve local reading and setting calendar reminders."}
{"task": "rw_57.jsonl", "id": 57234, "text": "8) Related features based on contact human rights: When you use the function of the nation -friend K song in the contact of contact, we need to obtain your contact human rights and collect the contact information on your device to achieve the aforementioned function.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "We need to get your contact human rights and collect contact information on your device."}
{"task": "rw_57.jsonl", "id": 57235, "text": "In addition, according to relevant laws and regulations and national standards, in the following situations, we may collect or use your relevant personal information without soliciting your authorization consent:", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "In the following situations, we may collect and use your relevant personal information without asking your authorization consent:"}
{"task": "rw_57.jsonl", "id": 57236, "text": "1) Directly related to national interests such as national security and national defense security;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting personal information directly related to national interests such as national security and national defense security does not need to solicit consent."}
{"task": "rw_57.jsonl", "id": 57237, "text": "In order to deal with emergencies, or directly related to major public interests such as public safety, public health, and public knowledge;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting personal information that responds to emergencies or directly related to major public interests, there is no need to solicit consent."}
{"task": "rw_57.jsonl", "id": 57238, "text": "2), directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect direct personal information related to criminal investigation, prosecution, trial, and execution of judgments without asking for consent."}
{"task": "rw_57.jsonl", "id": 57239, "text": "3) For major legitimate rights and interests such as maintaining your life, property, and reputation of your or other individuals, but it is difficult to get my consent;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting and maintaining major legitimate rights and interests but difficult to get personal information that I agree, without asking for consent."}
{"task": "rw_57.jsonl", "id": 57240, "text": "4), the personal information you collected is publicly disclosed to the public by yourself;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "The collected personal information is made to the public by itself without asking for consent."}
{"task": "rw_57.jsonl", "id": 57241, "text": "5) Collect personal information from the legal public information, such as legal news reports, government information disclosure and other channels;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If you collect personal information from the legal disclosure information, you do not need to ask for consent."}
{"task": "rw_57.jsonl", "id": 57242, "text": "6), signing and fulfilling the contract according to your requirements;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting the personal information necessary for the signing and performing the contract without soliciting consent."}
{"task": "rw_57.jsonl", "id": 57243, "text": "7), the safe and stable operation of the products or services provided by maintenance, such as discovering and disposing of products or services;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting personal information necessary for the safe and stable operation of products or services, there is no need to solicit consent."}
{"task": "rw_57.jsonl", "id": 57244, "text": "8) Implement news reports and public opinion supervision for public interests, and handle personal information within a reasonable range;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "In order to implement news reports and supervision of public opinion, if you handle personal information within a reasonable range, you do not need to solicit consent."}
{"task": "rw_57.jsonl", "id": 57245, "text": "9), when the public interest is necessary to carry out statistics or academic research, and when it provides academic research or description results, the personal information contained in the result is identified by", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting public interests to carry out the necessary personal information necessary for statistics or academic research, without asking for consent."}
{"task": "rw_57.jsonl", "id": 57246, "text": "10), other circumstances stipulated in laws and regulations.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect personal information under other circumstances stipulated in the laws and regulations without asking for consent."}
{"task": "rw_57.jsonl", "id": 57247, "text": "Please understand that the functions and services we provide to you are constantly updated and developed. If a function or service is not in the aforementioned and collected your information, we will use page prompts, interactive processes, website announcements, etc.Explain the content, scope and purpose of information collection to you.", "label": ["Important", "First Party Collection Information"], "rewrite": "If a function or service is not collected in the aforementioned instructions and your information is collected, we will explain to you the content, scope and purpose of the information collection."}
{"task": "rw_57.jsonl", "id": 57248, "text": "Please note that we will not take the initiative to obtain your personal information from a third party outside Tencent Group.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will not take the initiative to obtain your personal information from a third party outside Tencent Group."}
{"task": "rw_57.jsonl", "id": 57249, "text": "If the business development needs to indirectly obtain your personal information from a third party, we will tell you the source, type, and scope of use of personal information before acquisition.The scope of authorization consent when providing personal information, and we will obtain your authorization consent before dealing with such personal information;", "label": ["Important", "First Party Collection Information"], "rewrite": "We will inform the source of personal information before obtaining the source, type, and scope of use. If the personal information processing activity exceeds the scope of authorization consent, it will obtain your authorization consent."}
{"task": "rw_57.jsonl", "id": 57250, "text": "In addition, we will also strictly abide by the provisions of relevant laws and regulations, and require a third party to ensure the legality of the information provided.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57251, "text": "2. Storage of information", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57252, "text": "2.1 Method and period of information storage", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57253, "text": "We will store your information in a safe way, including local storage (such as using APP for data cache), database and server logs.", "label": ["Data Retention", "Important"], "rewrite": "We will store your information in a safe way, including local storage (such as using APP for data cache), database and server logs."}
{"task": "rw_57.jsonl", "id": 57254, "text": "Under normal circumstances, we will only store your personal information within the time necessary for the purpose of service to achieve service purposes or under the conditions of laws and regulations.", "label": ["Data Retention", "Important"], "rewrite": "We will only store your personal information within the time necessary for the purpose of service to achieve service purposes or under the conditions of laws and regulations."}
{"task": "rw_57.jsonl", "id": 57255, "text": "When your information storage period expires, we will timely delete your personal information or perform anonymized processing, except for other provisions of laws and regulations.", "label": ["Data Retention", "Important"], "rewrite": "When your information storage period expires, we will timely delete your personal information or perform anonymous processing."}
{"task": "rw_57.jsonl", "id": 57256, "text": "You can choose to delete the personal information that has been provided and generated by you when you use the accompaniment, play history, collection, etc. when you use the national K song service. If you choose to delete the above information, we will also delete the corresponding personal information accordingly.", "label": ["Data Retention", "Important"], "rewrite": "If you choose to delete the above information, we will also delete the corresponding personal information accordingly."}
{"task": "rw_57.jsonl", "id": 57257, "text": "2.2 The area where information storage", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57258, "text": "We will store personal information collected in China in China in accordance with laws and regulations.", "label": ["Data Retention", "Important"], "rewrite": "We will store personal information collected in China in China in accordance with laws and regulations."}
{"task": "rw_57.jsonl", "id": 57259, "text": "At present, we will not transmit or store your personal information cross -border.", "label": ["Data Retention", "Important"], "rewrite": "At present, we will not transmit or store your personal information cross -border."}
{"task": "rw_57.jsonl", "id": 57260, "text": "If you need to transmit or store cross -border in the future, we will inform you that the purpose of the information outbound, receiving party, security guarantee measures and security risks, and obtain your consent.", "label": ["Data Retention", "Important"], "rewrite": "If we need to transmit or store cross -border transmission, we will inform you the purpose of the information outbound, receiver, security guarantee measures and security risks, and obtain your consent."}
{"task": "rw_57.jsonl", "id": 57261, "text": "2.3 Notice of the product or service stopping operation", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57262, "text": "When our products or services stop operation, we will notify you in the form of push notifications, announcements, etc., and delete your personal information or perform anonymous processing within a reasonable period.", "label": ["Data Retention", "Important", "Cessation of Operations"], "rewrite": "When stopping operations, you will notify you in the form of push notifications and announcements, and delete personal information or perform anonymous processing within a reasonable period."}
{"task": "rw_57.jsonl", "id": 57263, "text": "3. Information security", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57264, "text": "3.1 Safety protection measures", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57265, "text": "We strive to provide protection for users' information security to prevent information leakage, loss, improper use, unauthorized access and disclosure.", "label": ["Important", "Data Security"], "rewrite": "Strive to provide protection for users' information security to prevent information leakage, loss, improper use, unauthorized access and disclosure."}
{"task": "rw_57.jsonl", "id": 57266, "text": "We use multi -directional security protection measures to ensure that user personal information protection is at a reasonable level of security, including technological protection methods, management system control, and security system guarantee.", "label": ["Important", "Data Security"], "rewrite": "Use multi -directional security protection measures to ensure that the protection of user personal information is at a reasonable level of security."}
{"task": "rw_57.jsonl", "id": 57267, "text": "We use industry -leading technical protection measures.", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57268, "text": "The technical means we use include but not limited to firewalls, encryption (such as SSL), de -identification or anonymous treatment, access control measures, etc.", "label": ["Important", "Data Security"], "rewrite": "The technical means we use include but not limited to firewalls, encryption (such as SSL), de -identification or anonymous treatment, access control measures, etc."}
{"task": "rw_57.jsonl", "id": 57269, "text": "In addition, we will continue to strengthen the security capabilities of software installed on your device.", "label": ["Important", "Data Security"], "rewrite": "We will continue to strengthen the security capabilities of software installed on your device."}
{"task": "rw_57.jsonl", "id": 57270, "text": "For example, we will complete some information encryption work locally to consolidate security transmission;", "label": ["Important", "Data Security"], "rewrite": "We will complete some information encryption work locally to consolidate security transmission."}
{"task": "rw_57.jsonl", "id": 57271, "text": "We will understand the application information and running process information installed by your device to prevent malicious programs such as viruses and Trojans.", "label": ["Important", "Data Security"], "rewrite": "We will understand the application information and running process information installed by your device to prevent malicious programs such as viruses and Trojans."}
{"task": "rw_57.jsonl", "id": 57272, "text": "We have established a special management system, process and organization that guarantees personal information security.", "label": ["Important", "Data Security"], "rewrite": "We have established a special management system, process and organization that guarantees personal information security."}
{"task": "rw_57.jsonl", "id": 57273, "text": "For example, we strictly restrict the scope of the personnel of the access information, require them to abide by the confidentiality obligations and audit, and those who violate the obligations will be punished in accordance with regulations.", "label": ["Important", "Data Security"], "rewrite": "We strictly restrict the scope of the personnel who access information and ask them to obey the confidentiality obligations and conduct audit."}
{"task": "rw_57.jsonl", "id": 57274, "text": "We will also review the management system, process and organization to prevent unauthorized personnel from accessing, using or disclosing users' information.", "label": ["Important", "Data Security"], "rewrite": "We will also review the management system, process and organization to prevent unauthorized personnel from accessing, using or disclosing users' information."}
{"task": "rw_57.jsonl", "id": 57275, "text": "We recommend that you pay full attention to the protection of personal information when using products and services, and we will also provide multiple security functions to help you protect your personal information security.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57276, "text": "3.2 Safety event disposal measures", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57277, "text": "If personal information leakage, damage, loss and other security incidents occur, we will start emergency plans to prevent the expansion of security events.", "label": ["Important", "Data Security"], "rewrite": "If personal information leakage, damage, loss and other security incidents occur, we will start emergency plans to prevent the expansion of security events."}
{"task": "rw_57.jsonl", "id": 57278, "text": "After the safety event occurs, we will timely inform you the basic situation of the security incident in the form of push notifications and emails, the disposal measures and remedial measures we are about to adopt or we have taken, and our proposal to your response.", "label": ["Important", "Data Security"], "rewrite": "After the safety event occurs, we will inform you the basic situation, disposal measures and remedial measures of the security incident, and cope with suggestions."}
{"task": "rw_57.jsonl", "id": 57279, "text": "If it is difficult to achieve one by one, we will issue warnings through announcement and other methods.", "label": ["Important", "Data Security"], "rewrite": "If it is difficult to achieve one by one, we will issue warnings through announcement and other methods."}
{"task": "rw_57.jsonl", "id": 57280, "text": "4. How do we use information", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57281, "text": "We strictly abide by the provisions of laws and regulations and the agreement with users, and in accordance with the information used in accordance with the guidelines of this privacy protection, to provide you with better services.", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57282, "text": "4.1 Information use rules", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57283, "text": "We will use the collected information according to the following rules:", "label": ["Usage"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57284, "text": "1) We will provide you with various functions and services based on the information we collect, including providing you with K songs, song houses and other services;", "label": ["Usage"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57285, "text": "2) We may use the information collected by some functions for our other services.", "label": ["Usage"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57286, "text": "For example, we may use the information collected when you use a certain functional service to provide you with specific content in another function or service, including but not limited to display advertisements (you can, about advertising, pages to understandMore), make information security categories.", "label": ["Important", "Usage"], "rewrite": "We may use the information collected when you use a certain functional service to provide you with specific content in another function or service."}
{"task": "rw_57.jsonl", "id": 57287, "text": "At the same time, we will provide you with personalized services based on your browsing preferences, habits, location information and other characteristics, including the indirect crowd portrait based on characteristic labels and recommend the content and activities you may be interested in, show you more correlation to you more correlation with youAdvertising or other promotion content, optimize the experience of personalized services, and evaluate and improve the effect of advertising and other promotion activities;", "label": ["Important", "Usage"], "rewrite": "At the same time, we will provide you with personalized services based on your browsing preferences, habits, location information and other characteristics."}
{"task": "rw_57.jsonl", "id": 57288, "text": "3), we will analyze the operation of our products based on the frequency and situation, fault information, performance information of the national K song, to ensure the security of the service, and optimize our products, and improve our service quality.", "label": ["Important", "Usage"], "rewrite": "We will analyze the operation of our products based on the frequency and situation of the national K song, fault information, and performance information."}
{"task": "rw_57.jsonl", "id": 57289, "text": "We will not combine the information we store in the analysis software with the personal identity information you provide;", "label": ["Important", "Data Security", "Usage"], "rewrite": "We will not combine the information we store in the analysis software with the personal identity information you provide."}
{"task": "rw_57.jsonl", "id": 57290, "text": "4) At the same time, we may use collected information for audit, data analysis and research, analyze business operation efficiency and measure market share, and improve our products and services.", "label": ["Important", "Usage"], "rewrite": "At the same time, we may use collected information for auditing, data analysis and research, analyze business operation efficiency and measure market share."}
{"task": "rw_57.jsonl", "id": 57291, "text": "4.2 Rules for directional push activities", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57292, "text": "In order to show you and recommend more information to you, provide the services that meet your requirements, and the National K song will collect, use your personal information, and automatically calculate and predict your preferences through your computer algorithm model to match you may be interested in interest.Information or service.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The National K Song will collect, use your personal information, and automatically calculate and predict your preferences through the computer algorithm model to match the information or services that may be interested in."}
{"task": "rw_57.jsonl", "id": 57293, "text": "Automated decision -making is a activity that automatically analyzes, evaluates personal behavior habits, hobbies or economic, healthy, and credit conditions, and decision -making activities.", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57294, "text": "Treatment (personalized recommendation) belongs to this type of decision.", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57295, "text": "The following will explain in detail the rules of our targeted push activities and the way you implement control.", "label": ["Usage"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57296, "text": "1) The scope of we providing personalized recommendation services includes but not limited to display content works, provides search results, and conducts content recommendation.", "label": ["Important", "Usage"], "rewrite": "The scope of our personalized recommendation services includes but not limited to display content works, provides search results, and conducts content recommendation."}
{"task": "rw_57.jsonl", "id": 57297, "text": "2) In order to predict your preferences, we may collect and use your equipment information, location information, and behavior information when using the national K song. Behavior information includes your browsing preferences, information release, information release, information release,Correspondence information of activities such as geographical location, interactive communication, search, clicking, attention, listening, browsing, downloading, and sharing, including account information such as gender, birthday, and regional region in your independent account.", "label": ["Important", "Usage"], "rewrite": "We may collect and use your device information, location information, and behavior information when using K songs of the whole people."}
{"task": "rw_57.jsonl", "id": 57298, "text": "We will automatically analyze and calculate the above information, and the machine (or system) will automatically screen and push the content you may be more interested in according to the calculation results.", "label": ["Important", "Usage"], "rewrite": "We will automatically analyze and calculate the information, and the machine (or system) will automatically screen and push more interesting content based on the calculation results."}
{"task": "rw_57.jsonl", "id": 57299, "text": "3), we will use the \"search keyword information\" you entered to show you the search results with higher correlation and more satisfying your needs.", "label": ["Important", "Usage"], "rewrite": "We will use the \"search keyword information\" you entered to show you the search results with higher correlation and more satisfying your needs."}
{"task": "rw_57.jsonl", "id": 57300, "text": "4), we will give real -time feedback on the recommendation model based on the content of you in the process of using the National K song, and constantly adjust the optimization of the recommendation results to better provide you with high -quality content.", "label": ["Important", "Usage"], "rewrite": "We will give real -time feedback on the recommendation model based on the content of your use in use, and constantly adjust the optimization results."}
{"task": "rw_57.jsonl", "id": 57301, "text": "You can close it through the path in Article 6.5.1 of this guideline.", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57302, "text": "5), we may use your device identifier (such as IMEI, IDFA, OAID, etc.), advertising data (such as exposure, click, conversion data, etc.), device information (such as device models, system language, high screen, screen direction, screen direction direction, screen direction direction), Application and use data (such as application package names and operating logs such as browsing, clicking, attention, searching, sharing, collection, etc.), connected WiFi, rough geographical location information and other information, provides you in this product to provide you may feel you may feelInterests of advertising, evaluation and improvement of our advertising, other promotions and promotion activities, and business analysis.", "label": ["Important", "Usage"], "rewrite": "We may use your device identifier (such as IMEI, IDFA, OAID, etc.), advertising data (such as exposure, click, conversion data, etc.), device information (such as device models, system language, high screen, screen direction, etc.),), high -width screen, screen direction, etc.), etc.),), high -width, screen direction, etc.),), screen direction, etc.), etc.), high, screen direction, etc.), etc.), high, screen direction, etc.),), etc.Application and use data (such as application package names and operation logs such as browsing, clicking, following, searching, sharing, collection, etc.), connected wifi, rough geographical location information and other information."}
{"task": "rw_57.jsonl", "id": 57303, "text": "When you use innovative advertising interactive functions (such as shaking, twisting, and reversing equipment), we will call the device's gyroscope, acceleration, and gravity sensor to identify and judge your device status.", "label": ["Important", "Usage"], "rewrite": "We will call the device's gyroscope, acceleration, and gravity sensor to identify and judge your device status."}
{"task": "rw_57.jsonl", "id": 57304, "text": "Please understand that separate device sensor data does not involve any personal location information and cannot be combined with other information to identify the identity of a specific natural person.", "label": ["Important", "Data Security", "Usage"], "rewrite": "The separate device sensor data does not involve any personal location information and cannot be combined with other information to identify the identity of a specific natural person."}
{"task": "rw_57.jsonl", "id": 57305, "text": "When you actively copy the links on the advertising landing page, we will access the device's cutting plate capabilities to facilitate the implementation of functions such as links.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We will access the equipment of the device to facilitate the implementation of functions such as links."}
{"task": "rw_57.jsonl", "id": 57306, "text": "Please rest assured that personalized advertising recommendation algorithms do not identify your true identity. It is based on speculative characteristics to provide more valuable advertising information for you and save your transaction costs.", "label": ["Important", "Usage"], "rewrite": "Personalized advertising recommendation algorithms do not identify your true identity."}
{"task": "rw_57.jsonl", "id": 57307, "text": "If you don't want to accept personalized advertising services, you can turn off management in this product settings.", "label": ["Important", "Edit/Control"], "rewrite": "If you don't want to accept personalized advertising services, you can turn off management in this product settings."}
{"task": "rw_57.jsonl", "id": 57308, "text": "You can go to the product settings page management and close personalized advertising recommendations through the path 6.5.2.", "label": ["Important", "Edit/Control"], "rewrite": "You can go to the product settings page management and close personalized advertising recommendations through the path 6.5.2."}
{"task": "rw_57.jsonl", "id": 57309, "text": "If you choose to close, the number of ads you see will not decrease, but this product will no longer show you personalized advertisements, and the advertisement you see may be reduced with your preference.", "label": ["Important", "Edit/Control"], "rewrite": "If you choose to close, the number of ads you see will not decrease, but this product will no longer show you personalized advertisements."}
{"task": "rw_57.jsonl", "id": 57310, "text": "6) In addition, when you turn off the directional push, you can still see some \"recommended\" label works through other user homepages.", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57311, "text": "You understand that the \"recommendation\" label is only to indicate that the work has been recommended by the platform, which is described by the status of the work, and does not involve targeted push functions.", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57312, "text": "7) If you use our products in the tourist mode, you will not receive related targeted push activities.", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57313, "text": "Closing personalized recommendations does not affect the normal use of your other functions. You can decide to open or close the function at any time according to your preferences and judgments.", "label": ["Edit/Control", "Important"], "rewrite": "Closing personalized recommendations does not affect the normal use of your other functions. You can decide to open or close the function at any time."}
{"task": "rw_57.jsonl", "id": 57314, "text": "4.3 The way to obtain consent after notifying the purpose of the change", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57315, "text": "We will use the collected information in the purpose covered by the guidance of privacy protection.", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57316, "text": "If we use your personal information, which exceeds the purpose and scope of direct or reasonable correlation with the purpose of the time of collection, we will tell you and obtain your explicit consent again before using your personal information.", "label": ["Important", "Usage"], "rewrite": "If your personal information is used, it will exceed the purpose of collecting and reasonable, and you will tell you and obtain your consent again before use."}
{"task": "rw_57.jsonl", "id": 57317, "text": "5. Provide outside", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57318, "text": "At present, we will not take the initiative to share or transfer your personal information until the third party. If there are other sharing or transfer your personal information or you need us to share or transfer your personal information to a third party situation, we will directly or confirm itThe third party obtains your explicit consent of the above behavior.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "It will not actively share or transfer your personal information until the third party. If there are other sharing or transfer situations, it will directly or confirm that the third party obtains its consent."}
{"task": "rw_57.jsonl", "id": 57319, "text": "We have developed the \"All -Public K Song Third -Party Information Sharing List\" to clearly and simply introduce the information sharing of our third -party SDK and business partners through the interface (API).", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We have formulated the situation of information sharing with third parties for \"National K Song Third -Party Information Sharing List\"."}
{"task": "rw_57.jsonl", "id": 57320, "text": "Click to view the \"Third -Party Information Sharing List of the National K Song\".", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Click to view the \"Third -Party Information Sharing List of the National K Song\"."}
{"task": "rw_57.jsonl", "id": 57321, "text": "In order to put on advertising, evaluate, and optimize the effect of advertising, we need to share some information from the advertisers and their agents such as third -party partners, which requires them to strictly abide by our measures and requirements on data privacy protection, including but not limited to but not limited to but not limited to it.It is processed according to the data protection agreement, commitment letter and related data processing policies to avoid identifying personal identity and ensuring privacy security.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We need to share part of the information with third -party partners such as advertisers and agents, asking them to strictly abide by our measures and requirements on data privacy protection."}
{"task": "rw_57.jsonl", "id": 57322, "text": "We will not share with partners to identify information that can be used to identify your personal identity (such as your name or email address), unless you clearly authorize.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Do not share information with your partners to identify your personal identity unless you clearly authorize."}
{"task": "rw_57.jsonl", "id": 57323, "text": "We will not publicly disclose the personal information collected to the outside world. If we must disclose it publicly, we will tell you the purpose of the public disclosure, the type of disclosure information, and the possible sensitive information that may be involved, and obtain your explicit consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The personal information collected will not be disclosed to the outside world. If it must be disclosed publicly, the purpose of the public disclosure, the type of disclosure information, and the sensitive information that may be involved, and obtain the consent."}
{"task": "rw_57.jsonl", "id": 57324, "text": "With the sustainable development of our business, we may conduct merging, acquisition, asset transfer and other transactions. We will inform you that the relevant situation will continue to protect or request new control in accordance with laws and regulations and not lower than the standards required by the privacy protection guidelines.Continue to protect your personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For mergers, acquisitions, asset transfer and other transactions, we will inform you of the relevant situation and continue to protect or request new controller to continue to protect your personal information."}
{"task": "rw_57.jsonl", "id": 57325, "text": "In addition, in accordance with relevant laws and regulations and national standards, in the following situations, we may share, transfer, and openly disclose personal information without obtaining your authorization consent in advance:", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "In the following circumstances, we may share, transfer, and publicly disclose personal information without obtaining your authorization consent in advance:"}
{"task": "rw_57.jsonl", "id": 57326, "text": "To establish and fulfill your contract as a party as a party;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "The personal information necessary for sharing and fulfilling the contract does not need to ask for consent."}
{"task": "rw_57.jsonl", "id": 57327, "text": "Related to the obligations stipulated in our performance of laws and regulations;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Personal information related to the obligations stipulated in laws and regulations shall be shared without consent."}
{"task": "rw_57.jsonl", "id": 57328, "text": "Directly related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Personal information directly related to national security and national defense security does not need to solicit consent."}
{"task": "rw_57.jsonl", "id": 57329, "text": "In order to deal with emergencies, or directly related to public safety, public health, and major public interests;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Personal information to shared the public health incidents does not need to ask for consent."}
{"task": "rw_57.jsonl", "id": 57330, "text": "Directly related to criminal investigation, prosecution, trial, and execution of judgment;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Direct related personal information such as sharing with criminal investigation, prosecution, trial and judgment execution does not need to solicit consent."}
{"task": "rw_57.jsonl", "id": 57331, "text": "It is difficult to obtain the major legitimate rights and interests of the life and property of the subject of personal information or other individuals; it is difficult to get my consent;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Sharing and maintaining major legitimate rights and interests but difficult to get personal information that I agree, without asking for consent."}
{"task": "rw_57.jsonl", "id": 57332, "text": "The subject of personal information disclose personal information to the public by themselves;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "If the subject of personal information disclose personal information to the public by itself, no consent is required."}
{"task": "rw_57.jsonl", "id": 57333, "text": "Collect personal information from legal public information, such as legal news reports, government information disclosure and other channels", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "If you collect personal information from the legal disclosure information, you do not need to ask for consent."}
{"task": "rw_57.jsonl", "id": 57334, "text": "Implement news reports, public opinion supervision and other behaviors for public interests, and handle personal information within a reasonable range;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "In order to implement news reports and supervision of public opinion, if you handle personal information within a reasonable range, you do not need to solicit consent."}
{"task": "rw_57.jsonl", "id": 57335, "text": "Other circumstances stipulated in the law.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "If shared in other circumstances stipulated in the law, there is no need to solicit consent."}
{"task": "rw_57.jsonl", "id": 57336, "text": "6. Your rights", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57337, "text": "During your use of the national K song, in order to make you more conveniently inquire about access, delete, and correct your personal information, while ensuring your consent and the right to cancel your account of your personal information, we provide you with the corresponding product design in the product design.Operation settings, you can refer to the following guidelines for operation.", "label": ["Important", "Edit/Control"], "rewrite": "In order to more conveniently query access, delete, correct your personal information, while ensuring your right to withdraw consent and cancel your account, we provide the corresponding operation settings in product design."}
{"task": "rw_57.jsonl", "id": 57338, "text": "In addition, we have set up a complaint report channel, and your opinions will be dealt with in a timely manner.", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57339, "text": "6.1 Visit personal information", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57340, "text": "6.1.1, visit QQ number, avatar, nickname, associated driver number and other basic information:", "label": ["Important", "Edit/Control"], "rewrite": "You can access basic information such as QQ numbers, avatars, nicknames, and associated power numbers."}
{"task": "rw_57.jsonl", "id": 57341, "text": "1) Click on the bottom navigation bar [mine];", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57342, "text": "2) Display avatars and nicknames in the middle of the page;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57343, "text": "3) Click on the upper left corner of the page [Settings];", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57344, "text": "4) Click on the top of the page to enter the [Account Management] page;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57345, "text": "5) Click [Edit Information] to display basic information such as nicknames and gender;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57346, "text": "6) Click [related QQ account number] and [associated power number] to display related QQ numbers and related information related information.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57347, "text": "6.1.2, visit comments, gift messages, private messages, recent listeners:", "label": ["Important", "Edit/Control"], "rewrite": "You can access comments, gift messages, private messages, recent listeners."}
{"task": "rw_57.jsonl", "id": 57348, "text": "1) Click on the bottom navigation bar [Message];", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57349, "text": "2) [Comments and Like], [Gift Message], [Private News], [Recent Listener] can access reviews, gift messages, private messages, and recent audiences.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57350, "text": "6.1.3 Dynamic, works:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57351, "text": "1) Click on the bottom navigation bar [mine];", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57352, "text": "2) Click [Dynamic] and [Works] in the middle of the page to access dynamics and works, respectively.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57353, "text": "6.2 Delete personal information", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57354, "text": "6.2.1 Delete [Dynamic, works, accompaniment and chorus]:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57355, "text": "1) Click on the bottom navigation bar [mine];", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57356, "text": "2) In the middle of the page, [Dynamic], [Works] Tap to delete it under TAB.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57357, "text": "6.2.2 Delete [Fans]:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57358, "text": "1) Click on the bottom navigation bar [mine];", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57359, "text": "2) In the middle of the page, click [Fans];", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57360, "text": "3) Click \"Batch Management\" in the middle of the [Fan] page for deletion.", "label": ["Important", "Edit/Control"], "rewrite": "Click \"Batch Management\" in the middle of the [Fan] page to delete it."}
{"task": "rw_57.jsonl", "id": 57361, "text": "6.3 Correct personal information", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57362, "text": "6.3.1, change [personal information]:", "label": ["Important", "Edit/Control"], "rewrite": "You can change [Personal Information]."}
{"task": "rw_57.jsonl", "id": 57363, "text": "1) Click on the bottom navigation bar [mine];", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57364, "text": "2) Click [Avatar] to select [Edit Personal Information];", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57365, "text": "3) In the page, correct personal information.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57366, "text": "6.4 Manage information display to other users", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57367, "text": "6.4.1, management access records, online status, iron powder list, song room status, mobile phone model, display function of playing mini -games", "label": ["Important", "Edit/Control"], "rewrite": "You can manage access records, online status, iron powder list, singing room status, mobile phone model, display function of playing mini -games."}
{"task": "rw_57.jsonl", "id": 57368, "text": "1) Click on the bottom navigation bar [mine];", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57369, "text": "2) On the top of the page, click [Settings];", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57370, "text": "3) Click [Privacy Rights] in the middle of the page;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57371, "text": "4).Game] Close or turn on the corresponding information display.", "label": ["Important", "Edit/Control"], "rewrite": "Click [Invisible Interview], [Hide My Online Status], [Hide my iron powder list], [Hide my singing room status], [Show my mobile phone model], [Hide the mini -game I am playing] to close it] Turn offOr turn on the corresponding information display."}
{"task": "rw_57.jsonl", "id": 57372, "text": "6.4.2 Management of gift wall information", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57373, "text": "1) Click on the bottom navigation bar [mine];", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57374, "text": "2) On the top of the page, click [Settings];", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57375, "text": "3) Click [Privacy Rights] in the middle of the page;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57376, "text": "4) Click [Gift Wall related privacy];", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57377, "text": "5), click [Hide My Gift Wall], [Hide My Gift Wall Gift List] Close or open the corresponding information display.", "label": ["Important", "Edit/Control"], "rewrite": "Click [Hide My Gift Wall], [Hide My Gift Wall Gift List] Close or open the corresponding information display."}
{"task": "rw_57.jsonl", "id": 57378, "text": "6.4.3 Management Friends Rankings", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57379, "text": "1) Click on the bottom navigation bar [mine];", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57380, "text": "2) On the top of the page, click [Settings];", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57381, "text": "3) Click [Privacy Rights] in the middle of the page;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57382, "text": "4) Click [Friends Ranking Version Privacy];", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57383, "text": "5), click [Hide my song recording time information] to close or open the corresponding information display.", "label": ["Important", "Edit/Control"], "rewrite": "Click [Hide my song recording information] Close or open the corresponding information display."}
{"task": "rw_57.jsonl", "id": 57384, "text": "6.4.4 Management attention and fan list", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57385, "text": "1) Click on the bottom navigation bar [mine];", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57386, "text": "2) On the top of the page, click [Settings];", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57387, "text": "3) Click [Privacy Rights] in the middle of the page;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57388, "text": "4) Click [Who can't see my attention, list of fan];", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57389, "text": "5), click [My Follow], [My Fans], [My QQ Friends], [My WeChat Friends], [Other] to manage other users' access to your information.", "label": ["Important", "Edit/Control"], "rewrite": "Click [My Follow], [My Fans], [My QQ Friends], [My WeChat Friends], [Other] to manage other users' access to your information."}
{"task": "rw_57.jsonl", "id": 57390, "text": "6.5 Close directional push and personalized advertisements", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57391, "text": "6.5.1 Close the directional push function", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57392, "text": "1) Click on the bottom navigation bar [mine];", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57393, "text": "2) On the top of the page, click [Settings];", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57394, "text": "3), click [Privacy Rights] in the middle of the page, click [Recommended Related] to close the [Personalized Recommendation Switch].", "label": ["Important", "Edit/Control"], "rewrite": "Click [Privacy Rights] in the middle of the page, and click [Recommended Related] to close the [Personalized Recommended Switch]."}
{"task": "rw_57.jsonl", "id": 57395, "text": "6.5.2 Close personalized ads", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57396, "text": "1) Click on the bottom navigation bar [mine];", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57397, "text": "2) On the top of the page, click [Settings];", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57398, "text": "3) Click [Privacy Rights] in the middle of the page, click [Personalized Advertising Management] to close [Personalized Advertising]", "label": ["Important", "Edit/Control"], "rewrite": "Click [Privacy Rights] in the middle of the page, and click [Recommended Related] to close the [Personalized Recommended Switch]."}
{"task": "rw_57.jsonl", "id": 57399, "text": "6.6 Withdrawal of consent", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57400, "text": "6.6.1, you can find the national K song through the application management in the mobile phone settings, enter the authority management interface to close the relevant authority authorization to close your consent.", "label": ["Important", "Edit/Control"], "rewrite": "You can enter the authority management interface to close the relevant permissions authorization to withdraw to withdraw your consent."}
{"task": "rw_57.jsonl", "id": 57401, "text": "6.6.2, you can also contact us to withdraw your consent through Article 10 of this guideline.", "label": ["Important", "Edit/Control"], "rewrite": "You can also contact us to withdraw your consent through Article 10 of this guideline."}
{"task": "rw_57.jsonl", "id": 57402, "text": "6.7 Exit login and cancel account number", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57403, "text": "6.7.1 Exit the related account login:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57404, "text": "1) Click on the bottom navigation bar [mine];", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57405, "text": "2) On the top of the page, click [Settings];", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57406, "text": "3) At the bottom of the page, click [Exit the current account].", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57407, "text": "6.7.2 Logging out account:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57408, "text": "1) Click on the bottom navigation bar [mine];", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57409, "text": "2) On the top of the page, click [Settings];", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57410, "text": "3) On the top of the page, click [Help and Feedback];", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57411, "text": "4) In the related column of the account, click [How to cancel the login account of the K song of the whole people] and cancel it according to the guidelines.", "label": ["Important", "Edit/Control"], "rewrite": "In the account -related column, click [How to cancel the login account of the National K song] and cancel it in accordance with the guidelines."}
{"task": "rw_57.jsonl", "id": 57412, "text": "6.8 Complaint Report", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57413, "text": "6.8.1 Complaint report path:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57414, "text": "1) After entering the [Mine] page, click the [Settings] icon;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57415, "text": "2) Click [Help and Feedback];", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57416, "text": "3) Click [I want feedback];", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57417, "text": "4) Enter the content of your complaint and click [Submit feedback].", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57418, "text": "7. Change", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57419, "text": "We may amend the guidelines for privacy protection in a timely manner.", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57420, "text": "When the terms of the guidelines for privacy protection are changed, we will prompt you to prompt you the change of privacy protection guidance after the version update, and explain the effective date after the change.", "label": ["Policy Change", "Important"], "rewrite": "When the terms of the guidelines for privacy protection are changed, we will prompt you to the change of privacy protection guidelines when the version is updated, and explain to you\nEssence"}
{"task": "rw_57.jsonl", "id": 57421, "text": "Please read the content of the privacy protection guidelines carefully, and you continue to use the national K song to indicate that you agree to deal with your personal information according to the updated privacy protection guidance.", "label": ["Policy Change", "Important"], "rewrite": "You continue to use the national K song to indicate that you agree to handle personal information according to the updated privacy protection guidelines."}
{"task": "rw_57.jsonl", "id": 57422, "text": "8. Minor protection", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57423, "text": "We attach great importance to the protection of personal information of minors.", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57424, "text": "In accordance with the provisions of relevant laws and regulations, we must require minors under the age of 14 to obtain the authorized consent of their guardians (such as their parents) before using the service of the national K song or providing personal information to us;", "label": ["Specific Audiences", "Important"], "rewrite": "Minors under the age of fourteen should obtain the authorization consent of their guardian before using services or providing personal information."}
{"task": "rw_57.jsonl", "id": 57425, "text": "Minors who have reached the age of 14, who are under eighteen, can obtain the authorization consent or self -authorization consent of their guardian in advance.", "label": ["Specific Audiences", "Important"], "rewrite": "Minors who have reached the age of 14, under the age of eighteen, can obtain the consent of the guardian or the consent of their own authorization in advance."}
{"task": "rw_57.jsonl", "id": 57426, "text": "We only use, provide or need to protect minors, provide or openly disclose the information in the case of laws and regulations, the guardian of minors, or the need to protect minors.", "label": ["Specific Audiences", "Important"], "rewrite": "Only in the case of laws and regulations, the guardians of minors clearly agree, or need to protect minors, provide or openly disclose the information."}
{"task": "rw_57.jsonl", "id": 57427, "text": "If you are the guardian of the minor, please pay attention to whether the minor you guarded will use the service of the national K song after obtaining your authorization consent.", "label": ["Specific Audiences", "Important"], "rewrite": "The guardian of minors, please pay attention to whether the minor uses the service of the national K song after obtaining the authorization consent."}
{"task": "rw_57.jsonl", "id": 57428, "text": "If you have doubts about the personal information of the minors you monitor, please contact us through the contact information in Section 10.", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57429, "text": "For more related privacy protection for minors, please refer to the \"Child Privacy Protection Statement\"", "label": ["Specific Audiences", "Important"], "rewrite": "For the privacy protection of minors, see the \"Child Privacy Protection Statement\"."}
{"task": "rw_57.jsonl", "id": 57430, "text": "9. Others", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57431, "text": "Tencent's \"Privacy Policy\" is a generally applicable general privacy clause. Among them, the user rights and information security guarantee measures stipulated in them are applicable to users of the national K song.", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57432, "text": "For example, Tencent's \"Privacy Policy\" is inconsistent or contradictory with the guidance of this privacy protection, please refer to the guidelines of this privacy protection.", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57433, "text": "10. Contact us", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57434, "text": "When you have other complaints, suggestions, and personal information related to the minor, please pass, http://kf.qq.com/, contact us.", "label": ["Important", "Contact Information"], "rewrite": "Please contact us through http://kf.qq.com/."}
{"task": "rw_57.jsonl", "id": 57435, "text": "You can also send your question to dataprivacy@tencent.com or send it to the following address:", "label": ["Important", "Contact Information"], "rewrite": "You can also send your question to dataprivacy@tencent.com."}
{"task": "rw_57.jsonl", "id": 57436, "text": "Building D3 12F, D3 Building D3 in Nanshan District, Nanshan District, Shenzhen, Guangdong Province, China", "label": ["Important", "Contact Information"], "rewrite": "Contact address: 12F Tencent Music Legal Affairs (receiving), D3, D3, D3, D3, Nanshan District, Nanshan District, Shenzhen, Guangdong Province."}
{"task": "rw_57.jsonl", "id": 57437, "text": "Postcode: 518057", "label": ["Important", "Contact Information"], "rewrite": "Postal code: 518057."}
{"task": "rw_57.jsonl", "id": 57438, "text": "We will review the issues involved as soon as possible and answer your request within 15 working days or laws and regulations.", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57439, "text": "Shenzhen Tencent Computer System Co., Ltd.", "label": [], "rewrite": []}
{"task": "rw_57.jsonl", "id": 57440, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
