{"task": "rw_5.jsonl", "id": 38155, "text": "ARK Games Privacy Protection Policy", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38156, "text": "You are welcome to choose the ARK Games game provided by ARK Games (hereinafter referred to as \"we\").", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38157, "text": "In order to provide you with more accurate and more personalized services, we will use and disclose your relevant information in accordance with the relevant provisions of the ARK Games Privacy Protection Policy. This policy describes that you use any game or application in your useWhen using other services, we collect, use, disclose information (including your personal data) and other methods.", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38158, "text": "Before using ARK Games, please be sure to read and thoroughly understand this policy, especially the clauses that are identified by threading in the body/oblique body. You should focus on reading and start using it after confirming and agreeing.", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38159, "text": "If you are a child or minor, please notify your guardian to read the policy together.", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38160, "text": "If you do not agree with the content of this policy, it may cause ARK, Games game services to be unable to run normally or to achieve our service effects, you should immediately stop access/use our services.", "label": ["Policy Change", "Important"], "rewrite": "If you do not agree with the content of this policy, it may cause abnormal operation or cannot achieve the effect, and you should stop access/use immediately."}
{"task": "rw_5.jsonl", "id": 38161, "text": "If you use or continue to use ARK, the service of the game game, you agree that you agree that we collect, use, store, share, and transfer your personal information in accordance with this policy.", "label": ["Policy Change", "Important", "Risk"], "rewrite": "If you use or continue to use, you agree that you agree to be subject to this policy."}
{"task": "rw_5.jsonl", "id": 38162, "text": "After you read this policy, if you have any questions about this policy, you can contact us through Tousu@rkgames.com, and we will answer it as soon as possible for you.", "label": ["Important", "Contact Information"], "rewrite": "Email: Tousu@arkgames.com."}
{"task": "rw_5.jsonl", "id": 38163, "text": "This policy is an integral part of the ARK Games User Service Agreement. The main points are as follows:", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38164, "text": "1. In order to provide you with gaming entertainment and services such as interaction and consumption related to this, we need to collect your equipment information, login logs and other information.", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38165, "text": "2. In order to better protect the physical and mental health of minors, promote the healthy access to the Internet for minors, and maximize the minors from using the identity information of others. ARK and Games need to collect your true identity information for identity testing.", "label": ["Important", "First Party Collection Information"], "rewrite": "ARK Games needs to collect your true identity information for identity verification to protect minors."}
{"task": "rw_5.jsonl", "id": 38166, "text": "3. You can manage your personal information and related authorization according to the policy.", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38167, "text": "4. We use multi -directional security protection measures to ensure that your personal information protection is at a reasonable level of security.", "label": ["Important", "Data Security"], "rewrite": "We use multi -directional security measures to protect your personal information."}
{"task": "rw_5.jsonl", "id": 38168, "text": "5. You can understand how we collect your personal information and how to use your personal information through this policy.", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38169, "text": "This policy will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38170, "text": "1. The way we collect and use personal information to use personal information", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38171, "text": "2. We shared, transferred, or publicly disclosed the way of personal information", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38172, "text": "3. Storage of personal information", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38173, "text": "4. Information security", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38174, "text": "5. How to exercise your personal information related rights", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38175, "text": "6. Change", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38176, "text": "7. Minor protection", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38177, "text": "8. Others", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38178, "text": "9. Contact us", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38179, "text": "First, the way we collect and use personal information", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38180, "text": "(1) The way we get your personal information", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38181, "text": "1. You actively provide information", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38182, "text": "(1), when you register the account number of ARK, Games games or use ARK, Games game services, provide us information;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the information you provided when you register an account or use the game service."}
{"task": "rw_5.jsonl", "id": 38183, "text": "(2), the shared information provided by other parties through ARK, Games games or services, as well as the information stored when you use ARK, Games games and services.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the shared information provided by you through the ARK Games game or service, and the information stored when you use it."}
{"task": "rw_5.jsonl", "id": 38184, "text": "Please note that if you are uploaded or published in the open area where you can see or published in the open area where you are visible to other users in ARK, Games games, and your information presented in response to other people uploaded or published, these information mayColored and used by others.", "label": ["Important", "First Party Collection Information"], "rewrite": "The information you uploaded or published in the open area, your information presented in the response you uploaded or published by others may be collected and used by others."}
{"task": "rw_5.jsonl", "id": 38185, "text": "When you find that others collect or use your information, you can contact us through the feedback channels listed in the chapter listed in the chapter of this policy.", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38186, "text": "2. Information obtained from third parties", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38187, "text": "(1), we may obtain the account information (including the unique logo, avatar, nickname) of your authorized sharing from a third party to preserve your information, and after you agree with this policy, your third -party account and your ARK, Games game or service account binding, allowing you to log in directly and use ARK, Games games and services through a third -party account.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "We may obtain the account information of your authorized sharing from a third party and bind it."}
{"task": "rw_5.jsonl", "id": 38188, "text": "(2) Publicized information: such as public resources such as government databases.", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38189, "text": "(2) We will collect and use your personal information for the following goals:", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38190, "text": "1. Help you complete the registration and login", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38191, "text": "In order to create your account, username and password, you need to provide basic registration or login information, including personal phone numbers and third -party account authorization information.", "label": ["Important", "First Party Collection Information"], "rewrite": "To create your account, username and password, you need to provide basic registration or login information."}
{"task": "rw_5.jsonl", "id": 38192, "text": "Personal phone numbers are sensitive information, and we will use strictly in accordance with the provisions of this policy.", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38193, "text": "You can also fill in or supplement your other additional information (such as your nickname, avatar, gender) in the process of registering, logging in or subsequent use, which will help us provide you with personalized recommendations and better services to youExperience, but if you do not provide this information, it will not affect your basic functions of using ARK, Games game services.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can also fill in or supplement your other additional information during the registration, login or subsequent use."}
{"task": "rw_5.jsonl", "id": 38194, "text": "2. Implement identity authentication", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38195, "text": "In accordance with relevant laws and regulations and regulatory requirements, or in order to meet the needs of user identity, guarantee systems and service security, and other specific service functions, we may need you to provide real identity information, equipment information (such as, name, ID number))To complete identity certification.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may need you to provide real identity information and equipment information to complete your identity authentication."}
{"task": "rw_5.jsonl", "id": 38196, "text": "If you do not provide the above information, we will not be able to provide you with related functions and services.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38197, "text": "In order to achieve the purpose of identity certification, you agree and authorize that we can provide, inquire, and check your aforementioned identity information on our own or entrusted to the third direction of the relevant identity authentication agency (such as personal credit reporting agencies, government departments, etc.).", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to achieve the purpose of identity certification, you agree and authorize that we can provide, query, and check your aforementioned identity information on our own or entrust our third direction."}
{"task": "rw_5.jsonl", "id": 38198, "text": "Real identity is sensitive information, and we will use strictly in accordance with the provisions of this policy.", "label": ["Important", "Usage"], "rewrite": "Real identity is sensitive information, and we will use strictly in accordance with the provisions of this policy."}
{"task": "rw_5.jsonl", "id": 38199, "text": "3. Maintain the normal operation of the basic functions of the game", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38200, "text": "In the process of using our service, in order to identify the abnormal state of the account, understand the product adaptability, maintain the normal operation of basic functions, protect your personal virtual props, and cooperate with the review of the relevant government departments, we may automatically collect and store you about youThe service and the information of the use method are associated with this information. This information and purpose include:", "label": ["Important", "First Party Collection Information"], "rewrite": "We may automatically collect and store information about your use and use methods and associate this information."}
{"task": "rw_5.jsonl", "id": 38201, "text": "(1) Service log information: When you use our service, we may automatically collect your detailed usage of our services as related online logs.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use our services, we may automatically collect your detailed usage as a related network log."}
{"task": "rw_5.jsonl", "id": 38202, "text": "Such as: game log information, such as login logs, items logs, game -to -game information, etc., so that you can view your game history records on the client.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect game log information so that you can view your game history records on the client."}
{"task": "rw_5.jsonl", "id": 38203, "text": "At the same time for game operation statistical analysis, customer service complaint processing, and other game security analysis.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect game log information for game operation statistical analysis, customer service complaint processing, and other game security analysis."}
{"task": "rw_5.jsonl", "id": 38204, "text": "In addition, in order to enhance your gaming experience, we may synchronize the aforementioned information to the game's subsequent version or other products you are providing.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may synchronize the aforementioned information to the game's subsequent version or other products you are using."}
{"task": "rw_5.jsonl", "id": 38205, "text": "(2) Device information: We may receive and record the device -related information you use according to the specific permissions you granted in the software installation and use.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may receive and record the equipment related information you use according to the specific permissions you have."}
{"task": "rw_5.jsonl", "id": 38206, "text": "Such as your IMEI, Mac, device models, operating systems and versions, client versions, device resolution, package name, equipment settings, unique device identifiers, software and hardware feature information), the relevant information of the device location (such as IP address, IP address, GPS position, and WLAN access point, Bluetooth and base station sensor information that can provide relevant information).", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38207, "text": "We collect this information to provide you with basic services and basic functions.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38208, "text": "We only obtain the above permissions under the necessary situation and at the minimum range.", "label": ["Permission Acquisition", "Important", "Data Security"], "rewrite": "We only obtain the above permissions under the necessary situation and at the minimum range."}
{"task": "rw_5.jsonl", "id": 38209, "text": "Please note that separate equipment information and log information are information that cannot recognize specific natural person status.", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38210, "text": "If we use this type of non -personal information with other information to identify a specific natural person, or use it with personal information, during the combination of use, such non -personal information will be regarded as personal information.", "label": ["Important"], "rewrite": "If we use this type of non -personal information with other information to identify a specific natural person, or use it with personal information, during the combination of use, such non -personal information will be regarded as personal information."}
{"task": "rw_5.jsonl", "id": 38211, "text": "This type of information will be handled and protected as your personal information in accordance with this policy.", "label": ["Important"], "rewrite": "This type of information will be handled and protected as your personal information in accordance with this policy."}
{"task": "rw_5.jsonl", "id": 38212, "text": "Unless you obtain your authorization or laws and regulations, we will anonymous and de -identify this type of personal information.", "label": ["Important", "Data Security"], "rewrite": "Unless you obtain your authorization or laws and regulations, we will anonymize and logo the equipment information and log information."}
{"task": "rw_5.jsonl", "id": 38213, "text": "4. Help you complete the order, pay and deliver the goods or services to you", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38214, "text": "(1) When you buy products and/or services in the ARK Games game, we will use the system to generate orders for you to buy the product and/or service.", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38215, "text": "In the process of placement, you may need to provide personal identity information, name, and payment status information.", "label": ["Important", "First Party Collection Information"], "rewrite": "In the process of placement, you may need to provide personal identity information, name, and payment status information."}
{"task": "rw_5.jsonl", "id": 38216, "text": "If you do not perform real -name authentication, the ARK Games game will refuse to provide you with purchase services.", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38217, "text": "The relevant information you pay may need to be confirmed according to the payment method you choose and the payment channel. Once you choose the corresponding payment channel, you will provide it with the payment related to the payment, such as the bank card account.", "label": ["Important", "First Party Collection Information"], "rewrite": "The relevant information you pay may provide information related to payment based on the payment method you choose and the payment channel."}
{"task": "rw_5.jsonl", "id": 38218, "text": "ARK, Games games will not ask you for any personal information related to payment information. You need to confirm whether you authorize your choice of payment channels and provide your payment related information to this channel.", "label": ["Important", "First Party Collection Information"], "rewrite": "You need to confirm whether you authorize the payment channel you choose and provide your payment related information to the channel."}
{"task": "rw_5.jsonl", "id": 38219, "text": "(2), to show your account order information to facilitate your management of orders, we will collect the order information you generate during the use of ARK, Games games or service (such as the product or service information, specific order number you purchased, the specific order number you buy, specific order number, Order creation time, transaction amount);", "label": ["Important", "First Party Collection Information"], "rewrite": "To show the order information of your account to make it easy for you to manage the order, we will collect your order information."}
{"task": "rw_5.jsonl", "id": 38220, "text": "(3) In order to complete the order payment, delivery products or services, confirm the transaction status, and provide you with after -sales and dispute solutions, we will collect and transaction progress related to the transaction objects selected by the exchange based on the exchanges.Accounts, orders, transactions, payment, or share your transaction information with the above -mentioned service providers.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "We will collect your accounts, orders, transactions, payment, or payment related to the transaction progress based on the transaction objects, payment institutions, etc. selected by the exchange, or share your transaction information with the service provider."}
{"task": "rw_5.jsonl", "id": 38221, "text": "(4) When you use the consumption function of the game product, we will collect information such as your recharge records, consumption records, etc., so that you can check your transaction records and protect your virtual items to the greatest extent.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the consumption function of the game product, we will collect information such as your recharge records, consumption records."}
{"task": "rw_5.jsonl", "id": 38222, "text": "The recharge record and consumption record are sensitive information. Collecting the above information is necessary to achieve the consumption function of the game products, otherwise the transaction will not be completed.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect recharge records and consumer records as necessary for the consumption function of game products."}
{"task": "rw_5.jsonl", "id": 38223, "text": "5. Realize game interactive functions.", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38224, "text": "(1) When you interact with other players through text, pictures, voice, videos, and other methods in the game, we may collect and save the above information content you sent to filter pornography, violence, politics, abuse, maliciousImproper content such as advertising to purify the game environment and maintain a healthy Internet environment.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you interact with other players in the game, we may collect and save the information you sent."}
{"task": "rw_5.jsonl", "id": 38225, "text": "(2) If you want to interact with nearby gamers, after you authorize and agree with our geographical authority, we will collect your geographical location information to find nearby gamers, so that you can match with nearby players, to match nearby players, to match nearby players, matching nearby players, and matching players nearby.Team and wait.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you want to interact with nearby gamers, we will collect your geographical location information after you authorize your consent."}
{"task": "rw_5.jsonl", "id": 38226, "text": "Geographical location information is a sensitive personal information. Refusing to provide this information will only cause you to be unable to interact with nearby gamers, but it does not affect other functions of using ARK and Games games normally. You can also cancel your geographical location information authorization at any time.Essence", "label": ["Important", "First Party Collection Information", "Edit/Control"], "rewrite": "Refusing to provide geographical information can only cause you to be unable to interact with nearby gamers and does not affect other functions. You can cancel authorization at any time."}
{"task": "rw_5.jsonl", "id": 38227, "text": "6. Provide you with customer service or other user response functions", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38228, "text": "When you contact our customer service or use other users to respond to functions (such as selling after -sale after sale, personal information protection complaints or suggestions, other customer complaints and needs), we may need you to provide the necessary personal informationUser identity to ensure your account and system security.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you contact your customer service or use other users to respond, you may need to provide the necessary personal information to verify your identity."}
{"task": "rw_5.jsonl", "id": 38229, "text": "We may also save your contact information (you use us when you contact us or other contact information you provide to us), you have the communication/call records and content with our communication, and other necessary information associated with your needs.In order to contact you or help you solve the problem, or record the processing schemes and results of related issues.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may save your contact information with our communication/call records and content, and other necessary information associated with your needs in order to solve the problem for you or record the processing results."}
{"task": "rw_5.jsonl", "id": 38230, "text": "7. Import to you", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38231, "text": "We may send you notifications related to service -related notifications when we must suspend, change, and terminate a single service due to system maintenance.", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38232, "text": "Therefore, we may collect your personal phone number, email, and device information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may collect your personal phone number, email, and device information."}
{"task": "rw_5.jsonl", "id": 38233, "text": "We may push you information or promotion information you are interested in.", "label": ["Usage"], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38234, "text": "If you do not want to continue the message we push, you can ask us to stop pushing. For example, according to the SMS withdrawal guidelines, we need to stop sending promotion SMS, or settings in mobile devices, and no news of our push.", "label": ["Edit/Control", "Important"], "rewrite": "If you don't want to continue the message we push, you can ask us to stop pushing."}
{"task": "rw_5.jsonl", "id": 38235, "text": "If the above channels do not solve your problem, you can also notify me to stop sending notification/closing orientation notifications through tousu@arkgames.com.", "label": ["Important", "Contact Information"], "rewrite": "Email: Tousu@arkgames.com."}
{"task": "rw_5.jsonl", "id": 38236, "text": "8. Provide you with personalized needs", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38237, "text": "In order to provide you with localized content or to provide you with games, advertisements and other personalized viewing recommendations we think you will be interested in, we may collect and use your geographical location, and the geographical location is sensitive information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may collect and use your geographical location, thinking that you provide localized content or make personalized recommendations."}
{"task": "rw_5.jsonl", "id": 38238, "text": "We will protect your sensitive information strictly in accordance with this policy.", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38239, "text": "In addition to geographical positions, we may also collect the following information:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38240, "text": "(1), your advertising information: advertising identifiers, such as mobile devices, tablets, and streaming media equipment containing the advertising identifier of such identifiers;", "label": ["Important", "First Party Collection Information"], "rewrite": "We may collect your advertising information, software information, and your purchase records in our service/game, thinking that you make personalized recommendations."}
{"task": "rw_5.jsonl", "id": 38241, "text": "Information collected through cookies, network beacons and other technologies, including advertising data, etc. (such as advertising availability and release situation, website URL, date and time, etc.).", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38242, "text": "(2) Your software information: such as software features (including software types and configurations), connection information, page views statistics, reference sources (such as reference URL), IP address (may tell us your general position), browser), browserwait.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38243, "text": "(3) Purchase records in our service/game.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38244, "text": "If we think it is necessary, we may be based on your above information to determine the personalized recommendation of the content you are interested in. If you don't like this service, you can directly close or close this item through the relevant settings in our service/gameServices (if.) Usually, the position of the personalized recommendation of personalized recommendations in the game is: setting-more settings-personalized recommendation/personalized settings (please judge independently according to the actual situation of each game).", "label": ["Important", "Edit/Control"], "rewrite": "You can directly close or through the related settings in the service/game: setting-more settings-personalized recommendation/personalized settings."}
{"task": "rw_5.jsonl", "id": 38245, "text": "If the above settings fail to meet your requirements, you can also contact us to cancel the directional push by contacting us through the mailbox. We will provide you with non -fixed push.", "label": ["Important", "Contact Information"], "rewrite": "Email: Tousu@arkgames.com."}
{"task": "rw_5.jsonl", "id": 38246, "text": "Please note that we only provide personalized recommendations in some services/games. You turn off personalized recommendations and will not reduce the recommended content, but this service/game will no longer recommend personalized content to you.", "label": ["Important", "Usage"], "rewrite": "You turn off personalized recommendations and will not reduce the recommended content, but this service/game will no longer recommend personalized content to you."}
{"task": "rw_5.jsonl", "id": 38247, "text": "9. Service optimization:", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38248, "text": "(1) In order to analyze and understand our users, improve our services (including our user interface experience), optimize content selection, recommendation algorithm and delivery;", "label": ["Usage"], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38249, "text": "You agree that we may share your personal information with a third party for data analysis. At the same time, we will sign a strict confidentiality agreement with a third party, asking third parties to take technical measures and other means to ensure that the data shared with third parties will not be leaked or will not be leaked or will not be leaked or will not be leaked or will not be leaked or will not be leaked or will not be leaked or will not be leaked or will not be leaked.Used for other purposes.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "You agree that we may share your personal information with a third party for data analysis. At the same time, we will sign a confidentiality agreement with it and ask for technical measures and other means to ensure your information security."}
{"task": "rw_5.jsonl", "id": 38250, "text": "(2), we will analyze the operation of our products based on the frequency and situation of the product's products, fault information, performance information, etc. to ensure the safety of services, optimize our products, and improve our service quality.", "label": ["Important", "Usage"], "rewrite": "We will optimize our products based on the frequency and situation of the product, the fault information, and the performance information of the user to improve our service quality."}
{"task": "rw_5.jsonl", "id": 38251, "text": "However, we will anonymize or logo the relevant information after it is used for analysis. We will not combine the information we store in the analysis software with the personal identity information you provided.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "We will use relevant information to be anonymous or de -identified for analysis, and will not combine the information stored in the analysis software with the personal identity information you provided."}
{"task": "rw_5.jsonl", "id": 38252, "text": "(3) In order to better provide you with game services and improve the game experience, we can be nicknames, avatars, and related operating information, game information in the game (specifically but not limited to your login status, Battle Information/Status, Achievement Information, etc.).", "label": ["Important", "Usage"], "rewrite": "In order to better provide game services and improve the game experience, we can use the nicknames, avatars, and related operating information and game information in the game account."}
{"task": "rw_5.jsonl", "id": 38253, "text": "You agree that we may provide attribution analysis to third parties.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You agree that we may provide attribution analysis to third parties."}
{"task": "rw_5.jsonl", "id": 38254, "text": "However, we will anonymize or logo the relevant information after it is used for analysis. We will not combine the information we store in the analysis software with the personal identity information you provided.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "We will use the information to be anonymous or de -identified for analysis, and we will not combine the information stored in the analysis software with the personal identity information you provide."}
{"task": "rw_5.jsonl", "id": 38255, "text": "10. You understand and agree that some single services may require you to open specific access rights in your device to achieve the collection and use of information involved in these permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "Some single services may require you to turn on specific access permissions in your device."}
{"task": "rw_5.jsonl", "id": 38256, "text": "We will not ask you to open the ownership at one time. Only when you use some of the functions we provide, we ask for the use of corresponding permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "We will not ask you to open the ownership at one time. Only when you use a certain function, we ask for the use of the corresponding permissions."}
{"task": "rw_5.jsonl", "id": 38257, "text": "We may apply for the following permissions:", "label": ["Permission Acquisition", "Important"], "rewrite": "We may apply for the following permissions:"}
{"task": "rw_5.jsonl", "id": 38258, "text": "(1) After you turn on the album and/or camera (camera) permissions, you can upload, take photos/pictures/videos, realize screenshots or provide proof of communication with customer service;", "label": ["Permission Acquisition", "Important"], "rewrite": "After you turn on the album and/or camera (camera) permissions, you can upload and take photos/pictures/videos."}
{"task": "rw_5.jsonl", "id": 38259, "text": "(2) After you turn on the microphone, recording and related voice rights, you can use voice functions to interact with our products or others, or contact customer service;", "label": ["Permission Acquisition", "Important"], "rewrite": "After you turn on microphone, recording and related voice rights, you can use voice functions to interact with information, or contact customer service."}
{"task": "rw_5.jsonl", "id": 38260, "text": "(3) After you open the position permissions, we can get your location information (may include accurate locations and rough locations, and location information is sensitive information) to achieve information interaction with friends nearby and push you personality to youCouncil, distinguish between users in different regions and carry out data statistics and refined operations, and open the rankings.", "label": ["Permission Acquisition", "Important"], "rewrite": "After you open your position permissions, we can get your location information so that you can interact with nearby friends and push you personalized content to you."}
{"task": "rw_5.jsonl", "id": 38261, "text": "(4) After you open the permissions that we can read/write to your calendar, we can get your schedule to provide you with functions such as records and reminders.", "label": ["Permission Acquisition", "Important"], "rewrite": "After you start the calendar authority, we can obtain your schedule in order to provide you with functions such as records, reminders."}
{"task": "rw_5.jsonl", "id": 38262, "text": "(5) After you turn on, modify, write SD permissions or storage permissions, we will download game resources and store on the SD card or mobile phone storage space.", "label": ["Permission Acquisition", "Important"], "rewrite": "After you turn on the storage authority, we will download the game resources and store it on the SD card or the mobile phone storage space."}
{"task": "rw_5.jsonl", "id": 38263, "text": "(6) When you copy the information in the product for sharing or receive the information shared in the product, we need to visit your shear plate locally to read the password, redemption code and other related information.It is used to realize functions such as welfare acquisition, activity participation and sharing.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you copy the information for sharing, we need to access your shear plate to read the password, redemption code and other related information."}
{"task": "rw_5.jsonl", "id": 38264, "text": "We will only read the information related to our services to complete the relevant instructions and do not store such information.", "label": ["Data Retention", "Permission Acquisition", "Important"], "rewrite": "We will only read the information related to our services to complete the relevant instructions and do not store such information."}
{"task": "rw_5.jsonl", "id": 38265, "text": "We will not collect other unrelated information in your shear board.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "We will not collect other unrelated information in your shear board."}
{"task": "rw_5.jsonl", "id": 38266, "text": "(7) Get your SMS permissions, including sending, receiving, and reading text messages. We use SMS permissions to send, receive, and read the verification code to you, and send you specific notifications and marketing information.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "To obtain your SMS permissions, we use SMS permissions to send you, receive, and read the verification code to send you specific notifications and marketing information."}
{"task": "rw_5.jsonl", "id": 38267, "text": "When you need to close these functional authority, most mobile devices will support your needs. For specific methods, please refer to or contact your mobile device service providers or manufacturers.", "label": ["Important", "Edit/Control"], "rewrite": "For specific methods to close these functional permissions, please refer to or contact your mobile device service providers or manufacturers."}
{"task": "rw_5.jsonl", "id": 38268, "text": "Please note that when you start the right of power, it means that you authorize us to collect and use relevant information to provide you with corresponding services. Once you turn off the right of authority, it means that you cancel the authorization.Using relevant information, it is impossible to provide you with the service corresponding to the permissions.", "label": ["Important", "Edit/Control"], "rewrite": "The opening of one authority means that the authorization is authorized to collect and use the relevant information to provide corresponding services. Close the authority to cancel the authorization representative, and no longer continue to collect and use relevant information based on the corresponding permissions."}
{"task": "rw_5.jsonl", "id": 38269, "text": "However, your decision to close permissions will not affect the collection and use of information based on your authorization, and you can contact us to delete your personal information.", "label": ["Permission Acquisition", "Important", "Risk"], "rewrite": "The decision of your closure authority will not affect the collection and use of information based on your authorization."}
{"task": "rw_5.jsonl", "id": 38270, "text": "11. COOKIE or similar technology", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38271, "text": "We may collect your information through Cookie and similar technologies to provide you with a better user experience and ensure service security.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may collect your information through cookies and similar technologies."}
{"task": "rw_5.jsonl", "id": 38272, "text": "By using Cookie, we provide you with a simple and easy -going and personalized network experience.", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38273, "text": "A cookies are a small amount of data, which are sent from a network server to your browser and there are computer hard disks.", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38274, "text": "We use cookies to benefit users.", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38275, "text": "For example, in order to make the ARK Games login process faster, you can choose to exist in a cookies.", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38276, "text": "In this way, when you want to log in to the ARK Games service, it can be more convenient and fast.", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38277, "text": "Cookies can help us determine the pages and content you are connected, and you spend time on ARK Games specific services and the ARK Games game service you choose.", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38278, "text": "We and third -party partners may collect and use your information through cookies or similar technologies and store such information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We and third -party partners may collect and use your information through cookies or similar technologies and store such information."}
{"task": "rw_5.jsonl", "id": 38279, "text": "We use our own cookies or similar technologies for the following uses (specifically based on the services and functions set by specific games):", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38280, "text": "(1) Remember your identity.", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38281, "text": "Cookies or similar technologies help us identify your identity as our registered user, or save you to provide us with your preferences or other information;", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38282, "text": "(2) Analyze the situation of your service.", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38283, "text": "We can use Cookies or similar technologies to learn what activities you use to use, Games game services, or which services are the most popular;", "label": ["Important", "Usage"], "rewrite": "We can use cookies or similar technologies to learn about your preferences using ARK Games game services."}
{"task": "rw_5.jsonl", "id": 38284, "text": "(3) Cookies or similar technologies help us provide you with more interested ads instead of general advertising based on your information.", "label": ["Important", "Usage"], "rewrite": "Cookies or similar technologies help us provide you with ads that you may be more interested in."}
{"task": "rw_5.jsonl", "id": 38285, "text": "When we use Cookies or similar technologies for the above purposes, we may be provided to advertisers and other partners collected through cookies or similar technologies to analyze how you and other users use ARK, Games game services and use it for it for itAdvertising Services.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We may provide non -personal identity information collected through cookies or similar technologies to advertisers and other partners to analyze game services and use advertising services."}
{"task": "rw_5.jsonl", "id": 38286, "text": "There may be Cookies or similar technologies placed by advertisers and other partners in the ARK Games game.", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38287, "text": "These cookies and/or similar technologies may collect non -personal identity information related to you to analyze how users use such services, send ads you may be interested in, or use the effects of advertising services.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Cookies and/or similar technologies may collect non -personal identity information related to you to analyze or send advertisements you are interested in or to evaluate the effect of advertising."}
{"task": "rw_5.jsonl", "id": 38288, "text": "These third -party cookies or similar technologies are collected and used by such information that are not bound by this policy, but are subject to their own information protection statements. We are not responsible for third -party Cookies or similar technologies.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "We are not responsible for third -party Cookies or similar technologies."}
{"task": "rw_5.jsonl", "id": 38289, "text": "You can refuse or manage cookies or similar technologies through a browser or user selection mechanism.", "label": ["Important", "Edit/Control"], "rewrite": "You can refuse or manage cookies or similar technologies through a browser or user selection mechanism."}
{"task": "rw_5.jsonl", "id": 38290, "text": "But please note that if you stop using cookies or similar technologies, we may not be able to provide you with a better service experience, and certain services may not be used normally.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38291, "text": "At the same time, you will still receive advertisements, but these advertisements will be reduced with you.", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38292, "text": "12. Exception of obtaining authorization consent", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38293, "text": "According to relevant laws and regulations, collecting your information in the following situations does not need to obtain your authorization consent:", "label": ["Important", "First Party Collection Information"], "rewrite": "According to relevant laws and regulations, collecting your information in the following situations does not need to obtain your authorization consent:"}
{"task": "rw_5.jsonl", "id": 38294, "text": "(1) It is necessary for the contract to establish and fulfill your contract as a party;", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to set up and fulfill your collection and use information for the contract as a party, no need to solicit authorization."}
{"task": "rw_5.jsonl", "id": 38295, "text": "(2) In order to fulfill the statutory duties or the requirements of the statutory volunteer;", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to fulfill the statutory duties or the collection and usage information necessary for the statutory volunteer, there is no need to solicit authorization consent."}
{"task": "rw_5.jsonl", "id": 38296, "text": "(3) In order to cope with emergencies, or in emergency situations, to protect your life, health and property security of others;", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to cope with emergencies, or in urgent cases to protect the life and health of natural persons and the necessary collection and use information, no need to solicit authorization."}
{"task": "rw_5.jsonl", "id": 38297, "text": "(4) In order to implement news reports and public opinion supervision for public interests, deal with your personal information within a reasonable range;", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to implement news reports and public opinion supervision, deal with personal information within a reasonable scope without soliciting authorization consent."}
{"task": "rw_5.jsonl", "id": 38298, "text": "(5), deal with your own or other personal information within a reasonable range;", "label": ["Important", "First Party Collection Information"], "rewrite": "To handle your own or other personal information that have been disclosed by yourself or other legal disclosure, you do not need to solicit authorization consent."}
{"task": "rw_5.jsonl", "id": 38299, "text": "(6), other circumstances stipulated in laws and administrative regulations.", "label": ["Important", "First Party Collection Information"], "rewrite": "Other collection and use information stipulated in laws and regulations does not need to solicit authorization."}
{"task": "rw_5.jsonl", "id": 38300, "text": "13., we only collect your personal information within the minimum range of product functions and processing purposes at the right time and time.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "We are limited to collecting your personal information within the minimum range of realization of product function use and processing purposes."}
{"task": "rw_5.jsonl", "id": 38301, "text": "2. The way we share, transfer, or publicly disclose personal information", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38302, "text": "(1) Sharing", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38303, "text": "We attach great importance to protecting your personal information.", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38304, "text": "We will only provide your personal information to third parties for the legal, correct, necessary, specific, and clear goals.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will only provide your personal information to third parties for the legal, correct, necessary, specific, and clear goals."}
{"task": "rw_5.jsonl", "id": 38305, "text": "When we receive our personal information, we will sign a strict confidentiality agreement with them, asking them to handle information in accordance with our instructions, this policy, and any other related confidentiality and security measures.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will sign a confidentiality agreement with the receiver to request them to handle information in accordance with our instructions, this policy, and any other related confidentiality and security measures."}
{"task": "rw_5.jsonl", "id": 38306, "text": "1. In order to achieve the purpose of the statement in this policy, we will access the SDK or other similar applications provided by the third -party service provider (including the form of embedded code, plug -in, H5) to cooperate with the third party in order to provide you withBetter customer service and user experience.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will access SDK or other similar applications provided by third -party service providers to cooperate with third -party."}
{"task": "rw_5.jsonl", "id": 38307, "text": "The situation of commissioning or sharing personal information to achieve our service is as follows (specifically based on the service and functions set by specific games):", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38308, "text": "(1), for advertising -related services, including advertising display, advertising data monitoring/statistics;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may entrust or share personal information for advertising -related services."}
{"task": "rw_5.jsonl", "id": 38309, "text": "(2), for message push function, including mobile phone manufacturer Push push, specific event reminder, personalized content recommendation;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may entrust or share personal information for message push functions."}
{"task": "rw_5.jsonl", "id": 38310, "text": "(3), used for payment related services, including order payment, transaction behavior verification, income settlement, payment information remittance president;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may entrust or share personal information to pay for related services."}
{"task": "rw_5.jsonl", "id": 38311, "text": "(4), obtain equipment location permissions, collect equipment information and log information when you agree;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may entrust or share personal information in order to obtain equipment location permissions, collect equipment information and log information when you agree."}
{"task": "rw_5.jsonl", "id": 38312, "text": "(5), for third -party license services, including ARK, Games game recognition, log in;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may entrust or share personal information to be used for third -party authorization services."}
{"task": "rw_5.jsonl", "id": 38313, "text": "(6), used to support product function modules, including online live broadcast, video playback, voice recognition, AR, smart customer service, barrage playback, content storage;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may entrust or share personal information to support product function modules."}
{"task": "rw_5.jsonl", "id": 38314, "text": "(7), used to optimize product performance and service quality, including improving the ability of hardware distribution, reducing server costs, functional heat repair, security analysis, optimizing game services, and improving user experience;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may entrust or share personal information to optimize product performance and service quality."}
{"task": "rw_5.jsonl", "id": 38315, "text": "(8), used for account security, product reinforcement related services, including network monitoring, domain name analysis, anti -hijacking, anti -junk anti -cheating, and definition services;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may entrust or share personal information for account security and product reinforcement services."}
{"task": "rw_5.jsonl", "id": 38316, "text": "(9), used for logistics services, including packeting, transportation, and express delivery.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may entrust or share personal information for logistics services."}
{"task": "rw_5.jsonl", "id": 38317, "text": "2. ARK Games game service access or link to other products or services or services provided by other products or services or services provided by non -ARK Games games, including:", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38318, "text": "(1), you can use the \"Share\" function to share some ARK, Games game service content to other products or services or services or services of other products or services or services or services in non -ARK, Games games, or you will be non -ARK, Games games other productsOr the content of services or third -party products or services sharing into ARK, Games game services;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You can use the \"Share\" function to share some ARK Games game services to other products or services or third -party products or services, otherwise."}
{"task": "rw_5.jsonl", "id": 38319, "text": "(2) Links to you through advertising or other ways so that you can link to other products or services of non -ARK, Games games, third -party products or services or websites;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You can link to other products or services of non -ARK Games games, third -party products or services or websites."}
{"task": "rw_5.jsonl", "id": 38320, "text": "(3) Other conditions to access third -party services.", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38321, "text": "Some third -party SDKs or applications we access will collect your personal information. If you use such services provided by third parties in our services, you agree that you will directly collect and process your information.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Part of the third -party SDK or similar applications we access will collect your personal information."}
{"task": "rw_5.jsonl", "id": 38322, "text": "We will evaluate the legality, legitimacy, and necessity of such third -party services to collect personal information, and require these third parties to take protection measures for your personal information, and strictly abide by relevant laws and regulations and regulatory requirements.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will evaluate the legality, legitimacy, and necessity of third -party services to collect personal information, and require these third parties to take protection measures for your personal information."}
{"task": "rw_5.jsonl", "id": 38323, "text": "The above third -party services are operated by related third parties.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Third -party services are operated by related third parties."}
{"task": "rw_5.jsonl", "id": 38324, "text": "If you use these third -party services (including any information you provided to these third parties), you must be subject to the rules of service clauses and personal information protection related rules (rather than this policy).The scope of collection, etc., are based on the \"Privacy Policy\" and (or) user agreements and \"User Agreement\" and similar documents published by the third -party platform. You need to read its terms carefully.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you use these third -party services, you must be subject to the third party's own service terms and personal information protection rules (rather than this policy)."}
{"task": "rw_5.jsonl", "id": 38325, "text": "This policy is only applicable to the personal information we collected, and it does not apply to the service provided by any third party or the rules of information use of third -party information.", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38326, "text": "If you find that these third -party services are risky, it is recommended that you terminate related operations to protect your legitimate rights and interests and contact us in time.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you find a risk of third -party services, it is recommended that you terminate related operations and contact us in time."}
{"task": "rw_5.jsonl", "id": 38327, "text": "You can refer to attachment I \"SDK and Similar List List\" to learn about the specific situation of our third -party services.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You can refer to attachment I \"SDK and Similar List List\" to learn about the specific situation of third -party services."}
{"task": "rw_5.jsonl", "id": 38328, "text": "You can also choose to contact us through the feedback channel listed in the chapter of this policy, and we will answer it as soon as possible.", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38329, "text": "3. In order to better protect the physical and mental health of minors, guide the healthy access of minors, and prevent minors from using and borrowing relevant information about adults.For people's needs, try to contact their guardians to inform their guardians, to inform their guardians, to remind, confirm and handle them.", "label": ["Specific Audiences", "Important"], "rewrite": "We may inform the guardian of the gaming account, game duration, consumer transaction records, and game behavior information of minors, and remind, confirm and handle."}
{"task": "rw_5.jsonl", "id": 38330, "text": "4. In order to improve the product research and development capabilities and service levels of ARK, Games games, in order to provide you with better products and services, we will be with research institutions, scientific research institutes, university institutions, college institutions, college institutions, college institutions, and university institutions within a legal scope.Share data after identification or anonymous processing.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will share data from research institutions, research institutes, and university institutions within a legal, reasonable and necessary scope."}
{"task": "rw_5.jsonl", "id": 38331, "text": "Without your clear authorization, we will not share with the above agencies that can be used to identify your personal identity information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Without your clear authorization, we will not share information that can be used to identify your personal identity."}
{"task": "rw_5.jsonl", "id": 38332, "text": "(2) Transfer", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38333, "text": "When we have a merger, acquisition, asset transfer, separation, dissolution, declaration of bankruptcy or similar situations, if your personal information needs to be transferred, we will inform you the relevant situation and inform you that the name and contact of the receiver will be informed.Way.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If business mergers, acquisitions, asset transfer and other transactions will be informed of the relevant situation and inform you the name and contact information of the information receiver."}
{"task": "rw_5.jsonl", "id": 38334, "text": "In addition, we will require the new receiver to continue to protect your personal information in accordance with laws and regulations and not lower than the requirements of this policy.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will require new receivers to continue to protect your personal information in accordance with laws and regulations and not lower than the requirements of this policy."}
{"task": "rw_5.jsonl", "id": 38335, "text": "(3) Public public", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38336, "text": "We will only disclose your personal information in the following circumstances:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only disclose your personal information in the following circumstances:"}
{"task": "rw_5.jsonl", "id": 38337, "text": "1., according to your needs, disclose the information you specified when you clearly agree;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "According to your needs, disclose the information you specified without your clear consent."}
{"task": "rw_5.jsonl", "id": 38338, "text": "2. Public your personal information according to the requirements of laws and administrative regulations.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Public your personal information according to the requirements of laws and administrative regulations."}
{"task": "rw_5.jsonl", "id": 38339, "text": "Storage of three personal information", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38340, "text": "(1) The method and period of information storage", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38341, "text": "We will store your information through security encryption, including local storage (for example, using APP for data cache), database and server logs.", "label": ["Important", "Data Security"], "rewrite": "We will store your information through security encryption."}
{"task": "rw_5.jsonl", "id": 38342, "text": "Under normal circumstances, we will only store your personal information within the time necessary for the purpose of service to achieve service purposes or under the conditions of laws and regulations.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "Generally, your personal information is retained within the time limit required to achieve service purposes, unless the law has other requirements."}
{"task": "rw_5.jsonl", "id": 38343, "text": "After the previous period expires, we will delete or treat your personal information.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "After the storage period expires, your personal information will be deleted or anonymous."}
{"task": "rw_5.jsonl", "id": 38344, "text": "We judge the storage period of personal information. The following standards are mainly referred to the following standards and the elders are based on the elders:", "label": ["Data Retention", "Important"], "rewrite": "The storage period for judging personal information is mainly referred to the following standards and the elders are based on: 1. Complete the business functions you agree with; 2. Make sure we provide you with service security and quality; 3. The longer the longer you agreeDuring retention; 4. Whether there are other regulations for reserved period."}
{"task": "rw_5.jsonl", "id": 38345, "text": "1. Complete the business function you agree with;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38346, "text": "2. Ensure that we provide you with service safety and quality;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38347, "text": "3. The longer retention period you agree;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38348, "text": "4. Whether there are other regulations for retention period.", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38349, "text": "(2) The area of information storage", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38350, "text": "The personal information we collected in the People's Republic of China is stored in China.", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in domestic operations will be stored in China."}
{"task": "rw_5.jsonl", "id": 38351, "text": "If we need to transmit cross -border transmission, we will request a separate request to obtain your authorization consent and ensure that it will be implemented in accordance with national laws and regulations and relevant regulatory authorities to provide sufficient protection for your personal information.", "label": ["Data Retention", "Important"], "rewrite": "If it involves cross -border transmission, we will request a separate request to obtain your authorization consent and ensure that it is implemented in accordance with laws and regulations and relevant regulatory authorities."}
{"task": "rw_5.jsonl", "id": 38352, "text": "(3) Notice of product or service stop operation", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38353, "text": "When our products or services stop operation, we will announce notifications in accordance with relevant laws and regulations and protect your legitimate rights and interests in accordance with the law.", "label": ["Important", "Cessation of Operations"], "rewrite": "When the operation is stopped, the announcement will be made in accordance with relevant laws and regulations, and your legitimate rights and interests will be guaranteed in accordance with the law."}
{"task": "rw_5.jsonl", "id": 38354, "text": "Four information security", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38355, "text": "(1) Safety protection measures", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38356, "text": "We attach great importance to information security. We will take all reasonable and feasible measures to protect your personal information:", "label": ["Important", "Data Security"], "rewrite": "We will take all reasonable and feasible measures to protect your personal information:"}
{"task": "rw_5.jsonl", "id": 38357, "text": "1. Data security technical measures", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38358, "text": "(1), we will use security measures that meet industry standards, including establishing reasonable institutional norms and security technology to prevent your personal information from being accessed and modified by unauthorized access to avoid damage or loss of data.", "label": ["Important", "Data Security"], "rewrite": "We will adopt safety protection measures that meet industry standards to establish a reasonable institutional specification and security technology to protect your information security."}
{"task": "rw_5.jsonl", "id": 38359, "text": "(2) Our service adopts a variety of encryption technologies. We will use encryption technology to protect your personal information, use encryption technology to encrypt your personal information, and isolate through isolation technology.", "label": ["Important", "Data Security"], "rewrite": "We will use encryption technology to protect your personal information."}
{"task": "rw_5.jsonl", "id": 38360, "text": "(3) In the use of personal information (for example, information display, information association calculation, etc.), we will use multiple data desensitization technology to enhance the security of information in use.", "label": ["Important", "Data Security"], "rewrite": "We will use a variety of data desensitization technology to enhance the security of information in use."}
{"task": "rw_5.jsonl", "id": 38361, "text": "(4), we will also use strict data access permissions control and multiple identity authentication technology to protect personal information to avoid data from illegal use.", "label": ["Important", "Data Security"], "rewrite": "We will also use strict data access permissions control and multiple identity authentication technology to protect personal information."}
{"task": "rw_5.jsonl", "id": 38362, "text": "2. We take other security measures to protect personal information", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38363, "text": "(1) We strive to provide guarantee for users' information security to prevent information from leakage, loss, improper use, unauthorized access and disclosure.", "label": ["Important", "Data Security"], "rewrite": "We provide protection for users' information security to prevent information from leakage, loss, improper use, unauthorized access and disclosure."}
{"task": "rw_5.jsonl", "id": 38364, "text": "We use multi -directional security protection measures to ensure that user personal information protection is at a reasonable level of security, including technological protection methods, management system control, and security system guarantee.", "label": ["Important", "Data Security"], "rewrite": "We use technical protection methods, management system control, security system guarantee and many other aspects of safety protection measures."}
{"task": "rw_5.jsonl", "id": 38365, "text": "(2), we use industry -leading technical protection measures to protect personal information.", "label": ["Important", "Data Security"], "rewrite": "We use industry -leading technical protection measures to protect personal information."}
{"task": "rw_5.jsonl", "id": 38366, "text": "The technical means we use include but not limited to firewalls, encryption (for example, SSL), de -identification or anonymous treatment, access control measures, etc.", "label": ["Important", "Data Security"], "rewrite": "The technical means we use include but not limited to firewalls, encryption, de -identification or anonymous treatment, access control measures, etc."}
{"task": "rw_5.jsonl", "id": 38367, "text": "In addition, we will continue to strengthen the security capabilities of software installed on your device.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38368, "text": "For example, we will complete some information encryption work locally to consolidate security transmission;", "label": ["Important", "Data Security"], "rewrite": "We will complete some information encryption work locally to consolidate security transmission."}
{"task": "rw_5.jsonl", "id": 38369, "text": "We will understand the application information and running process information installed by your device to prevent malicious programs such as viruses and Trojans.", "label": ["Important", "Data Security"], "rewrite": "We will understand the application information and running process information installed by your device to prevent malicious programs such as viruses and Trojans."}
{"task": "rw_5.jsonl", "id": 38370, "text": "(3), we have established a special management system, process and organization that ensure personal information security.", "label": ["Important", "Data Security"], "rewrite": "We have established a special management system, process and organization that guarantees personal information security."}
{"task": "rw_5.jsonl", "id": 38371, "text": "For example, we strictly restrict the scope of the personnel of the access information, require them to abide by the confidentiality obligations and audit, and those who violate the obligations will be punished in accordance with regulations.", "label": ["Important", "Data Security"], "rewrite": "Strictly restrict the scope of the personnel who access information, and sign a confidentiality agreement with them to punish those who violate the obligations of confidentiality."}
{"task": "rw_5.jsonl", "id": 38372, "text": "We will also review the management system, process and organization to prevent unauthorized personnel from accessing, using or disclosing users' information.", "label": ["Important", "Data Security"], "rewrite": "Examine the management system, process, and organizations to prevent unauthorized personnel from accessing, using or disclosing users' information on unauthorized personnel."}
{"task": "rw_5.jsonl", "id": 38373, "text": "We recommend that you pay full attention to the protection of personal information when using products and services, and we will also provide multiple security functions to help you protect your personal information security.", "label": ["Important", "Data Security"], "rewrite": "It is recommended that you pay full attention to the protection of personal information when using products and services."}
{"task": "rw_5.jsonl", "id": 38374, "text": "(4), we comprehensively control the data through the audit mechanism of information contacts, information contact behaviors, and data information security.", "label": ["Important", "Data Security"], "rewrite": "We use the audit mechanism to fully control the data."}
{"task": "rw_5.jsonl", "id": 38375, "text": "We will also organize safety and privacy protection training courses to strengthen employees' awareness of safety and understand the importance of protection.", "label": ["Important", "Data Security"], "rewrite": "We will organize safety and privacy protection training courses to strengthen employees' understanding."}
{"task": "rw_5.jsonl", "id": 38376, "text": "(5) We only allow the need to know the ARK, Games employees, and partners who know this information to visit your personal information, and set up strict access to control and monitoring mechanisms for this.", "label": ["Important", "Data Security"], "rewrite": "We only allow employees and partners who need to know about these information to visit your personal information and conduct strict management."}
{"task": "rw_5.jsonl", "id": 38377, "text": "We also require all personnel who may be exposed to your personal information to fulfill the corresponding confidentiality obligations.", "label": ["Important", "Data Security"], "rewrite": "We also require all personnel who may be exposed to your personal information to fulfill the corresponding confidentiality obligations."}
{"task": "rw_5.jsonl", "id": 38378, "text": "If these obligations fail to fulfill these obligations, they may be held legal or suspended or suspended with ARK Games.", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38379, "text": "(6), we will take all reasonable and feasible measures to ensure unrelated personal information.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "We will take all reasonable and feasible measures to ensure unrelated personal information."}
{"task": "rw_5.jsonl", "id": 38380, "text": "3. Safety event disposal measures: If security incidents such as personal information leakage occur, we will start emergency plans to prevent the expansion of security events.", "label": ["Important", "Data Security"], "rewrite": "If personal information leaks and other security incidents occur, we will start emergency plans to prevent security incidents from expanding."}
{"task": "rw_5.jsonl", "id": 38381, "text": "After the security incident occurs, we will inform you the basic situation of the security incident in the form of announcement, push notification or email, we are about or already adopted, and our proposals for your response.", "label": ["Important", "Data Security"], "rewrite": "If a personal information security incident occurs, we will inform you the basic situation, possible impact, disposal measures, and suggestions of your incident."}
{"task": "rw_5.jsonl", "id": 38382, "text": "If it is difficult to achieve one by one, we will issue warnings through announcement and other methods.", "label": ["Important", "Data Security"], "rewrite": "When it is difficult to inform one by one, it will issue an announcement."}
{"task": "rw_5.jsonl", "id": 38383, "text": "4. Safety reminder", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38384, "text": "Please understand that due to the technical restrictions and the limitations of risk prevention, even if we have tried to strengthen security measures, we cannot always ensure that the information is 100 % security.", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38385, "text": "You need to understand that you access the system and communication network used in the ARK Games game service, which may have problems due to the situation outside our controlled range.", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38386, "text": "Please keep your account, password and other identity elements properly.", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38387, "text": "When you use the ARK Games game service, we will identify your identity through your account, password and other identity elements.", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38388, "text": "Once you leak the aforementioned information, you may suffer losses and may be unfavorable to you.", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38389, "text": "If you find the account, password and/or other identity elements that may be leaked, please contact us immediately so that we can take corresponding measures in time to avoid or reduce related losses.", "label": ["Important", "Data Security"], "rewrite": "If your personal information is leaked, please contact our customer service immediately."}
{"task": "rw_5.jsonl", "id": 38390, "text": "Five how to exercise your personal information related rights", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38391, "text": "(1) Review, copy, transfer, correct, supplement and delete", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38392, "text": "During your use of ARK, Games game service, we will provide you with the corresponding operation settings to manage your personal information according to the specific situation of each game product so that you can check, copy, transfer, correct, supplement, delete or withdraw yourRelated personal information.", "label": ["Important", "Edit/Control"], "rewrite": "We will provide you with the corresponding operation settings to manage your personal information according to the specific situation of each game product so that you can exercise the right to personal information."}
{"task": "rw_5.jsonl", "id": 38393, "text": "1., you can check your account basic information (including account avatars, nicknames, and other personal information you choose to fill in in the ARK, Games game products you use.(Character level, achievement, record, and specific game information of each product), more correct and supplement your account basic information according to the specific situation.", "label": ["Important", "Edit/Control"], "rewrite": "You can check your account basic information and game history information, and more correct and supplement your account basic information according to the specific situation."}
{"task": "rw_5.jsonl", "id": 38394, "text": "2. If you have other doubts or difficulties in checking, replication, transfer, correction, supplementation, or deletion of demand or you can choose the feedback channels listed in the chapter listed in the chapter of the \"contact us\" chapter through this policyContact us, we will deal with you in time.", "label": ["Important", "Edit/Control"], "rewrite": "If you have other requirements or difficulties or difficulties in checking, replication, transfer, correction, supplementation or deletion, you can contact us."}
{"task": "rw_5.jsonl", "id": 38395, "text": "3. Except for other provisions of laws and regulations, when you correct, supplement, delete your personal information or apply for a cancellation account, we may not immediately correct, supplement or delete the corresponding information from the backup system, but we will no longer will no longer beRelevant information is processed and this information will be corrected, supplemented or deleted when the backup is updated.", "label": ["Important", "Edit/Control"], "rewrite": "When you correct, supplement, delete your personal information or apply for a cancellation account, we will not process relevant information, and we will correct, supplement or delete these information when the backup is updated."}
{"task": "rw_5.jsonl", "id": 38396, "text": "Once the relevant information is deleted or the account is canceled, it will not be recovered, please do it carefully.", "label": ["Important", "Edit/Control"], "rewrite": "Once the relevant information is deleted or the account is canceled, it will not be recovered."}
{"task": "rw_5.jsonl", "id": 38397, "text": "(2) Public and sharing", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38398, "text": "Some functions of ARK, Games games allow you to share your relevant information with all users using this feature. You can upload or publish information, you can also respond to other people uploaded or posted information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Some functions of the ARK Games game allow you to share your relevant information with all users using this feature."}
{"task": "rw_5.jsonl", "id": 38399, "text": "As long as you do not delete the information you disclosed or shared, the information may always stay in the public field;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "As long as you do not delete the information you disclosed or shared, the relevant information may always stay in the public field."}
{"task": "rw_5.jsonl", "id": 38400, "text": "Even if you delete the shared information, the relevant information may be cached, copied or stored independently by other users or the third parties that are not controlled by us, or are preserved by other users or such third parties in the public.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Even if you delete the shared information, the information may still be independently stored by other users or the third parties that are not controlled by us."}
{"task": "rw_5.jsonl", "id": 38401, "text": "If you disclose or share information through the above channels, we will not bear responsibility for your information leakage.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "You do not bear responsibility for your information through the above channels to disclose or share your information."}
{"task": "rw_5.jsonl", "id": 38402, "text": "Therefore, we remind and ask you to consider whether to disclose or share your information through the above channels.", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38403, "text": "(3) Personal information collection and use of authorization changes", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38404, "text": "You can change the equipment permissions obtained by deleting information, closing or opening specific product functions, closing or opening a specific product acquisition (the specific permissions are different due to the different equipment models and system versions used by the user).Scope of authorization.", "label": ["Important", "Edit/Control"], "rewrite": "You can change the scope of authorization of us to collect and use your personal information by deleting information, closing or turning on specific product functions, closing or opening a specific product acquisition."}
{"task": "rw_5.jsonl", "id": 38405, "text": "For example, you can perform the following operations:", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38406, "text": "1. If you no longer want to receive some of our communication through SMS, you can choose to cancel the subscription on the device or reply to the specified SMS according to our relevant tips.", "label": ["Edit/Control", "Important"], "rewrite": "If you no longer want to receive certain communication via SMS, you can cancel the subscription on the device or reply to specify SMS."}
{"task": "rw_5.jsonl", "id": 38407, "text": "2. You can choose to receive a mobile push notification from our mobile push.", "label": ["Important", "Edit/Control"], "rewrite": "You can choose to receive a mobile push notification from our mobile push."}
{"task": "rw_5.jsonl", "id": 38408, "text": "You can also choose to push or close the directional push. If you then decide not to accept these notices, you can use the setting function of the mobile device to close them.", "label": ["Important", "Edit/Control"], "rewrite": "You can use the setting function of the mobile device to close the push or turn off the directional push."}
{"task": "rw_5.jsonl", "id": 38409, "text": "3. The above choice can be changed through the relevant settings on your device. If you do not find the relevant settings, you can also contact us to change your above choices via the mailbox tousu@rkgames.com.", "label": ["Important", "Contact Information"], "rewrite": "You can contact us to change your choice via the mailbox tousu@arkgames.com."}
{"task": "rw_5.jsonl", "id": 38410, "text": "After withdrawing authorization, you may not be able to use the authorized product function, but do not affect the use of other functions.", "label": ["Important"], "rewrite": "After withdrawing authorization, you may not be able to use the authorized product function, but do not affect the use of other functions."}
{"task": "rw_5.jsonl", "id": 38411, "text": "You withdraw authorization will not affect the effectiveness of personal information processing activities based on your authorization before withdrawal.", "label": ["Permission Acquisition", "Edit/Control", "Risk", "Important"], "rewrite": "You withdraw authorization will not affect the effectiveness of personal information processing activities based on your authorization before withdrawal."}
{"task": "rw_5.jsonl", "id": 38412, "text": "Some personal information collection and use of basic functions corresponding to our services. If you want to withdraw the authorization of relevant personal information collection and use, we may not be able to provide you with services.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38413, "text": "In this case, if you still want to withdraw relevant authorization, you can cancel the demand through applying for an account.", "label": ["Important", "Edit/Control"], "rewrite": "If the authorization of the withdrawal of basic functions, if the service cannot be provided, the relevant authorization may be withdrawn by canceling the account."}
{"task": "rw_5.jsonl", "id": 38414, "text": "For example, based on laws and regulations, real -name authentication must be performed using game services. If you want to withdraw the authorization of our collection of real -name authentication information, we require us to delete your real -name authentication information. We may not be able to continue to provide you with basic service products.", "label": ["Important", "Edit/Control"], "rewrite": "If you want to withdraw the authorization of the collection of real -name authentication information and require deleting real -name authentication information, we may not be able to continue to provide you with basic service products."}
{"task": "rw_5.jsonl", "id": 38415, "text": "(4) Constraine information system automation decision -making", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38416, "text": "In certain business functions, we will make a decision based on the non -artificial automatic decision -making mechanism, including the information system and algorithm (specifically based on the services and functions set by specific games).", "label": ["Important", "Usage"], "rewrite": "In certain business functions, we will make decisions based on the non -artificial automatic decision -making mechanism, including the information system and algorithm."}
{"task": "rw_5.jsonl", "id": 38417, "text": "If these decisions significantly affect your legitimate rights and interests, you have the right to ask us to explain, and we will also provide appropriate relief methods.", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38418, "text": "(5) Logging out the account", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38419, "text": "You can log out your current account.", "label": ["Important", "Edit/Control"], "rewrite": "You can log out your current account."}
{"task": "rw_5.jsonl", "id": 38420, "text": "Logging out the account is an irreversible operation. Please confirm that all the relevant services of the account have been properly handled before the operation of the account.", "label": ["Important", "Edit/Control"], "rewrite": "Logging out the account is an irreplaceable operation."}
{"task": "rw_5.jsonl", "id": 38421, "text": "After the account of the account is canceled, we will clear all the information of the cancellation account within a certain time limit in accordance with the relevant laws.", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "After the account of the account is canceled, we will clear all the information of the cancellation account within a certain time limit in accordance with the relevant laws."}
{"task": "rw_5.jsonl", "id": 38422, "text": "After completing the cancellation of the game account, in addition to the laws and regulations or this agreement, your personal information under the game will delete or anonymous processing, and the related products and services that have previously related to the game account will no longer be associated.Essence", "label": ["Important", "Edit/Control"], "rewrite": "After cancellation, personal information will be deleted or anonymous and no longer associate with related products and services."}
{"task": "rw_5.jsonl", "id": 38423, "text": "Once the game account is canceled, it will not be recovered, please do it carefully.", "label": ["Important", "Edit/Control"], "rewrite": "Once the game account is canceled, it will not be restored."}
{"task": "rw_5.jsonl", "id": 38424, "text": "Six changes", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38425, "text": "We may revise this policy in a timely manner.", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38426, "text": "When the personal information collection and use rules and other laws and regulations are changed, we will prompt you to change the policy after the version update.", "label": ["Policy Change", "Important"], "rewrite": "When the version is updated, we will prompt you the change policy after the version update."}
{"task": "rw_5.jsonl", "id": 38427, "text": "Please read the privacy protection policy or policy content after the change. You continue to use ARK, Games games indicate that you agree that we can collect, process or use your personal information according to the updated privacy protection policy.", "label": ["Policy Change", "Important", "Risk"], "rewrite": "You continue to use the ARK Games game to indicate that you agree to be constrained by the updated privacy protection policy."}
{"task": "rw_5.jsonl", "id": 38428, "text": "Seven minors protection", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38429, "text": "We attach great importance to the protection of personal information of minors and continue to explore better personal information protection methods for minors.", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38430, "text": "If you are the legal guardian of the minor, please pay attention to whether the minors you are monitored use the service of ARK, Games games or provide personal information after obtaining your authorization consent.", "label": ["Specific Audiences", "Important"], "rewrite": "Please pay attention to whether the minors you are monitored are used after obtaining your authorization consent or provided their personal information."}
{"task": "rw_5.jsonl", "id": 38431, "text": "If you have doubts about the personal information of the minors you monitor, please contact us through the feedback channel listed in the chapter listed in the chapter of this policy.", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38432, "text": "If you are a child under the age of 14, in order to protect the personal information of children, we have also released the \"ARK, Games Game Child Privacy Protection Policy\" (see Annex 2).", "label": ["Specific Audiences", "Important"], "rewrite": "We also released the \"ARK Games Game Child Privacy Protection Policy\" to protect personal information of children with 14 years of age."}
{"task": "rw_5.jsonl", "id": 38433, "text": "Children and their guardians should also read the \"ARK Games Game Child Privacy Protection Policy\" before using the ARK Games game service.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38434, "text": "You can use ARK and Games game services only after obtaining the guardian's \"ARK, Games Game Children's Privacy Protection Policy\".", "label": ["Specific Audiences", "Important"], "rewrite": "Only after obtaining the guardian's consent of this policy and \"ARK Games Game Child Privacy Protection Policy\", children can use ARK Games game services."}
{"task": "rw_5.jsonl", "id": 38435, "text": "We will actively protect the legitimate rights and interests of minors by enabling the anti -addiction system in accordance with the requirements of national defense addiction policies.", "label": ["Specific Audiences", "Important"], "rewrite": "We will protect the legitimate rights and interests of minors by enable the anti -addiction system."}
{"task": "rw_5.jsonl", "id": 38436, "text": "We will verify the real -name information and other information to determine whether the real -name information of the relevant account is minor, and then decide whether to incorporate this account into the anti -addiction system.", "label": ["Specific Audiences", "Important"], "rewrite": "We will verify the real -name information and other information to determine whether the real -name information of the relevant account is minor, and then decide whether to incorporate this account into the anti -addiction system."}
{"task": "rw_5.jsonl", "id": 38437, "text": "In addition, we may also collect information such as your login time and game duration. By automatic intervention from the system level and restricting minors game time and enabled offline functions, we will guide the rational game of minors.", "label": ["Specific Audiences", "Important"], "rewrite": "We may collect information such as your login time, game duration, and guide rational games by guiding minors from the system level."}
{"task": "rw_5.jsonl", "id": 38438, "text": "Eight others", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38439, "text": "\"ARK Games Privacy Protection Policy\" is a general privacy clause for the uniform application of the ARK Games game. The content stipulated in it includes but not limited to user rights and information security guarantee measures.", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38440, "text": "Some game products have their own separate privacy protection policies to further refine the use of personal information collection and use of specific products.The privacy protection policies displayed in the product shall prevail.", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38441, "text": "\"ARK Games Game Child Privacy Protection Policy\" is a personal information protection rule for children under 14 years of age.", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38442, "text": "Within the scope of the \"ARK Games Game Child Privacy Protection Policy\", if there are inconsistent or contradictory privacy protection policies (if.)allow.", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38443, "text": "Nine contact us", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38444, "text": "When you have other complaints and suggestions, please contact us by phone 028-63209138.", "label": ["Important", "Contact Information"], "rewrite": "Tel: 028-63209138"}
{"task": "rw_5.jsonl", "id": 38445, "text": "You can also send your question to tousu@arkgames.com or mail to the following address:", "label": ["Important", "Contact Information"], "rewrite": "Email: Tousu@arkgames.com"}
{"task": "rw_5.jsonl", "id": 38446, "text": "12th floor of Block A, Block A, No. 7, Jianguo Men, Dongcheng District, Dongcheng District, Beijing", "label": ["Important", "Contact Information"], "rewrite": "Correspondence address: 12th floor of Block A, No. 7, Jianguo Men, Dongcheng District, Dongcheng District, Beijing, customer service department of Beijing Leyou Fangzhou Technology Co., Ltd. (received)"}
{"task": "rw_5.jsonl", "id": 38447, "text": "Beijing Leyou Ark Technology Co., Ltd. Customer Service Department (receipt)", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38448, "text": "Postcode: 100005", "label": ["Important", "Contact Information"], "rewrite": "Postcode: 100005"}
{"task": "rw_5.jsonl", "id": 38449, "text": "We will review the issues involved as soon as possible and answer your request within 15 working days or laws and regulations.", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38450, "text": "Attachment 1: \"SDK and Similar Listed List\"", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38451, "text": "Release time: June 28, 2022", "label": [], "rewrite": []}
{"task": "rw_5.jsonl", "id": 38452, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
