{"task": "rw_52.jsonl", "id": 55357, "text": "Netease Cloud Music Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55358, "text": "Update date: May 11, 2021", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55359, "text": "Effective date: May 11, 2021", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55360, "text": "[Foreword] Welcome to the service provided by \"Netease Cloud Music\" (referring to NetEase Cloud Music website, its client program, mobile application products, applets, hereinafter referred to as \"Netease Cloud Music\")!", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55361, "text": "We know the importance of personal information to you, and solemnly promise to protect the personal information and privacy security of users who use Netease Cloud Music (hereinafter collectively referred to as \"user\" or \"you\").", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55362, "text": "When you use Netease Cloud Music, we may collect and use your relevant personal information and user information (hereinafter collectively referred to as \"information\").", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55363, "text": "We hope to explain related matters such as \"NetEase Cloud Music Privacy Policy\" (hereinafter referred to as \"Privacy Policy\" or \"This Policy\") to explain to youGood protection of your rights.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55364, "text": "[Special Tips] Please read carefully before using Netease Cloud Music (please read it with the guardian with the guardian) and understand this policy (especially the content marked by bold or below) to make appropriate choices.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55365, "text": "When you agree with this policy, you have agreed that we have agreed to process your relevant information in accordance with this policy.", "label": ["Policy Change", "Important"], "rewrite": "Agree with this policy means that you have agreed to deal with your relevant information in accordance with this policy."}
{"task": "rw_52.jsonl", "id": 55366, "text": "Unless you have read and accept all the terms of this policy, you should not use Netease Cloud Music.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55367, "text": "Users under the age of 14, at the same time applying this \"Privacy Policy\" and \"NetEase Cloud Music Children's Personal Information Protection Rules and Guardians\"", "label": ["Specific Audiences", "Important"], "rewrite": "Users under the age of 14, and apply this \"Privacy Policy\" and \"NetEase Cloud Music Children's Personal Information Protection Rules and Guardian Notes\"."}
{"task": "rw_52.jsonl", "id": 55368, "text": "This policy is suitable for Netease Cloud Music, such as the \"Privacy Policy of Netease Group\" and \"NetEase Cloud Music Service Terms\" in the same clause inconsistent, which is subject to this policy.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55369, "text": "If a single service we provide is not applicable to this policy, the service will explicitly explicitly eliminate the applicable policy in an appropriate manner.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55370, "text": "Table of contents", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55371, "text": "1. How do we collect and use personal information", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55372, "text": "2. How do we use cookies or similar technologies", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55373, "text": "Third, we may share, transfer and disclose personal information", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55374, "text": "4. How do we store and protect personal information", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55375, "text": "5. How to manage your personal information", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55376, "text": "Six, third -party service", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55377, "text": "7. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55378, "text": "8. Notice and revision", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55379, "text": "Nine, how to contact us", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55380, "text": "1. How do we collect and use personal information", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55381, "text": "We collect your personal information mainly to use Netease Cloud Music more easily and more satisfaction with you and other users.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55382, "text": "Our goal is to provide all Internet users with a secure and interesting Internet experience.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55383, "text": "And this information helps us achieve this goal.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55384, "text": "(1) We will collect and obtain your personal information through the following channels:", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect personal information through the following channels:"}
{"task": "rw_52.jsonl", "id": 55385, "text": "1. The information you provide.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the information you provide."}
{"task": "rw_52.jsonl", "id": 55386, "text": "For example:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55387, "text": "(1) When you register for Netease Cloud Music Account or use Netease Cloud Music Services, you provide information to us;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the information you provided when registering the NetEase Cloud Music account or using the service."}
{"task": "rw_52.jsonl", "id": 55388, "text": "(2) The shared information provided by the third party through Netease Cloud Music Services, and the information stored when you use Netease Cloud Music Services.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the sharing information you provided to a third party and the information stored when you use the service."}
{"task": "rw_52.jsonl", "id": 55389, "text": "Please note that if you publish or published the information uploaded or published in the open area where other users can see in the NetEase Cloud Music Service, your information you uploaded or published by others may be disclosed. These information may be by others by othersCollect and use it.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If you disclose your information, these information may be collected and used by others."}
{"task": "rw_52.jsonl", "id": 55390, "text": "When you find that others collect or use your information, you can contact us through the feedback channels listed in the chapter of the \"How to contact us\" in this policy.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55391, "text": "2. Your information shared by a third party.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55392, "text": "That is, third -party provides shared information on your tertiary cloud music service.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55393, "text": "3. The information we get.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55394, "text": "When you use Netease Cloud Music services, we collect, summarize, and record information, such as log information, location information, and equipment information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We collect, summarize, and record information, such as log information, location information, and equipment information."}
{"task": "rw_52.jsonl", "id": 55395, "text": "(2) We will collect and use your personal information for the following goals:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55396, "text": "If you understand and agree, we want to provide your products and services to be perfect, so we will continue to improve our products and services, which means that with the iteration, expansion, and upgrading of the products and services, we may often launchNew service or business functions or re -divide business functions, and may need to collect new personal information or change the purpose or method of using personal information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55397, "text": "Please note that if we want to use your personal information in other uses that have not been stated in this policy or collect unreasonable other personal information, we will use page prompts, interactive processes, website announcements or other methods to recruit separately.Get your consent.", "label": ["Important", "First Party Collection Information"], "rewrite": "If we use personal information for other uses or additional personal information, we will obtain your consent separately."}
{"task": "rw_52.jsonl", "id": 55398, "text": "Once you agree, these additional uses will be regarded as part of this policy, and these additional information will also apply this policy.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55399, "text": "In the process, if you have any questions, you can contact us through the feedback channels listed in the chapter \"How to contact us\" in this policy, and we will answer you as soon as possible.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55400, "text": "1. Audio and video display, play and download service", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55401, "text": "In the process of using audio and video display and playback, we need to collect the browsing and play history, collection, etc. of your use of your use.", "label": ["Important", "First Party Collection Information"], "rewrite": "We need to collect the history of views and playbacks of your viewing and playback during the playback process."}
{"task": "rw_52.jsonl", "id": 55402, "text": "If you need to use the download function, we will apply for the storage authority of your device.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you use the download function, you will apply for the storage authority of your device."}
{"task": "rw_52.jsonl", "id": 55403, "text": "If you refuse to provide storage permissions, it will cause you not to use Netease Cloud Music to download songs, videos and other content, but it will not affect your most basic audio and video display and playback services.", "label": ["Permission Acquisition", "Important"], "rewrite": "Refusing to provide storage permissions will cause the download service that cannot be used, but does not affect your most basic audio and video display and playback services."}
{"task": "rw_52.jsonl", "id": 55404, "text": "2. Realize local music functions", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55405, "text": "When you use the local music function in Netease Cloud Music, we need to visit your device storage permissions/media and Apple, MUSIC permissions, and local music information in your device.", "label": ["Permission Acquisition", "Important"], "rewrite": "When using local music functions, you need to access your device storage permissions/media and Apple Music permissions, as well as local music information."}
{"task": "rw_52.jsonl", "id": 55406, "text": "We visit these permissions and collect these information to show you your local song information in order to check and play your local music through Netease Cloud Music.", "label": ["First Party Collection Information", "Permission Acquisition"], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55407, "text": "3. Provide search service", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55408, "text": "When you use the search function, we need to collect the words you search, browsing records and time, time search time, and the number of interaction with them.", "label": ["Important", "First Party Collection Information"], "rewrite": "We need to collect the words you searches, browsing records and time, search time, and the number of interaction with them."}
{"task": "rw_52.jsonl", "id": 55409, "text": "We collect this information to provide you with the content you need and the service that may be more interested in.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55410, "text": "4. Help you complete the registration and login", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55411, "text": "In order to experience richer Netease Cloud Music services, you can register and log in to Netease Cloud Music account.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55412, "text": "You need to provide basic registration or login information, including mobile phone numbers, verification code matching results (personal sensitive information), and create your account number, username and password.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect basic registration or login information, including mobile phone numbers and verification code matching results (personal sensitive information), which is used to create account numbers, usernames and passwords."}
{"task": "rw_52.jsonl", "id": 55413, "text": "If you only need to use the basic functions such as search, browsing, and audition of some songs, you do not need to register or log in and provide the above information.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55414, "text": "You can also log in with the third -party platform account we support.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55415, "text": "If you log in to the account of a third -party platform, we will obtain the relevant information under the third party account (including: user name, nickname, avatar, region, gender, and identity based on your authorization.Verification information (mobile phone number, verification code matching result).", "label": ["Important", "First Party Collection Information"], "rewrite": "Log in to use the account number of a third -party platform will obtain the relevant information under the third -party account (including: user name, nickname, avatar, region, gender, specifically your authorization content) and identity verification information (mobile phone number (mobile phone number (mobile phone number (mobile phone number (mobile phone number (mobile phone number (mobile phone number (mobile phone number (mobile phone number (mobile phone numberThe verification code matching results)."}
{"task": "rw_52.jsonl", "id": 55416, "text": "We collect this information to provide you with account login service and ensure your account security.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55417, "text": "If you refuse to authorize such information, you will not be able to log in to our platform with an account on a third -party platform, but it will not affect the normal use of other functions we provide for you.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to authorize the information, you will not be able to log in to the platform on the third -party platform account, but it will not affect the normal use of other functions."}
{"task": "rw_52.jsonl", "id": 55418, "text": "During the registration process, if you provide the following additional information, it will help us provide you with personalized recommendations and better service experiences: for example, your nickname, profile, avatar, gender, region, birthday, school.", "label": ["Important", "First Party Collection Information"], "rewrite": "Providing additional information will help us provide personalized recommendations and better service experiences."}
{"task": "rw_52.jsonl", "id": 55419, "text": "If you do not provide this information, it will not affect your basic function of using Netease Cloud Music.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you do not provide additional information, it will not affect your basic function of using Netease Cloud Music."}
{"task": "rw_52.jsonl", "id": 55420, "text": "However, in accordance with the requirements of relevant laws and regulations, or to meet the user identity authenticity, ensure system and service security needs, you may need to perform real -name authentication before using specific functions and services.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55421, "text": "We will collect your identity certification information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect your identity certification information."}
{"task": "rw_52.jsonl", "id": 55422, "text": "For example: when you apply for the enrolled musician, the anchor of the radio, and the video expert in Netease Cloud Music, we need to collect your mobile phone number, ID number, real name, facial recognition characteristics (static or dynamic), and face face recognition certificationItems", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your mobile phone number, ID number, real name, facial recognition features (static or dynamic), and face face recognition certification."}
{"task": "rw_52.jsonl", "id": 55423, "text": "When you purchase tickets or apply for free services through NetEase Cloud Music, you need to provide your mobile phone number, ID number, and real name;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your mobile phone number, ID number, and real name for purchasing tickets or applying for non -flow -free services."}
{"task": "rw_52.jsonl", "id": 55424, "text": "When you use the NetEase Cloud Music Account registration and login game recommendation center, you need to provide your ID number and real name.", "label": ["Important", "First Party Collection Information"], "rewrite": "Your ID number and real name are used for the game of NetEase Cloud Music Account Registration and Login Game Recommendation Center."}
{"task": "rw_52.jsonl", "id": 55425, "text": "If you do not provide identity authentication information, we will not be able to provide you with related functions and services.", "label": ["Important", "First Party Collection Information"], "rewrite": "Without providing identity authentication information, we will not be able to provide you with related functions and services."}
{"task": "rw_52.jsonl", "id": 55426, "text": "In order to achieve the purpose of identity certification, you agree and authorize that we can provide, inquire, and check your aforementioned identity information on our own or entrusted to the third direction of the relevant identity authentication agency (such as personal credit reporting agencies, government departments, etc.).", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "You agree and authorize that we can provide, inquire, and check your aforementioned identity information for relevant identity authentication agencies (such as personal credit reporting agencies, government departments, etc.) in the third direction."}
{"task": "rw_52.jsonl", "id": 55427, "text": "Please note that your mobile phone number, verification code matching result, ID number, real name, facial feature recognition information, etc. are personal sensitive information. Please provide it with caution.Normal use and service.", "label": ["Important", "First Party Collection Information"], "rewrite": "Please be careful to provide personal sensitive information."}
{"task": "rw_52.jsonl", "id": 55428, "text": "At the same time, we also provide the cancellation function of the registered account. In the case that meets the requirements of the service agreement and the relevant national laws and regulations, you can cancel the account on your own \"delete account\" page.", "label": ["Important", "Edit/Control"], "rewrite": "You can cancel your account on your own \"Delete account\" page."}
{"task": "rw_52.jsonl", "id": 55429, "text": "You can log in to NetEase Cloud Music official website https://music.163.com/, click Personal Settings -Binding Settings -Delete the account, and perform the corresponding operation according to the prompts.", "label": ["Important", "Edit/Control"], "rewrite": "You can log in to NetEase Cloud Music official website https://music.163.com/, click Personal Settings -Binding Settings -Delete account."}
{"task": "rw_52.jsonl", "id": 55430, "text": "After the cancellation of your Netease Cloud Music account, we will stop providing you with Netease Cloud Music services, and delete your personal information or do anonymous processing according to your requirements, except for other provisions of laws and regulations.", "label": ["Important", "Edit/Control"], "rewrite": "After cancellation, it will stop providing services, delete your personal information or do anonymous processing, except for other provisions of laws and regulations."}
{"task": "rw_52.jsonl", "id": 55431, "text": "5. Scan the QR code/AR scanning/shooting photos and related editing functions", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55432, "text": "When you use scanning QR codes/AR scanning/shooting photos, we need to authorize us to access the camera permissions and storage permissions of your device, and collect pictures you provide based on scanning QR codes and photos uploaded after taking photos.information.", "label": ["Permission Acquisition", "Important"], "rewrite": "We need you to authorize the camera permissions and storage permissions, and collect picture information uploaded after scanning QR codes and taking photos."}
{"task": "rw_52.jsonl", "id": 55433, "text": "Your photo may contain personal sensitive information, please provide it with caution.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55434, "text": "6. Recording video/language interaction/humming recognition/recording function", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55435, "text": "When you use voice interaction, humming recognition, and recording function, we need to authorize us to access your microphone permission/recording right, and may collect your voice interaction information and recording sounds.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "We need you to authorize the microphone permissions/recording permissions, and may collect your voice interaction information and recording sound."}
{"task": "rw_52.jsonl", "id": 55436, "text": "If you click the feedback recognition when you use humming recognition, we need to collect your humming audio to optimize related services.", "label": ["Important", "First Party Collection Information"], "rewrite": "We need to collect your humming audio for optimizing related services."}
{"task": "rw_52.jsonl", "id": 55437, "text": "Your sound texture is a personal sensitive information, please provide it with caution.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55438, "text": "If you use recording video -related functions, you also need to authorize us to access your device interior authority and storage permissions, and collect video information uploaded after shooting videos.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "You need to authorize the equipment for the equipment and storage permissions, and provide video information uploaded after shooting videos for recording videos."}
{"task": "rw_52.jsonl", "id": 55439, "text": "The videos you provide may contain personal sensitive information, please provide it with caution.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55440, "text": "7. People nearby/Listen together", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55441, "text": "If you use \"nearby people\" or \"listening together\" functions, we need to authorize us to access your location permissions and collect your location information in order to recommend you nearby users or show you in the \"Listening Together\" functionThe distance with other users.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "Apply to authorize your location permissions and collect your location information in order to recommend nearby users or show your distance from other users."}
{"task": "rw_52.jsonl", "id": 55442, "text": "Your location information is a personal sensitive information, please provide it with caution.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55443, "text": "If you don't want others to see you on the \"nearby people\" page, you can choose to close in [Mine]-[Settings]-[Message and Privacy Settings].", "label": ["Important", "Edit/Control"], "rewrite": "You can choose to close the \"nearby people\" related functions in [Mine]-[Settings]-[Message and Privacy Settings]."}
{"task": "rw_52.jsonl", "id": 55444, "text": "8. Information release function", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55445, "text": "When you use the information release function in Netease Cloud Music, according to the requirements of relevant laws and regulations, we need to collect your mobile phone number and verification code matching results (personal sensitive information).", "label": ["Important", "First Party Collection Information"], "rewrite": "We need to collect your mobile phone number and verification code matching result (personal sensitive information)."}
{"task": "rw_52.jsonl", "id": 55446, "text": "At the same time, we may need to collect corresponding personal information and obtain the corresponding permissions according to your release behavior and the type of content published.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55447, "text": "For example, when you post graphic or video mlog in Yuncun Plaza, we need to authorize us to access your camera permissions and/or photo permissions, storage permissions, and collect photos or video information you need to post (may include personal sensitivity (personal sensitivityinformation).", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "Apply for your camera permissions and/or photo permissions, storage permissions, and collect photos or video information you need to post for the release of graphic or video mlog."}
{"task": "rw_52.jsonl", "id": 55448, "text": "If you need to publish your location at the same time when you publish mlogs, we need to authorize us to access your location permissions and collect your location information (personal sensitive information).", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "Apply for your location permissions and collect your location information (personal sensitive information) for publishing your location."}
{"task": "rw_52.jsonl", "id": 55449, "text": "Please note that if the information you posted involves the personal information of others, you should obtain the consent of others before the release.", "label": ["Important", "First Party Collection Information"], "rewrite": "If the information published involves the personal information of others, you should obtain the consent of others before the release."}
{"task": "rw_52.jsonl", "id": 55450, "text": "9. Friends recommendation function", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55451, "text": "In order to recommend the person you might know, we need to authorize us to visit the communication records in your mobile phone and collect the relevant address book information (including the name of the contact person and the corresponding contact information, the list of friends), so that we recommend you to youThe contact in the address book, or authorize us to get the list of friends in your Weibo.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "Apply for communication records and collect relevant address book information (including contact names and corresponding contact information, friends list) in order to recommend your contact person in the communication record."}
{"task": "rw_52.jsonl", "id": 55452, "text": "Your address book information and friends list are personal sensitive information. Please provide it with caution. If you refuse to provide it, it will cause you to make you unable to use this feature, but it does not affect other functions of using Netease Cloud Music normally.", "label": ["First Party Collection Information", "Risk"], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55453, "text": "Please know that if the address book uploaded by other users contains your contact information and other information, we may recommend you to the corresponding users based on the information.", "label": ["Usage"], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55454, "text": "If you don't want to be recommended to friends, you can choose to close in [Mine]-[Settings]-[Message and Privacy Settings].", "label": ["Important", "Edit/Control"], "rewrite": "You can choose to close the \"friend recommendation\" function in [Mine]-[Settings]-[Message and Privacy Settings]."}
{"task": "rw_52.jsonl", "id": 55455, "text": "10. Share and event participation", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55456, "text": "In the case of sharing or receiving information, participation in activities, we need to access your shear board and read the passwords, links, etc. contained in it to achieve functions or services such as jumping, sharing.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "You need to access your shear board and read the passwords, links, etc. contained in it to achieve functions or services such as jumping, sharing."}
{"task": "rw_52.jsonl", "id": 55457, "text": "11. Product purchase and payment function", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55458, "text": "In order to facilitate the delivery of goods or services to you, you need to provide us at least to provide us with personal identity information, names, receipt addresses, postal codes, consignees, contact telephones, and payment status information according to the prompts.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the consignee's personal identity information, name, delivery address, postal encoding, consignor, contact number, payment status information for delivery of goods or services."}
{"task": "rw_52.jsonl", "id": 55459, "text": "If you refuse to provide such information, we will not be able to complete the relevant delivery service.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55460, "text": "If you order goods or services for others through Netease Cloud Music, you need to provide the aforementioned information of the actual ordering person.", "label": ["Important", "First Party Collection Information"], "rewrite": "You need to provide the relevant personal information of the actual ordering person for ordering goods or services for others."}
{"task": "rw_52.jsonl", "id": 55461, "text": "Before you provide us with the aforementioned information of the actual ordering person, you need to ensure that you have obtained its authorization consent.", "label": ["Important", "First Party Collection Information"], "rewrite": "Before you provide us with the aforementioned information of the actual ordering person, you need to ensure that you have obtained its authorization consent."}
{"task": "rw_52.jsonl", "id": 55462, "text": "If you generate payment settlement during our service, during the payment settlement process, you can choose our affiliated parties or cooperate with our third -party payment institutions (including NetEase Payment, Alipay Pay, WeChat Pay, Apple Pay and UnionPay, Nets, Nets, NetsThe payment channels provided by Lianfeng Payment Channel are called \"payment institutions\").", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55463, "text": "During the payment service, we may need to share your NetEase cloud music order number and transaction amount information with these payment institutions to achieve its confirmation of your payment instructions and complete the payment.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share your NetEase Cloud music order number with the transaction amount information with the transaction amount to confirm your payment instructions and complete the payment."}
{"task": "rw_52.jsonl", "id": 55464, "text": "In order to show the order information of your account and ensure your after -sales rights, we will collect the order information, transactions and consumption records, virtual property information (personal sensitive information) you generated during the use of Netease Cloud Music processYou manage the order.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect order information, transactions and consumption records, virtual property information (personal sensitive information) for you to display and conduct order management."}
{"task": "rw_52.jsonl", "id": 55465, "text": "If a transaction refund occurs, we may ask you to provide your bank account information, including bank card information, Alipay, and WeChat payment third -party account information (personal sensitive information) to handle the refund request for you.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your bank account information, including bank card information, Alipay, and WeChat payment third -party account information (personal sensitive information) for processing refund requests."}
{"task": "rw_52.jsonl", "id": 55466, "text": "When you contact us, we may save your communication/call records and content or the contact information and related information (personal sensitive information) you left in order to contact you or help you solve the problem or record related issues related to youHandling schemes and results.", "label": ["Important", "First Party Collection Information"], "rewrite": "Will save your communication/call records and content or contact information in order to contact you or solve the problem, or record the processing plan and results."}
{"task": "rw_52.jsonl", "id": 55467, "text": "In order to confirm the status of the transaction and provide you with after -sales and dispute solutions, we will collect, pay, logistics information such as transaction objects, payment institutions, and logistics companies based on the exchanges based on the exchange.The above -mentioned transactions, payment, and logistics information shared with the relevant service providers.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Collect transactions, payment, logistics information related to transaction progress, and share it with relevant service providers."}
{"task": "rw_52.jsonl", "id": 55468, "text": "12. Live Lianmai service", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55469, "text": "When you use the function of Lianmai service, we will apply for your microphone rights and collect the voice information collected by the microphone (personal sensitive information).", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "Apply for your microphone rights and collect the voice information collected by the microphone (personal sensitive information)."}
{"task": "rw_52.jsonl", "id": 55470, "text": "If you turn on the microphone right or refuse to provide this information, you will not be able to achieve Lianmai, but it will not affect other functions of your use of Netease Cloud Music normally.", "label": ["First Party Collection Information", "Permission Acquisition"], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55471, "text": "13. Music alarm service/setting ringtone service", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55472, "text": "When you use a music alarm clock/setting ringtone service, you need to turn on the storage permissions and download the music alarm clock or ringtone.", "label": ["Permission Acquisition", "Important"], "rewrite": "You need to turn on the storage permissions, below to download the music required for the music alarm clock or ringtone."}
{"task": "rw_52.jsonl", "id": 55473, "text": "In order to use the music alarm function, you also need to turn on the notification permissions to allow us to send you notifications. If you do not open the notification permissions, the music alarm clock will not be ringing.", "label": ["Permission Acquisition", "Important"], "rewrite": "You need to open the notification permissions to use the music alarm clock function."}
{"task": "rw_52.jsonl", "id": 55474, "text": "In order to use the setting ringtone service, you may also need to turn on the modification system settings on your device to achieve the ringtone settings.", "label": ["Permission Acquisition", "Important"], "rewrite": "The modification system settings on the device need to be turned on to achieve the bell settings."}
{"task": "rw_52.jsonl", "id": 55475, "text": "14. Service based on Bluetooth/Siri", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55476, "text": "When you need to use Bluetooth to connect smart devices, you need to turn on Bluetooth authority.", "label": ["Permission Acquisition", "Important"], "rewrite": "When using Bluetooth to connect smart devices, Bluetooth authority needs to be turned on."}
{"task": "rw_52.jsonl", "id": 55477, "text": "If you need to control and use Netease Cloud Music through Siri, you need to open Siri and search permissions.", "label": ["Important", "Edit/Control"], "rewrite": "With Siri control and using Netease Cloud Music, Siri and search permissions need to be opened."}
{"task": "rw_52.jsonl", "id": 55478, "text": "15. Maintain account security, ensure normal operation of services, and optimize service experience", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55479, "text": "In the process of using our service, to identify the abnormal status of the account, understand the product adaptability, provide you with basic services such as browsing, searching, and ensure the normal operation of the service and optimize the service experience.The services you use and the information are related to this information. This information includes:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55480, "text": "(1) Log Information: When you use our services, we may automatically collect your detailed usage of our services as related online logs.", "label": ["Important", "First Party Collection Information"], "rewrite": "It will automatically collect your detailed usage of our services and save it as a network log."}
{"task": "rw_52.jsonl", "id": 55481, "text": "For example, your login account, search query content, IP address, browser type, telecommunications operator, network environment, language use, visit date and time and web browsing records you access, PUSH open records, stay time, refresh records, Publish records, attention, subscriptions, collection and sharing.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55482, "text": "The operating system and version, client version, device resolution, package name, device settings, process and software lists, unique device identifiers (IMEI/, Android, ID/Open, Udid/GUID/MAC/SIM card IMSI information),Software and hardware feature information), information related to the location of the device (such as IP address, GPS location information).", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the equipment related information you use (such as IMEI, Mac, Serial, SIM card IMSI identification code, device model, operating system and version, client version, equipment resolution, package name, device settings, process and software lists, lists, software lists, software lists, software lists, software lists, software lists, software lists, software lists, software lists, software lists, software lists, software lists, software lists, software lists, software lists, software lists, software lists, software lists, software lists, software lists, software lists, software lists, software lists, software lists, software lists, software lists, and software lists, and software lists, and software lists, and software lists, and software lists, and software lists, and software lists, and software lists, and software lists, and software lists, and software lists, processes and software lists.The only device identifier (IMEI/Android ID/Open Udid/GUID/MAC/SIM card IMSI information), software and hardware feature information), and the location related information (such as IP address, GPS location information)."}
{"task": "rw_52.jsonl", "id": 55483, "text": "In order to collect the above -mentioned personal equipment information, we will apply for the relevant permissions of your device, including equipment information permissions and location permissions.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "Apply for access to equipment information permissions, location permissions, etc. to collect personal equipment information."}
{"task": "rw_52.jsonl", "id": 55484, "text": "Please note that separate equipment information and log information are information that cannot recognize specific natural person status.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55485, "text": "If we use this type of non -personal information with other information to identify a specific natural person or use it with personal information, during the combination of use, such non -personal information will be regarded as personal information, except for obtaining your authorization.Or in addition to other provisions of laws and regulations, we will anonymous and de -identification processing of this type of personal information.", "label": ["Important", "Data Security"], "rewrite": "If the combination of non -personal information and other information is used to identify natural persons, this type of personal information will be anonymous and de -identified."}
{"task": "rw_52.jsonl", "id": 55486, "text": "This information will be handled and protected as your personal information in accordance with this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55487, "text": "16. News notice", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55488, "text": "For your contact information (for example: contact email and telephone) you provided in the process of using the service, we may send one or more of them in the operation to send multiple types, Safety verification, user experience survey and other uses;", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55489, "text": "In addition, we may also send you commercial information such as services, functions or activities that you may be interested in in the way you may be interested in.", "label": ["Usage"], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55490, "text": "If you don't want to accept this information, you can withdraw the booking method provided by the mobile phone SMS.", "label": ["Important", "Edit/Control"], "rewrite": "You can withdraw business information through the method provided by mobile phone text messages."}
{"task": "rw_52.jsonl", "id": 55491, "text": "17. Provide information display and push of goods or services", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55492, "text": "Based on the information you provided to us, the information we may collect, and your information we collected indirectly (such as your browsing, searching and listening records, equipment information, location information, order information), we may be based onThe combination of one or several information above, conduct recommendation algorithm modeling, programmatic advertising recommendation algorithm modeling, user behavior analysis, and user portraits to extract your browsing, search preferences, behavioral habits, location information related features in orderProvide you with page display and recommendation of personalized content that meets your needs.", "label": ["Important", "Usage"], "rewrite": "We may make recommendation algorithm modeling, programmatic advertising recommendation algorithm modeling, user behavior analysis, and user portraits in order to recommend personalized content."}
{"task": "rw_52.jsonl", "id": 55493, "text": "We may also provide or promote the following products and services of our or third parties based on the method in the \"message notification\" of the \"message notification\" above:", "label": ["Usage"], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55494, "text": "Our goods and services include but are not limited to: instant messaging services, online media services, interactive entertainment services, social network services, payment services, Internet search services, location and map services, application software and services, data management software and services, services, data management software and services, and services, data management software and services, and services, data management software and services, and services, data management software and services, and services, data management software and services.Online advertising services, Internet finance and other social media, entertainment, online games, e -commerce, information and communication software and services;", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55495, "text": "and", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55496, "text": "Third -party products and services include but are not limited to: Internet services, food and catering, sports, music, movies, television, live performances and other arts and entertainment, books and books, magazines and other publications, clothing and accessories, jewelry, cosmetics, individuals, individuals, individuals, individualsHealth and hygiene, electronics, collectibles, home utensils, electrical appliances, home decoration and furnishings, pets, cars, hotels, transportation and tourism, banking, insurance and financial services, points and reward programs, as well as others we think may be related to youCommodity and services.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55497, "text": "We will carry out personalized recommendation or directional push in accordance with the following rules, and provide you with the corresponding exit mechanism:", "label": ["Important", "Usage"], "rewrite": "We will carry out personalized recommendation or directional push in accordance with the following rules, and provide you with the corresponding exit mechanism:"}
{"task": "rw_52.jsonl", "id": 55498, "text": "i., We will provide you with personalized promotion content based on your personal information (such as browsing, searching and listening to song records, equipment information, location information, order information), such as in the song list marked \"Daily Recommended\"Recommend your music you may like.", "label": ["Important", "Usage"], "rewrite": "We will provide you with personalized promotion content based on your personal information (such as browsing, searching and listening records, equipment information, location information, order information)."}
{"task": "rw_52.jsonl", "id": 55499, "text": "II., We will show you the directed push advertisements (such as \"browsing, searching and listening records, equipment information, location information, order information) (labeled the\" advertisement \") to you.", "label": ["Important", "Usage"], "rewrite": "It will show you the advertising for targeted push according to your personal information (such as browsing, searching and listening to song records, equipment information, location information, order information)."}
{"task": "rw_52.jsonl", "id": 55500, "text": "You can turn off the \"Personalized Service\" switch through the \"Settings-Message and Privacy Settings-Personalized Service\" page.", "label": ["Important", "Edit/Control"], "rewrite": "You can turn off the \"Personalized Service\" switch through the \"Settings-Message and Privacy Settings-Personalized Service\" page."}
{"task": "rw_52.jsonl", "id": 55501, "text": "After closing, the correlation between the advertisement and content display you see will be reduced.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55502, "text": "18. Provide you with customer service or other user response functions", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55503, "text": "When you contact our customer service or use other users to respond to functions (such as selling after -sale after sale, personal information protection complaints or suggestions, other customer complaints and needs), we may need you to provide the necessary personal informationUser identity to ensure your account and system security.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect the necessary personal information for matching and verifying your user identity."}
{"task": "rw_52.jsonl", "id": 55504, "text": "We may also save your contact information (you use us when you contact us or other contact information you provide to us), you have the communication/call records and content with our communication, and other necessary information associated with your needs.In order to contact you or help you solve the problem, or record the processing schemes and results of related issues.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Will save your contact information, communication/call records and content, to contact or solve the problem, and record the processing plan and results."}
{"task": "rw_52.jsonl", "id": 55505, "text": "19. Provide you with security guarantee", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55506, "text": "In order to improve the security of your service to provide services with our and partners, protect the safety of your or other users or the public from being infringed, and better prevent fishing websites, fraud, network vulnerabilities, computer viruses, network attacks, network invasion, etc.Security risk, more accurately identify the rules of violations of laws and regulations or the relevant agreement rules of the Netease Cloud Music Service, we may collect, use or integrate your account information, transaction information, equipment information, log information, and our affiliated companies and partners to obtainIf you authorize or share information shared by the law, you can comprehensively judge your account and transaction risk, conduct authentication, test and prevent security incidents, and take necessary records, audit, analysis, and disposal measures in accordance with the law.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "Collect, use, or integrate your account information, transaction information, equipment information, log information, and information that you authorize or shared according to law to comprehensively judge transaction risks, conduct authentication, test and prevent security incidents."}
{"task": "rw_52.jsonl", "id": 55507, "text": "20. Improve our service", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55508, "text": "We may allow you to participate in the investigation of Netease Cloud Music services to help us improve existing services or design new services;", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55509, "text": "At the same time, we may use your information for software updates.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55510, "text": "21. Other uses", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55511, "text": "You understand and agree that after collecting your personal information, we may use technical means to identify the data to identify the information, and the information processed information will not be able to identify your identity. In this case, we have the right to use itThe information of the user's database is analyzed and used to commercialize the use without obtaining your consent.", "label": ["Important", "Risk", "Usage"], "rewrite": "We have the right to use the information that has been identified, analyze and commercialize the user database without having to obtain your consent separately."}
{"task": "rw_52.jsonl", "id": 55512, "text": "22. Exception of obtaining authorization consent", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55513, "text": "However, according to relevant laws and regulations, collecting your information in the following situations does not need to obtain your authorization consent:", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "In the following situations, collect your information without obtaining your authorization consent:"}
{"task": "rw_52.jsonl", "id": 55514, "text": "(1) Performing the obligations stipulated in laws and regulations;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting personal information related to obligations stipulated in laws and regulations, no consent is required."}
{"task": "rw_52.jsonl", "id": 55515, "text": "(2) Directly related to national security and national defense security;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting personal information directly related to national security and national defense security does not need to solicit consent."}
{"task": "rw_52.jsonl", "id": 55516, "text": "(3) Directly related to public safety, public health, and major public interests;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect personal information directly related to public safety, public health, and major public interests without soliciting consent."}
{"task": "rw_52.jsonl", "id": 55517, "text": "(4) Directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect direct personal information related to criminal investigation, prosecution, trial, and execution of judgment without asking for consent."}
{"task": "rw_52.jsonl", "id": 55518, "text": "(5) For major legitimate rights and interests such as maintaining your or other individuals, but it is difficult to get your consent;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting and maintaining major legitimate rights and interests but difficult to get personal information that I agree, without asking for consent."}
{"task": "rw_52.jsonl", "id": 55519, "text": "(6) The personal information collected is made by your own public;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "The collected personal information is made by your own public without asking for consent."}
{"task": "rw_52.jsonl", "id": 55520, "text": "(7) Collecting information from the personal information disclosed by legal publicity, such as legal news reports and government information disclosure;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If the information is collected from the personal information disclosed legal and publicly disclosed, no consent is required."}
{"task": "rw_52.jsonl", "id": 55521, "text": "(8) Signing and fulfilling the contract according to your requirements;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting the personal information necessary for the signing and performing the contract without soliciting consent."}
{"task": "rw_52.jsonl", "id": 55522, "text": "(9) Maintaining the safe and stable operation of Netease Cloud Music, such as discovering and disposing of products or services;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting the personal information necessary for the safe and stable operation of Netease Cloud Music, there is no need to solicit consent."}
{"task": "rw_52.jsonl", "id": 55523, "text": "(10) What is necessary for legal news reports;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting personal information necessary for legal news reports does not need to ask for consent."}
{"task": "rw_52.jsonl", "id": 55524, "text": "(11) When it is necessary to carry out statistics or academic research in public interests, and provide academic research or description results, the information contained in the results is identified;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "The collection of personal information for statistics or academic research in the collection of public interests does not need to solicit consent."}
{"task": "rw_52.jsonl", "id": 55525, "text": "(12) Other circumstances stipulated in laws and regulations.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If you collect personal information under other circumstances stipulated in laws and regulations, you do not need to solicit consent."}
{"task": "rw_52.jsonl", "id": 55526, "text": "23. Tips on specific functional permissions", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55527, "text": "If you need to close your functional permissions (including camera permissions, photo permissions, microphone permissions, communication records, storage permissions, equipment information permissions, etc.), most mobile devices will support yourFor the requirements, please refer to or contact your mobile device service providers or manufacturers.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55528, "text": "Please note that when you start the right of power, it means that you authorize us to collect and use relevant information to provide you with corresponding services. Once you turn off the right of authority, it means that you cancel the authorization.Using relevant information, it is impossible to provide you with the service corresponding to the permissions.", "label": ["Permission Acquisition", "Important", "Edit/Control"], "rewrite": "Opening one authority means that you authorize us to collect and use relevant information. Once you turn off the right of power, it means that the authorization will be canceled. It will no longer continue to collect and use relevant information based on the corresponding authority."}
{"task": "rw_52.jsonl", "id": 55529, "text": "However, your decision to close permissions will not affect the collection and use of information based on your authorization.", "label": ["Permission Acquisition", "Important", "Risk"], "rewrite": "The decision to close permissions will not affect the collection and use of information based on authorization."}
{"task": "rw_52.jsonl", "id": 55530, "text": "24. Tips about personal sensitive information", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55531, "text": "Personal sensitive information refers to personal information that once leaked, illegally provided or abuses the security of people's body and property, and it is easy to lead to personal information such as personal reputation, physical and mental health damage or discrimination.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55532, "text": "The above provided by you or we collect your information may include your personal sensitive information, such as ID number, personal biometric information (including facial recognition characteristics, sound patterns, etc.)Records and content, property information (including virtual property information such as virtual currencies, virtual transactions), credit information information, travel trajectory, location information, web browsing records, accommodation information, health and physiological information, trading information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55533, "text": "Please be careful and pay attention to personal sensitive information. You agree that we can process your personal sensitive information according to the purpose and method described in this policy.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55534, "text": "2. How do we use cookies or similar technologies", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55535, "text": "We or our third -party partners may obtain and use your information through Cookies or similar technologies, and store these information as log information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We or third -party partners may obtain and use your information through cookies or similar technologies, and store such information as log information."}
{"task": "rw_52.jsonl", "id": 55536, "text": "By using Cookies, we provide users with a simple and easy -going and personalized network experience.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55537, "text": "A cookies are a small amount of data, which are sent from a network server to your browser and there are computer hard disks.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55538, "text": "We use cookies to benefit its users.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55539, "text": "For example, in order to make Netease Cloud Music's login process faster, you can choose to have a cookies in a cookies.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55540, "text": "This way, when you log in to the service of Netease Cloud Music, you can be more convenient and fast.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55541, "text": "Cookies can help us determine the pages and content you are connected, the time you spend on Netease Cloud Music and the NetEase Cloud Music Page you choose.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55542, "text": "Cookies enables us to serve you better and faster, and make your experience in Netease Cloud Music more personalized.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55543, "text": "However, you should be able to control whether cookies and how your browser is accepted.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55544, "text": "Please check the files attached to your browser to get more information in this area.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55545, "text": "We and third -party partners may collect and use your information through cookies or similar technologies and store such information.", "label": ["Data Retention", "Important", "First Party Collection Information"], "rewrite": "We and third -party partners may collect and use your information through cookies or similar technologies and store such information."}
{"task": "rw_52.jsonl", "id": 55546, "text": "We use our own cookies or similar technologies, which may be used for the following uses:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55547, "text": "(1) Remember your identity.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55548, "text": "For example: cookies or similar technologies help us identify your identity as our registered user, or save you to provide us with your preferences or other information;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55549, "text": "(2) Analyze the situation of your service.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55550, "text": "We can use Cookies or similar technologies to understand what activities or services or services you use Netease Cloud Music;", "label": ["Important", "Usage"], "rewrite": "We can use cookies or similar technologies to learn about your usage."}
{"task": "rw_52.jsonl", "id": 55551, "text": "and", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55552, "text": "(3) Advertising optimization.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55553, "text": "Cookies or similar technologies help us provide you with advertisements related to you instead of universal advertising according to your information.", "label": ["Important", "Usage"], "rewrite": "Cookies or similar technologies will provide advertisements related to you based on your information, rather than general advertising."}
{"task": "rw_52.jsonl", "id": 55554, "text": "When we use Cookies or similar technologies for the above purposes, we may provide non -personal identity information collected through cookies or similar technologies to advertisers and other partners to analyze how you and other users use Netease Cloud Music and use it for advertising servicesEssence", "label": ["Important", "Usage"], "rewrite": "We may provide third parties such as non -personal identity information collected through cookies or similar technologies to analyze the user's usage."}
{"task": "rw_52.jsonl", "id": 55555, "text": "Netease Cloud Music may have Cookies or similar technologies placed by advertisers and other partners.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55556, "text": "These cookies or similar technologies may collect non -personal identity information related to you to analyze how users use such services, send ads that you may be interested in, or to evaluate the effect of advertising services.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "These cookies or similar technologies may collect non -personal identity information to analyze the user's usage, personalized recommendation, and evaluation service effects."}
{"task": "rw_52.jsonl", "id": 55557, "text": "You can refuse or manage cookies through the browser or user selection mechanism.", "label": ["Important", "Edit/Control"], "rewrite": "You can refuse or manage cookies through the browser or user selection mechanism."}
{"task": "rw_52.jsonl", "id": 55558, "text": "But please note that if you stop cookies, we may not be able to provide you with the best service experience, and certain services may not be able to use it normally.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "If cookies are discontinued, you may not be able to provide you with the best service experience, and certain services may not be used normally."}
{"task": "rw_52.jsonl", "id": 55559, "text": "At the same time, you will still receive advertisements, but these advertisements will be reduced with you.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55560, "text": "Third, we may share, transfer or disclose personal information", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55561, "text": "(1) Sharing", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55562, "text": "We attach great importance to protecting your personal information.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55563, "text": "Except for the following situations, without your consent, we will not share your information with any third party other than us:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Except for the following situations, without your consent, we will not share your information with any third party:"}
{"task": "rw_52.jsonl", "id": 55564, "text": "1. Provide us our services.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55565, "text": "We may share your information from the partners and other third parties to achieve the core functions you need or provide the services you need, such as providing the corresponding order information to the logistics service provider;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Those who share personal information to achieve core functions or provide services do not need to solicit consent."}
{"task": "rw_52.jsonl", "id": 55566, "text": "Provide information required for real -name certification to real -name certification agencies (such as personal credit reporting agencies, government departments, etc.);", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you provide real -name authentication information to the real -name certification agency and share personal information, you do not need to solicit with."}
{"task": "rw_52.jsonl", "id": 55567, "text": "In the service center service, according to the requirements of the anti -addiction policy, provide your age group information to third -party games (whether you are at the age of 18), so that it can match the corresponding game time limit according to your actual age group;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you provide real -name authentication information to the real -name certification agency and share personal information, you do not need to solicit with."}
{"task": "rw_52.jsonl", "id": 55568, "text": "2. Maintain and improve our services.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55569, "text": "We may share your information from partners and other third parties to help us provide you with more targeted and comprehensive services, such as: representing us to send an email or push notification of communication service providers;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55570, "text": "3. Need to share with related parties.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55571, "text": "In order to facilitate our unified account system to provide you with consistent services and facilitate your unified management, personalized recommendation, guarantee system and account security, your personal information may be necessary to share between us and our affiliated parties.Essence", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to provide you with consistent services, personal information may be necessary to share between us and related parties."}
{"task": "rw_52.jsonl", "id": 55572, "text": "For example: your information collected when you use Netease Cloud Music Services may be used in another service (including NetEase Cloud Music's K song product \"Yinjie\", live product \"LOOK Live\", etc.Provide you with a specific content or show you the information related to you, rather than the general push;", "label": ["Usage", "Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55573, "text": "4. Realize the purpose of the first part of the \"How can we collect and use information\" in this \"Privacy Policy\";", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55574, "text": "5. Perform our obligations and the right to exercise our rights in this \"Privacy Policy\" or we reached with you;", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55575, "text": "6. Shared third -party sharing to third -party partners who entrust us to promote, the purpose is to make these clients understand the coverage and effectiveness of the promotion.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55576, "text": "For example, we can inform how many people of the client read their promotional information or buy the commodity of the client after seeing the information, or provide them with statistical information that cannot recognize personal identity to help them understand their audience or customers.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55577, "text": "7. In the scope permitted by laws and regulations, in order to abide by the law and maintain the interests of our affiliated parties or partners, you or other Netease Cloud Music users or other public interests, property or security, it is exempted from damage.We may exchange information with other companies and organizations.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may exchange information with other companies and organizations to prevent illegal activities such as fraud and reduce credit risk."}
{"task": "rw_52.jsonl", "id": 55578, "text": "However, this does not include the information that violates the promise made in this \"Privacy Policy\" to sell, rent, shared or disclosed in other ways for profit purposes.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The shared personal information does not include the information disclosed for profit purposes that violate the promise made in this \"Privacy Policy\"."}
{"task": "rw_52.jsonl", "id": 55579, "text": "8. In order to be legally needed or with your authorization consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Personal information should be shared with your legal needs or with your authorization consent without asking for consent."}
{"task": "rw_52.jsonl", "id": 55580, "text": "9. Provide your information at the legal requirements of your guardian;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You can provide your information at the legal requirements of your guardian, without asking for consent."}
{"task": "rw_52.jsonl", "id": 55581, "text": "10. According to the service protocol signed with you (including the electronic agreement signed online and the corresponding platform rules) or other legal documents, it provided;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Personal information is shared according to the service agreement signed with you or other legal documents."}
{"task": "rw_52.jsonl", "id": 55582, "text": "11. Provided based on academic research;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Sharing personal information based on academic research does not need to solicit consent."}
{"task": "rw_52.jsonl", "id": 55583, "text": "12. Provided based on the public interests of laws and regulations.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Personal information is shared based on the public interests of laws and regulations, and personal information is not required."}
{"task": "rw_52.jsonl", "id": 55584, "text": "We will only share your information for legal, correct, necessary, specific, and clear purposes.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will only share your information for legal, correct, necessary, specific, and clear purposes."}
{"task": "rw_52.jsonl", "id": 55585, "text": "For companies, organizations, and individuals that share information with us, we will sign a strict confidentiality agreement with them, asking them to handle information in accordance with our instructions, \"Privacy Policy\" and any other related confidentiality and security measures.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will sign a strict confidentiality agreement with the shared subject, asking them to handle information in accordance with our instructions, the \"Privacy Policy\" and other related confidentiality and security measures."}
{"task": "rw_52.jsonl", "id": 55586, "text": "(2) Transfer", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55587, "text": "1. With the sustainable development of our business, we may have a merger, acquisition, asset transfer or similar transactions, and your information may be transferred as part of such transactions.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may have a merger, acquisition, asset transfer or similar transactions, and your information may be transferred as part of such transactions."}
{"task": "rw_52.jsonl", "id": 55588, "text": "We will require new companies and organizations holding your information to continue to be subject to the \"Privacy Policy\". Otherwise, we will ask the company and the organization to solicit with you again.", "label": ["Policy Change", "Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will ask for new personal information holders to continue to be subject to the \"Privacy Policy\", otherwise, we will ask it to re -solicitting the authorization consent."}
{"task": "rw_52.jsonl", "id": 55589, "text": "2. After getting your clear consent, we will transfer your information to a third party.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After getting your clear consent, we will transfer your information to a third party."}
{"task": "rw_52.jsonl", "id": 55590, "text": "(3) Disclosure", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55591, "text": "We will only disclose your information only under the following circumstances and adopt the premise that the industry standards that meet the industry standards:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will disclose your information only in the following circumstances:"}
{"task": "rw_52.jsonl", "id": 55592, "text": "1. According to your needs, disclose the information you specified under your clear consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Discover the information you specified under the disclosure of your clear consent."}
{"task": "rw_52.jsonl", "id": 55593, "text": "2. When the requirements of laws and regulations, mandatory administrative law enforcement or judicial requirements must provide your information, we may disclose your information based on the type and disclosure method required.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In accordance with the requirements of laws and regulations, mandatory administrative law enforcement or judicial requirements, we may disclose your information as required."}
{"task": "rw_52.jsonl", "id": 55594, "text": "Under the premise of compliance with laws and regulations, when we receive a request for the above disclosure information, we ask the receiver to issue corresponding legal documents such as tickets or investigation letters.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When receiving a request for disclosure, we will ask the receiver to issue corresponding legal documents such as tickets or investigation letters."}
{"task": "rw_52.jsonl", "id": 55595, "text": "We firmly believe that for the information requested by us, it should be as transparent as much as possible within the scope of law.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55596, "text": "We have carefully reviewed all the requests to ensure that it has a legal basis and is limited to data obtained by law enforcement agencies because of specific investigations and legitimate rights.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55597, "text": "(4) Sharing, transfer, and disclosure of information.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55598, "text": "In the following circumstances, sharing, transfer, and disclose your information does not need to obtain your authorization consent in advance:", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "In the following circumstances, sharing, transfer, and disclose your information does not need to obtain your authorization consent in advance:"}
{"task": "rw_52.jsonl", "id": 55599, "text": "1. Directly related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Personal information directly related to national security and national defense security does not need to solicit consent."}
{"task": "rw_52.jsonl", "id": 55600, "text": "2. Directly related to public safety, public health, and major public interests;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Personal information directly related to public safety, public health, and direct public interests does not need to solicit consent."}
{"task": "rw_52.jsonl", "id": 55601, "text": "3. Directly related to criminal investigation, prosecution, trial and judgment execution;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Direct related personal information such as criminal investigation, prosecution, trial and judgment execution does not need to solicit consent."}
{"task": "rw_52.jsonl", "id": 55602, "text": "4. For major legitimate rights and interests such as maintaining your or other individuals, but it is difficult to get my consent;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Sharing and maintaining major legitimate rights and interests but difficult to get personal information that I agree, without asking for consent."}
{"task": "rw_52.jsonl", "id": 55603, "text": "5. The information you disclose to the public by yourself;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Share information that you disclose to the public yourself without asking for consent."}
{"task": "rw_52.jsonl", "id": 55604, "text": "6. Collect information from legal publicly disclosed information, such as legal news reports, government information disclosure and other channels.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "If the information is collected from the legal disclosure information, no consent is required."}
{"task": "rw_52.jsonl", "id": 55605, "text": "7. It is related to the obligations stipulated in the performance of our laws and regulations.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Sharing personal information related to the obligations stipulated in our laws and regulations does not need to solicit consent."}
{"task": "rw_52.jsonl", "id": 55606, "text": "According to the law, sharing and transferred information that is identified by the transfer, and ensure that the data receiver cannot restore and re -identify the subject of personal information, which is not shared, transferred and disclosed in information.There will be no need to notify you and obtain your consent.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "The preservation and processing of the data processing data do not need to notify you and obtain your consent."}
{"task": "rw_52.jsonl", "id": 55607, "text": "4. How do we store and protect personal information", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55608, "text": "(1) Storage of personal information", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55609, "text": "In addition to laws and regulations or regulatory authorities, we only store your information in the purpose of the \"Privacy Policy\" in this \"Privacy Policy\".", "label": ["Data Retention", "Important"], "rewrite": "We only store your information in the purpose of this \"Privacy Policy\" and within the shortest time limit."}
{"task": "rw_52.jsonl", "id": 55610, "text": "If we terminate our services or operations, we will stop collecting your personal information in time. At the same time, we will comply with relevant laws and regulations to inform you in advance, and delete or processes your personal information after termination of the service or operation.However, except for laws and regulations or regulatory departments.", "label": ["Cessation of Operations", "Data Retention"], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55611, "text": "The information we collected and generated in the operation of the People's Republic of China is stored in China. Except for the following circumstances:", "label": ["Data Retention", "Important", "Risk"], "rewrite": "The information we collected and generated in the operation of the People's Republic of China is stored in China. Except for the following circumstances:"}
{"task": "rw_52.jsonl", "id": 55612, "text": "1. The laws and regulations have clear stipulation;", "label": ["Data Retention", "Important", "Risk"], "rewrite": "If laws and regulations are clearly stipulated, personal information can be stored abroad."}
{"task": "rw_52.jsonl", "id": 55613, "text": "2. Get your authorization consent;", "label": ["Data Retention", "Important", "Risk"], "rewrite": "If you get your authorization consent, personal information can be stored abroad."}
{"task": "rw_52.jsonl", "id": 55614, "text": "3. The products and services you use are involved in cross -border, and we need to provide your information to our overseas.", "label": ["Data Retention", "Important", "Risk"], "rewrite": "If the products and services you use are involved in cross -border, we need to provide your information overseas."}
{"task": "rw_52.jsonl", "id": 55615, "text": "In response to the above situations, we will ensure that it is implemented in accordance with national laws and regulations and relevant regulatory authorities, and provides sufficient protection for your information.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55616, "text": "(2) Protection of personal information", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55617, "text": "We attach great importance to personal information security, set up a special security team, and take all reasonable and feasible measures to protect your information.", "label": ["Important", "Data Security"], "rewrite": "We have set up a special security team and take all reasonable and feasible measures to protect your information."}
{"task": "rw_52.jsonl", "id": 55618, "text": "1. Data security technical measures", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55619, "text": "We will adopt security measures that meet industry standards, including establishing reasonable institutional specifications and security technology to prevent your information from being accessed and modified by unauthorized access to avoid data damage or loss.", "label": ["Important", "Data Security"], "rewrite": "We will adopt security protection measures that meet industry standards to prevent your information from being accessed and modified by unauthorized access to avoid damage or loss of data."}
{"task": "rw_52.jsonl", "id": 55620, "text": "The network service adopts a variety of encryption technologies. For example, in certain services, we will use encrypted technology (such as SSL) to protect your information, use encryption technology to encrypt your information, and isolate through isolation technology.", "label": ["Important", "Data Security"], "rewrite": "Network services adopt a variety of encryption technologies, such as in certain services, we will use encryption technology (such as SSL) to protect your information."}
{"task": "rw_52.jsonl", "id": 55621, "text": "During information use, such as information display and information association calculations, we will use multiple data desensitization technology to enhance information in use.", "label": ["Important", "Data Security"], "rewrite": "We will use a variety of data desensitization technology to enhance information in use in use."}
{"task": "rw_52.jsonl", "id": 55622, "text": "Use strict data access permissions control and multiple identity authentication technology protection information to avoid data from illegal use.", "label": ["Important", "Data Security"], "rewrite": "We will use strict data access permissions control and multiple authentication technology protection information to avoid illegal use."}
{"task": "rw_52.jsonl", "id": 55623, "text": "2. Other security measures we have taken to protect information", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55624, "text": "We manages the storage and use of information by establishing data classification and grading system, data security management specifications, and data security development specifications.", "label": ["Important", "Data Security"], "rewrite": "We manages the storage and use of information by establishing data classification and grading system, data security management specifications, and data security development specifications."}
{"task": "rw_52.jsonl", "id": 55625, "text": "We control the data through the confidentiality agreement, monitoring and audit mechanism through information contactors.", "label": ["Important", "Data Security"], "rewrite": "We control the data through the confidentiality agreement, monitoring and audit mechanism through information contactors."}
{"task": "rw_52.jsonl", "id": 55626, "text": "Strengthen safety awareness.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55627, "text": "We will also organize safety and privacy protection training courses to strengthen employees' understanding of personal information protection policies and relevant procedures.", "label": ["Important", "Data Security"], "rewrite": "We will organize safety and privacy protection training courses to strengthen employees' understanding of personal information protection policies and relevant procedures."}
{"task": "rw_52.jsonl", "id": 55628, "text": "3. We only allow Netease employees and partners to visit your information, and we have set up strict access control and monitoring mechanisms for this reason.", "label": ["Important", "Data Security"], "rewrite": "We can only allow Netease employees and partners to visit information, and we have set up strict access to control and monitoring mechanisms for this."}
{"task": "rw_52.jsonl", "id": 55629, "text": "We also require all personnel who may contact your information to fulfill the corresponding confidentiality obligations.", "label": ["Important", "Data Security"], "rewrite": "We also require all personnel who may contact your information to fulfill the corresponding confidentiality obligations."}
{"task": "rw_52.jsonl", "id": 55630, "text": "If these obligations fail to fulfill these obligations, they may be held legal or suspended from the cooperation with Netease Cloud Music.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55631, "text": "4. The Internet is not an absolutely secure environment, and the communication method of email, instant messaging, social software or other service software cannot determine whether it is completely encrypted. We recommend that you use this kind of tool to use complex passwords and pay attentionProtect your information security.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55632, "text": "5. The Internet environment is not 100 % security. We will try our best to ensure or guarantee the security of any information you send to us.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55633, "text": "If our physics, technology, or management protection facilities are damaged, the information is caused by unauthorized access, public disclosure, tampering, or destruction, leading to damage to your legitimate rights and interests, we will bear the corresponding legal responsibility.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55634, "text": "6. Safety event disposal", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55635, "text": "When communicating with third parties through NetEase Cloud Music, you can inevitably disclose your information to the other party or the potential transaction, such as the contact method or postal address to the other party or the potential transaction.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55636, "text": "Please protect your information properly and provide others with only necessary situations.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55637, "text": "In order to cope with the possible risks of personal information leakage, damage and loss, we have formulated a number of systems to clarify the classification and classification standards of security events, the classification standards of security vulnerabilities, and the corresponding processing process.", "label": ["Important", "Data Security"], "rewrite": "We have formulated a number of systems to clarify the classification and classification standards of security events, safety vulnerabilities, and corresponding processing processes."}
{"task": "rw_52.jsonl", "id": 55638, "text": "We have also established a special emergency response team for security incidents. In accordance with the requirements of safety incidents, we initiated the safety plan for different security incidents to conduct stop loss, analysis, positioning, formulation of remedial measures, and combined with relevant departments to trace the source and strike.", "label": ["Important", "Data Security"], "rewrite": "We have also established a special emergency response team for security incidents to launch a safety plan for different security incidents."}
{"task": "rw_52.jsonl", "id": 55639, "text": "We also regularly organize internal training and emergency drills to enable our relevant staff to master the corresponding emergency disposal strategies and regulations.", "label": ["Important", "Data Security"], "rewrite": "We also regularly organize internal training and emergency drills to enable relevant staff to master the corresponding emergency disposal strategies and regulations."}
{"task": "rw_52.jsonl", "id": 55640, "text": "After unfortunately, the information security incident occurs, we will inform you in a timely manner in accordance with the requirements of the laws and regulations: the basic situation and possible impact of the security incident, the disposal measures we have taken or we are going to take, the suggestions that you can prevent and reduce risks independently and reduce risks, Remedy for your remedy.", "label": ["Important", "Data Security"], "rewrite": "After the information security incident occurs, we will inform you in a timely manner: the basic situation and possible impact of security incidents, disposal measures, related suggestions, and remedy measures that have been taken or will be adopted."}
{"task": "rw_52.jsonl", "id": 55641, "text": "At the same time, we will inform you that the incident -related situation is in the form of mail, letter, telephone, push notification, etc. When it is difficult to inform the information subject one by one, we will publish an announcement in a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "At the same time, we will inform you of the incident -related situation in time. When it is difficult to inform them one by one, we will publish an announcement in a reasonable and effective way."}
{"task": "rw_52.jsonl", "id": 55642, "text": "At the same time, we will also actively report the disposal of information security incidents in accordance with the requirements of the regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "We will take the initiative to report the disposal of information security incidents in accordance with the requirements of the regulatory authorities."}
{"task": "rw_52.jsonl", "id": 55643, "text": "Please understand that due to the technical restrictions and the limitations of risk prevention, even if we have tried to strengthen security measures, we cannot always ensure that the information is 100 % security.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55644, "text": "You need to understand that the system and communication network you used to access Netease Cloud Music may have problems due to the situation outside the control scope.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55645, "text": "7. We have advanced data as the core of the industry and the data security management system carried out around the data life cycle. From the aspects of organizational construction, system design, personnel management, product technology, etc., we improve the security of the entire system.", "label": ["Important", "Data Security"], "rewrite": "We have a data security management system based on data as the core and revolved around the data life cycle."}
{"task": "rw_52.jsonl", "id": 55646, "text": "5. How to manage personal information", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55647, "text": "(1) Access, update and delete", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55648, "text": "We encourage you to update and modify your information to make it more accurate and effective.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55649, "text": "We will adopt the contact channel for appropriate operation settings, guidance or provision to submit applications to ensure that you can access, update and correct your information or use other information provided when using Netease Cloud Music.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55650, "text": "If you want to query, modify, or delete some of your information, log in to Netease Cloud Music for related operations, or contact us to deal with the contact information stated in this privacy policy.", "label": ["Important", "Edit/Control"], "rewrite": "Query, modify or delete some of your information, please log in to Netease Cloud Music for related operations or contact us for processing."}
{"task": "rw_52.jsonl", "id": 55651, "text": "You can query and modify your avatar, nickname, profile, gender, birthday, region, university through [Account]-[Edit].", "label": ["Important", "Edit/Control"], "rewrite": "Through [Account]-[Personal Homepage]-[Edit], query and modify your avatar, nickname, profile, gender, birthday, region, university."}
{"task": "rw_52.jsonl", "id": 55652, "text": "You can visit your recently played songs, videos, song lists, radio, etc.", "label": ["Important", "Edit/Control"], "rewrite": "Through [Mine]-[Recent Play], visit your recently played songs, videos, song lists, radio and other content."}
{"task": "rw_52.jsonl", "id": 55653, "text": "You can visit the singers you follow, the music you like, the song list, the collection of song lists, the song list you like, the song list you like, and modify the corresponding content in the above modules.Cancel collection and so on.", "label": ["Important", "Edit/Control"], "rewrite": "Through [Account]-[Personal Homepage], visit the singers you are concerned about, the music you like, the song list created, the collective song list, and modify the corresponding content in the above modules."}
{"task": "rw_52.jsonl", "id": 55654, "text": "For your information collected through Cookies or similar technologies, we also explain the selection mechanism provided to you in Article 2 of this \"Privacy Policy\".", "label": ["Important", "First Party Collection Information"], "rewrite": "In the second part of this \"Privacy Policy\", \"How do we use Cookies or similar technologies\" explains the selection mechanism to you."}
{"task": "rw_52.jsonl", "id": 55655, "text": "At the same time, we provide you with the corresponding exit mechanism: you can turn off the \"personalized service\" switch through the \"setting-message and privacy settings-personalized service\" page.", "label": ["Edit/Control", "Important"], "rewrite": "We provide you with a corresponding exit mechanism: you can turn off the \"Personalized Service\" switch through the \"Settings-Message and Privacy Settings-Personalized Service\" page."}
{"task": "rw_52.jsonl", "id": 55656, "text": "After closing, the correlation between the advertisement and content display you see will be reduced.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55657, "text": "Except for other provisions of laws and regulations, when you correct or delete your personal information or apply for a cancellation account, we may not immediately or delete the corresponding information from the backup system, but will be correct or deleted these information when the backup is updated.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "When you correct, delete your personal information, or apply for a cancellation account, you will not immediately correct or delete the corresponding information, but you will be more correct or deleted during the backup update."}
{"task": "rw_52.jsonl", "id": 55658, "text": "(2) Account cancellation", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55659, "text": "We provide you with the cancellation function of the registered account. In the case that meet the requirements of the service agreement and the relevant national laws and regulations, you can cancel the account on your own \"delete account\" page.", "label": ["Important", "Edit/Control"], "rewrite": "You can cancel your account on your own \"Delete account\" page."}
{"task": "rw_52.jsonl", "id": 55660, "text": "You can log in to NetEase Cloud Music official website https://music.163.com/, click Personal Settings -Binding Settings -Delete the account, and perform the corresponding operation according to the prompts.", "label": ["Important", "Edit/Control"], "rewrite": "Log in to NetEase Cloud Music Official Website https://music.163.com/, click Personal Settings -Binding Settings -Delete account to cancel the account."}
{"task": "rw_52.jsonl", "id": 55661, "text": "After the cancellation of your Netease Cloud Music account, we will stop providing you with Netease Cloud Music services, and delete your personal information or do anonymous processing according to your requirements, except for other provisions of laws and regulations.", "label": ["Important", "Edit/Control"], "rewrite": "After cancellation of accounts, it will stop providing Netease Cloud Music services and delete your personal information or do anonymous processing."}
{"task": "rw_52.jsonl", "id": 55662, "text": "(3) Public and sharing", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55663, "text": "Many of our services allow you not only to share your relevant information with all users using the service, for example, the information you uploaded or published in Netease Cloud Music, and you upload it to othersOr the response made by the published information, upload or publish your information in the open area of unspecified users in Netease Cloud Music, as well as location data and log information including information related to this information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Many of our services allow you to share your relevant information with all users using the service."}
{"task": "rw_52.jsonl", "id": 55664, "text": "As long as you do not delete the information you disclosed or shared, the information may always stay in the public field;", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55665, "text": "Even if you delete the shared information, the relevant information may be cached, copied or stored independently by other users or the third parties that are not controlled by us, or are preserved by other users or such third parties in the public.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "After deleting the shared information, the relevant information may still be cached, replicated or stored independently by third parties, or stored in the public field."}
{"task": "rw_52.jsonl", "id": 55666, "text": "If you disclose or share information through the above channels, we will not bear responsibility for your information leakage.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "We do not bear responsibility for disclosure or sharing of information, which causes information leakage."}
{"task": "rw_52.jsonl", "id": 55667, "text": "Therefore, we remind and ask you to consider whether to disclose or share your information through the above channels.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55668, "text": "Please know that your songs, favorite music, singers, song lists created and collected, your personal information, and published content will be publicly displayed on your personal homepage.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Your song ranking, favorite music, singers, created and collected song lists, your personal information, content published, and other information will be publicly displayed on the personal homepage."}
{"task": "rw_52.jsonl", "id": 55669, "text": "You can manage your personal homepage display settings in [Mine]-[Settings]-[Message and Privacy Settings].", "label": ["Important", "Edit/Control"], "rewrite": "You can manage your personal homepage display settings in [Mine]-[Message and Privacy Settings]."}
{"task": "rw_52.jsonl", "id": 55670, "text": "(4) Change the scope of your authorization consent", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55671, "text": "You can always choose whether to disclose the information.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55672, "text": "Some information is necessary to use Netease Cloud Music, but most of the other information is determined by you.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55673, "text": "You can change your authorization of the scope of information or withdraw your authorization by deleting information and closing the device function.", "label": ["Important", "Edit/Control"], "rewrite": "You can change the scope of authorization or withdraw authorization by deleting information and closing the device function."}
{"task": "rw_52.jsonl", "id": 55674, "text": "When you withdraw authorization, we cannot continue to provide you with the service corresponding to the withdrawal authorization and no longer process your corresponding information.", "label": ["Important", "Edit/Control"], "rewrite": "After the withdrawal authorization, we cannot continue to provide you with the corresponding services, and we will no longer process the corresponding information."}
{"task": "rw_52.jsonl", "id": 55675, "text": "But your decision to withdraw authorization will not affect the information processing based on your authorization.", "label": ["Permission Acquisition", "Important", "Edit/Control"], "rewrite": "The decision to withdraw authorization will not affect information processing carried out based on authorization."}
{"task": "rw_52.jsonl", "id": 55676, "text": "(5) Automatic decision -making of constraint information systems", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55677, "text": "In certain business functions, we may make decisions only based on the non -artificial automatic decision -making mechanism, including information systems, algorithms, etc.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55678, "text": "If these decisions significantly affect your legitimate rights and interests, you have the right to ask us to explain, and we will also provide appropriate relief methods.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55679, "text": "(6) In response to your above request", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55680, "text": "To ensure safety, you may need to provide a written request or prove your identity in other ways.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55681, "text": "We may ask you to verify your identity first, and then process your request.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55682, "text": "For your reasonable request, we do not charge fees in principle, but we will charge a certain cost fee depending on the request that repeats and beyond the reasonable limit.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55683, "text": "For those who have no repetition and need too much technical means (for example, need to develop new systems or fundamentally change the current practice), bring risks to others' legitimate rights and interests or very unrealistic (for example, information involved in backup tapes)We may refuse.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "We may refuse for no repetition, too much technical means, risk or unrealistic requests to legitimate rights and interests."}
{"task": "rw_52.jsonl", "id": 55684, "text": "In the following circumstances, we will not be able to respond to your request:", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "In the following circumstances, we will not be able to respond to your request:"}
{"task": "rw_52.jsonl", "id": 55685, "text": "1. Related to the obligations stipulated in the performance of our laws and regulations;", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "Those who are related to our obligations stipulated in our laws and regulations cannot respond to requests."}
{"task": "rw_52.jsonl", "id": 55686, "text": "2. Directly related to national security and national defense security;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Directly related to national security and national defense security cannot respond to requests."}
{"task": "rw_52.jsonl", "id": 55687, "text": "3. Directly related to public safety, public health, and major public interests;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Those who are directly related to public safety, public health, and major public interests cannot respond to requests."}
{"task": "rw_52.jsonl", "id": 55688, "text": "4. Directly related to criminal investigation, prosecution, trial and execution judgment;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Those who are directly related to criminal investigation, prosecution, trial, and execution judgments cannot respond to requests."}
{"task": "rw_52.jsonl", "id": 55689, "text": "5. We have sufficient evidence to indicate that you have subjective malice or abuse of rights;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "We have sufficient evidence that if you have subjective malice or abuse of rights, we cannot respond to requests."}
{"task": "rw_52.jsonl", "id": 55690, "text": "6. For major legitimate rights and interests such as maintaining your or other individuals, but it is difficult to get your consent;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "It is difficult to respond to the request that maintains major legitimate rights and interests but it is difficult to get my consent."}
{"task": "rw_52.jsonl", "id": 55691, "text": "7. Response your request will cause the legitimate rights and interests of you or other individuals and organizations to be seriously damaged;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "The response request will cause serious damage to the legitimate rights and interests and cannot respond to the request."}
{"task": "rw_52.jsonl", "id": 55692, "text": "8. Involved in business secrets.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Those who involve business secrets cannot respond to requests."}
{"task": "rw_52.jsonl", "id": 55693, "text": "Six, third -party service", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55694, "text": "Netease Cloud Music may access or link to social media or other services provided by third parties (including websites or other service forms).", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55695, "text": "include:", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55696, "text": "(1) You can use the \"Share\" key to share some content (such as songs, music reviews, dynamics) in NetEase Cloud Music to third parties.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55697, "text": "Alternatively, you can use third -party services to log in to Netease Cloud Music.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55698, "text": "These functions may collect your information (including your log information) and install cookies in your device to run the above functions normally;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55699, "text": "(2) We provide you with links to you through advertising or other ways of service, so that you can access third -party services or websites;", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55700, "text": "and", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55701, "text": "(3) Other conditions to access third -party services.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55702, "text": "For example, in order to achieve the purpose of the privacy policy, we may access third -party SDK services or other similar applications (such as embedded code, plug -in, etc.) to improve better customer service and user experienceEssence", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "We may access third -party SDK services or other similar applications (such as embedded code, plug -in, etc.)."}
{"task": "rw_52.jsonl", "id": 55703, "text": "At present, the third -party service providers we connect mainly include the following types:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The third -party service providers we access mainly include the following types:"}
{"task": "rw_52.jsonl", "id": 55704, "text": "1. Used for advertising related services, including advertising display, advertising statistics and monitoring, etc.;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will access third -party service providers for advertising -related services."}
{"task": "rw_52.jsonl", "id": 55705, "text": "2. For message push functions, including mobile phone manufacturer PUSH push, specific events reminders, etc.;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Access to a third -party service provider for message push function."}
{"task": "rw_52.jsonl", "id": 55706, "text": "3. It is used to pay related services, including order payment, transaction behavior verification, income settlement, payment information remittance president, etc.;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Access to third -party service providers for payment related services."}
{"task": "rw_52.jsonl", "id": 55707, "text": "4. Occasionally obtain equipment location permissions, collect equipment information and log information at your consent;;", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "Access to third -party service providers for obtaining equipment location permissions, collecting equipment information and log information."}
{"task": "rw_52.jsonl", "id": 55708, "text": "5. It is used for third -party authorization services, including the login of third -party accounts, sharing related content to third -party products, etc.;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Access to third -party services for third -party authorization services."}
{"task": "rw_52.jsonl", "id": 55709, "text": "6. Used to support product function modules, including live broadcast, video playback, voice recognition, AR, smart customer service, content storage, game joint transport, etc.;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Access to third -party services to support product function modules."}
{"task": "rw_52.jsonl", "id": 55710, "text": "7. Used to optimize product performance, including improving the ability of hardware distribution, reducing server costs, function heat repair, etc.;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Access to third -party services to optimize product performance."}
{"task": "rw_52.jsonl", "id": 55711, "text": "8. For account security, product reinforcement related services, including network monitoring, domain name analysis, anti -hijacking, anti -junk anti -cheating, plus decryption services, etc.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Access to third -party services for account security and product reinforcement related services."}
{"task": "rw_52.jsonl", "id": 55712, "text": "Part of the third -party SDK we access may involve collecting user information for users to provide corresponding services.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Some third -party SDKs we access may involve collecting user information."}
{"task": "rw_52.jsonl", "id": 55713, "text": "If you use such services provided by third -party in our services, you agree to collect and process your information directly.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "If you use a service provided by a third party, you agree to collect and process your information directly."}
{"task": "rw_52.jsonl", "id": 55714, "text": "We will evaluate the legality, legitimacy, and necessity of the third -party collection information, require third parties to take protection measures for your information, and strictly abide by relevant laws and regulations and regulatory requirements.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "The situation of third -party collection information will be evaluated, and third parties are required to take protection measures for your information, and strictly abide by relevant laws and regulations and regulatory requirements."}
{"task": "rw_52.jsonl", "id": 55715, "text": "You can click \"Third -Party SDK Catalogs involved in collecting user personal information\" to learn more about the third -party SDK name of NetEase Cloud Music, the types of personal information and uses collected by Netease Cloud Music.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You can click \"Third -Party SDK Catalog involved in collecting user personal information\" to learn more about the third -party SDK name of Netease Cloud Music, the personal information types and uses collected by Netease Cloud Music."}
{"task": "rw_52.jsonl", "id": 55716, "text": "Third -party social media, third -party payment, third -party games or other third -party services are operated by related third -party.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55717, "text": "If you use these third -party services (including any information you provided to these third parties), you must be subject to the third party's own service terms and information protection statements (rather than this policy). You need to read its clause carefully.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55718, "text": "This policy is only applicable to the personal information we collected, and it does not apply to the service provided by any third party or the rules of information use of third -party information.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55719, "text": "If you find that these third -party services are risky, it is recommended that you terminate related operations to protect your legitimate rights and interests and contact us in time.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55720, "text": "7. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55721, "text": "We suggest: Any minor participating in online activities should obtain the consent of the parents or other guardians (hereinafter referred to as the \"guardian\") in advance.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55722, "text": "We will protect relevant information about minors in accordance with the provisions of relevant national laws and regulations.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55723, "text": "We encourage guardians to guide minors to use Netease Cloud Music services.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55724, "text": "If you are a minor under the age of 14, please notify your guardian to read and accept our \"NetEase Cloud Music Children's Personal Information Protection Rules and Guardian Notes\", and you use Netease Cloud Music services to submit individuals in your useBefore the information, seek its consent and guidance.", "label": ["Specific Audiences", "Important"], "rewrite": "Minors under the age of 14, please notify the guardian to read and accept our \"NetEase Cloud Music Children's Personal Information Protection Rules and Guardian Instructions\"."}
{"task": "rw_52.jsonl", "id": 55725, "text": "8. Notice and revision", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55726, "text": "In order to provide you with better services, we may modify the terms of this \"Privacy Policy\" in a timely manner according to the update of NetEase Cloud Music Services and the relevant requirements of laws and regulations, and release any modification of this \"Privacy Policy\" on this page.These modifications constituted part of the \"Privacy Policy\".", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55727, "text": "For major changes, we will also provide more significant notifications (including website announcement, push notification, pop -up window prompts, or other methods).", "label": ["Policy Change", "Important"], "rewrite": "For major changes, we will also provide a more significant notice."}
{"task": "rw_52.jsonl", "id": 55728, "text": "The major changes in this \"Privacy Policy\" include, but not limited to:", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55729, "text": "1. Make a major change in our service model.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55730, "text": "Such as the purpose of handling personal information, the type of personal information, the use of personal information, etc.;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55731, "text": "2. We have undergone major changes in the structure of ownership.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55732, "text": "Such as changes caused by business adjustments, bankruptcy mergers and acquisitions, etc.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55733, "text": "3. The main object of personal information sharing, transfer or public disclosure has changed significantly;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55734, "text": "4. The right to participate in personal information processing and its exercise methods have changed significantly;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55735, "text": "5. We are responsible for dealing with the responsible departments, contact methods and complaint channels for handling personal information security;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55736, "text": "6. Other important or may seriously affect your personal rights and interests.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55737, "text": "If you do not agree with these changes, you can choose to stop using Netease Cloud Music services;", "label": ["Policy Change", "Important"], "rewrite": "If you don't agree with these changes, you can choose to stop using Netease Cloud Music services."}
{"task": "rw_52.jsonl", "id": 55738, "text": "If you continue to use Netease Cloud Music services, it means that you have fully read, understand, and agree to the constraints of the \"Privacy Policy\" revised.", "label": ["Policy Change", "Important"], "rewrite": "Still continuing to use Netease Cloud Music services, that is, it means that you have fully read, understand, and agree to the constraints of the \"Privacy Policy\" revised."}
{"task": "rw_52.jsonl", "id": 55739, "text": "Any of our modification will put your satisfaction first.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55740, "text": "We encourage you to check our \"Privacy Policy\" every time you use Netease Cloud Music Services.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55741, "text": "We may issue announcements related to service -related services (for example when we suspend, change, and terminate a certain service due to system maintenance).", "label": ["Important", "Cessation of Operations"], "rewrite": "A issuance of service related to service -related announcements (e.g., such as suspension, changes, and termination of a certain service)."}
{"task": "rw_52.jsonl", "id": 55742, "text": "If you don't want to continue the message we push, you can ask us to stop pushing.", "label": ["Edit/Control", "Cessation of Operations", "Important"], "rewrite": "If you don't want to continue the message we push, you can ask us to stop pushing."}
{"task": "rw_52.jsonl", "id": 55743, "text": "However, except for the circumstances of the law or the service agreement, the situation of the sending message is provided.", "label": ["Edit/Control", "Cessation of Operations", "Important"], "rewrite": "If you don't want to continue the message we push, you can ask us to stop pushing, except for the situation in which the message is sent by law or the service agreement."}
{"task": "rw_52.jsonl", "id": 55744, "text": "Nine, how to contact us", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55745, "text": "Hangzhou Le Reading Technology Co., Ltd. will protect your personal information in accordance with this \"Privacy Policy\".", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55746, "text": "We have set up a full -time department for personal information protection.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55747, "text": "If you have complaints and reports on network information security, or you have any issues, opinions or suggestions on this \"Privacy Policy\", your information, and issues of privacy measures on this \"Privacy Policy\" or NetEase Cloud MusicPlease contact us at any time, you can send an email to privacy@service.netease.com or write to the following address: No. 399, NetEase No. 399, NetEase Binjiang District, Hangzhou City, Personal Information Protection Specialist (received);", "label": ["Important", "Contact Information"], "rewrite": "Contact us, you can send email to privacy@service.netease.com or write to the following address: Hangzhou Binjiang District NetEase No. 399 NetEase Phase II Period Perspective Personal Information Protection Specialist (received)."}
{"task": "rw_52.jsonl", "id": 55748, "text": "Postcode: 310052.", "label": ["Important", "Contact Information"], "rewrite": "Postcode: 310052."}
{"task": "rw_52.jsonl", "id": 55749, "text": "Under normal circumstances, we will reply within 15 working days after receiving your questions, opinions or suggestions, and verify your user identity.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55750, "text": "If you are not satisfied with our reply and you still refuse to improve after you feed us, you can also complain to the consumer rights protection department or filed a lawsuit with jurisdiction.", "label": [], "rewrite": []}
{"task": "rw_52.jsonl", "id": 55751, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
