{"task": "rw_59.jsonl", "id": 57718, "text": "\"Soda music\" privacy policy concise version", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57719, "text": "Beijing Micro-Broadcasting Vision Technology Co., Ltd. and its related parties (referred to as \"we\"), as operators of the \"Douyin Music Edition-Soda Music\", know the importance of personal information to you. We will protect you in accordance with the provisions of laws and regulations to protectYour personal information and privacy security.", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57720, "text": "This concise guidance will help you intuitively and concisely understand how we collect, process personal information, and protect your privacy.", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57721, "text": "For more details, please read the complete \"Soda Music Privacy Policy\".", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57722, "text": "1. How do we collect and use information", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57723, "text": "1.1 contact method", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57724, "text": "· [User login] You need to use the registered Douyin account to log in.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "You need to log in with a registered Douyin account."}
{"task": "rw_59.jsonl", "id": 57725, "text": "· [Contact you] Your mobile phone number may be used to send you information such as operations, promotion, activities and other information, or contact you to handle investigations and interviews, complaint feedback, etc. with you.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Your mobile phone number may be used to send information such as operation, promotion, and activities to you."}
{"task": "rw_59.jsonl", "id": 57726, "text": "· [Special Instructions] If you don't want to receive information such as operation, promotion, activities, you can copy the binding according to the specified method in the SMS.", "label": ["Important", "Edit/Control"], "rewrite": "If you do not want to receive information such as operation, promotion, activities, you can unsubscribe bips in the specified method in the SMS."}
{"task": "rw_59.jsonl", "id": 57727, "text": "1.2 Account Information", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57728, "text": "·, [Account Information Synchronization] The basic information related to the Douyin account used by you log in to the \"Soda Music\" app will be displayed simultaneously in the \"Soda Music\" app (such as jitter, avatar, nickname, gender, birthday, regional and personal introductionwait).", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "The basic information related to the Douyin account used in the \"Soda Music\" app will be displayed simultaneously in the \"Soda Music\" APP."}
{"task": "rw_59.jsonl", "id": 57729, "text": "1.3 Equipment, service information", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57730, "text": "· [Equipment information and log information] In the process of software and services safely, we will collect your equipment information and log information.", "label": ["Important", "First Party Collection Information"], "rewrite": "In the process of software and services, we will collect your equipment information and log information."}
{"task": "rw_59.jsonl", "id": 57731, "text": "Equipment information refers to the performance related to equipment models, network identification, network access information, and equipment sensor information.Input privacy information;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57732, "text": "Log information refers to the service log generated during your service.", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57733, "text": "· [Special Instructions] Equipment and log information are also usually used in anti -cheating and judging whether the account is in a safe environment.", "label": ["Important", "Usage"], "rewrite": "Equipment and log information are also usually used in anti -cheating and judging whether the account is in a safe environment."}
{"task": "rw_59.jsonl", "id": 57734, "text": "Some information may also be used for advertising push.", "label": ["Important", "Usage"], "rewrite": "Some information may also be used for advertising push."}
{"task": "rw_59.jsonl", "id": 57735, "text": "At present, most mobile phone systems can support changes to the equipment identifier. For specific methods, please refer to the device or manufacturer's description.", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57736, "text": "1.4 shear plate", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57737, "text": "·, [Share, recognition] In the case of your sharing or receiving information, participation in activities, we need to access your shear board and read the passwords, sharing code, and links contained in it to achieve jumping, sharing, sharing, Activity linkage and other functions or services.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We need to access your shear board and read the passwords, sharing codes, and links contained in it to achieve functions or services such as jumping, sharing, and activity linkage."}
{"task": "rw_59.jsonl", "id": 57738, "text": "· [Statistical Analysis] We may need to statistics through the shear of the source channels of the application. In the statistical process, we will not transmit your personal privacy information of the shear plate.", "label": ["Important", "Usage"], "rewrite": "We may need to statistics through the shear of the source channels of the application. In the statistical process, we will not return you to the personal privacy information of the shear plate."}
{"task": "rw_59.jsonl", "id": 57739, "text": "· [Special Instructions] Systems of some mobile phones and other terminal devices will prompt the application (APP) to read the shear plate, but the system prompts that it cannot distinguish whether the shear information is collected and the error is not ruled out.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Some mobile phones and other terminal devices will prompt the application (APP) to read the shear plate, but the system prompts that it cannot distinguish whether to collect shear information and do not rule out the error alarm."}
{"task": "rw_59.jsonl", "id": 57740, "text": "Therefore, if you find a similar prompt, please contact us so that we can locate the problem.", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57741, "text": "1.5 Use information", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57742, "text": "· [Use behavior] When you use it, we will record your clicks, comments, attention, likes, collection, search, search, play, sharing and other behaviors.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use it, we will record your clicks, comments, attention, praise, collection, search, search, play, sharing and other behaviors."}
{"task": "rw_59.jsonl", "id": 57743, "text": "[Special Instructions] The above information is a record of the actual situation of you use the functions of soda music.", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57744, "text": "1.6 camera", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57745, "text": "· [Release of content] When you shoot the cover of the song list, you need to turn on the camera authority.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you shoot the cover of the song list, you need to turn on the camera authority."}
{"task": "rw_59.jsonl", "id": 57746, "text": "· [Special Instructions] We will never open the camera to steal your privacy, let alone use such illegal means to push information and advertising.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "We will never open the camera to steal your privacy, and we will not use such illegal means to push information and advertising."}
{"task": "rw_59.jsonl", "id": 57747, "text": "2. Use of personal information in the main functions or services", "label": ["Usage"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57748, "text": "Recommended content: Recommend what you might be more interested in", "label": ["Usage"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57749, "text": "· In order to realize the music content that may be more interested in you, we will collect information, equipment information, location information, and serve the service side with this information to provide you with personalized content recommendation services.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We will collect information, device information, location information, server -side, combined with this information to provide you with personalized content recommendation services."}
{"task": "rw_59.jsonl", "id": 57750, "text": "· We will comprehensively statistics and analyze the features and preferences through algorithms to form indirect portrait portraits to recommend, display, or push you information that you may be interested in, or push more suitable for your specific functions and services.", "label": ["Important", "Usage"], "rewrite": "We will comprehensively statistics and analyze the features and preferences through algorithms to form indirect crowd portraits to recommend you."}
{"task": "rw_59.jsonl", "id": 57751, "text": "3. How to better control the use of personal information", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57752, "text": "3.1 Basic function mode", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57753, "text": "· We provide you with a basic function mode. After you enter the basic function, we will provide you with basic functional services on the basis of only collecting necessary information.", "label": ["Important", "Usage"], "rewrite": "We will provide you with basic functional services on the basis of collecting necessary information."}
{"task": "rw_59.jsonl", "id": 57754, "text": "3.2 Management Personalized Recommendation", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57755, "text": "· You can autonomously decide whether to receive personalized recommendation content through the personalized closing function we provided.", "label": ["Important", "Edit/Control"], "rewrite": "You can independently decide whether to receive personalized recommendations through the personalized closing function provided by us."}
{"task": "rw_59.jsonl", "id": 57756, "text": "·, You can pay attention to interested users and adjust it by yourself according to your needs.", "label": ["Edit/Control", "Important"], "rewrite": "You can follow users who are interested and adjust according to your needs."}
{"task": "rw_59.jsonl", "id": 57757, "text": "· When there is no content you are interested in, you can also enter the keywords interested in the search bar, click and read the search results.", "label": ["Important", "Edit/Control"], "rewrite": "When there is no content you are interested in, you can also enter the keywords interested in the search bar, click and read the search results."}
{"task": "rw_59.jsonl", "id": 57758, "text": "3.3 Logging out account", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57759, "text": "· You can log out of the Douyin account you used.", "label": ["Edit/Control", "Important"], "rewrite": "You can cancel the Douyin account you used."}
{"task": "rw_59.jsonl", "id": 57760, "text": "After cancellation, we will delete relevant information about you. If the personal information is difficult to achieve technically, we will conduct anonymous treatment, or stop the treatment except for storage and take necessary security measures.Except for regulations.", "label": ["Important", "Edit/Control"], "rewrite": "After cancellation, we will delete relevant information about you. If it is difficult to achieve technically, it will be anonymous, or stop the processing other than storage and take necessary safety protection measures, except for other regulations."}
{"task": "rw_59.jsonl", "id": 57761, "text": "The full version of \"Soda Music\" privacy policy", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57762, "text": "Modification Date: June 08, 2022", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57763, "text": "Effective date: June 15, 2022", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57764, "text": "You are welcome to use the official \"Douyin Music Edition-Soda Music\" (hereinafter referred to as \"Soda Music\") software and related services!", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57765, "text": "\"Soda Music\" refers to the client application of Beijing Micro -Broadcasting Vision Technology Co., Ltd. and its related parties (hereinafter referred to as \"we\") that is legally owned and operated.\"functional module.", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57766, "text": "As operators of soda music, we know the importance of personal information to you. We will protect your personal information and privacy security in accordance with the provisions of laws and regulations.", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57767, "text": "We formulate this privacy policy and special reminders: I hope you read and understand the privacy policy carefully before using soda music and related services to make appropriate choices.", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57768, "text": "overview", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57769, "text": "We will introduce you how we handle personal information in different scenarios through this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57770, "text": "When you turn on or use soda music, we will handle relevant information in order to realize the functions, services you choose to use, or to comply with laws and regulations.", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57771, "text": "Except for the basic functions of soda music, the information required for services, and the information necessary for laws and regulations, you can refuse us to process other information, but this may cause us to not provide corresponding functions and services.", "label": ["Important", "Usage"], "rewrite": "In addition to the information required for basic functions, services and the required information, you can refuse us to process other information, but this may cause us to not provide corresponding functions and services."}
{"task": "rw_59.jsonl", "id": 57772, "text": "We will explain the relevant situation in the privacy policy. The important terms of your personal information rights and interests have been prompted in a bold form. Please pay special attention.", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57773, "text": "In addition to this privacy policy, in specific scenarios, we will also explain the corresponding information collection purposes, scope and usage methods through instant notifications (including pop -up windows, page prompts, etc.), functional update instructions, etc. These instant notifications will be notified in real time.And functional renewal instructions, such as part of the composition privacy policy, have the same effect as this privacy policy.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57774, "text": "The following will help you understand how we collect, use, store, transmit, open and protect personal information;", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57775, "text": "Help you understand the way query, correct, supplement, delete, copy, and transfer personal information.", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57776, "text": "Among them, the important content of your personal information rights has been prompted in a thick form, please pay special attention.", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57777, "text": "1. How do we collect and use personal information", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57778, "text": "2. Partners involved in the data use process, transfer, and disclose personal information", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57779, "text": "3. Manage your personal information", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57780, "text": "4. How do we protect the security of personal information", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57781, "text": "5. How do we store personal information", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57782, "text": "6. How do we protect minors", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57783, "text": "7. Consultation and revision of privacy policies", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57784, "text": "8. Contact us", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57785, "text": "1 How do we collect and use personal information", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57786, "text": "1.1 account service", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57787, "text": "1.1.1 Registration, login", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57788, "text": "The \"Soda Music\" APP is the associated version of the \"Soda Music\" in the vibrato end of the vibrato side. Related services need to rely on login with Douyin account.", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57789, "text": "You can choose to use the registered Douyin account to log in to the \"Soda Music\" APP. If you have never registered the Douyin account before, when you log in to the \"Soda Music\" APP with your mobile phone number, the system will create a Douyin for youaccount number.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "You can choose to use the registered Douyin account to log in to the \"Soda Music\" APP."}
{"task": "rw_59.jsonl", "id": 57790, "text": "When you choose to log in to the \"Soda Music\" APP and use related services, if your mobile phone number has not registered the Douyin account, we will create a vibrato account for you through the mobile phone number, you can also improve the relevant related relatedNetwork identification information (Douyin, avatar, nickname, password), we collect this information to help you complete registration.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We will create a vibrato account for you through the mobile phone number. You can also improve the relevant network identification information to complete the registration."}
{"task": "rw_59.jsonl", "id": 57791, "text": "Collecting the mobile phone number is a necessary information about the requirements of the national laws and regulations on the requirements of the online real -name system (real identity information certification). If you refuse to provide the mobile phone number for registration and login, we may not be able to provide you with information releases (including publishing song lists, comments, etc.)Function.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If you refuse to provide mobile phone numbers for registration and login, we may not be able to provide you with information release (including publishing song lists, comments, etc.)."}
{"task": "rw_59.jsonl", "id": 57792, "text": "Based on our cooperation with communication operators, when you use the \"one -click login\" function, after your consent, we will use the functions provided by the operator to use the mobile phone number in your device as your registration, login account and exempt from it to avoidCheck the password or dynamic verification code to provide you with fast registration and login service.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the \"One -click Login\" function, after your consent, we will use the functions provided by the operator to use the mobile phone number in your device as your registration, login account and avoid password or dynamic verification code to verify."}
{"task": "rw_59.jsonl", "id": 57793, "text": "If you don't want to use the \"One -click login\" function, you can register and log in to the \"Soda Music\" APP in other ways.", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57794, "text": "1.1.2 account public information", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57795, "text": "Nickname, gender, birthday, regional and personal introduction, etc.).", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "The basic information related to the Douyin account used by you log in to the \"Soda Music\" APP will be displayed simultaneously in the \"Soda Music\" APP (such as a jitter, avatar, nickname, gender, birthday, regional and personal introduction, etc.)."}
{"task": "rw_59.jsonl", "id": 57796, "text": "The \"Soda Music\" APP is the associated version of the music module \"Soda Music\" in the Douyin side. Your Douyin account is followed by the number of attention and the list of attention, the number of fans and the fan list, the song list you publicly releases, you like (like)The collection of music/song list will be publicly displayed in the personal homepage of the \"Soda Music\" APP and the personal homepage of the \"Douyin\" APP- \"My Soda Music\".", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Your Douyin account is followed by the number of followers and followers, the number of fans and the list of fans, the song list you publicly released, the music/song list you like (like) and the collection will be on the personal homepage of the \"Soda Music\" app,And the personal homepage of the \"Douyin\" APP- \"My Soda Music\" is publicly displayed."}
{"task": "rw_59.jsonl", "id": 57797, "text": "You can choose not to allow visitors to view your attention list, fan list, like (like), collecting music/song list, your privacy setting effect made in the \"Soda Music\" APP or Douyin APP will be in addition to another otherOne end.", "label": ["Important", "Edit/Control"], "rewrite": "You can choose not to allow visitors to view your attention list, fan list, like (like), collecting music/song list, your privacy setting effect made in the \"Soda Music\" APP or Douyin APP will be in addition to another otherOne end."}
{"task": "rw_59.jsonl", "id": 57798, "text": "When we issue an announcement of illegal punishment, we will announce information such as the nickname of illegal accounts.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "When we issue an announcement of illegal punishment, we will announce information such as the nickname of illegal accounts."}
{"task": "rw_59.jsonl", "id": 57799, "text": "1.1.3 Douyin unified account and related version", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57800, "text": "The \"Soda Music\" APP, as the official version of the music -related music version of Douyin, the relevant services need to rely on login with Douyin account and use a unified Douyin account service.", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57801, "text": "You can use the Douyin account to log in and use the \"Soda Music\" APP -related services and functions. In order to provide the service experience consistent with the \"Soda Music\" module in the \"Soda Music\" APP, we use SDK or relatedTechnical synchronization of the account and content in the \"Douyin\" APP and the \"Soda Music\" APP, which may include: sharing nicknames, avatars, regions, gender, etc. You set as public account information;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "May use SDK or related technologies to synchronize the account and content in the \"Douyin\" APP and \"Soda Music\" APP."}
{"task": "rw_59.jsonl", "id": 57802, "text": "Simultaneous attention, fans and other user relationships;", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57803, "text": "Synchronize the content published by this account;", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57804, "text": "Synchronize other information you authorize.", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57805, "text": "1.2 Audio display, playback and search service", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57806, "text": "In the process of using soda music -related services, we will record your usage.", "label": ["Important", "First Party Collection Information"], "rewrite": "In the process of using soda music -related services, we will record your usage."}
{"task": "rw_59.jsonl", "id": 57807, "text": "If you do not log in to the account, we will record your [click, play, share information] by the corresponding identifier information of the device.", "label": ["Important", "First Party Collection Information"], "rewrite": "If the account is not logged in, we will record your [click, play, share information] by the corresponding identifier information of the device."}
{"task": "rw_59.jsonl", "id": 57808, "text": "If you have logged in to the account, we will record your [click, play, share, share, focus, collect, feedback, release, like), like) through the Douyin account you log in].", "label": ["Important", "First Party Collection Information"], "rewrite": "We will record your [click, play, share, share, focus, collect, feedback, publish, like), comments, etc.]."}
{"task": "rw_59.jsonl", "id": 57809, "text": "When you use the search function, we will collect your search keyword information and log records.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the search function, we will collect your search keyword information and log records."}
{"task": "rw_59.jsonl", "id": 57810, "text": "Search keyword information will be temporarily stored in your device, so when you use a soda music search function on the same device, we will show you your search history.", "label": ["Data Retention", "Important", "Usage"], "rewrite": "When you use the soda music search function on the same device, we will show you your search history."}
{"task": "rw_59.jsonl", "id": 57811, "text": "1.3 Personalized recommendation", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57812, "text": "Function description: In order to show you and recommend more information, provide services that meet your requirements. Soda concerts collect, use your personal information, and automatically calculate and predict your preferences through computer algorithm models to match you to match you to match you to match youMay be interested in information or services. The following we will explain to you in detail the operating mechanism of this personalized recommendation service and the way you implement control.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The soda concert collects, uses your personal information, and automatically calculates and predict your preferences through a computer algorithm model to match the information or service you may be interested in."}
{"task": "rw_59.jsonl", "id": 57813, "text": "a), the scope of we providing personalized recommendation services includes but not limited to the content of the audio and song lists, and provides search results.", "label": ["Important", "Usage"], "rewrite": "The scope of we providing personalized recommendation services includes but not limited to recommending audio and song list content, and the search results are provided."}
{"task": "rw_59.jsonl", "id": 57814, "text": "b), in order to predict your preferences, we may collect and use your device information, and behavior information when using the \"soda music\" function in the \"soda music\" APP/Douyin end.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to predict your preferences, we may collect and use your device information, and behavior information when using the \"soda music\" function in the \"soda music\" APP/Douyin end."}
{"task": "rw_59.jsonl", "id": 57815, "text": "Behavior information includes the corresponding information of audio content playback, information publishing, interactive communication, search, click, collection, browsing, downloading, sharing and trading such as \"Soda Music\" in Douyin.Including the gender, birthday, regional and other account information in the account you filled in.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57816, "text": "We will automatically analyze and calculate the above information, and the machine (or system) will automatically screen and push the content you may be more interested in according to the calculation results.", "label": ["Important", "Usage"], "rewrite": "The machine (or system) will automatically screen and push the content you may be more interested in according to the calculation results."}
{"task": "rw_59.jsonl", "id": 57817, "text": "c), we will give real -time feedback on the recommendation model based on the content of your content in the process of using soda music, and constantly adjust the optimization results to better provide you with high -quality content.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We will give real -time feedback on the recommendation model based on your content in the process of using the content of your soda music, and constantly adjust the optimization results."}
{"task": "rw_59.jsonl", "id": 57818, "text": "Please know that the personalized recommendation algorithm in soda music does not identify the true identity of a specific natural person. It only provides higher and richer information based on user behavior and characteristics.", "label": ["Important", "Usage"], "rewrite": "The personalized recommendation algorithm in soda music does not identify the true identity of a specific natural person."}
{"task": "rw_59.jsonl", "id": 57819, "text": "You can \"close personalized content push\" based on the path introduced in this privacy policy.", "label": ["Important", "Edit/Control"], "rewrite": "You can \"close personalized content push\" based on the path introduced in this privacy policy."}
{"task": "rw_59.jsonl", "id": 57820, "text": "When you close, we will not process your personal information based on the purpose of personalized push, but will only push you to you with universal content that has nothing to do with your preference.", "label": ["Edit/Control", "Usage", "Important"], "rewrite": "When you close, we will not process your personal information based on the purpose of personalized push."}
{"task": "rw_59.jsonl", "id": 57821, "text": "1.4 Other functions", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57822, "text": "1.4.1 message notification", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57823, "text": "You know and agree, we may send you one or more types of notifications at the same time through the contact information (eg:: phone number) provided by you in the process of using the product and/or serviceInform, authentication, security verification, user experience research;", "label": ["Usage"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57824, "text": "In addition, we may also provide you with commercial information such as services, functions, or activities that you may be interested in by text messages and telephones.", "label": ["Important", "Usage"], "rewrite": "We may also provide you with commercial information in a SMS and phone call."}
{"task": "rw_59.jsonl", "id": 57825, "text": "But please rest assured that if you do not want to accept this information, you can unsubscribe the booking method provided in the mobile phone SMS, or you can contact us directly to the withdrawal.", "label": ["Important", "Edit/Control"], "rewrite": "You can be withdrawing the booking method provided by the mobile phone SMS, or you can contact us directly to the withdrawal."}
{"task": "rw_59.jsonl", "id": 57826, "text": "We will push you your account dynamics, users or content dynamics, hot content, recommendation content, etc. to you through the system notification of your device.The notification settings you want to select the information you want to receive.", "label": ["Edit/Control", "Usage", "Important"], "rewrite": "You can choose to turn off the notification function of soda music in the device, or select the information you want to receive through the notification settings provided by soda music."}
{"task": "rw_59.jsonl", "id": 57827, "text": "1.4.2 Share and interact", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57828, "text": "In the case of sharing or receiving information, participating in activities, etc., the soda music client needs to visit your shear plate locally to read the passwords, sharing codes, and links contained in it to achieve jumping, sharing, and activitiesLinks and other functions or services.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The soda music client needs to access your shear plate locally, and read the passwords, sharing code, and links contained in it to achieve functions or services such as jumping, sharing, and activities."}
{"task": "rw_59.jsonl", "id": 57829, "text": "Soda music client only uploads our server only when the contents of the shear plates are swollen, sharing, and activity linkage are uploaded by instructions.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57830, "text": "In addition, the soda music client will not upload other information of your cut plate to our server.", "label": ["Important", "First Party Collection Information"], "rewrite": "Soda music clients will not upload other information about your shear board to our server."}
{"task": "rw_59.jsonl", "id": 57831, "text": "In addition, we may need to read your mobile album for you to share or receive videos and pictures shared.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may need to read your mobile phone album so that you can share or receive videos and pictures shared."}
{"task": "rw_59.jsonl", "id": 57832, "text": "The system of some mobile phone equipment prompts the application (APP) to read the shear or album, but the system prompts that it cannot be distinguished or uploaded by local processing or uploading, and due to the differences in statistical methods, the possibility of misunderstanding is not ruled out.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57833, "text": "Therefore, if you find similar prompts and have questions, please contact us so that we can locate the problem.", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57834, "text": "1.5 Operation and safe operation", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57835, "text": "We are committed to providing you with a safe, credible product and use environment, and providing high -quality and reliable services and information is our core goal.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57836, "text": "In order to maintain the normal and stable operation of related products or services and protect the security and legitimate interests of you or other users or the public, we will collect the following necessary information:", "label": ["Data Security", "First Party Collection Information"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57837, "text": "(1) In order to ensure the quality and efficiency of the safe operation and operation of software and services, we will collect your hardware model, operating system version number, equipment identifier (Android, Androidid, OAID, IMSI, ICCID, GAID, Meid, IOS such as IDFV, IDFA;", "label": ["Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "We will collect your hardware models, operating system versions, and device logo (Android, Androidid, OAID, IMSI, ICCID, GAID, Meid, iOS such as IDFV, IDFA."}
{"task": "rw_59.jsonl", "id": 57838, "text": "Different identifiers will be different in the validity period, whether it can be reset by the user, and the acquisition method), the hardware address (MAC address) of the network equipment (MAC), and IP", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57839, "text": "Address, WLAN access point (such as SSID, BSSID), Bluetooth, base station, software version number, network access method, type, status, network quality data, operation, service log.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57840, "text": "(2) In order to prevent malicious procedures and ensure the quality and efficiency of operating, we will collect the application information or the process information of the processing, the overall operation of the application, the frequency of usage and frequency, the application of the application, the overall installation, and the performance data, Application source.", "label": ["Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "We will collect the installation application information or the process information that is running, the overall operation of the application, the usage and frequency, the application crash, the overall installation usage, performance data, and the source of application."}
{"task": "rw_59.jsonl", "id": 57841, "text": "(3) We may use your account information, equipment information, service log information, and our related parties and partners to obtain information you authorized or provided to us in accordance with the law to judge account security, transaction security, identity verification, verify identity verification, Identify illegal and illegal conditions, test and prevent safety incidents, and take necessary records, analysis, and disposal measures in accordance with the law.", "label": ["Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "We may use your account information, equipment information, service log information, as well as our related parties and partners to obtain information you authorized or provided to us according to law to judge account security and transaction security."}
{"task": "rw_59.jsonl", "id": 57842, "text": "1.6 Use of cookies equal to similar technologies", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57843, "text": "Similar technologies such as Cookie and Equipment Information Makes are commonly used in the Internet.", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57844, "text": "When you use soda music and related services, we may use related technologies to send one or more cookies to your device, or anonymous identifiers to collect and identify the information when you access and use the product.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may use related technologies to send one or more cookie or anonymous identifiers to your device to collect and identify the information when you access and use this product."}
{"task": "rw_59.jsonl", "id": 57845, "text": "We promise that cookies will not be used for any other purposes other than the purpose of this privacy policy.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57846, "text": "We use cookies and similar technologies to achieve the following functions or services:", "label": ["Usage"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57847, "text": "Guarantee the safety and efficient operation of products and services: We may set COOKIE, or anonymous identifiers that certify and guarantee security, so that we can confirm whether you log in to the service safely, or whether you encounter stolen, fraud and other illegal acts.", "label": ["Important", "Data Security", "Usage"], "rewrite": "We may set up Cookie or anonymous identifier that guarantees security and ensure security, so that we can confirm whether you log in to the service safely, or whether you encounter dispersion, fraud and other illegal acts."}
{"task": "rw_59.jsonl", "id": 57848, "text": "These technologies also help us improve service efficiency, improve login and response speed.", "label": ["Important", "Usage"], "rewrite": "These technologies also help us improve service efficiency, improve login and response speed."}
{"task": "rw_59.jsonl", "id": 57849, "text": "Help you get a easier access experience: using such technologies can help you save the steps and processes of personal information and enter search content (example: record search, form filling).", "label": ["Important", "Usage"], "rewrite": "Using this kind of technology can help you save the steps and processes of personal information and enter search content (example: record search and form filling)."}
{"task": "rw_59.jsonl", "id": 57850, "text": "Recommend, display, and push the content or account you may be interested in: We may use such technologies to understand your preferences and use habits, analyze data to improve information or functions that users are interested in, andOptimize your choice of content.", "label": ["Important", "Usage"], "rewrite": "We may use such technologies to understand your preferences and use habits, and analyze data to improve product services."}
{"task": "rw_59.jsonl", "id": 57851, "text": "In the sharing page of soda music, we may use Cookie to record the browsing activities to recommend information and investigate the collapse, delay related abnormal conditions, and explore better service methods.", "label": ["Important", "Usage"], "rewrite": "We may use Cookie to record the browsing activities to recommend information and investigate the related abnormal conditions of collapse, delay, and explore a better service method."}
{"task": "rw_59.jsonl", "id": 57852, "text": "COOKIE Clear", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57853, "text": ": If you use a soda music web version, most browsers provide users with the function of clearing the cache data of the browser. You can operate the Cookie data in the browser settings, but after clearingFunction or service of Cookie.", "label": ["Edit/Control", "Important"], "rewrite": "You can operate Cookie data in the browser settings, but after clearing, you may not be able to use the functions or services that depend on Cookie provided by us."}
{"task": "rw_59.jsonl", "id": 57854, "text": "1.7 Change of service content", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57855, "text": "Please understand that with the development of our business, the products or services provided by soda music may be adjusted.", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57856, "text": "If the purpose, method, and scope of the personal information after adjustment of the change of the change will change, we will tell you again and obtain your consent in accordance with the relevant requirements of the laws and regulations.", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57857, "text": "1.8 Exemption to obtain consent to handle personal information according to law", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57858, "text": "Please understand that in the following situations, according to laws and regulations, we handle your personal information without obtain your authorization consent.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In the following situations, according to laws and regulations, we do not need to obtain your authorization consent."}
{"task": "rw_59.jsonl", "id": 57859, "text": "a), required to be established or fulfilled according to your requirements;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The personal information necessary for processed or fulfills the necessary contracts does not need to ask for consent."}
{"task": "rw_59.jsonl", "id": 57860, "text": "b) In order to fulfill the statutory responsibility or statutory obligations such as national security, defense security, criminal investigation, prosecution, trial and judgment implementation with national security, defense security, criminal investigation, prosecution, trial and judgment implementation;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "It does not need to solicit consent to the personal information of the legal duties or the required personal information necessary for the legal duties."}
{"task": "rw_59.jsonl", "id": 57861, "text": "c), to deal with emergencies, or in urgent situations to protect the health and property safety of natural people;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "It does not need to solicit consent to deal with the personal information necessary for protecting life, health and property security in response to emergencies or emergencies."}
{"task": "rw_59.jsonl", "id": 57862, "text": "d), implement news reports, public opinion supervision and other behaviors for public interests, and handle personal information within a reasonable scope;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to implement news reports and public opinion supervision, deal with personal information within a reasonable scope without soliciting consent."}
{"task": "rw_59.jsonl", "id": 57863, "text": "e), deal with your own personal information within a reasonable range, or other legal information that has been legal (such as legal news reports, government information disclosure and other channels to legal public information); legal information and disclosure of government information); legal information and disclosure of government information;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Treatment of legal personal information within a reasonable scope without asking for consent."}
{"task": "rw_59.jsonl", "id": 57864, "text": "f), other circumstances stipulated in laws and regulations.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Do personal information under other circumstances stipulated in laws and regulations without asking for consent."}
{"task": "rw_59.jsonl", "id": 57865, "text": "Special explanation: According to the law, if the information cannot be separated or combined with other information to identify specific individuals, it does not belong to personal information.", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57866, "text": "When your information can be identified alone or in conjunction with other information, or we use the combination of data that is not connected with any specific individuals with your personal information, we will use it as your personal information and according to this privacy policyTreatment and protection.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When we use the combination of data that does not connect with any specific individuals with your personal information, we will use it as your personal information and processes and protect it in accordance with this privacy policy."}
{"task": "rw_59.jsonl", "id": 57867, "text": "2 The partners involved in the data use and transfer and disclose personal information", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57868, "text": "2.1 The partner involved in the data use process", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57869, "text": "2.1.1 Basic Principles", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57870, "text": "In the process of cooperating with the partners, we will comply with the following principles:", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57871, "text": "a) Legal principles: Those who involve data processing activities shall abide by the legal principles.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57872, "text": "b) Principles and minimum necessary principles: Data use must have a legitimate purpose, and it should be limited to the purpose of achievement.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57873, "text": "c) Principles of security and prudential: We will carefully evaluate the purpose of the partners' use of data, comprehensively evaluate the security guarantee capabilities of these partners, and ask them to follow the legal agreement of cooperation.", "label": ["Third Party Sharing/ Disclosure", "Data Security"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57874, "text": "We will strictly monitor the software tool development package (SDK) and application interface (API) that the partners obtain information to protect data security.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will strictly monitor the software tool development package (SDK) and application interface (API) that the partners obtain information to protect data security."}
{"task": "rw_59.jsonl", "id": 57875, "text": "Access to cooperative SDK directory", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57876, "text": "2.1.2 Entrusted processing", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57877, "text": "For the scene of commissioning to handle personal information, we will sign the relevant processing agreement with the trustee and cooperation in accordance with the law and supervise the personal information usage activities.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will sign the relevant processing agreement with the trustee and cooperation in accordance with the law and supervise their personal information use activities."}
{"task": "rw_59.jsonl", "id": 57878, "text": "2.1.3 Common processing", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57879, "text": "For the scenario of jointly handling personal information, we will sign relevant agreements with the partners in accordance with the law and agreed that their rights and obligations to ensure that in the process of using relevant personal information and protect the security of data and protect data security.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will sign relevant agreements with the partner and agreed to their respective rights and obligations to ensure that they comply with the relevant provisions of the law and protect data security in the process of using relevant personal information."}
{"task": "rw_59.jsonl", "id": 57880, "text": "2.1.4 Scope of partners", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57881, "text": "If the specific functions and scenarios involve services provided by our affiliates and third parties, the scope of partners includes our affiliates and third parties.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If the specific functions and scenarios involve services provided by our affiliates and third parties, the scope of partners includes our affiliates and third parties."}
{"task": "rw_59.jsonl", "id": 57882, "text": "2.2 Scenes of cooperation", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57883, "text": "2.2.1 To realize the business function of soda music", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57884, "text": "a), message notification: In order to push the message with the terminal model you use, the terminal equipment manufacturer (Huawei, Xiaomi, OPPO, vivo, etc.) may use your mobile phone model, version and related device information through SDK and other technologiesEssence", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Terminal equipment manufacturers (Huawei, Xiaomi, OPPO, vivo, etc.) may use your mobile phone model, version and related equipment information through SDK and other technologies."}
{"task": "rw_59.jsonl", "id": 57885, "text": "b), activity participation: When you choose to participate in the marketing activities we organized, after your consent, we and partners may need to use your name, communication address, contact information, bank account and other information in order to fulfill your activities to achieve the event.award.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We may need to use information such as your name, communication address, contact information, contact information, bank accounts, etc., so that you can in order for you to reward the event reward."}
{"task": "rw_59.jsonl", "id": 57886, "text": "When you participate in the marketing activities co -organized by the related parties, you may synchronize your account (including identifier), participating achievements, progress, schedule, schedule, schedule, schedule, and schedule between multiple mobile applications of mobile applications (referred to as \"activity platform\")., Income and other information to ensure that you get a complete service experience in the event.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "It may synchronize information about your account (including identifiers), participation results, progress, income and other information between multiple mobile applications (referred to as \"activity platforms\") that participated in multiple participating activities."}
{"task": "rw_59.jsonl", "id": 57887, "text": "c) Customer service: In order to deal with your complaints, suggestions, and other demands in a timely manner, customer service providers need to use your account and related information, and to understand, process and respond to your needs in a timely manner.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Customer service providers need to use your account and related information, as well as understanding, processing and responding to your needs in a timely manner."}
{"task": "rw_59.jsonl", "id": 57888, "text": "If necessary, you may need to use your mobile phone number or to get in touch with you through other communication methods.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "You may also need to use your mobile phone number or contact you through other communication methods."}
{"task": "rw_59.jsonl", "id": 57889, "text": "2.2.2 Realize safety and statistical analysis", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57890, "text": "a), ensure the safety of use: We attach great importance to the safety of products and services. In order to ensure the legitimate rights and interests of soda music users from illegal infringement, our partners may use necessary equipment, accounts and log information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security", "Usage"], "rewrite": "Our partners may use the necessary devices, accounts and log information."}
{"task": "rw_59.jsonl", "id": 57891, "text": "b) Analysis of the product situation: In order to analyze the stability of the products and services of soda music, partners who provide analysis services may need to use the service situation (collapse, flashback record), equipment identification information, and overall installation and use conditions.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Partners who provide analytical services may need to use the service situation (collapse, flashback records), equipment identification information, and overall installation and use conditions."}
{"task": "rw_59.jsonl", "id": 57892, "text": "c), academic research: In order to improve the scientific research capabilities in related fields and promote the level of scientific and technological development, we may use de -identification or anonymous agencies to ensure that data security and purpose are properly used in the premise of legitimate data security and purpose.The data.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Under the premise of ensuring data security and purpose, we may use de -identified or anonymous data with cooperative scientific research institutes, universities and other institutions."}
{"task": "rw_59.jsonl", "id": 57893, "text": "2.3 Operation subject change", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57894, "text": "With the continuous development of business, we will be likely to be merged, acquired, and transfer, and your personal information may be transferred as a result.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will be likely to be merged, acquired, asset transfer, and your personal information may be transferred as a result."}
{"task": "rw_59.jsonl", "id": 57895, "text": "When the previous description changes, we will require the recipient to protect your personal information in accordance with the laws and regulations and the security standards stated by the privacy policy.Fang Fang has re -obtained your authorization consent.", "label": ["Policy Change", "Third Party Sharing/ Disclosure", "Important"], "rewrite": "When the personal information is transferred, we will ask the recipient to protect your personal information. Following the party to change the original processing purpose and method of processing, we will ask the following party to re -obtain your authorization consent."}
{"task": "rw_59.jsonl", "id": 57896, "text": "2.4 Stop operation", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57897, "text": "If we stop operating products or services, we will stop collecting your personal information in time.", "label": ["Important", "Cessation of Operations"], "rewrite": "If we stop operating products or services, we will stop collecting your personal information in time."}
{"task": "rw_59.jsonl", "id": 57898, "text": "We will deliver notifications one by one or send you a notification of stopping operations in the form of an announcement, and delete or processes the personal information related to the shutdown products or services that have been closed.", "label": ["Important", "Cessation of Operations"], "rewrite": "Will send you a notification of stopping operation and delete or processes the personal information we hold."}
{"task": "rw_59.jsonl", "id": 57899, "text": "2.5 public", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57900, "text": "We will not take the initiative to disclose your information that has not been disclosed by yourself, unless it follows the provisions of national laws and regulations or obtains your consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not take the initiative to disclose your information that has not been disclosed by yourself, unless it follows the provisions of national laws and regulations or obtains your consent."}
{"task": "rw_59.jsonl", "id": 57901, "text": "2.6 Removal of your authorization consent in accordance with the law", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57902, "text": "Please understand that in the following circumstances, according to laws and regulations and national standards, partners use, or we transfer or disclose your personal information without obtain your authorization consent:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the following situations, we transfer or disclose your personal information without obtain your authorization consent:"}
{"task": "rw_59.jsonl", "id": 57903, "text": "a), required to be established or fulfilled according to your requirements;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "There is no need to solicit consent for transfer, publicly concluding or fulfilling the personal information necessary for the contract."}
{"task": "rw_59.jsonl", "id": 57904, "text": "b) In order to fulfill the statutory responsibility or statutory obligations such as national security, defense security, criminal investigation, prosecution, trial and judgment implementation with national security, defense security, criminal investigation, prosecution, trial and judgment implementation;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The transfer, public information for the performance of the legal duties or the necessary personal information necessary for the law of the law, does not need to solicit consent."}
{"task": "rw_59.jsonl", "id": 57905, "text": "c), to deal with emergencies, or in urgent situations to protect the health and property safety of natural people;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Transfer, publicly respond to public health incidents, or personal information necessary for protecting life, health and property security under emergencies, do not need to solicit consent."}
{"task": "rw_59.jsonl", "id": 57906, "text": "d), implement news reports, public opinion supervision and other behaviors for public interests, and handle personal information within a reasonable scope;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to implement news reports and public opinion supervision, deal with personal information within a reasonable scope without soliciting consent."}
{"task": "rw_59.jsonl", "id": 57907, "text": "e), deal with your own personal information within a reasonable range, or other legal information that has been legal (such as legal news reports, government information disclosure and other channels to legal public information); legal information and disclosure of government information); legal information and disclosure of government information;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Treatment of personal information that has been legally disclosed within a reasonable scope without asking for consent."}
{"task": "rw_59.jsonl", "id": 57908, "text": "f), other circumstances stipulated in laws and regulations.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Do personal information under other circumstances stipulated in laws and regulations without asking for consent."}
{"task": "rw_59.jsonl", "id": 57909, "text": "3 Manage your personal information", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57910, "text": "We attach great importance to your management of personal information, and do our best to protect your personal information's right to check, copy, correct, supplement, delete, withdraw, cancel account number, complaint reporting and other rights to make you have the ability to understand and protectYour personal information is safe.", "label": ["Important", "Edit/Control"], "rewrite": "Protect your rights to check, replicate, correct, replenish, delete, withdraw, cancel account number, complaint reporting and other rights for your personal information to make you have the ability to understand and protect your personal information security."}
{"task": "rw_59.jsonl", "id": 57911, "text": "But please understand that specific business functions and services will need your information to be completed. When you withdraw your consent or authorization, we cannot continue to provide you with the corresponding functions and services, and we will no longer deal with your corresponding personal information.", "label": ["Important", "Edit/Control"], "rewrite": "When you withdraw consent or authorization, we cannot continue to provide you with corresponding functions and services, and no longer process your corresponding personal information."}
{"task": "rw_59.jsonl", "id": 57912, "text": "But your decision to withdraw consent or authorization will not affect the personal information processing we carried out based on your authorization.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "But your decision to withdraw consent or authorization will not affect the personal information processing we carried out based on your authorization."}
{"task": "rw_59.jsonl", "id": 57913, "text": "There may be differences in the way we provide in different versions or operating systems, please refer to it.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57914, "text": "3.1 Setting management", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57915, "text": "3.1.1 Basic function mode", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57916, "text": "Music playback and search are the basic functions of soda music, so if you only allow us to process the personal information necessary for implementing basic functions, you can choose to open the basic function mode.", "label": ["Edit/Control", "Important"], "rewrite": "If you only allow us to process the personal information necessary for implementing basic functions, you can choose to open the basic function mode."}
{"task": "rw_59.jsonl", "id": 57917, "text": "Understand the basic function mode", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57918, "text": "In this mode, we will only process your personal information based on the needs of providing basic functions and protecting the safety of the system, that is, you can play music, but you cannot publish any content including comments, likes, and collection.Music will also be pushed randomly from the curved library;", "label": ["Important", "Usage"], "rewrite": "We will only process your personal information based on the needs of providing basic functions and protecting system security."}
{"task": "rw_59.jsonl", "id": 57919, "text": "You can use the search function. We will only provide search results based on your search keywords, and we will not optimize the search results.", "label": ["Important", "Usage"], "rewrite": "You can use the search function. We will only provide search results based on your search keywords, and we will not optimize the search results."}
{"task": "rw_59.jsonl", "id": 57920, "text": "3.1.2 System permissions settings", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57921, "text": "You can open or close the permissions of the camera, album, equipment storage, etc. in the setting function of the device to change the scope of authorization or withdraw your authorization.", "label": ["Important", "Edit/Control"], "rewrite": "You can open or close the permissions of the camera, album, equipment storage, etc. in the setting function of the device to change the scope of authorization or withdraw your authorization."}
{"task": "rw_59.jsonl", "id": 57922, "text": "After the withdrawal authorization, we will no longer collect information related to these permissions, but it will not affect our personal information processing based on your previous authorization.", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "After withdrawal authorization, we will no longer collect and related information, but it will not affect personal information processing carried out based on authorization."}
{"task": "rw_59.jsonl", "id": 57923, "text": "You can read the application and usage of soda music permissions to understand the situation of the application and system permissions of soda music.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57924, "text": "3.1.3 Storage/open range of control information", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57925, "text": "You can control the storage/public scope of control information through the following methods in [I]-[Settings]-[Privacy Settings]:", "label": ["Important", "Edit/Control"], "rewrite": "You can control the storage/public scope of control information through the following methods in [I]-[Settings]-[Privacy Settings]:"}
{"task": "rw_59.jsonl", "id": 57926, "text": "- [Follow and Fan List] can control whether others can see your attention and fan list.", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57927, "text": "-, [Blacklist] You can view your blacklist in the blacklist, or you can remove the black.", "label": ["Important", "Edit/Control"], "rewrite": "[Blacklist] You can view your blacklist in the blacklist, or you can remove the black."}
{"task": "rw_59.jsonl", "id": 57928, "text": "-[Private Account] can control the overall visible range of your account and content.", "label": ["Edit/Control", "Important"], "rewrite": "[Private Account] can control the overall visibility of your account and content."}
{"task": "rw_59.jsonl", "id": 57929, "text": "After opening, the content you posted only your fans can be visible;", "label": ["Important", "Edit/Control"], "rewrite": "After opening the privacy account permissions, your fans will only be visible."}
{"task": "rw_59.jsonl", "id": 57930, "text": "Other users need to be able to become your fan after you agree.", "label": ["Edit/Control", "Important"], "rewrite": "Other users need to be able to become your fan after you agree."}
{"task": "rw_59.jsonl", "id": 57931, "text": "3.1.4 Autonomous subscription and personalized content", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57932, "text": "a), if you don't want to be recommended to be personalized content, you can use [I]-[Settings]-[Privacy Settings]-[Management of personalized content recommendation] Close \"personalized content recommendation\".", "label": ["Important", "Edit/Control"], "rewrite": "You can use [Me]-[Settings]-[Privacy Settings]-[Management of personalized content recommendation] Close \"personalized content recommendation\"."}
{"task": "rw_59.jsonl", "id": 57933, "text": "When you choose to close the recommendation of personalized content, you will no longer show you content related to your personal information or interest.", "label": ["Important", "Edit/Control"], "rewrite": "After closing the personalized content recommendation, it will no longer show you content related to your personal information or interest."}
{"task": "rw_59.jsonl", "id": 57934, "text": "Check the recommendation of personalized content.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57935, "text": "b), when there is no content you are interested in, you can also enter the keywords interested in in the search bar, click and read the search results.", "label": ["Important", "Edit/Control"], "rewrite": "When there is no interest, you can enter the keywords interested in in the search bar, click and read the search results."}
{"task": "rw_59.jsonl", "id": 57936, "text": "3.2 Check, correct, supplement, and delete your personal information", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57937, "text": "a), you can query and access the Douyin, avatar, nickname, gender, personal profile, etc.", "label": ["Important", "Edit/Control"], "rewrite": "You can query and access the Douyin, avatar, nickname, gender, personal profile, etc."}
{"task": "rw_59.jsonl", "id": 57938, "text": "b) [Follow] You can access and query the account information you follow, and click the \"Follow\" button (if.) After clicking on the corresponding account, you can choose to cancel the account number.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57939, "text": "c), [Mine]-[Created song list] can be accessed and deleted the song list you posted.", "label": ["Important", "Edit/Control"], "rewrite": "[Mine]-[Created song list] You can access and delete the song list you posted."}
{"task": "rw_59.jsonl", "id": 57940, "text": "Due to the consideration of security and identification, you may not be able to modify some initial registration information submitted when the Douyin account is registered (after real -name authentication information);", "label": ["Important", "Edit/Control"], "rewrite": "You may not be able to modify some initial registration information submitted when you register the Douyin account (after the real -name authentication information)."}
{"task": "rw_59.jsonl", "id": 57941, "text": "If you really need to modify this type of information, please contact us by email (Feedback@douyin.com). We will review the issues involved as soon as possible and reply to your user identity in a timely manner.", "label": ["Important", "Contact Information", "Edit/Control"], "rewrite": "Please contact us to modify our personal information by email (Feedback@douyin.com). We will review the issues involved as soon as possible and reply to your user identity in time by a special person."}
{"task": "rw_59.jsonl", "id": 57942, "text": "In addition to the above, if you have any claims, requirements or questions to the right to personal information given by relevant laws and regulations, you can contact us through opinion feedback or sending emails to feedback@douyin.com. We will review the office as soon as possible as soon as possible.Involved the question and responded within the 15 working days after verifying your user identity.", "label": ["Edit/Control", "Contact Information", "Important"], "rewrite": "You can contact us through feedback or sending emails to Feedback@douyin.com. We will review as soon as possible and reply within 15 working days after verifying the user identity."}
{"task": "rw_59.jsonl", "id": 57943, "text": "3.3 Copy and transfer your personal information", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57944, "text": "If you need to copy the personal information we collect and store, you can contact the company by logging in to the [Question Feedback] page in the \"Soda Music\" client or sending emails to the company to contact the company.", "label": ["Edit/Control", "Contact Information", "Important"], "rewrite": "Copy the personal information we collect and store, you can contact the [Question Feedback] page or send emails to Feedback@douyin.com by logging in to the \"Soda Music\" client."}
{"task": "rw_59.jsonl", "id": 57945, "text": "If you need to transfer our personal information to collect storage, we will provide you with a transfer path according to the requirements of laws and regulations.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57946, "text": "3.4 Account Logging", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57947, "text": "As the official music function of Douyin, the service depends on the login of using the Douyin account.", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57948, "text": "If you want to terminate the use of \"Soda Music\" related services, you can go to [Mine]-[Settings]-[Logging out], or go directly to the Douyin APP for account cancellation.", "label": ["Important", "Edit/Control"], "rewrite": "You can cancel the account in [Mine]-[Logging out] or directly to the Douyin APP."}
{"task": "rw_59.jsonl", "id": 57949, "text": "Before you cancel your account, we will verify your personal identity, security status, equipment information, etc. you have authorized us.", "label": ["Data Security", "Edit/Control"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57950, "text": "For the process and content of the injection, see the \"Douyin Logging out\".", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57951, "text": "You know and understand that the behavior of canceling the account is irreversible. When you log out the account, we will delete relevant information about you. If you delete personal information, it is difficult to achieve technically, we will perform anonymous processing, or stop removing removing removalIn addition to the storage and necessary safety protection measures, the laws and regulations are otherwise stipulated.", "label": ["Risk", "Edit/Control", "Data Security", "Important"], "rewrite": "After canceling the account, you will delete your relevant information. If it is difficult to achieve technically, we will conduct anonymous treatment, or stop the treatment other than storage and take necessary safety protection measures.Except."}
{"task": "rw_59.jsonl", "id": 57952, "text": "In addition to the above, if you or other rights have the exercise of personal information rights given by relevant laws and regulations, you can have any claims, requirements or questions, you can enter the userThe feedback interface will contact us. We will review the issues involved as soon as possible and reply within the fifteen working days after verifying your user identity.", "label": ["Important", "Contact Information", "Edit/Control"], "rewrite": "You can contact us in [Mine]-[Settings]-[Feedback] to enter the user feedback interface."}
{"task": "rw_59.jsonl", "id": 57953, "text": "4 How do we protect the security of personal information", "label": ["Data Security"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57954, "text": "We attach great importance to your personal information security, and we will strive to take reasonable security measures to protect your personal information, ensure that our personal information processing activities meet the requirements of laws, administrative regulations or other systems that can be applied in accordance with the law, and prevent unauthorized unauthorizedVisits and personal information leakage, tampering, and loss.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57955, "text": "4.1 Security technical measures", "label": ["Data Security"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57956, "text": "We will use the encryption, de -identification technology, anonymous processing, and related reasonable and feasible methods that are not lower than the general level of the industry to protect your personal information, and use a security protection mechanism to prevent your personal information from being maliciously attacked.", "label": ["Important", "Data Security"], "rewrite": "We will use encryption, de -identification technology, anonymous treatment, and related reasonable and feasible means to protect your personal information, and use a security protection mechanism to prevent your personal information from being maliciously attacked."}
{"task": "rw_59.jsonl", "id": 57957, "text": "4.2 Management System", "label": ["Data Security"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57958, "text": "We will establish a special security department, security management system, and data security process to ensure your personal information security.", "label": ["Important", "Data Security"], "rewrite": "We will establish a special security department, security management system, and data security process to ensure your personal information security."}
{"task": "rw_59.jsonl", "id": 57959, "text": "We adopt strict data use and access system to ensure that only authorized personnel can access your personal information.", "label": ["Important", "Data Security"], "rewrite": "We adopt strict data use and access system to ensure that only authorized personnel can access your personal information."}
{"task": "rw_59.jsonl", "id": 57960, "text": "We will regularly conduct security education and training on personnel, and conduct security audit on data and technology in a timely manner.", "label": ["Important", "Data Security"], "rewrite": "We will regularly conduct security education and training on personnel, and conduct security audit on data and technology in a timely manner."}
{"task": "rw_59.jsonl", "id": 57961, "text": "We will formulate and organize the implementation of the emergency plan of personal information security incidents, and immediately start the emergency plan when the personal information security incident occurs, strive to control the impact of these security events, and prevent adverse consequences from expanding.", "label": ["Important", "Data Security"], "rewrite": "We will develop and organize the implementation of the emergency plan for personal information security incidents, and immediately start the emergency plan when the personal information security incident occurs."}
{"task": "rw_59.jsonl", "id": 57962, "text": "Once a personal information security incident (leak, tampering, and loss) may occur or may occur, we will tell you the following situations in a timely manner in accordance with the requirements of laws and regulations: the types, reasons, and possible personal information, reasons and possibilities that may occur, may be tampered, and lost.The harm caused, the remedial measures we have taken, you can take the measures that reduce the harm and the way of contacting us.", "label": ["Important", "Data Security"], "rewrite": "Once a personal information security incident may occur, we will tell you the following situations in a timely manner in accordance with the requirements of laws and regulations: the types, reasons, and hazards of personal information, remedial measures, and contact information to reduce harm."}
{"task": "rw_59.jsonl", "id": 57963, "text": "We will promptly inform you of the incident -related situation with push notifications, emails, letters, text messages, and related forms. When it is difficult to inform them one by one, we will publish a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "We will inform you in a timely manner that when it is difficult to inform one by one, we will publish a reasonable and effective way to publish an announcement."}
{"task": "rw_59.jsonl", "id": 57964, "text": "At the same time, we will also report to the disposal of personal information security incidents in accordance with the requirements of the relevant regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "We will also report to the disposal of personal information security incidents in accordance with the requirements of the relevant regulatory authorities."}
{"task": "rw_59.jsonl", "id": 57965, "text": "4.3 Security reminder", "label": ["Data Security"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57966, "text": "Although the above -mentioned reasonable and effective measures have been taken, and the standards of relevant laws and regulations have been adopted, please understand that due to the technical restrictions and various malicious means that may exist, in the Internet industry, even if you can do your best to strengthen your security measures, you can strengthen your security measures, and you can strengthen your security measures.It is also impossible to ensure that the information is 100 % security, and we will try our best to ensure the security of our personal information you provide.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57967, "text": "You know and understand that the system and communication network you use to access our services may be due to factors outside the control scope.", "label": ["Important", "Data Security"], "rewrite": "The systems and communication networks you use to connect to our services may have problems due to factors outside the controlled range."}
{"task": "rw_59.jsonl", "id": 57968, "text": "Therefore, we strongly recommend that you take positive measures to protect the security of personal information, including but not limited to the use of complex passwords, regularly modify the password, do not disclose your account password and related personal information to others.", "label": ["Important", "Data Security"], "rewrite": "We strongly recommend that you take positive measures to protect the security of personal information, including but not limited to the use of complex passwords, regularly modify the password, do not disclose your account password and related personal information to others."}
{"task": "rw_59.jsonl", "id": 57969, "text": "Once you leave soda music and browse or use other products or services provided by a third party, we will not be able to protect any personal information submitted to the third party, whether you log in, browse or use the above products or services based on soda -based soda -based sodaLinks or guidance of music.", "label": ["Data Security", "Important", "Risk"], "rewrite": "We will not be able to protect any personal information submitted to a third party, whether you log in, browse or use the above products or services based on the link or guidance of soda music."}
{"task": "rw_59.jsonl", "id": 57970, "text": "But we will prompt you to pay attention to entering third -party products or services so that you can better protect your personal information.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57971, "text": "5 How do we store personal information", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57972, "text": "5.1 Storage location", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57973, "text": "In accordance with the provisions of laws and regulations, we will store your personal information collected and generated during the operation of the People's Republic of China.", "label": ["Data Retention", "Important"], "rewrite": "Your personal information will be collected and generated in the operation of the People's Republic of China."}
{"task": "rw_59.jsonl", "id": 57974, "text": "We will not transmit the above information abroad. If we transmit to overseas, we will follow relevant state regulations or seek your consent.", "label": ["Data Retention", "Important", "Risk"], "rewrite": "We will not transmit the above information abroad. If we transmit to overseas, we will follow relevant state regulations or seek your consent."}
{"task": "rw_59.jsonl", "id": 57975, "text": "5.2 Storage period", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57976, "text": "a), we will only retain your personal information during the period for providing you with soda music products or services, such as::", "label": ["Data Retention", "Important"], "rewrite": "We will only retain your personal information during the period for you to provide products or services."}
{"task": "rw_59.jsonl", "id": 57977, "text": "-, mobile phone number: After you register with your mobile phone number, we need to continue to retain your mobile phone number in order to provide you with normal services, inquiring your possible inquiries and voices, and guarantee your account and system security.", "label": ["Data Retention", "Important"], "rewrite": "When you register with your mobile phone number, we need to keep your mobile phone number in order to provide you with normal services."}
{"task": "rw_59.jsonl", "id": 57978, "text": "-We the content and related information you posted, before you have not withdrawn, delete or log out the account, we will retain it to provide you with continuous business functions.", "label": ["Data Retention", "Important"], "rewrite": "Before you have not withdrawn, delete, or log out your account, we will retain personal information to provide you with continuous business functions."}
{"task": "rw_59.jsonl", "id": 57979, "text": "b), if you cancel your account, take the initiative to delete your personal information or the information exceeding the necessary storage period, we will delete or processes your personal information, except for the following situations:", "label": ["Data Retention", "Important"], "rewrite": "We will delete or processes your personal information, except for the following situations:"}
{"task": "rw_59.jsonl", "id": 57980, "text": "-, comply with the requirements for information retention of laws and regulations (for example: the \"E -commerce Law\" stipulates that the time for the saving time of goods and service information and transaction information is not less than three years from the date of the transaction).", "label": ["Data Retention", "Important"], "rewrite": "If you comply with the requirements for information retention of laws and regulations, you will not delete it."}
{"task": "rw_59.jsonl", "id": 57981, "text": "-This for the purpose of financial, auditing, and dispute resolution requires a reasonable extension of the period.", "label": ["Data Retention", "Important"], "rewrite": "For the purpose of finance, auditing, and dispute resolution, the deadline is required, and it will not be deleted."}
{"task": "rw_59.jsonl", "id": 57982, "text": "6 How do we protect minors", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57983, "text": "a), if you are a minor under the age of 18, before using soda music and related services, you should read and agree with your parents or other guardians under guidance and guidance.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a minor under the age of 18, you should read and agree with the privacy policy under the supervision and guidance of the supervisor and guidance."}
{"task": "rw_59.jsonl", "id": 57984, "text": "b), if you are a guardian of a minor under the age of 14, you should read and agree to your privacy policy for your guardian before using soda music and related services.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are the guardian of minors, you should read and agree to the privacy policy for your prisoner before using related services."}
{"task": "rw_59.jsonl", "id": 57985, "text": "c), in accordance with the provisions of relevant national laws and regulations to protect the personal information of minors, we will only collect, use, share, or disclose minors under the circumstances of legal permission, parents or other guardians to protect minors.Personal information.", "label": ["Specific Audiences", "Important"], "rewrite": "It will only collect, use, share, or disclose personal information of minors without legal permission, parents or other guardians who clearly agree or protect minors."}
{"task": "rw_59.jsonl", "id": 57986, "text": "If we find that the personal information of minors is collected without the consent of parents or other guardians who can be proven in advance, we will try to delete relevant information as soon as possible.", "label": ["Specific Audiences", "Important"], "rewrite": "If we find the personal information of minors without the consent of the guardian that can be proven in advance, we will try to delete relevant information as soon as possible."}
{"task": "rw_59.jsonl", "id": 57987, "text": "d), if you are the guardian of a minor, when you have any questions about the personal information of the minors you monitor, please contact us through the contact information of this privacy policy.", "label": ["Specific Audiences", "Important"], "rewrite": "When you have any questions about the personal information of the minors you monitor, please contact us through the contact information of this privacy policy."}
{"task": "rw_59.jsonl", "id": 57988, "text": "7 Checking and revising privacy policy", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57989, "text": "7.1 Review", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57990, "text": "a. You can check this privacy policy on the login page or login account in [Mine]-, [Privacy Policy] page.", "label": ["Policy Change", "Important"], "rewrite": "You can check the privacy policy on the page of [Mine]- [Settings]- [Privacy Policy] on [Mine]- [Settings]- [Privacy Policy]."}
{"task": "rw_59.jsonl", "id": 57991, "text": "b. Please understand that in order to meet the needs of operation, we may develop different versions based on factors such as the mobile phone model, system version, and mobile clients you use. Therefore, when you use a specific version, the function of the \"Soda Music\" app function isIt may be different from the description of this privacy policy, but it will not affect the purpose, method, and scope of data processing. The specific available function shall prevail.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57992, "text": "7.2 Update and notice", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57993, "text": "a. In order to provide you with better services, soda music products and services will be updated and changed from time to time. We will revise this privacy policy in a timely manner.", "label": ["Policy Change", "Important"], "rewrite": "Soda music products and services will be updated and changed from time to time, and we will revise this privacy policy in a timely manner."}
{"task": "rw_59.jsonl", "id": 57994, "text": "Without your clear consent, we will not reduce the rights you should enjoy based on the current effective privacy policy.", "label": ["Policy Change", "Important"], "rewrite": "Without your clear consent, we will not reduce the rights you should enjoy based on the current effective privacy policy."}
{"task": "rw_59.jsonl", "id": 57995, "text": "b. After the privacy policy is updated, we will issue an updated version in soda music, and remind you of the updated content in the station or other appropriate methods so that you can understand the latest version of the privacy policy in time.", "label": ["Policy Change", "Important"], "rewrite": "After the privacy policy is updated, we will issue a updated version in soda music, and remind you of the updated content through the letter or other appropriate ways."}
{"task": "rw_59.jsonl", "id": 57996, "text": "c. We may also help you manage your personal information better through functional updates. Please pay attention to the relevant function description.", "label": ["Policy Change", "Important"], "rewrite": "We may help you manage your personal information better through functional updates."}
{"task": "rw_59.jsonl", "id": 57997, "text": "8 Contact us", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57998, "text": "8.1 Complaints and reports", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 57999, "text": "If you think your personal information rights may be infringed, or you can find a clue to infringe the right to personal information, you can enter the user feedback interface to contact us in [I]-[Settings]-[Feedback of Opinions].Feedback your complaints and reports within 15 working days.", "label": ["Important", "Contact Information"], "rewrite": "You can contact us in [I]-[Settings]-[Feedback] to enter the user feedback interface. After we verify, we will report your complaints and reports within 15 working days."}
{"task": "rw_59.jsonl", "id": 58000, "text": "If you think that the music on the soda music platform violates the legitimate rights and interests you enjoy, please follow the instructions below, please send emails to Music_copyright@bytedance.com for music copyright infringement complaints.", "label": ["Important", "Contact Information"], "rewrite": "Please send emails to Music_copyright@bytedance.com for music copyright infringement complaints."}
{"task": "rw_59.jsonl", "id": 58001, "text": "8.1.1 Identity proof of the right holder's identity materials and contact information", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 58002, "text": "(1) The right holder as the complaint:", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 58003, "text": "1. If it is a legal person or other organizations, the name of the legal person or other organization must be provided, the business license (including the official seal) or the qualification certification materials, the authorized attorney, effective contact information and address, and the effective complaint letter of the official sealItems", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 58004, "text": "2. If you are an individual, you must provide name, personal ID scanning parts (including photo page), effective contact information and addresses;", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 58005, "text": "3. If it is a minor, in principle, the guardian should be complained on behalf of them. The required materials should be refer to the following \"entrusted agent complaints\" and must provide proof of guardianship.", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 58006, "text": "(2) The agent complained:", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 58007, "text": "In addition to the subject certification materials required by the right holder, the agent must issue an agent's identity certificate (see the aforementioned content), and the authorized attorney of the agent (the authorization letter shall includeRelated content), and stamped the seal of the agent or signature.", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 58008, "text": "8.1.2 Reasons for complaints", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 58009, "text": "Please complete and accurately describe the content or objects you think of the rights (such as works, performances, or recording and video products) that you think are protected by copyright or related rights, and the objective facts and legal basis you think of infringing your rights.", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 58010, "text": "8.1.3 Complaint request", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 58011, "text": "(1) Please describe the specific matters of the request platform assistance (for example, removing or disconnecting the content link);", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 58012, "text": "(2) Please provide the songs and singer names, network addresses and screenshots of the infringing content required to deal with.", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 58013, "text": "8.1.4 Certificate of ownership:", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 58014, "text": "Please provide proof of the ownership of the true and complete copyright of the complaint.", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 58015, "text": "Prove to the ownership includes but not limited to:", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 58016, "text": "-The copyright registration certificate (No.)", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 58017, "text": "-The copyright certification document issued by the copyright certification agency or copyright collective management organization designated by the State Copyright Administrative Department", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 58018, "text": "-The work manuscript", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 58019, "text": "-Polties for the first public publishing or distribution date proof materials", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 58020, "text": "-The contract to get rights", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 58021, "text": "-D court effective ruling and judgment", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 58022, "text": "-It other valid ownership materials that can prove that the right holder has relevant rights", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 58023, "text": "The ownership certificate should provide the original or photocopy of the proof file in the form of an attachment.", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 58024, "text": "Please make sure that the proved material reflects the right properties or validity period of rights you enjoy during the validity period of your rights.", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 58025, "text": "8.1.5 Soda music can be required to supplement the submitting materials during the complaint processing process. You must answer or supplement within the reasonable period of notification of soda music. If the expiration of the period is not answered, it is deemed that you will withdraw the complaint and start from the beginning and from the beginningAbandon the claim of complaints.", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 58026, "text": "8.1.6 After receiving the complaint notice that meets the requirements, we will accept it in accordance with the provisions of relevant laws and regulations. Please be sure to fill in the information in complete, accurate, and truly to improve the efficiency of the complaint.", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 58027, "text": "For malicious complaints or wrong complaints, the complainant shall bear all legal responsibilities according to law, and if it causes losses to the platform, the platform reserves the right to investigate its legal responsibility.", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 58028, "text": "If you are not sure if the relevant content violates your copyright and other legitimate rights and interests, it is recommended that you consult relevant professionals first.", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 58029, "text": "8.2 Other problems", "label": [], "rewrite": []}
{"task": "rw_59.jsonl", "id": 58030, "text": "If you have questions or suggestions on personal information protection, you can choose to contact us through the following ways:", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 58031, "text": "a), send mail to dataprivacy@bytedance.com", "label": ["Important", "Contact Information"], "rewrite": "Send mail to dataprivacy@bytedance.com."}
{"task": "rw_59.jsonl", "id": 58032, "text": "b), mail to the China Satellite Communications Building, Ministry of Legal Affairs, Data Security and Privacy Protection Center", "label": ["Important", "Contact Information"], "rewrite": "Mailing to the Data Security and Privacy Protection Center of the Ministry of Legal Affairs of China Satellite Communications Building, Haidian District, Beijing."}
{"task": "rw_59.jsonl", "id": 58033, "text": "We will review your questions or suggestions as soon as possible and reply within 15 working days after verifying your user identity.", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_59.jsonl", "id": 58034, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
