{"task": "rw_55.jsonl", "id": 56416, "text": "Cool dog privacy policy", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56417, "text": "Update date: July 19, 2022", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56418, "text": "Version update prompt", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56419, "text": "In order to better protect your rights, we have recently updated the Cool Dog Privacy Policy.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56420, "text": "The content of this update mainly includes:", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56421, "text": "1. Optimized the explanation of the acquisition and use rules of some information.", "label": ["Policy Change", "Important"], "rewrite": "This privacy policy optimizes the expression of the acquisition and use of some information."}
{"task": "rw_55.jsonl", "id": 56422, "text": "2. Update the privacy center view or operation path", "label": ["Policy Change", "Important"], "rewrite": "This privacy policy updates the privacy center to view or operate path."}
{"task": "rw_55.jsonl", "id": 56423, "text": "Please read carefully and fully understand the full text before using/continue to use cool dog products with/or service. If you have any questions or questions, please contact us through the contact information in Article 8.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56424, "text": "Reading prompt", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56425, "text": "(1) Please read carefully before using/continue to use cool dog music products and/or services, fully understand the full text of the full version of \"Cool Dog Privacy Policy\", and use/continue to use after agreeing with all content.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56426, "text": "Unless otherwise explained, do not agree with the \"Cool Dog Privacy Policy\" or its update (we will notify you in time) may affect your normally or continue to use our products and/or services.", "label": ["Policy Change", "Important"], "rewrite": "Unless otherwise explained, do not agree that \"Cool Dog Privacy Policy\" or its update may affect your normally or continued use of our products and/or services."}
{"task": "rw_55.jsonl", "id": 56427, "text": "(2) In order to facilitate your rapid understanding of the content of \"Cool Dog Privacy Policy\", we will simply and intuitively explain how we handle and protect your personal information through \"Summary of Cool Dog Privacy Policy\", more about us about us to you to youFor personal information processing rules, please refer to the full version of \"Cool Dog Privacy Policy\".", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56428, "text": "preface", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56429, "text": "Thank you for trusting and using the products and services of Cool Dog Company!", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56430, "text": "Cool Dog Company (that is, Guangzhou Cool Dog Computer Technology Co., Ltd. (registered is 1-17, No. 315, Huangpu Avenue, Tianhe District, Guangzhou) and its related parties, hereinafter referred to as \"we\") knows that personal information is important to youSexuality will be fully protecting your personal information security and reliability.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56431, "text": "Before you use our products or services, please read carefully and fully understand the following terms. Special reminding you that you should pay attention to the content of the thickened forms in this privacy policy (there may be a significant relationship with your rights and your personal sensitive informationdeal with).", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56432, "text": "If you do not agree with this privacy policy, you may not be able to use our products and services normally.", "label": ["Policy Change", "Important"], "rewrite": "If you do not agree with this privacy policy, you may not be able to use our products and services normally."}
{"task": "rw_55.jsonl", "id": 56433, "text": "All of our products and services, including but not limited to various product websites (such as https://www.kugou.com/), PC end, TV side, vehicle side, APP (including but not limited to iOS version, Android version), Android version), Android version), Android version), Android version), Android version), and version of the APP, and the Android version), and the Android version), and the Android version),All terminal clients such as the iPad and applets are applicable to this privacy policy;", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56434, "text": "However, if the product or service sets a separate privacy clause or a privacy agreement, the individual privacy terms or privacy agreements are preferred;", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56435, "text": "The content of a separate privacy policy/privacy agreement is not mentioned, and this privacy policy is applicable.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56436, "text": "Please note that this privacy policy is only applicable to your personal information we collected, and it does not apply to any third party's collection of your personal information, and any third -party service or third -party information use rules. WeThe behavior of any third -party collection, storage, and use of your personal information is not responsible for the scope of law permits.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56437, "text": "Therefore, when using a third -party service, please pay attention and read the relevant user agreements and privacy policies you displayed in the third direction, and properly keep and carefully provide your personal information.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56438, "text": "You agree that this privacy policy said that you have understood and agreed that in related scenarios, we will process your relevant personal information in order to achieve functional operation.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56439, "text": "But this does not mean that as long as you start using our products and/or services, we will process all the personal information involved in this privacy policy;", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56440, "text": "Only when you use specific functions, we will process your relevant personal information in order to achieve the purpose of providing you to you according to the \"minimum necessary\" principle.", "label": ["Important", "Data Security"], "rewrite": "Only when you use specific functions, you will process your relevant personal information to provide you with the purpose of providing you in order to achieve the purpose of providing you."}
{"task": "rw_55.jsonl", "id": 56441, "text": "In addition to this privacy policy, in specific scenarios, the way we will notify (including but not limited to updating the privacy policy, re -signing documents, page prompts, pop -ups, in -site letters, emails, website announcements, or other facilitation of you know thatThe way of) will explain to you in detail rules such as the processing purpose, method, and scope of the corresponding information.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56442, "text": "This privacy policy mainly explains the following information:", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56443, "text": "1. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56444, "text": "2. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56445, "text": "3. How can we share, transfer and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56446, "text": "4. How do you understand and control your personal information", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56447, "text": "5. How do we store and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56448, "text": "6. How do we protect personal information of minors", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56449, "text": "7. How to update this privacy policy", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56450, "text": "8. How to contact us", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56451, "text": "9. Others", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56452, "text": "1. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56453, "text": "To help you quickly understand the main situation of our personal information collection and use, we have explained in a list. You can click to view the \"Cool Dog Music Personal Information Collection List\".", "label": ["Important", "First Party Collection Information"], "rewrite": "We explain the main situation of your personal information collection and use in a list. You can click to view the \"Cool Dog Music Personal Information Collection List\"."}
{"task": "rw_55.jsonl", "id": 56454, "text": "The types of your personal information we collected and used will be different due to the different contents of the product/service, and the specific product/service actual provision shall prevail.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56455, "text": "In order to provide a complete experience, we will continue to improve our products and services, and there may be a need to collect and use new personal information or change personal information usage.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56456, "text": "If a function or scenario that needs to be collected and uses your personal information is not explained in this privacy policy, or we are beyond the purpose of the purpose of being known to collect your personal information and the scope of a direct or reasonable association,We will tell you again and obtain your consent in accordance with the relevant requirements of laws and regulations.", "label": ["Important", "First Party Collection Information"], "rewrite": "If a function or scenario that needs to be collected and uses personal information is not explained in this privacy policy, or if we have exceeded the scope of reasonable connection, we will tell you again and obtain your consent."}
{"task": "rw_55.jsonl", "id": 56457, "text": "Please understand that the acquisition or collection of some personal information requires you to grant us a specific system permissions to achieve it.", "label": ["Important", "First Party Collection Information"], "rewrite": "The acquisition or collection of some personal information requires you to grant us a specific system authority to achieve."}
{"task": "rw_55.jsonl", "id": 56458, "text": "You can understand the information we collected based on the system permissions you granted by \"Cool Dog Music Application Restrictions\".", "label": ["Permission Acquisition", "Important"], "rewrite": "You can understand the information collected based on the system permissions you granted by \"Cool Dog Music Application Restrictions\"."}
{"task": "rw_55.jsonl", "id": 56459, "text": "In order to avoid the tedious text, the following involves relevant personal information collection rules will not be repeatedly described.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56460, "text": "Positions, cameras, albums (storage), microphone, calendar and other system permissions will not be opened by default. Only when you trigger related business functions can we apply to you and obtain the corresponding information (such as involved).", "label": ["Permission Acquisition", "Important"], "rewrite": "Position, camera, album (storage), microphone, calendar and other system permissions will not be opened by default. Only when triggering related business functions will it apply to you and obtain the corresponding information."}
{"task": "rw_55.jsonl", "id": 56461, "text": "Please rest assured that the permissions we apply for access are limited to the need to implement specific functions, and you can withdraw the authorization of system permissions at any time.", "label": ["Permission Acquisition", "Important"], "rewrite": "The permissions we apply for access are limited to the need to implement specific functions, and you can withdraw the authorization of system permissions at any time."}
{"task": "rw_55.jsonl", "id": 56462, "text": "You can manage the corresponding permissions through the device settings.", "label": ["Important", "Edit/Control"], "rewrite": "You can manage the corresponding permissions through the device settings."}
{"task": "rw_55.jsonl", "id": 56463, "text": "At the same time, you can also open/cancel the corresponding permissions through the \"sidebar-Privacy Center-Privacy Management-Permanent Settings\".", "label": ["Important", "Edit/Control"], "rewrite": "You can also open/cancel the corresponding permissions through the \"sidebar-Privacy Center-Privacy Management-Permanent Settings\"."}
{"task": "rw_55.jsonl", "id": 56464, "text": "If you turn on this permission, you deepen that you authorize us to access, obtain, collect, and use your corresponding personal information;", "label": ["Edit/Control", "Important"], "rewrite": "If you turn on this permission, you deepen that you authorize us to access, obtain, collect, and use your corresponding personal information."}
{"task": "rw_55.jsonl", "id": 56465, "text": "When you cancel the authorization, we will no longer collect and use the information, nor can it provide you with the above -mentioned services;", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56466, "text": "But unless you delete your personal information in accordance with the law, your cancellation behavior will not affect the processing and storage of our personal information based on your previous authorization.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Unless you delete your personal information in accordance with the law, cancellation will not affect the processing and storage of our personal information based on previous authorization."}
{"task": "rw_55.jsonl", "id": 56467, "text": "If you refuse or withdraw the authorization system authority, it will make you unable to use the corresponding functions, but it does not affect other functions of your normal use of products and/or services.", "label": ["Important", "Edit/Control"], "rewrite": "If you refuse or withdraw the authorization system authority, it will make you unable to use the corresponding function, but it does not affect your normal use of other functions."}
{"task": "rw_55.jsonl", "id": 56468, "text": "Under normal circumstances, we will collect and use your personal information in the following scenes:", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56469, "text": "1.1. Account registration, login and binding", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56470, "text": "1.1.1. When you log in to our product with your mobile phone number, we will collect your mobile phone number in order to create a cool dog account binding with the mobile phone number.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect your mobile phone number in order to create a cool dog account binding with the mobile phone number."}
{"task": "rw_55.jsonl", "id": 56471, "text": "Mobile phone numbers are necessary information requirements for national laws and regulations on the requirements of online real -name systems (Internet user accounts real identity information certification). If you refuse to provide mobile phone numbers for registration and login, we may not be able to provide you with information publishing (including the release of graphics, text, text, text, text, text, text, text, text, text, text, text,Audio and video, reviews, etc.) functions, but do not affect your use of browsing and other functions.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide mobile phone numbers for registration and login, we may not be able to provide you with information release functions, but it does not affect your functions such as browsing."}
{"task": "rw_55.jsonl", "id": 56472, "text": "1.1.2., Based on our cooperation with communication operators, when you use one -click login function, after your consent, we will use the functions provided by the operator to identify the mobile phone number in your device and create for you to create a mobile phone with the phone.Cool dog accounts bound by number, so that you can avoid password or dynamic verification code verification to provide you with fast registration and login services.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use a one -click login function, after your consent, we will use the function provided by the operator to identify the mobile phone number in your device."}
{"task": "rw_55.jsonl", "id": 56473, "text": "If you don't want to use one -click login function, you can register and log in to our products in other ways.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56474, "text": "1.1.3., You can also use a third -party account to register and log in to our products. At this time, you need to authorize us to obtain information on your third -party platform (avatar, nicknames and other information and other information you authorized) forGenerate cool dog accounts bound to the third -party account, so that you can register, log in and use cool dog products and related services.", "label": ["Important", "First Party Collection Information"], "rewrite": "You need to authorize us to obtain your information on the third -party platform (avatar, nicknames and other public information and other information you authorized) to generate cool dog accounts bound to the third -party account."}
{"task": "rw_55.jsonl", "id": 56475, "text": "In some cases, we need to re -verify and bind your mobile phone number to confirm the authenticity and correlation of the third -party account.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56476, "text": "When you log in with your mailbox or username and password, we will collect your mailbox and username. The mailbox and username will be used as your personal information to improve your network identity information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect your mailbox and username, email and username as your personal information will be used to improve your network identity information."}
{"task": "rw_55.jsonl", "id": 56477, "text": "1.1.4., You understand and agree, because the binding relationship between the above -mentioned mobile phone number, third -party account number and cool dog account for logging in, will provide you with consistent services and maintenance in different products based on cool dog accounts.The personal property of the platform and other users is safe or in order to facilitate your more smooth and more targeted experience. We will be with all products with the cool dog account system (including Cool Dog Music, Cool Dog Live, Cool Dog Concept Edition, andCool Dog Singing, Cool Dog Big Edition and other cool dogs and cool dog affiliate products) jointly collect your personal information of your login and use of products.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect your personal information with all products applicable to the cool dog account system."}
{"task": "rw_55.jsonl", "id": 56478, "text": "We may show or share the following information under the same cool dog account (according to product characteristics and functional scenarios, the specific content presented in different products may be different):", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may show or share the following information under the same cool dog account:"}
{"task": "rw_55.jsonl", "id": 56479, "text": "(1), your avatar, nickname, binding status and the basic information you fill in according to your own needs (including introduction, gender, birthday, region, etc. For details, please refer to the 1.3 Treaty of this privacy policy);", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share your avatar, nickname, binding state, and basic information you fill in according to your own needs."}
{"task": "rw_55.jsonl", "id": 56480, "text": "(2), your real name, ID number (including ID cards, Hong Kong and Macao residents, passports, passports, Taiwanese residents travel to and from the mainland), mobile phone number information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share your real name, ID number, mobile phone number information."}
{"task": "rw_55.jsonl", "id": 56481, "text": "Among them, the ID number is personal sensitive information. We will be limited to specific scenarios (when the product operator of the cool dog account system provides your real -name authentication information based on the requirements of administrative or judicial organs required by administrative or right to use the cool dog account system) for sharing or use it for sharingIdentity test;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only be limited to a specific scenario sharing ID number or for identity test;"}
{"task": "rw_55.jsonl", "id": 56482, "text": "(3), your content interactive records (including publishing content, browsing records, review records, praise records, collection records, download records, playback records), your attention relationship (including focus list, fan list, blacklist),Your recharge record and balance, you log in and use other information about your account so that we can provide you with a smoother and more targeted experience.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Share your content interactive records, your attention relationship, your recharge record and balance, you log in and use other information about your account."}
{"task": "rw_55.jsonl", "id": 56483, "text": "1.2. Real -name certification", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56484, "text": "1.2.1. In order to meet the relevant requirements of laws and regulations, ensure the authenticity of the user's identity, achieve anti -fraud and other risk control, ensure the security of you or other users, or maintain the security and stability of the function/service, and facilitate your participation in exclusive preferential activities or youUsing exclusive functions and services, when you open a live broadcast, apply for withdrawal, or use other real -name authentication functions or services or you take the initiative to authenticate the real -name authentication, we need to collect the real identity information you provide, including real names, identity documents and its itNumbers (ID cards, Hong Kong and Macao residents travel to and from the Mainland, passports or Taiwan residents to go to the mainland permit), mobile phone number, static or dynamic facial feature information (according to the actual situation, the real identity information collected in different scenarios may be different, and we only get obtainedThe results of the face recognition do not retain the relevant information) to complete the real -name authentication.", "label": ["Important", "First Party Collection Information"], "rewrite": "We need to collect the real identity information you provide, including real names, identity documents and their numbers, mobile phone numbers, static or dynamic facial feature information to complete real -name authentication."}
{"task": "rw_55.jsonl", "id": 56485, "text": "In the process of real -name authentication, third -party certification agencies (Beijing Kuangxin Technology Co., Ltd. and Tencent Cloud Calculation (Beijing) Co., Ltd.) may need to verify your true identity information through human face recognition.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "In the process of real -name authentication, third -party certification agencies (Beijing Kuangxin Technology Co., Ltd., Tencent Cloud Computing (Beijing) Co., Ltd.) may require your true identity information through face recognition."}
{"task": "rw_55.jsonl", "id": 56486, "text": "This information is for the purpose of completing real -name authentication, or the purpose stipulated in other laws and regulations, without the authorization of your authority, it will not be used as other purposes.", "label": ["Important", "First Party Collection Information"], "rewrite": "The identity authentication information is for the purpose of completing the real -name authentication, or the use stipulated in other laws and regulations, and it will not be used as other purposes without the authorization of you."}
{"task": "rw_55.jsonl", "id": 56487, "text": "If you refuse to provide it, you may not be able to use the functions or related services that must be authenticated before you can use it, but it will not affect your other functions and services.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide your ID information, you may not be able to use the features that must be authenticated before you can use it, but it does not affect your other functions and services."}
{"task": "rw_55.jsonl", "id": 56488, "text": "After your real -name authentication or identity authentication is successful, if there is no reason, the real -name information will not be modified;", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56489, "text": "If you need to modify it, please contact us according to the contact information of Article 8 of this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56490, "text": "1.2.2. Based on the relevant requirements of laws and regulations, your real -name authentication information may also be used by us for adolescent/children's protection, anti -addiction related products or services.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56491, "text": "1.3. Account information maintenance", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56492, "text": "1.3.1. We will generate a cool dog account for you when you log in.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56493, "text": "You can fill in your nickname, avatar, gender, region, birthday, occupation, personality signature, and hobbies to improve your personal information.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can fill in your nickname, avatar, gender, region, birthday, occupation, personality signature, and hobbies to improve your personal information."}
{"task": "rw_55.jsonl", "id": 56494, "text": "These information will help us better understand you and provide you with better services.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56495, "text": "If you do not fill in or delete or change this kind of information, it will affect the content and advertisements you are interested in based on your user portrait information, but it will not affect your normal use of cool dog accounts and services.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56496, "text": "1.3.2., You can apply for special identity or occupational certification (college students, doctors, teachers, etc., subject to the display of our product function page), and musicians, live broadcasts, cool dogs (video experts, column writers, column writersLyrics of lyrics, radio anchors, Quku experts, song list experts, tuners, tide players, commented masters, K Goge, sports music experts)In addition to the real -name authentication, we also need to collect the information and certification documents you provided to us, including names, school names, colleges, admission years, mobile phone numbers, teaching subjects, work units, posts, identity documents and their numbers(ID card, Hong Kong and Macao residents' travel permits, passports or Taiwanese residents travel permits), student ID, vocational certificate or other documents and related information, anchor types, profiles, avatars, QQ, QQ, Email, address, gender, region, genre style, education level, college, graduation time.", "label": ["Important", "First Party Collection Information"], "rewrite": "We need to collect the information and certification documents you provide to us."}
{"task": "rw_55.jsonl", "id": 56497, "text": "We will complete the corresponding certification for you after the review is approved, and the certification mark will be displayed publicly in your account.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56498, "text": "1.3.3., Your personal information (Cool Dog ID, age, singing level, duration of singing, gender, region, age, and personality signature, of which the age age is generated according to your account numberListening to the song for the platform rules), medal, attention number and attention list, number of fans and fan lists, number of visitors and visitors, listening to songs, listening to song lists, works you published publicly, comments, content you collectDynamic will be displayed publicly on the personal homepage of the account.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Your personal information, medals, attention numbers and attention list, number of fans and fan lists, number of visitors and visitors, listening to songs, listening to song lists, works and comments you publicly published, the content you collect will be dynamic will be in the dynamic will be in the dynamics will be onPublic display on the personal homepage of the account."}
{"task": "rw_55.jsonl", "id": 56499, "text": "You can choose through the \"sidebar -Privacy Center -Privacy Management -Other Settings\". Do not allow other users to view your personal homepage, follow lists, fan lists, and listening to songs.", "label": ["Edit/Control", "Important"], "rewrite": "You can choose through the \"sidebar -Privacy Center -Privacy Management -Other Settings\". Do not allow other users to view your personal homepage, follow lists, fan lists, and listening to songs."}
{"task": "rw_55.jsonl", "id": 56500, "text": "1.3.4. If you have opened a member service, you can check your membership identity, validity period, card coupon (including gift cards, coupons, etc.);", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56501, "text": "In order to verify your membership status, we will collect your membership status, the effective period of membership time, opening and renewal VIP records, download records, and equity winning information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect your membership status, long -term validity period, opening and renewal VIP records, download records, equity winning information."}
{"task": "rw_55.jsonl", "id": 56502, "text": "When we issue an announcement of illegal punishment, we will announce information such as the nickname of illegal accounts.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When we issue an announcement of illegal punishment, we will announce information such as the nickname of illegal accounts."}
{"task": "rw_55.jsonl", "id": 56503, "text": "1.4. Service content browsing/search/playback", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56504, "text": "1.4.1. Service content browsing/playback", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56505, "text": "When you use our audio and video, live broadcast, electronic readings (novels) and other service content to browse and playback functions, provide you with continuous and consistent use experience, we need to collect your equipment information and personal Internet records.", "label": ["Important", "First Party Collection Information"], "rewrite": "We need to collect your equipment information and personal Internet records."}
{"task": "rw_55.jsonl", "id": 56506, "text": "The aforementioned personal Internet records include: browse/click/play records, collection/attention/attention/reservation records, likes/sharing/release records, visits date/time/time, number of interaction, etc.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting personal Internet records includes: browsing/click/play records, collection/attention/follow -up records, likes/sharing/release records, visits date/time/time, number of interaction, etc."}
{"task": "rw_55.jsonl", "id": 56507, "text": "When you use the screen service to play videos or view the live broadcast content, we need to make local network links to collect your network information and TV -side hardware equipment names, manufacturers, and equipment models to confirm your mobile client hardware equipment and TV side.In the same local area network, hardware equipment realizes the interconnection and completion effect adaptation of hardware equipment.", "label": ["Important", "First Party Collection Information"], "rewrite": "We need to carry out local network links to collect your network information and TV -side hardware equipment names, manufacturers, and equipment models."}
{"task": "rw_55.jsonl", "id": 56508, "text": "1.4.2. Service content search", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56509, "text": "When you use the search function, we will automatically collect some of your information, including the following personal information: search content, browsing records and time, search time, and the number of times to interact with them.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the search function, we will automatically collect some of your information, including the following personal information: search content, browsing records and time, search time, and the number of times to interact with them."}
{"task": "rw_55.jsonl", "id": 56510, "text": "In order to provide efficient search services, some of the aforementioned information will temporarily store on your local device and show you search history.", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56511, "text": "1.5.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56512, "text": "1.5.1., When you use video editing, uploading, publishing, live broadcasting, live broadcast, posting, posting, communication, comments, sharing services/functions in the platform in some of our products or servicesOutside the account, you may take the initiative to provide relevant graphic/video content, interactive information (listening songs, posts, likes, comments, sharing, and interactive information).", "label": ["Important", "First Party Collection Information"], "rewrite": "You may take the initiative to provide relevant graphic/video content, interactive information (listening songs, posts, likes, comments, sharing, and interactive information)."}
{"task": "rw_55.jsonl", "id": 56513, "text": "We will automatically collect your above information and show your nickname, avatar, and published information content.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will automatically collect your personal information and show your nickname, avatar, and published information content."}
{"task": "rw_55.jsonl", "id": 56514, "text": "Please know that the information you posted may include personal information of others. Please obtain legal authorization of others to avoid illegally leaking personal information of others.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "The information you posted may include personal information of others. Please obtain legal authorization of others to avoid illegally leaking personal information of others."}
{"task": "rw_55.jsonl", "id": 56515, "text": "If you don't agree with us to collect the above information, you will not be able to use our information release function, but it will not affect other products and services you provide for you.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you do not agree with us to collect personal information, you will not be able to use the information release function, but it will not affect your other products and services."}
{"task": "rw_55.jsonl", "id": 56516, "text": "1.5.2., When you use some of our interactive functions (such as shaking the song, shaking the dynamic photo, interactive advertisement, and shaking of tide), and spatial sound effects, running radio, Baidu AR, real -name authentication cameraWhen function, we need to obtain the sensor information of your device (rotating vector sensor, magnetic field sensor, acceleration sensor, linear acceleration sensor information) to implement the aforementioned function.", "label": ["Important", "First Party Collection Information"], "rewrite": "We need to get the sensor information of your device (rotating vector sensor, magnetic field sensor, acceleration sensor, linear acceleration sensor information) for realizing interactive functions."}
{"task": "rw_55.jsonl", "id": 56517, "text": "1.5.3., When you use Bluetooth equipment or intelligent hardware products with Bluetooth function to connect or interact with cool dog products or services (such as voice songs, flash control, sound effects, playback control)When the song function, we need to obtain the Bluetooth permissions of your device to achieve the aforementioned function.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use Bluetooth equipment to connect or interact with cool dog products or services (such as voice songs, flash control, sound effects, playback control), we need to obtain the Bluetooth permissions of your device to achieve the aforementioned function."}
{"task": "rw_55.jsonl", "id": 56518, "text": "1.5.4. In addition, we will interact with you through message push, station letters, telephone, text messages, and email methods.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56519, "text": "You know and agree that for one or more contact information you provided in the process of using the product or service (email, contact phone number, contact address)Send multiple types of notifications for user messages, authentication, security verification, and user research.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56520, "text": "You can independently control the receiving mechanism of the message notification in our products or services. You can control the specific type of notification of whether you receive the message notification and the message notification of the receipt through the sidebar -setting -message settings;", "label": ["Important", "Edit/Control"], "rewrite": "You can control the specific type of notification of whether you receive the message notification and the message notification of the receipt through the side border -setting -message settings."}
{"task": "rw_55.jsonl", "id": 56521, "text": "In addition, you can be withdrawing through the withdrawal method provided in mobile phones and emails.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56522, "text": "1.6. Order and delivery", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56523, "text": "1.6.1. When you buy goods or services in our products or services, we need to collect your trading goods or service information according to the typeHis contact number), transaction amount, payment account, order time, order merchant, order number, order status, payment method, payment status, the name and ID number of the viewer (partial performance requires real -name authentication, identity documents refer to identity identityCertificate, Hong Kong and Macau residents travel to and from the Mainland, passports or Taiwan residents to and from the mainland), the specific collection information is based on the corresponding scene settings.", "label": ["Important", "First Party Collection Information"], "rewrite": "We need to collect your transaction goods or service information according to the type of goods or service types, the consignee information (the consignee's name, the receiving address and its contact phone number), the transaction amount, the payment account, the order time, the order merchant, the order number, the order number, Order status, payment method, payment status, the name and ID number of the movie viewer."}
{"task": "rw_55.jsonl", "id": 56524, "text": "We collect this information to help you successfully complete transactions, ensure your transaction security, query order information, and provide customer service.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56525, "text": "1.6.2. After you place an order, if the product is provided by a third -party seller or the product needs a third -party distribution, we will complete the delivery and distribution of the goods in order to smoothly, safe, and accurately.It will inevitably know your related distribution information (including the name of the consignee, the personal information of the receipt, and the contact phone number) within the delivery and distribution session.", "label": ["Important", "First Party Collection Information"], "rewrite": "Merchant and third -party distribution companies will collect your relevant distribution information during the delivery and delivery session (including the consignee's name, the personal information, and its contact phone number)."}
{"task": "rw_55.jsonl", "id": 56526, "text": "We promise you that we will ensure your personal information security with the greatest efforts. We will strictly require merchants and third -party distribution companies to keep your personal information confidential, and only learn and use only with the purpose of distribution.use.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will strictly require merchants and third -party distribution companies to keep your personal information confidential, and only learn and use only at the purpose of distribution. We must not leak or do any other use."}
{"task": "rw_55.jsonl", "id": 56527, "text": "1.6.3., If you use virtual currency recharge, virtual items to purchase gifts, member rights opening services, we will collect your recharge, transactions, and balance information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect your recharge, transactions, and balance information."}
{"task": "rw_55.jsonl", "id": 56528, "text": "Recharge, transactions, and balance information are personal sensitive information. We will collect, transmit, and store encryption technology.", "label": ["Important", "Data Security"], "rewrite": "Recharge, transactions, and balance information are personal sensitive information. We will collect, transmit, and store encryption technology."}
{"task": "rw_55.jsonl", "id": 56529, "text": "1.7. Participate in the event", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56530, "text": "When you participate in the event, if you involve your personal information collection, we will explain in the rules of the activity.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you participate in the event, if you involve your personal information collection, we will explain in the rules of the activity."}
{"task": "rw_55.jsonl", "id": 56531, "text": "In particular, if it involves the distribution of prizes or actual objects related to activities, we need to collect your receiving information (receiving address, contact name and contact phone number) and share it with third -party partners who provide logistics services, To realize the delivery of prizes or other physical objects;", "label": ["Important", "First Party Collection Information"], "rewrite": "We need to collect your receiving information (receiving address, contact name and contact phone number) and share it with third -party partners to achieve the delivery of prizes or other physical objects."}
{"task": "rw_55.jsonl", "id": 56532, "text": "When you involve red envelopes, bonuses, or other rewards, the law requires us to fulfill our obligation to withdraw personal income tax, so we need to collect your name, ID information (ID card, Hong Kong and Macao residents to go to the Mainland, passport or TaiwanResidents travel to and from the mainland).", "label": ["Important", "First Party Collection Information"], "rewrite": "We need to collect your name and ID information (ID card, Hong Kong and Macao residents travel permits, passports or Taiwan residents to travel to and from the mainland) in accordance with the law."}
{"task": "rw_55.jsonl", "id": 56533, "text": "We may use your relevant information to develop and improve products and services, comprehensive statistics, data analysis or processing or other uses you agree with.", "label": ["Important", "Usage"], "rewrite": "We may use your relevant information to develop and improve products and services, comprehensive statistics, data analysis or processing, etc., or other uses you agree with."}
{"task": "rw_55.jsonl", "id": 56534, "text": "1.8. Customer service, other user response functions", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56535, "text": "When you interact with our customer service or use other user response functions (feedback on online submission, communicate with online/artificial customer service, propose our after -sales application for our products or services, exercise your relevant personal information control, other customer complaints and other customer complaints andAt the time of demand), for your account and system security, we need to provide you with account information first and match your previous personal information to verify your user identity.", "label": ["Important", "First Party Collection Information"], "rewrite": "We need you to provide account information first and match your previous personal information to verify your user identity."}
{"task": "rw_55.jsonl", "id": 56536, "text": "When you use customer service or other users to respond, we will also collect your personal information according to the scene: contact information (the phone number/e -mail/QQ number you use when you contact us or other you actively provided to usContact information), you and our communication information (sensitive personal information) in the form of text/picture/audio and video/call records.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will also collect your following personal information according to the scene: contact information, you and our communication information (sensitive personal information) existing in the form of text/picture/audio and video/call records."}
{"task": "rw_55.jsonl", "id": 56537, "text": "We collect this information to investigate the facts and help you solve the problem.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide personal information, it may cause you to be unable to use our customer service and other user response mechanisms."}
{"task": "rw_55.jsonl", "id": 56538, "text": "1.9. Product safety guarantee function", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56539, "text": "1.9.1. When you use the registered login, content release, song playback or downloading, paid purchase, real -name authentication and other functions or services of our product, we need to collect your personal information to ensure your use of our products or servicesThe account and system security of the time, and assist in improving the security and reliability of our product and services to prevent any behaviors that endanger users, cool dogs, and society. Specific personal information refers to your mobile phone number, account login land, equipment, equipment, equipmentInformation, information in the application, Bluetooth information, sensor information (rotating vector sensor, magnetic field sensor, acceleration sensor, linear acceleration sensor information), login IP address, product version number, language mode, browsing records, network usage habits, habits of network usage, habits of network usage, habits of network usage, habits of network usage, habits,, habits of network usage, habits,Service fault information, network logs, personal Internet records, transaction information, real -name authentication information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We need to collect your personal information to ensure your account and system security when using our products or services.Product version number, language mode, browsing records, network usage habits, service failure information, network logs, personal Internet records, transaction information, real -name certification information."}
{"task": "rw_55.jsonl", "id": 56540, "text": "Among them, device information includes hardware models, MAC address/network device logo (MAC address, Bluetooth MAC address), IMEI, IMSI, MEID, Android, hardware serial number, IDFA, OAID, Deviceid, ICCID, Openudid.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56541, "text": "Log information means that when you use our products or services, we automatically collect and generate the operation logs (including your browsing records, likes, sharing, reviews, search words and search records, interactive records, collection, attention, download records, download records, Play records, playback duration, access date and time, time of smart external devices such as Bluetooth headsets, and smart speakers), and your service log (including but not limited to the application information that is being installed or running process information, applications that are runningOverall operation, use and frequency, application crash, overall installation usage, performance data, application sources, etc.).", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56542, "text": "1.9.2., We will comprehensively judge your account, account and transaction risk, identity verification, customer service, testing and prevention of security incidents, fraud monitoring, archiving and backup purposes according to the above information, Analysis and disposal measures.", "label": ["Important", "Usage"], "rewrite": "We will comprehensively judge your account, account and transaction risks based on personal information, identity verification, customer service, testing and prevention of security events, fraud monitoring, archiving and backup purposes, and adopt necessary records, audit, analysis, and disposal measures in accordance with the law."}
{"task": "rw_55.jsonl", "id": 56543, "text": "Once we detect or suspected account security risks, we will use relevant information for security verification and risk exclusion to ensure the security of the products and services we provide to you to ensure that your rights and interests are not infringed.", "label": ["Important", "Data Security"], "rewrite": "We will use relevant information for security verification and risk exclusion to ensure the safety of the products and services we provide to you."}
{"task": "rw_55.jsonl", "id": 56544, "text": "At the same time, when account or system security issues occur, we will collect this information to optimize our products and services.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "When accounts or system security issues occur, we collect this information to optimize our products and services."}
{"task": "rw_55.jsonl", "id": 56545, "text": "1.9.3. In order to ensure the safety of your equipment operation environment and prevent malicious procedures and anti -cheating, we will collect or run on your device when you agree with this privacy policy and need to call and awaken the application of third -party applicationsSoftware list information (including software packages and software names) or process information that is running.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "After you agree with this privacy policy, we need to call and awaken third -party applications to collect the software list information (including software package names and software names) or process information that are running on your device."}
{"task": "rw_55.jsonl", "id": 56546, "text": "Please know that separate software list information cannot identify your specific identity.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56547, "text": "1.10.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56548, "text": "If you use the free traffic function, in order to accurately identify the identity of the user's identity and better record the traffic consumed by the directional application, we will obtain your mobile phone number through the partner and collect your device attribute information (IP address, mobile phone model, mobile phone model), SIM card serial number, IMSI (international mobile user identification code), operator information, to determine whether it meets the traffic free conditions in order to provide traffic -free services.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will obtain your mobile phone number through the partner and collect your device attribute information (IP address, mobile phone model), SIM card serial number, IMSI (international mobile user identification code), operator information to determine whetherTraffic conditions can provide free traffic services."}
{"task": "rw_55.jsonl", "id": 56549, "text": "Please note that when you receive a traffic -free telephone card or open a traffic -free service, you may need to perform real -name authentication, and you need to provide name, ID card number, contact phone number, receiving address, detailed address (display with the actual operating party page display displayIt is prevailing), at this time, cool dogs will not collect your information.", "label": ["Important", "First Party Collection Information"], "rewrite": "You may need to provide real -name authentication, and you need to provide name, ID card number, contact telephone number, receiving address, detailed address (prevailing on the actual operating party page display). At this time, Cool Dog will not collect your information."}
{"task": "rw_55.jsonl", "id": 56550, "text": "It is prompted to carefully identify the provider of actual services and carefully check the relevant privacy policies or personal information processing rules before using any third -party service.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56551, "text": "1.11. Service content recommendation (personalized content recommendation/directional advertising push), maintenance/improvement of our product or service essential", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56552, "text": "1.11.1. In some of our products or services, we will recommend videos, live broadcasts, short videos, music, audiobooks, and their service content and advertisements according to factors such as hot spots and platform heat push.Recommended according to the platform operation strategy.", "label": ["Important", "Usage"], "rewrite": "We will recommend videos, live broadcasts, short videos, music, audiobooks, and its service content and advertisements based on recent hotspots, platform heat push and other factors."}
{"task": "rw_55.jsonl", "id": 56553, "text": "At the same time, in order to recommend more quality in real time, you may be more interested in the content and advertisement of you, let you have a better product or service experience or other uses you agree with, we will also follow your personal information and user portraits according to your relevant personal information, user portraitsWait for personalized content recommendation/directional advertising push.", "label": ["Important", "Usage"], "rewrite": "We will also refer to personalized content recommendation/directional advertising push based on your relevant personal information, user portraits, etc."}
{"task": "rw_55.jsonl", "id": 56554, "text": "In the process, we will collect your birthday, gender, region, occupation, equipment logo, and search records, play history, play history, browse service content and advertisements in our products or services, andRecommended algorithm modeling, programmatic advertising recommendation algorithm modeling, user behavior analysis, and user portraits with comprehensive statistics or analysis methods to help us know how to use our products moreOr service, maintaining and improving our products or services or providing you with personalized services/directional push, including us with relevant personalized information to you (our personalized information may be automatically based on information systems and algorithms, including automated decision -making mechanisms including information systems and algorithmsMake it), share information with our partners in the case of obtaining your consent so that they can send you information about their products and services.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect your birthday, gender, region, occupation, equipment logo, as well as your search records in our products or services, play history, browse service content and advertisements, and behavioral information that interacts with them,Praise/share/comment/interactive information, collection records, playback duration, order information, IP address, access date and time, your bias network behavior, interest preferences, equipment information, necessary software lists, and comprehensive statistics, analysis, analysis, analysisMethods separately or with other services combined with other services for recommendation algorithm modeling, programmatic advertising recommendation algorithm modeling, user behavior analysis, and user portraits."}
{"task": "rw_55.jsonl", "id": 56555, "text": "Automated decision -making refers to activities that automatically analyze, evaluate personal behavior, hobbies, and make decisions through computer programs.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56556, "text": "1.11.2. When you use innovative advertising interactive functions (such as shaking, twisting, and reversing the device), we will call the device's gyroscope, acceleration, and gravity sensor to identify your device status.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use innovative advertising interactive functions, we will call the device's gyroscope, acceleration, and gravity sensor to identify and judge your device status."}
{"task": "rw_55.jsonl", "id": 56557, "text": "Please understand that separate device sensor data does not involve any personal location information and cannot be combined with other information to identify the identity of a specific natural person.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56558, "text": "1.11.3., We have personalized recommendation and autonomous management functions in the product. You can use the sidebar -Privacy Center -Privacy Management Management/Advertising Management to manage related services content/advertising personalized recommendations.", "label": ["Important", "Edit/Control"], "rewrite": "You can manage the personalized recommendations of related services/advertisements through the side border -privacy management -personalized recommendation management/advertising management/advertising management."}
{"task": "rw_55.jsonl", "id": 56559, "text": "1.11.4., You authorize us to have the right to entrust our partners with information promotion and advertising (see the third -party SDK service details) to share the formation of our relevant information collection, but it cannot identify your personal identity informationIndirect user portraits, de -identified equipment information or analysis and statistical information after anonymous processing to help them make advertising or decision -making suggestions without identifying your personal identity, increase the effective touch rate of advertising, measure advertisingThe effectiveness of related services.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You have authorized us to have the right to form with the partner (see the third -party SDK service details), and share the use of your relevant information collection, but cannot identify indirect user portraits, de -identified device information or anonymous processing of personal identity informationAnalysis and statistical information."}
{"task": "rw_55.jsonl", "id": 56560, "text": "1.12. Your personal information collected from the external third party", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56561, "text": "1.12.1., You know and agree, you cannot obtain the personal information provided by the external third parties (not limited to this), or your personal information collected by the external third party.Methods (such as malicious intervention in the opponent's app data) to obtain your personal information with software program without authorization.", "label": ["Important", "First Party Collection Information"], "rewrite": "We cannot obtain the personal information provided by the external third party (the Kuyou affiliate is not limited to this), or your personal information collected by the external third party, and we will not use unconventional methods (such as malicious intervention of the other party app data)Get your personal information with software program."}
{"task": "rw_55.jsonl", "id": 56562, "text": "If you need to indirectly collect your personal information from a third party due to the need for business development, and we will directly or unite to provide you with products or services, we (or third parties) will explicitly explicitly show you the shared you.The source, type, purpose, method, and business functions of information, the scope of authorization consent (if the method and scope of the use exceeds the scope of your original authorization in the third party, we will obtain your authorization consent again). This scene includes this scene.When you log in to our products or services directly through a third -party account, the account information (avatar, nickname), and some of our products/services we have obtained from third parties, provided by business partners or we and business partnersWhen provided jointly, in order to carry out the smooth development of the necessary/reasonable business, some of your information and other partners (comments, dynamic, dynamic, dynamic, dynamic and dynamic when using some of your products or services when using our products or services (comments, dynamic, Pictures, photos, videos).", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "We (or third parties) will explicitly explicitly explicitly share the source, type, purpose, method, method, and business functions of your personal information that you shared (if the method and scope of use exceeds the scope of the original authorized scope of the third party in the third party,We will get your authorization consent again)."}
{"task": "rw_55.jsonl", "id": 56563, "text": "1.12.2.,, In addition, we will require the third party to request the third party in writing (such as the agreement and commitment letter) before indirectly collecting your personal information (such as the agreement and commitment letter).When we indirectly collect your personal information and involve your personal sensitive information, we require that third parties must be confirmed again before providing us, and at the level of agreement, the legitimacy of the third party on the source of personal information sources is requiredMake a commitment to compliance. If a third party violates the behavior, we will clearly ask the other party to bear the corresponding legal responsibility.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "We will clearly collect your personal information and clearly request the third direction in writing to inform you the content of the information that it shared and obtain your explicit consent, and when it involves your personal sensitive information, we ask the third party to pass you through you.Confirm again."}
{"task": "rw_55.jsonl", "id": 56564, "text": "We will not use the protection methods and measures of the personal information of the user's personal information that are not lower than our personal information collected.", "label": ["Important", "Data Security"], "rewrite": "We will not use protection methods and measures that are not lower than the personal information of the user's personal information."}
{"task": "rw_55.jsonl", "id": 56565, "text": "1.13. Others", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56566, "text": "1.13.1. When you use our products, based on the regional restrictions of the author authorized by the song copyright party, we will analyze your rough geographical location through the IP address. If the analysis results show that you are located outside the country or region outside China, we need to apply for application.Get your location permissions, and obtain your precise geographical location information such as you GPS information, WLAN and other network location information (including nearby wifi), Bluetooth, and base station ID (cellid) to determine whether you are inCopyright authorized areas.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you are located in a country or region outside China, you need to apply for your location permissions, and after you authorize, you can use your GPS information, WLAN and other network location information (including nearby WIFI), Bluetooth, and base station ID (Cellid), etc.Information obtain your precise geographical information to determine whether you are in the copyright authorization area."}
{"task": "rw_55.jsonl", "id": 56567, "text": "Accurate geographical information information is personal sensitive information. If you do not provide it, you may not be able to continue to use the song playback function, but it does not affect your other functions and services.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56568, "text": "1.13.2. When you use your friend's function, we will be based on the mobile phone number, address book, person who follows you or other users.You recommend the people you might know, and recommend your or your content to the person you might know.", "label": ["Important", "Usage"], "rewrite": "We will recommend the people you may know based on the mobile phone number, address book, the address book, the person you follow, and the relationship chain generated by the use of the sharing function."}
{"task": "rw_55.jsonl", "id": 56569, "text": "If you don't want us to recommend or recommend to those who may know based on the aforementioned features, you can use the sidebar-Privacy Center-Privacy Management-Other Settings-Open Good Friends Matching/Allow friends to find me to set up.", "label": ["Important", "Edit/Control"], "rewrite": "You can use the sidebar-Privacy Center-Privacy Management-Other Settings-Open Good Friends Matching/Allow friends to find me to set up."}
{"task": "rw_55.jsonl", "id": 56570, "text": "Please know that if the address book uploaded by other users contains your contact information, we will recommend you the person you may know and the content you and your content to the person you may know.", "label": ["Important", "Risk", "Usage"], "rewrite": "If the address book uploaded by other users contains your contact information, we will recommend the people you might know to you and your content to you and your content to the person you may know."}
{"task": "rw_55.jsonl", "id": 56571, "text": "1.13.3. When you use AI reading, linking the function, receiving information, participation in the event, etc., the cool dog client needs to access your shear plate locally to read the text and link contained in it., Password information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use AI read aloud and link to the song recognition function, the Cool Dog client needs to visit your scissors locally to read the text, link, and password information contained in it."}
{"task": "rw_55.jsonl", "id": 56572, "text": "The Cool Dog Client only uploads our server only after identifying the shear plate content belongs to AI reading, curling links, sharing information, activity linkage and other instructions in order to feedback related content to you.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56573, "text": "In addition, the cool dog client will not upload other information of your cut plate to our server.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56574, "text": "Only when you confirm the previous information in the search box and click on the search, we will collect the information in order to achieve the search function.", "label": ["Important", "First Party Collection Information"], "rewrite": "Only when you confirm the previous information in the search box and click on the search, we will collect the information in order to achieve the search function."}
{"task": "rw_55.jsonl", "id": 56575, "text": "The systems of some devices will prompt the application (APP) to read the shear plate, but the system prompts that it cannot be distinguished or uploaded by local processing or uploading, and due to the differences in statistical methods, the possibility of misunderstanding is not ruled out.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56576, "text": "If you find similar prompts and have questions, please contact us so that we can locate the problem.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56577, "text": "1.13.4. In order to facilitate you to share or search and avoid manual operations faster, when you use the cool dog code, cool password function, or a specific scene of related support for one -click copyingCool dog code, cool passwords or related content are written into your shear board.", "label": ["Important", "First Party Collection Information"], "rewrite": "We need to write the cool dog code, cool passwords or related content after you operate it with one click."}
{"task": "rw_55.jsonl", "id": 56578, "text": "1.13.5., Our product application (Android version) has been registered for boot broadcast permissions in order to achieve self -activation and further ensure that the power charging function function is used normally after the device is restarted.", "label": ["Permission Acquisition", "Important"], "rewrite": "5. Our product application (Android version) has registered for boot broadcast permissions."}
{"task": "rw_55.jsonl", "id": 56579, "text": "In order to avoid the discharge of the power discharge function due to the long -term failure, we will apply for the acquisition of the notification bar of the device you use;", "label": ["Permission Acquisition", "Important"], "rewrite": "In order to avoid the discharge of the power function due to the long -term failure, we will apply for the acquisition of the notification bar with the device you use."}
{"task": "rw_55.jsonl", "id": 56580, "text": "In particular, when you use the charging electric effect game mode or the drama mode, in order to prevent the game or video process from being interrupted, we will apply for the reading and use of the read application of your equipment.", "label": ["Permission Acquisition", "Important"], "rewrite": "In order to prevent the game or video process from being interrupted, we will apply for the authorization of the reading and application of your equipment."}
{"task": "rw_55.jsonl", "id": 56581, "text": "The aforementioned three permissions will not collect or use your personal information. You can open the permission of the notification bar and read the application of the application in the corresponding scenario according to our product prompts.Two permissions;", "label": ["Permission Acquisition", "Important"], "rewrite": "You can open the permissions of obtaining notifications in the corresponding scenario according to the product prompts, read the application of application and use, or open or close the above two permissions through the setting function of your equipment."}
{"task": "rw_55.jsonl", "id": 56582, "text": "The aforementioned permission may affect the normal use of the charging electric function, or cause you to be unable to use the game mode and the drama mode, but it does not affect your other functions that use our products or services.", "label": ["Permission Acquisition", "Important"], "rewrite": "After the permissions are closed, it may affect the normal use of the discharge function, or cause you to be unable to use the game mode and the drama mode, but it does not affect your other functions."}
{"task": "rw_55.jsonl", "id": 56583, "text": "1.13.6. Comments, reply, photos, audio, and videos posted by other users may include your information. Such information may be collected or used by the publishing and uploading of other users.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Comments, reply, photos, audio, and videos posted by other users may include your information, and such information may be collected or used by us."}
{"task": "rw_55.jsonl", "id": 56584, "text": "If you think you violate your personal information, please contact us to handle it through the following complaint method and contact information.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56585, "text": "1.13.7., We may collect some other reasonable uses when you use our products or services, including: questionnaire reply, operating activities, and the interaction between you and cool dog music/our partners.The relevant information obtained is used to develop and improve, comprehensive statistics, data analysis or processing, etc., other purposes that you agree or authorize, comply with legal provisions or other reasonable purposes.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may collect the specific information when you use our products or services for other reasonable uses, including: questionnaires, operating activities, and the relevant information we get when interacting with Kugou Music/Our partners."}
{"task": "rw_55.jsonl", "id": 56586, "text": "1.14.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56587, "text": "According to the \"Personal Information Protection Law\", in the following circumstances, we collect and use your personal information without obtaining your consent in advance:", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "In the following circumstances, we collect and use your personal information without obtaining your consent in advance:"}
{"task": "rw_55.jsonl", "id": 56588, "text": "(1) It is necessary for the contract to establish and fulfill your contract as a party;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting the personal information necessary for the establishment and fulfilling the contract without soliciting consent."}
{"task": "rw_55.jsonl", "id": 56589, "text": "(2) In order to fulfill the statutory duties or the requirements of the statutory volunteer;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting and fulfilling the personal information necessary for legal duties or the required obligations of the legal obligation does not need to solicit consent."}
{"task": "rw_55.jsonl", "id": 56590, "text": "(3) In order to cope with emergencies, or in urgent situations, it is necessary to protect the health and property security of natural people;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting the personal information necessary for life and health and property security in the case of collecting response to public health incidents, or in urgent situations, without asking for consent."}
{"task": "rw_55.jsonl", "id": 56591, "text": "(4) In order to implement news reports and supervision of public opinion for public interests, handle personal information within a reasonable scope;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "In order to implement news reports and public opinion supervision, deal with personal information within a reasonable scope without soliciting consent."}
{"task": "rw_55.jsonl", "id": 56592, "text": "(5), in accordance with the provisions of the Personal Information Protection Law, handle personal information on personal or other legal disclosure within a reasonable scope;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "In accordance with the provisions of the Personal Information Protection Law, deal with public personal information within a reasonable scope without asking for consent."}
{"task": "rw_55.jsonl", "id": 56593, "text": "(6), other circumstances stipulated in laws and administrative regulations.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect personal information under other circumstances stipulated in laws and administrative regulations without asking for consent."}
{"task": "rw_55.jsonl", "id": 56594, "text": "1.15., Please understand that the functions and services we provide to you are constantly updated and developed. If a function or service is not in the aforementioned instructions and collects your personal information, we will update this privacy policy, start starting this privacy policy, start starting this privacy policy, startupOr browse the interface prompts, pop -ups, website announcements, on -site letters, interaction processes, website announcements, etc. to explain the content, scope and purpose of information collection.", "label": ["Important", "First Party Collection Information"], "rewrite": "If a function or service is not collected in the aforementioned instructions and your personal information is collected, we will use the renewal of the privacy policy, start or browse interface prompts, pop -up windows, website announcements, in -site letters, interaction processes, website announcements, etc.Explain the content, scope and purpose of the collection of information."}
{"task": "rw_55.jsonl", "id": 56595, "text": "In the process, if you have any doubts about related matters, you can contact us through the way provided by Article 8 of this privacy policy, and we will answer it as soon as possible.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56596, "text": "2. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56597, "text": "Cookie and similar technologies are commonly used in the Internet.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56598, "text": "When you use cool dogs and related services, we may use related technologies to collect your information.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56599, "text": "We use cookies and similar technologies to achieve the following functions or services:", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56600, "text": "2.1. Safety and efficient operation of products and services: We may set COOKIE or anonymous identifier that guarantees security and ensure security, so that we can confirm whether you are safe to log in to the service, or whether you encounter stolen, fraud and other illegal behaviors.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56601, "text": "These technologies also help us improve service efficiency, improve login and response speed.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56602, "text": "2.2. Help you get a easier access experience: using this kind of technology can help you save the steps and processes of your personal information and enter search content (eg, form filling in forms).", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56603, "text": "2.3. Recommend, display, and push you what you may be interested in: We may use, cookie, and similar technologies to understand your preferences and use habits, and analyze data to improve information that improves product services and recommend users.Or features, and optimize your choice of advertising.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may use cookies and similar technologies to understand your preferences and use habits for data analysis."}
{"task": "rw_55.jsonl", "id": 56604, "text": "You can use the browser to set the use of refusal or management of cookies and similar technologies;", "label": ["Edit/Control", "Important"], "rewrite": "You can use the browser to set the use of refusal or management of cookies and similar technologies."}
{"task": "rw_55.jsonl", "id": 56605, "text": "But please note that if Cookie is discontinued, you may not be able to enjoy the best service experience, and certain services may not be used normally.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "If Cookie is stopped, you may not be able to enjoy the best service experience, and certain services may not be used normally."}
{"task": "rw_55.jsonl", "id": 56606, "text": "3. How can we share, transfer and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56607, "text": "3.1. Sharing", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56608, "text": "We share your personal information on the premise that we follow the premise of \"legitimate legitimacy, minimum necessity, and clear principle of purpose.\"", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We share your personal information on the premise that we follow the premise of \"legitimate legitimacy, minimum necessity, and clear principle of purpose.\""}
{"task": "rw_55.jsonl", "id": 56609, "text": "If we entrust a third party to handle your personal information, we will agreed with the trustee to agreed to the purpose, time limit, processing method, type of personal information, protection measures, and the rights and obligations of both parties, andInformation processing activities supervise.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will agreed with the trustee to agreed to the purpose, period, processing method, type of personal information, protection measures, and the rights and obligations of both parties, and supervise the trustee's personal information processing activities."}
{"task": "rw_55.jsonl", "id": 56610, "text": "If we and third -party personal information processors determine the purpose and method of processing your personal information, it will agreed with the partners to agree on their respective rights and obligations, and the agreement will not affect you from any of the individual information processors to exercise you to exercise youIf the right of rights will cause damage to your personal information rights and interests, we will bear responsibility according to law.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If we and third -party personal information processors shall jointly determine the purpose and method of processing your personal information, it will agreed with the partners to agree on their respective rights and obligations, and the agreement will not affect you from any of the individual information processors to exercise their rights to exercise their rights.Essence"}
{"task": "rw_55.jsonl", "id": 56611, "text": "We will conduct an evaluation of personal information protection for the shared activities of personal information, and take effective technical protection measures on the output form, circulation, use, etc.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will conduct an evaluation of personal information protection for the shared activities of personal information, and take effective technical protection measures on the output form, circulation, use, etc."}
{"task": "rw_55.jsonl", "id": 56612, "text": "At the level of the cooperation agreement, the information protection obligations and responsibilities of the partner's information are strictly requested, and the protection agreement on data security with business partners has signed a protection agreement on data security before cooperation.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "At the level of the cooperation agreement, the information protection obligations and responsibilities of the partner's information are strictly requested, and the protection agreement on data security with business partners has signed a protection agreement on data security before cooperation."}
{"task": "rw_55.jsonl", "id": 56613, "text": "We have developed the \"Third -Party Information Sharing List\" to clearly and simply introduce us to our embedded SDK list, and the information sharing with third parties with the interface (API) with business partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We have developed the \"Third -Party Information Sharing List\" to clearly and simply introduce us to our embedded SDK list, and the information sharing with third parties with the interface (API) with business partners."}
{"task": "rw_55.jsonl", "id": 56614, "text": "The situation of our personal information sharing with third parties includes:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The situation of our personal information sharing with third parties includes:"}
{"task": "rw_55.jsonl", "id": 56615, "text": "3.1.1. Sharing under legal circumstances: We may share your personal information from relevant administrative and judicial organs in accordance with the requirements of laws and regulations, litigation, and disputes in accordance with the requirements of administrative and judicial organs in accordance with the requirements of administrative and judicial organs.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share your personal information from relevant administrative and judicial organs in accordance with the requirements of laws and regulations, litigation, and disputes in accordance with the requirements of administrative and judicial organs in accordance with the requirements of administrative and judicial organs."}
{"task": "rw_55.jsonl", "id": 56616, "text": "3.1.2., Share in the case of obtaining a separate consent: After getting your//your parents or guardian's consent, we will share your personal information with other parties.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After getting your//your parents or guardian's consent, we will share your personal information with other parties."}
{"task": "rw_55.jsonl", "id": 56617, "text": "3.1.3. Sharing between related apps: In order to facilitate our unified account system to provide you with consistent services, improve personalized recommendations, realize safety control, and provide customer service needs, cool dog products or services will be unifiedAccount system.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56618, "text": "Applicable APPs for the unified account system will synchronize some personal information of your registered, logged in, and use our products and/or services, which may include the following parts or all information: (1) your device information;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The affiliate app will synchronize some of your personal information, which may include the following parts or all information: (1) your device information."}
{"task": "rw_55.jsonl", "id": 56619, "text": "(2) Your basic information and information, including nicknames, avatars, birthdays, gender, location;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The affiliate app will synchronize your basic information information, including nicknames, avatars, birthdays, gender, and location."}
{"task": "rw_55.jsonl", "id": 56620, "text": "(3) Your personal Internet records, including browsing/search/play/play/release/interactive records;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The affiliated app will synchronize your personal Internet records, including browsing/search/play/release/interactive records."}
{"task": "rw_55.jsonl", "id": 56621, "text": "(4) Trading records, order records, etc.;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The associated app will synchronize transaction records, order records, etc."}
{"task": "rw_55.jsonl", "id": 56622, "text": "(5) Equity/asset information;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The associated app will synchronize equity/asset information."}
{"task": "rw_55.jsonl", "id": 56623, "text": "(6) User portrait.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The associated app will synchronize user portraits."}
{"task": "rw_55.jsonl", "id": 56624, "text": "The aforementioned information will be displayed in the associated app, and you can use relevant equity/assets in the associated app (as applicable).", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Some information will be displayed in the associated app, and you can use relevant equity/assets in the associated app (as applicable)."}
{"task": "rw_55.jsonl", "id": 56625, "text": "3.1.4., Share with business partners: You understand and agree, in order to carry out the necessary/reasonable business, fulfill our obligations in relevant user agreements or privacy policies, exercise our rights or comply with the purpose of legal regulations, weYou may need to share some of your information from some business partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may need to share some of your information from some business partners."}
{"task": "rw_55.jsonl", "id": 56626, "text": "But we promise that we will only share your necessary personal information. If we share your personal sensitive information or change the purpose of the use and processing of personal information, we will solicit your authorization consent again.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "We will only share your necessary personal information. If we share personal sensitive information or change the purpose of the use and processing of personal information, we will solicit your authorization consent again."}
{"task": "rw_55.jsonl", "id": 56627, "text": "In particular, some specific modules or functions in the products and services we provide may be provided by business partners' application interface (API), business partner software tool development package (SDK), or our products and services pass throughBusiness partners' application interface (API) and software tool development package (SDK) link to business partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Some specific modules in products and services may be provided by business partners 'application interface (API), business partners software tool development package (SDK), or our products and services through business partners' application interface (API), Software Tool Development Pack (SDK) links to business partners."}
{"task": "rw_55.jsonl", "id": 56628, "text": "Regardless of what kind of business partners and forms of cooperation, we will conduct strict security detection access evaluation and strict security monitoring of the SDK and application interface (API) obtained by business partners to obtain information.Policies, as well as appropriate confidentiality and security measures to process your personal information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will conduct strict security detection access and strict security monitoring of SDK and application interface (API) that obtain information from business partners, so that it will process your personal information in accordance with appropriate confidentiality and security measures."}
{"task": "rw_55.jsonl", "id": 56629, "text": "Click to view the \"Third -Party Information Sharing List\" to learn about the information sharing of information with third parties through the product embedded SDK and API interface.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Click to view the \"Third -Party Information Sharing List\" to learn about the information sharing of information with third parties through the product embedded SDK and API interface."}
{"task": "rw_55.jsonl", "id": 56630, "text": "3.1.5., Third -party merchants on our platform: In order to realize the needs of your purchase of products or services and enjoy after -sales service, we will share your order information and transaction -related information to our platform's third -party merchants.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will share your order information and transaction -related information to our platform's third -party merchants."}
{"task": "rw_55.jsonl", "id": 56631, "text": "When you order performance tickets, we will provide your contact information (contact person name, mobile phone number, detailed address) to the ticket party (Tianjin Cat Eye Live Technology Co., Ltd., Cat Eye Ticketing) in order to send you a performance ticket.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will provide your contact information (Tianjin Cat Eye Live Technology Co., Ltd., Cat Eye Ticketing) to provide your contact information (contact name, mobile phone number, detailed address) in order to send you a performance ticket."}
{"task": "rw_55.jsonl", "id": 56632, "text": "3.1.6., Share partners who jointly provide a service with us: When we jointly launch membership services or other paid services with third -party cooperation, in order to solve the refund and dispute between us or third parties,You agree that we can share your related order information with the third party;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "To solve the refund and dispute, you agree that we can share your related ordering information with the third party."}
{"task": "rw_55.jsonl", "id": 56633, "text": "We carry out marketing activities with our partners. In order to provide you with normal service and meet your service needs, we will obtain your authorization separately, and after you authorize) Synchronize the partner.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "We will obtain your authorization separately and synchronize your relevant information (specifically your authorization content) after your authorization."}
{"task": "rw_55.jsonl", "id": 56634, "text": "3.1.7., Share with partners who entrust a certain service with Cool Dog: When we carry out customer service, user research, event prizes, or other business that need to be commissionedYour necessary user personal information is completed to complete the aforementioned matters.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "We may need to share your necessary user personal information with the partners to complete third -party businesses."}
{"task": "rw_55.jsonl", "id": 56635, "text": "At this time, we will use appropriate ways to share your consent;", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "We will be shared in an appropriate way after obtaining your consent."}
{"task": "rw_55.jsonl", "id": 56636, "text": "At the same time, we will conduct strict cooperation screening, and require it to handle your personal information in accordance with the privacy policies and appropriate confidentiality and security measures.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will strictly screely cooperate and ask them to process your personal information in accordance with appropriate confidentiality and security measures."}
{"task": "rw_55.jsonl", "id": 56637, "text": "3.1.8. Sharing in advertising cooperation:", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56638, "text": "(1) Advertising: We may provide your equipment information and group labels to the advertisers and/or its entrusted agent to push you more suitable information such as information and promotion to you.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may provide your equipment information and group labels to the advertisers and/or its entrusted agent to push you commercial information to you."}
{"task": "rw_55.jsonl", "id": 56639, "text": "(2) Advertising statistical analysis and optimization: We may provide your equipment information, group labels, advertising exposure, browsing, clicking, playback, and advertising transformation data to provide partners who provide advertising statistics analysis and optimization services.Used to analyze and measure the effectiveness of advertising and related services, advertise or decision suggestions, improve the effective touch rate of advertising, and provide you with high -quality and suitable services for you;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may provide partners with advertising related data such as equipment information, group labels, advertising exposure, browsing, clicks, playback, and advertising transformation data."}
{"task": "rw_55.jsonl", "id": 56640, "text": "Advertisers and/or their entrusted agents may require us to provide the aforementioned part or all information for the operation analysis of user sources, optimize advertising strategies, or improve their products and services.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Advertisers and/or their entrusted agents may ask us to provide the aforementioned part or all advertisements."}
{"task": "rw_55.jsonl", "id": 56641, "text": "(3), please rest assured that we will provide data to provide data with technical measures such as de -identification, anonymous or encryption algorithms, to ensure that partners cannot directly identify your identity.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will use technical measures such as de -identification, anonymous or encryption algorithms to deal with information in advertising cooperation to ensure that partners cannot directly identify your identity."}
{"task": "rw_55.jsonl", "id": 56642, "text": "Based on the receiving data, the partners decide whether to issue advertisements through automation, analyze and optimize statistical analysis (including the combination of other data obtained from its legal acquisition for statistical analysis and optimization););", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Based on the receiving data, the partner decides whether to issue advertisements by automatic decision -making, analyze and optimize it."}
{"task": "rw_55.jsonl", "id": 56643, "text": "Please know that for some advertising content, it is the personalized recommendation of the advertisers based on your user portrait, preferences and other user portraits based on your application/software. Without your authorization or illegal situationWill get your behavior or personal information in other applications.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Without your authorization or illegal situation, we will not obtain your behavior or personal information in other applications."}
{"task": "rw_55.jsonl", "id": 56644, "text": "3.2. Personal information transfer", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56645, "text": "We will not transfer your personal information to any company, organization, and individual, except the following situations: except:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not transfer your personal information to any company, organization, and individual, except the following situations: except:"}
{"task": "rw_55.jsonl", "id": 56646, "text": "(1) After obtaining your clear consent, we will transfer your personal information to other parties;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After getting your clear consent, we will transfer your personal information to other parties."}
{"task": "rw_55.jsonl", "id": 56647, "text": "(2) If you need to transfer your personal information due to merging, separation, dissolution, and declaration of bankruptcy.The company and organizations continue to be bound by this policy, otherwise we will ask the company and the organization to reconcile with you.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you need to transfer your personal information due to merging, separation, dissolution, and declaration of bankruptcy, we will tell you the name or name and contact information of the receiver, and will ask new companies and organizations to continue to be subject to this policy.Otherwise we will ask it to re -solicit."}
{"task": "rw_55.jsonl", "id": 56648, "text": "3.3. Public disclosure:", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56649, "text": "We will not publicly disclose the personal information collected to the outside world;", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56650, "text": "If we must be disclosed publicly, we will inform you that the purpose of the public disclosure, the type of disclosure information, and the possible sensitive information involved, and obtain your own consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will tell you the purpose of the public disclosure, the type of disclosure information, and the sensitive information that may be involved, and obtain your individual consent."}
{"task": "rw_55.jsonl", "id": 56651, "text": "3.4. Sharing, transfer, and public disclosure of personal information.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56652, "text": "According to the \"Personal Information Protection Law\", in the following situations, we shared, transferred, and publicly disclosed your personal information without obtaining your consent in advance:", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "In the following circumstances, we shared, transferred, and publicly disclosed your personal information. You do nt need to obtain your consent in advance:"}
{"task": "rw_55.jsonl", "id": 56653, "text": "(7) It is necessary for the contract to establish and fulfill your contract as a party;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "The personal information necessary for sharing and fulfilling the contract does not need to ask for consent."}
{"task": "rw_55.jsonl", "id": 56654, "text": "(8), necessary for fulfilling statutory duties or statutory volunteers;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Sharing is not required to meet the personal information of the statutory responsibility or the required personal information necessary for the statutory obligations."}
{"task": "rw_55.jsonl", "id": 56655, "text": "(9) In order to cope with emergencies, or in urgent situations, it is necessary to protect the health and property safety of natural people;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Shared personal information that should be shared with emergencies, or personal information necessary for life, health and property security in emergencies, without soliciting consent."}
{"task": "rw_55.jsonl", "id": 56656, "text": "(10) Press news reports and public opinion supervision for public interests, and handle personal information within a reasonable range;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "In order to implement news reports and public opinion supervision, deal with personal information within a reasonable scope without soliciting consent."}
{"task": "rw_55.jsonl", "id": 56657, "text": "(11), in accordance with the provisions of the Personal Information Protection Law, handle personal information on its own or other legal disclosure within a reasonable scope;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "In accordance with the provisions of the Personal Information Protection Law, deal with public personal information within a reasonable scope without asking for consent."}
{"task": "rw_55.jsonl", "id": 56658, "text": "(12) Other circumstances stipulated in laws and administrative regulations.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In other circumstances stipulated in laws and administrative regulations, no consent is required."}
{"task": "rw_55.jsonl", "id": 56659, "text": "4. How do you understand and control your personal information", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56660, "text": "We will do everything possible to adopt appropriate technical means to ensure your personal information control, including: you can access, correct/modify, delete your personal information, get your personal information copy, you can withdraw your personal information, or you can withdraw the previously made madeThe consent of your personal information, you can also log out your cool dog account.", "label": ["Edit/Control", "Important"], "rewrite": "You can access, correct/modify, delete your personal information, get your personal information copy, or withdraw your previous consent of your personal information, and you can also log out your cool dog account."}
{"task": "rw_55.jsonl", "id": 56661, "text": "In order to facilitate you to exercise your above -mentioned control, we provide you with operational guidelines and operation settings on the related functional pages of the product. You can operate yourself.", "label": ["Edit/Control", "Important"], "rewrite": "In order to facilitate you to exercise your above control, we provide you with operational guidelines and operation settings on the related functional pages."}
{"task": "rw_55.jsonl", "id": 56662, "text": "If you have doubts and difficulties in the operation, or you cannot exercise your personal information subject right through the above channels and methods, you can contact us through the method of the 8th of this privacy policy. We will promptly in accordance with the provisions of laws and regulationsDo it for you.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56663, "text": "When understanding, updating, corrected, and deleting the aforementioned information, we may ask you to verify your identity to ensure account security.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56664, "text": "Under normal circumstances, you can modify the information you submit at any time, but for the consideration of security and identification, you may not be able to modify some initial registration information, verification information and certification information provided by the registration.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "You may not be able to modify some initial registration information, verification information and certification information provided by the registration."}
{"task": "rw_55.jsonl", "id": 56665, "text": "4.1. Visit personal information", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56666, "text": "4.1.1. After entering Cool Dog Music, you can check your avatars, nicknames, gender, birthday, region, occupation, personality signature, hobbies, account number, account number, account number, account number, account number, account number, Kugouid, age, student certification information (if.).", "label": ["Important", "Edit/Control"], "rewrite": "You can see your avatar, nickname, gender, birthday, region, occupation, personality signature, hobbies, account number, Kugouid, age age, student certification information (such ashave)."}
{"task": "rw_55.jsonl", "id": 56667, "text": "4.1.2. After entering Cool Dog Music, you can click [Local], [Favorite], [Cloud Plate], [Recent], [Song List], [Purchasing List], [Purchased Music], [Purchased Music], [Song List], [Recently], [Recent]], [Watching Novels], [K Song], [Video], [Comment], [Vertical screen MV] View your local or downloaded information, uploaded K song works, videos, published comments, vertical screens producedMV, collection information, listening or listening information, private music cloud disks, purchased information, and recent playback information.", "label": ["Edit/Control", "Important"], "rewrite": "You can click [Local], [Favorites], [Cloud Plate], [Recently], [Song List], [Purchased Music], [Watching Novels], [K Song], [K Song], [K Song], [Video], [Comment], [Vertical screen MV] View information."}
{"task": "rw_55.jsonl", "id": 56668, "text": "4.1.3. After entering Cool Dog Music, you can click [Cool Dog Mall] -Cou in the upper right corner [My] page in the side bar, and click [My Order], [Address Management] to viewYour order information, delivery address, contact and contact number.", "label": ["Important", "Edit/Control"], "rewrite": "You can click [Cool Dog Mall] -Cou in the upper right corner [Mine] to [Mine], click [My Order], [Address Management] to see your order information, delivery address, and contact person respectivelyAnd contact number."}
{"task": "rw_55.jsonl", "id": 56669, "text": "4.1.4. After entering Cool Dog Music, you can click [Laku]-[Performance]-[Mine] to [My] page on the homepage of the Cool Dog Music APP homepage, click [My Order], respectively[Receiving address management], [ ] View your order information, delivery address, contact and contact number, and movie viewer information.", "label": ["Edit/Control", "Important"], "rewrite": "You can click [Leku]-[Performance]-[Mine] to [Mine] on the homepage of the Cool Dog Music APP homepage.Check your order information, delivery address, contact and contact number, and movie viewer information."}
{"task": "rw_55.jsonl", "id": 56670, "text": "4.1.5. After entering Cool Dog Music, you can click [My Friends] to enter my friend's page in the side bar, and click on your friends, attention, fans to view your friends, attention, and fan information.", "label": ["Edit/Control", "Important"], "rewrite": "You can click [My Friends] to enter my friend's page in the side bar, and click on your friends, attention, fans to view your friends, attention, and fan information."}
{"task": "rw_55.jsonl", "id": 56671, "text": "4.2. Delete personal information", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56672, "text": "Generally speaking, we only save your personal information stipulated in laws and regulations or necessary and shortest times.", "label": ["Data Retention", "Important"], "rewrite": "We will only save your personal information as stipulated in laws and regulations or the shortest and shortest time."}
{"task": "rw_55.jsonl", "id": 56673, "text": "To facilitate your exercise of your right to delete, we provide you with two ways to delete online and submit to us.", "label": ["Important", "Edit/Control"], "rewrite": "We provide you with two ways to delete online and ask us to delete your application."}
{"task": "rw_55.jsonl", "id": 56674, "text": "4.2.1. For some of your personal information, we provide you with operational guidelines and operation settings on the related functional page of the product. You can directly delete it.", "label": ["Edit/Control", "Important"], "rewrite": "We provide you with operational guidelines and operation settings on the related functional page of the product, and you can directly delete the information."}
{"task": "rw_55.jsonl", "id": 56675, "text": "Once you delete, we will delete or processes such information, unless laws and regulations have other provisions.", "label": ["Data Retention", "Important", "Edit/Control"], "rewrite": "Once you delete personal information, we will delete or processes such information, unless laws and regulations have other provisions."}
{"task": "rw_55.jsonl", "id": 56676, "text": "You can delete your personal information autonomously in the following ways:", "label": ["Important", "Edit/Control"], "rewrite": "You can delete your personal information autonomously in the following ways:"}
{"task": "rw_55.jsonl", "id": 56677, "text": "(1) After entering Cool Dog Music, you can click [Local], [Collection], [Cloud Plate], [Recent], [Song List], [Purchased Music], [Purchased Music], [Purchased Music],[Watching Novels], [K Song], [Video], [Comment], [Vertical Screen MV], delete your local music or download information, uploaded K song works, videos, published comments, vertical screens producedMV, collection information, listening or reading information, private music cloud disks, purchased information, and recent playback information.", "label": ["Important", "Edit/Control"], "rewrite": "You can click [Local], [Favorites], [Cloud Plate], [Recently], [Song List], [Purchased Music], [Watching Novels], [K Song], [K Song], [K Song], [Video], [Comment], [Vertical screen MV], delete your local music or download information."}
{"task": "rw_55.jsonl", "id": 56678, "text": "(2) After entering Cool Dog Music, you can click [Cool Dog Mall] -Cou in the upper right corner [Mine] page in the side bar, click [My Order], [Address Management] to delete yourOrder information, delivery address, contact and contact number.", "label": ["Important", "Edit/Control"], "rewrite": "You can click [Cool Dog Mall] -When the upper right corner [Mine] to enter the [Mine] page in the side bar, click [My Order], [Address Management] to delete your order information, the receiving address, and contact personAnd contact number."}
{"task": "rw_55.jsonl", "id": 56679, "text": "(3) After entering Cool Dog Music, you can enter the [Mine] page in the upper right corner [Mine] to [Mine], [My Order], [ReceiveManagement of goods], [Movie Viewer] delete your order information, delivery address, contact and contact telephone number, and ticket purchase information.", "label": ["Important", "Edit/Control"], "rewrite": "You can click the [Mine] page in the upper right corner [Mine], [Mine], [My Order], [Receiving address Management], [Movie Viewer], [Miram]-[Performance]-[Performance]-[Performance]-[Performance]-] Delete your order information, delivery address, contact and contact number, and ticket purchase information."}
{"task": "rw_55.jsonl", "id": 56680, "text": "(4) After entering Cool Dog Music, you can click [My Friends] to enter my friend's page in the side bar, and click on your friends, follow or fans to cancel your attention friends, singers or fans.", "label": ["Important", "Edit/Control"], "rewrite": "You can click [My Friends] to enter my friend's page in the side bar, and click on your friends, follow or fans to cancel your attention friends, singers or fans."}
{"task": "rw_55.jsonl", "id": 56681, "text": "(5) When you log in with a third-party account number, you can use [I] -t.-[My Account]-[Account and Binding Settings] to unbind WeChat, mobile phone, QQ, mailbox binding settings, you can also pass throughThe account settings modify the password, unbind multiple accounts under the same mobile phone number, and manage the login device.", "label": ["Important", "Edit/Control"], "rewrite": "You can use [Me]-[My Account]-[Account and Binding Settings] to unbind WeChat, mobile phone, QQ, mailbox binding settings."}
{"task": "rw_55.jsonl", "id": 56682, "text": "4.2.2. In the following circumstances, you can directly make a request to delete your personal information in accordance with the contact information of the 8th provisions of this privacy policy, but except for the anonymous processing of data or other provisions:", "label": ["Important", "Edit/Control"], "rewrite": "In the following circumstances, you can directly make a request to delete information, but except for the anonymous processing of data or other provisions of laws and regulations:"}
{"task": "rw_55.jsonl", "id": 56683, "text": "(1) If we violate laws and regulations, collect and use your personal information;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56684, "text": "(2) If we violate your agreement, collect and use your personal information;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56685, "text": "(3) If you agree with us to collect and use your personal information, then withdraw from consent;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56686, "text": "(4) If our behavior of handling personal information violates your agreement;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56687, "text": "(5) If you no longer use our products or services, or you cancel your account;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56688, "text": "(6) If we no longer provide products or services for you;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56689, "text": "(7) If the purpose of your personal information has been achieved, unable to achieve or to achieve the purpose of the treatment;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56690, "text": "(8) If your personal information is stored, it has expired.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56691, "text": "(9) Other circumstances stipulated in laws and regulations.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56692, "text": "4.2.3. Regarding you no longer use the products or services we provide and cancel the cool dog account, and we handle some or all of the products or services, we will deal with your personal information.Explain in detail for you.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56693, "text": "4.2.4., You understand and agree: When you delete the information from our products or services, we may not immediately delete the corresponding information from the backup system, but will delete these information when the backup is updated.", "label": ["Data Retention", "Important", "Risk"], "rewrite": "When you delete information from our products or services, we may not immediately delete the corresponding information from the backup system, but will delete these information when the backup is updated."}
{"task": "rw_55.jsonl", "id": 56694, "text": "4.2.5. Message settings:", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56695, "text": "(1), iPhone message settings require you to change the notification permissions at the device settings.", "label": ["Edit/Control", "Important"], "rewrite": "The iPhone message setting requires you to change the notification permissions on the device settings."}
{"task": "rw_55.jsonl", "id": 56696, "text": "(2) Chatting settings: If you don't want to chat with some people and receive chat information, you can use the Cool Dog Music APP [Side Ben]-[Settings]-[Message Settings]-[Who can send me private] SettingsWho can chat with you.", "label": ["Important", "Edit/Control"], "rewrite": "You can use the Cool Dog Music App [Side Barn]-[Settings]-[Message Settings]-[Who can send me in private] Who can chat with you."}
{"task": "rw_55.jsonl", "id": 56697, "text": "(3) Blacklist Settings: You can set it through the Cool Dog Music APP [Side Barn]-[Settings]-[Message Settings]-[User Blacklist/No more attention to the blacklist].", "label": ["Important", "Edit/Control"], "rewrite": "You can set it through the Cool Dog Music APP [Side Barn]-[Settings]-[Message Settings]-[User Blacklist/No longer paying attention to the blacklist]."}
{"task": "rw_55.jsonl", "id": 56698, "text": "If you will be removed on the blacklist, others can chat with you, follow you or apply for you to add friends.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56699, "text": "4.3. More correct or supplement personal information", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56700, "text": "4.3.1. When you find that your personal information is inaccurate or incomplete, you have the right to ask us to make corrections or supplements.", "label": ["Important", "Edit/Control"], "rewrite": "When you find that your personal information is inaccurate or incomplete, you have the right to ask us to make corrections or supplements."}
{"task": "rw_55.jsonl", "id": 56701, "text": "You can correct and add your personal information through the following path:", "label": ["Edit/Control", "Important"], "rewrite": "You can correct and add your personal information through the following path:"}
{"task": "rw_55.jsonl", "id": 56702, "text": "(1) After entering Cool Dog Music, you can correct or modify your avatar, nickname, gender, birthday, region, occupation, personality, personality signature, and hobbies.", "label": ["Important", "Edit/Control"], "rewrite": "You can correct or modify your avatar, nickname, gender, birthday, region, occupation, personality, personality signature, and hobbies in the upper right corner."}
{"task": "rw_55.jsonl", "id": 56703, "text": "(2), you can be on the homepage of the Cool Dog Music APP- [Laku]-[Performance] -When the upper right corner [My]-[Receive address Management] and [Movie Management], the address and the receiver or the receiver orMovie information.", "label": ["Edit/Control", "Important"], "rewrite": "You can on the homepage of the Cool Dog Music APP- [Laku]-[Performance]-[Mine in the upper right corner [My]-[Receive Address Management] and [Movie Management]Essence"}
{"task": "rw_55.jsonl", "id": 56704, "text": "(3), you can change the address and the consignee information in the upper right corner [My]-[Receive address management]-[My]-[Receive address management].", "label": ["Important", "Edit/Control"], "rewrite": "You can change the address and the consignee information in the upper right corner [Mine]-[Receive Address Management]-[Receive Address Management]-[Receiving address management]."}
{"task": "rw_55.jsonl", "id": 56705, "text": "4.3.2., You can also contact us through the following 8 contact information. After we verify your personal information, we will correct and supplement your personal information in a timely manner.", "label": ["Important", "Edit/Control"], "rewrite": "You can also contact us through Article 8 of the following contact information. After we verify your personal information, we will correct and supplement your personal information in time."}
{"task": "rw_55.jsonl", "id": 56706, "text": "4.4. Get personal information copy", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56707, "text": "If you need a copy of your personal information, you can use the side barn- [Privacy Center]-[Privacy Management]-[Personal Information Management]-[Personal Information Division] Fill in your mailbox address, we will take your avatarPersonal information such as nicknames is sorted into files and sent to your mailbox within 72 hours.", "label": ["Important", "Edit/Control"], "rewrite": "If you need a copy of your personal information, you can fill in your mailbox address through the sidebar of the side border- [Privacy Center]-[Personal Information Management]-[Personal Information Copy]."}
{"task": "rw_55.jsonl", "id": 56708, "text": "Under the premise of technical feasibility, those who meet the requirements of the national online information department can also transmit your personal information copy to your designated third party according to your requirements.", "label": ["Important", "Edit/Control"], "rewrite": "We can also transmit your personal information copy to the designated third parties specified in accordance with your requirements."}
{"task": "rw_55.jsonl", "id": 56709, "text": "4.5. Withdrawal consent", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56710, "text": "You can change or withdraw the scope of your personal information through the following ways:", "label": ["Important", "Edit/Control"], "rewrite": "You can change or withdraw the scope of your personal information through the following ways:"}
{"task": "rw_55.jsonl", "id": 56711, "text": "4.5.1., System permissions settings: We provide system permissions settings in the product.", "label": ["Important", "Edit/Control"], "rewrite": "We provide system permissions settings in the product."}
{"task": "rw_55.jsonl", "id": 56712, "text": "For example: In the Cool Dog Music APP [Side Barn]-[Privacy Center]-[Privacy Management]-[Permanent Settings] Manage the system permissions of our products (including cameras, microphones, address books, locations, telephone, storage storage, storage, storage, storageCalendar, etc.).", "label": ["Important", "Edit/Control"], "rewrite": "In the Cool Dog Music APP [Side Bulletin]-[Privacy Center]-[Privacy Management]-[Permanent Settings] Manage the system permission authorization of our product (including cameras, microphones, address books, location, telephone, storage calendar, etc.To."}
{"task": "rw_55.jsonl", "id": 56713, "text": "After withdrawal authorization, we will no longer collect information related to these permissions, but it will not affect our personal information processing based on your previous authorization.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "After withdrawal authorization, we will no longer collect information related to these permissions, but it will not affect personal information processing carried out based on authorization."}
{"task": "rw_55.jsonl", "id": 56714, "text": "You can read the \"Cool Dog Music Application Restrictions\" to understand the situation of cool dog music application and use system permissions.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56715, "text": "4.5.2. Recommended management: You can choose your favorite audio and video and other content and adjust your content preferences.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56716, "text": "For example: In the Cool Dog Music APP [Side Barn]-[Privacy Center]-[Privacy Management]-[Personalized Recommendation Management], set the settings to allow us to recommend audio and video and other content to you according to historical records.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56717, "text": "4.5.3. Advertising management: You can determine whether to receive personalized advertising.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56718, "text": "For example: Cool Dog Music APP [Side Barn]-[Privacy Center]-[Privacy Management]-[Advertising Management].", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56719, "text": "If you turn off and receive, the advertisement you see in our products may not decrease, but the correlation with you will be reduced.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56720, "text": "4.5.4. Other privacy settings:", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56721, "text": "(1) Recommend me to someone who may know: you have the right to choose not to be recommended to others.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56722, "text": "For example: In the Cool Dog Music APP [Side Barn]-[Privacy Center]-[Privacy Management]-[Other Settings], whether to allow friends to find me.", "label": ["Important", "Edit/Control"], "rewrite": "In the Cool Dog Music APP [Side Barn]-[Privacy Center]-[Privacy Management]-[Other Settings] whether to allow friends to find me."}
{"task": "rw_55.jsonl", "id": 56723, "text": "(2) Other privacy settings functions, which are specifically provided by the actual product.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56724, "text": "4.6. Complaint report", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56725, "text": "If you think your personal information rights may be infringed, or you can find a clue to infringe the right to personal information, you can contact us through the [sidebar backbar]-[customer service feedback]-[feedback of opinion] to enter the opinion feedback interface.", "label": ["Edit/Control", "Important"], "rewrite": "You can contact us through the [sidebar]-[customer service feedback]-[feedback] to enter the feedback interface."}
{"task": "rw_55.jsonl", "id": 56726, "text": "You can also contact us through the following contact information.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56727, "text": "4.7. Logging out the account", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56728, "text": "If you decide not to use our products and services, you can cancel it in [I]-click on the avatar-in the upper right corner [My account]-[Account and Binding Settings]-[Account Logging out].", "label": ["Edit/Control", "Important"], "rewrite": "You can cancel it in [I]-click the avatar-in the upper right corner [My account]-[account number and binding settings]-[account logout] to cancel."}
{"task": "rw_55.jsonl", "id": 56729, "text": "Before canceling your account, to protect your account security and ensure that the cancellation account behavior is your own operation, we will verify your personal identity, common equipment and other information.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56730, "text": "We specially remind you that your behavior of canceling your account is an irreversible behavior. Once you log out your account, we will delete or anonymous information about your account (but the laws and regulations have other regulations or the regulatory authorities have other requirements), exceptFor details, please refer to the \"Cool Dog User Account Logging out\".", "label": ["Data Retention", "Edit/Control", "Important"], "rewrite": "Once you log out your account, we will delete or anonymous information about your account (but the laws and regulations are otherwise stipulated or the regulatory authorities are required). For details, please refer to the \"Cool Dog User Account Logging up\"."}
{"task": "rw_55.jsonl", "id": 56731, "text": "4.8. Constraine information system automatic decision -making", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56732, "text": "In certain business functions, we may make decisions only based on the non -artificial automatic decision -making mechanism, including information systems, algorithms, etc.", "label": ["Usage"], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56733, "text": "If these decisions significantly affect your legitimate rights and interests, you can contact us through the contact information of Article 8 of this privacy policy, ask us to explain, and reject us to make decisions only through automated decision -making.", "label": ["Important", "Edit/Control"], "rewrite": "You can contact us through the contact information of Article 8 of this privacy policy, ask us to explain, and reject we make a decision only through automated decision -making."}
{"task": "rw_55.jsonl", "id": 56734, "text": "4.9. Protection of the personal information of the old users", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56735, "text": "If the user died unfortunately, its close relatives can exercise the rights specified in the relevant personal information of the relevant personal information for their own personal information for their own legal and legitimate interests.", "label": ["Edit/Control", "Specific Audiences", "Important"], "rewrite": "If the user died unfortunately, his close relatives can exercise the rights to check, copy, correct, delete the relevant personal information of the relevant users for their own legal and legitimate interests."}
{"task": "rw_55.jsonl", "id": 56736, "text": "Except for the old users' arrangements before their lifetime.", "label": ["Edit/Control", "Specific Audiences"], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56737, "text": "In some cases, we may need to verify the identity of close relatives before they can cooperate with relevant requests. At that time, we will inform and obtain the consent of close relatives in advance.", "label": ["Specific Audiences", "Important"], "rewrite": "In some cases, you need to verify the identity of the close relative before you can cooperate with the relevant requests. We will inform and obtain the consent of close relatives in advance."}
{"task": "rw_55.jsonl", "id": 56738, "text": "4.10. If we terminate the service or product operation, we will issue a notice to you at least 30 days in advance or other reasonable and effective ways, and delete or anonymous processing of your information after the termination of the service or operation (However, laws and regulations have other regulations or other requirements for regulatory authorities).", "label": ["Data Retention", "Important", "Cessation of Operations"], "rewrite": "The termination of services or product operations will notify you at least 30 days in advance, and deletes or anonymous processing of your information (but the laws and regulations are otherally stipulated or the regulatory authorities have other requirements)."}
{"task": "rw_55.jsonl", "id": 56739, "text": "4.11., Please understand and know, according to laws and regulations, in the following cases, we may not respond to your requests on query, correction/modification, deletion, withdrawal, cancellation, personal information copy, etc.:", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "In the following circumstances, we may not respond to your requests on query, correction/modification, deletion, withdrawal, cancellation, personal information copy, etc.:"}
{"task": "rw_55.jsonl", "id": 56740, "text": "(1), related to the obligations stipulated in our performance and regulations;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "What is related to our obligations stipulated in our laws and regulations, we will not respond to requests."}
{"task": "rw_55.jsonl", "id": 56741, "text": "(2), directly related to national security and national defense security;", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "Directly related to national security and national defense security will not respond to requests."}
{"task": "rw_55.jsonl", "id": 56742, "text": "(3), directly related to public safety, public health, and major public interests;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Those who are directly related to public safety, public health, and major public interests will not respond to requests."}
{"task": "rw_55.jsonl", "id": 56743, "text": "(4) Directly related to criminal investigation, prosecution, trial, and execution judgment;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Directly related to criminal investigation, prosecution, trial, and execution judgment will not respond to requests."}
{"task": "rw_55.jsonl", "id": 56744, "text": "(5), we have sufficient evidence that you have subjective malicious or abuse of rights;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "We have sufficient evidence that if you have subjective malice or abuse of rights, we will not respond to requests."}
{"task": "rw_55.jsonl", "id": 56745, "text": "(6) For major legitimate rights and interests such as maintaining your life and property of you or other individuals, but it is difficult to get your consent;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "It is difficult to maintain the major legitimate rights and interests but it is difficult to get my consent and will not respond to the request."}
{"task": "rw_55.jsonl", "id": 56746, "text": "(7) In response to your request, the legitimate rights and interests of you or other individuals and organizations are severely damaged;", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "Responding to your request will cause serious damage to the legitimate rights and interests of you or other individuals and organizations, and will not respond to the request."}
{"task": "rw_55.jsonl", "id": 56747, "text": "(8), involved business secrets;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Those involved in business secrets will not respond to requests."}
{"task": "rw_55.jsonl", "id": 56748, "text": "(9), other circumstances stipulated in laws and regulations.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Other circumstances stipulated in laws and regulations will not respond to requests."}
{"task": "rw_55.jsonl", "id": 56749, "text": "5. How do we store and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56750, "text": "5.1. Storage of personal information", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56751, "text": "5.1.1. Storage location", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56752, "text": "We comply with laws and regulations to store personal information that will be collected and generated in the operation of the People's Republic of China in the territory of the People's Republic of China.", "label": ["Data Retention", "Important"], "rewrite": "We will store and generate personal information that we will collect and generate in the operation of the People's Republic of China to store in China."}
{"task": "rw_55.jsonl", "id": 56753, "text": "At present, we do not have the scene of providing your personal information overseas.", "label": ["Data Retention", "Important"], "rewrite": "At present, we do not have the scene of providing your personal information overseas."}
{"task": "rw_55.jsonl", "id": 56754, "text": "If we need to provide personal information to the People's Republic of China due to business and other needs, we should have the conditions prescribed by the law (through the security assessment organized by the national network information department or in accordance with the standard contracts formulated by the national network information department,Establish a contract, agreed to the rights and obligations of both parties), and will inform you that the name or name, contact information, processing purpose, processing methods, personal information types, and the types of personal information areMethods and procedures and other matters to obtain your separate consent.", "label": ["Data Retention", "Important"], "rewrite": "If you provide personal information overseas, we should have the conditions prescribed by the law and inform you that the name or name, contact information, processing purpose, processing methods, personal information types, and your main parties to the overseas receiving partyThe way of rights and procedures to obtain your separate consent."}
{"task": "rw_55.jsonl", "id": 56755, "text": "We will take necessary measures to ensure the activities of handling personal information to handle personal information overseas to meet the personal information protection standards stipulated by Chinese law.", "label": ["Data Retention", "Important"], "rewrite": "We will take necessary measures to ensure the activities of handling personal information to handle personal information overseas to meet the personal information protection standards stipulated by Chinese law."}
{"task": "rw_55.jsonl", "id": 56756, "text": "5.1.2. Storage period", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56757, "text": "Generally speaking, we only store your personal information for your personal information processing purposes only, for example: when you use our account registration and login function, we need to collect your mobile phone number and inAfter you provide and during your function, we need to keep your mobile phone number for you to provide you with the function and ensure your account and system security normally.", "label": ["Data Retention", "Important"], "rewrite": "We only store your personal information for the shortest time for your personal information processing purpose."}
{"task": "rw_55.jsonl", "id": 56758, "text": "After you actively delete your personal information, cancel your account or exceed the necessary storage period, we will delete or processes your personal information, except for the lawThe saving time of service information and transaction information is not less than three years from the date of the transaction).", "label": ["Data Retention", "Important"], "rewrite": "After you actively delete your personal information, cancel your account, or go beyond the necessary storage period, we will delete or processes your personal information, except for the laws and regulations."}
{"task": "rw_55.jsonl", "id": 56759, "text": "We judge the necessary storage period for personal information mainly based on the following standards: (1) Maintain corresponding transactions and business records to cope with your possible query or complaints;", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56760, "text": "(2) Make sure we provide you with service safety and quality;", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56761, "text": "(3) Do you agree to a longer retention period.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56762, "text": "When our products or services stop operation, we will inform you in a suitable way (push notification, in -site letter, announcement, etc.), and delete or deal with your personal information in a reasonable period.Except for other regulations.", "label": ["Data Retention", "Important", "Cessation of Operations"], "rewrite": "When stopping operations, we will inform you in a suitable way (push notification, in -site letter, announcement, etc.), and delete or deal with your personal information within a reasonable period. ExceptEssence"}
{"task": "rw_55.jsonl", "id": 56763, "text": "5.2. Information security guarantee measures", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56764, "text": "5.2.1. In order to ensure your personal information security, we use various security protection measures within a reasonable security level to ensure your information and prevent data from being unauthorized, publicly disclosed, used, modified, damaged, or damaged orLost.", "label": ["Important", "Data Security"], "rewrite": "We use various security protection measures within a reasonable level to ensure your information and prevent data from being unauthorized, publicly disclosed, used, modified, damaged, or lost."}
{"task": "rw_55.jsonl", "id": 56765, "text": "For example, we use encryption technology (such as SSL), anonymous processing and other means to protect your personal information.", "label": ["Important", "Data Security"], "rewrite": "We use encrypted technology (such as SSL), anonymous processing and other means to protect your personal information."}
{"task": "rw_55.jsonl", "id": 56766, "text": "In addition, we will continue to strengthen the security capabilities of software installed on your device.", "label": ["Important", "Data Security"], "rewrite": "We will continue to strengthen the security capabilities of software installed on your device."}
{"task": "rw_55.jsonl", "id": 56767, "text": "For example, we will complete some information encryption work locally to consolidate security transmission;", "label": ["Important", "Data Security"], "rewrite": "We will complete some information encryption work locally to consolidate security transmission."}
{"task": "rw_55.jsonl", "id": 56768, "text": "We will understand the application information and running process information installed by your device to prevent malicious programs such as viruses and Trojans.", "label": ["Important", "Data Security"], "rewrite": "We will understand the application information and running process information installed by your device to prevent malicious programs such as viruses and Trojans."}
{"task": "rw_55.jsonl", "id": 56769, "text": "5.2.2., We establish a special management system, approval process and organization to ensure information security.", "label": ["Important", "Data Security"], "rewrite": "We will understand the application information and running process information installed by your device to prevent malicious programs such as viruses and Trojans."}
{"task": "rw_55.jsonl", "id": 56770, "text": "For example, we strictly restrict the scope of the personnel of access information, ask them to obey the confidentiality obligations and conduct review.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56771, "text": "5.2.3., We encourage our staff to learn information security knowledge, improve the awareness of personal information security protection, and conduct information security training on regular or irregularities.", "label": ["Important", "Data Security"], "rewrite": "We encourage staff to learn information security knowledge, raise awareness of personal information security protection, and conduct information security training for our staff."}
{"task": "rw_55.jsonl", "id": 56772, "text": "The disposal measures to be taken, the suggestions you can prevent and reduce risks, and remedy your remedy.", "label": ["Important", "Data Security"], "rewrite": "If there is a security incident such as personal information leakage, in accordance with the requirements of laws and regulations, we will start emergency plans to prevent the expansion of security events, and inform you in time: basic situations and possible impacts, disposal measures, suggestions, remedial measures, etc."}
{"task": "rw_55.jsonl", "id": 56773, "text": "We will inform you that the incident -related situation is in a manifestation of emails, letters, telephones, push notifications, etc. When it is difficult to inform users one by one, we will publish announcements in a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "We will inform you of the incident -related situation in time. When it is difficult to inform users one by one, we will publish an announcement in a reasonable and effective way."}
{"task": "rw_55.jsonl", "id": 56774, "text": "At the same time, we will also actively report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "We will also take the initiative to report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities."}
{"task": "rw_55.jsonl", "id": 56775, "text": "5.2.5., The Internet environment is not 100 % security. When the following is the result of the leakage and damage caused by our information caused by our fault, we do not need to bear any responsibility:", "label": ["Important", "Risk"], "rewrite": "When the following is a disclosure of our information due to our fault, we do not need to bear any responsibility:"}
{"task": "rw_55.jsonl", "id": 56776, "text": "(1) Any personal data leakage, loss, stolen or tampered with personal data leakage, loss, stolen, or tampering caused by hacker attacks, computer virus invasion or seizures, temporary shutdown caused by government control.", "label": ["Important", "Risk"], "rewrite": "Personal data leakage, loss, stolen or tampering of personal data caused by the influence of the network of normal operations without being responsible."}
{"task": "rw_55.jsonl", "id": 56777, "text": "(2) In the process of using Cool Dog services, link to other websites or any legal disputes and consequences caused by personal data leakage caused by receiving services from third parties.", "label": ["Important", "Risk"], "rewrite": "In the process of using Cool Dog Services to connect to other websites or leaks from personal data caused by receiving services from third parties, no responsibility is required."}
{"task": "rw_55.jsonl", "id": 56778, "text": "(3) If you actively disclose, upload, publish or provide your personal information in the process of using cool dog services (such as comments, comments, etc.), other users may collect your personal information.", "label": ["Important", "Risk"], "rewrite": "If you actively disclose, upload, publish or provide your personal information to third parties in the process of using cool dog services, other users may collect your personal information, and there is no need to bear responsibility in this situation."}
{"task": "rw_55.jsonl", "id": 56779, "text": "(4) The content, sound, name, age, and age information published by other users include the portrait, sound, name, age and other material information.", "label": ["Important", "Risk"], "rewrite": "If other users publish the contents, sounds, names, names, age and other materials such as you or your minor guardian (children), you do not need to bear responsibility."}
{"task": "rw_55.jsonl", "id": 56780, "text": "If you don't agree with us to show the aforementioned content in cool dog products and services, please contact us through the following 8 contact information.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56781, "text": "6. How do we protect personal information of minors", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56782, "text": "6.1. If you are a minor under the age of 18, you should obtain the consent of your parents or guardians before registering and using cool dog products or services, and use cool dog services under the guidance of parents or guardians.", "label": ["Specific Audiences", "Important"], "rewrite": "Minors should obtain the consent of parents or guardians before registering and using cool dog products or services, and use cool dog services under the guidance of parents or guardians."}
{"task": "rw_55.jsonl", "id": 56783, "text": "6.2., If you are a child under the age of 14, please notify your parents or guardians to accompany the privacy policy and \"Cool Dog Child Privacy Policy\", and register, log in, use cool dog products or services, and submit individualsThey obtained their consent and guidance before the information.", "label": ["Specific Audiences", "Important"], "rewrite": "Children under the age of 14, please inform your guardian to accompany the privacy policy and \"Cool Dog Child Privacy Policy\", and register, log in, use cool dog products or services, and submit personal information to obtain their consent and obtain their consent and.guide."}
{"task": "rw_55.jsonl", "id": 56784, "text": "7. How to update this privacy policy", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56785, "text": "7.1. As our service scope expands, we will update the terms of this privacy policy in a timely manner, and update the content to form a part of the privacy policy.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56786, "text": "If the updated privacy policy causes your rights to change substantially, we will notify you through a significant position prompt or by prompting message, red dot prompts, etc. before the update. Later privacy policy constraints.", "label": ["Policy Change", "Important"], "rewrite": "If the updated privacy policy has caused the right to change the rights, we will notify you before the update, if you continue to use our services, you will agree to be constrained by the updated privacy policy."}
{"task": "rw_55.jsonl", "id": 56787, "text": "To prevent you from knowing the update in time, please read this privacy policy frequently.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56788, "text": "You can check the updated \"Cool Dog Music Privacy Policy\" in the [Privacy Policy]-[Privacy Policy] or \"Point Barn]-\" Privacy Center \".", "label": ["Policy Change", "Important"], "rewrite": "You can check the updated \"Cool Dog Music Privacy Policy\" in the [Privacy Policy]-[Privacy Policy] or \"Point Barn]-\" Privacy Center \"."}
{"task": "rw_55.jsonl", "id": 56789, "text": "7.2., The updated \"Cool Dog Music Privacy Policy\" will take the update date as the effective date and replace the previous \"Cool Dog Music Privacy Policy\".", "label": ["Policy Change", "Important"], "rewrite": "The updated \"Cool Dog Music Privacy Policy\" will take the update date as the effective date and replace the previous \"Cool Dog Music Privacy Policy\"."}
{"task": "rw_55.jsonl", "id": 56790, "text": "8. How to contact us", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56791, "text": "If you have problems, opinions, suggestions, or complaints related to user information security related to this privacy policy, you can compiled 1-18 by written letter (Address: No. 315 No. 315, Huangpu Avenue, Tianhe District, Guangzhou, Guangzhou, and the Ministry of Justice receivedTel: 020-37529000, postcode: 510660) or email method (mailbox: leml@kugou.net) to contact us, we will reply within 15 days after receiving the letter or email.", "label": ["Important", "Contact Information"], "rewrite": "You can use written letters (Address: No. 315 No. 315, Huangpu Avenue, Tianhe District, Guangzhou: 020-37529000 Postcode: 510660) or Email method (email: leggal@kugou.net) and usContact."}
{"task": "rw_55.jsonl", "id": 56792, "text": "9. Others", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56793, "text": "This privacy policy is an important part of the \"Cool Dog User Service Agreement\" and related agreements. The term definition of the noun in this privacy policy refers to the \"Cool Dog User Service Agreement\", which is suitable for related services for Cool Dog.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56794, "text": "Guangzhou Cool Dog Computer Technology Co., Ltd.", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56795, "text": "Guangzhou Cool Dog Computer Technology Co., Ltd. Copyright", "label": [], "rewrite": []}
{"task": "rw_55.jsonl", "id": 56796, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
