{"task": "rw_51.jsonl", "id": 54874, "text": "58 Privacy Policy in the same city (June 2022)", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54875, "text": "58 Privacy Policy in the same city (detailed version)", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54876, "text": "Version update date: June 9, 2022", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54877, "text": "Version Effective Date: June 20, 2022", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54878, "text": "Download protocol", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54879, "text": "introduction", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54880, "text": "\"58 Privacy Policy in the City\" will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54881, "text": "1. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54882, "text": "2. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54883, "text": "3. How can we share, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54884, "text": "4. How do we protect your personal information", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54885, "text": "5. Your rights", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54886, "text": "6. How do we deal with the personal information of minors", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54887, "text": "7. How to update this privacy policy", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54888, "text": "8. How to contact us", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54889, "text": "58 City (hereinafter referred to as \"we\") knows the importance of personal information to you. We respect and protect the personal information of all users who use the 58 city platforms, and will do our best to protect your personal information security and reliable.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54890, "text": "At the same time, we promise that we will take corresponding security protection measures to protect your personal information in accordance with the mature safety standards of the industry.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54891, "text": "Before using our products (or services), please carefully read and learn about this \"58 City Privacy Policy\" (hereinafter referred to as \"this privacy policy\").", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54892, "text": "If you have any questions about this privacy policy or your personal information is invaded when you use the service you provide, you can send email to the person in charge of personal information protection.The full -time department of information protection will give you a reply as soon as possible;", "label": ["Important", "Contact Information"], "rewrite": "You can send mail to the person in charge of personal information protection."}
{"task": "rw_51.jsonl", "id": 54893, "text": "You can also contact us through the illegal information reporting method (jubao@58ganji.com) under the homepage of the 58 -city website (www.58.com). See Article 10 of this Privacy Policy).", "label": ["Important", "Contact Information"], "rewrite": "You can get in touch with us through the illegal information reporting method (jubao@58ganji.com) below the homepage of the 58 -city website (www.58.com)."}
{"task": "rw_51.jsonl", "id": 54894, "text": "[Special Tips] Please read our \"58 City Privacy Policy\" (especially the content of the thickened line) and determine our understanding of our personal information.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54895, "text": "During the reading process, if you have any questions, you can contact us in time (the contact information is subject to the privacy policy).", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54896, "text": "You agree that this privacy policy only means that you have understood the functions provided by the application, and the necessary personal information needed for functional operation. It does not mean that you have agreed that we can collect non -necessary personal information. Unnecessary personal information will be based on your use process.The authorization situation solicits your consent alone.", "label": ["Important", "First Party Collection Information"], "rewrite": "Non -necessary personal information will solicit your consent separately according to the authorization of your use."}
{"task": "rw_51.jsonl", "id": 54897, "text": "If you refuse to have a privacy policy, 58 City will not be able to provide you with complete service functions, but you can still use 58 city to browse basic information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Rejecting the privacy policy, 58 City will not be able to provide complete service functions, but you can still browse basic information."}
{"task": "rw_51.jsonl", "id": 54898, "text": "Table of contents:", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54899, "text": "1. The general principle of our personal information", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54900, "text": "2. Definition and the scope of the applicable scope of this privacy policy", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54901, "text": "3. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54902, "text": "4. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54903, "text": "Fifth, how can we share, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54904, "text": "6. How do we store and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54905, "text": "7. The right to manage personal information", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54906, "text": "8. How do we deal with the personal information of minors", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54907, "text": "Nine, the update and notice of this privacy policy", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54908, "text": "Ten, how to contact us", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54909, "text": "11. Dispute resolution", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54910, "text": "1. The general principle of our personal information", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54911, "text": "Generally, we will collect your personal information based on the function of this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54912, "text": "In some cases, if we involve other information, we will show you the clauses of personal information protection.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54913, "text": "The principles of subject participation and the principle of openness and transparency.", "label": ["Important", "Data Security"], "rewrite": "Adhere to the following principles: the principles of consistent and responsibilities, the principles of clear purpose, the principles of selection and consent, the minimum principles, the principles of safety, the principles of subject participation, and the principle of openness and transparency."}
{"task": "rw_51.jsonl", "id": 54914, "text": "2. Definition and the scope of the applicable scope of this privacy policy", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54915, "text": "1. The city of the same city: refers to the 58 city website www.58.com, the 58th city client (APP, M side) and 58 city applet/public account.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54916, "text": "2. 58 Same City Service Provider: Refers to the Internet information and software technology service providers of 58 Tongcheng Beijing 58 Information Technology Co., Ltd., Beijing Urban Net Neighborhood Information Technology Co., Ltd., Beijing Urban Net Neighborhood Information Technology Co., Ltd. Tianjin Branch.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54917, "text": "3. Personal information: Refers to the various information that can be recorded alone or with other information to identify a specific natural person or reflect the activity of specific natural persons alone or with other information.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54918, "text": "4. Personal sensitive information: Refers to personal information such as ID number, personal biometric information, bank account number, property information, trading information, transaction information, under 14 years of age (inclusive) children's information (we will in this policy to specific individuals Sensitive information is identified by the thick body).", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54919, "text": "5. Deletion of personal information: Refers to the state of removing personal information in a system involved in daily business functions to maintain unspeakable and accessing states.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54920, "text": "6. Children: Refers to minors under the age of 14.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54921, "text": "7. Scope of application of this privacy policy: It is suitable for the various products and services provided by you with new forms that are provided by 58 service providers of 58 city, clients, applets, and new forms that appear with technology development.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54922, "text": "If we use the products or services of the same city in the affiliated company's products or services but have not set up independent privacy policies, this policy is also applicable to this part of the product or service.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54923, "text": "If the affiliated company has a privacy policy for the products or services it provides you, the corresponding privacy policy is applicable to the corresponding products or services.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54924, "text": "Except for the relevant information collection and use activities described in this policy, this policy is not applicable to other services you provided in other third directions. Other services apply to collect and use the personal information collection and use of personal information to you.", "label": ["Important", "First Party Collection Information"], "rewrite": "This policy is not applicable to other third parties, and other services are applicable to the personal information collection and use rules that they explain to you."}
{"task": "rw_51.jsonl", "id": 54925, "text": "3. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54926, "text": "The personal information involved in this privacy policy or personal sensitive information contains the content of the personal information security.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54927, "text": "We will discuss in detail the types and purpose of collecting and using your personal information based on the following functions in this article (1) and (2).", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54928, "text": "In order to ensure the normal implementation of the relevant business functions, we need to call the corresponding permissions according to the specific use scenario, and ask you to ask you before calling.Essence", "label": ["Permission Acquisition", "Important"], "rewrite": "You need to call the corresponding permissions according to the specific usage scenario, and ask you to ask you before calling."}
{"task": "rw_51.jsonl", "id": 54929, "text": "The corresponding equipment permissions will not be turned on by default. When important or sensitive equipment permissions are involved, we will open another pop -up window when you use the corresponding business functions.", "label": ["Permission Acquisition", "Important"], "rewrite": "The corresponding equipment permissions will not be turned on by default. Important or sensitive equipment permissions will be popped up separately and will be opened again."}
{"task": "rw_51.jsonl", "id": 54930, "text": "After the authority is turned on, you can also set off the permissions at any time through the device;", "label": ["Important", "Edit/Control"], "rewrite": "After the authority is turned on, you can turn off the permissions at any time."}
{"task": "rw_51.jsonl", "id": 54931, "text": "If you do not agree to open permissions, it will not affect the normal use of other non -related business functions.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54932, "text": "In response to personal sensitive information, we will get your consent separately.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will get personal sensitive information after your consent."}
{"task": "rw_51.jsonl", "id": 54933, "text": "For the details of our personal information list, you can view: \"Personal Information List\" (specifically viewing path: 58 City APP-Mine)).", "label": ["Important", "First Party Collection Information", "Edit/Control"], "rewrite": "You can view: \"List of Personal Information\" (Specific View Path: 58 The City APP-Mine)."}
{"task": "rw_51.jsonl", "id": 54934, "text": "Communication and communication contact information, communication records and content, account password, property information, credit information, travel trajectory, accommodation information, health physiological information, transaction information, etc.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54935, "text": "Personal sensitive information refers to personal information that once leaked, illegally provided or abuses the security of people and property, and it is easy to lead to personal information such as personal reputation, physical and mental health damage or discrimination.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54936, "text": "The personal sensitive information involved in this privacy policy will be thicker and adding lines to remind you to pay attention to reading.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54937, "text": "Before you provide any personal information of sensitive information to 58, please clearly consider that this provision is appropriate and agree that your personal sensitive information can be processed in accordance with the goals and methods described in this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54938, "text": "We will collect and use your sensitive information after getting your consent to achieve functions related to the same city business, and allow you to make the collection and use of these sensitive information that disagree with the useYou use related functions.", "label": ["Important", "First Party Collection Information"], "rewrite": "After obtaining consent, it will collect and use sensitive information to achieve related functions. Refusing to use this information will affect your related functions."}
{"task": "rw_51.jsonl", "id": 54939, "text": "When you use our products/services, your personal information we need/may need to be collected and use includes the following: to realize the basic functions of providing you with our products and/or services, you must authorize us to collect and use itThe necessary information.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54940, "text": "If you refuse to provide the corresponding information, you will not be able to use our products and/or services normally;", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54941, "text": "In order to provide you with additional functions to our products and/or services, you can choose to authorize the information we collect and use.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54942, "text": "If you refuse to provide it, you will not be able to use related additional functions normally or to achieve the functional effects we intend to achieve, but it will not affect your basic functions that use our products and/or services.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54943, "text": "According to the \"Regulations on the Scope of Personal Information for Common Type Mobile Internet Applications\", in principle, 58 City APPs belong to \"local life\", and basic functional services are \"daily life services such as housekeeping maintenance, home decoration, etc.\". The necessary personal information is: registered usersMobile phone number.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54944, "text": "At the same time, the 58 city is also a comprehensive information release platform, and there are many scenarios involved. If we have exceeded the following goals, we will prompt you separately and obtain your consent.", "label": ["Important", "First Party Collection Information"], "rewrite": "When the following goals are collected and using personal information, we will remind you alone and obtain consent."}
{"task": "rw_51.jsonl", "id": 54945, "text": "58 The types of personal information collected in the same city are divided into [essential information] and [non -essential information];", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54946, "text": "[Essential information] It is the personal information necessary for 58 to maintain functional items in the same city;", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54947, "text": "[Non -essential information] Personal information that is collected by 58 in the same city for reasons for improving user experience and enhancing service effects.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54948, "text": "(1) Help you become our registration \\ login user", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54949, "text": "1. User registration", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54950, "text": "(1) Necessary information, non -essential information", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54951, "text": "When you use the services provided by 58 in the same city, you first need to become our registration \\ login user.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54952, "text": "Therefore, when you register the 58 -city account, you need to provide us with the username (only PC side) you are preparing to use, your mobile phone number or mailbox (only involved some mailbox registration scenarios), we will send a SMS verification code by sending a SMS verification codeMethod to verify whether your identity is effective.", "label": ["Important", "First Party Collection Information"], "rewrite": "You need to provide the username (only the PC side), your mobile phone number or mailbox for registered accounts."}
{"task": "rw_51.jsonl", "id": 54953, "text": "This kind of information is a necessary information about this function. If you do not provide it, you will not be able to complete the registration.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54954, "text": "You can continue to improve your account information after logging in. You can modify your nickname, birthday (date of birth), location, hometown, community, occupation, position, hobbies, avatars;", "label": ["Important", "First Party Collection Information"], "rewrite": "You can modify the nickname, birthday (date of birth), location, hometown, community, occupation, position, hobbies, avatars."}
{"task": "rw_51.jsonl", "id": 54955, "text": "You can upload photos according to your needs when you use dating services.", "label": ["Important", "First Party Collection Information"], "rewrite": "When using dating services, you can upload photos according to your needs."}
{"task": "rw_51.jsonl", "id": 54956, "text": "The account information you supplement will help us provide you with personalized service recommendations and better service experiences, including: improving the security of the account, so that you can enjoy better guarantee services;", "label": ["Important", "Usage"], "rewrite": "Supplementary account information will help provide personalized service recommendations."}
{"task": "rw_51.jsonl", "id": 54957, "text": "Increase the credit of the account to verify the true identity;", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54958, "text": "You can open VIP members and enjoy exclusive services.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54959, "text": "This kind of information is a non -necessary information about this function. If you do not provide these supplementary information, it will not affect your basic functions of the same city.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54960, "text": "(2) The sensitive permissions of retrieved", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54961, "text": "When you upload your avatar, you need to call the camera/album permissions of your device to obtain the avatar information you uploaded.", "label": ["Permission Acquisition", "Important"], "rewrite": "When uploading the avatar, you need to call the camera/album permissions. If you refuse to call, you will not be able to use this function."}
{"task": "rw_51.jsonl", "id": 54962, "text": "(3) The third -party SDK used", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54963, "text": "We will access third -party SDKs, including mobile one -click login SDK, telecommunications one -click login SDK, Unicom one -click login SDK (Android, iOS side) to realize the function of one -click to the same city for you, will collect you from it will be collected by youIP addresses, SIM, card IMSI, and mobile phone numbers. Such information is a necessary information about this function. If you refuse to provide, you will not be able to implement the function of one -click login.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will access the third -party SDK to realize the function of one -click on the 58 city in the same city, and collect your IP address, SIM card IMSI, and mobile phone number."}
{"task": "rw_51.jsonl", "id": 54964, "text": "2. You log in to users who log in to the same city through third -party authorization", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54965, "text": "(1) Necessary information, non -essential information", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54966, "text": "When you log in to the same city with a third -party account (WeChat, Weibo, QQ), you can choose to authorize 58 to read and obtain your public registration, announcement, and record on the third -party platform on the premise of meeting the requirements of relevant laws and regulations.Information (including nicknames, avatars).", "label": ["Important", "First Party Collection Information"], "rewrite": "When logging in with a third -party account, you can choose to authorize 58 to read and obtain public information (including nicknames and avatars) on the third -party platform."}
{"task": "rw_51.jsonl", "id": 54967, "text": "Also, please note that in the case of the first time you use a third -party account to log in to 58 City (including the first login after unbinding the third -party account), in order to ensure the requirements of the law and regulations, we will still ask you to protect your account security. We will still ask you to ask youProvide mobile phone numbers to verify your true identity.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use a third -party account to log in to the same city for the first time, you will ask you to provide a mobile phone number to verify the true identity."}
{"task": "rw_51.jsonl", "id": 54968, "text": "At the same time, we will bind the third -party account and the 58 -city account based on the mobile phone number you provide.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will realize the binding of a third -party account and a 58 -city account based on the mobile phone number."}
{"task": "rw_51.jsonl", "id": 54969, "text": "You can always use \"Settings\"-> \"\" \"account and security\"-> \"Binding of third-party accounts\" bind or unbind your associated third-party account, your unbloc will not affect your basic function of using 58 city in the same cityEssence", "label": ["Important", "Edit/Control"], "rewrite": "Through \"Settings\"-> \"Account and Security\"-> \"Third-party account binding\" binding \"binding or unbinding third-party account, the unbinding will not affect the basic function of use."}
{"task": "rw_51.jsonl", "id": 54970, "text": "This kind of information is a necessary information about this function. If you do not provide it, you will not be able to complete the registration.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54971, "text": "58 The city needs to authorize the above information from a third party to remember your login status as a 58 -city user to provide you with better products and/or services.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54972, "text": "We will only collect and use your personal information within the scope of your authorization consent.", "label": ["Important", "First Party Collection Information"], "rewrite": "It will only collect and use personal information within the scope of your authorization consent."}
{"task": "rw_51.jsonl", "id": 54973, "text": "The above information you provide will continue to authorize us to use it during your use of 58 city services.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54974, "text": "When you cancel your account, we will stop using and delete the above information.", "label": ["Data Retention", "Important"], "rewrite": "When canceling the account, we will stop using and delete the above information."}
{"task": "rw_51.jsonl", "id": 54975, "text": "The above information will be stored in the People's Republic of China.", "label": ["Data Retention", "Important"], "rewrite": "Personal information will be stored in the People's Republic of China."}
{"task": "rw_51.jsonl", "id": 54976, "text": "If we need cross -border transmission, we will obtain your authorization consent alone.", "label": ["Data Retention", "Important"], "rewrite": "Cross -border transmission will obtain your authorization consent alone."}
{"task": "rw_51.jsonl", "id": 54977, "text": "(2) The third -party SDK used", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54978, "text": "We will access third -party SDKs (including WeChat SDK, QQ sharing, Weibo sharing SDK) to realize the function of third -party authorization login 58 in the same city. It will collect your device logo information. Such information is a necessary information for this function.If you refuse to provide it, you will not be able to achieve the function of third -party authorization login.", "label": ["Important", "First Party Collection Information"], "rewrite": "Access to a third -party SDK to realize the function of third -party authorization login in the same city. It will collect the equipment logo information. If it refuses to provide it, the function of third -party authorization will not be achieved."}
{"task": "rw_51.jsonl", "id": 54979, "text": "(2) Provide you with our products or services", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54980, "text": "1. Information release function", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54981, "text": "(1) Necessary information, non -essential information", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54982, "text": "The main function of the 58 City platform is the information release function. You can choose the type of information (recruitment, yellow pages, real estate, used cars, second -hand items) according to your needs.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54983, "text": "When you use the release function, we will collect your personal information (different information categories, different information collected), including names, mobile phone numbers, contact information, personal information, geographical location, user album, mailbox, address information, and address information.Among them, the mobile phone number is necessary information, and other information is non -essential information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When using the release function, we will collect your personal information, the mobile phone number is the necessary information."}
{"task": "rw_51.jsonl", "id": 54984, "text": "The information that non -essential information is filled in for yourself is collected to facilitate that you can successfully publish the information, and you can match the content you posted faster: 1) When you publish recruitment information, in addition to submitting information about your plan to recruit positionYou also need to submit your contact information and mailbox so that job seekers can contact you;", "label": ["Usage"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54985, "text": "You can also publish resume information through the 58 -city platform to find a job. For details, please refer to the 8th paragraph of this article for details.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54986, "text": "2) When you publish the yellow page (that is, the life service) information, you need to provide your contact information and address information so that the merchant can accurately provide you with services.", "label": ["Important", "First Party Collection Information"], "rewrite": "When publishing the yellow pages (that is, life service), contact information and address information must be provided."}
{"task": "rw_51.jsonl", "id": 54987, "text": "3) When you publish housing information, you may need to provide your contact information (convenient for buyers to contact you in a timely manner), house information (mainly used to compare the real estate information information or be used as a comparison basis for housebook authentication information)), Price Information, Listing Lights Law Documents, Real -name Certification Information (referring to name, ID number, mobile phone number, mainly real -name authentication, as a basis for the comparison of housekeeping information)With your album, we use your album, collect the above information only for you to show your promotion information clearer and quickly.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your contact information, housing information, price information, housing right qualification certification documents, real -name authentication information to show your promotion information."}
{"task": "rw_51.jsonl", "id": 54988, "text": "4) When publishing second -hand car information, you need to submit your contact information, basic vehicle information, car viewing location, license information (such as scene needs).", "label": ["Important", "First Party Collection Information"], "rewrite": "When publishing second -hand car information, you need to submit contact information, basic vehicle information, vehicle location, license information (such as scene needs)."}
{"task": "rw_51.jsonl", "id": 54989, "text": "5) When publishing second -hand items, you need to submit the basic information, contact information, and location information of your second -hand items.", "label": ["Important", "First Party Collection Information"], "rewrite": "When publishing second -hand items, you need to submit basic information, contact information, and location information of second -hand items."}
{"task": "rw_51.jsonl", "id": 54990, "text": "6) In order to better promote your information or increase the exposure of your publishing information, you have authorized 58 City to display your nicknames and avatars in the same city in the same city in the same city.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The nicknames and avatars will be displayed on a third -party platform for promotion information."}
{"task": "rw_51.jsonl", "id": 54991, "text": "7) When you publish information on the dating channel, you need to collect your geographical location;", "label": ["Important", "First Party Collection Information"], "rewrite": "When publishing information on the Dating Channel, you need to collect geographical location."}
{"task": "rw_51.jsonl", "id": 54992, "text": "If you choose to upload pictures, video functions to publish pictures and video information, we will use your album (picture library) and videos, collect the above information only for you to show your information more clearly and quickly.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect albums (picture libraries) and videos for clear and fast display information."}
{"task": "rw_51.jsonl", "id": 54993, "text": "8) You browse the dynamic information of other users in the dating circle in the use of dating channels;", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54994, "text": "During the browsing process, you can also follow other users you are interested in or chat with other users you are interested in.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54995, "text": "In this regard, we will collect your log information and browsing records.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect your log information and browsing records."}
{"task": "rw_51.jsonl", "id": 54996, "text": "When you talk with other users, we will collect your distance sensor information in order to turn off the screen when you close your mobile phone near your ears.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your distance sensor information to prevent misunderstanding."}
{"task": "rw_51.jsonl", "id": 54997, "text": "9) To maximize the effectiveness of the promotion, you authorize to agree to the 58 -city platform on the same city platform \"Township\"/\"County\" section. All information content uploaded and published in the 58 local APP.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "You need to authorize the 58 -city platform to simultaneously display the information content you uploaded in the local APP."}
{"task": "rw_51.jsonl", "id": 54998, "text": "(2) The sensitive permissions of retrieved", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 54999, "text": "Position permissions, the main purpose is to facilitate users to determine the location of the house through the current positioning, save operating costs;", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55000, "text": "Microphone permission, the main purpose is to facilitate the fast input information published by users who do not operate the mobile phone input method;", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55001, "text": "Camera permissions, the main purpose is to take pictures of listings for information display.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55002, "text": "2. Information display service function", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55003, "text": "(1) Necessary information, non -essential information", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55004, "text": "In order to provide you with peripheral services and information display and improve our service performance, efficiency, and functions, after you authorize, we will collect the relevant information you generate in the process of using our service, including:", "label": ["Important", "First Party Collection Information"], "rewrite": "After authorization, we will collect relevant information generated during the use of services."}
{"task": "rw_51.jsonl", "id": 55005, "text": "1) Location information.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55006, "text": "When you authorize the positioning function of the mobile device and use the service -based services based on the system, we will collect and use your location information to recommend the surrounding life service (you do not need to enter the geographical location where you are inServices, estimate the actual distance between the merchant and you is convenient for you to make decisions, recommend the nearby service category and related information for you). In this functional scenario, location information is the necessary information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect and use location information for recommending the surrounding life services."}
{"task": "rw_51.jsonl", "id": 55007, "text": "We will use relevant technology to obtain your location information (accuracy will be different). These technologies include, IP, addresses, GPS, and WLAN (such as Wi-Fi) that can provide relevant information, access points, Bluetooth and base stationsEssence", "label": ["Important", "First Party Collection Information"], "rewrite": "We will use related technology to obtain your location information."}
{"task": "rw_51.jsonl", "id": 55008, "text": "You may contain corresponding geographical information in the information provided in the service, such as the area information you set in the account information or the geographical labeling information in the picture, the picture in the video.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55009, "text": "You can turn off the positioning service in the mobile device system to stop our collection of information on your location, but it may not be able to use the services we provide for you based on geographical location, or to achieve the expected effect of related services.", "label": ["Important", "Edit/Control"], "rewrite": "You can turn off the positioning service in the system of the mobile device and stop collecting information on the location of the location."}
{"task": "rw_51.jsonl", "id": 55010, "text": "2) Sensor information.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55011, "text": "When you use the VR -viewing function, we will collect your acceleration sensor, magnetic field sensor, direction sensor, gyroscope sensor, linear acceleration sensor, gravity sensor, rotating vector sensor, and an appropriate amount of sensor for the game to obtain direction information andAngle information, which is used to adjust the VR picture angle in real time for you to view the full room layout.", "label": ["Important", "First Party Collection Information"], "rewrite": "When using a VR room viewing function, you will collect information about your acceleration sensor, magnetic field sensor, direction sensor, gyroscope sensor, linear acceleration sensor, gravity sensor, rotating vector sensor, game rotating appropriate amount of sensor and other information."}
{"task": "rw_51.jsonl", "id": 55012, "text": "(2) The third -party SDK used", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55013, "text": "We will access the Baidu Map (Android, iOS end) SDK for displaying maps, positioning, and path planning functions., Equipment configuration, application information (application name));", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55014, "text": "Position information is allowed during the use period only (location information may include GNSS information, WIFI address and signal strength information, base station ID data information, operator information, sensor information, device signal strength information, IP address and Bluetooth information);", "label": ["Important", "First Party Collection Information"], "rewrite": "Access location information can be allowed to obtain location during use."}
{"task": "rw_51.jsonl", "id": 55015, "text": "Always allow access location information (location information may include GNSS information, WIFI address and signal strength information, base station ID data information, operator information, sensor information, device signal strength information, IP address and Bluetooth information);", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55016, "text": "Visit wifi status (including WIFI status, WIFI parameters, and WIFI lists)", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55017, "text": "3. Search function", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55018, "text": "When using the search function provided by 58 in the same city, we will collect the keyword information you query and other information and content details you browsed or required when you use 58 city services.", "label": ["Important", "First Party Collection Information"], "rewrite": "Will collect the keyword information you query and other information you browsed or required when you use your service."}
{"task": "rw_51.jsonl", "id": 55019, "text": "In order to bring you more convenient search service, it continues to improve the products and/or services of 58 city and services.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55020, "text": "These keyword information usually cannot identify your personal identity alone, not your personal information, and not within the scope of the restrictions of the privacy policy.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55021, "text": "Only when your search keyword information is connected with other information and can recognize your personal identity, during the combination of use, we will use your search keyword information as your personal information, and your search history with your search historyThe records are handled and protected in accordance with this privacy policy.", "label": ["Important", "Data Security"], "rewrite": "During the use of keyword information, search keyword information will be used as personal information, and the privacy policy will be processed and protected in accordance with this privacy policy."}
{"task": "rw_51.jsonl", "id": 55022, "text": "4. Identity authentication/identity verification service", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55023, "text": "(1) Necessary information, non -essential information", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55024, "text": "58 Tongcheng provides identity authentication/identity verification services. After reviewing the authenticity of your personal information, you will mark your certification logo.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55025, "text": "Therefore, when you apply for your identity authentication for you 58, we need to collect your name, ID number, bank card number, and mobile phone number to prove your personal identity related information. The specific verification method is \"personal information\" -\"My Certification\" shows that you can choose the authentication method as needed.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect name, ID number, bank card number, and mobile phone number for identity authentication."}
{"task": "rw_51.jsonl", "id": 55026, "text": "We may also need to collect your biometric information (face authentication), for real -name authentication or for account security, that is, when your account is in an abnormal state, we will pass the face verification method (you can also choose other other ways of verification (you can also choose other other waysMethod) Verify your identity information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your biometric information (face verification) for real -name authentication or account security."}
{"task": "rw_51.jsonl", "id": 55027, "text": "Such information is a necessary information for authentication. If you cannot or refuse to provide the above information, you will not be able to complete your identity certification.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55028, "text": "58 Tongcheng reminds you that before you conduct identity authentication/verification, please read and ensure that the \"personal information\" - \"My Certification\" page displayed on the \"58 Group Certification Service Agreement\" on the \"58 Group Certification Service Agreement\"After the Group Certification Service Agreement \", the corresponding real -name authentication/verification service is performed.", "label": ["Policy Change", "Important"], "rewrite": "Before the identity authentication/verification, please click and agree to sign the \"58 Group Certification Service Agreement\" before conducting the corresponding real -name authentication/verification service."}
{"task": "rw_51.jsonl", "id": 55029, "text": "When you use the rented online contract, you will collect your name and ID number for contract signing.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your name and ID number for the signing of the contract."}
{"task": "rw_51.jsonl", "id": 55030, "text": "This information is the necessary information in the signing function of the rental house.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55031, "text": "(2) The sensitive permissions of retrieved", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55032, "text": "When you use face authentication form, you need to call the camera permissions of your device to obtain the facial biological information of the certification person.", "label": ["Permission Acquisition", "Important"], "rewrite": "You need to call the camera permissions to obtain the facial biological information of the certification person. If you refuse to call, you will not be able to use the face recognition function."}
{"task": "rw_51.jsonl", "id": 55033, "text": "When you upload related pictures (including upload avatars, company logo, company related pictures videos, and submit the company's corresponding qualification documents), you need to call the storage permissions (Android system) of your device so that you can upload the files and photos or photo album permissions in the device to upload the device in the device.(IOS system) Upload photos, call the camera permissions for shooting files. If you refuse the relevant system permissions, it will affect your submission of qualifications and ultimately affect the corresponding functions of your authentication identity.", "label": ["Permission Acquisition", "Important"], "rewrite": "The storage permissions of the device (Android system) or album permissions (iOS system) need to be called to upload files and photos in the device."}
{"task": "rw_51.jsonl", "id": 55034, "text": "(3) The third -party SDK used", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55035, "text": "Face recognition function is achieved through the Tencent Yunren face core SDK (Android side, iOS side), Alibaba Cloud face core SDK (Android side, iOS side), and visual Face ++, (iOS side).Sensitive permissions, collect and handle your facial biometric information at the same time. Such information is the necessary information for living body verification. If you refuse to provide it, you will not be able to realize the face recognition of the system.WeChat certification, bank card certification, gateway certification).", "label": ["Important", "First Party Collection Information"], "rewrite": "Face recognition function will directly use necessary sensitive permissions, while collecting and processing your facial biometric information."}
{"task": "rw_51.jsonl", "id": 55036, "text": "The above SDK may use the permissions after the storage permission of this device is authorized. The permissions are non -essential permissions. If you refuse to call, you can still use this function.", "label": ["Permission Acquisition", "Important"], "rewrite": "SDK may be used after your authorization storage permissions. This permissions are non -essential permissions. If you refuse to call, you can still use this function."}
{"task": "rw_51.jsonl", "id": 55037, "text": "(4) Other instructions", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55038, "text": "Please note that on behalf of your unit's certified enterprise account, the employer's qualification materials (including but not limited to the license of the employer, the identity of the personnel identity/entrustment certificate issued by the employer issued by the employer), are not your personal information.It is used to prove the qualifications and real information release needs of the employer.", "label": ["Important", "Risk"], "rewrite": "The qualification materials you submit are not personal information."}
{"task": "rw_51.jsonl", "id": 55039, "text": "As an employer authorized by the employer, on behalf of the information provided by the enterprise on the platform and the information generated by the platform, users of the same city platform have the right to apply to the platform for obtaining or viewing the above information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The employer authorized personnel on behalf of the information and information provided by the enterprise on the platform, and users of the 58 city platform have the right to apply for or view."}
{"task": "rw_51.jsonl", "id": 55040, "text": "5. Customer service", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55041, "text": "(1) Necessary information, non -essential information", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55042, "text": "When you publish information, appeal, or conduct inquiries with 58 City, in order to contact you or help you solve the problem, we may need to provide you with a mobile phone number (such as when you choose to consult by phone).Essence", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your mobile phone number to contact you or solve the problem."}
{"task": "rw_51.jsonl", "id": 55043, "text": "You can also choose to consult through the form of emails, and email for you to choose the essential information when consulting by mailbox.", "label": ["Important", "First Party Collection Information"], "rewrite": "Emails choose the necessary information when consulting by mailbox."}
{"task": "rw_51.jsonl", "id": 55044, "text": "If you refuse to provide the above information, some functions may not be used, and at the same time, you cannot feedback to appeal or consult the results in time.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55045, "text": "(2) The sensitive permissions of retrieved", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55046, "text": "When uploading consultation suggestions and feedback, you need to retrieve your camera permissions and file storage to upload the corresponding files.", "label": ["Permission Acquisition", "Important"], "rewrite": "Require your camera permissions and file storage, and upload the photo of the corresponding file."}
{"task": "rw_51.jsonl", "id": 55047, "text": "6. Direct push (personalized recommendation)", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55048, "text": "(1) Necessary information, non -essential information", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55049, "text": "We will analyze your preferences, habits, and positions based on the collected information and user portraits in order to provide you with more suitable customized services, such as showing or recommending the correlation to you (rather than generally pushing) to youSubscribe information, information flow or advertising/promotion information results.", "label": ["Important", "Usage"], "rewrite": "Based on collected information, analyze your preferences, habits, and positions and user portraits."}
{"task": "rw_51.jsonl", "id": 55050, "text": "To this end, the information we need to collect includes your equipment information, log information, and browsing records.", "label": ["Important", "First Party Collection Information"], "rewrite": "You need to collect your equipment information, log information, and browsing records."}
{"task": "rw_51.jsonl", "id": 55051, "text": "If you do not want to get our targeted push service, 58 City APP, you can set up in \"My\"-\"More\"-\"Privacy Management\".", "label": ["Important", "Edit/Control"], "rewrite": "You can cancel the directional push service through \"mine\"-\"more\"-\"privacy management\"."}
{"task": "rw_51.jsonl", "id": 55052, "text": "After closing personalized recommendations, we will no longer provide personalized recommendation services, but do not affect the normal use of other products and services we provide.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55053, "text": "(2) The third -party SDK used", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55054, "text": "The directional push function passes through the Xiaomi Push (Android), OPPO, Push (Android), Huawei Push (Android), a push push (Android terminal), Mobpush (Android), Push (Android), Baidu CloudPush the SDK (Android side) implementation, please refer to the information obtained from the above SDK for details, please refer to the \"Sharing Personal Information List with the Third Party\" (View Path: 58 The City APP-Mine-More-share personal information list with third parties).", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For information obtained by SDK for details, please refer to the \"Sharing Personal Information List with a Third Party\" (View Path: 58 The City APP-Mine-More-Sharing Personal Information List with a third party)."}
{"task": "rw_51.jsonl", "id": 55055, "text": "7. Marketing activities", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55056, "text": "(1) Necessary information, non -essential information", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55057, "text": "We will hold online or offline marketing activities from time to time, including inviting users to reward red envelopes and gifts for physical items.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55058, "text": "In such marketing activities, we may need users to provide personal information (mobile phone number, postcode, address information) so that we can distribute rewards or send gifts to users.", "label": ["Important", "First Party Collection Information"], "rewrite": "Users may need to provide personal information (mobile phone number, postcode, address information) in order to distribute or send gifts."}
{"task": "rw_51.jsonl", "id": 55059, "text": "In the case of 58 cities that pay for you, we may need to collect your identity information (name, ID number) to pay taxes.", "label": ["Important", "First Party Collection Information"], "rewrite": "You need to collect your identity information (name, ID number) for tax payment."}
{"task": "rw_51.jsonl", "id": 55060, "text": "And verify and verify your identity information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55061, "text": "Such information is the necessary information about this function. If you refuse to provide such information, you may not be able to participate in the above marketing activities or get rewards.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide such information, you may not be able to participate in the above marketing activities."}
{"task": "rw_51.jsonl", "id": 55062, "text": "(2) The sensitive permissions of retrieved", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55063, "text": "In order to prevent you from missing the opportunity of activities, we can remind marketing activities time, but this function needs to call the calendar permissions of your equipment. If you do not agree to callRequire.", "label": ["Permission Acquisition", "Important"], "rewrite": "The participation time of marketing activities reminds to call the calendar authority. If you do not agree to call, it will not affect participating in marketing activities."}
{"task": "rw_51.jsonl", "id": 55064, "text": "On the opening advertising page, we may collect your acceleration sensor information to facilitate you to enter the advertising floor page by shaking.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may collect your acceleration sensor information to enter the advertising landing page by shaking."}
{"task": "rw_51.jsonl", "id": 55065, "text": "8. Payment/withdrawal function", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55066, "text": "(1) Necessary information, non -essential information", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55067, "text": "You can pay some services in the same city in the same city.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55068, "text": "During your service, you may need to pay for. During the payment process, we may collect your third -party payment account (such as Alipay account, Apple, Pay, account or other forms of bank card information).", "label": ["Important", "First Party Collection Information"], "rewrite": "During the payment process, a third -party payment account will be collected (such as Alipay account, Apple Pay account, or other forms of bank card information)."}
{"task": "rw_51.jsonl", "id": 55069, "text": "During the withdrawal process, you need to collect the payment to WeChat change, you need to collect your user ID, openid, and name;", "label": ["Important", "First Party Collection Information"], "rewrite": "You need to collect your user ID, openid, and name for WeChat manifestations."}
{"task": "rw_51.jsonl", "id": 55070, "text": "To make a payment to the bank card, you need to collect your user ID, bank card number, account opening name, the name of the head bank, the name of the branch, the province and city where the branch is located.", "label": ["Important", "First Party Collection Information"], "rewrite": "You need to collect your user ID, bank card number, account opening name, head bank name, branch name, and provincial and municipalities, and the branch is used for bank payment."}
{"task": "rw_51.jsonl", "id": 55071, "text": "You participated in some promotion activities in the same city to get a reward given by 58 City. When you withdrawn, based on the requirements of the national tax department, we will pay a tax on behalf of the tax. At this time, you will collect your identity information according to the requirements of the tax department (Name, ID number, bank card number).", "label": ["Important", "First Party Collection Information"], "rewrite": "The identity information (name, ID number, bank card number) is collected in accordance with the requirements of the tax department for deduction and payment of taxes."}
{"task": "rw_51.jsonl", "id": 55072, "text": "Such information is a necessary information about this function. If you do not agree to collect and share such information, you may not be able to use the online payment function normally.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you do not agree to collect and share your identity information, the online payment function may not be used normally."}
{"task": "rw_51.jsonl", "id": 55073, "text": "(2) The third -party SDK used", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55074, "text": "The payment function is achieved through Alipay SDK (Android, iOS), SDK will collect and use your device information (IMEI/IMSI, SIM card serial number/MAC address, BSSID, Android_id, hardware serial number, ICCID), positioning information, positioning information, positioning informationNetwork types, device models, equipment brands, operators information, and application information. If the above necessary information is not provided, the payment function cannot be achieved.", "label": ["Important", "First Party Collection Information"], "rewrite": "information."}
{"task": "rw_51.jsonl", "id": 55075, "text": "9. Resume delivery service", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55076, "text": "(1) Necessary information, non -essential information", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55077, "text": "If you use 58 cities recruitment services, you can create resume information by yourself. After you create your resume, you can \"privacy settings\" on your resume.", "label": ["Important", "Edit/Control"], "rewrite": "After the resume is created, the resume can be \"privacy settings\"."}
{"task": "rw_51.jsonl", "id": 55078, "text": "If you choose to deliver to \"the recruiter who is delivered only\" or \"only see the company\", your resume is only visible to the recruitment of your resume.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55079, "text": "If you choose to see \"all recruiters\", you authorize recruitment companies or personnel on the corresponding service on the city platform to find your resume through our resume database.", "label": ["Important", "Edit/Control"], "rewrite": "If you choose to see \"all recruiters\", you authorize recruitment companies or personnel to find your resume through your resume database."}
{"task": "rw_51.jsonl", "id": 55080, "text": "In order to be able to provide you with job search services better, it is recommended that you fill in the resume information truthfully. If any controversy caused by the false problem you fills out, you should bear it yourself.", "label": ["Risk"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55081, "text": "In order to ensure the true effectiveness of the resume, we may dial the mobile phone number status in your resume. For example, we will prompt you to modify your resume.", "label": ["Important", "Risk"], "rewrite": "We may dial the mobile phone number status in the resume to ensure the authenticity of the resume."}
{"task": "rw_51.jsonl", "id": 55082, "text": "We will also conduct a qualification review of recruiters using resumes, but please know that we can only conduct formal reviews. If recruitment companies contact you for interviews, please carefully verify the relevant qualification information of recruiting enterprises and the actual enterprise reality of the enterprise reality again.operation status.", "label": ["Risk"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55083, "text": "(2) The sensitive permissions of retrieved", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55084, "text": "When you choose photos and images as personal avatars, you need to call the storage permissions of your device (Android system)/album permissions (iOS system);", "label": ["Permission Acquisition", "Important"], "rewrite": "Call the storage permissions of your device (Android system)/album permissions (iOS system) to upload personal avatars."}
{"task": "rw_51.jsonl", "id": 55085, "text": "When you choose to shoot images as a personal avatar, you need to call the camera permissions of your device;", "label": ["Permission Acquisition", "Important"], "rewrite": "When choosing to shoot images as a personal avatar, the camera authority of the device is required."}
{"task": "rw_51.jsonl", "id": 55086, "text": "You need to call the storage authority of your device when uploading your attachment resume.", "label": ["Permission Acquisition", "Important"], "rewrite": "You need to call the storage authority of your device when uploading the resume."}
{"task": "rw_51.jsonl", "id": 55087, "text": "If you refuse the relevant system permissions, you may not be able to choose or use your favorite avatar or upload attachment resumes, but it will not affect your use of perfect online resume functions.", "label": ["Permission Acquisition", "Important"], "rewrite": "Reject the authority of the relevant system, may not be selected or using avatars, or can be uploaded to attachment resumes, but does not affect the use of perfect online resume functions."}
{"task": "rw_51.jsonl", "id": 55088, "text": "10. Provide you with members or subscribing services", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55089, "text": "When you buy members (such as VIP members, job hunting gold members) or automatic subscription services on the 58 -city platform, we will record your payment method to complete the payment service.", "label": ["Important", "First Party Collection Information"], "rewrite": "Will record your payment method to complete the payment service."}
{"task": "rw_51.jsonl", "id": 55090, "text": "11. Customer service and dispute processing", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55091, "text": "In order to provide you with customer service, we will record your contact information and communication/call records and contents for you to contact you and help you solve the problem, or record the processing schemes and results of related issues.", "label": ["Important", "First Party Collection Information"], "rewrite": "Will record the contact information and communication/call records and content you provide for you to contact you and solve the problem."}
{"task": "rw_51.jsonl", "id": 55092, "text": "12. Consumer finance business", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55093, "text": "1) Anti -money laundering and real -name management functions", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55094, "text": "(1) Necessary information, non -essential information", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55095, "text": "When you activate the consumer credit quota, in order to fulfill the anti -money laundering requirements, we need to certify the authenticity of your identity. You need to provide your real name, gender, ID information (type of identity documents, identity documents, identity documents validity period, identity, identity, identityAccording to relevant laws and regulations, you need to use our credit services after multiple transmission verification of the basic information of identity.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect real name, gender, and ID information for authentication information."}
{"task": "rw_51.jsonl", "id": 55096, "text": "In order to further prevent the risk of fraud, identify customer identity, and ensure account security, you need to perform face and ID card recognition certification. You agree that we have the right to collect your face photos, facial videos, and ID photos.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your face photos, facial videos, and ID photos for face and identification certification."}
{"task": "rw_51.jsonl", "id": 55097, "text": "Such information is the necessary information in this function scenario.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55098, "text": "(2) The sensitive permissions of retrieved", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55099, "text": "Get the camera permissions in this function scenario for face recognition, scan ID card and identify;", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55100, "text": "Album read permissions, used to collect ID card photos of the album;", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55101, "text": "Album deposit permissions: take pictures to the album.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55102, "text": "(3) The third -party SDK used", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55103, "text": "In this functional scenario, face recognition and identity recognition are realized through viewing Face ++ (iOS side).", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55104, "text": "2) Qualification, credit and solvency review function", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55105, "text": "(1) Necessary information, non -essential information", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55106, "text": "When applying for credit, you can accurately evaluate your credit qualifications, credit and solvency capabilities to prevent your loan funds from being obtained by criminals, at the same time to implement the risk of anti -fraud prevention, and ensure your funds.The types of products or services are collectively collecting your personal basic information, work information, marriage status, educational information, family address, loan use, mailbox, emergency contact information.", "label": ["Important", "First Party Collection Information"], "rewrite": "You need to agree that we collect your personal basic information, work information, marriage status, education information, family address, loan use, mailbox, emergency contact information based on different products or service types."}
{"task": "rw_51.jsonl", "id": 55107, "text": "The personal information of the different products or services corresponding to the aforementioned products or services is based on what you use to show you the page where you use the corresponding product or service, and you need to make the initiative to fill in or provide it.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55108, "text": "(2) The sensitive permissions of retrieved", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55109, "text": "According to the requirements of credit supervision requirements, judgment of the territorial restrictions of users served by cooperative financial institutions, you agree that we will collect your geographical location information.", "label": ["Important", "First Party Collection Information"], "rewrite": "You need to agree with us to collect your geographical information."}
{"task": "rw_51.jsonl", "id": 55110, "text": "3) Borrowing and repayment service functions", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55111, "text": "In order to achieve loan issuance and recycling, you need to bind bank accounts as your loan collection account and/or borrowing repayment account. You agree to collect your bank card type, bank card account opening bank, bank card number, bank bank, bankReserve your mobile phone number and verify your identity information and bank account information.", "label": ["Important", "First Party Collection Information"], "rewrite": "You need to apply for collecting your bank card type, bank card account opening bank, bank card number, and bank reserved mobile phone number for loan issuance and recycling."}
{"task": "rw_51.jsonl", "id": 55112, "text": "4) Loan management function", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55113, "text": "(1) Necessary information, non -essential information", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55114, "text": "After you applied for personal consumption loans, in order to manage your loan, and at the same time, in order to facilitate you to understand your loan information, we will collect your loan records, withdrawal records, repayment records, repayment amounts, default information (including itOverdue information).", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your loan records, withdrawal records, repayment records, repayment amount, default information (including loan overdue information) for loan management."}
{"task": "rw_51.jsonl", "id": 55115, "text": "If you refuse to provide the above information, you will not be able to use the corresponding services we provide normally, but it does not affect the basic browsing function of your normal use of this platform.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55116, "text": "13. Insurance services", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55117, "text": "(1) Necessary information, non -essential information", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55118, "text": "1) When you are insured, in order to achieve your insurance purpose, we will collect: the name, certificate type, contact information, gender, address, email, financial information, financial information, financial information, financial information, financial information, Payment information, equipment information, log information, credit information, trajectory trajectory, personal biometric information, personal health and physiological information, vehicle information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect: the name, certificate type, document number, contact information, gender, address, e -mail, payment information, equipment information, log information, credit information, credit information, credit information, credit information, credit information, credit information, credit information, credit information, credit informationTracks, personal biometric information, personal health and physiological information, vehicle information."}
{"task": "rw_51.jsonl", "id": 55119, "text": "The specific information will be displayed according to the actual page display according to the requirements of different insurance products.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55120, "text": "2) To help insurance institutions understand your insurance state, we will collect your insurance premium payment status from the bank or third -party payment institution and give feedback to the insurance institution.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect your insurance premium payment status to banks or third -party payment institutions."}
{"task": "rw_51.jsonl", "id": 55121, "text": "If you refuse to provide the above information, you will not be able to use the corresponding services we provide normally, but it does not affect the basic browsing function of your normal use of this platform.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55122, "text": "14. Transfer and recycling business", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55123, "text": "1) Mobile phone valuation function", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55124, "text": "(1) Necessary information, non -essential information", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55125, "text": "When you choose to turn the valuation function of the revival, you need to provide us with the information of your valuation property (including property, versions and models, brands, years, appearance and functional status), we will collect the aforementioned information you provide to the system to systemIntelligent valuation.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect information related to valuation property (including property products, versions and models, brands, years, appearance and functional status) for valuation."}
{"task": "rw_51.jsonl", "id": 55126, "text": "Such information is the necessary information in this function scenario.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55127, "text": "2) Create recycling orders", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55128, "text": "(1) Necessary information, non -essential information", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55129, "text": "We need to collect your mobile phone valuation information, on -site pickup information (name, contact phone number, pickup address) to create recycling orders, and at the same time we will share your home access information with SF in so SF provided you to provide you with on -site pickups to pick up parts.And sending service.", "label": ["Important"], "rewrite": "Collect your mobile phone valuation information, on -site pickup information (name, contact phone number, pickup address) to create recycling orders."}
{"task": "rw_51.jsonl", "id": 55130, "text": "The aforementioned information is the required information for the establishment of a mobile phone recycling and transportation contract.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55131, "text": "3) Recovery money", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55132, "text": "(1) Necessary information, non -essential information", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55133, "text": "If the mobile phone you send is successfully recycled, we need to collect your receiving account information (account number, account opening/payment institution name, household name) to support your mobile phone recovery collection needs. At the same time, we also need to collect your identity information(Name, ID number) is used to pay taxes and fulfill the relevant laws and regulations.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your receipt account information (account number, account opening/payment institution name, household name) and identity information (name, ID number), and use it to collect and pay taxes."}
{"task": "rw_51.jsonl", "id": 55134, "text": "Such information is the necessary information in this function scenario.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55135, "text": "15. Provide you with other services", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55136, "text": "1) Recommended function based on location information: We will collect your location information (we only collect the geographical location you were at that time, but we will not combine the location information of each period to judge your whereabouts) to judge youLocation.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your location information to judge where you are."}
{"task": "rw_51.jsonl", "id": 55137, "text": "If the real estate channel, it will automatically recommend housing or real estate information in your area.", "label": ["Usage"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55138, "text": "2) Service function based on camera (camera): You can use this feature to complete the editing of video shooting, camera, and promotion information, or check the promotion information through this function.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55139, "text": "3) The function of uploading based on picture: You can upload your photos in the same city to implement the editing of the promotion information you want to publish.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55140, "text": "4) Alt the function based on voice technology: You can directly use microphone to publish information or have non -real -time interaction with other users in the same city.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55141, "text": "The above additional features may require you to open your geographical location (location information), camera (camera), album (picture library), and microphone to us in your device to achieve the collection and use of information involved in these functions.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "You need to turn on your geographical location (location information), camera (camera), album (picture library), microphone rights."}
{"task": "rw_51.jsonl", "id": 55142, "text": "We will prompt you in advance when you download the APP for the first time or use the above features one by one in the form of a pop -up window. You can choose according to your needs.", "label": ["First Party Collection Information", "Permission Acquisition"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55143, "text": "Please note that when you turn on these permissions, it means that you authorize us to collect and use these personal information to achieve the above functions. If you turn off the authority, it means that you cancel these authorization, and we will no longer continue to collect and use your individuals.Information cannot provide you with the above functions corresponding to these authorization.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "The opening authority means authorization. Closing authority means cancellation of authorization. We will no longer continue to collect and use personal information, nor can it provide the corresponding functions corresponding to the authorization."}
{"task": "rw_51.jsonl", "id": 55144, "text": "The decision to close permissions will not affect the processing of personal information based on your authorization.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "The decision to close permissions will not affect the processing of personal information based on authorization."}
{"task": "rw_51.jsonl", "id": 55145, "text": "If you do not agree with the personalized recommendation service of the same city in the same city, you can close this service at the \"58 City APP-Mine-Privacy Management-Receive Personalized Recommendation\" position.", "label": ["Important", "Edit/Control"], "rewrite": "Close personalized recommendation services at the position of \"58 City APP-Mine-Settings-Privacy Management-Receive Personalized Recommendation\"."}
{"task": "rw_51.jsonl", "id": 55146, "text": "You can also close the \"System Message\" and \"Popular Recommendation\" services at the location of \"58 City APP-Mine-Settings-Message Management\".", "label": ["Important", "Edit/Control"], "rewrite": "You can close the \"System Message\" and \"Popular Recommendation\" services at the \"58 City APP-Mine-Settings-Message Management\" position."}
{"task": "rw_51.jsonl", "id": 55147, "text": "In addition, we may still need you to turn on the device's other access permissions in related business functions. The detailed authority and the purpose of use are as follows:", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55148, "text": "1) Android.Permission.internet (access network permission): Implement the application of the application", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55149, "text": "2) Android.Permission.get_tasks (obtaining task information permissions): Allow the application to obtain the current or recently operated application", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55150, "text": "3) Android.Permission.system_alert_window", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55151, "text": "4) Android.Permission.use_fingerprint (using fingerprint permissions): for fingerprint login", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55152, "text": "5) Android.Permission.writesystem (permissions of the read and write system settings): Allow the application read and write system setting item", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55153, "text": "6) Android.Permission.modify_Audio_Settings", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55154, "text": "7) Android.Permission.access_wifi_State", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55155, "text": "8) Android.Permission.access_network_State", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55156, "text": "9) Android.Permission.vibrate: allow mobile phone to vibrate", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55157, "text": "10) Android.Permission.wake_lock", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55158, "text": "11) Android.Permission.bluetooth (using Bluetooth permissions): Bluetooth function module", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55159, "text": "12) Android.Permission.change_wifi_State", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55160, "text": "16. Other services", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55161, "text": "1) Extension function based on the shear plate: When you start the app to enter the homepage or switch to the homepage, in order to identify the readings of the readings, SMS verification codes, sharing or accepting information, your shear plate function may be possible.Call.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55162, "text": "The shear information will only be processed on your device and will not store your shear information for any other purpose.", "label": ["Data Retention", "Important"], "rewrite": "Do not store your shear information for any other purpose."}
{"task": "rw_51.jsonl", "id": 55163, "text": "2) Expansion function based on calendar permissions (read calendars and edit calendars): When you use related services, you can manage your custom matters and set important matters through opening the calendar authority to easily manage your custom matters and set important matters.", "label": ["Important", "Edit/Control"], "rewrite": "It can be reminded by opening the calendar authority conveniently to manage custom matters and set important matters."}
{"task": "rw_51.jsonl", "id": 55164, "text": "We visit your calendar to facilitate the reservation interview on the recruitment page and add the interview time to the schedule, and provide you with the relevant reminder function of the appointment interview to prevent forgetting and missing;", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55165, "text": "When you use our \"sign -in reminder\" function on our sign -in page, you can open the permission of the calendar in order to achieve the sign -in reminder function.", "label": ["Permission Acquisition", "Important"], "rewrite": "Open the permissions of the calendar for the sign -in reminder function."}
{"task": "rw_51.jsonl", "id": 55166, "text": "If you do not open this permission, you will not be able to use the calendar management related functions, but it will not affect your other services.", "label": ["Permission Acquisition", "Important"], "rewrite": "Without opening this authority, it will not be able to use the calendar management related functions, but it will not affect the use of other services."}
{"task": "rw_51.jsonl", "id": 55167, "text": "3) Extension function based on face ID/touch ID permissions: If you use the apple device & Android device with supportive face recognition, you can use the face ID payment and face ID unlock (login) function in 58APP;", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55168, "text": "If you use the Apple device & Android device that supports fingerprint recognition, you can use fingerprint payment and fingerprint unlocking (login) function in 58APP.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55169, "text": "You need to enter face information or fingerprint information on your device and complete information verification on your device when using services.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect facial information or fingerprint information to complete the verification."}
{"task": "rw_51.jsonl", "id": 55170, "text": "We need to use your face ID/touch ID permissions to receive verification results, but we do not collect your face ID/touch ID information.", "label": ["Permission Acquisition", "Important"], "rewrite": "Use your face ID/touch ID permissions to receive the verification results."}
{"task": "rw_51.jsonl", "id": 55171, "text": "If you do not turn on this authority, you will not be able to use the aforementioned service, but it will not affect your choice of other payment or unlocking methods.", "label": ["Permission Acquisition", "Important"], "rewrite": "The aforementioned service will not be used without opening this permission, but it will not affect the choice of other payment or unlocking methods."}
{"task": "rw_51.jsonl", "id": 55172, "text": "The fingerprint recognition function is implemented through the Tencent Fingerprint Authentication SDK (Android). The SDK will collect and use your device model, fingerprint sensor permissions, and camera permissions. If the above necessary information is not provided, the fingerprint login function will not be achieved.", "label": ["Important", "First Party Collection Information"], "rewrite": "SDK will collect and use the device model, fingerprint sensor permissions, and camera permissions. Do not provide the above -mentioned necessary information that will not be able to achieve fingerprint login function."}
{"task": "rw_51.jsonl", "id": 55173, "text": "4) Based on the scene of secondary verification of your account status, we sometimes collect your common mobile phone brands.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect your common mobile phone brands for secondary verification identity."}
{"task": "rw_51.jsonl", "id": 55174, "text": "When the 58 -city system finds that your account information is suspected to be a login abnormality, we will conduct a problem investigation to you, combined with you to fill in your account to match your account to ensure the security of your account.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55175, "text": "In addition, 58 City does not use other forms of information collected above.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55176, "text": "5) Safety guarantee function: In addition to the products and services provided by you above 58, we may collect your MAC address information, application list information, IMEI or OAID, Android, ID, CPU, ID, serial number, Openuuid(iOS,), network address, hardware serial number, IMSI, acceleration sensor, gravity sensor, gyroscope sensor, rotating vector sensor, light sensor, linear accelerator, magnetic field sensor, pressure sensor, relative humidity sensor, ambient temperature sensor, this temperature sensor, this should be thisThe collection of information to ensure your 58 city account security, anti -theft number, and information security function.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "Collect your MAC address information, application list information, IMEI or OAID, Android ID, CPU ID serial number, OpenuUID (iOS), network address, hardware serial number, IMSI, acceleration sensor, gravity sensor, gyroscope sensor, rotating vector sensor, rotating vector sensor, Light sensor, linear accelerator, magnetic field sensor, pressure sensor, relative humidity sensor, ambient temperature sensor."}
{"task": "rw_51.jsonl", "id": 55177, "text": "Such information is a need for security protection.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55178, "text": "6) We may collect your other information in order to provide the reasonable needs of services and improve service quality, including the relevant information provided by your customer service team when you contact our customer service team. You participated in the questionnaire to the questionnaire answer information to us.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the relevant information provided by your customer service team, and you participate in the questionnaire reply information sent by the questionnaire."}
{"task": "rw_51.jsonl", "id": 55179, "text": "At the same time, in order to improve the security of the services provided by the 58 -city platform, and to prevent fraud and Trojan viruses more accurately, we may judge you by understanding some of your network usage habits and software information methods you often useThe risk of the account may record some URLs we think are risky.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "We will judge the risk of accounts by understanding the network usage habits and commonly used software information means, and will record some risky URLs."}
{"task": "rw_51.jsonl", "id": 55180, "text": "Under the premise that a single user privacy data is not disclosed, the 58 city and its affiliated companies have the right to analyze the entire user database and use the user database to use it.", "label": ["Important", "Risk", "Usage"], "rewrite": "58 Tongcheng and its affiliated companies have the right to analyze the entire user database and use the user database to use it."}
{"task": "rw_51.jsonl", "id": 55181, "text": "58 The same city may count the usage of network services.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55182, "text": "At the same time, the 58 city may share these statistics with the public to show the overall trend of our service.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "58 The same city may share these statistical information with the public to show the overall trend of services."}
{"task": "rw_51.jsonl", "id": 55183, "text": "These statistical information does not include any identification information of your identity.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Statistical information does not include any identification information of your identity."}
{"task": "rw_51.jsonl", "id": 55184, "text": "(3) Exceptions of obtaining authorization consent", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55185, "text": "According to the provisions of relevant laws and regulations, in the following circumstances, we can collect and use some necessary personal information without obtaining your authorization consent:", "label": ["Important", "First Party Collection Information"], "rewrite": "In the following circumstances, you can collect and use some necessary personal information without the consent of authorization:"}
{"task": "rw_51.jsonl", "id": 55186, "text": "1. Directly related to national security and national defense security;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting personal information directly related to national security and national defense security does not need to obtain consent."}
{"task": "rw_51.jsonl", "id": 55187, "text": "2. Directly related to public safety, public health, and major public interests;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect personal information directly related to public safety, public health, and major public interests without obtaining consent."}
{"task": "rw_51.jsonl", "id": 55188, "text": "3. Directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect direct personal information related to criminal investigation, prosecution, trial, and execution of judgments without obtaining consent."}
{"task": "rw_51.jsonl", "id": 55189, "text": "4. For major legitimate rights and interests such as maintaining your or other individuals, but it is difficult to get my consent;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting and maintaining major legitimate rights and interests, but it is difficult to get personal information that I agree, no need to obtain consent."}
{"task": "rw_51.jsonl", "id": 55190, "text": "5. The personal information you collected is publicly disclosed to the public by yourself;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "The collected personal information is publicly disclosed to the public by itself and does not need to obtain consent."}
{"task": "rw_51.jsonl", "id": 55191, "text": "6. Collect your personal information from the information disclosed by legal and publicly disclosed, such as from legal news reports and government information disclosure;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect personal information from legal publicly disclosed information without obtaining consent."}
{"task": "rw_51.jsonl", "id": 55192, "text": "7. Signing and fulfilling the contract according to your requirements;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting and signing and performing personal information necessary for the contract does not need to obtain consent."}
{"task": "rw_51.jsonl", "id": 55193, "text": "8. Other circumstances stipulated in laws and regulations.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect personal information under other circumstances stipulated in the laws and regulations, without requiring consent."}
{"task": "rw_51.jsonl", "id": 55194, "text": "You know and recognize: 58 The city provides you in the same city through advertising or other ways, so that you can access third -party services or websites.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55195, "text": "When you use these third -party services, you must be subject to the third -party service terms and privacy policies. The 58 city prompts you to read its policy carefully.", "label": ["Policy Change", "Important"], "rewrite": "When you use these third -party services, you must be subject to the service terms and privacy policies of the third party."}
{"task": "rw_51.jsonl", "id": 55196, "text": "This agreement is only applicable to the information collected by the server provided by 58 in the same city, and does not apply to the rules of service provided by third parties or the use of information use of third -party information. 58 City does not assume responsibility for third parties using the information provided by you.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55197, "text": "4. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55198, "text": "In order to make you easier to access the experience, when you visit related websites related to the 58 city platform or use the services provided by the 58 city platform, we may identify your identity through small data files.Steps, or help judge your account security.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you visit related websites or services, we may identify your identity through small data files to judge account security."}
{"task": "rw_51.jsonl", "id": 55199, "text": "These data files may be Cookie, Flash Cookie, or other local storage provided by your browser (collectively referred to as \"Cookie\").", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55200, "text": "There are often some electronic images on the webpage (called \"single pixel\", GIF, files or, \"network, beacon\"). Using the Internet beacon can help the website to calculate the user of the webpage or visit certain cookies.Collect your information about your browsing web activities, such as the page address you visit, the address of the quoted page you previously visited, the time you stay on the page, your browsing environment, and display settings.", "label": ["Important", "First Party Collection Information"], "rewrite": "You will collect your information about your browsing web activities through the Internet Beacon, such as the page address you visit, the address of the quoted page you have previously visited, the time you stay on the page, your browsing environment, and display settings."}
{"task": "rw_51.jsonl", "id": 55201, "text": "58 The same city may use the behavior data you browse on the 58 -city website. According to your interests and preferences, you may show information or content related to your interest when you browse the website. This process includes the following aspects:", "label": ["Usage"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55202, "text": "1) Collection of interest data: We use Cookie to collect and save your behavior data through the content you browsed in the same city.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect and save your behavior data with cookies."}
{"task": "rw_51.jsonl", "id": 55203, "text": "2) Get your interest classification according to your browsing behavior data.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Based on your viewing data, get your interest classification."}
{"task": "rw_51.jsonl", "id": 55204, "text": "For example, if you look for the Beijing moving company information in the past two days, we will understand that your interest is Beijing's moving company.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55205, "text": "We will not use the information collected above for any purpose outside of the purpose of this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55206, "text": "Please understand that some of our services can only be implemented by using \"cookie\".", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55207, "text": "If your browser or browser additional service allows, you can modify the degree of acceptance of Cookie on related pages, but this move may affect your security access to the relevant website of the same city and use the 58 -city platform provided by you in some cases.Services.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "You can modify the acceptance of Cookie on related pages, but this may affect your security access to related websites and service services."}
{"task": "rw_51.jsonl", "id": 55208, "text": "Fifth, how can we share, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55209, "text": "(1) Sharing", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55210, "text": "We will not share your personal information with any company, organization and individual other than 58, except the following situations: except:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "It will not share your personal information with any company, organization and individual other than 58, except the following situations:"}
{"task": "rw_51.jsonl", "id": 55211, "text": "1. Shared in a clear consent: After getting your clear consent, we will share your personal information with other parties.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After getting your clear consent, we will share your personal information with other parties."}
{"task": "rw_51.jsonl", "id": 55212, "text": "2. In accordance with the provisions of laws and regulations, and the requirements of administrative and judicial institutions: We may share your personal information to the above regulatory authorities in accordance with the provisions of laws and regulations, or in accordance with the regulations of laws and regulations, or in accordance with the mandatory requirements of the government authority.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "It may share your personal information from the regulatory authorities in accordance with laws and regulations, or in accordance with the mandatory requirements of the government authorities."}
{"task": "rw_51.jsonl", "id": 55213, "text": "3. Share with our affiliates: Your personal information may be shared with the affiliated company in the same city.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Your personal information may be shared with the affiliated company in the same city."}
{"task": "rw_51.jsonl", "id": 55214, "text": "We will only share the necessary personal information and be restricted by the purpose declared in this privacy policy.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only share the necessary personal information and be restricted by the purpose declared in this privacy policy."}
{"task": "rw_51.jsonl", "id": 55215, "text": "If related companies want to change the purpose of personal information, they will solicit your authorization consent again.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If related companies want to change the purpose of personal information, they will solicit your authorization consent again."}
{"task": "rw_51.jsonl", "id": 55216, "text": "The affiliated company refers to the legal entity and its branches that are directly or indirectly controlled by the 58 -city platform operation subject, and their branches of the same actual controller are directly or indirectly controlled by the 58 -city platform operation entity;", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55217, "text": "Control, controlling: through agreement or equity control or control.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55218, "text": "For details collected by related companies, please refer to the \"Sharing Personal Information List with a Third Party\" (View Path: 58 The City APP-Mine-More-Sharing Personal Information List with a third party).", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For details collected by related companies, please refer to the \"Sharing Personal Information List with a Third Party\" (View Path: 58 The City APP-Mine-More-Sharing Personal Information List with a third party)."}
{"task": "rw_51.jsonl", "id": 55219, "text": "4. Sharing with authorized partners: Only in order to achieve the purpose of the privacy policy, some of our services will be provided by authorized partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "To achieve the purpose of the privacy policy, some of our services will be provided by authorized partners."}
{"task": "rw_51.jsonl", "id": 55220, "text": "We may share some of your personal information with our partners to provide better customer service and user experience.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share some of your personal information with your partners."}
{"task": "rw_51.jsonl", "id": 55221, "text": "For example, after you use our recruitment channel service to create resumes, when you take the initiative to submit your resume to the recruiter, we must share your resume information with the recruiter to allow the recruiter to see your resume information communicate with you.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When you actively submit your resume, we must share resume information with the recruiter."}
{"task": "rw_51.jsonl", "id": 55222, "text": "We will only share your personal information for legal, correct, necessary, specific, and clear purposes, and only share the personal information necessary for providing services.", "label": ["Important", "Data Security"], "rewrite": "We will only share your personal information for legal, correct, necessary, specific, and clear purposes."}
{"task": "rw_51.jsonl", "id": 55223, "text": "Our partners have no right to use the personal information they shared for any other purpose.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Our partners have no right to use the personal information they shared for any other purpose."}
{"task": "rw_51.jsonl", "id": 55224, "text": "At present, our authorized partners include the following two types:", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55225, "text": "1) Authorized partners of advertising and analytical service.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55226, "text": "We will not share your personal information with advertising, consulting service providers and affiliated companies, unless you actively authorize us to provide it.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not share your personal information with advertising, consulting service providers and related companies, unless you actively authorize."}
{"task": "rw_51.jsonl", "id": 55227, "text": "But we may have information that cannot be identified by processing and cannot be restored by the receiver, such as the user portrait and device information (OAID, IMEI, IDFA, IP, OAID) or anonymousization of the user portrait and de -identified device.Equipment, network, and channel information sharing with advertising or consulting service providers or advertisers to help them improve the effective touch rate of advertising without identifying your personal personal product and analyze our products and services.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may have information that cannot be identified and cannot be recovered after processing, such as user portraits and device information (OAID, IMEI, IDFA, IP, OAID) or anonymous information, and advertisingLord shared."}
{"task": "rw_51.jsonl", "id": 55228, "text": "We may share the analysis of de -identified equipment information or statistical information with business service providers, suppliers and other partners. This information is difficult or unable to associate with your true identity.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share with partners to analyze device information or statistical information, which is difficult to associate with your true identity."}
{"task": "rw_51.jsonl", "id": 55229, "text": "This information will help us analyze and measure the effectiveness of advertising and related services.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55230, "text": "2) Service provider and other partners.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55231, "text": "When you use our specific service, you fill in the information you fill in, and we send the information you fill in to the service provider you want to contact.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We send the information you fill in to the service provider you want to contact."}
{"task": "rw_51.jsonl", "id": 55232, "text": "For example, when you want to understand the reserve price of a model on the \"used car\" channel, you will fill in and submit contact information independently. After you submit, we will provide you with the owner or car dealer who want to consult.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will provide your own contact information to the owner or car dealer who want to consult."}
{"task": "rw_51.jsonl", "id": 55233, "text": "Companies, organizations and individuals who share personal information with us, we will sign a strict confidentiality agreement with them, asking them to handle personal information in accordance with our instructions, privacy policies, and any other related confidentiality and security measures.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will sign a strict confidentiality agreement with the third party of shared information."}
{"task": "rw_51.jsonl", "id": 55234, "text": "5. For the purpose of academic research or public interest, it is harmful to your major interests;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For the purpose of academic research or public interest, and harmless to your major interests, we will share personal information."}
{"task": "rw_51.jsonl", "id": 55235, "text": "6. If you are a qualified intellectual property rightist and have filed a complaint, the respondent should be disclosed to the respondent, so that both parties can handle possible rights and disputes;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you are a qualified Intellectual Property Complaint and have filed a complaint, the respondent should be required to disclose personal information to the respondent."}
{"task": "rw_51.jsonl", "id": 55236, "text": "7. Only by sharing your information can you provide the service you need or handle your disputes or disputes with others.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55237, "text": "For example, in a certain transaction you created on the same city, if any party fulfills or partially fulfilled the transaction obligations and put forward information disclosure requests, the 58 city will provide the user to provide the user's contact method for the other party's connection to the same situation as a required information, so as to use it to use the information of the other party's connection.Promote the completion of the transaction or the resolution of disputes;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "58 The same city will provide users with the necessary information about the connection of the other party to the user depending on the situation to promote the completion of the transaction."}
{"task": "rw_51.jsonl", "id": 55238, "text": "8. You agree to submit personal information to third parties by clicking on the corresponding button of related products (including but not limited to, \"help me apply\" and \"help me submit\" keys).", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You agree to submit personal information to third parties by clicking on the corresponding button of related products."}
{"task": "rw_51.jsonl", "id": 55239, "text": "9. We will use the application interface (API), software tool development package (SDK) to share the necessary data sharing with third parties. Different versions of third parties, SDKs, generally include third -party account login classes, sharingClass, third -party payment category, map navigation category, manufacturer push, statistical categories, etc., we will conduct strict security testing of third parties and agreed data protection measures.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "The necessary data sharing will be shared with third parties through application interface (API), software tool development package (SDK), and strict security testing of third parties and data protection measures."}
{"task": "rw_51.jsonl", "id": 55240, "text": "For details, please refer to the \"Sharing Personal Information List with a Third Party\".", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55241, "text": "Please know that we will only share your personal information for legal, correct, necessary, specific, and clear purposes. For companies, organizations, and individuals that shared personal information for us to realize the purpose of this policy, we, weIt will sign strict information protection and confidentiality agreement with them, asking them to abide by the agreement and take relevant security measures to protect your personal information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "It will only share your personal information for legal, correct, necessary, specific, and clear purposes."}
{"task": "rw_51.jsonl", "id": 55242, "text": "(2) Transfer", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55243, "text": "We will not transfer your personal information to any company, organization and individual, except the following situations: except:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not transfer your personal information to any company, organization and individual, except the following situations: except:"}
{"task": "rw_51.jsonl", "id": 55244, "text": "1. In the case of obtaining clear consent: After getting your clear consent, we will transfer your personal information to other parties;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After getting your clear consent, we will transfer your personal information to other parties."}
{"task": "rw_51.jsonl", "id": 55245, "text": "2. When involving mergers, acquisitions, or bankruptcy liquidation, if personal information is transferred, we will require new companies and organizations that hold your personal information to continue to be subject to this privacy policy. Otherwise, we will ask the company and organization to organize the organization and organizationRe -solicitting authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If the merger, acquisition or bankruptcy liquidation involves the transfer of personal information, it will require new holders to continue to be constrained by this privacy policy."}
{"task": "rw_51.jsonl", "id": 55246, "text": "(3) Public disclosure", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55247, "text": "We will only publicly disclose your personal information in the following circumstances:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the following circumstances, you will publicly disclose your personal information:"}
{"task": "rw_51.jsonl", "id": 55248, "text": "1. After getting your clear consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After getting your clear consent, you will disclose personal information."}
{"task": "rw_51.jsonl", "id": 55249, "text": "2. Based on legal disclosure: With the compulsory requirements of legal, legal procedures, litigation or government authorities, we may disclose your personal information about the above regulatory authorities.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the case of compulsory requirements of legal, legal procedures, litigation, or government authorities, your personal information may be disclosed."}
{"task": "rw_51.jsonl", "id": 55250, "text": "We know the corresponding legal liabilities assumed to share, transfer, and publicly disclose personal information.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55251, "text": "We promise to share, transfer, and publicly disclose your personal information in accordance with the requirements of these clauses. In accordance with the requirements of laws, regulations and national standards, confirm the agreement, copywriting in specific scenarios, pop -up windows, prompts and other forms to obtain your consent or confirmationThe third party has obtained your consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When sharing personal information, you will obtain your consent or confirm that the third party has obtained your consent in the form of confirmation agreement, copywriting, pop -ups, and prompts in specific scenarios."}
{"task": "rw_51.jsonl", "id": 55252, "text": "Therefore, please consider the information content that uploads, publish and communicate through our services.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55253, "text": "In some cases, you can control the privacy settings of some of our services to control the scope of user scope of your shared information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Edit/Control"], "rewrite": "You can control the scope of users with the right to browse your shared information through privacy settings."}
{"task": "rw_51.jsonl", "id": 55254, "text": "If you are required to delete your relevant information from our services, please operate the contact information provided by the beginning of this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55255, "text": "6. How do we store and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55256, "text": "(1) Information storage", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55257, "text": "The information and information collected by 58 in the same city will be stored on the server of 58 City and (or) its associated companies, all of which are stored in China.", "label": ["Data Retention", "Important"], "rewrite": "The information and materials collected by the city will be stored on the server of the 58 same city and / or its affiliates, and all information and information are stored in China."}
{"task": "rw_51.jsonl", "id": 55258, "text": "At present, the products and services of 58 City will not involve the cross -border transmission of data. If our product \\ service changes, the cross -border transmission of data involves data, we will tell you separately in the way of pop -up or email.The purpose, receiver, etc., and obtain your authorization consent, we will ensure that the data receiver has sufficient data protection capabilities to protect your personal information.", "label": ["Data Retention", "Important", "Risk"], "rewrite": "If the cross -border transmission involved in data will be informed of the purpose of the data out of the country by pop -up or email, and the receiver will be obtained."}
{"task": "rw_51.jsonl", "id": 55259, "text": "We only retain your personal information within the minimum time limit required by your service and laws and regulations, and the personal information collected only under the browse function, such as browsing records, IP, information, our storage period will not exceed 1 onemoon.", "label": ["Data Retention", "Important"], "rewrite": "Keep your personal information only during the service period and the shortest time limit required by laws and regulations."}
{"task": "rw_51.jsonl", "id": 55260, "text": "For personal information beyond the deadline, we will immediately delete or do anonymous processing.", "label": ["Data Retention", "Important"], "rewrite": "For personal information beyond the deadline, we will immediately delete or do anonymous processing."}
{"task": "rw_51.jsonl", "id": 55261, "text": "(2) Information protection", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55262, "text": "In order to ensure your information security, we strive to take a variety of reasonable physical, electronics and management security measures to protect your information, so that your information will not be leaked, damaged or lostAccess control of storage and data centers.", "label": ["Important", "Data Security"], "rewrite": "In order to ensure information security, we strive to take various security measures to protect your information, including but not limited to SSL, information encryption storage, and data center access control."}
{"task": "rw_51.jsonl", "id": 55263, "text": "1. Data encryption: We encrypted and stored the user's username, mobile phone number, registered mailbox, and QQ number to ensure that the user's basic information will not be maliciously obtained;", "label": ["Important", "Data Security"], "rewrite": "The user's username, mobile phone number, registered email, and QQ number will be encrypted to ensure that the user's basic information will not be maliciously obtained."}
{"task": "rw_51.jsonl", "id": 55264, "text": "2. identity identity: We bind the verification code of the mobile phone by verifying account passwords or accounts to identify user identity legality to prevent non -authorized intervention;", "label": ["Important", "Data Security"], "rewrite": "By the verification code of the account password or account, the user identity legality is identified to prevent non -authorized intervention."}
{"task": "rw_51.jsonl", "id": 55265, "text": "3. Access control: We have also adopted strict management of employees or outsourcing staff who might contact you, including but not limited to adopting different authority control according to different positions, signing confidentiality agreements with them, monitoring their operations, etc.measure.", "label": ["Important", "Data Security"], "rewrite": "Strict management of employees or outsourcing personnel who may be exposed to information, including but not limited to adopting different authority control, signed confidentiality agreements, monitoring operations, etc. according to different posts."}
{"task": "rw_51.jsonl", "id": 55266, "text": "58 Tongcheng users can inquire and manage user information and resources after identify identity. Without identity identity, they cannot manage user resources;", "label": ["Important", "Data Security"], "rewrite": "Only after identifying the identity of the same city can they query and manage user information and resources. Without identity identity, they cannot manage user resources."}
{"task": "rw_51.jsonl", "id": 55267, "text": "4. Security audit: We sometimes access the risk control platform or certification platform to monitor some scenes or behaviors.", "label": ["Important", "Data Security"], "rewrite": "We sometimes access the risk control platform or certification platform to monitor some scenarios or behaviors."}
{"task": "rw_51.jsonl", "id": 55268, "text": "Such as the monitoring of abnormal behaviors such as account login and registration through traffic analysis.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55269, "text": "58 City will provide corresponding security measures according to existing technologies to protect your information and provide reasonable security guarantee. 58 City will try to make your information not be leaked, damaged or lost.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55270, "text": "5. Account protection: Your account has a security protection function. Please keep your account and password information properly.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55271, "text": "58 The city will ensure that your information is not lost and will not be abused and altered by backup security measures such as backup of other servers and encrypted user passwords.", "label": ["Important", "Data Security"], "rewrite": "58 The city will ensure that your information is not lost and will not be abused and altered by backup security measures such as backup of other servers and encrypted user passwords."}
{"task": "rw_51.jsonl", "id": 55272, "text": "Despite the aforementioned security measures, at the same time, please understand that due to the technical restrictions and various malicious means of malicious means, even if you do your best to strengthen security measures, there is no \"perfect security measure\" on the information network.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55273, "text": "Any legal consequences caused by the leakage of accounts and password information for your own reasons need to be responsible for you.", "label": ["Important", "Risk"], "rewrite": "Any legal consequences caused by the leakage of accounts and password information due to your own reasons need to be responsible for you."}
{"task": "rw_51.jsonl", "id": 55274, "text": "When using the 58 -city platform service for online transactions, if you inevitably disclose your personal information to the other party or potential transaction of the transaction (such as contact, contact method), please protect your personal information properly, only inProvide others in the necessary situation.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55275, "text": "If you find that your personal information has been leaked or there is a possibility of being leaked, and it may endanger your registered 58 city account security, or cause you other losses, please be sure to follow the privacy in the first time according to this privacy.The contact information mentioned in the policy is contacted with us so that we can take corresponding measures to maintain your 58 city account security to prevent the occurrence of loss or further expand.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55276, "text": "6. The Internet environment is not 100 % security. We will try our best to ensure or guarantee the security of any information you send to us.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55277, "text": "After unfortunately a personal information security incident, we will inform you in a timely manner in accordance with the requirements of the laws and regulations: the basic situation and possible impact of the security incident, the disposal measures we have taken or will take, you can independently prevent and reduce the risk of riskSuggestions, remedy measures, etc.", "label": ["Important", "Data Security"], "rewrite": "After the personal information security incident is unfortunate, we will inform them in a timely manner in accordance with the requirements of the laws and regulations: basic situations and possible impact, disposal measures, suggestions, remedy measures, etc."}
{"task": "rw_51.jsonl", "id": 55278, "text": "We will promptly inform you that the incident -related situation is informing the email, letter, telephone, push notification, etc. When it is difficult to inform the subject of personal information one by one, we will publish an announcement in a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "I will inform you in a timely manner that the incident -related situation is informing the email, letter, telephone, push notification, etc. When it is difficult to inform one by one, it will issue a reasonable and effective way to issue an announcement."}
{"task": "rw_51.jsonl", "id": 55279, "text": "7. The right to manage personal information", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55280, "text": "58 The same city attaches great importance to your attention to personal information and strives to protect your rights to access, correct, delete, and withdraw consent of your personal information, so that you have full ability to ensure your privacy and security.", "label": ["Important", "Edit/Control"], "rewrite": "58 Try to protect your personal information access, correction, delete, and withdrawal of consent to allow you to have full ability to ensure your privacy and security."}
{"task": "rw_51.jsonl", "id": 55281, "text": "Your rights include:", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55282, "text": "(1) Inquiry and correction of personal information", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55283, "text": "You have the right to access your personal information, except for the exception stipulated in laws and regulations.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55284, "text": "If you want to exercise the right to access, you can access it by yourself through the following ways:", "label": ["Edit/Control", "Important"], "rewrite": "If you want to exercise the right to access, you can access it by yourself through the following ways:"}
{"task": "rw_51.jsonl", "id": 55285, "text": "PC end:", "label": ["Important", "Edit/Control"], "rewrite": "You can access data through the PC."}
{"task": "rw_51.jsonl", "id": 55286, "text": "1. Your personal information: You can access and correct your account information through the \"Personal Center\" - \"Personal Information\" above the homepage of the same city;", "label": ["Important", "Edit/Control"], "rewrite": "You can access and correct your account information through \"Personal Center\" - \"Personal Information\" above the homepage of the same city."}
{"task": "rw_51.jsonl", "id": 55287, "text": "2. Your account security information: You can access and correct your authentication mobile phone, authentication mailbox, login password, QQ account, Weibo, WeChat account information about the \"personal center\" - \"account binding\" above the homepage of 58Items", "label": ["Important", "Edit/Control"], "rewrite": "You can access and correct your authentication mobile phone, authentication email, login password, QQ account, Weibo, WeChat account information through the \"Personal Center\" - \"Account Binding\" above the homepage of 58 City."}
{"task": "rw_51.jsonl", "id": 55288, "text": "3. Your resume: You can query, correct and delete through the \"personal center\" - \"my job search\" - \"My Resume\" above the homepage of the same city.", "label": ["Important", "Edit/Control"], "rewrite": "You can query, correct, and delete through the \"Personal Center\" - \"My Job Search\" - \"My Resume\" - \"My Resume\" above the homepage of 58."}
{"task": "rw_51.jsonl", "id": 55289, "text": "APP end:", "label": ["Edit/Control", "Important"], "rewrite": "You can access data through the app."}
{"task": "rw_51.jsonl", "id": 55290, "text": "1. You can use \"My\" -click the avatar in the upper left corner of the bottom page- \"Personal Information\" to access and change your personal information, account information, and certification information.", "label": ["Important", "Edit/Control"], "rewrite": "You can use the \"My\" -click the avatar in the upper left corner of the \"Personal Information\" access, change personal information, account information, and authentication information."}
{"task": "rw_51.jsonl", "id": 55291, "text": "2. Your resume: You can query, correct and delete through the homepage of the 58 City APP- \"Full-time Recruitment\"-\"My Resume\".", "label": ["Important", "Edit/Control"], "rewrite": "You can query, correct, and delete through the homepage of the 58 City APP- \"Full-time Recruitment\"-\"My\"-\"My Resume\"."}
{"task": "rw_51.jsonl", "id": 55292, "text": "(2) Delete of personal information", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55293, "text": "In addition to the information deleting and processing on the page of the above query and correction information, you can also \"my\" or \"set\" or \"clear cache\" in the upper right corner of the APP homepage.", "label": ["Important", "Edit/Control"], "rewrite": "You can also \"Settings\" in the upper right corner of the \"Settings\" or \"Cleaning Foot Trail\" or \"Cleaning Caches\" for information deletion under the upper right corner."}
{"task": "rw_51.jsonl", "id": 55294, "text": "In the following circumstances, you can make a request to delete personal information:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55295, "text": "1) If our behavior of handling personal information violates laws and regulations;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55296, "text": "2) If we collect and use your personal information, it has not obtained your consent;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55297, "text": "3) If our behavior of handling personal information violates your agreement;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55298, "text": "4) If we terminate our services and operations.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55299, "text": "(3) Change the scope of your authorization consent or withdraw your authorization", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55300, "text": "You can change/withdraw/withdrawn through the following path:, \"Personal Information\" content can be withdrawn by modifying the information you filled in;", "label": ["Important", "Edit/Control"], "rewrite": "\"Personal Information\" content can be withdrawn by modifying the information you filled."}
{"task": "rw_51.jsonl", "id": 55301, "text": "You can delete or modify the published post information to achieve the purpose of withdrawal authorization;", "label": ["Important", "Edit/Control"], "rewrite": "You can delete or modify the post information published to achieve the purpose of withdrawal authorization."}
{"task": "rw_51.jsonl", "id": 55302, "text": "You can also withdraw your service information through the path of \"My\"-\"Settings\"-\"Logging out\"-\"Delete the current application traces of the current application\".", "label": ["Important", "Edit/Control"], "rewrite": "You can also withdraw your service information through the path of \"My\"-\"Settings\"-\"Logging out\"-\"Delete the current application traces of the current application\"."}
{"task": "rw_51.jsonl", "id": 55303, "text": "You can change/withdraw the permissions through the following path: \"Mine\"-\"Settings\"-\"Privacy Management\"-\"Permanent Management\".", "label": ["Important", "Edit/Control"], "rewrite": "You can change/withdraw the permissions through the following path: \"Mine\"-\"Settings\"-\"Privacy Management\"-\"Permanent Management\"."}
{"task": "rw_51.jsonl", "id": 55304, "text": "(4) Sharing, transfer, and public disclosure of disclosure of personal information.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55305, "text": "According to the law, in the following circumstances, we shared, transferred, and publicly disclosed that your personal information does not need to obtain your authorization consent in advance:", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "In the following circumstances, we shared, transferred, and publicly disclosed your personal information without obtaining your authorization consent in advance:"}
{"task": "rw_51.jsonl", "id": 55306, "text": "1) Directly related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Personal information that is directly related to national security and national security and defense security does not need to obtain consent."}
{"task": "rw_51.jsonl", "id": 55307, "text": "2) Directly related to public safety, public health, and major public interests;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Personal information that is directly related to public safety, public health, and major public interests sharing, public information, no consent is required."}
{"task": "rw_51.jsonl", "id": 55308, "text": "3) Directly related to criminal investigation, prosecution, trial and judgment execution;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Direct related personal information such as sharing, public investigation, prosecution, trial, and judgment execution does not need to obtain consent."}
{"task": "rw_51.jsonl", "id": 55309, "text": "4) For major legitimate rights and interests such as the life and property of the subject of personal information or other individuals, it is difficult to get my consent;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Shared and publicly safeguarded major legitimate rights and interests, but it is difficult to get personal information that I agree, without requiring consent."}
{"task": "rw_51.jsonl", "id": 55310, "text": "5) Personal information that the subject of personal information disclose to the public by itself;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "The personal information of sharing and disclosure of personal information disclosure to the public does not need to obtain consent."}
{"task": "rw_51.jsonl", "id": 55311, "text": "6) Collect personal information from legal public information, such as legal news reports and government information disclosure.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "If you collect personal information from the legal disclosure information, you do not need to obtain consent."}
{"task": "rw_51.jsonl", "id": 55312, "text": "(5) Logging out the account", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55313, "text": "You can apply directly in our products or services to cancel the account.", "label": ["Important", "Edit/Control"], "rewrite": "You can apply directly in our products or services to cancel the account."}
{"task": "rw_51.jsonl", "id": 55314, "text": "For the way you cancel your account and the conditions you should meet, see the \"Logging out\" page for details.", "label": ["Important", "Edit/Control"], "rewrite": "For the way you cancel your account and the conditions you should meet, see the \"Logging out\" page for details."}
{"task": "rw_51.jsonl", "id": 55315, "text": "After you cancel your account, we will stop providing you with products and/or services, and in accordance with your requirements, in addition to other provisions of laws and regulations, we will delete your personal information.", "label": ["Data Retention", "Important", "Edit/Control"], "rewrite": "After canceling the account, we will stop providing you with products and/or services. In addition to other provisions of laws and regulations, we will delete your personal information."}
{"task": "rw_51.jsonl", "id": 55316, "text": "If you have any questions about the cancellation account, you can send an email to wuxianservice@58.com, and we will have special personnel to give back feedback.", "label": ["Important", "Contact Information"], "rewrite": "If you have any questions about the cancellation account, you can send an email to wuxianservice@58.com."}
{"task": "rw_51.jsonl", "id": 55317, "text": "Inquiry method of the \"Logging out account\" page: PC end: 58 \"Personal Center\" - \"Account Information\" - \"Logging out\" - \"Logging out\";", "label": ["Important", "Edit/Control"], "rewrite": "Inquiry method of the \"Logging out account\" page: PC end: 58 \"Personal Center\" - \"Account Information\" - \"Logging out\" - \"Logging out\" above the homepage of the same city."}
{"task": "rw_51.jsonl", "id": 55318, "text": "APP end: \"My\" -\"Settings\" - \"Account and Security\" - \"Logating out\" in the upper right corner.", "label": ["Important", "Edit/Control"], "rewrite": "APP end: \"My\" -\"Settings\" - \"Account and Security\" - \"Logating out\" in the upper right corner."}
{"task": "rw_51.jsonl", "id": 55319, "text": "(6) Get personal information copy", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55320, "text": "If you want to know the personal information of your personal information reserved on the 58th city platform, you can enter your personal information details page through the path of \"querying\" the personal information in the first paragraph of this article, and then copy the information by yourself.", "label": ["Important", "Edit/Control"], "rewrite": "If you want to know the copy of the personal information reserved on the 58th city platform, you can copy it by yourself through the path of \"querying\" the personal information mentioned in the first paragraph."}
{"task": "rw_51.jsonl", "id": 55321, "text": "(7) Responsive your above request", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55322, "text": "To ensure safety, you may need to provide a written request or prove your identity in other ways.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55323, "text": "We may ask you to verify your identity first, and then process your request.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55324, "text": "8. How do we deal with the personal information of minors", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55325, "text": "1. The city is mainly a living platform for life. Our services are mainly for adults (in principle, we are adults over 18 years old, we are over 16 years old, and we are regarded as adults with our own labor income as the main source of life).", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55326, "text": "2. If you are less than 16 years old or at the age of 16, but you cannot use your labor income as the main source of life, you do not meet the requirements of the 58 -cities APP for registered users. The 58 city app does not collect your personal information.", "label": ["Specific Audiences", "First Party Collection Information", "Important"], "rewrite": "If you are less than 16 or 16 years old, but you cannot use your labor income as the main source of life, it does not meet the requirements of the 58 -cities APP for registered users. The 58 City APP does not collect personal information."}
{"task": "rw_51.jsonl", "id": 55327, "text": "3. If you are not a minor who is the sixteen -year -old with your own labor income as the main source, you still need to use our products under the consent of the guardian and supervise.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are not a minor of the sixteen -year -olds with your own labor income as the main source, you still need to use our products under the consent of the guardian and supervise."}
{"task": "rw_51.jsonl", "id": 55328, "text": "If your guardian does not agree with your service, please immediately terminate our service.", "label": ["Specific Audiences", "Important"], "rewrite": "If your guardian does not agree with your service, please immediately terminate our service."}
{"task": "rw_51.jsonl", "id": 55329, "text": "If we find information about any minor, we will immediately delete and terminate services to you.", "label": ["Data Retention", "Specific Audiences", "Important"], "rewrite": "If we find information about any minor, we will immediately delete and terminate services to you."}
{"task": "rw_51.jsonl", "id": 55330, "text": "Nine, the update and notice of this privacy policy", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55331, "text": "Our privacy policy may change.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55332, "text": "Without your clear consent, we will not reduce the rights you should enjoy in accordance with this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55333, "text": "We will post any changes to this privacy policy on this page.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55334, "text": "For major changes, we will also provide more significant notifications (to explain in detail by updating this policy, pop -up window, page prompts, etc.).", "label": ["Policy Change", "Important"], "rewrite": "For major changes, we will also provide more significant notifications (to explain in detail by updating this policy, pop -up window, page prompts, etc.)."}
{"task": "rw_51.jsonl", "id": 55335, "text": "The major changes referred to this privacy policy include, but not limited to:", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55336, "text": "1. Make a major change in our service model.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55337, "text": "Such as the purpose of handling personal information, the type of personal information, the use of personal information, etc.;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55338, "text": "2. We have changed significantly in the aspects of ownership structure and organizational structure.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55339, "text": "Such as changes caused by business adjustments, bankruptcy mergers and acquisitions, etc.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55340, "text": "3. The main object of personal information sharing, transfer or public disclosure changes;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55341, "text": "4. The right to participate in personal information processing and its exercise methods have changed significantly;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55342, "text": "5. When we are responsible for handling the responsible departments, contact methods and complaint channels of personal information security;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55343, "text": "6. Personal information security impact assessment report shows that there is a high risk.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55344, "text": "In addition to registering on the 58 -city platform, you can check the latest version of the privacy policy, the PC side, you can check our latest version of the \"58 City Privacy Policy\" below the homepage of the city;", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55345, "text": "APP, you can view the latest version of \"58 City Privacy Policy\" in the \"My\"-\"Qualification Agreement\", and you can also view the complete \"58 City Privacy Policy\" in \"My-Settings-Privacy Management\".", "label": ["Important", "Edit/Control"], "rewrite": "You can view the latest version of \"58 City Privacy Policy\" in the \"Mine\"-\"Qualification Agreement\", and you can also view the complete \"58 City Privacy Policy\" in \"My-Settings-Privacy Management\"."}
{"task": "rw_51.jsonl", "id": 55346, "text": "Ten, how to contact us", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55347, "text": "If you have any questions about this privacy policy or your personal information is invaded when you use the service you provide, you can contact us through 4008135858 telephone, through the illegal information report phone below the homepage of the same city (www.58.com) homepage (www.58.com)Or send a special mailbox to the person in charge of personal information protection of 58 city: wuxianservice@58.com consultation.", "label": ["Important", "Contact Information"], "rewrite": "You can contact us through the 4008135858 telephone, report the phone number of illegal information reporting on the homepage of the 58 -city website (www.58.com), or send an email to the special email of 58 personal information protection person in the city: wuxianservice@58.com."}
{"task": "rw_51.jsonl", "id": 55348, "text": "We have set up a full -time department for personal information protection and will give you a reply as soon as possible.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55349, "text": "Under normal circumstances, we will reply within fifteen days (the national legal holidays are postponed).", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55350, "text": "Our contact address: Beijing Wuba Information Technology Co., Ltd., registered address: Room 301, 3rd floor of Dongsheng Science and Technology Park College, No. 18 Xueqing Road A, Xueqing Road, Haidian District, Beijing; Room 301;", "label": ["Important", "Contact Information"], "rewrite": "Our contact address: Beijing Wuba Information Technology Co., Ltd., registered address: Room 301, No. 3 Floor Park, No. 18 Zhongguancun University of Xueqing Road, Haidian District, Haidian District, Beijing."}
{"task": "rw_51.jsonl", "id": 55351, "text": "Common office address: Building 105, No. 105, Courtyard No. 105, Jiuxianqiao North Road, Chaoyang District, Beijing.", "label": ["Important", "Contact Information"], "rewrite": "Common office address: Building 105, No. 105, Courtyard No. 105, Jiuxianqiao North Road, Chaoyang District, Beijing."}
{"task": "rw_51.jsonl", "id": 55352, "text": "11. Dispute resolution", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55353, "text": "1. If you are not satisfied with our reply, especially our personal information processing behavior harms your legitimate rights and interests, you can also give feedback from the online information office and the industry and commerce regulatory authorities. Among themThe official website of the Information Report Center is: https://www.12377.cn.", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55354, "text": "2. For any controversy caused by our privacy policy and our personal information, either party may litter to the court where the defendant is located.", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55355, "text": "Click to view the previous version of \"58 Privacy Policy of the same city\"", "label": [], "rewrite": []}
{"task": "rw_51.jsonl", "id": 55356, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
