{"task": "rw_53.jsonl", "id": 55752, "text": "Baidu network disk privacy policy", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55753, "text": "Updated in this version: February 2, 2021", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55754, "text": "You are welcome to use Baidu web disk service!", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55755, "text": "Beijing Duyou Technology Co., Ltd. cherishes your trust to us when providing your personal information. We will process your personal information and ensure your information security in accordance with this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55756, "text": "introduction", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55757, "text": "Baidu network disk is an online information storage platform providing data storage, synchronization, management and sharing to the majority of users.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55758, "text": "To provide you with the above services, we will collect your necessary personal information. This privacy policy aims to help you understand the type of our personal information and how we use and protect your personal information. At the same time, we also introduce usFor privacy control functions, you can use these functions to control your personal information.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55759, "text": "Baidu network disk will not collect content data you store and share on the network disk, providing storage space for these content data only.", "label": ["Important", "First Party Collection Information"], "rewrite": "Baidu network disk will not collect content data you store and share on the network disk, providing storage space for these content data only."}
{"task": "rw_53.jsonl", "id": 55760, "text": "The personal information referred to in this privacy policy does not include the content data when you use network disk storage and sharing services.", "label": ["Important"], "rewrite": "The personal information referred to in this privacy policy does not include the content data when you use network disk storage and sharing services."}
{"task": "rw_53.jsonl", "id": 55761, "text": "This privacy policy is applicable to the Baidu network disk software development tool package (SDK) and application programming interface (API), applets, etc.Access and use our products and services.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55762, "text": "Please read this privacy policy carefully, and then use the Baidu network disk service after confirming and agreeing.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55763, "text": "This privacy policy will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55764, "text": "1. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55765, "text": "2. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55766, "text": "3. How can we entrust the processing, sharing, transfer, and publicly disclose your personal information and the third parties that the access to", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55767, "text": "4. How do we save and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55768, "text": "5. Your rights", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55769, "text": "6. How do we deal with the personal information of minors", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55770, "text": "7. How can your personal information be transferred globally", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55771, "text": "8. Revision of privacy policy", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55772, "text": "9. How to contact us", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55773, "text": "1. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55774, "text": "Personal information refers to the various information that can be recorded alone or with other information with other information or other information.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55775, "text": "According to the principles of legal, legitimate, and necessary, we only collect information necessary for the implementation of product functions.", "label": ["Important", "Data Security"], "rewrite": "According to the principles of legal, correctness, and necessary, only the necessary information of the product function is collected."}
{"task": "rw_53.jsonl", "id": 55776, "text": "(1) You directly provide personal information with our automatic collection", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55777, "text": "1. Baidu network disk business function", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55778, "text": "Baidu network disk business functions are divided into core business functions, additional business functions and services provided by third parties:", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55779, "text": "1) The core function of Baidu network disk is to realize the necessary functions of cloud storage and sharing, including file uploading, backup, management, downloading, and sharing.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55780, "text": "2) In addition, Baidu network disk also provides you with additional business functions, including intelligent classification, photo stories, picture retrieval based on storage photos, etc., to provide you with content malls for display, purchase and consumer services.Smart hardware device services provided you with data storage, data transmission, and data online for the hardware devices installed with smart operating systems.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55781, "text": "3) Baidu's network disk also connects to a rich third -party service, including the new and editing of the documents that users can use the services provided by the third party, use third -party services to beauty and beautify the pictures, and achieve photos cloud through third -party services through third -party services.Printing, etc., as well as third -party account login, sharing, message push and payment services connected by software development tool packs (SDK) forms.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55782, "text": "Third -party services will continue to be enriched to enrich your experience.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55783, "text": "You do not use third -party services will not affect your use of other business functions of Baidu's network disk.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55784, "text": "Please note that the processing of third -party service providers will apply for the privacy policy of the third -party service.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55785, "text": "2. The personal information of various functions of Baidu network disk needs to be collected and used", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55786, "text": "(1) Personal information involved in registering, logging in to Baidu network disk and related services", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55787, "text": "1) Baidu account registration information", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55788, "text": "You use Baidu web disk for file storage and sharing. You need to register and log in to Baidu Web Disk account.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55789, "text": "When registering Baidu's web disk account, you need to provide us with a mobile phone number at least;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect mobile phone number for registered accounts."}
{"task": "rw_53.jsonl", "id": 55790, "text": "You can also provide avatars, account names, mailboxes, creating account passwords, and secret information information to enrich your account information, protect your account security, and facilitate you to find your account.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect avatar, account name, mailbox, creating account password, and secret information information to protect account security."}
{"task": "rw_53.jsonl", "id": 55791, "text": "2) Third -party account login information", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55792, "text": "You can log in to Baidu web disk using third -party accounts (such as WeChat, Weibo, QQ).", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55793, "text": "At this time, you will authorize Baidu's online disk to read the public information (nickname, avatar, etc.) registered on the third -party account.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "Authorized Baidu Web Disk Read the public information (nickname, avatar, etc.) registered in the third -party account."}
{"task": "rw_53.jsonl", "id": 55794, "text": "The processing of your personal information will apply to the privacy policy of the third party.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55795, "text": "3) Participate in the contact information information of operation activities", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55796, "text": "Baidu's network disk will start operation activities for newly launched services and functions. If you participate in related operating activities, we will collect but not be limited to your identity information, contact information, trading account information (specifically operating activities with operational activities (specifically operating activities (specifically operating activitiesThe needs are subject to) to get in touch with you, issue operational rewards to you.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your identity information, contact information, and transaction account information (specifically the needs of operating activities) in order to get in touch with you."}
{"task": "rw_53.jsonl", "id": 55797, "text": "If you do not participate in related operating activities, you do not need to provide the aforementioned information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55798, "text": "During your participation in Baidu's network disk event, in order to avoid active cheating, there will be a very low frequency of user identity acquisition, and the secondary verification is performed through the equipment information/network status/machine numberUser's rights and interests.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect device information/network status/machine number for secondary verification."}
{"task": "rw_53.jsonl", "id": 55799, "text": "(2) Personal information involved in various business functions of Baidu network disk", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55800, "text": "1) Equipment and log information", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55801, "text": "Like most Internet services, our server will automatically record the requests you issued when visiting Baidu's network disk, such as the search keyword you entered, the playback duration of the audio/video playback function, the file size, the size of the file, the size of the file, the sizefile type.", "label": ["Important", "First Party Collection Information"], "rewrite": "It will automatically record the requests when accessing Baidu network disk, such as the search keyword you entered, the playback time, file size, and file type when you use the network disk audio/video playback function."}
{"task": "rw_53.jsonl", "id": 55802, "text": "The link address you share, your sharing link is recorded by others to open/download.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the link address you shared, your sharing link is opened/downloaded by others."}
{"task": "rw_53.jsonl", "id": 55803, "text": "You use Baidu web disk and content mall service when you use or purchase resource names, purchase records, browsing records, use records, your hardware equipment information (device model, unique device identifier, international mobile device identity code IMEI, network network, networkEquipment hardware address MAC, advertising identifier IDFA, device application installation list, etc.), version of the operating system, network operator information, date, time, duration of your access service, personal information collected by scene collection: DHCP information (may include: include:Local IP address, etc.), SSID list of scanning wireless LAN live, the wireless network SSID list of wireless networks configured by the user, the linked wireless network information (may include: MAC address, SSID, IP address, etc.).The basic information that the service must be collected.", "label": ["Important", "First Party Collection Information"], "rewrite": "Resource name, purchase records, browsing records, use records, your hardware equipment information (device model, unique device identifier, international mobile device identity code IMEI, network device hardware address MAC, advertising identifier IDFA, equipment application installation list, etc.), The version of the operating system, the information of the network operator, the date, time, and duration of your access service, the personal information collected by the scene: DHCP information (may include: local IP address, etc.), the SSID list of scanning wireless LAN living, usersThe configured wireless network SSID list, linked wireless network information (may include: MAC address, SSID, IP address, etc.). This kind of information is the basic information that the service must be collected."}
{"task": "rw_53.jsonl", "id": 55804, "text": "2) Order third -party product or service information", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55805, "text": "Logistics information, etc.).", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "You need to authorize us to obtain order information (order number, printed product and amount, address, logistics information, etc.) from the Yunchong Printing Service Provider)."}
{"task": "rw_53.jsonl", "id": 55806, "text": "3) Mobile address book, call records and text messages", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55807, "text": "Baidu network disk can help you back up your mobile phone address book, call records and text messages to avoid loss.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55808, "text": "The automatic backup function only needs to be realized in the case of mobile phone connection and login Baidu network disk. This function requires you to choose whether to open it by yourself, and the network conditions and file types that you choose to set up automatic backup.", "label": ["Important", "Edit/Control"], "rewrite": "The automatic backup function requires you to choose whether to open it by yourself, and the network conditions and file types that you choose to set up automatic backup."}
{"task": "rw_53.jsonl", "id": 55809, "text": "You can manage or delete the information that has been stored to the Baidu network disk cloud through Baidu Cloud Disk Web version.", "label": ["Important", "Edit/Control"], "rewrite": "You can manage or delete information that has been stored in the Baidu network disk cloud through the Baidu cloud disk page version."}
{"task": "rw_53.jsonl", "id": 55810, "text": "At the same time, you can also close the corresponding automatic backup function through \"My-> Backup-> SMS Backup/Communication Record Backup Backup\".", "label": ["Important", "Edit/Control"], "rewrite": "You can close the corresponding automatic backup function through \"My-> Backup-> SMS Backup/Communication Record Backup/Call Record Backup\"."}
{"task": "rw_53.jsonl", "id": 55811, "text": "After closing, unless you back up your backup, we will no longer read and synchronize your mobile phone address book, call records and SMS information.", "label": ["Important", "Edit/Control"], "rewrite": "After closing the authority, unless manual backup, it will no longer read and synchronize mobile phone address book, call records and SMS information."}
{"task": "rw_53.jsonl", "id": 55812, "text": "In addition, Baidu's network disk also applies to use your SMS right to use the function of mobile phones with the consent of your authorization.", "label": ["Permission Acquisition", "Important"], "rewrite": "Apply for your SMS right to use it for your mobile phone to recover the function with the consent of your authorization."}
{"task": "rw_53.jsonl", "id": 55813, "text": "(2) Provide you with richer product function experience", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55814, "text": "When you use Baidu web disk for file sharing, we will recommend friends who are often interacting with you according to the opening of the file link and download behavior log according to your sharing file link.", "label": ["Important", "Usage"], "rewrite": "When sharing files, you will recommend friends who often interact with you according to the opening of the file link and download behavior log according to your sharing file link."}
{"task": "rw_53.jsonl", "id": 55815, "text": "When you complete the installation of this product, you can choose whether to allow us to authorize us to obtain your GPS position permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "Select whether we allow us to authorize to obtain your GPS position permissions."}
{"task": "rw_53.jsonl", "id": 55816, "text": "If you agree that we can obtain your GPS position permissions, this permissions will only be used to start the background backup of the background and trigger the network disk process and perform automatic backup background backup services.", "label": ["Permission Acquisition", "Important"], "rewrite": "GPS position permissions are only used to open the background backup of the background and trigger the network disk process and perform automatic backup background backup services."}
{"task": "rw_53.jsonl", "id": 55817, "text": "Baidu network disk does not store and record your location and trajectory information, and will not be used as other purposes other than the above -mentioned services.", "label": ["Data Retention", "Important"], "rewrite": "Baidu network disk does not store and record your location and trajectory information."}
{"task": "rw_53.jsonl", "id": 55818, "text": "Refusing to provide location information will only make you unable to enjoy the above -mentioned services based on the above -mentioned services, not affect other functions of your normal use of this product.", "label": ["Important", "First Party Collection Information"], "rewrite": "Refusing to provide location information only makes you unable to enjoy position -based services, and will not affect your normal use of other functions."}
{"task": "rw_53.jsonl", "id": 55819, "text": "(3) Optimize the service and development of Baidu's network disk and develop new features", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55820, "text": "Baidu network disk will analyze the behavior data of the user group, so as to optimize services and develop new features for you.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55821, "text": "(4) Provide you with security guarantee", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55822, "text": "In order to improve the security of the products and services provided by our affiliated companies and partners, we may use your information for authentication, customer service, security precautions, fraud monitoring, credit analysis, etc. to prevent, discovery, and investigations.Fraud, safety, illegal or violation of our agreement, policies, or rules to protect the legitimate rights and interests of you, our other users, or we or related companies, partners, and the public.", "label": ["Important", "Usage"], "rewrite": "Use your information for authentication."}
{"task": "rw_53.jsonl", "id": 55823, "text": "(5) Provide you with intelligent services", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55824, "text": "In order to help you better find and manage pictures, Baidu's network disk relying on AI technology to classify the face, place and information information in your picture.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55825, "text": "You can also add labels (such as mothers, younger brothers, Xiaoming, etc.) to the face of your album, so that you can quickly find the pictures you need (such as input: Beijing, Sky, Brother, etc.).", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55826, "text": "We will use your picture training image recognition algorithm to improve the quality of the service. We will not store your picture information separately, nor will we use your picture outside of this scene.", "label": ["Data Retention", "Important", "Usage"], "rewrite": "Use your picture training image recognition algorithm to improve the quality of the service, you will not store your picture information alone, nor will you use your picture outside of this scene."}
{"task": "rw_53.jsonl", "id": 55827, "text": "If you need to close the human face classification function and story function, you can set it in [Mine-Settings-Privacy Settings-Intelligent Classified Face Group / Recognition Photos Automatically Generates Stories].Delete, the related functions of human face classification will not be available.", "label": ["Edit/Control", "Important"], "rewrite": "In [Mine-Settings-Privacy Settings-Intelligent Classification Face Group / Recognition Photos Automatically Generates Story] Close the Face Classification Function and Story Function. After the closure, the face label information of your labeled will be deleted, face classificationRelated functions will not be available."}
{"task": "rw_53.jsonl", "id": 55828, "text": "In the process of entering the Baidu network disk client and using the network disk external link/disk password/notes, in order to ensure that you can quickly perform the corresponding operation, the network disk will read your clipboard at the front desk to ensure that you can be normal normallyUse this function.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "During the process of using the network disk external chain/disk/notes, the network disk will read your clipboard at the front desk."}
{"task": "rw_53.jsonl", "id": 55829, "text": "When we want to use other purposes that the information is not stated in this privacy policy, we will solicit your consent in advance.", "label": ["Permission Acquisition", "Important"], "rewrite": "When the information is used for other purposes that are not stated in this privacy policy, you will solicit your consent in advance."}
{"task": "rw_53.jsonl", "id": 55830, "text": "(6) An exception of obtaining authorization in advance", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55831, "text": "Please note that in the following circumstances, collecting or using personal information does not need to obtain your authorization consent in advance:", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "In the following circumstances, collecting or using personal information does not need to obtain your authorization consent in advance:"}
{"task": "rw_53.jsonl", "id": 55832, "text": "1., directly related to national security and national defense security;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting and using personal information directly related to national security and national defense security does not need to obtain consent."}
{"task": "rw_53.jsonl", "id": 55833, "text": "2. It is directly related to public safety, public health, and major public interests;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Personal information that is directly related to the use of public safety, public health, and major public interests does not need to obtain consent."}
{"task": "rw_53.jsonl", "id": 55834, "text": "3. It is directly related to criminal investigation, prosecution, trial and judgment execution;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Direct related personal information such as collecting, using criminal investigation, prosecution, trial, and execution of judgments does not need to obtain consent."}
{"task": "rw_53.jsonl", "id": 55835, "text": "4. Out of maintaining major legitimate rights and interests such as life and property of you or other individuals, it is difficult to get my consent;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting and maintaining major legitimate rights and interests, but it is difficult to get personal information that I agree, no need to obtain consent."}
{"task": "rw_53.jsonl", "id": 55836, "text": "5. The collected personal information is made by your own public;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "The collected personal information is publicly disclosed to the public by itself and does not need to obtain consent."}
{"task": "rw_53.jsonl", "id": 55837, "text": "6. Collect personal information from the legal public information, such as legal news reports and government information disclosure;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If you collect personal information from the legal disclosure information, you do not need to obtain consent."}
{"task": "rw_53.jsonl", "id": 55838, "text": "7., sign and perform the contract according to your requirements;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting and signing and performing personal information necessary for the contract does not need to obtain consent."}
{"task": "rw_53.jsonl", "id": 55839, "text": "8. The safe and stable operation of the products or services provided by maintaining it, such as the failure of discovering and disposing of products or services;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting personal information necessary for the safe and stable operation of products or services, there is no need to obtain consent."}
{"task": "rw_53.jsonl", "id": 55840, "text": "9. What is necessary for carrying out legal news reports;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting the necessary personal information for legal news reports does not need to obtain consent."}
{"task": "rw_53.jsonl", "id": 55841, "text": "10. Due to the need to carry out statistics or academic research in public interests, and the results of academic research or descriptions, the personal information contained in the results is identified by", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting public interests to carry out the necessary personal information necessary for statistics or academic research, no need to obtain consent."}
{"task": "rw_53.jsonl", "id": 55842, "text": "11. Other circumstances stipulated in laws and regulations.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect personal information under other circumstances stipulated in the laws and regulations, without requiring consent."}
{"task": "rw_53.jsonl", "id": 55843, "text": "2. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55844, "text": "To ensure the normal operation of the website, we will store the small data files, cookies, and small data files on your computer or mobile device.", "label": ["Important", "First Party Collection Information"], "rewrite": "Small data files named Cookie on your computer or mobile device."}
{"task": "rw_53.jsonl", "id": 55845, "text": "Cookie usually contains identifiers, site names, and some numbers and characters.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55846, "text": "The main features of Cookie are convenient for you to use website products and services, as well as helping websites to count the number of independent visitors.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55847, "text": "Using cookie technology, we can provide you with more thoughtful user experience services and allow you to set your specific service options.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55848, "text": "When you use the Baidu network disk products and services, you will send cookies to your device.", "label": ["Important", "First Party Collection Information"], "rewrite": "Will send cookies to your device."}
{"task": "rw_53.jsonl", "id": 55849, "text": "When you interact with our services (such as advertising and/or promotion services, and the service functions provided by Baidu network disk on other websites), we allow Cookie (or other anonymous identifiers)Send to Duyou's server.", "label": ["Important", "First Party Collection Information"], "rewrite": "We allow Cookie (or other anonymous identifiers) to send to the server of Duyou."}
{"task": "rw_53.jsonl", "id": 55850, "text": "We will not use Cookie for any purpose except the purpose of this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55851, "text": "You can manage or delete according to your preferences, cookies.", "label": ["Important", "Edit/Control"], "rewrite": "You can manage or delete Cookie according to your preferences."}
{"task": "rw_53.jsonl", "id": 55852, "text": "For details, see aboutcookies.org.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55853, "text": "You can clear all the functions saved on the computer, cookies, and most of the network browsers have the functions of stopping, cookies.", "label": ["Important", "Edit/Control"], "rewrite": "You can remove all the cookies saved on the computer."}
{"task": "rw_53.jsonl", "id": 55854, "text": "But if you do this, you need to change the user settings when you visit our website, but you may not be able to log in or use the services or functions provided by Duyou company dependent on Cookie because of these modifications.", "label": ["Important", "Edit/Control"], "rewrite": "Cooking Cookie needs to change the user settings when accessing the website, but these modifications will cause it to be unable to log in or use related services or functions."}
{"task": "rw_53.jsonl", "id": 55855, "text": "You can use your browser settings to limit the use of Cookie.", "label": ["Edit/Control", "Important"], "rewrite": "You can use the browser settings to limit the use of Cookie."}
{"task": "rw_53.jsonl", "id": 55856, "text": "Take the Baidu browser as an example. In the \"browser settings\" of the drop -down menu at the top right of the Baidu browser, you can choose to clear your cookie through \"Privacy Settings -Clear Browse Data\".", "label": ["Important", "Edit/Control"], "rewrite": "In the Baidu browser's \"browser settings\", you can remove your cookies through \"Privacy Settings -Clear Browse Data\"."}
{"task": "rw_53.jsonl", "id": 55857, "text": "To learn more about how other browser changes the browser settings, please refer to the help center or other related functional guidance pages of the browser, such as:", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55858, "text": "https://support.google.com/chrome/search?", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55859, "text": "q=cookie ；", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55860, "text": "http://help.opera.com/opera/Windows/2393/en/controlPages.html#manageCookies。", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55861, "text": "3. How can we entrust the processing, sharing, transfer, and publicly disclose your personal information and the third parties that the access to", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55862, "text": "(1) Sharing", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55863, "text": "Unless you have authorized and agreed in advance, we will not share and transfer your personal information from third parties, except for being able to identify specific individuals after processing and cannot be restored.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Unless it is authorized in advance, it will not share and transfer personal information from third parties, except for processing that cannot be recognized by specific individuals and cannot be restored."}
{"task": "rw_53.jsonl", "id": 55864, "text": "1. In the following circumstances, after your authorization consent, we may share the personal information:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the following circumstances, after your authorization consent, we may share the personal information:"}
{"task": "rw_53.jsonl", "id": 55865, "text": "(1) Service platform or service provider.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55866, "text": "When you use the third -party service connected to the Baidu network disk, with the authorization of your authorization, we will provide the information necessary for the service to the third party, such as the documentation of the editor to provide the service party.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "With the consent of your authorization, we will provide the information necessary for the service to the third party."}
{"task": "rw_53.jsonl", "id": 55867, "text": "Your picture will be provided to the third party to complete the beautification function.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Your picture will be provided to the third party to complete the beautification function."}
{"task": "rw_53.jsonl", "id": 55868, "text": "You choose the photos of cloud printed, receiving information (address, contact information) to the service provider.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You choose the photos of cloud printed, receiving information (address, contact information) to the service provider."}
{"task": "rw_53.jsonl", "id": 55869, "text": "When you use smart hardware devices, the smart hardware devices you have licensed to log in will obtain your network disk file list, play address, and file information in order to display playback on your smart hardware device.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The smart hardware device you authorized to log in will obtain your network disk file list, played address, and file information in order to display the playback."}
{"task": "rw_53.jsonl", "id": 55870, "text": "(2) Advertising, consulting service providers/advertisers.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55871, "text": "Without your authorization, we will not share your personal information with advertising and consulting service providers.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Without authorization, your personal information will not be shared with advertising and consulting service providers."}
{"task": "rw_53.jsonl", "id": 55872, "text": "However, we may not identify your identity and cannot be restored by the receiving party, such as the user portrait of anonymous treatment, and share it with advertising or consulting service providers or advertisers to help them not identify your personal personal.Under the premise, increase the effective touch rate of advertising, and analyze our products and service usage.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Information that may not be recognized by processing and cannot be restored by the receiver may be shared with advertising or consulting service providers or advertisers."}
{"task": "rw_53.jsonl", "id": 55873, "text": "(3) Third -party SDK service provider.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55874, "text": "In order to ensure the services described by the purpose of this privacy policy, we may access the software development package (SDK) provided by a third party to achieve related functions to better improve customer service and user experience.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Software development packets (SDK) provided by third parties may be connected to achieve related functions."}
{"task": "rw_53.jsonl", "id": 55875, "text": "At this time, these third -party SDK service providers may represent your personal information on Baidu's network disk or one or more projects for one or more projects for this privacy policy.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Third -party SDK service providers may collect personal information on behalf of Baidu web disk or for the purpose of this privacy policy."}
{"task": "rw_53.jsonl", "id": 55876, "text": "At present, the third -party SDK we access mainly includes the following types:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The third -party SDK we access mainly includes the following types:"}
{"task": "rw_53.jsonl", "id": 55877, "text": "a., One -click login function: In order to provide you with an account login -one -click login function, third -party SDK service provider may obtain your necessary device information and network -related information;", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Third -party SDK service providers may obtain the necessary device information and network -related information for one -click login."}
{"task": "rw_53.jsonl", "id": 55878, "text": "b., Third -party account login function: In order to provide you with the function of third -party account login, third -party SDK service providers may obtain your necessary device information and network -related information;", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Third -party SDK service providers may obtain your necessary device information and network -related information for third -party login."}
{"task": "rw_53.jsonl", "id": 55879, "text": "c. Account security service: In order to ensure your account security, Baidu account SDK may collect your necessary device information, network -related information, log information, geographical location information to provide account security services;", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Baidu account SDK may collect your necessary device information, network -related information, log information, geographical location information to provide account security services."}
{"task": "rw_53.jsonl", "id": 55880, "text": "d., Message Push Service: To provide you with message push, third -party push service providers may obtain your necessary device information, mobile phone status information, network -related information to push the information that you may be more interested in;", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Third -party push service providers may obtain your necessary device information, mobile phone status information, and network -related information for push."}
{"task": "rw_53.jsonl", "id": 55881, "text": "e., payment service: In order to ensure that you can buy goods/services and virtual products on the platform smoothly, third -party payment service providers may collect your equipment information, network information, operator information to achieve smooth completion of payment and ensure payment security.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Third -party payment service providers may collect your equipment information, network information, and operator information for completing payment."}
{"task": "rw_53.jsonl", "id": 55882, "text": "f. Advertising related services, including advertising display, advertising statistics and monitoring, etc.;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55883, "text": "g. Product module performance optimization, including improving the ability of hardware distribution network, function heat repair, interactive analysis, network performance and network error monitoring, etc.;", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55884, "text": "h.,, a microphone -based voice technology related additional services: You can use the microphone to realize the voice service function provided by microphone after turning on the microphone, or to contact customer service or realize voice interaction with customer service robots, or use wallet borrowing for your identity when you use your wallet loan for your identityVerification, etc. In these functions, third -party SDKs may collect your recording content to identify or respond to your relevant needs.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "In microphone -based voice technology -related additional services, third -party SDKs may collect recording content to identify or respond to related needs."}
{"task": "rw_53.jsonl", "id": 55885, "text": "Please know, even if you have agreed to turn on the microphone rights, these third -party SDKs will only obtain voice information through the microphone when you actively click on the microphone icon or recorded video in your client.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "Even if you have agreed to turn on microphone rights, third -party SDK will only get voice information when you actively click on the microphone icon or recording video in your client."}
{"task": "rw_53.jsonl", "id": 55886, "text": "2. For companies, organizations and individuals that share personal information with us, we will investigate its data security environment, and sign a strict confidentiality agreement with them, asking themTry personal information with security measures.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will investigate the security environment of third parties and sign a strict confidentiality agreement with them."}
{"task": "rw_53.jsonl", "id": 55887, "text": "3. The information you actively share with others", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55888, "text": "In order to share the file sharing, we provide you with file sharing, file sharing, and friend sharing features in the network disk.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55889, "text": "You can share the required sharing ability according to your own demands. After sharing the file, you can also cancel the sharing according to your needs.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55890, "text": "(2) Transfer", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55891, "text": "We will not transfer your personal information to any company, organization and individual except the company, except the following situations: except:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You will not transfer your personal information to any company, organization and individual except the company, except the following situations: except:"}
{"task": "rw_53.jsonl", "id": 55892, "text": "1., get your clear authorization or consent in advance;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you get your clear authorization or consent in advance, you can transfer personal information."}
{"task": "rw_53.jsonl", "id": 55893, "text": "2., meet the requirements of laws and regulations, legal procedures or mandatory government requirements or judicial rulings;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you meet the requirements of laws and regulations, legal procedures, or mandatory government requirements or judicial rulings, personal information can be transferred."}
{"task": "rw_53.jsonl", "id": 55894, "text": "3. If we or our affiliated companies involve transactions such as mergers, separation, liquidation, assets or business acquisitions or sales, your personal information may be transferred as part of such transactions. We will ensure that such information is inThe confidentiality during the transfer, as much as possible to ensure that the new company holding your personal information and the organization will continue to be constrained by this privacy policy. Otherwise, we will ask the company and the organization to reconcile your authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Your personal information may be transferred as part of the acquisition or sale of the acquisition or sale of the merger, separation, settlement, asset or business, which will ensure the confidentiality of these information during the transfer and ensure that the new personal information processing subject continues to be affected by this privacy.The constraints of the policy, otherwise they will request them to re -solicit authorization consent."}
{"task": "rw_53.jsonl", "id": 55895, "text": "(3) Public disclosure", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55896, "text": "We will only publicly disclose your personal information in the following circumstances:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the following circumstances, you will publicly disclose your personal information:"}
{"task": "rw_53.jsonl", "id": 55897, "text": "1., get your clear consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you get your consent, you will disclose personal information."}
{"task": "rw_53.jsonl", "id": 55898, "text": "2. Under the requirements of laws and regulations, legal procedures, lawsuits or government authorities.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Personal information will be made public information based on laws and regulations, legal procedures, litigation or government authorities."}
{"task": "rw_53.jsonl", "id": 55899, "text": "(4) Sharing, transfer, and public disclosure of disclosure of personal information.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55900, "text": "In the following circumstances, sharing, transfer, and publicly disclose personal information without obtaining the authorization of the subject of personal information in advance:", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "In the following circumstances, sharing, transfer, and publicly disclose personal information without obtaining the authorization consent of the subject of personal information in advance:"}
{"task": "rw_53.jsonl", "id": 55901, "text": "1., directly related to national security and national defense security", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Personal information that is directly related to national security and national defense security is shared, and there is no need to ask for consent."}
{"task": "rw_53.jsonl", "id": 55902, "text": "2. It is directly related to public safety, public health, and major public interests;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Personal information that is directly related to public safety, public health, and major public interests sharing, public information, no consent is required."}
{"task": "rw_53.jsonl", "id": 55903, "text": "3. Directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Direct related personal information such as sharing, public investigation, prosecution, trial, and judgment execution does not need to solicit consent."}
{"task": "rw_53.jsonl", "id": 55904, "text": "4. For major legitimate rights and interests such as the main body of personal information or other individuals, but it is difficult to get my consent;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Shared and publicly safeguarded major legitimate rights and interests, but it is difficult to get personal information that I agree, without asking for consent."}
{"task": "rw_53.jsonl", "id": 55905, "text": "5. Personal information that the subject of personal information disclosure to the public by itself;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Personal information disclosed by the public information to the public does not need to ask for consent."}
{"task": "rw_53.jsonl", "id": 55906, "text": "6. Collect personal information from legal public information, such as legal news reports and government information disclosure.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "If you collect personal information from the legal disclosure information, you do not need to ask for consent."}
{"task": "rw_53.jsonl", "id": 55907, "text": "(5) The third-party software development kit (SDK) that we access", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55908, "text": "In order to adapt to different mobile phone devices, use Baidu network disk and third -party platform services to realize your mobile phone equipment identity authentication, mobile phone equipment security, receiving information push, log in to third -party platform accounts, share information through third -party platforms, and pay security.Baidu Web Disk APP is connected to a third -party SDK.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Baidu Web Disk APP is connected to a third -party SDK."}
{"task": "rw_53.jsonl", "id": 55909, "text": "The above -mentioned third -party SDK providers include mobile phone equipment manufacturers, social platforms, communication operators and third -party payment institutions.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The third -party SDK provider includes mobile phone equipment manufacturers, social platforms, communication operators and third -party payment institutions."}
{"task": "rw_53.jsonl", "id": 55910, "text": "Some third -party SDKs may call your device permissions and get your relevant information so that you can use the corresponding functions normally on different mobile phone devices or third -party platforms.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "Some third -party SDKs may call your device permissions and get your relevant information."}
{"task": "rw_53.jsonl", "id": 55911, "text": "Different third -party SDKs may have different types of equipment permissions and the information obtained. It may include getting your location information, reading/writing your external memory card, reading your mobile phone status and identity, viewing WLAN connection, retrieval, retrievalApplication/Bluetooth is running.", "label": ["First Party Collection Information", "Permission Acquisition"], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55912, "text": "Regarding the type of equipment permissions for third -party SDK, and how to collect and use your personal information, it is recommended that you refer to the relevant service agreement and privacy policy of the third -party SDK.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "Refer to the relevant service agreement and privacy policy of third -party SDK, and understand the device permissions types of the specific call of the third -party SDK."}
{"task": "rw_53.jsonl", "id": 55913, "text": "If you want to learn more about the third -party SDK of our access, please read the third -party SDK description.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55914, "text": "Description of the third -party SDK of Android", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55915, "text": "Instructions for the situation of third -party SDK of the iPhone", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55916, "text": "4. How do we save and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55917, "text": "(1) Save time limit", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55918, "text": "During your use of Baidu's network disk products and services, we will continue to save your personal information for you.", "label": ["Data Retention", "Important"], "rewrite": "During your use of Baidu's network disk products and services, we will continue to save your personal information for you."}
{"task": "rw_53.jsonl", "id": 55919, "text": "If you cancel your account or take the initiative to delete the above information, we will save your information within the time limit stipulated by laws and regulations such as network security law.", "label": ["Data Retention", "Important"], "rewrite": "If you cancel your account or actively delete the above information, you will save your information within the time limit specified in laws and regulations such as cyber security law."}
{"task": "rw_53.jsonl", "id": 55920, "text": "After you cancel your account or take the initiative to delete the above information, we will no longer commercialize your personal information.", "label": ["Important"], "rewrite": "After you cancel your account or take the initiative to delete the above information, you will no longer commercialize personal information."}
{"task": "rw_53.jsonl", "id": 55921, "text": "(2) Save area", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55922, "text": "Your personal information is stored in the People's Republic of China.", "label": ["Data Retention", "Important"], "rewrite": "Your personal information is stored in the People's Republic of China."}
{"task": "rw_53.jsonl", "id": 55923, "text": "If we need to transmit your personal information overseas, we will strictly implement the provisions of laws and regulations and ensure your personal information security.", "label": ["Data Retention", "Important"], "rewrite": "If you need to transmit personal information to overseas, you will be implemented strictly in accordance with the provisions of laws and regulations and ensure your personal information security."}
{"task": "rw_53.jsonl", "id": 55924, "text": "(3) Safety measures", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55925, "text": "1. We will collect, use, store, and transmit user information based on the mature security standards and specifications of the industry, and to inform you the purpose and scope of the relevant information through user agreements and privacy policies.", "label": ["Important", "Data Security"], "rewrite": "It will use the industry's mature security standards and standardized collection, use, storage, and transmission of user information, and inform the purpose and scope of the relevant information through user agreements and privacy policies."}
{"task": "rw_53.jsonl", "id": 55926, "text": "2. We attach great importance to information security.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55927, "text": "We have set up a specialized team responsible for research and development and application of multiple security technologies and procedures. We will conduct a security background review of the person in charge of safety management and key safety positions. We have established a comprehensive information security management system and internal security incident disposal mechanismwait.", "label": ["Important", "Data Security"], "rewrite": "The establishment of a specialized team is responsible for research and development and application of various security technologies and procedures, which will conduct a safety background review of the person in charge of safety management and key security positions, and establish a comprehensive information security management system and internal security incident disposal mechanism."}
{"task": "rw_53.jsonl", "id": 55928, "text": "We will adopt appropriate security measures and technical means to store and protect your personal information that meets industry standards to prevent your information from being lost, being interviewed, publicly disclosed, used, modified, damaged, lost or leaked.Essence", "label": ["Important", "Data Security"], "rewrite": "It will adopt appropriate security measures and technical means to store and protect your personal information."}
{"task": "rw_53.jsonl", "id": 55929, "text": "We will take all reasonable and feasible measures to protect your personal information.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55930, "text": "We will use encryption technology to ensure the confidentiality of the data;", "label": ["Important", "Data Security"], "rewrite": "We will use encryption technology to ensure the confidentiality of data."}
{"task": "rw_53.jsonl", "id": 55931, "text": "We will use a trusted protection mechanism to prevent data from being maliciously attacked.", "label": ["Important", "Data Security"], "rewrite": "We will use a trusted protection mechanism to prevent data from being maliciously attacked."}
{"task": "rw_53.jsonl", "id": 55932, "text": "3., we will conduct data security awareness training and assessment and assessment of security capabilities, and strengthen employees' awareness of protecting the importance of personal information.", "label": ["Important", "Data Security"], "rewrite": "The training and assessment of employees will be trained and assessment of data security consciousness."}
{"task": "rw_53.jsonl", "id": 55933, "text": "We will provide identity authentication and permissions for employees who handle personal information, and sign a confidentiality agreement with employees who are in contact with your personal information to clarify job responsibilities and code of conduct to ensure that only authorized personnel can access personal information.", "label": ["Important", "Data Security"], "rewrite": "Employees who handle personal information will perform identity authentication and authority control, and will sign a confidentiality agreement with employees who are in contact with your personal information."}
{"task": "rw_53.jsonl", "id": 55934, "text": "For illegal employees, we will hold legal responsibilities in accordance with Duyou's internal management system and relevant laws and regulations.", "label": ["Important", "Data Security"], "rewrite": "For illegal employees, legal responsibilities will be held in accordance with the internal management system of Duyou Company and relevant laws and regulations."}
{"task": "rw_53.jsonl", "id": 55935, "text": "4. We remind you that the Internet is not an absolute security environment. When you interact with other users through social software, you are not sure whether the transmission of information on the third -party software is completely encrypted. Please pay attention to ensure the security of your personal information. We recommend that you recommend your personal information. We recommend thatDon't send personal information in this way to avoid leakage of personal information.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55936, "text": "Please use complex passwords to help us guarantee your account and personal information security.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55937, "text": "5. We also ask you to understand that due to the technical restrictions and rapid development of the Internet industry, and various malicious attack methods that may exist, even if we can do our best to strengthen security measures, it is impossible to ensure 100 % security of information.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55938, "text": "Please understand that the system and communication network you used when using our products and/or services may have security problems in other links other than our control.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55939, "text": "6. According to our security management system, personal information leakage, damage or loss is listed as the most major security incident. Once it occurs, the company's highest -level emergency plan will be started.Multiple departments form a joint emergency response group treatment.", "label": ["Important", "Data Security"], "rewrite": "Personal information leakage, damage, or loss of incidents are listed as the most major security incidents. Once, it will start the company's highest -level emergency plan, which will form a joint emergency response team for multiple departments such as [Ministry of Security, Government Relations, and Legal Affairs]."}
{"task": "rw_53.jsonl", "id": 55940, "text": "(4) Notice of security incident", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55941, "text": "1. We will formulate emergency plans for cyber security incidents to deal with security risks such as system vulnerabilities, computer viruses, cyber attacks, and network invasion in a timely manner. When incidents that harm network security occur, we will immediately start the emergency plan and take corresponding remedial measures.And report to the relevant authorities in accordance with regulations.", "label": ["Important", "Data Security"], "rewrite": "The emergency plan for cyber security incidents will be formulated to deal with security risks in a timely manner. When incidents that endanger network security, emergency plans will be initiated immediately, corresponding remedial measures will be taken, and reports are reported to the relevant authorities in accordance with regulations."}
{"task": "rw_53.jsonl", "id": 55942, "text": "2. Personal information leakage, damage, and loss belong to the company -level super -large security incident. We will be responsible for regularly organizing working group members to conduct safety plan drills to prevent such security incidents from occurring.", "label": ["Important", "Data Security"], "rewrite": "Personal information leakage, damage, and loss belong to the company -level super -large security incidents. They will be responsible for regularly organizing working group members to conduct safety plan drills to prevent such security incidents from occurring."}
{"task": "rw_53.jsonl", "id": 55943, "text": "Once unfortunately, we will start emergency plans in accordance with the highest priority to form an emergency emergency group to trace the causes and reduce losses in the shortest time.", "label": ["Important", "Data Security"], "rewrite": "Once unfortunately occur, the emergency plan will be started in accordance with the highest priority, and an emergency group will be formed to trace the causes and reduce losses in the shortest time."}
{"task": "rw_53.jsonl", "id": 55944, "text": "3. After unfortunately a personal information security incident, we will inform you the basic situation and possible impact of the security incident in accordance with the requirements of the laws and regulations.Suggestions for risks, remedy measures, etc.", "label": ["Important", "Data Security"], "rewrite": "After unfortunately, the personal information security incident occurs, we will inform the basic situation and possible impacts, processing measures, suggestions, remedial measures, etc. in a timely manner in accordance with the requirements of laws and regulations."}
{"task": "rw_53.jsonl", "id": 55945, "text": "We will promptly inform you of the incident -related situation in the site notification, SMS notification, telephone or email, etc., and inform you that it is difficult to inform them one by one.", "label": ["Important", "Data Security"], "rewrite": "We will inform you in time, and it is difficult to inform you one by one. We will publish an announcement in a reasonable and effective way."}
{"task": "rw_53.jsonl", "id": 55946, "text": "At the same time, we will also actively report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "We will also take the initiative to report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities."}
{"task": "rw_53.jsonl", "id": 55947, "text": "5. Your rights", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55948, "text": "In accordance with China's relevant laws, regulations, standards, and the practice of other countries and regions, we guarantee that you exercise the following rights on your personal information:", "label": ["Important", "Edit/Control"], "rewrite": "We guarantee your right to exercise your personal information:"}
{"task": "rw_53.jsonl", "id": 55949, "text": "(1) Visit and change your personal information", "label": ["Edit/Control", "Important"], "rewrite": "You can access and change your personal information."}
{"task": "rw_53.jsonl", "id": 55950, "text": "You can access your personal information in the following ways:", "label": ["Important", "Edit/Control"], "rewrite": "You can access your personal information in the following way:"}
{"task": "rw_53.jsonl", "id": 55951, "text": "1. Visit and change account information:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55952, "text": "You can log in to passport.baidu.com to access and change your account information (including but not limited to mobile phone numbers, mailboxes, etc.).", "label": ["Important", "Edit/Control"], "rewrite": "You can log in to passport.baidu.com to access and change your account information (including but not limited to mobile phone numbers, mailboxes, etc.)."}
{"task": "rw_53.jsonl", "id": 55953, "text": "You can also perform the above operations through the [Mine -Settings -Account and Security] of the Baidu Web Disk.", "label": ["Important", "Edit/Control"], "rewrite": "You can access and change the information through the Baidu network disk [Mine -Settings -Account and Security]."}
{"task": "rw_53.jsonl", "id": 55954, "text": "When you find that we have an error about your personal information, you have the right to correct the error or incomplete information. After verifying your identity, you can correct it on your own on the Baidu network disk, or pass it through it throughFeedback and errors, etc., submit your correction application to us.", "label": ["Edit/Control", "Important"], "rewrite": "You have the right to correct the error or incomplete information, and you can correct it yourself or apply for correction."}
{"task": "rw_53.jsonl", "id": 55955, "text": "2. Access content mall usage information:", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55956, "text": "You can visit and use the resources you have purchased in the content mall at any time;", "label": ["Important", "Edit/Control"], "rewrite": "You can visit and use the resources you have purchased in the content mall at any time."}
{"task": "rw_53.jsonl", "id": 55957, "text": "You can check your order records in the content mall at any time.", "label": ["Important", "Edit/Control"], "rewrite": "You can check your order records in the content mall at any time."}
{"task": "rw_53.jsonl", "id": 55958, "text": "Path: After entering the network disk, click [Mine -Content Mall/Find Resource -Order Center] to check.", "label": ["Important", "Edit/Control"], "rewrite": "After entering the network disk, click [Mine -Content Mall/Find Resource -Order Center] View personal information."}
{"task": "rw_53.jsonl", "id": 55959, "text": "3. Visit smart device binding and display information:", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55960, "text": "You can visit the intelligent hardware equipment information bound by your Baidu Web Disk Account at any time, and manage the files displayed in it (addition, deletion and change).", "label": ["Important", "Edit/Control"], "rewrite": "You can visit the intelligent hardware equipment information bound to your Baidu Web Disk Account at any time, and manage the files displayed in it (addition, deletion and change)."}
{"task": "rw_53.jsonl", "id": 55961, "text": "You can also lift the binding operation on smart hardware devices.", "label": ["Important", "Edit/Control"], "rewrite": "You can also lift the binding operation on smart hardware devices."}
{"task": "rw_53.jsonl", "id": 55962, "text": "Path: [Mine] >> [Smart Hardware]", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55963, "text": "If you cannot access these personal information through the above way, you can use the mobile end: [My] >> [Help and Feedback] >> [I want to feedback], web: [More] >> [Question feedback] Contact usEssence", "label": ["Important", "Edit/Control"], "rewrite": "You can use the mobile end: [Mine] >> [Help and feedback] >> [I want to feedback], web: [More] >> [Question feedback] Contact us."}
{"task": "rw_53.jsonl", "id": 55964, "text": "(2) Change the scope of your authorization consent", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55965, "text": "You can give or take your authorization consent at any time.", "label": ["Important", "Edit/Control"], "rewrite": "You can give or take your authorization consent at any time."}
{"task": "rw_53.jsonl", "id": 55966, "text": "1. Log in to passport.baidu.com to relieve the binding relationship between Baidu account and third -party account.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55967, "text": "2. When you withdraw or authorize, we cannot continue to provide you with the service corresponding to the withdrawal consent or authorization, and we will no longer deal with your corresponding personal information.", "label": ["Important", "Edit/Control"], "rewrite": "After withdrawal consent or authorization, it is impossible to continue to provide corresponding services, nor do you process corresponding personal information."}
{"task": "rw_53.jsonl", "id": 55968, "text": "But your decision to withdraw consent or authorization will not affect personal information processing based on your consent or authorization before.", "label": ["Permission Acquisition", "Important", "Risk"], "rewrite": "The decision to withdraw consent or authorization will not affect personal information processing based on your consent or authorization before."}
{"task": "rw_53.jsonl", "id": 55969, "text": "(3) Delete your personal information", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55970, "text": "In the following circumstances, you can make a request to delete personal information to us. You can use the mobile terminal: [My] >> [Help and Feedback] >> [Product Suggestion], Web: [Feedback of Opinions] Contact us at any time at any timeThe", "label": ["Important", "Edit/Control"], "rewrite": "In the following situations, you can make a request to delete personal information. You can use the mobile end: [My] >> [Help and Feedback] >> [Product Suggestion], Web: [Feedback of Opinions] Contact us at any time:"}
{"task": "rw_53.jsonl", "id": 55971, "text": "1. If we violate laws and regulations or collect, use, share or transfer your personal information with others;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55972, "text": "2. If we violate the provisions of laws and regulations or to disclose your personal information with your agreement, you have the right to ask us to immediately stop the disclosed behavior and issue notifications to request the relevant receiver to delete the corresponding information.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55973, "text": "When you delete the information from our services, we may not immediately delete the corresponding information in the backup system, but will delete these information when the backup is updated.", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "After deleting information from our services, we may not immediately delete the corresponding information in the backup system, but will delete these information during the backup update."}
{"task": "rw_53.jsonl", "id": 55974, "text": "(4) Logging out your account", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55975, "text": "1. You can cancel the previously registered account at any time.", "label": ["Important", "Edit/Control"], "rewrite": "You can cancel the previously registered account at any time."}
{"task": "rw_53.jsonl", "id": 55976, "text": "You can log in to passport.baidu.com and cancel your Baidu account.", "label": ["Important", "Edit/Control"], "rewrite": "You can log in to passport.baidu.com and cancel your Baidu account."}
{"task": "rw_53.jsonl", "id": 55977, "text": "Path: You can click [Mine], click [Settings], click [Account Management], click [Account Emergency], click [Account Logging out] to cancel your account number.", "label": ["Important", "Edit/Control"], "rewrite": "You can click [Mine], click [Settings], click [Account Management], click [Account First Aid], click [Account Logging up], and cancel your account."}
{"task": "rw_53.jsonl", "id": 55978, "text": "Once you cancel the Baidu account, you will not be able to use Baidu's products and services that you need to log in to the account, so please do it carefully.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55979, "text": "In order to protect the legitimate rights and interests of you or others, we will determine whether it supports or allows your above requests to determine whether the use of various products and services of Duyou.", "label": ["Edit/Control", "Risk"], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55980, "text": "For example, if you have unsolved manuscript fees in Baidu's experience, or you have unprepared glutinous rice storage cards in Baidu Nuomi, or there are information in your network disk, we will not immediately support your request.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "If you have unsolved manuscript fees in Baidu's experience, or you have unprepared glutinous rice storage cards in Baidu Nuomi, or you still have information in your network disk, we will not immediately support your request."}
{"task": "rw_53.jsonl", "id": 55981, "text": "2. When you authorize to log in to the Baidu network disk through third -party accounts (such as WeChat, Weibo, QQ, etc.), you need to apply for a cancellation account with a third party.", "label": ["Important", "Edit/Control"], "rewrite": "When logging in to the Baidu network disk through a third -party account (such as WeChat, Weibo, QQ, etc.), you need to apply for a cancellation of the account from a third party."}
{"task": "rw_53.jsonl", "id": 55982, "text": "(5) Know the right of product and service in advance", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55983, "text": "Baidu network disk is willing to accompany you. If Baidu's network disk products and services are forced to stop operations for special reasons, we will send emails or other appropriate can reach you on the homepage of the product or service to reach youThe method notifys you and will stop collecting your personal information, and at the same time, you will delete or treat your personal information in accordance with the law.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "When stopping operation, you will notify you and will stop collecting your personal information, and at the same time, you will delete or treat your personal information."}
{"task": "rw_53.jsonl", "id": 55984, "text": "(6) In response to your above request", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55985, "text": "To ensure safety, you may need to provide a written request or prove your identity in other ways.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55986, "text": "We may ask you to verify your identity first, and then process your request.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55987, "text": "If you are not satisfied, you can also move through the Baidu network disk: [Mine] >> [Help and Feedback] >> [Product Suggestion], Web: [Feedback of Opinions] Contact us.", "label": ["Edit/Control", "Important"], "rewrite": "You can move through the Baidu network disk: [My] >> [Help and Feedback] >> [Product Suggestion], Web: [Feedback of Opinions] Contact us."}
{"task": "rw_53.jsonl", "id": 55988, "text": "For your reasonable requests, we do not charge fees in principle, but we will charge a certain cost fee as required for multiple repeated and more reasonable limit.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "For your reasonable requests, in principle, we do not charge fees, but we will charge a certain cost fee as required for multiple repeated and more reasonable requests."}
{"task": "rw_53.jsonl", "id": 55989, "text": "For those who have no repetition and need too much technical means (for example, need to develop new systems or fundamentally change the current practice), bring risks to others' legitimate rights and interests or very unrealistic (for example, information involved in backup tapes)We may refuse.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "We may refuse to reject those who have no repetition, need too much technical means, bring risks or very unrealistic requests to others."}
{"task": "rw_53.jsonl", "id": 55990, "text": "In the following circumstances, in accordance with the requirements of laws and regulations, we will not be able to respond to your request for corrections, delete, and cancel information:", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "In the following circumstances, in accordance with the requirements of laws and regulations, we will not be able to respond to your request for corrections, delete, and cancel information:"}
{"task": "rw_53.jsonl", "id": 55991, "text": "1., directly related to national security and national defense security;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "If personal information is directly related to national security and national defense security, the request cannot be responded."}
{"task": "rw_53.jsonl", "id": 55992, "text": "2. It is directly related to public safety, public health, and major public interests;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "If personal information is directly related to public safety, public health, and major public interests, the request cannot be responded."}
{"task": "rw_53.jsonl", "id": 55993, "text": "3. Directly related to criminal investigation, prosecution, trial, and execution judgment;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "If personal information is directly related to criminal investigation, prosecution, trial, and execution judgment, the request cannot be responded."}
{"task": "rw_53.jsonl", "id": 55994, "text": "4. We have sufficient evidence that you have subjective malice or abuse of rights (such as your request will endanger public safety and the legitimate rights and interests of others, or your request exceeds the scope of general technical means and commercial costs);", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "If there is sufficient evidence that you have subjective malicious or abuse of rights, you cannot respond to the request."}
{"task": "rw_53.jsonl", "id": 55995, "text": "5. In response to the request of the subject of personal information, the legitimate rights and interests of you or other individuals and organizations will be severely damaged;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "In response to the request of the subject of personal information, the legitimate rights and interests of you or other individuals and organizations are seriously damaged, and the request cannot be responded."}
{"task": "rw_53.jsonl", "id": 55996, "text": "6. Involving business secrets.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Those who involve business secrets cannot respond to requests."}
{"task": "rw_53.jsonl", "id": 55997, "text": "6. How do we deal with the personal information of minors", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55998, "text": "Duyou attaches great importance to the protection of minors' information.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 55999, "text": "For minors using Baidu's network disk products and services, we will take additional guarantee measures to protect their personal information.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 56000, "text": "Our products and services are mainly for adults. If you are a minor under the age of 14, before using Baidu's network disk products and services, you should carefully read this privacy policy under your parents or other guardians under the supervision and guidance.Essence", "label": ["Specific Audiences", "Important"], "rewrite": "Minors under the age of 14 should read this privacy policy carefully under the supervision and guidance of your parents or other guardians before using Baidu's network disk products and services."}
{"task": "rw_53.jsonl", "id": 56001, "text": "We will only collect, use, and publicly disclose juvenile personal information when they are permitted by law, parents or guardians are clearly agreed or protecting minors.", "label": ["Specific Audiences", "Important"], "rewrite": "It will only collect, use, and publicly disclose minors' personal information when they are permitted by law, parents or guardians."}
{"task": "rw_53.jsonl", "id": 56002, "text": "If we find that the personal information of minors is collected without the consent of parents who can be proven in advance, we will take measures to delete relevant information as soon as possible.", "label": ["Specific Audiences", "Important", "First Party Collection Information"], "rewrite": "If the personal information of minors is collected without the consent of the parents in advance, we will take measures to delete relevant information as soon as possible."}
{"task": "rw_53.jsonl", "id": 56003, "text": "If the guardian has reason to believe that we have collected the personal information of minors without the consent of the guardian, please via the mobile end: [Mine] >> [Help and Feedback] >> [Product Suggestion], Web:[Feedback of Opinions] Contact us, we will take measures to delete relevant data as soon as possible.", "label": ["Edit/Control", "Specific Audiences", "Important"], "rewrite": "Take measures to delete relevant data as soon as possible."}
{"task": "rw_53.jsonl", "id": 56004, "text": "7. How to cross -border transfer of your personal information", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 56005, "text": "The personal information we collected will be stored in China. If we involve cross -border, we will implement the data outbound security assessment and ensure your personal information security in accordance with the provisions of laws and regulations.", "label": ["Data Retention", "Important"], "rewrite": "The collected personal information will be stored in China. If we involve cross -border, we will implement the data outbound security assessment and ensure your personal information security in accordance with the provisions of laws and regulations."}
{"task": "rw_53.jsonl", "id": 56006, "text": "8. Revision of privacy policy", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 56007, "text": "Our privacy policy may change.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 56008, "text": "Without your clear consent, we will not reduce the rights you should enjoy in accordance with this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 56009, "text": "We will publish any changes to this privacy policy on this page. It is recommended that you check the latest version of the privacy policy in the state of the Internet.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 56010, "text": "For major changes, we will notify you in the main exposure page or in -site exposure pages or in -site letters or sending emails or other appropriate ways to reach you.", "label": ["Policy Change", "Important"], "rewrite": "On the main exposure page of the product or service, or send an email to you, or notify you in other appropriate ways to change major changes."}
{"task": "rw_53.jsonl", "id": 56011, "text": "If you do not agree that such changes can stop using Baidu network disk products and services, if you continue to use our products and/or services, it means that you agree to the restrictions of the privacy policy after the revised renovation.", "label": ["Policy Change", "Important", "Risk"], "rewrite": "If such changes do not agree, you can stop using products and services, and if you continue to use it, it means that you agree with the restrictions of the revised privacy policy."}
{"task": "rw_53.jsonl", "id": 56012, "text": "The major changes in this policy include, but not limited to:", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_53.jsonl", "id": 56013, "text": "1. Our service model has changed significantly.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_53.jsonl", "id": 56014, "text": "Such as the purpose of handling personal information, the type of personal information, the use of personal information, etc.;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_53.jsonl", "id": 56015, "text": "2. We have changed significantly in the aspects of ownership structure and organizational structure.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_53.jsonl", "id": 56016, "text": "Such as changes caused by business adjustments, bankruptcy mergers and acquisitions, etc.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_53.jsonl", "id": 56017, "text": "3. The main object of personal information sharing, transfer or public disclosure changes;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_53.jsonl", "id": 56018, "text": "4. The right to participate in personal information processing and its exercise methods have changed significantly;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_53.jsonl", "id": 56019, "text": "5. When we are responsible for handling the responsibility departments, contact methods and complaint channels of personal information security;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_53.jsonl", "id": 56020, "text": "6. Personal information security impact assessment report shows that there is a high risk.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_53.jsonl", "id": 56021, "text": "Nine, how to contact us", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 56022, "text": "You can contact us through user privacy complaint platform (http://help.baidu.com/personalinFormation).", "label": ["Important", "Contact Information"], "rewrite": "You can contact us through user privacy complaint platform (http://help.baidu.com/personalinformation)."}
{"task": "rw_53.jsonl", "id": 56023, "text": "Under normal circumstances, we will reply in [15].", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 56024, "text": "You can also contact us by contacting us as follows:", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 56025, "text": "No. 10, Shangdi Street, Haidian District, Beijing, China", "label": ["Important", "Contact Information"], "rewrite": "Contact address: No. 10 10th Street, Haidian District, Beijing, China."}
{"task": "rw_53.jsonl", "id": 56026, "text": "Beijing Duyou Technology Co., Ltd., Ministry of Justice", "label": ["Important", "Contact Information"], "rewrite": "Contact address: Ministry of Legal Affairs of Beijing Duyou Technology Co., Ltd.."}
{"task": "rw_53.jsonl", "id": 56027, "text": "Postal code: 100085", "label": ["Important", "Contact Information"], "rewrite": "Contact: Postal code 100085."}
{"task": "rw_53.jsonl", "id": 56028, "text": "In order to ensure our efficient handling of your problems and feedback to you in time, you need to submit identity proof, effective contact information and written requests and related evidence. We will deal with your request after verifying your identity", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 56029, "text": "If you are not satisfied with our response, especially if you think our personal information processing behavior harms your legitimate rights and interests, you can also seek solutions through the following external channels: a lawsuit with the [Beijing Haidian District People's Court].", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 56030, "text": "Attachment: term explanation", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 56031, "text": "1. Personal information refers to the various information that can be recorded alone or with other information to identify specific natural persons or reflects the activity of specific natural person activities alone or with other information.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 56032, "text": "Personal information includes names, date of birth, ID number, personal biometric information, address, communication and communication contact information, communication records and content, account password, property information, credit information, travel information, accommodation information, health and physiological information, transactions, transactions, transactionsInformation, etc.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 56033, "text": "2. Personal sensitive information refers to personal information that once leaked, illegally provided or abuses the security of people and property, which can easily lead to personal information that causes personal reputation, physical and mental health, or discriminatory treatment.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 56034, "text": "Personal sensitive information includes identity documents, personal biometric information, bank accounts, communication records and content, property information, credit information, travel information, accommodation information, health and physiological information, transaction information, under 14 years of age (inclusive) minorPersonal information, etc.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 56035, "text": "3. Devices refer to devices that can be used to use Baidu products and/or services, such as desktop devices, tablets or smartphones.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 56036, "text": "4. The unique device identifier refers to a device identifier with uniqueness (sometimes called universal ID or UUID).(For example, international mobile device identity code IMEI number, network device hardware address MAC).", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 56037, "text": "Different device identifiers will vary in the validity period, whether the user can reset, and the acquisition method.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 56038, "text": "The corresponding equipment may have multiple different device identifiers.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 56039, "text": "The only device identifier can be used for a variety of uses, including security and fraud detection, synchronous services (such as user email boxes), recording user preference settings, and providing correlation advertisements.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 56040, "text": "5.Cookie refers to a mechanism that supports the server (or script) to store and retrieve information on the client. By adding simple and persistent client status to expand the web client/server application.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 56041, "text": "The server sends a status information while returning the HTTP object to the client, and is stored by the client.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 56042, "text": "The state information shows the effective URL range in this state.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 56043, "text": "Since then, the HTTP request within this range initiated by the client will return the current value of the status information from the client to the server. This state information is called Cookie.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 56044, "text": "6. Anonymous labeling means that based on the equipment parameters, and by machine algorithm, Duyou produces a labeling symbol such as BaidUID and CUID to help Duyou company identify a user and provide it with better products and/or services and improve user experience.Essence", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 56045, "text": "7. Anonymous refers to the process that the personal information subject cannot be recognized by the technical processing of personal information, and the processing information cannot be restored.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 56046, "text": "The information obtained by personal information after anonymous processing does not belong to personal information.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 56047, "text": "8. Related companies refer to the list or collective name of the company's operator Beijing Duyou Technology Co., Ltd. (\"Duyou Company\") and other companies that have a relationship with Duyou Company.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 56048, "text": "\"Related relationship\" refers to the subject (including individuals, companies, partnerships, organizations, or other entities), that is, the subject that directly or indirectly controls, or the subject that controls it directly or indirectlyMaster controlled by the same subject.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 56049, "text": "The aforementioned \"control\" means that through holding voting rights, contracts or other methods, directly or indirectly have the power or other relationships that instructions or instructions that to instructions to make instructions by others.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 56050, "text": "Thank you again for your trust and use of Baidu web disk!", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 56051, "text": "Beijing Duyou Technology Co., Ltd.", "label": [], "rewrite": []}
{"task": "rw_53.jsonl", "id": 56052, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
