{"task": "rw_54.jsonl", "id": 56053, "text": "privacy policy", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56054, "text": "Important notes: The protection of the personal information of the object (or \"you\") is always valued. When you use the service and/or when you buy it, you may collect and use your personal informationEssence", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56055, "text": "To this end, the obtain service provider (or \"we\") explained to you through this \"Privacy Policy\" (hereinafter referred to as \"this policy\")How to collect, use, share, storage, and protect your personal information, and the way you can manage this information to you.", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56056, "text": "This policy is closely related to the services you use and the shopping of the objects. Before you start using our products and services, please read carefully and fully understand (minors should read with their guardians) This policy, Especially for the terms of bold and downline logos, you should focus on reading, and then start using it after confirmation and consent.", "label": ["Policy Change", "Important"], "rewrite": "Before using products and services, be sure to read it carefully and fully understand this policy, especially the clauses that are identified by the threatened and down line. You should focus on reading and start using it after confirming and agreeing."}
{"task": "rw_54.jsonl", "id": 56057, "text": "The professional vocabulary involved in this policy, we try to explain to you in a concise and popular expression in order to facilitate your understanding.", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56058, "text": "If you have any questions, opinions or suggestions on the content of this policy, you can get in touch with us through various contact information provided by the object.", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56059, "text": "This policy will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56060, "text": "1. Definition and application range", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56061, "text": "2. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56062, "text": "3. How do we use cookie and third -party services", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56063, "text": "4. How do we protect and save your personal information", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56064, "text": "5. Your personal information rights", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56065, "text": "6. How do we share, transfer, and publicly disclose your information", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56066, "text": "7. How do we handle the information of minors", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56067, "text": "8. How to update this policy", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56068, "text": "Nine, how to contact us", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56069, "text": "1. Definition and application range", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56070, "text": "(1) Definition", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56071, "text": "1. Refers to the website of the official website (domain name is Dewu.com) and the obtaining app, applet, and live broadcast.", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56072, "text": "2. Provider of gains service: Shanghai Installation Information Technology Co., Ltd. and its affiliated companies.", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56073, "text": "3. Personal information: refers to a variety of information that can be recorded alone or with other information to identify specific natural persons or reflects the activity of specific natural persons alone or with other information.", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56074, "text": "4. Personal sensitive information: Refers to personal information including ID number, personal biometric information, bank account number, property information, travel information, transaction information, below 14 years old (inclusive) children's information, etc. Personal sensitive information is identified by the thick body).", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56075, "text": "5. Children: Refers to minors under the age of 14.", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56076, "text": "6. System permissions: refers to the system permissions that are open to the APP and have the ability to collect personal information, referred to as system permissions or permissions for collecting personal information capabilities.", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56077, "text": "When you use some business functions of the obtained app, you authorize the system permissions that can be called by the obtaining app, including but not limited to: system album (if photos are stored in external storage devices, you will call photos information in external storage devices), camera information), camera, camera, and camera, Geographical location, microphone.", "label": ["Permission Acquisition", "Important"], "rewrite": "The system permissions that can be called by the obtained app for some business functions, including but not limited to: system album, camera, geographical location, microphone."}
{"task": "rw_54.jsonl", "id": 56078, "text": "The call of the system permissions will get your consent in advance. You can also set your system permissions in \"My-Settings-Privacy Settings-Permanent Management\" and choose to open or close.", "label": ["Important", "Edit/Control"], "rewrite": "The call of the system permissions will get your consent in advance. You can also set your system permissions in \"My-Settings-Privacy Settings-Permanent Management\" and choose to open or close."}
{"task": "rw_54.jsonl", "id": 56079, "text": "(2) Scope of application", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56080, "text": "This policy is applicable to the various products and services provided by you with new forms that appear with new forms with the development of objects, apps, applets, and new forms that appear with technology development.", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56081, "text": "If our affiliated company sets a privacy policy or personal information processing rules for the products or services it provides you, the corresponding product or service applies the corresponding privacy policy or personal information processing rules.", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56082, "text": "When you use the financial products/services provided/displayed on the objects, see the specific information collection and use rules for specific information collection and use.Information processing rules.", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56083, "text": "When you use the idle item transaction products/services provided/displayed on the object, see the specific information collection and use rules for specific information collection and use.\"95 -point Privacy Policy\".", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56084, "text": "Except for the relevant information collection and use activities described by this policy, this policy is not applicable to other services provided by other third -party entities on this platform. Other services are applicable to personal information collection and use rules such as privacy policies that they explain to you separately.Essence", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56085, "text": "2. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56086, "text": "When you use our products/services, the personal information we need/may need to collect and use includes the following:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56087, "text": "1. In order to realize the basic functions of providing you with our products and/or services, you must authorize us to collect and use the necessary information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56088, "text": "If you refuse to provide the corresponding information, you will not be able to use our products and/or services normally;", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide the corresponding information, you will not be able to use our products and/or services normally."}
{"task": "rw_54.jsonl", "id": 56089, "text": "2. In order to realize the additional functions of providing you with our products and/or services, you can choose to authorize the information we collect and use.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56090, "text": "If you refuse to provide it, you will not be able to use related additional functions normally or to achieve the functional effects we intend to achieve.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56091, "text": "We are here to remind you:", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56092, "text": "1. We are committed to creating a variety of products and services to meet your needs.", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56093, "text": "Because there are many types and services we provide to you, and there are differences in the scope of the specific product/service selected by different users, the basic/additional functions and the personal information types and scope of personal information are used.The product/service functions are prevailing;", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56094, "text": "2. In order to bring you better product and service experience, we continue to strive to improve our products, services and technology. As we may launch new or optimized functions from time to time, we may need to collect and use new individualsInformation or change of personal information usage purpose or method.", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56095, "text": "If the above situation occurs, we will explain it in detail to you by updating this policy, pop -up window, message push, page red dot prompts, etc., and provide you with the way of self -selection consent.Collect and use.", "label": ["Policy Change", "Important"], "rewrite": "If the change occurs, it will explain in detail to you, and provide you with the way you choose to consent, and start and use after you obtain your consent."}
{"task": "rw_54.jsonl", "id": 56096, "text": "In the process, if you have any questions, opinions or suggestions, you can contact us through the contact information of the end of this policy, and we will answer it as soon as possible.", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56097, "text": "The specific feature scenarios we will provide you include::", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56098, "text": "(1) Registration becomes our user and account use", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56099, "text": "1. Basic user service", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56100, "text": "We provide you based on the user account of the gain platform.", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56101, "text": "When you plan to register and use the obtaining APP, you need to provide us with your mobile phone number, mobile phone verification code or password to create a port account.", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to create a port account, you need to provide us with at least your mobile phone number, mobile phone verification code or password."}
{"task": "rw_54.jsonl", "id": 56102, "text": "If you refuse to provide the above information, you will not be able to register the property platform account, you can only use browsing and search services.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide the above information, you will not be able to register the platform account, you can only use browsing and search services."}
{"task": "rw_54.jsonl", "id": 56103, "text": "2. Additional user service", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56104, "text": "Additional user service: If you choose to provide non -registered personal information such as nicknames, avatars, gender, personal style, personal style, cities, constellations, schools, signatures, birthdays and days, we can provide you with such as improving recognition in the community, recognition, recognition, and recognition,The user's growth scores special user rights and more personalized user services based on your personal characteristics information.", "label": ["Important", "First Party Collection Information"], "rewrite": "If non -registered personal information is provided, you can provide more personalized user services."}
{"task": "rw_54.jsonl", "id": 56105, "text": "Among them, if you provide nicknames and avatars, your nicknames and avatars will be displayed publicly.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you provide nicknames and avatars, your nicknames and avatars will be displayed publicly."}
{"task": "rw_54.jsonl", "id": 56106, "text": "For example, in the product page, the object platform will publicly display the user avatars, nicknames, transaction prices, and transaction time of \"recent purchases\". To protect the user's personal information and privacy, the above information will be deductible.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56107, "text": "If you do not provide such non -personal information information, it will not affect your use of this product and related services.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you do not provide such non -personal information information, it will not affect your use of this product and related services."}
{"task": "rw_54.jsonl", "id": 56108, "text": "Authorized login: We may provide your account information (avatar, nickname, and other pages prompt information) to third parties after you agree, so that you can easily implement the registration/login of a third -party account.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "It may provide your account information (avatar, nickname, and other pages prompts) to third -party accounts after you have consent alone."}
{"task": "rw_54.jsonl", "id": 56109, "text": "In addition, we may obtain your third -party account information from third -party account information such as WeChat, Apple, Sina Weibo, Tiger Po, etc., and bind it with your objective platform account so that you can pass the first first.Log in to the three -party account and use our products and/or services.", "label": ["Important", "First Party Collection Information"], "rewrite": "You will obtain your third -party account information from a third party based on your individual consent."}
{"task": "rw_54.jsonl", "id": 56110, "text": "We will use your relevant information within the scope of your authorization.", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56111, "text": "You can choose to bind or unbind your third-party account through \"I-Settings-Account Security\".", "label": ["Important", "Edit/Control"], "rewrite": "You can choose to bind or unbind your third-party account through \"I-Settings-Account Security\"."}
{"task": "rw_54.jsonl", "id": 56112, "text": "3. Authentication", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56113, "text": "In order to meet the relevant laws and regulations and regulatory requirements, ensure the authenticity of the user's identity, and implement risk control such as anti -fraud, and ensure the security of the system and services, when you use specific services/functions, we need to collect your relevant information for identity verification, such as:User characters (such as sellers, anchors, creators), and other scenes of user roles (such as sellers, anchors, creators), and other scenarios based on special types of commodities or services, and other scenarios (including protecting minor rights and interests in accordance with the law, student zone, student zone,, student zones,, students areas, students areas, students areas, students areas, students areas, students areas, students areas, students areas, students' zones, students, and students areas, students areas, students areas, students areas, students areas, students areas, students,The need for user equity issuance, cracking down on telecommunications network fraud, and financial payment), you need to provide real -name or practical verification.", "label": ["Important", "First Party Collection Information"], "rewrite": "We need to collect your relevant information for authentication."}
{"task": "rw_54.jsonl", "id": 56114, "text": "In order to achieve verification purposes, you need to actively provide relevant authentic identity information (documents information, including names and documents;", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to achieve verification purposes, you need to actively provide related real identity information."}
{"task": "rw_54.jsonl", "id": 56115, "text": "Or facial recognition information may be different according to the actual situation, the page prompts are subject to), and the third parties that we or our cooperation passed the information verification through the national authoritative identity authentication agency, or authorized us to obtain you from Alipay to obtain you from the company to obtain you.The identity authentication results of the binding Alipay account are used for verification, registration, and other purpose of your identity and other user characters.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "You need to authorize us or third parties to conduct information verification through national authoritative identity authentication agencies, or authorize us to obtain the identity certification results information of Alipay accounts from Alipay."}
{"task": "rw_54.jsonl", "id": 56116, "text": "We will record, preserve verification information and verification results in accordance with the law. This information is for the purpose of completing the verification purpose, or the uses stipulated in other laws and regulations, and will not be used as other purposes without your authorization.", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56117, "text": "(2) Trading, order management, payment", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56118, "text": "1. When you buy goods and/or services:", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56119, "text": "(1), you need to provide at least your consignee's name, contact phone number and receipt address for express delivery and contact you to receive the goods;", "label": ["Important", "First Party Collection Information"], "rewrite": "You need to provide your consignee's name, contact phone number, and receiving address for express delivery and contacting you."}
{"task": "rw_54.jsonl", "id": 56120, "text": "For some special types of goods and services, you also need to provide other information necessary for the product or service. For example, you need to provide your ID number when involving overseas direct mail transactions to complete the customs clearance.", "label": ["Important", "First Party Collection Information"], "rewrite": "For some special types of goods and services, other information necessary for this product or service must be provided."}
{"task": "rw_54.jsonl", "id": 56121, "text": "(2) At the same time, the order will indicate the goods and/or service information you purchased, the specific order number, the time of order creation, the amount you should pay, and the payment method.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56122, "text": "We collect this information to help you successfully complete the transaction, ensure your transaction security, facilitate your inquiry of order information, provide customer service and after -sales service and other purposes that we clearly notify.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56123, "text": "(3), you can order goods and/or services for others through obtains. You need to provide the aforementioned personal information of the actual consignee and ensure that the actual consignee has obtained.", "label": ["Important", "First Party Collection Information"], "rewrite": "To order goods and/or services for others, you need to provide personal information of actual consignee and ensure that the actual consignee has obtained."}
{"task": "rw_54.jsonl", "id": 56124, "text": "(4) In order to facilitate your understanding, querying order information, and managing order information, we will collect the order information you generated during the use of our service to show you and facilitate the management of the order.", "label": ["Important", "First Party Collection Information"], "rewrite": "The order information generated during the service process is used to display and manage the order."}
{"task": "rw_54.jsonl", "id": 56125, "text": "You can view and manage your order information through \"My Buy\".", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56126, "text": "(5) When you are bound to your bank card, we need to collect your name, ID number, bank card number, and bank reserved mobile phone number, and give the third -party payment institution toYou can consume cards.", "label": ["Important", "First Party Collection Information"], "rewrite": "When binding a bank card, you need to collect your name, ID number, bank card number, and bank reserved mobile phone number."}
{"task": "rw_54.jsonl", "id": 56127, "text": "If you bind a credit card, we will also collect your card validity period and security code for credit card verification to ensure that you are consumption of card holding.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you bind a credit card, you will also collect your card validity period and security code for credit card identification."}
{"task": "rw_54.jsonl", "id": 56128, "text": "Among them, the validity period and security code of the card number are collected for third -party payment institutions to check the card issuer bank, and the obtains will not be stored.", "label": ["Data Retention", "Important"], "rewrite": "The validity period and security code of the card number and the security code are collected for third -party payment agencies to check the card issuer bank."}
{"task": "rw_54.jsonl", "id": 56129, "text": "Your name, ID number, bank card number, and bank reserved mobile phone numbers will be collected and stored to identify trading risks and ensure your financial security.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56130, "text": "(6) In order to complete the order payment, we will share the information related to order payment related information, order security related equipment information, and the necessary information required by other anti -money laundering laws to share with third -party payment companies.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will share order payment related information, order security related equipment information and other necessary information required by other anti -money laundering laws with third -party payment companies."}
{"task": "rw_54.jsonl", "id": 56131, "text": "If you choose to provide you with a payment service by other financial institutions, we will also share your bank card payment, which is valid for the bank card, and share the necessary information of bank card payment with the corresponding financial institutions you choose.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will share the necessary information of your bank card payment with the corresponding financial institutions you choose."}
{"task": "rw_54.jsonl", "id": 56132, "text": "(7) In order to allow us to learn and confirm your payment progress and status in a timely manner, and provide you with after -sales and dispute solutions, you agree that we can choose the transaction objects, Alipay, WeChat payment or other financial institutions you choose from the other financial institutions you choose.Collection and payment progress related information.", "label": ["Important", "First Party Collection Information"], "rewrite": "You need to agree that we can collect and pay the progress related information from other financial institutions you choose."}
{"task": "rw_54.jsonl", "id": 56133, "text": "(8) When you have a refund or compensation business, we need to collect your bank card information and third -party payment information, real names and total amount of product transactions for transfer and compensation for transfer;", "label": ["Important", "First Party Collection Information"], "rewrite": "You need to collect your bank card information and third -party payment information, real names, and total amount of product transactions for refund and compensation transfer."}
{"task": "rw_54.jsonl", "id": 56134, "text": "(9), we collect your evaluation information of the product under your voluntary premise and give others a reference.", "label": ["Important", "First Party Collection Information"], "rewrite": "We collect your evaluation information on the product under your voluntary premise and give others a reference."}
{"task": "rw_54.jsonl", "id": 56135, "text": "For height, weight, and size, you can choose to fill. If you do not provide the aforementioned information, it does not affect your service and functions.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you do not provide height, weight, and size information, it does not affect your service and functions."}
{"task": "rw_54.jsonl", "id": 56136, "text": "2. When you are selling products", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56137, "text": "(1), we need to collect your bank card information and third -party payment information for your payment of payment paid by the buyer and complete the transaction risk judgment;", "label": ["Important", "First Party Collection Information"], "rewrite": "You need to collect your bank card information and third -party payment information for your payment of payment paid by the buyer and complete the transaction risk judgment."}
{"task": "rw_54.jsonl", "id": 56138, "text": "(2), we need to collect your consignee's name, contact phone number, and the receiving address, so that you can receive the buyer or the platform to return the goods;", "label": ["Important", "First Party Collection Information"], "rewrite": "You need to collect your consignee's name, contact phone number, and delivery address in order to accept buyers or platforms."}
{"task": "rw_54.jsonl", "id": 56139, "text": "(3) When you have a refund, compensation, and withdrawal business, we need to collect your payment information and real names for refund or compensation for transfer;", "label": ["Important", "First Party Collection Information"], "rewrite": "You need to collect your payment information and real names for refund or compensation for transfer."}
{"task": "rw_54.jsonl", "id": 56140, "text": "(4) When you bid for the product, we will collect your selling product information and bid information, and calculate your estimated income for your reference.", "label": ["Important", "First Party Collection Information"], "rewrite": "Will collect your sales information and bid information, and calculate your estimated income for your reference."}
{"task": "rw_54.jsonl", "id": 56141, "text": "(3) Community function", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56142, "text": "1. When you use community functions, if you voluntarily fill in the information or release the content voluntarily, we will collect your uploaded videos, photos, posts, comments, praise, attention, sharing information, browsing and searching information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When using community functions, we will collect your uploaded videos, photos, posts, comments, praise, attention, sharing information, browsing and searching information."}
{"task": "rw_54.jsonl", "id": 56143, "text": "You can delete the videos, photos, posts and comments you posted at any time.", "label": ["Edit/Control", "Important"], "rewrite": "You can delete the videos, photos, posts and comments you posted at any time."}
{"task": "rw_54.jsonl", "id": 56144, "text": "2. We need to verify the legality compliance you posted in the community to avoid the situation that your publishing content involves illegal or violated the legitimate rights and interests of third parties.", "label": ["Important"], "rewrite": "You need to verify the legality compliance of your content in the community to avoid the situation where the content you posted involves illegal or violated the legitimate rights and interests of third parties."}
{"task": "rw_54.jsonl", "id": 56145, "text": "You agree to provide us with the graphic, text, videos and other contents published in the community for the above purpose, and will review the results of the above content after reviewing and marking the results of the above content.The above -mentioned service providers transmit or share your personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You agree that we will provide us with the graphic, text, videos and other content published in the community to our service providers for content review. We will not transmit or share your personal information to the above service providers."}
{"task": "rw_54.jsonl", "id": 56146, "text": "We will only review the content you posted, and you agree that we decide whether to publish or how to publish your graphic, videos and other content in the community based on the results of the review results.", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56147, "text": "3. The public information you posted when using community functions may involve your or other people's personal information or personal privacy information, such as pictures or videos that you choose to upload your personal information when sharing and comments.", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56148, "text": "You should be more careful to consider whether to disclose these information. At the same time, if the personal information involves the personal information of minors, you should obtain the consent of the guardian before the release.", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56149, "text": "(4) Business and activity information display and message push", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56150, "text": "1. Personalized recommendation service", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56151, "text": "In the process of using our service, in order to understand the product adaptability, provide you with pages displaying and search results that meet your needs, and push personalized recommendation services for you, we may collect your gender, birthday, obtaining objects on thingsThe operational behavior is stored and stored as a service log information, equipment and system information, of which:", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may collect your gender, birthday, operating behavior on obtained and stored as a service log information, equipment and system information for pushing personalized recommendation services."}
{"task": "rw_54.jsonl", "id": 56152, "text": "Equipment and system information include: we will receive and record the equipment hardware and system information you use based on your software installation and/or in use.Advertising identifier (MAC/IMEI/Android/IDFA/IDFV/Openudid/GUID/IMSI/FCUUID/DUID/UUID), device environment, mobile application list soft hardware characteristics information), system parameters, device location related information (including you where you are located (including you youThe authorized GPS position and WLAN access point, Bluetooth and base station sensor information).", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56153, "text": "Pay attention to sharing information, publish information, and IP address, access date and time.", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56154, "text": "At the same time, we strive to ensure your privacy experience through the following measures:", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56155, "text": "1. If you want to delete your browsing and search records, you can choose to delete in \"I-Footprint\" and \"Search Box-History Search\";", "label": ["Edit/Control", "Important"], "rewrite": "If you want to delete your browsing and search records, you can choose to delete in \"I-Footprint\" and \"Search Box-History Search\"."}
{"task": "rw_54.jsonl", "id": 56156, "text": "2. If you don't want to accept the commercial advertisement we send to you, you can reply or close the withdrawal or other ways we provided by the SMS prompt;", "label": ["Edit/Control", "Important"], "rewrite": "You can reply to the withdrawal or other ways we provide through the SMS prompt or close the commercial advertisement."}
{"task": "rw_54.jsonl", "id": 56157, "text": "3. If you need to check the sorting of your personal characteristics when using the site search service you provide, you can click \"Filter\" on the search results page, select the \"sales volume\", \"price\", \"new product\" in itset up;", "label": ["Important", "Edit/Control"], "rewrite": "You can click \"Filter\" on the search results page, and select the \"sales volume\", \"price\", and \"new product\" for settings to view sorting without personal characteristics."}
{"task": "rw_54.jsonl", "id": 56158, "text": "4. If you don't want to see the products, services, and content of the personalized recommendation for you, you can enter \"I-Settings-Privacy Settings-Learn and Manageed Personalized Recommendations\" through the APP or click \"Understand and manage personalitySettings in \"Recommended\" and selecting personalized recommendations, we will show you that products, services, and content that is not based on personalized factors.", "label": ["Edit/Control", "Usage", "Important"], "rewrite": "You can enter the \"I-Settings-Privacy Settings-Learn and Manage Personalized Recommendations\" or click the following \"Understanding and Manageed Personalized Recommendations\" to select settings, and choose to close personalized recommendations."}
{"task": "rw_54.jsonl", "id": 56159, "text": "(Learn and manage personalized recommendations)", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56160, "text": "2. Commercial information push and activity reminder service", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56161, "text": "In order to allow you to better understand and use things, you agree that we will send you business information and other activities reminders. The acquisition and its service providers will collect and use your name and contact information based on the above service purposes.", "label": ["Important", "First Party Collection Information"], "rewrite": "Get and its service providers will collect and use your name and contact information."}
{"task": "rw_54.jsonl", "id": 56162, "text": "If you don't want to receive our push messages, you can close the type of message you refused to receive through [Settings-Message Settings], or withdraw the booking function according to the prompt of the SMS content, we will stop pushing you the above message.", "label": ["Important", "Edit/Control"], "rewrite": "You can close the type of message you refused to receive through the [Settings-Message Settings], or the withdrawal function according to the prompt of the SMS content, we will stop pushing you the above message."}
{"task": "rw_54.jsonl", "id": 56163, "text": "If you turn off or withdraw the push function, you will not be able to obtain services for product or activity information push.", "label": ["Important", "Edit/Control"], "rewrite": "If you turn off or withdraw the push function, you will not be able to obtain services for product or activity information push."}
{"task": "rw_54.jsonl", "id": 56164, "text": "(5) Student identity certification", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56165, "text": "When you want to certify your student identity, enter our student area or participate in some of our preferential activities, we may collect your identity information so that we can verify your student identity. The specific information is as follows:", "label": ["Important", "First Party Collection Information"], "rewrite": "We may collect your identity information so that we can verify your student identity."}
{"task": "rw_54.jsonl", "id": 56166, "text": "Name, ID number, and personal facial biometric information are used to verify your identity;", "label": ["Important", "First Party Collection Information"], "rewrite": "The name, ID number, and personal facial biometric information will be collected for verification of identity."}
{"task": "rw_54.jsonl", "id": 56167, "text": "Student identity information, school names, academic qualifications, years of admission, academic system, and proved pictures in school are used to verify your student identity.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect students' identity information, school names, academic qualifications, admission years, school system, and pictures of school certifications for verification of identity."}
{"task": "rw_54.jsonl", "id": 56168, "text": "You know, if you refuse to provide the above information for us to verify your student identity, you cannot enter our student area and participate in some specific activities.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide the above information, you cannot enter our student area and participate in some specific activities."}
{"task": "rw_54.jsonl", "id": 56169, "text": "We only provide student certification services to students over 16 years old.", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56170, "text": "(6) Customer service and dispute handling", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56171, "text": "When you contact us or propose the application for pre -sale, after -sales, and dispute disputes, in order to ensure your account and system security, we need you to provide the necessary personal information to verify your identity.", "label": ["Important", "First Party Collection Information"], "rewrite": "You need to provide the necessary personal information to verify your identity."}
{"task": "rw_54.jsonl", "id": 56172, "text": "In order to facilitate the processing plan and results of helping you solve the problem or record related issues as soon as possible, we may preserve your communication, communication/call records and related content (including account information, order information, to prove the relevant related to related related to the relevantFor other information provided by the facts, or the contact information you leave), if you consult, complain or provide suggestions for specific orders, we will use your account information and order information.", "label": ["Important", "First Party Collection Information"], "rewrite": "You may collect your communication, communication/call records and related content. If you consult, complain or provide suggestions for specific orders, you will use your account information and order information."}
{"task": "rw_54.jsonl", "id": 56173, "text": "In order to provide reasonable needs of services and improve service quality, other information we may also use, including the relevant information you provided when you contact the customer service, the questionnaire answering information you sent to us during the questionnaire survey.", "label": ["Important", "Usage"], "rewrite": "May use the relevant information you provided when you contact the customer service, and you participate in the questionnaire reply information you sent during the questionnaire."}
{"task": "rw_54.jsonl", "id": 56174, "text": "(7) Risk control and safety management", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56175, "text": "In the process of using our service, in order to ensure the legitimate rights and interests of users, identify abnormal accounts and related services optimization, and prevent users from using brush machines, modifications, and use of third -party platforms or software illegal (such as code platforms, modification software, real people, real people,Package and other methods to conduct malicious operations. In order to improve the safety of your services to provide services with our affiliated companies and partners, protect the safety of personal property of you or other users or the public, and better prevent fishing websites and fraud., Safety risks such as network vulnerabilities, computer viruses, network attacks, and network invasion, and more accurately identify the cases of violating laws and regulations or related agreements and rules.Service log information, and may use or integrate your gain account information, transaction information, and our affiliate companies and partners to obtain information that you have authorized or shared according to law to comprehensively judge your accounts and transaction risks, authentication, testing, and testing and testing and testing.Prevent safety events, and take necessary records, audit, analysis, and disposal measures according to law.", "label": ["Important", "First Party Collection Information"], "rewrite": "Application SDK will collect equipment information, service log information, and may use or integrate your information, transaction information, and our affiliates and partners to obtain information that you authorize or sharing according to law."}
{"task": "rw_54.jsonl", "id": 56176, "text": "The only device identifier, device environment, mobile application list information, process information during operation, software and hardware feature information), system parameters, relevant information related to the location of the device (including the GPS location you authorted and the WLAN access point, Bluetooth, WIFI statusHe base station sensor information), MAC/IMEI/Android ID/IDFA/Openudid/GUID/IMSI), device CPU/ABI model, gyroscope, acceleration meter.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56177, "text": "Please understand that in order to dynamically detect whether your account is abnormal login, we may read again when you switch the object to the background to run or restart the program, and we will control the frequency of reading within a reasonable range.", "label": ["Important", "First Party Collection Information"], "rewrite": "Every time you switch the gain to the background run or restart the program, you may read again, and you will control the reading frequency within a reasonable range."}
{"task": "rw_54.jsonl", "id": 56178, "text": "Pay attention to sharing information, publish information, and IP address, access date and time.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will automatically collect and record your detailed usage situation as a service log, including browsing, clicking, searching, searching, collecting, trading, after -sales, following sharing information, publishing information, and IP addresses, access date and time."}
{"task": "rw_54.jsonl", "id": 56179, "text": "You pay attention: separate equipment information and service log information are information that cannot recognize specific natural person status.", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56180, "text": "If we use this type of non -personal information with other information to identify a specific natural person or use it with personal information, during the combination of use, such non -personal information will be regarded as personal information, except for obtaining your authorization.Or in addition to laws and regulations, we will anonymous and de -identify such information.", "label": ["Important", "Data Security"], "rewrite": "In addition to obtaining other provisions of your authorization or laws and regulations, we will anonymous personal information and de -identifiable processing."}
{"task": "rw_54.jsonl", "id": 56181, "text": "(8) Sensor application scenario statement", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56182, "text": "Sensor name Applicable Scenes Purifier", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56183, "text": "Acceleration sensor products purchase page, take pictures, scan the authenticity control camera focus", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56184, "text": "Acceleration sensor camera ICON follows the mobile phone horizontal vertical screen rotation to detect the screen direction to achieve horizontal vertical screen switching", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56185, "text": "Acceleration sensor \"shake\" and \"shake\" and other interactive or activities that depend on the development of action to show you interactive scenes or judge whether to participate in the activity", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56186, "text": "Magnetic field sensor, gravity sensor user punch card, sign in the image of enlistment of gravity effects", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56187, "text": "Walker recorder record daily movement step records of the number of sports steps", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56188, "text": "Gravity sensor raffle activity is re -painted according to gravity effects", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56189, "text": "Gyro, acceleration sensor safety, risk control scene judgment equipment environment, determine whether it is normal equipment, prevent black production and external malicious attacks", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56190, "text": "(9) Additional services based on system permissions", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56191, "text": "We provide you with the following authorities that may be able to collect and process your personal information by opening up and process your personal information. If you do not agree to start the relevant permissions, it will not affect the basic services you use, but you may not get these additional servicesThe user experience brought by you.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you do not agree to start the relevant authority, it will not affect your basic services, but you may not be able to obtain the user experience brought by these additional services."}
{"task": "rw_54.jsonl", "id": 56192, "text": "Your equipment system permissions will not be turned on by default. When you use the corresponding business functions or actively trigger the corresponding business functions, we will synchronize the application permissions and collect personal information in the form of pop -up prompts.Open.", "label": ["Permission Acquisition", "Important"], "rewrite": "The equipment system permissions will not be turned on by default. When you use or actively trigger the corresponding business functions, you will synchronize the application permissions and collect personal information in a pop -up prompt to collect your consent."}
{"task": "rw_54.jsonl", "id": 56193, "text": "You can view the state of each system permissions in your device \"setting\" or our client \"I-Settings-Privacy Settings-Personal Information and Permanent-Permanent Management\", and you can determine that these permissions will be turned on or closed at any time.", "label": ["Important", "Edit/Control"], "rewrite": "You can view the state of each system permissions in your device \"setting\" or our client \"I-Settings-Privacy Settings-Personal Information and Permanent-Permanent Management\", and you can determine that these permissions will be turned on or closed at any time."}
{"task": "rw_54.jsonl", "id": 56194, "text": "You can click \"Instructions for the Application and Usage\" here to view and understand the application and usage of the property rights.", "label": ["Important", "Edit/Control"], "rewrite": "You can click \"Instructions for the Application and Usage\" here to view and understand the application and usage of the property rights."}
{"task": "rw_54.jsonl", "id": 56195, "text": "(10) Other additional services provided for you", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56196, "text": "In order to provide you with more convenient, better, personalized products and/or services, and strive to improve your experience, we may collect and use your personal information in the following additional services provided to you.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may collect and use your personal information in the following additional services provided by you."}
{"task": "rw_54.jsonl", "id": 56197, "text": "If you do not provide this information, it will not affect basic services such as browsing, searching, and trading of your acquisition, but you may not be able to get the user experience brought by these additional services to you.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you do not provide this information, it will not affect the basic services you use, but you may not be able to obtain the user experience brought by these additional services to you."}
{"task": "rw_54.jsonl", "id": 56198, "text": "These additional services include:", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56199, "text": "1. When you are worth the currency, if you use an Apple phone, we will collect your Appleid.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you are worthy of money, if you use Apple mobile phones, we will collect your Appleid."}
{"task": "rw_54.jsonl", "id": 56200, "text": "At the same time, we will collect your payment information to save your transaction records.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect your payment information to save your transaction records."}
{"task": "rw_54.jsonl", "id": 56201, "text": "2. Additional service based on the shear plate: Every time you open the object, we will detect your shear plate. If you find that you copy or password of the obtained object before opening the object, we will automatically open it automaticallyCorresponding links or sharing content to help you access related content on gains.", "label": ["Important", "First Party Collection Information"], "rewrite": "When opening the object, you will detect your shear plate. If you find that you copy or password of the obtained object before opening the object, we will automatically open the corresponding link or share content."}
{"task": "rw_54.jsonl", "id": 56202, "text": "When you use the scenario restore function, you want to enter the specific page of the obtained object by copying the specified password, then you need to read the content of your shear board to provide you with the scene restore function.", "label": ["Important", "First Party Collection Information"], "rewrite": "You need to read the contents of your cut plate to provide you with the scene restore function."}
{"task": "rw_54.jsonl", "id": 56203, "text": "When you use the sharing function, we will write the link or password into the shear plate to help you achieve the sharing function quickly.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will write links or passwords into shear plates for the sharing function."}
{"task": "rw_54.jsonl", "id": 56204, "text": "When you use the copy and paste function in the search box, there is an behavior of reading and uploading the shear information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the copy and paste function in the search box, there is an behavior of reading and uploading the shear information."}
{"task": "rw_54.jsonl", "id": 56205, "text": "You should know that although your shear plate content may involve your personal information, it will not collect information other than the password content required for the password required for you to provide you.", "label": ["Important", "First Party Collection Information"], "rewrite": "Get things will not collect information other than the password content required for the scene restore function."}
{"task": "rw_54.jsonl", "id": 56206, "text": "3. The public information posted when you use the service function of the service functions and the discrimination service may involve your personal information or personal sensitive information of you or others, such as pictures or videos that you choose to upload personal information uploaded when sharing and comments.", "label": ["Third Party Sharing/ Disclosure", "Risk"], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56207, "text": "You should be more careful to consider whether to disclose these information. At the same time, if the personal information involves the personal information of minors, you should obtain the consent of the guardian before the release.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You should be more careful to consider whether to disclose sensitive personal information or personal information of others. At the same time, if you involve personal information of minors, you should obtain the consent of the guardian before release."}
{"task": "rw_54.jsonl", "id": 56208, "text": "4. When you participate in the lottery or marketing activities, we may need to collect your name, mobile phone number, and receiving address in order to receive the corresponding event prizes or complete the event participation.", "label": ["Important", "First Party Collection Information"], "rewrite": "You may need to collect your name, mobile phone number, and receiving address so that you can receive the corresponding event prizes or complete the event participation."}
{"task": "rw_54.jsonl", "id": 56209, "text": "If the corresponding prizes are provided by a third party, we may need to share your above -mentioned personal information with the third party so that you can receive the event prizes or complete the event participation.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may need to share your personal information with the third party in order to receive event prizes or complete the event participation."}
{"task": "rw_54.jsonl", "id": 56210, "text": "If you refuse to provide the above personal information, you may not be able to get the corresponding prizes or complete the event participation.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide personal information, you may not be able to get the corresponding prizes or complete the event participation."}
{"task": "rw_54.jsonl", "id": 56211, "text": "5. When you use the \"Gravity\" business block of the object platform, and the service of transaction pictures, video production and other services with the creator of the object platform, if you voluntarily fill in the information or publish the content voluntarily, we will collect you through it throughThe task released by the object platform and the information related to the creator reached service orders.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect information about your tasks published by the material platform and reach service orders related to the creator."}
{"task": "rw_54.jsonl", "id": 56212, "text": "In order to meet your service fees based on the aforementioned service (such as paying the purchase service fee to the creator, paying the technical service fee to the platform), we may collect your third -party payment account and bank account information during the payment process.", "label": ["Important", "First Party Collection Information"], "rewrite": "During the payment process, we may collect your third -party payment account and bank account information."}
{"task": "rw_54.jsonl", "id": 56213, "text": "When you are the creator and register the previous creative task, we will collect your registration information (nickname, gender, region, homepage QR code);", "label": ["Important", "First Party Collection Information"], "rewrite": "When you register the previous creative tasks, we will collect your registration information (nickname, gender, region, homepage QR code)."}
{"task": "rw_54.jsonl", "id": 56214, "text": "Based on your registration task, we will provide your registration information to the merchants registered in accordance with your authorization consent and use it for merchants to confirm cooperation with you.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will provide your registration information to the merchants registered in accordance with your authorization consent and use it for merchants to confirm cooperation with you."}
{"task": "rw_54.jsonl", "id": 56215, "text": "In addition, according to your authorization consent, we will provide your delivery address information to the merchants registered for you to send you the material required for the creation.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "According to your authorization consent, you will provide your delivery address information to the merchants you register for you to send you the material required for the creation."}
{"task": "rw_54.jsonl", "id": 56216, "text": "6. When you use the \"store appointment\" function of the objective platform, we will collect and use your nickname and register your mobile phone number for appointment registration.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect and use your nickname and register mobile phone number to make appointments."}
{"task": "rw_54.jsonl", "id": 56217, "text": "(10) Other rules for collecting and using personal information", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56218, "text": "1. If the information you provide contains personal information of other users, you need to ensure that you have obtained legitimate authorization before providing these personal information to the object.", "label": ["Important", "First Party Collection Information"], "rewrite": "If the information you provide contains personal information of other users, you need to ensure that you have obtained legal authorization before providing."}
{"task": "rw_54.jsonl", "id": 56219, "text": "2. If we use information for other purposes that are not stated in this policy, or use information collected based on specific purposes for other purposes, we will get your consent in advance.", "label": ["Important", "First Party Collection Information"], "rewrite": "If the information is used for other purposes that are not stated in this policy or for other purposes, you will get your consent in advance."}
{"task": "rw_54.jsonl", "id": 56220, "text": "If you choose not to provide the aforementioned information, you may not be able to use a function or service, but it does not affect other services you provide.", "label": ["Important", "First Party Collection Information"], "rewrite": "If the aforementioned information is not provided, a certain function or service may not be used, but other services are not affected."}
{"task": "rw_54.jsonl", "id": 56221, "text": "3. If we obtain your information indirectly from the third party, we will clearly request the third party to explain the source of their personal information in writing before collecting, and whether it has collected, processed, and provides us with your personal information to obtainYour legal authorization.", "label": ["Important", "First Party Collection Information"], "rewrite": "If information is obtained indirectly from the third party, it will clearly request the third party to explain its personal information sources in writing before collecting, and whether it collects, processes, and provide personal information to obtain legal authorization."}
{"task": "rw_54.jsonl", "id": 56222, "text": "In addition to the situation that the law is clearly allowed, we will only collect your personal information from a third party after confirming that the third party has obtained your authorization consent.You can process your personal information after your own consent.", "label": ["Important", "First Party Collection Information"], "rewrite": "If the scope of third parties authorized cannot cover the purpose of processing and use, it will be required to process personal information by itself or request the third party to obtain consent."}
{"task": "rw_54.jsonl", "id": 56223, "text": "At the same time, our professional security team will strengthen personal information (including sensitive information reporting, sensitive information encryption storage, access permissions control, etc.).", "label": ["Important", "Data Security"], "rewrite": "Professional security teams carry out security reinforcement (including sensitive information reporting, sensitive information encryption storage, access permissions control, etc.)."}
{"task": "rw_54.jsonl", "id": 56224, "text": "We will use more than our personal information obtained from our personal information that are the same protection means and measures that are the same protection means and measures.", "label": ["Important", "Data Security"], "rewrite": "It will not be ordered to protect the personal information obtained indirectly than our personal information and measures that are not lower than our personal information."}
{"task": "rw_54.jsonl", "id": 56225, "text": "4. Exception of obtaining authorization consent", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56226, "text": "According to relevant laws and regulations and national standards, in the following circumstances, we collect or use your relevant personal information without asking your authorization consent:", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "In the following circumstances, we collect and use your relevant personal information without asking your authorization consent:"}
{"task": "rw_54.jsonl", "id": 56227, "text": "(1), related to the obligations stipulated in our performance and regulations;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting personal information related to obligations stipulated in laws and regulations, no consent is required."}
{"task": "rw_54.jsonl", "id": 56228, "text": "(2), directly related to national interests such as national security, national defense security;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting personal information directly related to national interests such as national security and national defense security does not need to solicit consent."}
{"task": "rw_54.jsonl", "id": 56229, "text": "(3) Directly related to public safety, public health, and major public interests;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect personal information directly related to public safety, public health, and major public interests without soliciting consent."}
{"task": "rw_54.jsonl", "id": 56230, "text": "(4) Directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect direct personal information related to criminal investigation, prosecution, trial, and execution of judgment without asking for consent."}
{"task": "rw_54.jsonl", "id": 56231, "text": "(5) For major legitimate rights and interests such as maintaining your life, property, and reputation of your or other individuals, but it is difficult to get the consent of my authority;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting and maintaining major legitimate rights and interests, but it is difficult to obtain personal information that I have authorized, without asking for consent."}
{"task": "rw_54.jsonl", "id": 56232, "text": "(6), the personal information involved is made by your own public;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "The personal information involved is made to the public by itself without asking for consent."}
{"task": "rw_54.jsonl", "id": 56233, "text": "(7) Collect personal information from legal public information, such as legal news reports and government information disclosure;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If you collect personal information from the legal disclosure information, you do not need to ask for consent."}
{"task": "rw_54.jsonl", "id": 56234, "text": "(8), signed and fulfilled the contract according to your requirements;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting the personal information necessary for the signing and performing the contract without soliciting consent."}
{"task": "rw_54.jsonl", "id": 56235, "text": "(9), the safe and stable operation of the products or services provided by the product provided, such as the failure of discovering and disposing of products or services;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting personal information necessary for the safe and stable operation of products or services, there is no need to solicit consent."}
{"task": "rw_54.jsonl", "id": 56236, "text": "(10), other circumstances stipulated in laws and regulations.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect personal information under other circumstances stipulated in the laws and regulations without asking for consent."}
{"task": "rw_54.jsonl", "id": 56237, "text": "3. How do we use cookie and third -party services", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56238, "text": "(1) When you use the item service, we will save your login status and assign you one or more \"cookie\" (a small text file), for example: if you access a one, you need to log inThe products and/or services that can be provided. When you log in, we will store your login name encryption in your cookie file. Because it is an irreversible encryption storage, even if you can use your device, you cannot use your device, you cannot use your device, you cannot use your device to beIdentify your login name.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will save your login status and allocate one or more \"cookie\" for you."}
{"task": "rw_54.jsonl", "id": 56239, "text": "You don't need to do any additional work, all collection, preservation and encryption work are automatically completed by the system.", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56240, "text": "(2) In order to provide you with more convenient, fast, smooth, and personalized services, we provide you with the following services through Cookie and other technologies: Remember your login information and login status to help you save us to serve us to serve us.The steps to repeat the account information help judge your account security status.", "label": ["Important", "First Party Collection Information"], "rewrite": "We collect your login information and login status through Cookie and other technologies."}
{"task": "rw_54.jsonl", "id": 56241, "text": "(3) Third -party service", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56242, "text": "1. Third -party H5 page", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56243, "text": "In order to provide third -party services, we may access third -party, H5, service pages, including third -party payment service pages, third -party application pages. If you enter these, H5, pages, the third party may collect your mobile phoneNumbers, personal biometric information, bank card numbers, and application accounts, please note that you will follow the privacy protection policies of the third -party service provider in the above third parties, H5, and pages.", "label": ["Important", "First Party Collection Information"], "rewrite": "Third parties may collect your mobile phone number, personal biometric information, bank card number, and application account."}
{"task": "rw_54.jsonl", "id": 56244, "text": "When you leave our platform to jump to the third -party H5 page, we remind you to pay attention to protecting personal privacy.", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56245, "text": "This platform does not collect and store any personal information you fill in and submitted on other third -party service pages.", "label": ["Important", "First Party Collection Information"], "rewrite": "This platform does not collect and store any personal information you fill in and submitted on other third -party service pages."}
{"task": "rw_54.jsonl", "id": 56246, "text": "2. Third -party SDK", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56247, "text": "The products on this platform will include multiple external third -party SDKs or other similar applications. If you use such services provided by third parties on our platform, you agree that it will directly collect and process your information (Such as embedded code, plug -in, etc.).", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "If you use a third -party service on the platform, you agree that it will directly collect and process your information (such as embedded code, plug -in, etc.)."}
{"task": "rw_54.jsonl", "id": 56248, "text": "You can view and read the privacy policy of third -party SDK through \"Access to the Third -Party SDK Catalog\", and understand the type, business function and purpose of third -party SDK to obtain personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You can view and read the privacy policy of third -party SDK through \"Access to the Third -Party SDK Catalog\"."}
{"task": "rw_54.jsonl", "id": 56249, "text": "Please know that we will not share any personal sensitive information including name, ID card, mobile phone number, bank card, to any external third -party SDK that provides technical services and technical support.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not share any personal sensitive information including name, ID card, mobile phone number, and bank card from the external third -party SDK."}
{"task": "rw_54.jsonl", "id": 56250, "text": "In order to ensure your information security to the greatest extent, we recommend that you check your privacy clauses before using any third -party SDK service.", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56251, "text": "In order to protect your legitimate rights and interests, if you find that there are risks such as SDK or other similar applications, it is recommended that you immediately terminate related operations and contact us in time.", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56252, "text": "4. How do we protect and save your personal information", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56253, "text": "(1) How do we protect your personal information", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56254, "text": "1. For the collection of information, we strive to take the information that meets industry standards, reasonable and feasible security protection measures to protect your information to prevent information from leakage, loss, improper use, unauthorized access, modification and disclosure.", "label": ["Important", "Data Security"], "rewrite": "We strive to take the information that meets industry standards, reasonable and feasible security measures to protect your information."}
{"task": "rw_54.jsonl", "id": 56255, "text": "We adopt multi -directional security protection measures to ensure that user personal information protection is at a reasonable level of security, including many aspects such as management system control and security system guarantee.", "label": ["Important", "Data Security"], "rewrite": "We adopt multi -directional security protection measures to ensure that user personal information protection is at a reasonable level of security, including many aspects such as management system control and security system guarantee."}
{"task": "rw_54.jsonl", "id": 56256, "text": "We will deploy the access control mechanism to make every effort to ensure that only the authorized personnel can access personal information;", "label": ["Important", "Data Security"], "rewrite": "We will deploy the access control mechanism to make every effort to ensure that only the authorized personnel can access personal information."}
{"task": "rw_54.jsonl", "id": 56257, "text": "And we will organize safety and privacy protection training courses to strengthen employees' awareness of protecting the importance of personal information.", "label": ["Important", "Data Security"], "rewrite": "We will organize safety and privacy protection training courses to strengthen employees' awareness of protecting the importance of personal information."}
{"task": "rw_54.jsonl", "id": 56258, "text": "Those who violate obligations will be punished in accordance with relevant regulations.", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56259, "text": "2. We recommend that you pay full attention to the protection of personal information when using our products and services. We will also provide a variety of security functions to help you protect your personal information security.", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56260, "text": "You should pay attention to the protection of your personal information. If you find that your personal information has been leaked or there is a possibility of leaking, and it may endanger your registered gain account security, or cause you other losses, or cause you other losses.You must notify the obtained at the first time so that the obtaining objects can take corresponding measures to ensure the safety of your gain accounts and prevent the loss of losses or further expansion.", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56261, "text": "3. You fully understand and accept: Even if you have adopted various security technologies and program storage, and protect user information to prevent it from being unauthorized access, use, copy, and leakedAttack, stealing, leaked due to force majeure or other non -derived reasons.", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56262, "text": "In this regard, as long as the object is taken to take the necessary measures to prevent the above situations from occurring, and after the above situation, the necessary measures will be taken to prevent its loss from further expanding, and the obtains will not need to compensate for any loss caused by you.", "label": ["Data Security", "Important", "Risk"], "rewrite": "We take necessary measures to prevent the loss of losses further, and obtains do not need to compensate for any losses caused by you."}
{"task": "rw_54.jsonl", "id": 56263, "text": "(2) How do we save your personal information", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56264, "text": "1. We will only save your personal information within the shortest period required for the purpose of the cost of reaching the cost policy, unless the law has compulsory depository requirements, such as the \"E -Commerce Law of the People's Republic of China\" requires the preservation of goods and service information and transaction information for the preservation of goods and transaction information.The time is not less than three years from the date of the transaction.", "label": ["Data Retention", "Important"], "rewrite": "We will only save your personal information within the shortest period required for the realization policy."}
{"task": "rw_54.jsonl", "id": 56265, "text": "After your personal information exceeds the retention, we will delete your personal information according to the requirements of the applicable law, or make it anonymous processing.", "label": ["Data Retention", "Important"], "rewrite": "After your personal information is exceeded, we will delete your personal information or make it anonymous processing."}
{"task": "rw_54.jsonl", "id": 56266, "text": "2. We will collect or generate personal information collected or generated in the territory of the People's Republic of China. Personal information is stored in the People's Republic of China.", "label": ["Data Retention", "Important"], "rewrite": "We will store or generate personal information collected or generated in the People's Republic of China to store or generate personal information in the People's Republic of China."}
{"task": "rw_54.jsonl", "id": 56267, "text": "3. After you terminate the use of a certain service, we will stop the collection and use of your information, except for laws and regulations or regulatory authorities.", "label": ["Important", "First Party Collection Information"], "rewrite": "After terminating the service service, we will stop collecting and using information, except for laws and regulations or regulatory authorities."}
{"task": "rw_54.jsonl", "id": 56268, "text": "If we stop operations, we will stop collecting your personal information in time, notify you in the form of notification of operation in the form of one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one service, and delete or anonymous processing of your personal information.", "label": ["Important", "Cessation of Operations"], "rewrite": "If the operation is stopped, we will stop collecting personal information in time and notify you, and will delete or treat personal information."}
{"task": "rw_54.jsonl", "id": 56269, "text": "4. When you successfully apply for cancellation account, we only save your personal information within the scope of the law, but no longer commercialize your personal information;", "label": ["Data Retention", "Important"], "rewrite": "After successfully applying for cancellation accounts, personal information is preserved only within the scope of the law, but personal information is no longer commercialized."}
{"task": "rw_54.jsonl", "id": 56270, "text": "When your personal information exceeds the above -mentioned storage period, we will delete or processes your personal information.", "label": ["Data Retention", "Important"], "rewrite": "When personal information exceeds the above -mentioned storage period, delete or processes personal information."}
{"task": "rw_54.jsonl", "id": 56271, "text": "5. Your personal information rights", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56272, "text": "During your use of items, in order to make you more conveniently to check, copy, correct, and delete your personal information, while ensuring your withdrawal of the consent of personal information processing and the right to cancel the account, we provide you in the product design provided you with the product design.For the corresponding operation settings, you can refer to the following guidelines for operation.", "label": ["Edit/Control", "Important"], "rewrite": "We provide the corresponding operation settings in the product design, in order to make you more conveniently check, copy, correct, delete personal information, while ensuring your right to withdraw consent and cancel your account."}
{"task": "rw_54.jsonl", "id": 56273, "text": "In addition, we also set up a channel for complaints and request explanations, and your opinions and requests will be dealt with in time.", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56274, "text": "Please note that there may be differences between the operation settings between different operating systems and object software; the operation settings may be different;", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56275, "text": "In addition, in order to optimize your experience, we may also adjust the operation settings.", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56276, "text": "Therefore, the following guidelines are for reference only. If you still have any questions about the way and ways to exercise related rights, you can contact us through the method of disclosure of this policy.", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56277, "text": "(1) Check, copy, correct personal information", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56278, "text": "Click \"Edit Information\".", "label": ["Important", "Edit/Control"], "rewrite": "Query and manages the basic information of avatars, nicknames, gender, signatures, styles, cities, constellations, and schools: 1) After entering the object, click \"I\"; 2) click on the avatar; 3) click \"Edit Information\"."}
{"task": "rw_54.jsonl", "id": 56279, "text": "2. Check and manage real -name information, bind the mobile phone number, modify the login password, bind or unbind the third -party account number: 1), after entering the object, click \"me\"; 2), click \"Settings\"; 3; 3; 3; 3; 3; 3;), Click \"Account Security\".", "label": ["Important", "Edit/Control"], "rewrite": "Check and manage real -name information, bind the mobile phone number, modify the login password, bind or unbind third -party account number: 1) After entering the object, click \"I\"; 2) click \"Settings\"; 3) click \"Account Security\"Essence"}
{"task": "rw_54.jsonl", "id": 56280, "text": "3. Check the order information: 1), after entering the object, click, \"I\"; 2), click \"Buy\"; 3), conduct information inquiry and access.", "label": ["Important", "Edit/Control"], "rewrite": "Check the order information: 1) After entering the object, click \"I\"; 2) Click \"Buy\"; 3) to inquire and access information."}
{"task": "rw_54.jsonl", "id": 56281, "text": "4. When you are a seller, please check the product order information sold when you are the seller: 1). After entering the object, click, \"I\"; 2), click \"Seller Center\"; 3), conduct information query access.", "label": ["Important", "Edit/Control"], "rewrite": "When you are a seller, check the product order information sold when you are a seller: 1) After entering the object, click \"I\"; 2) click \"Seller Center\"; 3) For information inquiry and access."}
{"task": "rw_54.jsonl", "id": 56282, "text": "5. Check and manage address information: 1. After entering the object, click, \"I\"; 2), click \"Settings\"; 3), click \"Address Management\".", "label": ["Important", "Edit/Control"], "rewrite": "Check and manage address information: 1) After entering the object, click \"I\"; 2) Click \"Settings\"; 3) Click \"Address Management\"."}
{"task": "rw_54.jsonl", "id": 56283, "text": "6. Check and manage size information:", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56284, "text": "1) After entering the object, click, \"I\"; 2), click \"Settings\"; 3), click \"My Size\".", "label": ["Important", "Edit/Control"], "rewrite": "After entering the object, click \"I\"; 2) Click \"Set\"; 3) Click \"My Size\"."}
{"task": "rw_54.jsonl", "id": 56285, "text": "7. Check and manage payment related information (transaction password, Alipay withdrawal account number, bank card information, payment method information): 1), after entering the object, click \"I\"; 2), click \"Settings\"; 3), Click \"Payment Settings\";", "label": ["Important", "Edit/Control"], "rewrite": "Check and manage payment related information (transaction password, Alipay withdrawal account number, bank card information, payment method information): 1) After entering the object, click \"I\"; 2) click \"Settings\"; 3) Click \"Payment Settings\"."}
{"task": "rw_54.jsonl", "id": 56286, "text": "8. Check and manage the blacklist: 1), after entering the object, click, \"I\"; 2), click \"Settings\"; 3), click \"Privacy Settings\"; 4), click \"Added Blacklist\"Essence", "label": ["Important", "Edit/Control"], "rewrite": "Check and manage the blacklist: 1) After entering the object, click \"I\"; 2) Click \"Settings\"; 3) Click \"Privacy Settings\"; 4) Click \"Add Blacklist\"."}
{"task": "rw_54.jsonl", "id": 56287, "text": "9., check and copy personal information: 1), after entering the object, click, \"I\"; 2), click \"Settings\"; 3), click \"Privacy Settings\"; 4), click \"Personal Information and Permanent\"; 5), click \"Personal Information Browse and Export\" to check your personal information; 6), click \"Application Download\" to copy a copy of personal information and send it to your designated mailbox.", "label": ["Important", "Edit/Control"], "rewrite": "Check and copy personal information: 1) After entering the object, click \"I\"; 2) Click \"Settings\"; 3) Click \"Privacy Settings\"; 4) Click \"Personal Information and Permissions\"; 5) Click \"Personal Information Browse\"Export\" to check your personal information; 6) Click \"Application Download\" to copy a copy of personal information and send it to your designated mailbox."}
{"task": "rw_54.jsonl", "id": 56288, "text": "(2) Delete personal information", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56289, "text": "You can operate to delete your information through the methods and channels listed in the previous paragraph \"Query, Copy, Correct Personal Information\".", "label": ["Important", "Edit/Control"], "rewrite": "You can operate to delete your information through the methods and channels listed in the previous paragraph \"Query, Copy, Correct Personal Information\"."}
{"task": "rw_54.jsonl", "id": 56290, "text": "In the following circumstances, you can make a request to delete personal information:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56291, "text": "(1) If our behavior of handling personal information violates laws and regulations;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56292, "text": "(2) If we collect and use your personal information, it has not obtained your clear consent;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56293, "text": "(3) If our behavior of handling personal information seriously violates your agreement;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56294, "text": "(4) If you no longer use our products or services, or you take the initiative to cancel your account;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56295, "text": "(5) If we will no longer provide you with products or services.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56296, "text": "If we decide to respond to your deletion request, we will also notify the subject of your personal information from our personal information as much as possible at the same time, and ask them to delete them in time (unless the laws and regulations have other regulations or these subjects have obtained your authorization independently).", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56297, "text": "(3) Change the scope of authorization and the consent of withdrawal", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56298, "text": "Each business function of gains platform requires some basic personal information to complete.", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56299, "text": "In addition to the necessary personal information, you can change the scope of the authorization of personal information or withdraw consent.", "label": ["Important", "Edit/Control"], "rewrite": "In addition to the necessary personal information, you can change the scope of the authorization of personal information or withdraw consent."}
{"task": "rw_54.jsonl", "id": 56300, "text": "You can give, modify or recover your authorization consent in the method of setting or changing your intelligent mobile device in the accessible app \"Settings\".", "label": ["Important", "Edit/Control"], "rewrite": "You can give, modify or retract your authorization consent in the obtain app \"I-Settings\" to give, modify or recover your authorization."}
{"task": "rw_54.jsonl", "id": 56301, "text": "For example, you can recover your authorization via Weibo in the obtained app \"I-Settings-Privacy Settings\".", "label": ["Important", "Edit/Control"], "rewrite": "You can recover your authorization through Weibo in the obtain app \"I-Settings-Privacy Settings\"."}
{"task": "rw_54.jsonl", "id": 56302, "text": "You can open or close the location information through the device settings or acquisition APP \"I-Settings-Privacy Settings-Personal Information and Permanent Management\", (geographical location), camera (camera), album (picture library), microphone, microphone,(Voice), calendar, reminder matters, storage authority, telephone status, address book, suspended window, notification, exercise and fitness/identification physical activity, FACE, ID system permissions, change the scope of authorization or withdraw authorization.", "label": ["Important", "Edit/Control"], "rewrite": "You can open or close the location information (geographical location), camera (camera), album (picture library), microphone (picture library), microphone) through device settingsVoice), calendar, reminder matters, storage authority, telephone status, address book, suspended window, notification, exercise and fitness/identification physical activity, FACE ID system permissions, change the scope of authorization or withdraw authorization."}
{"task": "rw_54.jsonl", "id": 56303, "text": "After the withdrawal authorization, we will no longer collect information related to these permissions, but it does not affect our personal information processing activities based on your authorization.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "After withdrawal authorization, information related to these permissions will no longer be collected, but it will not affect the personal information processing activities based on authorization."}
{"task": "rw_54.jsonl", "id": 56304, "text": "(4) Logging out the account", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56305, "text": "You can apply for a cancellation of your account in the following ways:", "label": ["Edit/Control", "Important"], "rewrite": "You can apply for a cancellation of your account in the following ways:"}
{"task": "rw_54.jsonl", "id": 56306, "text": "1. Log in to the client, submit the application of account cancellation through \"My-Settings-Account Security-Account Logging\";", "label": ["Edit/Control", "Important"], "rewrite": "You can log in to the client and submit an account cancellation application through \"I-Settings-Account Security-Account Logling\"."}
{"task": "rw_54.jsonl", "id": 56307, "text": "For details, the account cancellation rules are shown in the \"account cancellation\" page.", "label": ["Important", "Edit/Control"], "rewrite": "For details, the account cancellation rules are shown in the \"account cancellation\" page."}
{"task": "rw_54.jsonl", "id": 56308, "text": "2. After you actively cancel your account, we will stop providing you with products or services, and delete your personal information according to your requirements, or to deal with it anonymous, except for other regulations.", "label": ["Data Retention", "Edit/Control", "Important"], "rewrite": "After actively canceling the account, we will stop providing products or services, delete personal information according to your requirements, or processes it anonymous, except for other provisions of laws and regulations."}
{"task": "rw_54.jsonl", "id": 56309, "text": "(5) The right to close relatives of the deceased", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56310, "text": "If the user user dies unfortunately, its close relatives can contact us through the method of disclosed in Article 9 of this policy to obtain relevant guidelines to exercise the legal and legitimate rights and interests stipulated in the law.", "label": ["Specific Audiences", "Important"], "rewrite": "If the user's user dies unfortunately, its close relatives can contact us through the ninth method of this policy to exercise legal and legitimate rights and interests."}
{"task": "rw_54.jsonl", "id": 56311, "text": "(6) Equal automation decision -making", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56312, "text": "In certain business functions, we may make decisions only based on non -artificial automation decision mechanisms, including algorithms.", "label": ["Important", "Usage"], "rewrite": "In certain business functions, we may make decisions only based on non -artificial automation decision mechanisms, including algorithms."}
{"task": "rw_54.jsonl", "id": 56313, "text": "If these decisions affect your legitimate rights and interests, you can contact us in the way you disclose the ninth disclosure of this policy.", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56314, "text": "(7) Responsive your above request", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56315, "text": "To ensure your account security, when you make a request to us, we may first ask you to verify your identity (if you ask you to provide a written request or other ways), and then process your request.", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56316, "text": "For the above requests you made to us, we will answer within 15 working days.", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56317, "text": "For your reasonable request, we do not charge fees in principle.", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56318, "text": "However, we will charge a certain cost fee depending on the situation for requests that repeat and beyond a reasonable limit.", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56319, "text": "We may refuse to reject the risk of repetition for no repetition, too much technical means (for example: need to develop new systems or fundamentally change the current practice), bring risks or very unrealistic requests to others, and we may refuse.", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "We may refuse for no repetition, too much technical means, risk or very unrealistic requests to others, or very unrealistic requests."}
{"task": "rw_54.jsonl", "id": 56320, "text": "In the following circumstances, we will not be able to respond to your request:", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "In the following circumstances, we will not be able to respond to your request:"}
{"task": "rw_54.jsonl", "id": 56321, "text": "1. The obligation to fulfill our laws and regulations;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "The situation related to our obligations to fulfill our laws and regulations cannot respond to the request."}
{"task": "rw_54.jsonl", "id": 56322, "text": "2. Directly related to national security and national defense security;", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "Directly related to national security and national defense security cannot respond to requests."}
{"task": "rw_54.jsonl", "id": 56323, "text": "3. It is directly related to public safety, public health, and major public interests;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Situations that are directly related to public safety, public health, and major public interests cannot respond to requests."}
{"task": "rw_54.jsonl", "id": 56324, "text": "4. Directly related to criminal investigation, prosecution, approval or execution judgment;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Direct -related situations such as criminal investigation, prosecution, approval or execution judgment cannot respond to the request."}
{"task": "rw_54.jsonl", "id": 56325, "text": "5. Personal information controller has sufficient evidence to indicate that the subject of personal information has subjective malicious or abuse of rights;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Personal information controller has sufficient evidence to indicate that the subject of personal information has subjective malice or abuse of rights, and cannot respond to the request."}
{"task": "rw_54.jsonl", "id": 56326, "text": "6. Out of major legitimate rights and interests such as the main body of personal information or other individuals, but it is difficult to get my consent;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "It is difficult to respond to the request for maintaining major legitimate rights and interests, but it is difficult to get my consent."}
{"task": "rw_54.jsonl", "id": 56327, "text": "7. A response to the request of the subject of the personal information will cause the personal information subject or other individuals, and the legitimate rights and interests of the organization will be severely damaged;", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "In response to the request of the subject of personal information, if the legitimate rights and interests are severely damaged, the request cannot be responded."}
{"task": "rw_54.jsonl", "id": 56328, "text": "8., involved in business secrets.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Those who involve business secrets cannot respond to requests."}
{"task": "rw_54.jsonl", "id": 56329, "text": "6. How do we share, transfer, and publicly disclose your information", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56330, "text": "(1) Sharing", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56331, "text": "We will not share your personal information from a third party other than the derived service provider, but you should know that the following situations will be learned, and we will promote the third party to adopt your information in the process of using your information appropriately.Confidentiality and security measures:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not share your personal information with other third parties, except the following situations, and we will promote the third party to take appropriate confidentiality and security measures during use."}
{"task": "rw_54.jsonl", "id": 56332, "text": "1. Sharing in statutory situations: We may share your personal information to the outside world in accordance with the requirements of laws and regulations, lawsuits, or in accordance with the requirements of administrative and judicial organs in accordance with the requirements of law.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "It may share your personal information to the outside world in accordance with the requirements of laws and regulations, lawsuits, or in accordance with the requirements of administrative and judicial organs in accordance with the requirements of law."}
{"task": "rw_54.jsonl", "id": 56333, "text": "2. Share in the absence of clear consent: share your information with a third party when you get your clear authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the absence of your clear authorization consent, share your information with a third party."}
{"task": "rw_54.jsonl", "id": 56334, "text": "3. Share in your active choice: When you buy or use the service service through the obtained objects, we will share the necessary information involved in your shopping order or service in your choice.Your transaction or service is counterpart to realize your needs of transactions, distribution and after -sales service.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "According to your choice, the necessary information involved in your shopping order or service is shared with the necessary information involved in transactions or services."}
{"task": "rw_54.jsonl", "id": 56335, "text": "4. Sharing with affiliated companies: In order to facilitate our products and services based on the objective platform account, I recommend information that you may be interested in, identify abnormal user accounts, and protect the personal property of related companies or other users or the public.If you are infringed, your personal information may be shared with our affiliated company and/or its designated service providers.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Your personal information may be shared with our affiliated companies and/or its designated service providers."}
{"task": "rw_54.jsonl", "id": 56336, "text": "We will only share the necessary personal information and be restricted by the purpose declared in this policy. If we share your personal sensitive information or the purpose of changing personal information to change personal information, we will solicit your authorization consent again.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "If we share your personal sensitive information or related companies to change the purpose of the use and processing of personal information, we will solicit authorization consent again."}
{"task": "rw_54.jsonl", "id": 56337, "text": "5. Share with third -party partners: In order to realize your shopping, trading, identification and other services on the objective platform, we may be with third -party partners as you provide certain services.Sharing your information on legal, fair, necessary, specific, and clear goals, authorized partners can only expose the information required for their responsibilities, and we will require it to use the agreement that it must not use this information for any other purposes.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will only sharing information for the legal, correct, necessary, specific, and clear goals. We can authorize partners to only contact the information required for their duties. We will require it to use the information and not to use the information for any other purposes."}
{"task": "rw_54.jsonl", "id": 56338, "text": "According to the relevant agreements signed by us, the third party of cooperation with you (including the electronic agreement signed online and the corresponding platform rules) or other legal documents, and the necessity of other legal documents, provide your specific necessary information to the third party of cooperation.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Provide your specific necessary information to the third party of cooperation according to the agreement of relevant agreements or other legal documents and the necessity of specific services."}
{"task": "rw_54.jsonl", "id": 56339, "text": "At present, our third -party partners include the following types:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "At present, our third -party partners include the following types:"}
{"task": "rw_54.jsonl", "id": 56340, "text": "(1) Express logistics service provider, that is, the express logistics company that provides you with product delivery services, we will provide it with the order information, the name of the consignee, contact information, and address of the consignee, the consignee name, contact information, and address.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will provide an order information, the name of the consignee, contact information, and address for the delivery service to the delivery service."}
{"task": "rw_54.jsonl", "id": 56341, "text": "(2), financial service providers, including funds from debit (licensed financial institutions, Internet micro -loan companies, and other legal reality to provide you with the borrowing entity of funds), borrowing service providers (including funds from the debit delegation/cooperationThe technical service party provides data transmission technical services and preliminary credit evaluation services during the borrowing service of funds). When you apply for a consumer installment or apply for a merchant's personal loan when you consume it through the platformUse the name, ID number, bank card number, and reserved mobile phone numbers and order information necessary for credit.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will provide financial service providers with names, ID numbers, bank card numbers, and reserved mobile phone numbers and order information for credit to apply for credit and use credit."}
{"task": "rw_54.jsonl", "id": 56342, "text": "(3) Payment partners, including third -party payment institutions and fund liquidation banks, we will provide it with your name, ID number, bank card number, reserved mobile phone number, validity period, security code, including the validity period, security codeOnly collect and provide third -party payment institutions for bank cards, and do not store any form of storage;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will provide your name, ID number, bank card number, reserved mobile phone number, validity period, and security code to payment partners. Among themMake any form of storage."}
{"task": "rw_54.jsonl", "id": 56343, "text": "(4) SMS channel service party, provide SMS sending service, we will provide it with your mobile phone number and text message content;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will provide your mobile phone number and SMS content to the SMS channel service."}
{"task": "rw_54.jsonl", "id": 56344, "text": "(5), content security audit service provider, we will provide you with the content information and necessary personal information (avatar, nickname) published on the platform when conducting content security reviewWhether the content is legal and compliant.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When conducting content security review, we will provide your third -party content security service provider with the content information published by the platform and the necessary personal information (avatar, nickname) to determine whether the content is legitimate and compliant."}
{"task": "rw_54.jsonl", "id": 56345, "text": "(6) Advertising related parties, including advertising service providers, suppliers, and other partners (collectively known as \"advertising partners\"), we will share the analysis of device information or statistical information.It is difficult to associate with your real -name identity.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will share the analysis of device information or statistical information to the advertising -related parties. This information cannot be or difficult to associate with your real -name identity."}
{"task": "rw_54.jsonl", "id": 56346, "text": "This information helps to achieve advertising monitoring, help analysis and measure the effectiveness of advertising and related services.", "label": ["Usage"], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56347, "text": "a), advertising push and launch: Push/promotion/recall and advertising or other advertising related parties may need to use device, network, channel information, label/portrait information after de -identification or anonymousization;", "label": ["Important", "Usage"], "rewrite": "Advertising -related parties may need to use device, network, channel information, label/portrait information that are identified or anonymous."}
{"task": "rw_54.jsonl", "id": 56348, "text": "Advertising push/promotion/recall, and analysis services of advertising push in cooperation with advertisers may need to use the aforementioned information to help achieve advertising and optimize the effect of advertising.", "label": ["Important", "Usage"], "rewrite": "Advertising partners may need to use personal information to help achieve advertising and optimize the effect of advertising."}
{"task": "rw_54.jsonl", "id": 56349, "text": "b), Advertising Statistical Analysis: Advertising partners providing advertising statistical analysis services may need to use information such as your device, network, advertising clicks, browsing, display, and advertising transformation data to analyze, measure, improve the effects of advertising and related servicesEssence", "label": ["Important", "Usage"], "rewrite": "Advertising partners may need to use information such as your device, network, advertising clicks, browsing, displaying, and advertising transformation data to analyze, measure, and improve the effects of advertising and related services."}
{"task": "rw_54.jsonl", "id": 56350, "text": "c), the use of advertising partners to use information: We will ask advertising partners to follow the principles of legal, correctness, and necessary information to ensure that the legitimate rights of users are not violated.", "label": ["Important", "Data Security", "Usage"], "rewrite": "We will ask advertising partners to follow the principles of legal, correctness, and necessary information to ensure that the legitimate rights of users are not violated."}
{"task": "rw_54.jsonl", "id": 56351, "text": "(7), picture processing service party, 1) Provide picture resource management, content distribution (CDN), and picture processing services. In order to achieve the purpose of users can smoothly and quickly access the pictures of the platform, we will provide you with the third party of the cooperationThe picture posted on the platform transmits the picture data you posted to the third party to deal with the picture.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will provide the pictures posted on the platform to third parties in the cooperation, and sharing the picture data you posted to the third party to handle the picture."}
{"task": "rw_54.jsonl", "id": 56352, "text": "Photo processing partners will delete or processes the picture after the service is over.", "label": ["Data Retention", "Third Party Sharing/ Disclosure", "Important"], "rewrite": "Photo processing partners will delete or processes the picture after the service is over."}
{"task": "rw_54.jsonl", "id": 56353, "text": "2) In order to provide you with a facial \"AI skin measurement\" service, you need to authorize the gain to share your photos, gender and age range from a third party, and return to you to the \"AI skin measurement\".", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to provide facial \"AI skin measurement\" services, you need to authorize to share your photos, gender and age range to third parties."}
{"task": "rw_54.jsonl", "id": 56354, "text": "The above information will be transmitted to the third party through the encrypted channel.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Your photos, gender and age range will be transmitted to the third party through the encryption channel."}
{"task": "rw_54.jsonl", "id": 56355, "text": "The third party requires that the third party is processed in accordance with the minimum necessary principles (including timely deleting or anonymous) and your relevant information and ensure your personal information and data security.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "The third party requires that the third party is processed in accordance with the minimum necessary principles (including timely deleting or anonymous) and your relevant information and ensure your personal information and data security."}
{"task": "rw_54.jsonl", "id": 56356, "text": "We will share the necessary data sharing with third parties through application interface (API) and software tool development packs (SDK).", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will share the necessary data sharing with third parties through application interface (API) and software tool development packs (SDK)."}
{"task": "rw_54.jsonl", "id": 56357, "text": "For the basic situation of third parties in cooperation, we will conduct strict safety impact assessment and safety monitoring before cooperation.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "For the basic situation of third parties in cooperation, we will conduct strict safety impact assessment and safety monitoring before cooperation."}
{"task": "rw_54.jsonl", "id": 56358, "text": "And signed a cooperation agreement with a third party in cooperation, agreed that it should protect personal information in accordance with reasonable and necessary confidentiality and technical security measures.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will sign a cooperation agreement with a third party in cooperation, agreed that it should protect personal information in accordance with reasonable and necessary confidentiality and technical security measures."}
{"task": "rw_54.jsonl", "id": 56359, "text": "For details, share personal information list with partners, please check \"Third -Party Cooperation Personal Information Sharing\".", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For details, share personal information list with partners, please check \"Third -Party Cooperation Personal Information Sharing\"."}
{"task": "rw_54.jsonl", "id": 56360, "text": "(2) Transfer", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56361, "text": "Unless the subject's operating entity changes, it will not transfer your personal information to any third party.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Unless the subject's operating entity changes, it will not transfer your personal information to any third party."}
{"task": "rw_54.jsonl", "id": 56362, "text": "If the change of the subject's operating entity, the transfer of your personal information, we will also strictly require the transfer subject to strictly protect your personal information in accordance with this privacy policy.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If the change of the subject of the object of the object leads to the transfer of personal information, we will strictly require the transfer subject to strictly protect personal information in accordance with this privacy policy."}
{"task": "rw_54.jsonl", "id": 56363, "text": "Otherwise, we will ask for the consent of the transfer of the transfer to you.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If the subject of the transfer is not strictly protected, we will ask for the transfer of the subject to re -authorize the authorization consent."}
{"task": "rw_54.jsonl", "id": 56364, "text": "(3) Public disclosure", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56365, "text": "We will not actively disclose your information. We will only disclose your personal information in the following circumstances:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not actively disclose your information. We will only disclose your personal information in the following circumstances:"}
{"task": "rw_54.jsonl", "id": 56366, "text": "1. Get your clear consent or based on your active choice, we may publicly disclose your personal information;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Obtain your clear consent or based on your active choice, we may publicly disclose your personal information."}
{"task": "rw_54.jsonl", "id": 56367, "text": "2. If we determine that you have violated laws and regulations or serious violations of the relevant agreements and rules of the objective platform, or to protect the security of the personal property of the user or the public, we may be able to obtain your consent in accordance with laws and regulations or obtain your consent.Under the circumstances, disclose your personal information, including related violations and the measures that the objective platform has taken.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may disclose personal information about you in accordance with laws and regulations or obtaining your consent, including related violations and measures that have taken the object platform."}
{"task": "rw_54.jsonl", "id": 56368, "text": "For example, if you seriously violate the rules of obtaining objects due to the sale of counterfeit goods, we may publicly disclose your main information and violations.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you seriously violate the rules of obtaining items due to the sale of counterfeit products, we may publicly disclose your main information and violations."}
{"task": "rw_54.jsonl", "id": 56369, "text": "(4) Sharing, transfer, and public disclosure of disclosure of personal information.", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56370, "text": "According to relevant laws and regulations, in the following circumstances, sharing, transfer, and publicly disclose your personal information without requiring your authorization consent in advance:", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "In the following circumstances, sharing, transfer, and publicly disclose your personal information without obtaining your authorization consent in advance:"}
{"task": "rw_54.jsonl", "id": 56371, "text": "1. The relevant obligations stipulated in the performance of our laws and regulations;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Sharing personal information related to the obligations stipulated in our laws and regulations does not need to solicit consent."}
{"task": "rw_54.jsonl", "id": 56372, "text": "2. Directly related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Personal information directly related to national security and national defense security does not need to solicit consent."}
{"task": "rw_54.jsonl", "id": 56373, "text": "3. It is directly related to public safety, public health, and major public interests;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Personal information directly related to public safety, public health, and direct public interests does not need to solicit consent."}
{"task": "rw_54.jsonl", "id": 56374, "text": "4. Directly related to criminal investigation, prosecution, trial and judgment execution;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Direct related personal information such as sharing with criminal investigation, prosecution, trial and judgment execution does not need to solicit consent."}
{"task": "rw_54.jsonl", "id": 56375, "text": "5. For major legitimate rights and interests such as the life and property of the subject of personal information or other individuals, it is difficult to obtain the consent of my authority;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Sharing and maintaining major legitimate rights and interests but difficulty getting personal information that I have authorized, no need to solicit consent."}
{"task": "rw_54.jsonl", "id": 56376, "text": "6. The subject of personal information disclose personal information to the public by itself;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "If the subject of personal information disclose personal information to the public by itself, no consent is required."}
{"task": "rw_54.jsonl", "id": 56377, "text": "7. Collect personal information from legal public information, such as legal news reports and government information disclosure.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "If you collect personal information from the legal disclosure information, you do not need to ask for consent."}
{"task": "rw_54.jsonl", "id": 56378, "text": "Please know that according to applicable laws, if we take technical measures and other necessary measures to take personal information, so that the data receiver cannot re -identify specific individuals and cannot recover, then the sharing, transfer, and public disclosure of data after this type of processing does not need to be disclosed.Notify you and obtain your consent.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "If the personal information is processed, the data receiver cannot re -identify the specific individual and cannot recover, then the sharing, transfer, and public disclosure of the data after processing does not need to notify you separately and obtain your consent."}
{"task": "rw_54.jsonl", "id": 56379, "text": "7. How do we deal with the personal information of minors", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56380, "text": "We attach great importance to the protection of personal information of minors.", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56381, "text": "Our products and services are mainly for adults. Without the consent of parents or guardians, children should not create their own gain accounts.", "label": ["Specific Audiences", "Important"], "rewrite": "Without the consent of parents or guardians, children should not create their own gain accounts."}
{"task": "rw_54.jsonl", "id": 56382, "text": "In e -commerce activities, we presume that you have the corresponding civil behavior capabilities.", "label": ["Important", "Risk"], "rewrite": "In e -commerce activities, we presume that you have the corresponding civil behavior capabilities."}
{"task": "rw_54.jsonl", "id": 56383, "text": "If you are a minor, please make sure your parents or guardians have read this policy carefully and use our services or provide information to us under the consent of your parents or guardians.", "label": ["Specific Audiences", "Important"], "rewrite": "Minors, please make sure that the guardian has read this policy carefully and uses our services or provide information to us under the premise of obtaining its consent."}
{"task": "rw_54.jsonl", "id": 56384, "text": "We will protect the security of minors' user information in accordance with relevant national laws and regulations and the provisions of this policy.", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56385, "text": "If we find that the child's personal information is collected without the consent of the proven parents or other guardians in advance, we will try to delete relevant information as soon as possible.", "label": ["Specific Audiences", "Important"], "rewrite": "If we find that the child's personal information is collected without the consent of our parents or other guardians in advance, we will try to delete relevant information as soon as possible."}
{"task": "rw_54.jsonl", "id": 56386, "text": "At the same time, we have established rules for collection and use of minor information to protect personal information security of children and adolescents. You can learn more about more specific content by reading the \"Personal Information Protection Rules of Children/Youth\".", "label": ["Specific Audiences", "Important"], "rewrite": "We have established rules for collection and use of minor information to protect personal information security of children and adolescents. You can learn more about more specific content by reading the \"Rules for the Protection of Personal Information for Children/Youth\"."}
{"task": "rw_54.jsonl", "id": 56387, "text": "If you are the guardian of minors, please pay attention to whether the minor you guard used your consent will be used to use it.", "label": ["Specific Audiences", "Important"], "rewrite": "The guardian, please pay attention to whether the minor you guarded with your consent uses the item service."}
{"task": "rw_54.jsonl", "id": 56388, "text": "When you have any questions you use our service to use our service or the personal information of the user provided by us, please contact us according to the contact information provided by Article 9 of this policy.", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56389, "text": "8. How to update this policy", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56390, "text": "Our products and services will continue to be updated and optimized with the needs of you and other users. Therefore, when new services and functional changes, we may update our privacy policy to inform you of specific changes.", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56391, "text": "Without your clear consent, we will not reduce the rights you should enjoy in accordance with this privacy policy.", "label": ["Policy Change", "Important"], "rewrite": "Without your clear consent, we will not reduce the rights you should enjoy in accordance with this privacy policy."}
{"task": "rw_54.jsonl", "id": 56392, "text": "We will release any changes to the privacy policy on the special page.", "label": ["Policy Change", "Important"], "rewrite": "We will release any changes to the privacy policy on the special page."}
{"task": "rw_54.jsonl", "id": 56393, "text": "For major changes, we will also provide more significant notifications (including but not limited to red dot prompts, message push, pop -ups, etc.).", "label": ["Policy Change", "Important"], "rewrite": "For major changes, we will also provide more significant notifications (including but not limited to red dot prompts, message push, pop -ups, etc.)."}
{"task": "rw_54.jsonl", "id": 56394, "text": "The major changes involved in this privacy policy include, but not limited to:", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56395, "text": "1. Make a major change in our service model.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56396, "text": "Such as the purpose of handling personal information, the type of personal information, the use of personal information, etc.;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56397, "text": "2. We major changes in our ownership structure and organizational structure, such as changes in information controller caused by business adjustments and mergers and acquisitions;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56398, "text": "3. The main object of personal information sharing, transfer or public disclosure changes;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56399, "text": "4. When you have the right to process the personal information processing and the exercise method, the exercise changes;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56400, "text": "5. We are responsible for dealing with the responsible departments, contact methods or complaint channels for handling personal information protection.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56401, "text": "We will also archive the old version of privacy policies on a special page for you to check.", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56402, "text": "Nine, how to contact us", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56403, "text": "1. We have established a personal information protection responsibility department. If you have any questions about this policy, or any related complaints or opinions, please contact us in time.", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56404, "text": "You can contact us in the following way:", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56405, "text": "(1) You can contact us through the personal information protection complaints that we set up, and contact the mailbox: Issue@shizhuang-ic.com.", "label": ["Important", "Contact Information"], "rewrite": "Contact email: Isue@shizhuang-ic.com."}
{"task": "rw_54.jsonl", "id": 56406, "text": "(2) Log in to the client, select \"I\", click \"Customer Service Center\" in the lower left corner, and get our contact with us through the exclusive hotline or online customer service.", "label": ["Important", "Contact Information"], "rewrite": "Get our contact through exclusive hotline or online customer service."}
{"task": "rw_54.jsonl", "id": 56407, "text": "(3) Contact address: Room B6-2005, No. 121 Zhongshan North Road, Hongkou District, Shanghai.", "label": ["Important", "Edit/Control"], "rewrite": "Contact address: Room B6-2005, No. 121 Zhongshan North Road, Hongkou District, Shanghai."}
{"task": "rw_54.jsonl", "id": 56408, "text": "2. To ensure your information security, we need to verify your identity and voucher information first.", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56409, "text": "We have established a customer complaint management mechanism, including the tracking process.", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56410, "text": "We will process it within 15 working days after verification.", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56411, "text": "If you are not satisfied with our reply, especially if you think our personal information processing behavior has harm your legitimate rights and interests, you can also seek solutions by filed a lawsuit to a court with jurisdiction in the place of residence in the defendant.", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56412, "text": "appendix:", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56413, "text": "\"Personal Information Processing Rules\"", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56414, "text": "\"95 -point Privacy Policy\"", "label": [], "rewrite": []}
{"task": "rw_54.jsonl", "id": 56415, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
