{"task": "rw_58.jsonl", "id": 57441, "text": "Dear users, we have updated the SF's \"Privacy Policy\" as follows.", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57442, "text": "This update mainly focuses on increasing the relevant content of children's personal information protection, clarifying our collection and use of personal information of children, and setting up the system of responsible person responsibility for children's personal information protection.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57443, "text": "Date of last update: December 6, 2019", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57444, "text": "If you have any questions, opinions or suggestions, please contact us through the following contact information:", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57445, "text": "Electricity, talk: 95338", "label": ["Important", "Contact Information"], "rewrite": "Electricity: 95338."}
{"task": "rw_58.jsonl", "id": 57446, "text": "Special Note", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57447, "text": "This policy is suitable for logistics services provided by your SF Express Co., Ltd. and its affiliated companies (hereinafter collectively referred to as \"SF\").", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57448, "text": "SF has always attached great importance to protecting customers' personal information.", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57449, "text": "Before you use SF's service, please read and understand this policy carefully, especially the thickest terms.", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57450, "text": "When you use SF's service, or continue to use SF's service after the policy is updated, it is deemed to have read, understand and agree with the version of this policy and its updated version.Essence", "label": ["Policy Change", "Important"], "rewrite": "When you use SF's service or continue to use after the policy is updated, it is deemed to have read, understand and agree with the version of this policy and its updated version."}
{"task": "rw_58.jsonl", "id": 57451, "text": "If you do not agree with any terms of this policy, you should immediately stop using SF service.", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57452, "text": "This policy will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57453, "text": "1. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57454, "text": "2. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57455, "text": "3. How can we share, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57456, "text": "4. How do we protect and save your personal information", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57457, "text": "5. Your rights", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57458, "text": "6. How do we deal with children's personal information", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57459, "text": "7. How can your personal information be transferred globally", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57460, "text": "8. How to update this policy", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57461, "text": "9. How to contact us", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57462, "text": "1. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57463, "text": "Personal information refers to a variety of information that can identify specific natural persons or reflects the activity of specific natural persons in a single or other information with other information.", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57464, "text": "Personal sensitive information refers to personal information that once leaked, illegally provided or abuses the security of people and property, and it is easy to lead to personal information such as personal reputation, physical and mental health damage or discrimination.", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57465, "text": "The personal sensitive information involved in this policy will be displayed with bold fonts.", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57466, "text": "SF will only collect and use your personal information for the following goals described in this policy:", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57467, "text": "(1) Core business function collection and use of your personal information", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57468, "text": "We may collect, save and use the following information related to you to achieve the following functions.", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57469, "text": "If you do not provide relevant information, you will not be able to enjoy related SF services.", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57470, "text": "These functions include:", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57471, "text": "1. Register account", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57472, "text": "In order to complete the creation of the account, you need to provide the following information (collectively referred to as \"account information\"): your mobile phone number, account name/nickname, account password, we will verify that your identity is valid by sending a SMS verification code;", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to complete the creation account, you need to provide the following information (collectively referred to as \"account information\"): your mobile phone number, account name/nickname, account password."}
{"task": "rw_58.jsonl", "id": 57473, "text": "You can also add your birthday, gender, and region. The information you supplement will help us provide you with a high -quality service experience. If you do not provide these supplementary information, it will not affect your basic functions of using SF service.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can also supplement your birthday, gender, and region. The information you supplement will help you provide you with a high -quality service experience."}
{"task": "rw_58.jsonl", "id": 57474, "text": "2. Provide you with logistics services", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57475, "text": "When you place your order or send it or your information as a recipient, SF or SF collected your following information through its authorized business partners: the name, address, contact information and goods of the recipient and recipient of the recipientPiece information (collectively \"transportation information information\"), used to submit orders, generate logistics transportation orders, receives, sort, sort, warehousing, transportation, export customs clearance, import customs clearance, and delivery parts;", "label": ["Important", "First Party Collection Information"], "rewrite": "SF or business partners collect your following information: the name, address, contact information, and cargo information of the sender and the recipient (collectively referred to as the \"transportation information\"), which is used to submit orders, generate logistics transportation orders, receives, points, points, points, points, and dividendsPicking, warehousing, transportation, export customs clearance, import customs clearance, and delivery of goods."}
{"task": "rw_58.jsonl", "id": 57476, "text": "According to relevant legal requirements, we also collect your ID information to verify your identity and import and export customs declaration.", "label": ["Important", "First Party Collection Information"], "rewrite": "We also collect your ID information to verify your identity and import and export customs declaration."}
{"task": "rw_58.jsonl", "id": 57477, "text": "If you provide an inaccurate or wrong address, and on the premise that the compulsory requirements of personal information storage are not violated, we may use your past transportation information to complete and correct the incorrect and wrong address informationIn order to save the time of the address of the address repeatedly, to ensure the timeliness, to prevent you from suffering from the outspread error delivery and delayed delivery, so that you have a better service experience.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may use your past transportation information to complete and correct the inaccurate and wrong address information."}
{"task": "rw_58.jsonl", "id": 57478, "text": "In addition, in the process of providing delegation services for you, if it involves telephone communication, we may record the content of the call to avoid potential disputes.", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57479, "text": "3. Payment settlement", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57480, "text": "After you place an order, you can choose the SF related party or the third -party payment institution that cooperates with SF (such as SF Finance, Alipay, WeChat Pay, and UnionPay, and Internet Union's payment channels.Services, we need to provide your SF order number and transaction amount information to these payment institutions to confirm your payment instructions and complete the payment.", "label": ["Important", "First Party Collection Information"], "rewrite": "We need to provide your SF order number and transaction amount information to the payment institution to confirm your payment instructions and complete the payment."}
{"task": "rw_58.jsonl", "id": 57481, "text": "If you apply for an invoice, you need to provide the following information: the invoice head, the taxpayer identification number, the mailbox address of the ticket, and the more information you provide according to your invoicing needs, such as the purchaser's information.", "label": ["Important", "First Party Collection Information"], "rewrite": "The following information is required to apply for an invoice: the invoice rises, the taxpayer identification number, the mailbox address of the ticket receiver, and the purchase party information."}
{"task": "rw_58.jsonl", "id": 57482, "text": "4. Message push", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57483, "text": "We collect your device information to push you express information, payment status information, and coupons, and promotional information to you.", "label": ["Important", "First Party Collection Information"], "rewrite": "We collect your device information to push you express information, payment status information, and coupons, and promotional information to you."}
{"task": "rw_58.jsonl", "id": 57484, "text": "You can use \"settings\" in mobile phones or other devices or exemption settings in APP, WeChat public account, etc.", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57485, "text": "5. Customer service and after -sales", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57486, "text": "Our customer service and after -sales function will use your account information and transportation information.", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57487, "text": "To ensure your account security, our call center customer service and online customer service will use your account information and transport bill information to verify your identity.", "label": ["Important", "First Party Collection Information"], "rewrite": "Our call center customer service and online customer service will use your account information and transportation information information to verify your identity."}
{"task": "rw_58.jsonl", "id": 57488, "text": "When you need us to provide customer service and after -sales service related to your delivery, we will check your transportation information and cargo route information.", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57489, "text": "You may provide other information outside of the above information when communicating with our customer service staff. If you ask us to change the delivery address, contact or contact number.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57490, "text": "In addition, we will collect the questionnaire response information submitted to us during the questionnaire survey, and you submit the contact name, company name, contact phone number, mailbox address and your consultation on the SF Express websiteinformation.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will also collect the questionnaire answering information submitted to us during the questionnaire survey, and you submit the contact name, company name, contact telephone number, mailbox address and your consultation information provided by \"Cooperation Consultation\" on the SF Express website."}
{"task": "rw_58.jsonl", "id": 57491, "text": "6. Improve our products or services", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57492, "text": "We may analyze your account information and transportation information to form user portraits and provide you with better services.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may analyze your account information and transportation information to form user portraits and provide you with better services."}
{"task": "rw_58.jsonl", "id": 57493, "text": "For information collected from your various devices, we may associate them so that we can provide you with consistent services on these devices.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may associate the collected personal information in order to provide you with consistent services."}
{"task": "rw_58.jsonl", "id": 57494, "text": "We may combine the information from a certain service with information from other services, legal and indirect information, and information obtained by legal public channels, or combine your legal information that can be identified with the legal information that can be identified.Provide you with high -quality services and improve our products and services.", "label": ["Important"], "rewrite": "It may be combined with your information with information that cannot be recognized with personal information to provide you with high -quality services and improve our products and services."}
{"task": "rw_58.jsonl", "id": 57495, "text": "7. Safety transaction security", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57496, "text": "In order to improve the security of the system when using our service, and more accurately prevent the security of fraud and protect accounts on fishing websites, we may judge by understanding your browsing information, transportation information, software information, equipment information you often useYour account risk and may record some links that we think are risky (\"url\");", "label": ["Important", "First Party Collection Information"], "rewrite": "We may judge your account risk by understanding your browsing information, transportation information, your commonly used software information, equipment information, etc., and may record some links that we think are risky (\"url\")."}
{"task": "rw_58.jsonl", "id": 57497, "text": "We will also collect your device information (such as device recognition code) and WeChat ID (for users who use SF services from WeChat) to analyze the SF system issues, statistical traffic, and check the possible risks, and send it to us when you choose to send us to usExcellent information is checked.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will also collect your device information (such as device identification code) and WeChat ID (users who use SF services from WeChat) to analyze, statistical traffic, and check the risks that may exist."}
{"task": "rw_58.jsonl", "id": 57498, "text": "(2) Situation of additional business functions collection and use of your personal information", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57499, "text": "In order to make you more convenient to use SF service, our following additional features may collect and use your personal information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Our additional features may collect and use your personal information."}
{"task": "rw_58.jsonl", "id": 57500, "text": "If you do not provide this information, you can still use SF's service, but you may not be able to use these can bring you convenient additional features or need to fill in some information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57501, "text": "These additional functions include:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57502, "text": "Voice input", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57503, "text": "You can directly use the microphone to enter the voice input form information or consult and interact with our customer service robot.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can directly use the microphone to enter the voice input form information or consult and interact with our customer service robot."}
{"task": "rw_58.jsonl", "id": 57504, "text": "In these features, we will collect your recording content to identify your delivery needs and customer service and after -sales needs.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect your recording content to identify your delivery needs and customer service and after -sales needs."}
{"task": "rw_58.jsonl", "id": 57505, "text": "Map function", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57506, "text": "You can use this function to query SF service point and use the navigation function.", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57507, "text": "If you use this function, we need to collect your geographical location information.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you use this function, we need to collect your geographical location information."}
{"task": "rw_58.jsonl", "id": 57508, "text": "Additional features based on camera (camera)", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57509, "text": "You can use this additional function to complete the code -scan delivery and code scan payment function.", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57510, "text": "Additional features based on address book information", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57511, "text": "You can choose to call your address book information to facilitate the information of the contact person in your address book when filling in the transportation information.", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57512, "text": "The above additional features may require you to open your geographical location (location information), camera (camera), album (picture library), microphone, and address book access to us in your deviceCollection and use.", "label": ["Permission Acquisition", "Important"], "rewrite": "You need to open the access permissions of geographical location (location information), camera (camera), album (picture library), microphone, and address book to achieve the collection and use of information involved in these functions."}
{"task": "rw_58.jsonl", "id": 57513, "text": "You can check the opening state of the above permissions in the \"settings\" of mobile phones and other devices, and you can decide to turn these permissions at any time at any time.", "label": ["Important", "Edit/Control"], "rewrite": "You can check the opening state of the above permissions in the \"settings\" of mobile phones and other devices, and you can decide to turn these permissions at any time at any time."}
{"task": "rw_58.jsonl", "id": 57514, "text": "If you open these permissions, it means that you authorize that we can collect and use these personal information to achieve the above functions;", "label": ["Permission Acquisition", "Important"], "rewrite": "If you turn on these permissions, it means that you authorize us to collect and use these personal information to achieve the above functions."}
{"task": "rw_58.jsonl", "id": 57515, "text": "If you close the authority, we will no longer continue to collect and use your personal information, nor can it provide you with the above functions corresponding to these authorization.", "label": ["Edit/Control", "Important"], "rewrite": "If you close the authority, we will no longer continue to collect and use your personal information, nor can we provide you with the corresponding functions corresponding to the authorization."}
{"task": "rw_58.jsonl", "id": 57516, "text": "Your closure authority will not affect the processing of personal information based on your authorization.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Your closure of authority will not affect the processing of personal information based on authorization."}
{"task": "rw_58.jsonl", "id": 57517, "text": "(3) The situation of indirect acquisition and personal information", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57518, "text": "We may obtain the account information (avatar, nickname) you authorized shared from a third party, and bind your third -party account with your SF account after you agree with this policy, so that you can log in and use directly through a third -party account and use it.SF service.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "May get the account information (avatar, nickname) you authorized shared from a third party."}
{"task": "rw_58.jsonl", "id": 57519, "text": "For example, you can place orders through the third -party channel on the non -SF page (such as the number Pepsi, 58 rotation, and the QQ member privilege mall), SF will obtain your transportation information from these third -party channels, including the name of the sender, phone number, phone number, telephone number, Address and cargo information to provide you with services related to receipt.", "label": ["Important", "First Party Collection Information"], "rewrite": "SF will obtain your transportation information from these third -party channels, including the name, telephone, address and goods information of the receiver, so that you can provide you with receipt -related services."}
{"task": "rw_58.jsonl", "id": 57520, "text": "When you send it to others, make sure that you have obtained the relevant authorization of the recipient, and ensure that SF has the right to process the recipient's personal information in accordance with this policy.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you send it to others, make sure that you have obtained the relevant authorization of the recipient."}
{"task": "rw_58.jsonl", "id": 57521, "text": "If we obtain your personal information from our partners, we will use your personal information on the premise of complying with relevant laws and regulations in accordance with the agreement with the third party and the legality of the source of personal information.Essence", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will use your personal information after confirming the legitimacy of the source of personal information."}
{"task": "rw_58.jsonl", "id": 57522, "text": "(4) Other uses", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57523, "text": "1. SF may send you the advertisements and other business information that SF thought you may be interested in by email, mobile phone text message, etc.", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57524, "text": "2. After the technical means, we can identify the collected personal information, and the information processed information will not be able to identify the subject. You know and agree that we have the right to use the information that has been identified.", "label": ["Important", "Data Security", "Usage"], "rewrite": "You know and agree that we have the right to use information that has been identified."}
{"task": "rw_58.jsonl", "id": 57525, "text": "Under the premise that your personal information is not disclosed, we have the right to analyze and use the user database to use it.", "label": ["Important", "Usage"], "rewrite": "Under the premise that your personal information is not disclosed, we have the right to analyze and use the user database to use it."}
{"task": "rw_58.jsonl", "id": 57526, "text": "3. We will statistics on our service usage and may share these statistics with the public or third -party to show the overall trend of our services.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will statistics on our service usage and may share these statistics with the public or third parties."}
{"task": "rw_58.jsonl", "id": 57527, "text": "But these statistical information does not include any identity information.", "label": ["Important", "Data Security", "Usage"], "rewrite": "Statistical information does not include any identification information of your identity."}
{"task": "rw_58.jsonl", "id": 57528, "text": "4. When we show your personal information, we will use content replacement and anonymous processing to desensitify your information to protect your information security.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "When showing your personal information, we will desensitify your information to protect your information security."}
{"task": "rw_58.jsonl", "id": 57529, "text": "5. When we want to use your personal information for other purposes that are not stated in this policy, or for information collected based on specific purposes, we will solicitYour consent.", "label": ["Permission Acquisition", "Important"], "rewrite": "When we want to use personal information for other purposes or for other purposes, we will solicit your consent in advance."}
{"task": "rw_58.jsonl", "id": 57530, "text": "(5) Exception of consent", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57531, "text": "You fully know that in the following circumstances, we do not need to obtain your authorization consent:", "label": ["Permission Acquisition", "Important", "Risk"], "rewrite": "In the following circumstances, we do not need to obtain your authorization consent if we collect or use personal information:"}
{"task": "rw_58.jsonl", "id": 57532, "text": "1. It is related to national security and national defense security;", "label": ["Permission Acquisition", "Important", "Risk"], "rewrite": "Collecting personal information related to national security and national defense security does not need to solicit consent."}
{"task": "rw_58.jsonl", "id": 57533, "text": "2. Related to public safety, public health, and major public interests;", "label": ["Permission Acquisition", "Important", "Risk"], "rewrite": "Collecting personal information related to public safety, public health, and major public interests does not require consent."}
{"task": "rw_58.jsonl", "id": 57534, "text": "3. It is related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Permission Acquisition", "Important", "Risk"], "rewrite": "Collecting related personal information related to criminal investigation, prosecution, trial, and execution of judgments does not need to ask for consent."}
{"task": "rw_58.jsonl", "id": 57535, "text": "4. For the major legitimate rights and interests of the lives and property of the subject of personal information or other individuals, it is difficult to get my consent;", "label": ["Permission Acquisition", "Important", "Risk"], "rewrite": "Collecting and maintaining major legitimate rights and interests but difficult to get personal information that I agree, without asking for consent."}
{"task": "rw_58.jsonl", "id": 57536, "text": "5. The collected personal information is made to the public to the public;", "label": ["Permission Acquisition", "Important", "Risk"], "rewrite": "The collected personal information is made by the subject of the personal information to the public by themselves without asking for consent."}
{"task": "rw_58.jsonl", "id": 57537, "text": "6. Your personal information collected from the legal publicly disclosed information, such as legal news reports and government information disclosure;", "label": ["Permission Acquisition", "Important", "Risk"], "rewrite": "Your personal information collected from the legal disclosure information does not need to ask for consent."}
{"task": "rw_58.jsonl", "id": 57538, "text": "7. Signing and fulfilling the contract according to your requirements;", "label": ["Permission Acquisition", "Important", "Risk"], "rewrite": "Collecting the personal information necessary for the signing and performing the contract without soliciting consent."}
{"task": "rw_58.jsonl", "id": 57539, "text": "8. The safe and stable operation of the services provided by maintaining the services provided, such as the failure of discovering and disposing of the service;", "label": ["Permission Acquisition", "Important", "Risk"], "rewrite": "Collecting the personal information necessary for the safe and stable operation of maintenance services does not need to ask for consent."}
{"task": "rw_58.jsonl", "id": 57540, "text": "9. It is necessary for legal news reports;", "label": ["Permission Acquisition", "Important", "Risk"], "rewrite": "Collecting the personal information necessary for legal news reports does not need to solicit consent."}
{"task": "rw_58.jsonl", "id": 57541, "text": "10. Other circumstances stipulated in laws and regulations.", "label": ["Permission Acquisition", "Important", "Risk"], "rewrite": "Collect personal information under other circumstances stipulated in the laws and regulations without asking for consent."}
{"task": "rw_58.jsonl", "id": 57542, "text": "According to the law, the personal information of sharing and transferred the identification processing, and ensure that the data receiver cannot restore and re -identify the subject of personal information, which does not belong to the external sharing, transfer and public disclosure of personal information.Save and processing will not be notified to you separately and obtain your consent.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "The preservation and processing of personal information that is identified by sharing and transferred to the identification processing does not need to notify you and obtain your consent."}
{"task": "rw_58.jsonl", "id": 57543, "text": "2. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57544, "text": "(1) Cookie", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57545, "text": "To ensure the normal operation of the website, we will store small data files named Cookie on your computer or mobile device.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will store small data files named Cookie on your computer or mobile device."}
{"task": "rw_58.jsonl", "id": 57546, "text": "Cookie usually contains identifiers, site names, and some numbers and characters.", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57547, "text": "With Cookie, websites can store data such as your preferences.", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57548, "text": "We will not use Cookie for any purpose outside the purpose of this policy.", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57549, "text": "You can manage or delete according to your preferences, cookies.", "label": ["Important", "Edit/Control"], "rewrite": "You can manage or delete Cookie according to your preferences."}
{"task": "rw_58.jsonl", "id": 57550, "text": "See AboutCookies.org for details.", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57551, "text": "You can clear all the cookies saved on the computer, and most of the network browsers have the function of preventing cookies.", "label": ["Important", "Edit/Control"], "rewrite": "You can clear all the cookies saved on the computer."}
{"task": "rw_58.jsonl", "id": 57552, "text": "But if you do this, you need to change the user settings when you visit our website.", "label": ["Important", "Edit/Control"], "rewrite": "You need to change the user setting in person every time you visit our website."}
{"task": "rw_58.jsonl", "id": 57553, "text": "To learn more about how to change the browser settings in detail, visit the related setting page of the browser you use.", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57554, "text": "(2) Website beacon and pixel label", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57555, "text": "In addition to Cookie, we will also use other similar technologies such as website beacons and pixel labels on the website.", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57556, "text": "For example, the email we send to you may contain a link to the URL of the content of the content of our website.", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57557, "text": "If you click the link, we will track this click to help us understand your product or service preferences and improve customer service.", "label": ["Important", "Usage"], "rewrite": "If you click the link, we will track this click."}
{"task": "rw_58.jsonl", "id": 57558, "text": "Website beacon is usually a transparent image embedded in a website or email.", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57559, "text": "With the pixel labels in emails, we can know whether the email has been opened.", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57560, "text": "If you don't want your activities to be tracked in this way, you can withdraw from our signal list at any time.", "label": ["Important", "Edit/Control"], "rewrite": "If you don't want your activities to be tracked in this way, you can withdraw from our signal list at any time."}
{"task": "rw_58.jsonl", "id": 57561, "text": "(3) Do Not Track (Do not track)", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57562, "text": "Many network browsers have the Do not track function, which can release the DO Not Track request to the website.", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57563, "text": "At present, the major Internet standard organization has not yet established relevant policies to stipulate how websites should respond to such requests.", "label": ["Important", "Risk"], "rewrite": "The main Internet standard organization has not yet established relevant policies to stipulate how websites should respond to such requests."}
{"task": "rw_58.jsonl", "id": 57564, "text": "But if your browser enables Do Not Track, all our websites will respect your choices.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57565, "text": "3. How can we share, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57566, "text": "(1) Sharing", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57567, "text": "1. We will not share your personal information with any company, organization and individual other than SF, except the following situations: except:", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "We will not share your personal information with any company, organization and individual other than SF, except the following situations:"}
{"task": "rw_58.jsonl", "id": 57568, "text": "(1) Shared in the case of obtaining clear consent: After getting your clear consent, we will share your personal information with other parties;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "After getting your clear consent, we will share your personal information with other parties."}
{"task": "rw_58.jsonl", "id": 57569, "text": "(2) We may share your personal information to the outside world in accordance with the provisions of laws and regulations, or in accordance with the mandatory requirements of the government department;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "We may share your personal information to the outside world in accordance with the provisions of laws and regulations, or in accordance with the mandatory requirements of government authorities."}
{"task": "rw_58.jsonl", "id": 57570, "text": "(3) Within the scope permitted by laws and regulations, it is necessary to provide it in order to maintain the damage of SF or partners, you or other SF users, or the public interest, property or security.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Within the scope permitted by laws and regulations, personal information is shared for users or public interests, property, or security."}
{"task": "rw_58.jsonl", "id": 57571, "text": "(4) Only by sharing your information can we realize the core function of our service or provide the services you need;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Only when sharing information can realize the core function or provide services, you can share personal information."}
{"task": "rw_58.jsonl", "id": 57572, "text": "(5) You should handle your disputes or disputes with others for you;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "You can share your personal information for you to deal with your disputes or disputes with others."}
{"task": "rw_58.jsonl", "id": 57573, "text": "(6) It is provided by the relevant protocols (including the electronic agreement signed online) or other legal documents signed by you;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "If it meets relevant agreements or other legal documents, personal information can be shared."}
{"task": "rw_58.jsonl", "id": 57574, "text": "(7) Based on academic research;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "For academic research, you can share personal information."}
{"task": "rw_58.jsonl", "id": 57575, "text": "(8) Public interest based on social public interests that comply with laws and regulations.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "For social public interests that meet laws and regulations, you can share personal information."}
{"task": "rw_58.jsonl", "id": 57576, "text": "2. Share with our affiliates: Your personal information may be shared with SF's affiliated company.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Your personal information may be shared with SF related companies."}
{"task": "rw_58.jsonl", "id": 57577, "text": "We will only share the necessary personal information and be restricted by the purpose declared in this policy.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only share the necessary personal information and be restricted by the purpose declared in this policy."}
{"task": "rw_58.jsonl", "id": 57578, "text": "If related companies want to change the purpose of personal information, they will solicit your authorization consent again.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If related companies want to change the purpose of personal information, they will solicit your authorization consent again."}
{"task": "rw_58.jsonl", "id": 57579, "text": "Our affiliated company refers to: controlling SF Express Co., Ltd. or its entity, or controlled by SF Express Co., Ltd. or its entity, or any entity under the joint control of SF Express Co., Ltd. or its entity,The word \"control\" means directly or indirectly control or control more than 50%of voting rights.", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57580, "text": "3. Sharing with authorized partners: Only in order to achieve the purpose of this policy, some of our services will be provided by authorized partners.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57581, "text": "We may share some of your personal information with our partners to provide better customer service and user experience.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share some of your personal information with our partners to provide better customer service and user experience."}
{"task": "rw_58.jsonl", "id": 57582, "text": "For example, when we provide you with customs clearance services, we may share your personal information with customs clearance service providers to arrange partners to provide services.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share your personal information with customs clearance service providers to arrange partners to provide services."}
{"task": "rw_58.jsonl", "id": 57583, "text": "We will only share the necessary personal information for providing services. Our partners have no right to use the personal information that shared for any other purpose.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only share the personal information necessary for providing services."}
{"task": "rw_58.jsonl", "id": 57584, "text": "At present, our authorized partners include the following types:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Our authorized partners include the following types:"}
{"task": "rw_58.jsonl", "id": 57585, "text": "1) Suppliers, service providers and other partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Authorized partners include suppliers, service providers and other partners."}
{"task": "rw_58.jsonl", "id": 57586, "text": "Customs clearance, terminal dispatch, convenient payment, providing customer service, providing data storage or data analysis services, providing third -party additional business functions (such as voice input, map function), or academic research and investigation.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We send information to suppliers, service providers and other partners that support our business worldwide."}
{"task": "rw_58.jsonl", "id": 57587, "text": "Our related companies apply the same data compliance management system, this policy, and related confidentiality and security measures.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Our related companies apply the same data compliance management system, this policy, and related confidentiality and security measures."}
{"task": "rw_58.jsonl", "id": 57588, "text": "For companies, organizations, and individuals outside our affiliated companies that share our personal information, we will sign a strict confidentiality agreement/data processing agreement with them, asking themSafety measures to handle personal information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will sign a strict confidentiality agreement/data processing agreement with the main body of shared information."}
{"task": "rw_58.jsonl", "id": 57589, "text": "(2) Transfer", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57590, "text": "We will not transfer your personal information to any company, organization and individual, except the following situations: except:", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "We will not transfer your personal information to any company, organization and individual, except the following situations: except:"}
{"task": "rw_58.jsonl", "id": 57591, "text": "1. In the case of obtaining clear consent: After getting your clear consent, we will transfer your personal information to other parties;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "After getting your clear consent, we will transfer your personal information to other parties."}
{"task": "rw_58.jsonl", "id": 57592, "text": "2. When involving mergers, acquisitions or bankruptcy liquidation, if personal information is transferred, we will require new companies and organizations to continue to be subject to this policy.Solo your authorization consent;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "If it involves the transfer of personal information, we will ask the new subject to be subject to this policy, otherwise we will ask them to re -solicit authorization consent."}
{"task": "rw_58.jsonl", "id": 57593, "text": "3. It is provided by the relevant protocols (including the electronic agreement signed online) or other legal documents signed by you;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "If you meet relevant agreements or other legal documents, personal information will be transferred."}
{"task": "rw_58.jsonl", "id": 57594, "text": "4. Provide by the requirements of applicable laws and regulations, legal procedures, mandatory administrative or judicial requirements.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Transfer personal information in accordance with the requirements of applicable laws and regulations, legal procedures, mandatory administrative or judicial requirements."}
{"task": "rw_58.jsonl", "id": 57595, "text": "(3) Public disclosure", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57596, "text": "We will only publicly disclose your personal information in the following circumstances:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only publicly disclose your personal information in the following circumstances:"}
{"task": "rw_58.jsonl", "id": 57597, "text": "1. After getting your clear consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After getting your clear consent, disclose personal information."}
{"task": "rw_58.jsonl", "id": 57598, "text": "2. Based on legal disclosure: In the case of compulsory requirements of legal, legal procedures, litigation or government authorities, we may disclose your personal information publicly.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "With the compulsory requirements of legal, legal procedures, litigation, or government authorities, your personal information may be disclosed."}
{"task": "rw_58.jsonl", "id": 57599, "text": "4. How do we protect and save your personal information", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57600, "text": "(1) How do we protect your personal information security", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57601, "text": "1. We have obtained the following certifications: International ISO27701, International ISO29151, International ISO27001 Certification and Ministry of Public Security Level Protection Evaluation III certification.", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57602, "text": "2. SF set up a data security management organization to adopt personal information in physics (access control isolation, monitoring system), management (formulate information security system system, classify data classification, sign confidentiality agreement with employees, carry out data security and privacy protection training, and training, and privacy protection training, and privacy protection training,, and privacy protection training,, and privacy protection training, and privacy protection training, and privacy protection training, and training, privacy protection training, and privacy protection training.Regularly carry out compliant self -assessment) and technology (safe browsing by HTTPS to ensure transmission encryption, adopt AES256 encryption technology to ensure data storage and encryption, sensitive information content display desensitization, anonymous processing, system visits and deployment of dual -factor certification access control mechanisms, and system visits and deployment.Security measures such as automation code inspection, log audit) strive to protect your personal information from unauthorized access, use, disclose, modify, damage or lose and other forms of illegal treatment.", "label": ["Important", "Data Security"], "rewrite": "SF set up a data security management organization to take security measures to protect your personal information."}
{"task": "rw_58.jsonl", "id": 57603, "text": "However, no Internet transmission or electronic storage method is 100%safe.", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57604, "text": "Therefore, although we can protect your personal information in a business -acceptable way, we still cannot guarantee the absolute security of the information.", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57605, "text": "3. We will regularly organize safety emergency plans to prevent safety incidents from occurring.", "label": ["Important", "Data Security"], "rewrite": "We will regularly organize safety emergency plans to prevent safety incidents from occurring."}
{"task": "rw_58.jsonl", "id": 57606, "text": "If the data security obtained and stored in the unfortunate occurrence of SFK is harmful, or when the non -public information of the user (such as a hacker attack) is disclosed to an unrelated third party, although there are other provisions of the policy in this policy, SFFO, SFOIt will also start emergency plans to form an emergency emergency group, start the process, conduct internal investigations, report, and notify the regulatory authorities, and cooperate with the supervision department to reduce the impact of accidents on users.In the form of announcement, inform relevant users, inform the disclosed information and SF's knowledge of these situations.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57607, "text": "(2) The preservation period of personal information", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57608, "text": "Your account information and related equity and virtual asset information in your account will be deleted immediately after you cancel the account, but the account of individual order channels has a certain period of repentance (such as 30 days). The information will be deleted after this period.Essence", "label": ["Data Retention", "Important"], "rewrite": "Your account information and related equity and virtual asset information in your account will be deleted immediately after you cancel your account, but there is a period of repentance (such as 30 days) with a certain period of time, and the information will be deleted after this period."}
{"task": "rw_58.jsonl", "id": 57609, "text": "Once such information is deleted, it cannot be restored.", "label": ["Data Retention", "Important", "Risk"], "rewrite": "Once such information is deleted, it cannot be restored."}
{"task": "rw_58.jsonl", "id": 57610, "text": "In order to meet your inquiries, your transportation information will retain the period between the SF front platform system ranging from 30 days and six months (depending on the specific order channel).The person's mobile phone number or transport order number is on the official website of SF Express and your order (such as the SF Express APP, WeChat public account).The shipping information information keeps it unable to be retrieved or accessed, or anonymous processing it.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "In order to meet your inquiries, your transportation information will retain the deadlines ranging from 30 days to six months at the SF front system.After satisfying this period, we will remove your transportation information or perform anonymous processing."}
{"task": "rw_58.jsonl", "id": 57611, "text": "Your personal information will be preserved for a longer period of time in the SF background system. The specific period will be determined according to the types of personal information, laws and regulations, and meet the purpose of this policy.", "label": ["Data Retention", "Important"], "rewrite": "Your personal information will be preserved for a longer period in the SF background system."}
{"task": "rw_58.jsonl", "id": 57612, "text": "4. If we terminate our services or operations, we will notify you at least 30 days in advance, and delete or anonymous processing of your personal information after termination of the service or operation.", "label": ["Data Retention", "Important"], "rewrite": "If the service or operation is terminated, it will notify you at least 30 days in advance and delete or processes your personal information."}
{"task": "rw_58.jsonl", "id": 57613, "text": "5. Your rights", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57614, "text": "In accordance with China's relevant laws, regulations, standards, and the practice of other countries and regions, we guarantee that you exercise the following rights on your personal information:", "label": ["Important", "Edit/Control"], "rewrite": "We guarantee your right to exercise your personal information:"}
{"task": "rw_58.jsonl", "id": 57615, "text": "(1) Visit your personal information", "label": ["Important", "Edit/Control"], "rewrite": "You can access personal information."}
{"task": "rw_58.jsonl", "id": 57616, "text": "You have the right to access your personal information, except for the exception stipulated in laws and regulations.", "label": ["Edit/Control", "Important"], "rewrite": "You have the right to access your personal information, except for the exception stipulated in laws and regulations."}
{"task": "rw_58.jsonl", "id": 57617, "text": "If you want to exercise the right to access, you can access it by yourself through the following ways:", "label": ["Important", "Edit/Control"], "rewrite": "If you want to exercise the right to access, you can access it by yourself through the following ways:"}
{"task": "rw_58.jsonl", "id": 57618, "text": "Account Information -If you want to access or edit your personal information in your account, you can log in to your registered SF relevant website, APP, WeChat public account, etc. in SF's account number and password to check your registrationPersonal information provided.", "label": ["Edit/Control", "Important"], "rewrite": "You can use SF related websites, APPs, WeChat public accounts, etc. to query your personal information provided when registering."}
{"task": "rw_58.jsonl", "id": 57619, "text": "Send records and transaction records-you can log in to your registered SF relevant website, APP, WeChat public account, etc. to check your information with your account number and password on SF.", "label": ["Important", "Edit/Control"], "rewrite": "You can log in to SF related websites, APPs, WeChat public accounts, etc. to see your information."}
{"task": "rw_58.jsonl", "id": 57620, "text": "Sending and receiving information -You can log in to your registered SF relevant website, APP, WeChat public account, etc. with your accounts and passwords in SF, to modify and delete your delivery address and commonly used receipt address (partial partially (partially partiallyThe channel does not support this function).", "label": ["Important", "Edit/Control"], "rewrite": "You can log in to SF related websites, APPs, WeChat public accounts, etc., to build, modify and delete your delivery address and commonly used receipt address."}
{"task": "rw_58.jsonl", "id": 57621, "text": "If you need to visit other personal information you generated during our products or services, you can contact us, and we will respond to your request according to the way and periods listed in this policy.", "label": ["Important", "Edit/Control"], "rewrite": "If you need to access personal information, you can contact us, and we will respond to requests according to the methods and deadlines listed in this policy."}
{"task": "rw_58.jsonl", "id": 57622, "text": "(2) Correct your personal information", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57623, "text": "When you find that we have the error about your personal information, you have the right to ask us to make corrections.", "label": ["Important", "Edit/Control"], "rewrite": "When you find that we have the error about your personal information, you have the right to ask us to make corrections."}
{"task": "rw_58.jsonl", "id": 57624, "text": "You can correct your personal information in the way you can listed in \"(1) access your personal information\".", "label": ["Important", "Edit/Control"], "rewrite": "You can correct your personal information in the way you can listed in \"(1) access your personal information\"."}
{"task": "rw_58.jsonl", "id": 57625, "text": "If you need to correct other personal information generated during your product or service, such as modifying the delivery address and contact number, you can contact our customer service.", "label": ["Important", "Edit/Control"], "rewrite": "If you need to correct personal information, such as modifying the delivery address and contact number, you can contact our customer service."}
{"task": "rw_58.jsonl", "id": 57626, "text": "(3) Delete your personal information", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57627, "text": "In the following circumstances, you can make a request to delete personal information:", "label": ["Important", "Edit/Control"], "rewrite": "In the following circumstances, you can make a request to delete personal information:"}
{"task": "rw_58.jsonl", "id": 57628, "text": "1. If our behavior of handling personal information violates laws and regulations;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57629, "text": "2. If we collect and use your personal information, it has not obtained your consent;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57630, "text": "3. If our behavior of handling personal information violates your agreement;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57631, "text": "4. If you no longer use our products or services, or you cancel your account;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57632, "text": "5. If we no longer provide products or services for you.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57633, "text": "If we decide to respond to your deletion request, we will also notify it as much as possible from the entities that obtain your personal information as much as possible, and ask them to delete them in time, unless the laws and regulations have other regulations, or these entities have obtained your independent authorization.", "label": ["Important", "Edit/Control"], "rewrite": "If we decide to respond to the deletion request, we will also require personal information entities to delete them in time, unless the laws and regulations have other regulations, or these entities have obtained your independent authorization."}
{"task": "rw_58.jsonl", "id": 57634, "text": "When you delete the information from our services, we may not back up the corresponding information in the system, but will delete these information when the backup is updated.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "When you delete the information from the service, we may not delete the corresponding information immediately, but will delete these information when the backup is updated."}
{"task": "rw_58.jsonl", "id": 57635, "text": "(4) Change the scope of your authorization consent", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57636, "text": "Each business function requires some basic personal information to complete (see the \"first part\" of this policy).", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57637, "text": "For the collection and use of additional personal information, you can give or withdraw your authorization consent at any time.", "label": ["Important", "Edit/Control"], "rewrite": "For the collection and use of additional personal information, you can give or withdraw your authorization consent at any time."}
{"task": "rw_58.jsonl", "id": 57638, "text": "You can set up privacy settings by deleting information, closing the device function, on the SF website, APP, WeChat public account, etc., set or close the relevant authority in your device (see the \"first part\"-\"(2) additional business functions in this policy-\" (2) additional business functionsCollect and use your personal information) to change your authorization of our continued collection of personal information or withdraw your authorization.", "label": ["Edit/Control", "Important"], "rewrite": "You can make privacy settings, set or close the relevant permissions in your device, and change your authorization of the scope of personal information or withdraw authorization."}
{"task": "rw_58.jsonl", "id": 57639, "text": "You can also withdraw all the authorization of our personal information by canceling the account of the account.", "label": ["Important", "Edit/Control"], "rewrite": "You can also withdraw all the authorization of our personal information by canceling the account of the account."}
{"task": "rw_58.jsonl", "id": 57640, "text": "When you recover your consent, we will no longer process the corresponding personal information.", "label": ["Important", "Edit/Control"], "rewrite": "When you recover your consent, we will no longer process the corresponding personal information."}
{"task": "rw_58.jsonl", "id": 57641, "text": "But your decision to recover the consent will not affect personal information processing based on your authorization.", "label": ["Permission Acquisition", "Edit/Control", "Risk", "Important"], "rewrite": "The decision you take back will not affect personal information processing that previously carried out based on authorization."}
{"task": "rw_58.jsonl", "id": 57642, "text": "If you don't want to accept the commercial advertisement we sent to you, you can cancel it at any time:", "label": ["Important", "Edit/Control"], "rewrite": "If you don't want to accept commercial advertisements, you can cancel through the following ways:"}
{"task": "rw_58.jsonl", "id": 57643, "text": "No matter what reason you refuse to receive the relevant information, you can ask SF to send you marketing information to you if you receive the marketing information in the information (such as \"reply TD withdrawal\").Your request.", "label": ["Important", "Edit/Control"], "rewrite": "When receiving marketing information, you can follow the withdrawal prompts in the information (such as \"Reply TD withdrawal\") and require SF no longer sending marketing information to you."}
{"task": "rw_58.jsonl", "id": 57644, "text": "(5) List of personal information main body", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57645, "text": "SF Express Members can submit an account cancellation application through WeChat public account, SF Express App or SF Express official website membership system;", "label": ["Important", "Edit/Control"], "rewrite": "SF Express members can submit an account cancellation application through WeChat public account, SF Express App or SF Express official website membership system."}
{"task": "rw_58.jsonl", "id": 57646, "text": "SF International users can submit an account cancellation application on the cancellation account page of the service function interface after logging in to the account.", "label": ["Important", "Edit/Control"], "rewrite": "SF International users can submit an account cancellation application on the cancellation account page of the service function interface after logging in to the account."}
{"task": "rw_58.jsonl", "id": 57647, "text": "Monthly accounts can be linked to the cancellation of the sales application account to cancel.", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57648, "text": "(6) In response to your above request", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57649, "text": "To ensure safety, you may need to provide a written request or prove your identity in other ways.", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57650, "text": "We may ask you to verify your identity first, and then process your request.", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57651, "text": "We will respond within fifteen days.", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57652, "text": "For your reasonable request, we do not charge fees in principle, but we will charge a certain cost fee depending on the request that repeats and beyond the reasonable limit.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "For your reasonable requests, in principle, you do not charge fees, but you will charge a certain cost fee for multiple repeated and more reasonable requests."}
{"task": "rw_58.jsonl", "id": 57653, "text": "For those who have no repetition and need too much technical means (for example, need to develop new systems or fundamentally change the current practice), bring risks to others' legitimate rights and interests or very unrealistic (for example, information involved in backup tapes)We may refuse.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "We may refuse to reject those who have no repetition, need too much technical means, bring risks or very unrealistic requests to others."}
{"task": "rw_58.jsonl", "id": 57654, "text": "In the following circumstances, in accordance with the requirements of laws and regulations, we will not be able to respond to your request:", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "In the following circumstances, in accordance with the requirements of laws and regulations, we will not be able to respond to your request:"}
{"task": "rw_58.jsonl", "id": 57655, "text": "1. Directly related to national security and national defense security;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Directly related to national security and national defense security cannot respond to requests."}
{"task": "rw_58.jsonl", "id": 57656, "text": "2. Directly related to public safety, public health, and major public interests;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Those who are directly related to public safety, public health, and major public interests cannot respond to requests."}
{"task": "rw_58.jsonl", "id": 57657, "text": "3. Directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Those who are directly related to criminal investigation, prosecution, trial and judgment execution cannot respond to the request."}
{"task": "rw_58.jsonl", "id": 57658, "text": "4. There is sufficient evidence that you have subjective malice or abuse of rights;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "If there is sufficient evidence that you have subjective malicious or abuse of rights, you cannot respond to the request."}
{"task": "rw_58.jsonl", "id": 57659, "text": "5. Response your request will cause the legitimate rights and interests of you or other individuals and organizations to be seriously damaged;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "The response request will cause serious damage to the legitimate rights and interests and cannot respond to the request."}
{"task": "rw_58.jsonl", "id": 57660, "text": "6. Involving business secrets.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Those who involve business secrets cannot respond to requests."}
{"task": "rw_58.jsonl", "id": 57661, "text": "6. How do we deal with children's personal information", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57662, "text": "1. SF attaches great importance to the protection of children's personal information.", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57663, "text": "If you are a child under the age of 14, you should obtain the consent of your guardian before using our products and/or services.", "label": ["Specific Audiences", "Important"], "rewrite": "Children under 14 years of age should obtain the consent of your guardian before using products and/or services."}
{"task": "rw_58.jsonl", "id": 57664, "text": "SF protects the personal information of children in accordance with the provisions of relevant national laws and regulations.", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57665, "text": "2. We will not take the initiative to collect their personal information directly to children.", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57666, "text": "Regarding the consent of the guardian to collect children's personal information, we will only use, share, transfer, or disclose this information when they are allowed, consent of the guardian or protecting children.", "label": ["Specific Audiences", "Important"], "rewrite": "Regarding the consent of the guardian to collect children's personal information, we will only use, share, transfer, or disclose this information when they are allowed, consent of the guardian or protecting children."}
{"task": "rw_58.jsonl", "id": 57667, "text": "3. If the facts have proved that children have not obtained the consent of the guardian, we register and use our products and/or services. We will negotiate with the relevant guardian and try to delete relevant personal information as soon as possible.", "label": ["Specific Audiences", "Important"], "rewrite": "If there is a fact that the child has not obtained the consent of the guardian for registration, we will negotiate with the relevant guardian and delete relevant personal information as soon as possible."}
{"task": "rw_58.jsonl", "id": 57668, "text": "4. For the personal information of children under the age of 14 that may be involved, we will further take the following measures to ensure:", "label": ["Specific Audiences", "Important"], "rewrite": "Personal information that may be involved in the age of 14, we further take the following measures to ensure:"}
{"task": "rw_58.jsonl", "id": 57669, "text": "(1) For the personal information of the collected children, in addition to complying with the agreement on personal information of this privacy policy, we will also adhere to the principles of legitimate necessity, knowledge consent, clear purpose, security, and use according to law.The requirements of laws and regulations such as personal information network protection regulations are stored, used, and disclosed, and will not exceed the period required by the purpose of collection and use. After expiration, we will delete or processes children's personal information.", "label": ["Specific Audiences", "Important", "Data Security"], "rewrite": "For the collected personal information of the children, we will adhere to the principles of legitimate necessity, consent, clear purpose, security guarantee, and use according to law, and strictly follow the requirements of laws and regulations such as the Protection of Children's Personal Information Networks.It will not exceed the necessary period, and after expiration, we will delete or anonymous treatment."}
{"task": "rw_58.jsonl", "id": 57670, "text": "We will designate a special person in charge of the protection of personal information of children, and you can also contact us through customer service hotline 95338.", "label": ["Specific Audiences", "Data Security", "Important"], "rewrite": "We will designate a special person in charge of the protection of personal information of children, and you can also contact us through customer service hotline 95338."}
{"task": "rw_58.jsonl", "id": 57671, "text": "We will also formulate internal special systems for child personal information protection.", "label": ["Specific Audiences", "Data Security", "Important"], "rewrite": "We will also formulate internal special systems for child personal information protection."}
{"task": "rw_58.jsonl", "id": 57672, "text": "(2) When you choose to use SF related services as a guardian as a guardian, we may need to collect personal information of the child who have been guarded by you to perform related services to you.", "label": ["Specific Audiences", "First Party Collection Information", "Important"], "rewrite": "We may need to collect personal information of childcare children."}
{"task": "rw_58.jsonl", "id": 57673, "text": "If you need to collect your personal information to you in the specific service, we will obtain your authorization consent in advance and inform you the purpose and purpose of collecting.", "label": ["Specific Audiences", "First Party Collection Information", "Important"], "rewrite": "If you need to collect your personal information from you, we will obtain your authorization consent in advance and inform you the purpose and purpose of collecting."}
{"task": "rw_58.jsonl", "id": 57674, "text": "If you do not provide the aforementioned information, you will not be able to enjoy the related services we provide.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you do not provide the aforementioned information, you will not be able to enjoy the related services we provide."}
{"task": "rw_58.jsonl", "id": 57675, "text": "In addition, you may actively provide us with personal information to us when using the sun order, evaluation and Q & A function sharing service. Please know and choose carefully.", "label": ["Specific Audiences", "First Party Collection Information", "Important"], "rewrite": "You may take the initiative to provide us with personal information when sharing the information related to the service. Please know and choose carefully."}
{"task": "rw_58.jsonl", "id": 57676, "text": "As a guardian, you should correctly fulfill your duties of guardianship and protect your personal information security.", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57677, "text": "If the child needs to register or use our products and/or services, you should properly guide and guard.", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57678, "text": "(3) Children or their guardians have the right to access and correct the personal information of children at any time, and they can also make a request for correction and deletion to us.", "label": ["Edit/Control", "Specific Audiences", "Important"], "rewrite": "Children or their guardians have the right to access and correct the personal information of children at any time, and they can also make a request for correction and deletion to us."}
{"task": "rw_58.jsonl", "id": 57679, "text": "If you have any opinions, suggestions or complaints, and reports on your personal information related to children, please contact us.", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57680, "text": "We will help you at any time.", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57681, "text": "7. How can your personal information be transferred globally", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57682, "text": "In principle, the personal information we collected and generated in a certain country/region will be stored in the country/region.", "label": ["Data Retention", "Important"], "rewrite": "The personal information we collect and generate in a certain country/region will be stored in the country/region."}
{"task": "rw_58.jsonl", "id": 57683, "text": "If you choose SF international services, because SF international parts adopt a self -operating or partner agency mode, we will transmit international parts of the international parts to the original collecting country/region related companies outside the country/region through the system docking.,Partner.", "label": ["Data Retention", "Important"], "rewrite": "We will transmit the international parts of the information to the original collecting country/region to the original collecting country/region through the system docking."}
{"task": "rw_58.jsonl", "id": 57684, "text": "In addition, to achieve other purposes declared in this policy, your personal information may also be transmitted to countries/regions outside the original collecting country/region.", "label": ["Data Retention", "Important"], "rewrite": "Your personal information may also be transmitted to countries/regions outside the original collecting country/region."}
{"task": "rw_58.jsonl", "id": 57685, "text": "Such countries/regions may have different data protection laws, and even have not even set up relevant laws.", "label": ["Important", "Risk"], "rewrite": "Countries/regions outside the original collection may have different data protection laws, and no relevant laws are set up."}
{"task": "rw_58.jsonl", "id": 57686, "text": "In such circumstances, we will ensure that your personal information is sufficiently protected in the original collecting country/region.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "We will ensure that your personal information gets enough protection in the original collecting country/region."}
{"task": "rw_58.jsonl", "id": 57687, "text": "For example, the transportation information information adopts encrypted transmission, regular evaluation and audit receiving party's security capacity level, and signing data processing protocol/clause.", "label": ["Important", "Data Security"], "rewrite": "Collect the following security measures: the transportation information information adopts encrypted transmission, regularly evaluate the security capacity level of the audit receiving party, and sign the data processing agreement/terms."}
{"task": "rw_58.jsonl", "id": 57688, "text": "8. How to update this policy", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57689, "text": "Our privacy policy may change.", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57690, "text": "Without your clear consent, we will not reduce the rights you should enjoy in accordance with this policy.", "label": ["Important"], "rewrite": "Without your clear consent, we will not reduce the rights you should enjoy in accordance with this policy."}
{"task": "rw_58.jsonl", "id": 57691, "text": "We will post any changes to this policy on this page.", "label": ["Policy Change", "Important"], "rewrite": "We will post any changes to this policy on this page."}
{"task": "rw_58.jsonl", "id": 57692, "text": "For major changes, we will also provide a more significant notice (including for certain services, we will send notifications through emails or SMS to explain the specific changes of privacy policies).", "label": ["Policy Change", "Important"], "rewrite": "For major changes, we will also provide a more significant notice."}
{"task": "rw_58.jsonl", "id": 57693, "text": "The major changes in this policy include, but not limited to:", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57694, "text": "1. Make a major change in our service model.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57695, "text": "Such as the purpose of handling personal information, the type of personal information, the use of personal information, etc.;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57696, "text": "2. We have changed significantly in the aspects of ownership structure and organizational structure.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57697, "text": "Such as changes caused by business adjustments, bankruptcy mergers and acquisitions, etc.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57698, "text": "3. The main object of personal information sharing, transfer or public disclosure changes;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57699, "text": "4. The right to participate in personal information processing and its exercise methods have changed significantly;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57700, "text": "5. When we are responsible for handling the responsible departments, contact methods and complaint channels of personal information security;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57701, "text": "6. Personal information security impact assessment report shows that there is a high risk.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57702, "text": "Nine, how to contact us", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57703, "text": "If you have any questions, opinions or suggestions on this privacy policy, you can contact us in the following ways:", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57704, "text": "SF Express Co., Ltd.", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57705, "text": "Electricity, talk: 95338", "label": ["Important", "Contact Information"], "rewrite": "Electricity: 95338."}
{"task": "rw_58.jsonl", "id": 57706, "text": "Registration address: (Guangdong Province, China) No. 1111, Baoan District, Shenzhen Baoan District International Airport Terminal", "label": ["Important", "Contact Information"], "rewrite": "Registration address: (Guangdong Province, China) No. 1111, No. 4 Road, Baoan District International Airport Terminal."}
{"task": "rw_58.jsonl", "id": 57707, "text": "Common office address: 1st floor of Block B, Block B, Shenzhen Software Industry Base, Shenzhen, Nanshan District, Guangdong Province, China", "label": ["Important", "Contact Information"], "rewrite": "Common office address: 1st floor of Block B, Shenzhen Software Industry Base, Shenzhen, Nanshan District, Guangdong Province, China."}
{"task": "rw_58.jsonl", "id": 57708, "text": "Under normal circumstances, we will reply within fifteen days.", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57709, "text": "If you are not satisfied with our response, especially our personal information processing behavior harms your legitimate rights and interests, you can also seek solutions through the following external channels: complaining or reporting from your country's regulatory authorities, such as ChinasRegulatory departments such as online information, telecommunications, public security and industry and commerce.", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57710, "text": "Attachment:", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57711, "text": "If you are the main information of the country/region, SF's handling of your personal information applies to the following privacy policies:", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57712, "text": "EU: \"Privacy Policy\"", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57713, "text": "Hong Kong/Macau, China: Privacy Policy Statement \"Personal Information (Privacy) Regulations\"", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57714, "text": "Taiwan, China: Privacy Policy Statement \"Personal Data Protection Policy\"", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57715, "text": "South Korea: \"Personal Information Processing Guidelines\"", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57716, "text": "Japan: \"Personal Intelligence Protection\"", "label": [], "rewrite": []}
{"task": "rw_58.jsonl", "id": 57717, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
