{"task": "rw_50.jsonl", "id": 53937, "text": "Baidu map privacy policy", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 53938, "text": "You are welcome to use the services provided by Baidu Map!", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 53939, "text": "Baidu (this privacy policy refers to Beijing Baidu Net News Technology Co., Ltd., also known as \"we\") attaches great importance to your privacy protection and personal information protection.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 53940, "text": "This privacy policy is suitable for access and use of various services provided by Baidu Maps in any way.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 53941, "text": "You can search for road conditions information, merchant information, and position your location through Baidu Maps, carry out path planning, navigation address you want to go, search for surrounding services, etc. (hereinafter collectively referred to as \"Baidu Map Products or Service\").", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 53942, "text": "We will only handle personal information you need to use products or services.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 53943, "text": "This privacy policy is applicable to your web page, mobile terminals (including but not limited to APP, applet), software development tool packs (SDK) and application programming interface (API) for third -party websites and applications for third -party websites and applications.As well as smart hardware terminals including the aforementioned products and services (such as watches, car navigators, smart rearview mirrors, etc.) to access and use our products and services.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 53944, "text": "Baidu maps include but not limited to multiple application versions such as iOS and Android. Please select a version that matches the installed terminal equipment when using Baidu Map.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 53945, "text": "The personal information that Baidu Maps may get depends on the Baidu map application version you use, the specific type/version of the terminal equipment you use, and the functions you use.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 53946, "text": "This privacy policy aims to help you understand which personal information we will collect, why these personal information is collected, what these personal information will use what these personal information do and how to protect these personal information.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 53947, "text": "We will follow your personal information in accordance with your personal information, but we will not collect all your personal information in a compulsory binding method just because you authorize the consent of the privacy policy.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "It will not collect all your personal information in a compulsory binding method just because you authorize the consent of the privacy policy."}
{"task": "rw_50.jsonl", "id": 53948, "text": "We will solicit your separate consent in strict accordance with the requirements of laws and regulations.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will solicit your separate consent in strict accordance with the requirements of laws and regulations."}
{"task": "rw_50.jsonl", "id": 53949, "text": "In addition to this privacy policy, we may also explain the rules of our personal information through product page notifications, pop -ups prompts, information push, etc.The specific rules have the same effect as the privacy policy.", "label": ["Important", "First Party Collection Information"], "rewrite": "In addition to this privacy policy, we may also explain the rules of our personal information through product page notifications, pop -ups prompts, and information push."}
{"task": "rw_50.jsonl", "id": 53950, "text": "Unless laws and administrative regulations have other provisions, in response to how we handle your personal information, you have the right to know and decide, and have the right to restrict or reject us or other parties to deal with your personal information;", "label": ["Important"], "rewrite": "In response to how we handle your personal information, you enjoy the right to know and decide, have the right to restrict or reject us or other parties to handle your personal information."}
{"task": "rw_50.jsonl", "id": 53951, "text": "At the same time, you have the right to ask us to explain to the personal information processing rules we provide.", "label": ["Important"], "rewrite": "You have the right to ask us to explain the personal information processing rules we provide."}
{"task": "rw_50.jsonl", "id": 53952, "text": "Please read and understand the privacy policy carefully before using Baidu maps and related products and services to make appropriate choices.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 53953, "text": "This privacy policy will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 53954, "text": "1. The information we collect and the corresponding purpose of the use", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 53955, "text": "2. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 53956, "text": "3. How do we share, transfer, open disclosure, and entrust your personal information", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 53957, "text": "4. How do we save and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 53958, "text": "5. Your rights", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 53959, "text": "6. How do we deal with the personal information of minors", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 53960, "text": "7. Revision of privacy policy", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 53961, "text": "8. How to contact us", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 53962, "text": "We know the importance of personal information to you, and also know that effective protection for your information is the cornerstone of our business healthy and sustainable development.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 53963, "text": "Thank you for your use and trust in Baidu Map!", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 53964, "text": "We are committed to maintaining your trust in us, abiding by the following principles, and protecting your personal information: the principles of consistency and responsibility, the principles of clear purpose, the principle of choice, at least the principle of safety, the principles of safety, the principle of subject participation, the principle of openness and transparency, etc.Essence", "label": ["Important", "Data Security"], "rewrite": "Adhere to the following principles, protect your personal information: the principles of consistency and responsibility, the principles of clear purpose, the principle of choice consent, the minimum principles, the principles of safety, the principles of subject participation, and the principle of openness and transparency."}
{"task": "rw_50.jsonl", "id": 53965, "text": "We solemnly promise that we will take corresponding security protection measures to protect your personal information in accordance with the mature safety standards of the industry.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 53966, "text": "1. The information we collect and the corresponding purpose of the use", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 53967, "text": "We will follow the principles of legitimate, correct, and necessary to collect and use your personal information.", "label": ["Important", "Data Security"], "rewrite": "We will follow the principles of legitimate, correct, and necessary to collect and use your personal information."}
{"task": "rw_50.jsonl", "id": 53968, "text": "Specifically, we collect and process your personal information for your corresponding business functions.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 53969, "text": "In the corresponding features, if you provide personal information of others, please make sure that you have obtained the authorization of the relevant subject, we reserved the right to check the legal source of these personal information at any time.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you provide personal information of others, please make sure that you have obtained the authorization of the relevant subject, we reserve the right to verify the legal sources of such personal information at any time."}
{"task": "rw_50.jsonl", "id": 53970, "text": "You need to provide us with personal information for us to realize the basic business functions of Baidu maps.", "label": ["Important", "First Party Collection Information"], "rewrite": "You need to provide us with personal information for us to realize the basic business functions of Baidu maps."}
{"task": "rw_50.jsonl", "id": 53971, "text": "In order to achieve the necessary personal information necessary for the information necessary for basic business functions, if you refuse to provide these necessary personal information, we will not be able to provide you with the basic business functions and corresponding services.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If you refuse to provide necessary personal information, we will not be able to provide you with the basic business functions and corresponding services."}
{"task": "rw_50.jsonl", "id": 53972, "text": "In addition to basic business functions, you can choose to provide us with some personal information for us to expand business functions of Baidu maps.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can choose to provide us with some personal information for us to expand business functions of Baidu Maps."}
{"task": "rw_50.jsonl", "id": 53973, "text": "We will tell you the purpose of use and based on your authorization consent or realize the necessary purpose of expanding business functions you choose to process these personal information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will tell you the purpose and process these personal information based on the authorization consent or realizing the purpose of the function."}
{"task": "rw_50.jsonl", "id": 53974, "text": "You refuse to provide such expansion business functions, which will not affect your basic business functions, but if you refuse to provide personal information necessary for implementing the function of expanding business functions, we will not be able to provide you with expanded business functions.", "label": ["Important", "First Party Collection Information"], "rewrite": "You refuse to provide such expansion business functions, which will not affect your use of basic business functions, but if you refuse to provide necessary personal information, we will not be able to provide you with expanded business functions."}
{"task": "rw_50.jsonl", "id": 53975, "text": "To facilitate your understanding, we will be listed below to the business functions, processing purposes and personal information of the provided:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 53976, "text": "1.1. Search, browse", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 53977, "text": "You can use the search and browsing service of Baidu Map without logging in to Baidu account.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 53978, "text": "In order to fulfill the cyber security guarantee obligations stipulated in laws and regulations, the management responsibility of Internet information content, and the more content that shows the correlation and what you may be interested in, our server will automatically record your activity information according to law, including the following:", "label": ["Important", "First Party Collection Information"], "rewrite": "Our server will automatically record your activity information according to law, including the following:"}
{"task": "rw_50.jsonl", "id": 53979, "text": "The search keyword information you entered", "label": ["Important", "First Party Collection Information"], "rewrite": "The server automatically records the search keyword information you entered."}
{"task": "rw_50.jsonl", "id": 53980, "text": "The driving/new energy/truck/taxi/motorcycle/public transport/walking/wisdom/train/passenger car/aircraft starting point of the car you entered", "label": ["Important", "First Party Collection Information"], "rewrite": "The server will automatically record the driving/new energy/new energy/truck/taxi/motorcycle/public transport/walking/wisdom/train/passenger car/aircraft starting point keyword information and search route."}
{"task": "rw_50.jsonl", "id": 53981, "text": "The commute, common address, itinerary information, common functional information you entered", "label": ["Important", "First Party Collection Information"], "rewrite": "The server will automatically record the commute, common address, itinerary information, and common functional information you enter."}
{"task": "rw_50.jsonl", "id": 53982, "text": "Your device information", "label": ["Important", "First Party Collection Information"], "rewrite": "The server automatically records your device information."}
{"task": "rw_50.jsonl", "id": 53983, "text": "Your other log information", "label": ["Important", "First Party Collection Information"], "rewrite": "The server will automatically record your other log information."}
{"task": "rw_50.jsonl", "id": 53984, "text": "We may also use the aforementioned information to bring you more convenient search services and continue to improve Baidu map products and services.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 53985, "text": "For this purpose, we may also use the browser network storage and other mechanisms (including HTML5) and application data cache to collect information on your device and perform local storage.", "label": ["Data Retention", "Important"], "rewrite": "We may also use browser network storage and other mechanisms (including HTML5) and application data cache, collect information and perform local storage."}
{"task": "rw_50.jsonl", "id": 53986, "text": "1.2. Register and log in to account", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 53987, "text": "You can create a Baidu general account through your mobile phone number, and you can improve your account information.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 53988, "text": "When registering and logging in to Baidu General account, you need to provide us with your mobile phone number.", "label": ["Important", "First Party Collection Information"], "rewrite": "When registering and logging in to Baidu General account, you need to provide us with your mobile phone number."}
{"task": "rw_50.jsonl", "id": 53989, "text": "You can choose to set the account name, avatar, login password, account binding mailbox.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 53990, "text": "You can also log in to Baidu Maps with a third -party account (such as WeChat, Weibo, QQ).", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 53991, "text": "At this time, you will authorize Baidu Map to get the public information registered in the third -party account (including your nickname, avatar, and other information you authorize).", "label": ["Important", "First Party Collection Information"], "rewrite": "You will authorize Baidu Map to get the public information registered in the third -party account (including your nickname, avatar, and other information you authorize)."}
{"task": "rw_50.jsonl", "id": 53992, "text": "In order to meet the compulsory requirements of laws and regulations, for providing products or services, or based on your demand for the protection level of account protection, when you use some services of Baidu Maps or you have further needs, you need to provide your true realName, ID number, face information completes the real -name authentication of the account number.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use some services in Baidu Map or have further demand, you need to provide your real name, ID number, face information to complete the real -name authentication of the account number."}
{"task": "rw_50.jsonl", "id": 53993, "text": "If you do not register your account and log in to Baidu Maps, it will not prevent you from using most of the business functions of Baidu Map, but it may affect the business functions you need to use by real -name authentication.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 53994, "text": "In order to verify the accuracy and integrity of the information, or to ensure your account security, we may make your corresponding information preserved by the agencies or government agencies allowed by the real -name information and laws and regulations provided to BaiduComparison test.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "We may compare and verify your corresponding information preserved by the agencies or agencies allowed by the real -name information and laws and regulations provided by Baidu to the institutions or government agencies."}
{"task": "rw_50.jsonl", "id": 53995, "text": "You can choose whether to log in to Baidu Maps by yourself. If you choose the login method, the operator will process your mobile phone number information.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can choose whether to log in to Baidu Maps by yourself. If you choose the login method, the operator will process your mobile phone number information."}
{"task": "rw_50.jsonl", "id": 53996, "text": "When you log in to Baidu Map via Baidu account, you have authorized the consent of your authorization, including the information under the same Baidu account, including but not limited to the retrieval history, collection clip information, common address information, historical itinerary records, navigation information on Baidu map, Vehicle information (such as: license plate number, vehicle type, power type, car purchase year, model information), will be synchronized to Baidu Cloud to realize different device terminals on the same account number of Baidu (including but not limited to Baidu map mobile version, Baidu map car, Baidu map carEdition) Information synchronization.", "label": ["Important", "First Party Collection Information"], "rewrite": "After logging in to Baidu Maps through Baidu account, with the consent of your authorization, the use information under the same Baidu account will be synchronized to Baidu Cloud."}
{"task": "rw_50.jsonl", "id": 53997, "text": "You have the right to cancel the corresponding authorization, Baidu Map will no longer synchronize the corresponding information", "label": ["Important", "First Party Collection Information"], "rewrite": "You have the right to revoke the corresponding authorization, Baidu Map will no longer synchronize the corresponding information."}
{"task": "rw_50.jsonl", "id": 53998, "text": "1.3. Release and interaction", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 53999, "text": "When you publish comments and Q & A, we will collect your comments, questions, answers, and uploaded pictures, audio and video, and display your nicknames, avatars, publishing content and information, or recommend related content publishers for youEssence", "label": ["Important", "First Party Collection Information"], "rewrite": "When you publish comments and Q & A, we will collect your comments, questions, answers, and uploaded pictures, audio and video, and display your nicknames, avatars, publishing content and information, or recommend related content publishers for youEssence"}
{"task": "rw_50.jsonl", "id": 54000, "text": "When you publish pictures and audio and video functions, we will apply for the cameras, photos, and recording rights of your device system.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you publish pictures and audio and video functions, we will apply for the cameras, photos, and recording rights of your device system."}
{"task": "rw_50.jsonl", "id": 54001, "text": "If you refuse to authorize, you will not be able to use the corresponding function, but it does not affect other functions that you can achieve based on the above permissions without affecting your normal use of Baidu maps.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you refuse to authorize, you will not be able to use the corresponding function, but it does not affect other functions that you can achieve based on the above permissions without affecting your normal use of Baidu maps."}
{"task": "rw_50.jsonl", "id": 54002, "text": "When you publish navigation road conditions chat information/above reporting navigation issues/publishing accident reviews/publishing truck route mutual assistance chat information, we will collect information such as chat text, expressions, pictures, videos, sharing routes, and show your nickname, avatar, release, releaseContent and information, or recommending related content publishers for you.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you publish a chat information for navigation road conditions, we will collect information such as chat text, expressions, pictures, videos, sharing routes, and display your nicknames, avatars, publish content and information, or recommend related content publishers for you."}
{"task": "rw_50.jsonl", "id": 54003, "text": "When you publish a panoramic message, we will collect the panoramic message information you posted, and display your nickname, avatar, publishing content and information, or recommending related content publishers for you.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you publish a panoramic message, we will collect the panoramic message information you posted, and display your nickname, avatar, publishing content and information, or recommending related content publishers for you."}
{"task": "rw_50.jsonl", "id": 54004, "text": "When you make information sharing or receive information, we will read the passwords, links and other contents in the shear plate to realize the jump and sharing of the information content.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you make information sharing or receive information, we will read the passwords, links and other contents in the shear plate to realize the jump and sharing of the information content."}
{"task": "rw_50.jsonl", "id": 54005, "text": "When you pay attention to or share your account, or browse, collecting, following attention, comments, likes and reposts, we will collect your aforementioned information and display the content published by the corresponding content publisher, or recommend you that you may be interested in you.Publisher of similar content or content.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you pay attention or share your account, or browse, collecting, following attention, comments, likes, and reposting, we will collect your aforementioned information and display the content published by the corresponding content publisher."}
{"task": "rw_50.jsonl", "id": 54006, "text": "In principle, the information you choose to publish publicly will be visible to all users. If you involve your personal information and even sensitive personal information, please consider it carefully.", "label": ["Risk"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54007, "text": "If your personal information involves the personal information of others, you need to obtain the consent of others before disclosure.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If your personal information involves the personal information of others, you need to obtain the consent of others before disclosure."}
{"task": "rw_50.jsonl", "id": 54008, "text": "1.4. Voice call", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54009, "text": "Baidu Map provides you with voice dialing service.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54010, "text": "If you use voice dial -up call function services, we will apply for the call of your device system to call and access the communication recording authority.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you use voice dial -call function services, we will apply for the call of your device system to call and access the communication recording authority."}
{"task": "rw_50.jsonl", "id": 54011, "text": "After your authorization and consent, we will only collect your address book contact name information to improve the success rate of the recognition of voice instructions.", "label": ["Important", "First Party Collection Information"], "rewrite": "After your authorization consent, you will only collect your address book contact name information to improve the success rate of recognition of voice instructions."}
{"task": "rw_50.jsonl", "id": 54012, "text": "You can further understand the voice dial-call function service (voice assistant skills center) through the [Settings]-[Voice Settings]-[Use help and privacy settings]-[Use help and privacy settings in Baidu Map.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54013, "text": "You can obtain your call and access to the communication recording authority by canceling the system authorized Baidu Map at any time to stop the collection of your information. After that, you may not be able to use the relevant services provided by the above -mentioned call and address book contact name information.Or features, or the effect of the relevant services provided by the above -mentioned calls based on dial -up and address book contact name information, but it will not affect other business functions that can be realized based on the above permissions that are not based on the above permissions.", "label": ["Important", "Edit/Control"], "rewrite": "You can get your call and access to the communication recording authority by canceling the system authorized Baidu Map at any time to stop our collection of your information."}
{"task": "rw_50.jsonl", "id": 54014, "text": "The address information of the address book contacts is sensitive personal information. You can at any time authorize the system to authorize Baidu map access at any time, stop our collection of your address book contact name information, and then you may not be able to use the above -mentioned calls and address book contacts.The relevant services or functions provided by human name information, or the effects of the relevant services provided by the above -mentioned calls based on dial -up and address book contacts, will not affect your normal use of Baidu maps.The business functions that can be realized by recording permissions.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "The address book contact name information is a sensitive personal information. You can at any time authorize the system to authorize Baidu map access at any time to stop our collection of name information information about your address book."}
{"task": "rw_50.jsonl", "id": 54015, "text": "1.5. Recording voice bags", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54016, "text": "Baidu Map provides you with a recording voice bag service.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54017, "text": "If you use the recording voice bag service, we will apply for the recording authority of your device system.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you use the recording voice bag service, we will apply for the recording authority of your device system."}
{"task": "rw_50.jsonl", "id": 54018, "text": "After you have authorized consent, we will collect your voice information to synthesize the voice pack.", "label": ["Important", "First Party Collection Information"], "rewrite": "After you have authorized consent, we will collect your voice information to synthesize the voice pack."}
{"task": "rw_50.jsonl", "id": 54019, "text": "You can learn from the [Settings]-[Voice Settings]-[Record Package]-[Select Record Mode]-[Voice Customization Rules] through Baidu Map to further understand the functional service of recording voice packages.", "label": ["Important", "Edit/Control"], "rewrite": "You can use the [Settings]-[Voice Settings]-[Record Voice Pack]-[Select Record Mode]-[Voice Customization Rules] through Baidu Maps to further understand the recording voice package function service."}
{"task": "rw_50.jsonl", "id": 54020, "text": "You can obtain your recording authority by canceling the system authorized Baidu Map at any time to stop the collection of your voice information. After that, you may not be able to use the above -mentioned related services or functions provided by voice information, or you cannot reach the above -mentioned voice information provided by providing voice information provided by the provision of voice information.The effects that related services are intended to achieve, but it will not affect other business functions that can be realized based on the above permissions that you use Baidu Maps.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "You can get your recording authority by canceling the system authorized Baidu Map at any time to stop our collection of your voice information."}
{"task": "rw_50.jsonl", "id": 54021, "text": "Voice information may contain sensitive personal information. You can at any time to cancel the system authorized recording permission to stop the collection of your voice information. After that, you may not be able to use the relevant services or functions provided by the above -mentioned voice information, or you cannot reach the aboveThe effects of related services provided by voice information will be achieved, but it will not affect your normal use of Baidu map other business functions that can be achieved based on voice information.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Voice information may contain sensitive personal information. You can stop the collection of your voice information by cancel the system authorized recording authority access at any time."}
{"task": "rw_50.jsonl", "id": 54022, "text": "1.6. Voice Assistant", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54023, "text": "Baidu Map provides you with voice assistant services.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54024, "text": "If you use the voice assistant functional service, we will apply for the recording authority of your device system.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you use the voice assistant functional service, we will apply for the recording authority of your device system."}
{"task": "rw_50.jsonl", "id": 54025, "text": "After your authorization and consent, we will collect your voice information so that Baidu Map Voice Assistant completes the execution of voice recognition, parsing and voice instructions.", "label": ["Important", "First Party Collection Information"], "rewrite": "After your authorization and consent, we will collect your voice information so that Baidu Map Voice Assistant completes the execution of voice recognition, parsing and voice instructions."}
{"task": "rw_50.jsonl", "id": 54026, "text": "You can use the [Mine]-[Settings]-[Voice Settings]-[Use help and privacy settings guidelines]-[Skill] through Baidu Maps to further understand the function of voice assistant.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54027, "text": "You can obtain your recording authority by cancel the system authorized Baidu Map at any time, stop our collection of your information, and then you may not be able to use the above -mentioned related services or functions of voice information, or cannot reach the above -mentioned relevant voice information related to the relevant voice information provided by voice information.The effect that the service intends to achieve, but it will not affect other business functions that can be realized based on the above permissions that you use the Baidu map.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "You can obtain your recording authority by canceling the system authorized Baidu Map at any time to stop our collection of your information."}
{"task": "rw_50.jsonl", "id": 54028, "text": "Voice information may contain sensitive personal information. You can at any time authorize Baidu map access by cancel the system, stop our collection of your voice information. After that, you may not be unable to use the above -mentioned related services or functions provided by voice information, or you cannot reach the aboveThe effects of related services provided by voice information will be achieved, but it will not affect your normal use of Baidu map other business functions that can be realized without recording permissions.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Voice information may contain sensitive personal information. You can at any time authorize Baidu Map access at any time to stop our collection of your voice information."}
{"task": "rw_50.jsonl", "id": 54029, "text": "1.7. Footprint", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54030, "text": "Baidu Map provides you with footprint services.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54031, "text": "If you use your footprint service, we will apply for the positioning authority of your device system.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you use your footprint service, we will apply for the positioning authority of your device system."}
{"task": "rw_50.jsonl", "id": 54032, "text": "After you have authorized consent, we will collect your location information to record your travel location and route.", "label": ["Important", "First Party Collection Information"], "rewrite": "After you have authorized consent, we will collect your location information to record your travel location and route."}
{"task": "rw_50.jsonl", "id": 54033, "text": "You can learn more about footprint services through the [Mine]-[Footprint] in Baidu Map.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54034, "text": "You can obtain your positioning authority by canceling the system authorized Baidu map at any time, stop our collection of your information, and then you may not be unable to use the relevant services or functions provided by the above location information, or cannot reach the above -mentioned location -based information provided by the location information provided by the location information.Related services are intended to achieve, but it will not affect other business functions that can be realized based on the above permissions that you use Baidu Maps.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "You can obtain your positioning authority by canceling the system authorized Baidu Map at any time to stop our collection of your information."}
{"task": "rw_50.jsonl", "id": 54035, "text": "Location information is a sensitive personal information. You can at any time authorize Baidu Map access by cancel the system to stop the collection of your location information. After that, you may not be able to use the relevant services or functions provided by the above location information, or it cannot reach the above -mentioned -based based on the above -mentioned -based based on the location information.The relevant services provided by the location information will be achieved, but it will not affect your normal use of Baidu map other business functions that can be achieved based on positioning permissions.", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "Location information is a sensitive personal information. You can at any time authorize the system to access Baidu map access at any time to stop our collection of your location information."}
{"task": "rw_50.jsonl", "id": 54036, "text": "1.8. Parking assistant", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54037, "text": "Baidu Map provides you with a parking assistant platform service.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54038, "text": "In the parking assistant platform service, you can use the function of parking appointment, parking payment, and car search.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54039, "text": "If you use the parking reservation function, based on service needs, you need to provide us with your mobile phone number, license plate number, parking information (including the parking lot, parking time, parking time of parking, etc., the specific information is based on page display), So that the partner parking lot will make a parking space for you according to your requirements.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you use the parking appointment function, based on service needs, you need to provide us with your mobile phone number, license plate number, parking information (including the parking lot, parking time, parking time of parking, etc., the specific information is based on page display)Essence"}
{"task": "rw_50.jsonl", "id": 54040, "text": "If you use the parking payment function, based on service needs, you need to provide us with your mobile phone number and license plate number in order to check your parking fee orders for you;", "label": ["Important", "First Party Collection Information"], "rewrite": "If you use the parking payment function, based on service needs, you need to provide us with your mobile phone number and license plate number in order to check your parking fee orders for you."}
{"task": "rw_50.jsonl", "id": 54041, "text": "If you need to pay the parking fee, we will guide you to the payment system for the parking lot to pay the parking fee.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54042, "text": "If you use the car search function, based on service needs, you need to provide us with your license plate number in order to provide you with a car search service and find your parking location.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you use the car search function, based on service needs, you need to provide us with your license plate number in order to provide you with a car search service and find your parking location."}
{"task": "rw_50.jsonl", "id": 54043, "text": "You can learn more about the corresponding functions in the parking assistant through the [Mine]-[Common Function]-[Parking Assistant] through Baidu Map.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54044, "text": "If you refuse to authorize, you will not be able to use the corresponding function, but it does not affect other functions that you can achieve based on the above information that you can use the above information.", "label": ["First Party Collection Information", "Risk"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54045, "text": "1.9. Vehicle Restriction Tips", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54046, "text": "Baidu Map provides you with a vehicle restriction prompt service service", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54047, "text": "If you use your vehicle restricted service, you may need to provide your license plate number, vehicle, and pass information based on service needs to provide you with a vehicle restriction prompt service service.", "label": ["Important", "First Party Collection Information"], "rewrite": "You may need to provide your license plate number, vehicle, and pass information in order to provide you with a vehicle restriction prompt service service."}
{"task": "rw_50.jsonl", "id": 54048, "text": "If you refuse to authorize, you will not be able to use the corresponding function, but it does not affect other functions that you can achieve based on the above information without using Baidu maps.", "label": ["First Party Collection Information", "Risk"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54049, "text": "You can add your vehicle through the [Mine]-[Common Function]-[All Function]-[Motors of the Owner]-[Car Owner Service] to add your vehicle through Baidu Map, and you can learn more about the vehicle restriction service.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54050, "text": "1.10. widget", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54051, "text": "Baidu Map provides you with commute card services and bus card services.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54052, "text": "If you use commuting cards and bus card services, we will apply for the location permissions of your equipment system.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you use commuting cards and bus card services, we will apply for the location permissions of your equipment system."}
{"task": "rw_50.jsonl", "id": 54053, "text": "After your authorization and consent, we will collect your location information in order to show you commute road conditions and surrounding bus line information.", "label": ["Important", "First Party Collection Information"], "rewrite": "After your authorization and consent, we will collect your location information in order to show you commute road conditions and surrounding bus line information."}
{"task": "rw_50.jsonl", "id": 54054, "text": "You can obtain your location permissions by canceling the system authorized Baidu Map at any time to stop the collection of your information. After that, you may not be unable to use the relevant services or functions provided by the above location information, or you cannot reach the above -mentioned location -based information provided by the location information provided by the location information.Related services are intended to achieve, but it will not affect other business functions that can be realized based on the above permissions that you use Baidu Maps.", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "You can obtain your location permissions by canceling the system authorized Baidu map at any time to stop our collection of your information."}
{"task": "rw_50.jsonl", "id": 54055, "text": "Location information is a sensitive personal information. You can at any time authorize Baidu Map access by cancel the system to stop the collection of your location information. After that, you may not be able to use the relevant services or functions provided by the above location information, or it cannot reach the above -mentioned -based based on the above -mentioned -based based on the location information.The relevant services provided by the location information are planned to achieve, but it will not affect your normal use of Baidu map other business functions that can be realized without location permissions.", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "Location information is a sensitive personal information. You can at any time authorize the system to access Baidu map access at any time to stop our collection of your location information."}
{"task": "rw_50.jsonl", "id": 54056, "text": "1.11. Taxi", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54057, "text": "If you use a taxi service, we will apply to the positioning authority of your device system. After you have authorized consent, we will collect your mobile phone number, account information, device information (such as IMEI), location information, order information, payment information, payment information, IP address, emergency contact name and contact information (if any), and share the above information from third -party service providers after confirming the order, so that third -party service providers can locate, facilitate the driver to contact you, generate orders to achieve realization to achieve realizationTaxi service and ensure your safety.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "If you use a taxi service, we will apply to the positioning authority of your device system. After you have authorized consent, we will collect your mobile phone number, account information, device information (such as IMEI), location information, order information, payment information, payment information, IP address, emergency contact name and contact information (if any), and share the above information with third -party service providers after confirming the order."}
{"task": "rw_50.jsonl", "id": 54058, "text": "If you refuse to authorize, you will not be able to use the corresponding function, but it does not affect other functions that you can achieve based on the above information without using Baidu maps.", "label": ["First Party Collection Information", "Risk"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54059, "text": "You can learn more about the taxi service through the [Rating]-[Personal Center]-[Usage in the Baidu Map.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54060, "text": "Location information is personal sensitive information.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54061, "text": "You can at any time authorize Baidu Map access at any time to stop the collection of your location information. After that, you may not be unable to use the relevant services or functions provided by the above location information, or you cannot reach the relevant services provided by the above location information.The effect achieved, but it will not affect your normal use of Baidu map other business functions that can be achieved based on position permissions.", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "You can stop the collection of your location information at any time by canceling the system authorized Baidu map access at any time."}
{"task": "rw_50.jsonl", "id": 54062, "text": "1.12. Food reservation service", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54063, "text": "When you use food booking services, you may need to provide you with the name, gender, and contact information based on service needs to provide you with services such as reception and sending notification SMS.", "label": ["Important", "First Party Collection Information"], "rewrite": "You need to provide the name of the meal, gender, and contact information in order to provide you with services such as reception and sending notification SMS."}
{"task": "rw_50.jsonl", "id": 54064, "text": "If you refuse to authorize, you will not be able to use the corresponding function, but it does not affect other functions that you can achieve based on the above information without using Baidu maps.", "label": ["First Party Collection Information", "Risk"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54065, "text": "1.13. Camera and AR services", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54066, "text": "When you use the camera and AR -related services, based on the service, we will apply for the camera permissions and album storage permissions of your device system to provide you with services such as scanning code, flower knowledge, AR guide, peripheral exploration, camera translation and other services.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use the camera and AR -related services, based on the service, we will apply for the camera permissions and album storage permissions of your device system to provide you with services such as scanning code, flower knowledge, AR guide, peripheral exploration, camera translation and other services."}
{"task": "rw_50.jsonl", "id": 54067, "text": "You can enter the camera function page by clicking the camera button next to the Baidu map search box to further understand the camera and AR related functional services", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54068, "text": "You can obtain your camera permissions by canceling the system authorized Baidu Map at any time. After that, you may not be unable to use the relevant services or functions provided by the above information, but it will not affect the other permissions that you use Baidu Map normally.Business function.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "You can cancel the system authorized Baidu Map to obtain your camera permissions at any time. After that, you may not be unable to use the relevant services or functions provided by the above information, but it will not affect your normal use of other business functions."}
{"task": "rw_50.jsonl", "id": 54069, "text": "1.14. New service and functional operation and customer service processing", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54070, "text": "Baidu Map will launch operating activities for newly launched services and functions from time to time. For example, new services launched need to process your personal information or apply for equipment system permissions, and before your authorization consent, we will get your consent separately, of whichIf it involves the processing of sensitive personal information, we will get your separate consent.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "Baidu Map, if you launch a new service, you need to handle personal information or apply for equipment system permissions, and you will obtain your consent separately without authorizing consent before."}
{"task": "rw_50.jsonl", "id": 54071, "text": "If you participate in related operating activities, we may collect but not be limited to your identity information, contact information, contact address information, transaction account information, in order to get in contact with you and send operation rewards to you through the operation activity interface.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may collect but not be limited to your identity information, contact information, contact address information, transaction account information, in order to get in touch with you, and send operation awards to you."}
{"task": "rw_50.jsonl", "id": 54072, "text": "If you do not participate in related operating activities, you do not need to provide the aforementioned information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54073, "text": "If you need to make an appointment for operating activities, we may apply for the calendar permissions of your equipment system. You can at any time to authorize Baidu Map to visit your calendar at any time, stop our collection of calendar information, and you may not be able to use it afterwards.The above -mentioned related services or functions based on calendar information cannot be achieved by the relevant services provided by the above -mentioned calendar -based information, but it will not affect your normal use of Baidu map other business functions that can be realized without calendar permissions;", "label": ["Permission Acquisition", "Important", "Edit/Control"], "rewrite": "If you need to make an appointment for operating activities, we may apply for the calendar permissions of your equipment system. You can at any time to authorize Baidu Map to visit your calendar at any time to stop our collection of calendar information."}
{"task": "rw_50.jsonl", "id": 54074, "text": "When you participate in the operating activities of truck -related trucks, we will apply for the camera permissions of your equipment system. After you have authorized the consent, you need to upload your truck driving license to verify your qualifications to participate in the event.", "label": ["Permission Acquisition", "Important"], "rewrite": "We will apply for the camera permissions of your device system. After you have authorized consent, you need to upload your truck driving license to verify your qualifications for your participation."}
{"task": "rw_50.jsonl", "id": 54075, "text": "When you participate in the operation activities of the map, if you need to share the poster of the event with your friends, we will apply for the storage authority of your equipment system in order to store the event poster picture into your photo album.", "label": ["Permission Acquisition", "Important"], "rewrite": "Apply for the storage authority of your device system so that the event poster pictures can be stored into the album."}
{"task": "rw_50.jsonl", "id": 54076, "text": "When you participate in the number of step statistics related operational activities, we will apply for your exercise and fitness permissions. After you have authorized consent, we will collect your daily step informationIssuing activities benefits.", "label": ["Permission Acquisition", "Important"], "rewrite": "Apply for your exercise and fitness permissions, and you will collect your daily step information after authorization and consent."}
{"task": "rw_50.jsonl", "id": 54077, "text": "If you refuse to authorize, you will not be able to use the aforementioned activities, but it will not affect the normal use of other functions of Baidu Map.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54078, "text": "If you have questions about the products and services we provide or need customer service intervention for disputes, in order to verify your identity and position your problem, you may need to provide your identity information for verification.", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to verify identity and positioning, you may need to collect your identity information for verification."}
{"task": "rw_50.jsonl", "id": 54079, "text": "In order to ensure the quality of the call and ensure that the dispute is properly resolved, we may save your communication records with us, including call records, related information you provided by your disputes, and contact information you use or provided.", "label": ["Important", "First Party Collection Information"], "rewrite": "Will save your communication records, including call records, controversial solutions to related information, contact information."}
{"task": "rw_50.jsonl", "id": 54080, "text": "1.15. News notice", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54081, "text": "Please know and agree that for your contact information (for example: contact telephone number) provided in the process of using the product and/or service, we may send one or more types of notifications to one or more in operation.Used for user messages, authentication, security verification, and user experience survey.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may send multiple types of notifications to the contact information you provided in operation."}
{"task": "rw_50.jsonl", "id": 54082, "text": "In addition, we may also provide you with commercial information such as services, functions, or activities that may be interested in. If you do not want to accept this information, you can refund the withdrawal method provided in the phone SMSYou can also contact us directly to the withdrawal.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54083, "text": "1.16. Additional function of location information", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54084, "text": "When you use Baidu Map -based related services, we may collect and process your equipment information, location information, and network identity identification information, so that you can use the following related services without manually entering your own geographical coordinates.Essence", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect and process your equipment information, location information, and network identity identification information for providing location -related services."}
{"task": "rw_50.jsonl", "id": 54085, "text": "Location information includes the accurate location information obtained by the WLAN access point, Bluetooth, base station, and other sensor information, as well as rough geographical location information obtained through IP addresses or other network information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54086, "text": "When you use the following features, we will request accurate geographical location permission. If you refuse to authorize the accurate geographical location permissions, we will not provide you with the above services based on accurate location information.", "label": ["Permission Acquisition", "Important"], "rewrite": "When using the following functions, you will request accurate geographical location authority authorization. If you refuse to authorize accurate geographical location permissions, you will not provide corresponding services."}
{"task": "rw_50.jsonl", "id": 54087, "text": "When you use footprint services, in order to provide you with a record of travel locations and routes, we will collect your location information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your location information to provide records and routes of travel locations and routes."}
{"task": "rw_50.jsonl", "id": 54088, "text": "When you use travel recommendations and surrounding recommendations, in order to provide you with personalized content recommendation, we will collect your location information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your location information to provide personalized content recommendation."}
{"task": "rw_50.jsonl", "id": 54089, "text": "When you use a taxi service, we will collect your location information to provide you in order to provide you.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your location information to provide online car rental services."}
{"task": "rw_50.jsonl", "id": 54090, "text": "When you use search peripheral parking lots, in order to provide you with information about the peripheral parking lot, we will collect your location information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your location information for providing peripheral parking lot information."}
{"task": "rw_50.jsonl", "id": 54091, "text": "When you use driving/new energy/truck/motorcycle navigation and team service, in order to provide you with the analysis of navigation functions and navigation issues, we will collect your location information.", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to provide you with a reappearance of navigation functions and analysis of navigation issues, we will collect your location information."}
{"task": "rw_50.jsonl", "id": 54092, "text": "When you use public transport/walking/cycling/wisdom/train/passenger car/airplane service, in order to provide you with functions such as route planning, navigation, and vehicle query and navigation issues, we will collect your location information.", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to provide you with functions such as route planning, navigation, and vehicle query, and the analysis of navigation issues, we will collect your location information."}
{"task": "rw_50.jsonl", "id": 54093, "text": "When you use a bus/real -time bus/check -up service, in order to provide you with nearby bus, real -time buses, and subway information services, we will collect your location information.", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to provide you with nearby buses, real -time buses, and subway information services, we will collect your location information."}
{"task": "rw_50.jsonl", "id": 54094, "text": "When you use running/running route services, in order to provide you with running route services, we will collect your location information.", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to provide you with nearby buses, real -time buses, and subway information services, we will collect your location information."}
{"task": "rw_50.jsonl", "id": 54095, "text": "When you use the record trajectory service, in order to provide you with a trajectory recording service, we will collect your location information.", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to provide you with a trajectory recording service, we will collect your location information."}
{"task": "rw_50.jsonl", "id": 54096, "text": "When you use getting off the car to remind the service, in order to provide you with a bus to get off the car, we will collect your location information.", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to provide you with a trajectory recording service, we will collect your location information."}
{"task": "rw_50.jsonl", "id": 54097, "text": "When you use the notification service, in order to provide you with personalized content recommendation services, we will collect your location information.", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to provide you with personalized content recommendation services, we will collect your location information."}
{"task": "rw_50.jsonl", "id": 54098, "text": "When you use the commute card service, in order to show you commuting information information, we will collect your location information.", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to show you commuting information information, we will collect your location information."}
{"task": "rw_50.jsonl", "id": 54099, "text": "When you use a bus card service, in order to show you the surrounding bus line information, we will collect your location information.", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to show you the information of the surrounding bus lines, we will collect your location information."}
{"task": "rw_50.jsonl", "id": 54100, "text": "When you use AR guides and peripheral exploration services, in order to provide you with AR guide and surrounding exploration services, we will collect your location information.", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to provide you with AR guide and surrounding exploration services, we will collect your location information."}
{"task": "rw_50.jsonl", "id": 54101, "text": "When you use the sign -in service, we will collect your location information in order to recommend 1000M nearby.", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to recommend 1000M sign -in locations nearby, we will collect your location information."}
{"task": "rw_50.jsonl", "id": 54102, "text": "You can access your accurate location information by littering the system at any time to stop the collection of your accurate geographical location information. After that, you may not be able to use the relevant services or functions provided by the above -mentioned accurate location information, or you cannot reach the above.Relevant services based on accurate location information are intended to achieve.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "You can cancel the system authorization at any time and stop our collection of precise geographical location information."}
{"task": "rw_50.jsonl", "id": 54103, "text": "But this does not affect your normal use of Baidu map other business functions that can be achieved based on accurate location information.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54104, "text": "1.17. Safe service security, optimize and improve service purposes", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54105, "text": "When you use Baidu Maps, in order to ensure your normal use of Baidu map services, more accurately positioning and solving the problems you encountered when using Baidu map service, improve and optimize the service experience of Baidu maps, ensure your account security, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, prevent, and prevent.Discovering and investigating fraud, hazards, security, illegal or violation of our agreements, policies or rules to protect the legitimate rights and interests of you, our affiliated companies, partners and the public, we will collect your equipment information,Location information, log information and other information related to the login environment.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect your equipment information, location information, log information and other information related to the login environment."}
{"task": "rw_50.jsonl", "id": 54106, "text": "Please understand that when you will be switched by Baidu maps in the device screen to run the equipment background, due to some equipment models and system reasons, the information collection behavior that you used to use Baidu map related functions may not stop immediately, which will lead to a resulting in, which will lead to leading to it, which will lead to it, which will lead to a result.Better information collection behavior.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "When you switch the Baidu map to the device background, the previous information collection behavior may not be stopped immediately, resulting in a short -term background information collection behavior."}
{"task": "rw_50.jsonl", "id": 54107, "text": "1.18.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54108, "text": "Gathering and integration: You agree that we will converge, identify and analyze, data portraits or further processing of personal information provided by your active or passive provided in this service through our own or subject technology, and form a variety of types and different particles.Tag information reflecting the characteristics of your behavior habits, hobbies or credit status (hereinafter referred to as \"label information\"), we will use the label information for automated decision -making in specific scenarios and purposes, push you personalized information informationAnd/or commercial marketing information.", "label": ["Important", "Usage"], "rewrite": "We will use the label information for automated decision -making in specific scenarios and purposes to push you personalized information and/or commercial marketing information."}
{"task": "rw_50.jsonl", "id": 54109, "text": "In addition to the information in this service to gather integration, we may associate and converge for the information collected from your various devices so that we can provide you with consistent services on these devices.", "label": ["Important", "Usage"], "rewrite": "For information collected from your various devices, we may associate and gather them to provide you with consistent services."}
{"task": "rw_50.jsonl", "id": 54110, "text": "For example, we may associate your device information or phone number with your Baidu account.", "label": ["Important", "Usage"], "rewrite": "We may associate your device information or phone number with your Baidu account."}
{"task": "rw_50.jsonl", "id": 54111, "text": "In the case of ensuring that personal information is under the control of the same business entity and does not change the data security guarantee capabilities and management level, it provides you with a consistent experience. You may actively or passively provided in this service mayCultivate and integrate the personal information provided by your active or passively in other product services you operate, and may form label information after further processing.middle.", "label": ["Important", "Usage"], "rewrite": "The personal information you provided in this service may be converged with other personal information, and may be used in the process of forming label information."}
{"task": "rw_50.jsonl", "id": 54112, "text": "Such information that converges and fusion does not include information that can directly identify your personal identity, and we will guarantee the security processing of information after the fusion.", "label": ["Important", "Data Security"], "rewrite": "The information that convergence integrates does not include information that can directly identify personal identity, and we will guarantee the security processing after the integration of the information convergence."}
{"task": "rw_50.jsonl", "id": 54113, "text": "Personalized recommendation: We will use the label information and your search, browsing, etc. in the Baidu map, and use the behavior information, equipment information, and location information, so that you can recommend that you may be more interested and correlated with more content.", "label": ["Important", "Usage"], "rewrite": "We will recommend more interested and correlated content based on label information, equipment information, and location information based on label information."}
{"task": "rw_50.jsonl", "id": 54114, "text": "In the personalized recommendation service, we will provide you with convenient rejection methods at the same time. We have established an independent control mechanism for personal information (such as labels, portrait dimensions, etc.) that users rely on personalized display to ensure that you regulate personalized display of personalized displayAffairs of correlation.", "label": ["Important", "Usage"], "rewrite": "In personalized recommendation services, we will provide convenient rejection methods and independent control mechanisms."}
{"task": "rw_50.jsonl", "id": 54115, "text": "For details, please see \"5.9. Personalized content and advertising display and control\".", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54116, "text": "Automation decision -making: Automated decision -making activities also depend on the processing of our use information, equipment information, location information, and label information.", "label": ["Important", "Usage"], "rewrite": "Automated decision -making activities depend on the processing of our use information, equipment information, location information, and label information."}
{"task": "rw_50.jsonl", "id": 54117, "text": "If we make a decision to have a significant impact on your personal rights through automated decision -making, you have the right to explain through this policy \"8. How to contact us\", and have the right to reject usDecide.", "label": ["Edit/Control", "Usage", "Important"], "rewrite": "You have the right to explain the way of automation decision -making through this policy \"8. How to contact us\" and have the right to reject us to make decisions only through automated decision -making."}
{"task": "rw_50.jsonl", "id": 54118, "text": "1.19. Indirect collection information", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54119, "text": "In order to provide you with reasonable needs such as the quality and personalization of products/services or improvement of product services, or for consideration of product and service safety, we may follow the Baidu platform, or based on your effective authorization or based on your effective authorization or based on your effective authorization.Reception companies, partners and other trusted third -party suppliers receive your personal information and other information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may receive your personal information and other information from third -party suppliers in accordance with the provisions of laws and regulations or effective authorization."}
{"task": "rw_50.jsonl", "id": 54120, "text": "We will ask the personal information provider in advance to explain the source of personal information and confirm the legality of the source of their personal information. At the same time, we will understand the scope of the authorization consent of the personal information processing of the personal information provider.If the personal information processing activity is performed beyond the scope of obtained authorization consent, we will obtain your explicit consent within the reasonable period of obtaining personal information or before processing personal information, or the provider of the personal information provided by your explicit statement by your explicit statement.agree.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will request personal information provider in advance to explain the source of personal information, confirm the legitimacy, and understand the scope of the authorization consent of the personal information processing."}
{"task": "rw_50.jsonl", "id": 54121, "text": "1.20. Exception of obtaining authorization in advance", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54122, "text": "Please note: In the following circumstances, collecting or using personal information does not need to obtain your authorization consent in advance:", "label": ["Important", "First Party Collection Information"], "rewrite": "In the following circumstances, collecting or using personal information does not need to obtain your authorization consent in advance:"}
{"task": "rw_50.jsonl", "id": 54123, "text": "Directly related to national security and national defense security;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting personal information directly related to national security and national defense security does not need to solicit consent."}
{"task": "rw_50.jsonl", "id": 54124, "text": "In order to establish and fulfill the contract as a party as a party;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting the personal information necessary for the establishment and fulfilling the contract without soliciting consent."}
{"task": "rw_50.jsonl", "id": 54125, "text": "To fulfill the statutory duties or the requirements of the statutory duty;", "label": ["Important", "First Party Collection Information"], "rewrite": "It is not necessary to solicit consent as a personal information that is collected as a legal duty or a personal information necessary for the legal duty."}
{"task": "rw_50.jsonl", "id": 54126, "text": "In order to deal with emergencies, or in urgent situations, it is necessary to protect the health and property security of natural people in emergency situations;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting the personal information of the health and health of natural persons and protecting the lives and health of natural persons without soliciting consent."}
{"task": "rw_50.jsonl", "id": 54127, "text": "Directly related to criminal investigation, prosecution, trial, and execution of judgment;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect direct personal information related to criminal investigation, prosecution, trial, and execution of judgments without asking for consent."}
{"task": "rw_50.jsonl", "id": 54128, "text": "It is difficult to obtain the major legitimate rights and interests such as maintaining your life, property, etc., but it is difficult to get it;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting major legitimate rights and interests such as life and property, but it is difficult to obtain personal information that I agree, without asking for consent."}
{"task": "rw_50.jsonl", "id": 54129, "text": "Collect your own personal information to the public or other legally disclosure within a reasonable scope in accordance with the provisions of laws and regulations;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your own personal information that you publicly or other legal disclosure within a reasonable scope without asking for consent."}
{"task": "rw_50.jsonl", "id": 54130, "text": "Collect your personal information from the legally disclosed information in accordance with the provisions of laws and regulations in accordance with the provisions of laws and regulations, such as legal news reports and government information disclosure;", "label": ["Important", "First Party Collection Information"], "rewrite": "Those who collect personal information from the legal and publicly disclosed information in accordance with laws and regulations do not need to solicit consent."}
{"task": "rw_50.jsonl", "id": 54131, "text": "Implement news reports, public opinion supervision and other behaviors for public interests, and handle personal information within a reasonable range;", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to implement news reports and supervision of public opinion, if you handle personal information within a reasonable range, you do not need to solicit consent."}
{"task": "rw_50.jsonl", "id": 54132, "text": "When academic research institutions are necessary to carry out statistics or academic research based on public interests, and provide academic research or description results, the personal information contained in the results is identified by", "label": ["Important", "First Party Collection Information"], "rewrite": "Based on public interests or academic research, academic results are required, and individual information is identified to identify it without soliciting consent."}
{"task": "rw_50.jsonl", "id": 54133, "text": "Other circumstances stipulated in laws and regulations.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect personal information under other circumstances stipulated in the laws and regulations without asking for consent."}
{"task": "rw_50.jsonl", "id": 54134, "text": "1.21. Anonymous processing of personal information", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54135, "text": "Under the premise of not disclosing public information and providing your personal information, Baidu has the right to excavate, analyze and use the user database after anonymous processing (including commercial use), and has the right to count the product/service usage andShare statistical information after anonymous processing with the public/third parties.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Under the premise of not disclosing your personal information, Baidu has the right to excavate, analyze and use the user database after anonymous processing (including commercial use), and share statistical information after anonymous processing with the public/third partiesEssence"}
{"task": "rw_50.jsonl", "id": 54136, "text": "1.22.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54137, "text": "In the process of providing services, in order to ensure that you can use the product function normally, we will apply for the following system equipment permissions of your device to the system. Before the application, we will consult your consent. You can choose \"allowed\" or \"prohibited\" permissions to apply.", "label": ["Permission Acquisition", "Important"], "rewrite": "We will apply for the system's system equipment permissions to the system. We will consult your consent before applying. You can choose \"allow\" or \"prohibited\" permissions to apply."}
{"task": "rw_50.jsonl", "id": 54138, "text": "After your authorization, we will turn on the relevant authority. You can cancel the authorization in the system at any time. You cancel the authorization that will cause you to unable to use related business functions, but it will not cause you to use other business functions.", "label": ["Important", "Edit/Control"], "rewrite": "After authorization, we will open the relevant authority, and you can cancel the authorization at any time, which will cause you to be unable to use related business functions, but it will not cause you to use other business functions."}
{"task": "rw_50.jsonl", "id": 54139, "text": "The calls of various business functions on system privacy rights are as follows:", "label": ["Permission Acquisition", "Important"], "rewrite": "The calls of various business functions on system privacy rights are as follows:"}
{"task": "rw_50.jsonl", "id": 54140, "text": "Whether equipment permissions business function permission authorization can be closed", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54141, "text": "Position positioning, navigation, and surrounding services recommend users when opening Baidu Map for the first time.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54142, "text": "Microphone voice assistant, customized voice bag recording, video shooting user calls related functions when calling related functions, pop -ups inquiries are", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54143, "text": "Photo UGC, public travel, personalized voice cover, parking business upload/storage photo user calls related functions when calling related functions", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54144, "text": "Camera AR navigation, AR experience, camera/video upload user calls related functions when calling related functions", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54145, "text": "The address book improves voice dialing accurate user calling related functions when calling related functions is pop -up.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54146, "text": "Advertising identifier IDFA improvement and optimization service experience;", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54147, "text": "Advertising recommendation;", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54148, "text": "Make sure your account security user opens the window when opening Baidu map for the first time", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54149, "text": "The notification message push, remind users that when the first time it opens Baidu map, the pop -up window is asked", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54150, "text": "Calendar operation activities or lottery reminds users when calling related functions calls the pop -up window.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54151, "text": "Dialing call voice dial -call function The pop -up window to ask when using the voice call function for the first time", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54152, "text": "Storage read and write pictures, files, or cache information users when calling related functions to call the pop -up window.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54153, "text": "Equipment information improvement and optimization service experience;", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54154, "text": "Make sure your account security user opens the window when opening Baidu map for the first time", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54155, "text": "Various business functions of wireless networks perform network connection users when opening Baidu Map for the first time.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54156, "text": "Sports and fitness steps Statistics Related operation Activities User calling related functions The pop -up window asking is", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54157, "text": "You can use [Mine]-[Settings]-[Privacy Settings]-[System Power Settings]-[Go to the Application Power Settings] to check the details of privacy permissions and close the corresponding permissions.", "label": ["Important", "Edit/Control"], "rewrite": "You can use [Mine]-[Settings]-[Privacy Settings]-[System Power Settings]-[Go to the Application Power Settings] to check the details of privacy permissions and close the corresponding permissions."}
{"task": "rw_50.jsonl", "id": 54158, "text": "In different devices, the right display method and closing method may be different. For details, please refer to the device and system developer instructions or guidance.", "label": ["Important", "Edit/Control"], "rewrite": "In different devices, the right display method and closing method may be different. For details, please refer to the device and system developer instructions or guidance."}
{"task": "rw_50.jsonl", "id": 54159, "text": "1.23.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54160, "text": "When we want to use other purposes that the information is not stated in this privacy policy, we will solicit your consent in advance.", "label": ["Policy Change", "Important"], "rewrite": "When we want to use other purposes that the information is not stated in this privacy policy, we will solicit your consent in advance."}
{"task": "rw_50.jsonl", "id": 54161, "text": "When we want to use the information collected based on specific purposes for other purposes, we will solicit your consent in advance.", "label": ["Important", "First Party Collection Information"], "rewrite": "When we want to use the information collected based on specific purposes for other purposes, we will solicit your consent in advance."}
{"task": "rw_50.jsonl", "id": 54162, "text": "2. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54163, "text": "Cookie and anonymous identifiers tool Cookie is a mechanism that supports the server (or script) to store and retrieve information on the client.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54164, "text": "When you use Baidu map products or services, we will send one or more cookies or anonymous identifies to your device.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use Baidu map products or services, we will send one or more cookie or anonymous identifiers to your device."}
{"task": "rw_50.jsonl", "id": 54165, "text": "When you interact with Baidu Map Service, we allow cookies or anonymous identifiers to send to Baidu's server.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you interact with Baidu Map Service, we allow Cookie or anonymous logo to send it to Baidu's server."}
{"task": "rw_50.jsonl", "id": 54166, "text": "Cookie usually contains identifiers, site names, and some numbers and characters.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54167, "text": "Using cookie technology, Baidu can understand your habits, remember your preferences, and save you the steps of entering duplicate information to help you judge the security of your account.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54168, "text": "Cookie can also help us statistical traffic information, analyze the effectiveness of page design and advertising.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54169, "text": "We will not use Cookie for any purpose outside the purpose of this policy.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54170, "text": "You can manage or delete according to your preferences, cookies.", "label": ["Important", "Edit/Control"], "rewrite": "You can manage or delete Cookie according to your preferences."}
{"task": "rw_50.jsonl", "id": 54171, "text": "For details, see aboutcookies.org.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54172, "text": "You can clear all the functions saved on the computer, cookies, and most of the network browsers have the functions of stopping, cookies.", "label": ["Important", "Edit/Control"], "rewrite": "You can clear all the cookies saved on the computer, and most of the network browsers have the function of preventing cookies."}
{"task": "rw_50.jsonl", "id": 54173, "text": "But if you do this, you need to change the user settings when you visit our website, but you may not be able to log in or use the services or functions provided by Baidu that depend on Cookie because of these modifications.", "label": ["Important", "Edit/Control"], "rewrite": "Cooking Cookie needs to change the user settings in person when visiting the website, but it may not be able to log in or use the service or features dependent on Cookie."}
{"task": "rw_50.jsonl", "id": 54174, "text": "You can pass", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54175, "text": "iOS end: [Mine]-[Settings]-[Reset Map]-[Delete the cache data] Clear your cookies and limit the use of Cookie by Baidu.", "label": ["Important", "Edit/Control"], "rewrite": "iOS end: [Mine]-[Settings]-[Reset Map]-[Delete the cache data] Clear your cookies and limit the use of Cookie by Baidu."}
{"task": "rw_50.jsonl", "id": 54176, "text": "Android: [Mine]-[Settings]-[Privacy Settings]-[System Privacy Rights]-[Storage] Clear your cookies and limit Baidu's use of cookies.", "label": ["Important", "Edit/Control"], "rewrite": "You can via the Android end: [My]-[Settings]-[Privacy Settings]-[System Privacy Permanent]-[Storage] Clear your cookies"}
{"task": "rw_50.jsonl", "id": 54177, "text": "3. How do we share, transfer, publicly disclose, entrust your personal information and the third parties to be accessed", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54178, "text": "3.1 Sharing", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54179, "text": "Unless you have a separate consent or in accordance with other laws and regulations, we will not share your personal information from a third party other than Baidu, except for the processing that cannot be identified and cannot be restored.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Unless we have a separate consent in advance, we will not share personal information from third parties, except for the processing that cannot be recognized by specific individuals and cannot be restored."}
{"task": "rw_50.jsonl", "id": 54180, "text": "Companies, organizations and individuals who share personal information with us, we will investigate their data security environment, sign strict confidentiality agreement with them, and ask them to take confidentiality and security measures in accordance with the law to handle personal information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "For the third party that shares our personal information with us, we will investigate its data security environment and sign a strict confidentiality agreement with them."}
{"task": "rw_50.jsonl", "id": 54181, "text": "In the following circumstances, we may share your personal information with the following third parties:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the following circumstances, we may share your personal information with the following third parties:"}
{"task": "rw_50.jsonl", "id": 54182, "text": "3.1.1. Third -party products or service providers", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54183, "text": "Baidu Maps connects rich third -party services (including third -party applets).", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54184, "text": "When you use a third -party service connected to Baidu Map, you may need to submit your personal information.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "When you use a third -party service connected to Baidu Map, you may need to submit your personal information."}
{"task": "rw_50.jsonl", "id": 54185, "text": "We will provide your personal information based on your effective authorization or in the case of a contract that must be established or fulfilled as a party as a party.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will provide your personal information to third parties based on effective authorization or establishing or performing contracts."}
{"task": "rw_50.jsonl", "id": 54186, "text": "Regarding how to collect and use your personal information on third -party services, it is recommended that you refer to the relevant service agreements and privacy policies of third -party services.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54187, "text": "When you participate in the marketing activities or service content provided by a third party, based on the service needs, you may need to provide you with information such as account nicknames, avatars, names, contact information and other information.When the content of the service content is necessary, share your personal information from a third party to ensure that third parties can provide you smoothly or to fulfill you in time.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "We will share your personal information from a third party when you agree or provide services alone."}
{"task": "rw_50.jsonl", "id": 54188, "text": "In the case of providing you with marketing activities or service content, if you refuse to share, third parties will not be able to provide you with services or reject your participation.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "In the case of providing you with marketing activities or services, if you refuse to share, third parties will not be able to provide you with services."}
{"task": "rw_50.jsonl", "id": 54189, "text": "When you use parking payment services, based on service needs, we will share your mobile phone number and license plate number information from third parties through your separate consent to ensure that third parties can provide you smoothly.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When you use the parking payment service, we will share your mobile phone number and license plate number information from the third party through your own consent."}
{"task": "rw_50.jsonl", "id": 54190, "text": "When you use the parking appointment service, based on the service needs, we will share your mobile phone number and license plate number information from the third part", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When you use the parking appointment service, based on the service needs, we will share your mobile phone number and license plate number information from the third party through your separate consent."}
{"task": "rw_50.jsonl", "id": 54191, "text": "When you use illegal query services, based on service needs, we will share your license plate number, frame number, and engine number information from third parties through your separate consent, so that third parties can inquire and display your illegal records for you.We will strictly control the scope of information use.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will share your license plate numbers, frame numbers, and engine numbers from the third party through your separate consent, so that third parties can inquire and show your illegal records."}
{"task": "rw_50.jsonl", "id": 54192, "text": "When you use the owner's equity service, based on the service needs, we will share your mobile phone number information from the third party through your separate consent so that you can use the relevant rights and interests provided by the third party to you in the future.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When using the owner's equity service, based on service needs, we will share your mobile phone number information from a third party through your separate consent."}
{"task": "rw_50.jsonl", "id": 54193, "text": "When you use limited service, based on service needs, we will share your license plate number information from a third party through your separate consent in order to show you related restriction information for you. We will strictly control the scope of information use.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will share your license plate information from the third party with your own consent so that the third party will show you the relevant restricted information."}
{"task": "rw_50.jsonl", "id": 54194, "text": "When you use a taxi service, based on service needs, we will share your mobile phone number, location information, account information, device information (such as IMEI), order information, payment information, IP address, IP address, IP address, IP address, IP address, IP address, IP address, IP addressThe name and contact information of the emergency contact (if any) can provide you with an online car service.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will share your mobile phone numbers, location information, account information, equipment information (such as IMEI), order information, payment information, IP address, emergency contact name and contact information (if any) of your mobile phone number, location information, account information (such as), So that third parties provide you with online car rental services."}
{"task": "rw_50.jsonl", "id": 54195, "text": "When you use food booking services, based on service needs, we will share your dining person's name, contact information, gender information to third parties through your separate consent, so that third parties can provide you with reception and send notification SMS, etc.Serve.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will share the names, contact information, and gender information of the dining person provided by the third party with your own consent, so that the third party can provide you with reception and sending notification SMS services."}
{"task": "rw_50.jsonl", "id": 54196, "text": "When you use attractions ticket booking services, based on service needs, we will share your name, mobile phone number, ID number (partial involved) to third parties through your separate consent, so that third parties will provide you with attractions ticket booking serviceEssence", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will share your names, mobile phone numbers, and ID numbers (partially involved) to the third party with your individual consent, so that the third party can provide you with attractions ticket booking services."}
{"task": "rw_50.jsonl", "id": 54197, "text": "If you are a user who participated in the low -carbon plan activities in Beijing, the service -based service may need your mobile phone number information, IC card number and related travel data (buses, walking, cycling).Your authorization will provide your information to the Beijing Communications Commission so that the Beijing Communications Commission can verify the real and accurate to record the corresponding travel data for your account and issue a reward of the corresponding amount.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Users participating in the low -carbon planning activities may need to provide mobile phone number information, IC card card numbers and related travel data (bus, walking, cycling) based on service needs, and will provide information to the Beijing Transportation Commission according to your authorization."}
{"task": "rw_50.jsonl", "id": 54198, "text": "Regarding how the event is collected and using your personal information, it is recommended that you refer to the relevant service agreement and privacy policy of the event.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54199, "text": "Baidu Map is connected to a wealth of third -party mini -program services.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54200, "text": "Third -party mini -programs may collect and use your relevant information, call your equipment permissions so that you can use the services it provided.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54201, "text": "Different third -party mini -program services collected and used information and the type of equipment that are called may be different.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54202, "text": "When you choose to use a third -party mini -program service, with the consent of your authorization, we will provide your information to the third -party mini -program service provider based on your authorization so that it can provide you with relevant information.", "label": ["Permission Acquisition", "Important"], "rewrite": "We will provide your information to the third -party applet service provider based on your authorization so that they can provide you with services."}
{"task": "rw_50.jsonl", "id": 54203, "text": "Regarding the type of equipment permissions for the specific call of third -party mini -programs, and how to collect and use your personal information, it is recommended that you refer to the relevant service agreements and privacy policies of the third -party applet.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54204, "text": "3.1.2.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54205, "text": "We have a high degree of data security security measures and management levels between our affiliated companies or the use of the same account system.", "label": ["Third Party Sharing/ Disclosure", "Data Security"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54206, "text": "In order to provide you with a service experience that provides you, improves your product security and convenience, and guarantee consistency, under the premise of following legal requirements, we will share your individuals between the related company or the use of the same account system.information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will share your personal information between related companies or the same account system."}
{"task": "rw_50.jsonl", "id": 54207, "text": "In this case, we will only share the necessary personal information. If we share your sensitive personal information or the purpose of changing the use and processing of personal information, we will solicit your authorization consent again.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "If we share sensitive personal information or the purpose of changing personal information to change personal information, we will solicit your authorization consent again."}
{"task": "rw_50.jsonl", "id": 54208, "text": "For the use of the same account system, in order to fulfill the supervision requirements, ensure account security, conduct consistent display, and contact you, based on your effective authorization, we may share your account information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Based on your effective authorization, we may share your account information."}
{"task": "rw_50.jsonl", "id": 54209, "text": "When you use Baidu accounts for small full finance, rich money, and small Manchu financial services, we will share your account user name, nickname, avatar, binding real -name real name to the service provider (Du Xiaoman Technology (Beijing) Co., Ltd.)Information (such as: name, ID number and mobile phone number), account risk (including the login status), IP information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will share your account user name, nickname, avatar, binding real -name information (such as: name, ID number and mobile phone number), account risk (including December RecordSituation), IP information."}
{"task": "rw_50.jsonl", "id": 54210, "text": "After your authorization and consent, we will collect your IDFA/IDFV information, and under your further authorization, display the balance of wallet, credit quota, etc. We will strictly control the scope of information use.", "label": ["Important", "First Party Collection Information"], "rewrite": "After your authorization and consent, we will collect your IDFA/IDFV information, and under your further authorization, display the balance of wallet, credit quota, etc. We will strictly control the scope of information use."}
{"task": "rw_50.jsonl", "id": 54211, "text": "3.1.3. You take the initiative to choose a third party that share with you personal information", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54212, "text": "You can use Baidu map sharing function to share with Baidu friends, QQ friends, WeChat friends, Weibo friends, including but not limited to information content and search results you are interested in.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54213, "text": "Please fully consider the reputation of the information receiving person before using the third -party service or sharing function, and suggest that you check the personal information processing rules (such as privacy policies) you use to use the social network or third -party service providerProcess your information for prudent decisions.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54214, "text": "3.2. Transfer", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54215, "text": "We will not transfer your personal information to any company, organization and individual except Baidu Company, except the following situations: except:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not transfer your personal information to any company, organization and individual except Baidu Company, except the following situations: except:"}
{"task": "rw_50.jsonl", "id": 54216, "text": "Get your clear authorization or consent in advance", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If your clear authorization or consent is obtained in advance, personal information will be transferred."}
{"task": "rw_50.jsonl", "id": 54217, "text": "Meet the requirements of laws and regulations, legal procedures or government requirements or judicial rulings;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Personal information will be transferred to the requirements of laws and regulations, legal procedures or for mandatory government requirements or judicial rulings."}
{"task": "rw_50.jsonl", "id": 54218, "text": "If we or our affiliated companies involve transactions such as mergers, separation, liquidation, assets or business, your personal information may be transferred as part of such transactions. We will ensureConfidentiality, to tell you the names or names and contact information of the receiver, and do your best to ensure that the company that holds your personal information and the organization will continue to be constrained by this privacy policy.You ask for authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Your personal information may be transferred as part of the transactions such as mergers. We will tell you that the name or name and contact information of the receiver will be informed of the new holder to continue to be constrained by this privacy policy. Otherwise, we will ask forIt re -solicited authorized consent."}
{"task": "rw_50.jsonl", "id": 54219, "text": "3.3. Public disclosure", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54220, "text": "We will only publicly disclose your personal information in the following circumstances:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only publicly disclose your personal information in the following circumstances:"}
{"task": "rw_50.jsonl", "id": 54221, "text": "Get your alone consent", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After getting your separate consent, disclose personal information."}
{"task": "rw_50.jsonl", "id": 54222, "text": "Based on laws and regulations, legal procedures, litigation, or mandatory requirements for government authorities.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Based on laws and regulations, legal procedures, litigation, or the mandatory requirements of government authorities, personal information is made."}
{"task": "rw_50.jsonl", "id": 54223, "text": "When a punishment announcement of illegal accounts and violations, we will disclose information about the relevant account. This information will inevitably include related certification information and violations.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When a punishment announcement of illegal accounts and violations, we will disclose information about the relevant account."}
{"task": "rw_50.jsonl", "id": 54224, "text": "3.4., Sharing, transfer, and publicly disclose the exception of the authorization consent in the case of personal information", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share, transfer, and publicly disclose the exception of authorization of personal information."}
{"task": "rw_50.jsonl", "id": 54225, "text": "In the following circumstances, sharing, transfer, and publicly disclose personal information without obtaining the authorization of the subject of personal information in advance:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the following circumstances, sharing, transfer, and publicly disclose personal information without obtaining the authorization of the subject of personal information in advance:"}
{"task": "rw_50.jsonl", "id": 54226, "text": "Directly related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Personal information directly related to national security and national defense security does not need to solicit consent."}
{"task": "rw_50.jsonl", "id": 54227, "text": "In order to establish and fulfill the contract as a party as a party;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The personal information necessary for sharing and fulfilling the contract does not need to ask for consent."}
{"task": "rw_50.jsonl", "id": 54228, "text": "To fulfill the statutory duties or must", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "It is not necessary to solicit consent to sharing and performing the personal information of statutory duties or the required personal information necessary for the statutory duty."}
{"task": "rw_50.jsonl", "id": 54229, "text": "Directly related to public safety, public health, and major public interests.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Personal information directly related to public safety, public health, and direct public interests does not need to solicit consent."}
{"task": "rw_50.jsonl", "id": 54230, "text": "For example: to deal with emergencies, or in urgent situations to protect the health and property security of natural people;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54231, "text": "Directly related to criminal investigation, prosecution, trial, and execution of judgment;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Direct related personal information such as sharing with criminal investigation, prosecution, trial and judgment execution does not need to solicit consent."}
{"task": "rw_50.jsonl", "id": 54232, "text": "It is difficult to obtain the major legitimate rights and interests of the life and property of the subject of personal information or other individuals; it is difficult to get my consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Sharing and maintaining major legitimate rights and interests but difficult to get personal information that I agree, without asking for consent."}
{"task": "rw_50.jsonl", "id": 54233, "text": "In accordance with the provisions of the laws and regulations, handle personal information on your own or other legal disclosure within a reasonable scope.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "There is no need to ask for consent in accordance with the provisions of laws and regulations in accordance with the provisions of laws and regulations."}
{"task": "rw_50.jsonl", "id": 54234, "text": "Law and administrative regulations have other stipulated situations.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Personal information is shared in the case of laws and administrative regulations, and there is no need to solicit consent."}
{"task": "rw_50.jsonl", "id": 54235, "text": "3.5. The third -party software development tool package (SDK) we connect", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54236, "text": "In order to adapt to different mobile phone devices, use Baidu maps and third -party platform services to achieve your mobile phone device identity authentication, mobile phone equipment security, receiving information push, login in third -party platform accounts, sharing information through third -party platforms, and payment security. BaiduThe map is connected to a third -party SDK.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Baidu Map is connected to a third -party SDK."}
{"task": "rw_50.jsonl", "id": 54237, "text": "The above -mentioned third -party SDK providers include mobile phone equipment manufacturers, social platforms, communication operators and third -party payment institutions.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The above -mentioned third -party SDK providers include mobile phone equipment manufacturers, social platforms, communication operators and third -party payment institutions."}
{"task": "rw_50.jsonl", "id": 54238, "text": "Some third -party SDKs may call your device permissions and get your relevant information so that you can use the corresponding functions normally on different mobile phone devices or third -party platforms.", "label": ["Permission Acquisition", "Important"], "rewrite": "Some third -party SDKs may call your device permissions and get your relevant information."}
{"task": "rw_50.jsonl", "id": 54239, "text": "Different third -party SDKs may have different types of equipment permissions and the information obtained. It may include getting your location, reading/writing your external memory card, reading your mobile phone status and identity, viewing WLAN connection, retrieval is currently inThe operation/Bluetooth information, boot start, and retrieve the permissions of the application.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54240, "text": "Regarding the type of equipment permissions for third -party SDK, and how to collect and use your personal information, it is recommended that you refer to the relevant service agreement and privacy policy of the third -party SDK.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "The device authority types that third -party SDK calls, as well as how to collect and use your personal information, it is recommended to refer to the relevant service agreement and privacy policy of the third -party SDK."}
{"task": "rw_50.jsonl", "id": 54241, "text": "If you want to learn more about the third -party SDK of our access, please read the third -party SDK description.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54242, "text": "3.6. Entrusted processing and common treatment", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54243, "text": "In order to provide you better, we may entrust third -party partners to process your personal information.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54244, "text": "We will only entrust third -party partners to handle your information for legal, correct, necessary, specific, and clear purposes.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only entrust third -party partners to handle your information for legal, correct, necessary, specific, and clear purposes."}
{"task": "rw_50.jsonl", "id": 54245, "text": "We will strictly restrict the information processing purpose of the trustee and require the trustees to take full data security guarantee methods.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will strictly restrict the information processing purpose of the trustee and require the trustees to take full data security guarantee methods."}
{"task": "rw_50.jsonl", "id": 54246, "text": "If a third -party partner uses your information for our unreasonable purpose, it will obtain your consent separately.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If a third -party partner uses your information for our unreasonable purpose, it will obtain your consent separately."}
{"task": "rw_50.jsonl", "id": 54247, "text": "Our authorized partners include authorized partners of advertising and analytical services.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Our authorized partners include authorized partners of advertising and analytical services."}
{"task": "rw_50.jsonl", "id": 54248, "text": "We will entrust these partners to deal with information about advertising, advertising effects, and advertising reaching rates related to the safety technology of the industry.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will entrust these partners to deal with information about advertising, advertising effects, and advertising reaching rates related to the safety technology of the industry."}
{"task": "rw_50.jsonl", "id": 54249, "text": "Without your effective authorization, we will not commission the third -party partner for information that can directly identify your personal identity.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Without your effective authorization, we will not commission the third -party partner for information that can directly identify your personal identity."}
{"task": "rw_50.jsonl", "id": 54250, "text": "If you actively leave your contact information, address information and other personal information for specific third -party partners to contact you, it will directly process your personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you take the initiative to leave personal information such as contact information and address information for specific third -party partners, it will directly process your personal information."}
{"task": "rw_50.jsonl", "id": 54251, "text": "In the joint processing scenario, we will also sign relevant agreements with the requirements of the partner in accordance with the requirements of the laws and regulations and fulfill the relevant personal information protection obligations.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In joint processing, we will also sign relevant agreements with the partner in accordance with the requirements of laws and regulations and fulfill the relevant personal information protection obligations."}
{"task": "rw_50.jsonl", "id": 54252, "text": "4. How do we save and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54253, "text": "4.1. Save period", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54254, "text": "We will save your personal information within the time limit for providing the service, but the laws and regulations have other regulations on the period of preservation, you agree to retain longer periods, ensure the safety and quality of services, achieve disputed purpose, and technically difficult to achieve technically achieved the purpose of solving disputes.Under the circumstances, after the foregoing period of preservation expires, we will extend the storage period in accordance with the law, according to law, or within a reasonable range.", "label": ["Data Retention", "Important"], "rewrite": "We will save your personal information within the required period of the service, but if the laws and regulations have other regulations, you agree to retain a longer period of time, etc., after the foregoing period of premium expires, we will extend the storage period."}
{"task": "rw_50.jsonl", "id": 54255, "text": "After exceeding the storage period, we will delete your personal information or perform anonymous processing in accordance with the law.", "label": ["Data Retention", "Important"], "rewrite": "After exceeding the storage period, we will delete your personal information or perform anonymous processing in accordance with the law."}
{"task": "rw_50.jsonl", "id": 54256, "text": "4.2. Save area", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54257, "text": "In principle, the personal information we collected and generated in the territory of the People's Republic of China will be stored in the territory of the People's Republic of China.", "label": ["Data Retention", "Important"], "rewrite": "In principle, the personal information we collected and generated in the territory of the People's Republic of China will be stored in the territory of the People's Republic of China."}
{"task": "rw_50.jsonl", "id": 54258, "text": "If your personal information may be transferred to the overseas jurisdiction of your country or the country/region, or by the interview from these jurisdictions, we will strictly fulfill the obligations stipulated in the laws and regulations and obtain you in accordance with the laws and regulations.Agree alone.", "label": ["Data Retention", "Important"], "rewrite": "If your personal information may be transferred to an overseas jurisdiction or access to these jurisdictions, we will strictly fulfill their obligations and get your separate consent in advance."}
{"task": "rw_50.jsonl", "id": 54259, "text": "There may be different data protection laws in such jurisdictions, and no relevant laws are set up.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54260, "text": "In such circumstances, we will transmit your personal information in accordance with the provisions of the current laws of China, and will ensure that your personal information is sufficiently protected in the People's Republic of China.", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54261, "text": "For example, we will ask you to agree to cross -border transfer of personal information, or implement security measures such as data to identify data before cross -border data transfer.", "label": ["Data Retention", "Important"], "rewrite": "We will ask you to agree to cross -border transfer of personal information, or implement security measures such as data to identify data before cross -border data transfer."}
{"task": "rw_50.jsonl", "id": 54262, "text": "4.3. Safety measures", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54263, "text": "We will collect, use, store, and transmit user information with the \"minimization\" principle, and inform you the purpose and scope of the relevant information through user agreements and privacy policies.", "label": ["Important", "Data Security"], "rewrite": "We will collect, use, store, and transmit user information with the \"minimum\" principle, and inform you the purpose and scope of the use of user agreements and privacy policies."}
{"task": "rw_50.jsonl", "id": 54264, "text": "We attach great importance to information security.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54265, "text": "We have set up a specialized team responsible for research and development and application of multiple security technologies and procedures. We will conduct a security background review of the person in charge of safety management and key safety positions. We have established a comprehensive information security management system and internal security incident disposal mechanismwait.", "label": ["Important", "Data Security"], "rewrite": "We have set up a specialized team responsible for research and development and application of multiple security technologies and procedures, and will conduct a safety background review of the person in charge of safety management and key security positions. We have established a comprehensive information security management system and internal security incident disposal mechanism.Essence"}
{"task": "rw_50.jsonl", "id": 54266, "text": "We will adopt appropriate security measures and technical means to storage and protect your personal information that meets industry standards to prevent your information from being lost, being disclosed, use, damage, lost or leaked by unauthorized access, public disclosure, use, damage, loss, or leakage.", "label": ["Important", "Data Security"], "rewrite": "We will adopt appropriate security measures and technical means to store and protect your personal information that meets industry standards."}
{"task": "rw_50.jsonl", "id": 54267, "text": "We will take all reasonable and feasible measures to protect your personal information.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54268, "text": "We will use encryption technology to ensure the confidentiality of the data;", "label": ["Important", "Data Security"], "rewrite": "We will use encryption technology to ensure the confidentiality of data."}
{"task": "rw_50.jsonl", "id": 54269, "text": "We will use a trusted protection mechanism to prevent data from being maliciously attacked.", "label": ["Important", "Data Security"], "rewrite": "We will use a trusted protection mechanism to prevent data from being maliciously attacked."}
{"task": "rw_50.jsonl", "id": 54270, "text": "We will conduct data security awareness training and assessment and assessment of security capabilities, and strengthen employees' awareness of protecting the importance of personal information.", "label": ["Important", "Data Security"], "rewrite": "We will conduct data security awareness training and assessment and assessment of security capabilities, and strengthen employees' awareness of protecting the importance of personal information."}
{"task": "rw_50.jsonl", "id": 54271, "text": "We will perform identity authentication and authority control to employees who handle personal information, and sign a confidentiality agreement with employees and partners who are in contact with your personal information to clarify job responsibilities and code of conduct to ensure that only authorized personnel can access personal information.", "label": ["Important", "Data Security"], "rewrite": "We will perform identity authentication and permissions for employees who handle personal information, and sign a confidentiality agreement with employees and partners who are in contact with your personal information."}
{"task": "rw_50.jsonl", "id": 54272, "text": "If there is an act of violating the confidentiality agreement, it will be immediately terminated with the cooperative relationship with Baidu, and will be held accountable for relevant legal responsibilities. It also puts forward confidentiality requirements for personnel in contact with personal information when leaving the post.", "label": ["Important", "Data Security"], "rewrite": "If there is an act of violating the confidentiality agreement, it will be immediately terminated with the cooperative relationship with Baidu, and the confidentiality requirements are also put forward on the contact with personal information when leaving the post."}
{"task": "rw_50.jsonl", "id": 54273, "text": "We remind you that the Internet is not an absolutely secure environment. When you interact with other users in the third -party social software, emails, SMS, etc. in the Baidu map, you are not sure of the third -party software pairWhether the transmission of information is completely encrypted, pay attention to ensure the security of your personal information.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54274, "text": "We also ask you to understand that due to the technical restrictions and rapid development of the Internet industry, and various malicious attack methods that may exist, even if we can do our best to strengthen security measures, it is impossible to ensure 100 % security of information.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54275, "text": "Please understand that the system and communication network you used when using our products and/or services may have security problems in other links other than our control.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54276, "text": "According to our security management system, personal information leakage, damage or loss of incidents are listed as the most major security incidents. Once the company will start the company's highest level of emergency plans, and the Ministry of Security, the Ministry of Public Affairs, the Ministry of Justice and other departments will be formed.Emergency response group treatment.", "label": ["Important", "Data Security"], "rewrite": "Personal information leakage, damage, or loss of incidents are listed as the most major security incidents. Once, it will start the company's highest -level emergency plan, which will form a joint emergency response team for multiple departments such as the Ministry of Security, the Ministry of Public Affairs, and the Ministry of Legal Affairs."}
{"task": "rw_50.jsonl", "id": 54277, "text": "4.4. Safety event notice", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54278, "text": "We will develop emergency plans for cyber security incidents to deal with security risks such as system vulnerabilities, computer viruses, cyber attacks, and network invasion in time. When incidents that endanger network security occur, we will immediately start the emergency plan, take corresponding remedies, and follow in accordance with the corresponding remedial measures, and follow in accordance with the according to theReport to the relevant authorities.", "label": ["Important", "Data Security"], "rewrite": "We will formulate emergency plans for cyber security incidents to deal with risks in a timely manner. When incidents that endanger network security occur, we will immediately start the emergency plan, take corresponding remedial measures, and report to the relevant authorities in accordance with regulations."}
{"task": "rw_50.jsonl", "id": 54279, "text": "Personal information leakage, damage, and loss belong to the company -level super -large security incidents. We will be responsible for regularly organizing working group members to conduct safety plan drills to prevent such security incidents from occurring.", "label": ["Important", "Data Security"], "rewrite": "Personal information leakage, damage, and loss belong to the company -level super -large security incidents. We will be responsible for regularly organizing working group members to conduct safety plan drills to prevent such security incidents from occurring."}
{"task": "rw_50.jsonl", "id": 54280, "text": "Once unfortunately, we will start emergency plans in accordance with the highest priority to form an emergency emergency group to trace the causes and reduce losses in the shortest time.", "label": ["Important", "Data Security"], "rewrite": "Once unfortunately, we will start emergency plans in accordance with the highest priority to form an emergency emergency group to trace the causes and reduce losses in the shortest time."}
{"task": "rw_50.jsonl", "id": 54281, "text": "After unfortunately a personal information security incident, we will tell you the basic situation and possible impact of the security incident in time in accordance with the requirements of the laws and regulations.Suggestions, remedy measures, etc.", "label": ["Important", "Data Security"], "rewrite": "After the personal information security incident is unfortunate, we will tell you the basic situation and possible impact of the security incident in time, handling measures, suggestions, remedial measures, etc."}
{"task": "rw_50.jsonl", "id": 54282, "text": "We will promptly tell you the incident -related situation in the site notification, SMS notification, telephone, email, etc. Informing you, it is difficult to inform you one by one, we will publish a reasonable and effective way to publish an announcement.", "label": ["Important", "Data Security"], "rewrite": "We will inform you of the incident -related situation in time. It is difficult to inform them one by one and we will publish an announcement in a reasonable and effective way."}
{"task": "rw_50.jsonl", "id": 54283, "text": "At the same time, we will also actively report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "We will also take the initiative to report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities."}
{"task": "rw_50.jsonl", "id": 54284, "text": "Please understand that according to the provisions of laws and regulations, if the measures we take can effectively avoid information leakage, tampering, and loss, causing harm, unless the regulatory authorities ask you to notify you, we can choose not to notify you information security incidents.", "label": ["Important", "Data Security"], "rewrite": "If the measures we take can effectively avoid information leakage, tampering, and loss of losses, unless the regulatory authorities ask you to notify you, we can choose not to notify you information security incidents."}
{"task": "rw_50.jsonl", "id": 54285, "text": "5. Your rights", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54286, "text": "In accordance with China's relevant laws, regulations, standards, and the practice of other countries and regions, we guarantee that you exercise the following rights on your personal information. If you have doubts about your rights or claims, you can also use [8. How to contact how to contactThe way we] get in touch with us:", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54287, "text": "5.1. Review right", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54288, "text": "In principle, you can check your personal information in the following way", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54289, "text": "Account Information: You can log in to passport.baidu.com or visit [Mine],-, [Settings], [Account Management], access or edit your personal information information in your account, change your password, perform your password, make progressAccount association or identity authentication.", "label": ["Important", "Contact Information"], "rewrite": "You can log in to passport.baidu at any time or visit [Mine] - [Settings] - [Account Management], visit or edit your personal data information in your account, change your password, perform account association or identity authentication."}
{"task": "rw_50.jsonl", "id": 54290, "text": "Pay attention to real-time bus information: You can check or clear the attention of real-time bus information on [route]-[public transport]-[real-time bus]-[real-time bus].", "label": ["Important", "Edit/Control"], "rewrite": "You can check or clear the attention of real-time bus information on [route]-[public transport]-[real-time bus]."}
{"task": "rw_50.jsonl", "id": 54291, "text": "Pay attention to bus route information: You can check or clear the attention of the bus route information on [route]-[public transport]-[My route].", "label": ["Important", "Edit/Control"], "rewrite": "You can check or clear the information of the bus route on [route]-[public transport]-[My route]."}
{"task": "rw_50.jsonl", "id": 54292, "text": "Favorite bus/walking/cycling/new energy/driving/truck/motorcycle route information: You can check or clear the attention route information in [My]-[Favorite commonly used].", "label": ["Important", "Edit/Control"], "rewrite": "You can check or clear the attention route information in [Mine]-[Favorites]."}
{"task": "rw_50.jsonl", "id": 54293, "text": "Driving/new energy/truck/motorcycle/running route/historical trajectory information: You can check or clear historical trajectory information in [My]-[Footprint]-[Details].", "label": ["Important", "Edit/Control"], "rewrite": "You can check or clear historical trajectory information in [Mine]-[Details]."}
{"task": "rw_50.jsonl", "id": 54294, "text": "Taxi order information: You can at [Rating]-[Personal Center]-[Order Center] or [Mine]-[Order] to check or clear the taxi order information.", "label": ["Important", "Edit/Control"], "rewrite": "You can check or remove the taxi order information in [Dating]-[Personal Center]-[Order Center] or [Mine]-[Order]-[Order]-[Order] to check or remove the taxi order information."}
{"task": "rw_50.jsonl", "id": 54295, "text": "Parking record information: You can check or clear your parking record information in [Parking Assistant]-[Parking History]-[History of Parking]-[History of Parking]-[Parking History].", "label": ["Important", "Edit/Control"], "rewrite": "You can check or clear your parking record information in [Homepage Common features]-[Parking Assistant]-[History of Parking]."}
{"task": "rw_50.jsonl", "id": 54296, "text": "Commuting information: You can set, check, and remove your commute information in [Homepage Travel Channel]-[Edit]-[Edit]-[Edit].", "label": ["Edit/Control", "Important"], "rewrite": "You can set, check, and clear your commute information in [Homepage Travel Channel]-[Edit]-[Edit]-[Edit]."}
{"task": "rw_50.jsonl", "id": 54297, "text": "Common address information: You can set, check, and remove your common address information in the [Homepage Travel Channel]-[Edit]-[Edit]-[Edit].", "label": ["Important", "Edit/Control"], "rewrite": "You can set, check, and clear your common address information in the [Homepage Travel Channel]-[Edit]-[Edit]-[Edit] to remove your common address information."}
{"task": "rw_50.jsonl", "id": 54298, "text": "Itinerary information: You can set, check, and clear your itinerary information in [Homepage Common features]-[More]-[Itinerary Assistant].", "label": ["Important", "Edit/Control"], "rewrite": "You can set, check, and clear your itinerary information in [more functions of the homepage]-[More]-[Itinerary Assistant]."}
{"task": "rw_50.jsonl", "id": 54299, "text": "Recording voice package information: You can on [Homepage Common Functions]-[More]-[Record Voice Pack]-\"Cancel\"-[My Voice]-[I recorded the voice package]Package information.", "label": ["Important", "Edit/Control"], "rewrite": "You can in [homepage commonly used functions]-[more]-[recording voice pack]-\"Cancel \"- [My voice]-[I recorded the voice package] to check or remove the recorded voice package information."}
{"task": "rw_50.jsonl", "id": 54300, "text": "Panorama comment information: You can check or delete the panoramic comment information on [Panorama]-[My Message]-[My Message]-[My Message]-[My Message]-[My Message]-[My Message]-[My Message].", "label": ["Edit/Control", "Important"], "rewrite": "You can check or delete the panoramic comment information on [Panorama]-[My Message]-[My Message]-[My Message]-[My Message]-[My Message]-[My Message]-[My Message]."}
{"task": "rw_50.jsonl", "id": 54301, "text": "Set up common functions: You can set, check, and clear your common functions in [Homepage Common Functions]-[More]-[More]-[More] to remove your common functions.", "label": ["Edit/Control", "Important"], "rewrite": "You can set, check, and clear your common functions in [more functions of the homepage]-[More]-[More]."}
{"task": "rw_50.jsonl", "id": 54302, "text": "5.2. Correction and replenishment", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54303, "text": "When you find that there are errors or incomplete personal information that we processed, you have the right to verify your identity and correct your identity without affecting the objectivity and accuracy of the information.The information is correct or supplemented. You can use [My]-[Settings]-[Account Management] to be corrected or supplemented by yourself in [Baidu Map].us.", "label": ["Edit/Control", "Important"], "rewrite": "You can make corrections or supplements through [Mine]-[Settings]-[Account Management] in your own way, or submit your more correct or supplementary application through feedback and error."}
{"task": "rw_50.jsonl", "id": 54304, "text": "5.3. Delete right", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54305, "text": "In the following circumstances, you can make a request to delete personal information:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54306, "text": "If we violate laws and regulations or deal with your personal information with your agreed;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54307, "text": "If our treatment purpose has been achieved, unable to achieve or for the purpose of the treatment, it is no longer necessary;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54308, "text": "If we stop providing products or services, or the storage period has expired;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54309, "text": "If you withdraw consent;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54310, "text": "Other circumstances stipulated in laws and administrative regulations.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54311, "text": "When you delete the information from our services, we may not immediately delete the corresponding information in the backup system, but will delete these information when the backup is updated.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "When you delete the information from our services, we may not immediately delete the corresponding information in the backup system, but will delete these information when the backup is updated."}
{"task": "rw_50.jsonl", "id": 54312, "text": "Please know and understand that if the preservation period stipulated in laws and administrative regulations or the explanation of this privacy policy has not been expired, or delete personal information is difficult to achieve from technically, we will stop except storage and adopting necessary security measures.deal with.", "label": ["Important", "Risk"], "rewrite": "When you delete the information from our services, we may not immediately delete the corresponding information in the backup system, but will delete these information when the backup is updated."}
{"task": "rw_50.jsonl", "id": 54313, "text": "5.4. Withdrawal consent", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54314, "text": "Each business function requires some basic personal information to complete.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54315, "text": "For the collection and use of additional personal information, you can give or withdraw your authorization consent at any time.", "label": ["Important", "Edit/Control"], "rewrite": "For the collection and use of additional personal information, you can give or withdraw your authorization consent at any time."}
{"task": "rw_50.jsonl", "id": 54316, "text": "You can log in to passport.baidu.com or visit [Mine],-, [Settings], [Account Management]-, [Authorized Management], lifting the binding relationship between Baidu account and third-party account number, or BaiduMultiple settings in the personal center of the map (such as common address settings, navigation settings, privacy settings, etc.) to close some function options to revoke some authorization.", "label": ["Edit/Control", "Important"], "rewrite": "You can log in to passport.baidu.com or visit [Mine] - [Settings] - [Account Management] - [Authorized Management], lifting the binding relationship between Baidu account and third -party account, or multiple through multiple in the personal centerSet up to close some function options to revoke partial authorization."}
{"task": "rw_50.jsonl", "id": 54317, "text": "You can directly turn off the authority of accurate geographical location information, address book, camera, camera, microphone, album permissions and other system permissions to change the scope of consent or withdraw your authorization.", "label": ["Important", "Edit/Control"], "rewrite": "You can directly turn off the authority of accurate geographical location information, address book, camera, camera, microphone, album permissions and other system permissions to change the scope of consent or withdraw your authorization."}
{"task": "rw_50.jsonl", "id": 54318, "text": "When you withdraw your consent, we cannot continue to provide you with the service corresponding to the withdrawal consent, and we will no longer use your corresponding personal information.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "You can directly turn off the authority of accurate geographical location information, address book, camera, camera, microphone, album permissions and other system permissions to change the scope of consent or withdraw your authorization."}
{"task": "rw_50.jsonl", "id": 54319, "text": "But your decision to withdraw consent will not affect personal information processing based on your consent.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "But your decision to withdraw consent will not affect personal information processing based on your consent."}
{"task": "rw_50.jsonl", "id": 54320, "text": "5.5. List of cancellation", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54321, "text": "Each business function requires some basic personal information to complete.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54322, "text": "For the collection and use of additional personal information, you can give or withdraw your authorization consent at any time.", "label": ["Important", "Edit/Control"], "rewrite": "For the collection and use of additional personal information, you can give or withdraw your authorization consent at any time."}
{"task": "rw_50.jsonl", "id": 54323, "text": "You can also cancel your account on Baidu Map through the following path: [Mine],-, [Settings],-, [Account Management]-, [Account Logging out].", "label": ["Edit/Control", "Important"], "rewrite": "You can also cancel your account number on Baidu Maps through the following path: [Mine] - [Settings] - [Account Management] - [Account Logging out]."}
{"task": "rw_50.jsonl", "id": 54324, "text": "Once you cancel the Baidu account, you will not be able to use the services of Baidu's entire line user products, so please do it carefully.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54325, "text": "In order to protect the legitimate rights and interests of you or others, we will determine whether you support your cancellation request for the use of Baidu's products.", "label": ["Important", "Risk"], "rewrite": "In order to protect the legitimate rights and interests of you or others, we will determine whether you support your cancellation request for the use of Baidu's products."}
{"task": "rw_50.jsonl", "id": 54326, "text": "For example, if you have unsolved manuscript fees in Baidu's experience, or you have unprepared glutinous rice storage cards in Baidu Nuomi, or there are information in your network disk, we will not immediately support your request.", "label": ["Risk"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54327, "text": "In addition to the other regulations, we will stop providing you with products and services after canceling the account, and delete your personal information according to your requirements.", "label": ["Important", "Edit/Control"], "rewrite": "After canceling the account, we will stop providing you with products and services and delete your personal information according to your requirements."}
{"task": "rw_50.jsonl", "id": 54328, "text": "If you only need to remove the traces of your use on Baidu map, you can refer to the following path implementation: [My],-, [Settings], [Account Management]-, [Account Logging out]-, [Delete the current application servicetrace.", "label": ["Important", "Edit/Control"], "rewrite": "You can refer to the use of the following paths to clear the traces of the Baidu map: [Mine] - [Settings] - [Account Management] - [Account Logging out] - [Delete the current application service traces]."}
{"task": "rw_50.jsonl", "id": 54329, "text": "You need to apply for a third -party account for a cancellation account through a third -party account (such as WeChat, Weibo, QQ, etc.).", "label": ["Important", "Edit/Control"], "rewrite": "You need to apply for a third -party account for a cancellation account through a third -party account (such as WeChat, Weibo, QQ, etc.)."}
{"task": "rw_50.jsonl", "id": 54330, "text": "5.6. Copy power and the right to carry", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54331, "text": "You have the right to copy your personal information we collected.", "label": ["Edit/Control", "Important"], "rewrite": "You have the right to copy your personal information we collected."}
{"task": "rw_50.jsonl", "id": 54332, "text": "Under the conditions stipulated by laws and regulations, instructions and conditions stipulated by the national network information department at the same time, if technology is feasible, you can also ask us to transfer your personal information to other subjects you designated.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54333, "text": "5.7. Know the product and service in advance to stop operating rights", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54334, "text": "Baidu Map is willing to accompany you. If Baidu Map products stop operations due to special reasons, we will notify you in the homepage or in -site letter or send you an email or other appropriate ways to reach your way to reach your way to reach you during a reasonable period.You will stop the collection of your personal information, and at the same time, you will delete or processes your personal information that has been collected in accordance with the law.", "label": ["Important", "Edit/Control"], "rewrite": "If Baidu map products stop operation, we will notify you within a reasonable period, and will stop collecting personal information, and at the same time delete or processes the collected personal information."}
{"task": "rw_50.jsonl", "id": 54335, "text": "5.8. Get the right to explain", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54336, "text": "You have the right to ask us to explain the personal information processing rules.", "label": ["Important", "Edit/Control"], "rewrite": "You have the right to ask us to explain the personal information processing rules."}
{"task": "rw_50.jsonl", "id": 54337, "text": "You can contact us through the contact information in part 8.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54338, "text": "5.9. Personalized content and advertising display and control", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54339, "text": "5.9.1 display and control of personalized content", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54340, "text": "To facilitate your independent control of personalized information you want to receive, you can dynamically adjust your interest preferences through the following paths, and we will push related personalized content based on your choice.", "label": ["Usage"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54341, "text": "You can dynamically adjust the channel you are interested in in the Baidu Map.", "label": ["Important", "Usage"], "rewrite": "You can dynamically adjust the channel you are interested in in the Baidu Map."}
{"task": "rw_50.jsonl", "id": 54342, "text": "Baidu Map will adjust the content you are interested in on the homepage of the Message Center on the homepage of the message center.", "label": ["Usage"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54343, "text": "You can also adjust at any time when browsing personalized recommendations.", "label": ["Important", "Usage"], "rewrite": "You can also adjust at any time when browsing personalized recommendations."}
{"task": "rw_50.jsonl", "id": 54344, "text": "If you don't like or are interested in the personalized recommendation content, you can turn off the content at any time by clicking on the \"\" icon or icon on the right side of the content.", "label": ["Important", "Usage", "Edit/Control"], "rewrite": "You can turn off the personalized recommendation content at any time by clicking on the \"\" icon or icon on the right side of the content."}
{"task": "rw_50.jsonl", "id": 54345, "text": "We also provide the report/feedback entrance to listen to your opinions and suggestions.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54346, "text": "path:", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54347, "text": "[Mecheng Homepage Push the \"\" icon on the right side of the article]-[Select Reason]-[OK]", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54348, "text": "[Push the \"Feedback\" button in the lower left corner of the end of the article]-[Select the reason]-[Submit]", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54349, "text": "If you don't want to receive our relevant personalized content based on your interest preferences, you can close the personalized content recommendation through [Mine]-[Settings]-[Privacy Settings]-[Personalized Recommendation Settings].", "label": ["Important", "Edit/Control"], "rewrite": "You can close the personalized content recommendation through [Mine]-[Privacy Settings]-[Personalized Recommendation Settings] Close."}
{"task": "rw_50.jsonl", "id": 54350, "text": "When you choose to close the personalized content recommendation, you cannot enjoy personalized recommendation services. We will show you the content based on non -personalized factors such as content heat. You may see what you are not interested in or even dislikes.Experience may be affected.", "label": ["Usage", "Risk"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54351, "text": "5.9.2 Display and control of personalized advertising", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54352, "text": "We may collect and use advertising identification information that meets national or industry group standards. This logo is based on non -sensitive personal information such as equipment models and system configurations to ensure your privacy and service security.Advertising makes you enjoy more convenient services.", "label": ["Important", "First Party Collection Information", "Usage", "Risk"], "rewrite": "We may collect and use advertising identification information that meets national or industry group standards. This logo is based on non -sensitive personal information such as equipment models and system configuration."}
{"task": "rw_50.jsonl", "id": 54353, "text": "After we are online, we will provide you with a close function and inform you that the way off. If you do not want us to use the advertising identification information for the above, we can choose to close at any time.", "label": ["Important", "Edit/Control"], "rewrite": "After we are online, we will provide you with a close function and inform you that the way off. If you do not want us to use the advertising identification information for the above, we can choose to close at any time."}
{"task": "rw_50.jsonl", "id": 54354, "text": "After closing, we will no longer obtain and handle the Internet advertising logo.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54355, "text": "Programmized advertisements are based on your preferences in third -party applications. It is one of the general advertising technology.", "label": ["Usage"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54356, "text": "We only have programmatic advertising docking technology and will not obtain your behavior or personal data in third -party applications.", "label": ["Important", "Usage"], "rewrite": "We only have programmatic advertising docking technology and will not obtain your behavior or personal data in third -party applications."}
{"task": "rw_50.jsonl", "id": 54357, "text": "You can choose to open or turn off the technology by opening/closing [Mine]-[Settings]-[Privacy Settings]-[Procedural Advertising Settings].", "label": ["Edit/Control", "Usage", "Important"], "rewrite": "You can choose to open or turn off the technology by opening/closure [Mine]-[Settings]-[Privacy Settings]-[Programming Advertising Settings]."}
{"task": "rw_50.jsonl", "id": 54358, "text": "If the switch is turned on, the number of ads you see will not decrease, but the accuracy of the advertisement will be reduced.", "label": ["Important", "Risk", "Usage"], "rewrite": "If the switch is turned on, the number of ads you see will not decrease, but the accuracy of the advertisement will be reduced."}
{"task": "rw_50.jsonl", "id": 54359, "text": "5.10. Exception of rights exercise", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54360, "text": "In the following circumstances, we may not be able to respond to your inspection, correction and supplementation, deletion, copying, and request for carrying, knowing, knowing, and deciding:", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "In the following circumstances, we may not be able to respond to your inspection, correction and supplementation, deletion, copying, and request for carrying, knowing, knowing, and deciding:"}
{"task": "rw_50.jsonl", "id": 54361, "text": "Directly related to national security and national defense security;", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "Directly related to national security and national defense security, we cannot respond to your request."}
{"task": "rw_50.jsonl", "id": 54362, "text": "Directly related to public safety, public health, and major public interests;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "We cannot respond to the request with public safety, public health, and major public interests."}
{"task": "rw_50.jsonl", "id": 54363, "text": "Directly related to criminal investigation, prosecution, trial, and execution judgment;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Those who are directly related to criminal investigation, prosecution, trial and execution judgment cannot respond to requests."}
{"task": "rw_50.jsonl", "id": 54364, "text": "We have sufficient evidence that you have subjective malice or abuse of rights (such as your request will endanger public safety and the legitimate rights and interests of others, or your request exceeds the scope of general technical means and commercial costs);", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "If there is sufficient evidence that you have subjective malicious or abuse of rights, you cannot respond to the request."}
{"task": "rw_50.jsonl", "id": 54365, "text": "The request to respond to the subject of the personal information will cause the legitimate rights and interests of you or other individuals and organizations to be seriously damaged;", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "In response to the request of the subject of personal information, if the legitimate rights and interests are severely damaged, the request cannot be responded."}
{"task": "rw_50.jsonl", "id": 54366, "text": "Involved in business secrets;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Those who involve business secrets cannot respond to requests."}
{"task": "rw_50.jsonl", "id": 54367, "text": "Law and administrative regulations have other stipulated situations.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "The laws and administrative regulations have other stipulated situations and cannot respond to requests."}
{"task": "rw_50.jsonl", "id": 54368, "text": "5.11. How to respond to your rights request", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54369, "text": "To ensure safety, you may need to provide a written request or prove your identity in other ways.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54370, "text": "We may ask you to verify your identity first, and then process your request.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54371, "text": "After verification, we will respond within 15 working days.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54372, "text": "If you are not satisfied, you can also pass the following channels: map_service@baidu.com", "label": ["Important", "Contact Information"], "rewrite": "You can complain through the following channels: map_service@baidu.com."}
{"task": "rw_50.jsonl", "id": 54373, "text": "For your reasonable request, we do not charge fees in principle, but we will charge a certain cost fee depending on the request that repeats and beyond the reasonable limit.", "label": ["Important", "Risk"], "rewrite": "We will charge a certain cost and fee for repeated and beyond a reasonable limit."}
{"task": "rw_50.jsonl", "id": 54374, "text": "For those who have no repetition and need too much technical means (for example, need to develop new systems or fundamentally change the current practice), bring risks to others' legitimate rights and interests or very unrealistic (for example, information involved in backup tapes)We may refuse.", "label": ["Important", "Risk"], "rewrite": "We may refuse to reject those who have no repetition, need too much technical means, bring risks or very unrealistic requests to others."}
{"task": "rw_50.jsonl", "id": 54375, "text": "6. How do we deal with the personal information of minors", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54376, "text": "Baidu attaches great importance to the protection of minors' information.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54377, "text": "Our products and services are mainly adults.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54378, "text": "We will only process minor personal information under the consent of laws and regulations, parents or other guardians.", "label": ["Specific Audiences", "Important"], "rewrite": "We will only process minor personal information under the consent of laws and regulations, parents or other guardians."}
{"task": "rw_50.jsonl", "id": 54379, "text": "If you are a minor under the age of 14, before using Baidu map products and services, you should ask your parents or other guardians to read it carefully, or carefully read the privacy under the supervision and guidance of your parents or other guardians under the guidance and guidancePolicies and the \"Professional Information Protection Statement on Baidu Children\", and use our products and services under the consent of your parents or other guardians, or provide us with information.", "label": ["Specific Audiences", "Important"], "rewrite": "Minors under the age of 14 use products and services, or provide information on the premise of obtaining their parents or other guardians."}
{"task": "rw_50.jsonl", "id": 54380, "text": "If we find personal information of minors under the age of 14 without the consent of parents or other guardians who can be proven in advance, we will take measures to delete relevant information as soon as possible.", "label": ["Specific Audiences", "Important"], "rewrite": "If we find personal information of minors under the age of 14 without the consent of parents or other guardians who can be proven in advance, we will take measures to delete relevant information as soon as possible."}
{"task": "rw_50.jsonl", "id": 54381, "text": "If the guardian has reason to collect the personal information of minors without the consent of the guardian, please pass the [Mine]-[Settings]-[Help and Feedback]-[Feedback Suggestion] through Baidu Maps.Contact us, we will take measures to delete relevant data as soon as possible.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54382, "text": "7. Revision of privacy policy", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54383, "text": "Our privacy policy may change.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54384, "text": "Without your clear consent, we will not reduce the rights you should enjoy in accordance with this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54385, "text": "We will post any changes to this privacy policy on this page.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54386, "text": "For major changes, we will notify you in the main exposure page or in -site exposure pages or in -site letters or sending emails or other appropriate ways to reach you.", "label": ["Policy Change", "Important"], "rewrite": "We will notify major changes on the main exposure page or on -site letter on the product or service in the way of sending emails to you."}
{"task": "rw_50.jsonl", "id": 54387, "text": "If you do not agree with these changes, please stop using Baidu map products and services immediately.", "label": ["Policy Change", "Important", "Risk"], "rewrite": "If you do not agree with these changes, please stop using Baidu map products and services immediately."}
{"task": "rw_50.jsonl", "id": 54388, "text": "The major changes in this policy include, but not limited to:", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54389, "text": "Our service model has changed significantly.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54390, "text": "Such as the purpose of handling personal information, the type of personal information, the use of personal information, etc.;", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54391, "text": "We have changed significantly in the aspects of ownership structure and organizational structure.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54392, "text": "Such as changes caused by business adjustments, bankruptcy mergers and acquisitions, etc.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54393, "text": "The main objects that provide, transfer or publicly disclose personal information have changed;", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54394, "text": "You participated in the right of personal information processing and its exercise methods have undergone major changes;", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54395, "text": "When we are responsible for handling the responsibility departments, contact methods and complaint channels of personal information security;", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54396, "text": "The personal information security impact assessment report shows that there is a high risk.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54397, "text": "If there is a privacy policy that has not been done, the \"Baidu Privacy Protection Statement\" shall prevail", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54398, "text": "8. How to contact us", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54399, "text": "The growth of Baidu Maps is inseparable from the joint efforts of users of all parties. We thank you very much for your contribution to Baidu map data update and feedback.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54400, "text": "You can use [Mine]-[Settings]-[Help and Feedback]-[Feedback Suggestions]", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54401, "text": "Feedback your suggestions on Baidu Maps and problems encountered during use to help us optimize product functions and services and make more users more convenient to use our products and services.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54402, "text": "You can contact us through personal information protection problem feedback platform (http://help.baidu.com/personalinFormation).", "label": ["Important", "Contact Information"], "rewrite": "You can contact us through personal information protection problem feedback platform (http://help.baidu.com/personalinFormation)."}
{"task": "rw_50.jsonl", "id": 54403, "text": "You can also contact us by contacting us as follows.", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54404, "text": "No. 10, Shangdi Street, Haidian District, Beijing, China", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54405, "text": "Beijing Baidu Net News Technology Co., Ltd. Legal Affairs Department", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54406, "text": "Postal code: 100085", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54407, "text": "In order to ensure our efficient handling of your problems and feedback to you in time, you need to submit identity certificates, effective contact information and written requests and related evidence. We will verify your identity to deal with your request.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54408, "text": "If you are not satisfied with our response, especially if you think our personal information processing behavior harms your legitimate rights and interests, you can also seek solutions through the following external channels: a lawsuit with the Beijing People's Court of Beijing.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54409, "text": "Attachment: term explanation", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54410, "text": "Personal information refers to the various information related to the recognized or recognizable natural person recorded in electronics or other methods, excluding information after anonymous processing.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54411, "text": "Personal information includes names, date of birth, ID number, personal biometric information, address, communication and communication contact information, communication records and content, account passwords, property information, credit information, travel information, accommodation information, health and physiological information, transactions, transactions, transactions, transactions, transactions, transactions, transactionsInformation, etc.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54412, "text": "Sensitive personal information refers to personal information that can easily cause the personality and dignity of natural persons to be infringed or harmed by personal and property security, including biometrics, religious beliefs, specific identities, medical health, financial accounts, trajectory trajectory and other informationAnd personal information under minor at the age of 14.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54413, "text": "Device refers to devices that can be used to use Baidu products and/or services, such as desktop devices, tablets or smartphones.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54414, "text": "Equipment information refers to the device attribute information you use to install and run the Baidu map device (such as your hardware model, operating system version and system situation, device configuration, international mobile device identity code IMEI, international mobile user recognition code IMSI, IMSI,Network device hardware address Mac, advertising identifier IDFA, supply trademark identification IDFV, mobile device recognition code Meid, anonymous device identifier OAID, Andriod ID and other equipment identifiers), device connection information (such as the type of browser, telecommunications operator, telecommunications operator, Language, WIFI information), and device status information (such as device application installation list).", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54415, "text": "Log information refers to the requests that our server automatically records your requests when visiting Baidu Maps, such as your IP address, the type of browser and the language of the use of hardware equipment, the version of the operating system, the information of the network operator, the information of the network operatorThe date, time, and length of your access to the service are provided, formed or reserved when you use our products or services.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54416, "text": "Cookie refers to a mechanism that supports the server (or script) to store and retrieve information on the client. By adding a simple and persistent client state to expand the web -based client/server application.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54417, "text": "The server sends a status information while returning the HTTP object to the client, and is stored by the client.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54418, "text": "The state information shows the effective URL range in this state.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54419, "text": "Since then, the HTTP request within this range initiated by the client will return the current value of the status information from the client to the server. This state information is called Cookie.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54420, "text": "Location information refers to the accurate location information obtained by GNSS information, WLAN access points, Bluetooth, base stations, and other sensor information, as well as rough geographical location information obtained through the IP address.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54421, "text": "User portraits refer to analysis or predictions of personal characteristics of a certain natural person through collecting, gathering, and analyzing personal information, such as their occupations, economy, health, education, personal preferences, credit, behavior, etc., to form their personal characteristic modelEssence", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54422, "text": "Use personal information of specific natural persons to form a characteristic model of the natural person, called direct user portraits.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54423, "text": "The use of personal information from specific natural persons, such as the data of its group, forms a characteristic model of the natural person, called indirect user portraits.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54424, "text": "Decoration refers to the process of processing personal information, so that it cannot recognize a specific natural person without using additional information.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54425, "text": "Anonymous refers to the process that the personal information subject cannot be recognized by the technical processing of personal information, and the processing information cannot be restored.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54426, "text": "The information obtained by personal information after anonymous processing does not belong to personal information.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54427, "text": "Baidu platform refers to the special channels or platform services of Baidu Company (including Baidu search, Baidu APP and derivative version, Baidu Encyclopedia, Baidu Tieba, Baidu mobile assistant and other Baidu products https://www.baidu.com/more/) and other websites, programs, services, tools and clients.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54428, "text": "A related company refers to the single name or collecting name of the operator of Baidu Map Beijing Baidu Net News Technology Co., Ltd. and other companies that have related relationships with Baidu.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54429, "text": "\"Related relationship\" refers to the subject (including individuals, companies, partnerships, organizations, or other entities), that is, the subject that directly or indirectly controls, or the subject that controls it directly or indirectlyMaster controlled by the same subject.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54430, "text": "The aforementioned \"control\" means that through holding voting rights, contracts or other methods, directly or indirectly have the power or other relationships that instructions or instructions that to instructions to make instructions by others.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54431, "text": "Thank you again for your trust and use of Baidu Maps!", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54432, "text": "Beijing Baidu Net News Technology Co., Ltd.", "label": [], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54433, "text": "Update date: June 30, 2022", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54434, "text": "Effective date: July 07, 2022", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_50.jsonl", "id": 54435, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
