{"task": "rw_56.jsonl", "id": 56797, "text": "CCB Life Platform Personal Information Protection Policy", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56798, "text": "Dear users: Our bank has updated the \"Personal Information Protection Policy\". The update content is mainly: 1. How can our bank collect your personal information;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56799, "text": "2. How do I use your personal information;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56800, "text": "3. How do we handle minor information.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56801, "text": "Version update date: July 14, 2022", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56802, "text": "Version Effective Date: July 27, 2022", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56803, "text": "China Construction Bank Co., Ltd. Zhejiang Branch (hereinafter referred to as \"my bank\") knows the importance of personal information to you and will try its best to protect your personal information security.", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56804, "text": "Integrity principles, information quality principles, etc.", "label": ["Important", "Data Security"], "rewrite": "Our bank adheres to the following principles to protect your personal information: the principles of consistency and responsibility, the principles of clear purpose, the principle of consent, the principles of necessity, the principles of safety, the principle of openness and transparency, the principles of subject participation, the principles of integrity, and the principle of information quality."}
{"task": "rw_56.jsonl", "id": 56805, "text": "At the same time, our bank promises to take corresponding security measures in accordance with the law to protect your personal information.", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56806, "text": "We hope to clearly introduce you how to deal with your personal information when using the product and/or services of the use of the CCB life platform through this personal information protection policy, and the access, correction, delete, and protecting this information we provide youWay.", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56807, "text": "This \"Personal Information Protection Policy\" will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56808, "text": "1.How does our trip collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56809, "text": "2.How does our trip use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56810, "text": "3.How to share, transfer and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56811, "text": "4.How does our trip store and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56812, "text": "5.The right to control personal information", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56813, "text": "6.How do we handle minor information", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56814, "text": "7.How to update this policy", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56815, "text": "8.How to contact me", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56816, "text": "[Special Tips] Before using the various products and/or services provided by the CCB Living Platform, please carefully read and fully understand this \"Personal Information Protection Policy\" (the key content we have bolded the font, please pay special attention) and make a special attention) and make it to make it.Choose accordingly.", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56817, "text": "If you have any questions about this personal information protection policy, you can contact our bank through the \"how to contact me\" through this personal information protection policy).", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56818, "text": "Please note that this policy is not applicable to other third -party products/services connected by your products/services (\"Other third parties\", including your trading counterparty, any third -party website, and third -party service providerWait), please refer to the hidden of the third party.", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56819, "text": "Private policy or similar statement.", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56820, "text": "1. How does our trip collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56821, "text": "Personal information refers to various information related to recognized or recognized natural persons recorded in electronics or other ways.", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56822, "text": "Personal information includes names, birthdays, ID numbers, personal biometric information, communication and communication contact information, address, account information, property status, trajectory trajectory, etc.", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56823, "text": "Once it is leaked, wrong.", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56824, "text": "The law provides or abuses the security of people and property, which can easily lead to information such as personal reputation, physical and mental health damage or discriminatory treatment as personal sensitive information, mainly include: ID number, personal biometric information, financial accounts, credit reportingInformation, property information, transaction information, trading trajectory, health and physiological information, specific identities, personal information of minors under the age of 14, etc.", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56825, "text": "(1) How to collect information", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56826, "text": "In order to provide you with service and ensure the safety of your CCB living platform, in the process of using CCB Life Platform, our bank will collect your active input or information generated by your service during the service process:", "label": ["Important", "First Party Collection Information"], "rewrite": "Our travel will collect information you actively enter or due to service during the use of services."}
{"task": "rw_56.jsonl", "id": 56827, "text": "1. When you open the service of CCB Life Platform, according to laws and regulations and regulatory requirements, our bank will collect your mobile phone number to help you complete the CCB living platform registration. If you refuse to provide this information, you may not be able to open the CCB living platformOr unable to use the service of the CCB life platform normally.", "label": ["Important", "First Party Collection Information"], "rewrite": "Our bank will collect your mobile phone number to help you complete the registration of CCB Life Plata."}
{"task": "rw_56.jsonl", "id": 56828, "text": "2. When you use the functions or services of CCB's life platform, for example, in the following situations, you may need to provide or authorize our bank to collect the user information required for the corresponding services.", "label": ["Important", "First Party Collection Information"], "rewrite": "In the following situations, you may need to provide or authorize our bank to collect the user information required for the corresponding services."}
{"task": "rw_56.jsonl", "id": 56829, "text": "If you refuse to provide some functions or services, you may not be able to use this part of the function or service, but this does not affect other functions or services of your normal use of the CCB life platform:", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide some functions or services, you may not be able to use it, but this does not affect your normal use of other functions or services."}
{"task": "rw_56.jsonl", "id": 56830, "text": "(1) In order to allow you to use the CCB living platform more secure and quickly, in the link that requires SMS verification codes, you may need to read the verification code SMS content to help you fill in the verification code.", "label": ["Important", "First Party Collection Information"], "rewrite": "In the link of the SMS verification code, you may need to read the verification code SMS content to help you fill in the verification code."}
{"task": "rw_56.jsonl", "id": 56831, "text": "If you refuse to authorize the communication information (SMS), the CCB Life Plata will not read the text message content, and the system background will not save the text message content.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to authorize the communication information (SMS), the CCB Life Plata will not read the text message content, and the system background will not save the text message content."}
{"task": "rw_56.jsonl", "id": 56832, "text": "(2) When you use our bank payment, CCB Life Service Platform Payment and other payment products, you may need to provide your name, mobile phone number, certificate type and document number, bank card number/account information, and get your separate aloneAfter the authorization consent, collect your face information in order to verify your identity and use the above function payment services.", "label": ["Important", "First Party Collection Information"], "rewrite": "You may need to provide your name, mobile phone number, certificate type and document number, bank card number/account information, and collect your face information after obtaining your separate authorization consent in order to verify your identity and use payment services."}
{"task": "rw_56.jsonl", "id": 56833, "text": "In addition, our bank will collect your related receivable transactions for your inquiry.", "label": ["Important", "First Party Collection Information"], "rewrite": "Our bank will also collect your related receipt and payment transactions to facilitate your inquiry."}
{"task": "rw_56.jsonl", "id": 56834, "text": "The relevant matters are implemented according to the \"CCB Life Wallet User Service Agreement\" that you agree to sign when you add a bank card.", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56835, "text": "The above information is a sensitive personal information. If you refuse to provide this information, it will only make you unable to use the above features, but it does not affect other functions of your normal use of the CCB life platform.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Refusing to provide sensitive information will only make you unable to use the above features, but it does not affect your normal use of other functions."}
{"task": "rw_56.jsonl", "id": 56836, "text": "Among them, the scope of the face verification application includes the real -name authentication function of the face brushing.", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56837, "text": "You can open or close the above functions through the \"Settings-Security Verification-Brushing Face\" through CCB's life, and you can also update face information in the menu bar.", "label": ["Important", "Edit/Control"], "rewrite": "You can open or close the above functions through the \"Settings-Security Verification-Brushing Face\" through CCB's life, and you can also update face information in the menu bar."}
{"task": "rw_56.jsonl", "id": 56838, "text": "(3) When you use the real -name authentication service provided by the CCB Life Plata, you may need to provide your name, certificate type, certificate number, bank card number/account number, equipment information, and collect you after obtaining your separate authorization consent, collect youFace information.", "label": ["Important", "First Party Collection Information"], "rewrite": "You may need to provide your name, certificate type, certificate number, bank card number/account number, equipment information, and collect your face information after obtaining a separate authorization consent."}
{"task": "rw_56.jsonl", "id": 56839, "text": "Our bank may also verify the effective information of relevant information by verifying the account/card password and SMS verification code.", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56840, "text": "If you do not provide the above information, our bank will not be able to provide you with products or services that you need to use after real -name authentication.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you do not provide face information, our bank will not be able to provide you with products or services that need to be used after real -name authentication."}
{"task": "rw_56.jsonl", "id": 56841, "text": "(4) When you use the search service provided by the CCB Life Plata, our bank will collect your search keyword information and click data to facilitate you to repeat or display the products or services related to the search content.", "label": ["Important", "First Party Collection Information"], "rewrite": "Our bank will collect your search keyword information and click data to facilitate you to enter or display products or services related to your search content."}
{"task": "rw_56.jsonl", "id": 56842, "text": "When searching keyword information cannot be alone or identifies your personal identity with other information, the information does not belong to your user information. In order to provide you and other users with more efficient search services, our bank can use other purposes to use other purposes.Items", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56843, "text": "When searching keyword information with your other information can identify your personal identity, our bank will use your search keyword information as your user information during the combination period to protect it.", "label": ["Important", "First Party Collection Information"], "rewrite": "Our bank will use your search keyword information as your user information during the combination period, and protect it."}
{"task": "rw_56.jsonl", "id": 56844, "text": "(5) When you use geographical position -based functions, our bank will collect your location information in order to provide you with the corresponding service at your location.", "label": ["Important", "First Party Collection Information"], "rewrite": "Our bank will collect your location information to provide the corresponding services at the position."}
{"task": "rw_56.jsonl", "id": 56845, "text": "If you refuse to provide this information, you will not be able to use the above features, but this does not affect other functions of your normal use of the CCB life platform.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide information, you will not be able to use the above features, but this does not affect your normal use of other functions."}
{"task": "rw_56.jsonl", "id": 56846, "text": "(6) When you conduct information management through the CCB life platform, our bank may verify your mobile phone number SMS verification code, original use equipment, account information, and identity information.", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56847, "text": "(7) When you use the information notification service of the CCB Living Platform, our bank will collect your user information and transaction information in order to send you relevant transaction notices in time;", "label": ["Important", "First Party Collection Information"], "rewrite": "Our bank will collect your user information and transaction information in order to send you relevant transaction notices in time."}
{"task": "rw_56.jsonl", "id": 56848, "text": "Our bank may also collect information from our partner and information that you can share with it with authorization, so that you can provide you with corresponding message notifications and other services.", "label": ["Important", "First Party Collection Information"], "rewrite": "Our bank may collect information from partners and authorize the information that you can share in order to provide services such as corresponding message notifications."}
{"task": "rw_56.jsonl", "id": 56849, "text": "If you refuse such information notifications, you can close the message notification or withdraw the SMS notification in the APP settings, or call the 95533 customer service phone call to the withdrawal method.", "label": ["Important", "Edit/Control"], "rewrite": "If you refuse the information notification, you can close the message notification or unsubs a SMS notification in the APP settings, or call the 95533 customer service telephone consultation method."}
{"task": "rw_56.jsonl", "id": 56850, "text": "(8) When you use the mobile phone recharge service provided by the CCB Living Platform, you need to enter the mobile phone number manually. Our bank only reads and records the phone number you entered handmade, and does not read your full address book.", "label": ["Important", "First Party Collection Information"], "rewrite": "Our bank only reads and records the phone number you entered handmade, and does not read your full address book."}
{"task": "rw_56.jsonl", "id": 56851, "text": "(9) In order to enhance your experience on CCB's life platform, our bank may push you to your product or service information. If you refuse this service, our will provide you with the way to close this push. You can be in my-The set notification Settings Select \"Message Free Interference\".", "label": ["Edit/Control", "Important"], "rewrite": "You can select \"Message Free\" at my-setting notification settings to close the push service."}
{"task": "rw_56.jsonl", "id": 56852, "text": "Our bank will not provide product information recommended for automated decision -making methods such as algorithms.", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56853, "text": "When you use the ordering service provided by the CCB Living Platform, you need to fill in the necessary order information on the order page. At the same time, the order number will be provided in this orderPayment information.", "label": ["Important", "First Party Collection Information"], "rewrite": "You need to fill in the necessary order information in the order page."}
{"task": "rw_56.jsonl", "id": 56854, "text": "All the above information constitutes your order information. Our bank will use your order information to perform your identity verification, determine transactions, pay settlement, complete distribution, query orders for you, and provide customer service consultation and after -sales service;", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56855, "text": "Our bank will also use your order information to determine whether your transaction is abnormal to protect your transaction security.", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56856, "text": "After placing an order, you can choose to use our Long Dragon Payment, CCB Living Platform Wallet Payment, third -party payment or other payment products.", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56857, "text": "After you place an order and complete the payment online, the CCB Living Platform Merchant and a third -party distribution company will complete the delivery of the order for you.", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56858, "text": "You agree here that the CCB Living Platform Merchant Furniture and third -party distribution companies, after -sales service, etc. can use your order information to provide you with goods or services.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "CCB Living Platform Merchant Merchants, third -party distribution companies, after -sales service, etc. can use your order information to provide you with goods or services."}
{"task": "rw_56.jsonl", "id": 56859, "text": "Our telephone customer service and after -sales function will use your account information and order information.", "label": ["Important", "Usage"], "rewrite": "Our telephone customer service and after -sales function will use your account information and order information."}
{"task": "rw_56.jsonl", "id": 56860, "text": "To ensure your account security, our customer service will use your account information to verify your identity with you.", "label": ["Important", "Usage"], "rewrite": "Our customer service will use your account information to verify your identity with you."}
{"task": "rw_56.jsonl", "id": 56861, "text": "When you need our bank to provide customer service and after -sales service related to your order information, our bank will check your order information.", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56862, "text": "You may provide other information except the above information when communicating with our customer service staff, such as: when you ask our bank to change the delivery address, contact or contact number.", "label": ["Important", "First Party Collection Information"], "rewrite": "You may provide other information except the above information when communicating with our customer service staff."}
{"task": "rw_56.jsonl", "id": 56863, "text": "3. When you use the service of CCB Living Platform, in order to maintain the normal operation of the service and ensure your account security, our guild collects the following basic information, including your device model, operating system, unique equipment identifier, and CCB living platform software, ID, service log information (such as searching, viewing information, service failure information you searched on the CCB Life Platform), etc.) This information is the basic information that you must collect services that you must collect for you to use to ensure that you use our travel normallyServe.", "label": ["Important", "First Party Collection Information"], "rewrite": "Our guild collects the following basic information, including your device model, operating system, unique equipment identifier, CCB Living Platform software version number, login IP address, method, type and status of access networks, network quality data, equipment accelerator (equipment (equipment (network quality data, equipment accelerator (Such as gravity induction equipment, etc.), operation log, MAC address, base station information, mobile phone equipment information, WIFI MAC address, Android ID, service log information (such as information on searching, viewing information, service failure information you searched on the CCB life platform), etc.)Log information."}
{"task": "rw_56.jsonl", "id": 56864, "text": "Due to the differences in the permissions of the mobile phone operating system of different manufacturers, some mobile phones attribute the \"unique device logo\" to \"phone -call status or mobile network information\" or \"mobile phone information -mobile phone number and call status\".I did not read your mobile phone call records and status.", "label": ["Important"], "rewrite": "Some mobile phones attribute the \"unique device logo\" to \"phone -call status or mobile network information\" or \"mobile phone information -mobile phone number and call status\". In fact, our travel has not read your phone call records andstate."}
{"task": "rw_56.jsonl", "id": 56865, "text": "4. For the relevant information provided to the third party when you use the service provided by the third party, our bank will be regarded as you allow the third party to obtain the above -mentioned information;", "label": ["Permission Acquisition", "Important", "Risk"], "rewrite": "When you use the service provided by a third party, you actively provide relevant information to the third party. Our bank will be deemed that you allow the third party to obtain information."}
{"task": "rw_56.jsonl", "id": 56866, "text": "For the information that you generate when using the third -party service, you and the third party should agree on the collection and use of the above information according to law.", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56867, "text": "If you refuse to collect, use, or pass the above information when providing services, it may cause you to be unable to use the corresponding service of third parties on the CCB Life Plata, but this does not affect other functions of your use of CCB Life Plata.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56868, "text": "In some specific business scenarios, in order to improve business processing capabilities, reduce costs or other aspects, we may use high -quality third -party software development packages (SDK) to provide you with services.", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56869, "text": "These SDKs may collect and use your personal information. For the relevant information provided by the service you provided by the third party, our bank will be regarded as allowing you to allow the third party to obtain the above -mentioned information;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "When you actively provide the relevant information provided by the service provided by a third party, our bank will be deemed that you allow the third party to obtain the above -mentioned information."}
{"task": "rw_56.jsonl", "id": 56870, "text": "For the information that you generate when using the third -party service, you and the third party should agree on the collection and use of the above information according to law.", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56871, "text": "If you refuse to collect, use, or pass the above information when providing services, it may cause you to be unable to use the corresponding service of third parties on the CCB Life Plata, but this does not affect other functions of your use of CCB Life Plata.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If you refuse to collect, use, or pass the above information when providing services, it may cause you to be unable to use the corresponding service of a third party, but this does not affect other functions."}
{"task": "rw_56.jsonl", "id": 56872, "text": "These third -party SDKs include:", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56873, "text": "(1) Baidu Map SDK: In order to provide you with positioning, taxi services and regional special services in time, we use Baidu Map SDK to obtain the unique device recognition code and the position permissions of the machine after you authorize the consent.Can't use this functional service.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "We use the Baidu Map SDK to obtain the unique device recognition code and the position permissions of the machine after you authorize the consent."}
{"task": "rw_56.jsonl", "id": 56874, "text": "(2) Xiaomi push SDK: In order to push more timely in time, we will use Xiaomi to push the SDK. After you authorize the consent, obtain the unique device recognition code. If the permissions are not authorized, the functional service cannot be used.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "We will use Xiaomi to push the SDK, and obtain the unique device recognition code after you authorize the consent. If the permissions are not authorized, the function will not be available."}
{"task": "rw_56.jsonl", "id": 56875, "text": "(3) Huawei Push SDK: In order to push more timely in time, we will use Huawei to push SDK. After you authorize the consent, obtain the unique device recognition code. If the permissions are not authorized, the functional service cannot be used.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "We will use Huawei to push SDK, and obtain the unique device recognition code after you authorize your consent. If the permissions are not authorized, the functional service cannot be used."}
{"task": "rw_56.jsonl", "id": 56876, "text": "(4) Social sharing SDK: In order to provide convenient sharing functions to CCB's life users, we will use the Socialization of the Young League to share SDK. After you authorize the consent, obtain the unique device recognition code and equipment MAC address.Permissions will not be able to use this functional service.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "We will share SDK with the socialization of You alliance, and obtain the unique device recognition code and device MAC address after you authorize the consent."}
{"task": "rw_56.jsonl", "id": 56877, "text": "(5) Sina Weibo SDK: In order to provide convenient Weibo sharing functions to CCB's life users, we will use Sina Weibo SDK to obtain clipboard information and user account information after you have authorized consent.Use this functional service.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "We will use Sina Weibo SDK to obtain clipboard information and user account information after you authorize consent."}
{"task": "rw_56.jsonl", "id": 56878, "text": "(6) Google QR code scanning code SDK: In order to provide Google QR code scanning function to CCB's life users, we will use Google QR code to scan the code SDK to obtain user camera permissions and album information after your authorization consent, such asThis functional service cannot be used without authorization.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "We will use Google QR code to scan the code SDK to obtain user camera permissions and album information after you authorize consent."}
{"task": "rw_56.jsonl", "id": 56879, "text": "(7) WeChat SDK: In order to provide convenient WeChat sharing functions to CCB's life users, we will use WeChat SDK to obtain user clipping information after you authorize consent. If you do not authorize this authority, you cannot use this functional service.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "We will use WeChat SDK to obtain user clipping information after you authorize consent."}
{"task": "rw_56.jsonl", "id": 56880, "text": "(8) 安全 Safety SDK: In order to provide a safe probe application to run the collapse information acquisition function to the establishment of a safety probe application for CCB, we will use the security SDK to obtain the unique device recognition code, mobile phone number, and CCB Life APP operation after you authorize the consent.The situation and the app running collapse of the APP. If the permissions are not authorized, the functional service cannot be used.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "We will use the security SDK to obtain the unique device recognition code, mobile phone number, CCB Life APP operation, and APP operation collapse."}
{"task": "rw_56.jsonl", "id": 56881, "text": "(9) Baidu SDK: In order to provide you with a map display service in time, we use Baidu SDK to obtain the location permissions of the machine after you authorize and agree.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "We use Baidu SDK to obtain the position permissions of the machine after your authorization and consent."}
{"task": "rw_56.jsonl", "id": 56882, "text": "(10) OCRSDK: In order to provide you with QR code scanning services and bank card recognition services in time, we use OCRSDK to obtain user camera permissions and album information after you authorize.Essence", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "We use OCRSDK to obtain user camera permissions and album information after your authorization consent."}
{"task": "rw_56.jsonl", "id": 56883, "text": "(11) HKUST Xunfei SDK: In order to provide you with voice recognition services in time, we use HKUST Xunfei SDK to obtain microphone rights and voice information after you authorize your consent.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "We use HKUST Xunfei SDK to obtain microphone rights and voice information after your authorization consent."}
{"task": "rw_56.jsonl", "id": 56884, "text": "(12) OPPO push SDK: In order to push more timely in time, we will use OPPO to push SDK. After you authorize your consent, obtain the unique device identification code. If the permissions are not authorized, the functional service cannot be used.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "We will use OPPO to push the SDK, and get the unique device recognition code after you authorize the consent."}
{"task": "rw_56.jsonl", "id": 56885, "text": "(13) vivo push SDK: In order to push more timely in time, we will use vivo to push SDK. After you authorize your consent, obtain the unique device recognition code. If the permissions are not authorized, the functional service cannot be used.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "We will use vivo to push the SDK, and get the unique device recognition code after your authorization consent."}
{"task": "rw_56.jsonl", "id": 56886, "text": "(14) Gaode Map SDK: In order to provide you with the map coordinate conversion function in time, we will use the Gaode Map SDK to obtain the user's position permissions after you authorize the consent. If the permissions are not authorized, the functional service cannot be used.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "We will use the Gaode Map SDK to obtain user position permissions after you authorize consent."}
{"task": "rw_56.jsonl", "id": 56887, "text": "(15) UnionPay online unified cashier payment control SDK: In order to provide a safe payment function to CCB's life users, we will use UnionPay online unified cashiers to pay the control SDK. After you authorize the consent, obtain the user network authority, mobile network status,Permissions and WIFI status permissions, if the permissions are not authorized, the functional service cannot be used.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "We will use UnionPay online cash registers to pay control SDK, and obtain user network permissions, mobile network status permissions, and WIFI status permissions after authorization."}
{"task": "rw_56.jsonl", "id": 56888, "text": "(16) UnionPay ride code SDK: In order to provide CCB's life users with a car code exhibition function, we will use UnionPay ride code SDK to obtain user network permissions and location permissions after you authorize your consent.Can't use this functional service.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "We will use UnionPay ride code SDK to obtain user network permissions and location permissions after you authorize consent."}
{"task": "rw_56.jsonl", "id": 56889, "text": "5. In order to provide you with personalized services, you can choose to use the expansion function we provide. We will collect and use the following information in accordance with the laws and regulations and use the following information according to your specific authorization.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56890, "text": "This kind of information will be collected in the specific functions and business scenarios you choose. If you do not provide this information, it will not affect your basic function of using CCB life.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you do not provide this information, it will not affect your basic function of using CCB life."}
{"task": "rw_56.jsonl", "id": 56891, "text": "In the following situations, you can choose to authorize us to collect and use personal information:", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "In the following situations, you can choose to authorize us to collect and use personal information:"}
{"task": "rw_56.jsonl", "id": 56892, "text": "(1) The camera is used for identifying the QR code, setting avatars, brushing face authentication, and used in scanning, avatar settings, and face -brushing authentication scenarios.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "You can choose the authorized camera permissions."}
{"task": "rw_56.jsonl", "id": 56893, "text": "After rejecting authorization, the above functions will not be used.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "After rejecting authorization, the above functions will not be used."}
{"task": "rw_56.jsonl", "id": 56894, "text": "(2) Album, you can choose to open the system's album authority, and authorize us to access your album by actively uploading pictures, videos, etc., so that you can publish content by uploading photos or uploading videos.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "You can choose to turn on the system of the system and authorize us to access our album through actively uploading pictures, videos and other methods."}
{"task": "rw_56.jsonl", "id": 56895, "text": "We will collect the above information you choose to upload. You can close it in the system permissions. Once you close it, you may not be able to replace the avatars, publish a picture review, etc., but it will not affect youEnjoy other functions of CCB's life platform.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "We will collect the above information you choose to upload, you can close in the system permissions."}
{"task": "rw_56.jsonl", "id": 56896, "text": "(3) Microphone, used for sound pattern recognition, recording, voice navigation, voice banking, voice broadcast, voice customer service use, use in sound pattern login/transfer/payment, voice navigation, voice banking, scenes, and scenes.", "label": ["Permission Acquisition", "Important"], "rewrite": "You can choose to authorize microphone rights."}
{"task": "rw_56.jsonl", "id": 56897, "text": "After rejecting authorization, the above functions will not be used.", "label": ["Permission Acquisition", "Important"], "rewrite": "After rejecting authorization, the above functions will not be used."}
{"task": "rw_56.jsonl", "id": 56898, "text": "The sound pattern data collected by our line is stored in the system background database after encryption.", "label": ["Data Retention", "Important", "First Party Collection Information"], "rewrite": "The sound pattern data collected by our line is stored in the system background database after encryption."}
{"task": "rw_56.jsonl", "id": 56899, "text": "(4) Mobile SMS, you may need to read the verification code SMS content in the link that requires the SMS verification code to help you fill in the verification code.", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56900, "text": "The background of our system does not save SMS content.", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56901, "text": "If you refuse to authorize the communication information (SMS), the CCB Life Plata will not read the content of the SMS, and the authorization function will not be provided.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you refuse to authorize the communication information (SMS), the CCB Life Plata will not read the content of the SMS, and the authorization function will not be provided."}
{"task": "rw_56.jsonl", "id": 56902, "text": "(5) The mobile phone address book, during the payment process, is used to assist you in quickly select the phone number through the address book, without the need to enter manually.", "label": ["Permission Acquisition", "Important"], "rewrite": "Select authorized mobile phone communication records."}
{"task": "rw_56.jsonl", "id": 56903, "text": "After rejecting authorization, the function of opening the loan bar can still be used, but you need to enter the mobile phone number manually.", "label": ["Permission Acquisition", "Important"], "rewrite": "After rejecting authorization, the function of opening the loan bar can still be used, but you need to enter the mobile phone number manually."}
{"task": "rw_56.jsonl", "id": 56904, "text": "CCB Life reads only and records the designated phone number, and does not read the full address book of the customer.", "label": ["Permission Acquisition", "Important"], "rewrite": "CCB Life reads only and records the designated phone number, and does not read the full address book of the customer."}
{"task": "rw_56.jsonl", "id": 56905, "text": "(6) Geographical location, obtaining your geographical location, mainly used for electronic bank transaction risk control, and can also show urban services.", "label": ["Permission Acquisition", "Important"], "rewrite": "Select authorized geographical location permissions."}
{"task": "rw_56.jsonl", "id": 56906, "text": "The system background keeps your location information when trading.", "label": ["Important", "First Party Collection Information"], "rewrite": "The system background keeps your location information when trading."}
{"task": "rw_56.jsonl", "id": 56907, "text": "After rejecting authorization, the related functions of the CCB Life Platform cannot be used.", "label": ["Permission Acquisition", "Important"], "rewrite": "After rejecting authorization, the related functions of the CCB Life Platform cannot be used."}
{"task": "rw_56.jsonl", "id": 56908, "text": "(7) Read the installation application list to scan the application of the CCB APP app.", "label": ["Permission Acquisition", "Important"], "rewrite": "Application authorization has been installed and applied."}
{"task": "rw_56.jsonl", "id": 56909, "text": "After rejecting authorization, the APP health check function cannot be used.", "label": ["Permission Acquisition", "Important"], "rewrite": "After rejecting authorization, the APP health check function cannot be used."}
{"task": "rw_56.jsonl", "id": 56910, "text": "The system's background does not save customers who have installed application list information.", "label": ["Data Retention", "Important"], "rewrite": "The system's background does not save customers who have installed application list information."}
{"task": "rw_56.jsonl", "id": 56911, "text": "(8) Bluetooth is used to connect and interact with third -party devices through Bluetooth.", "label": ["Permission Acquisition", "Important"], "rewrite": "Apply to obtain Bluetooth permissions."}
{"task": "rw_56.jsonl", "id": 56912, "text": "After refusal to be authorized, it cannot be used.", "label": ["Permission Acquisition", "Important"], "rewrite": "After refusal to be authorized, it cannot be used."}
{"task": "rw_56.jsonl", "id": 56913, "text": "The system's background does not save the customer's mobile phone Bluetooth configuration information.", "label": ["Important", "First Party Collection Information"], "rewrite": "The system's background does not save the customer's mobile phone Bluetooth configuration information."}
{"task": "rw_56.jsonl", "id": 56914, "text": "(9) Network communication is used to communicate with the server.", "label": ["Permission Acquisition", "Important"], "rewrite": "Apply to obtain network communication permissions."}
{"task": "rw_56.jsonl", "id": 56915, "text": "After rejecting authorization, all functions of the CCB Life Platform cannot be used.", "label": ["Permission Acquisition", "Important"], "rewrite": "After rejecting authorization, all functions of the CCB Life Platform cannot be used."}
{"task": "rw_56.jsonl", "id": 56916, "text": "The network information used in the system to save the device used in the system, including IP, port and other information.", "label": ["Important", "First Party Collection Information"], "rewrite": "The network information used in the system to save the device used in the system, including IP, port and other information."}
{"task": "rw_56.jsonl", "id": 56917, "text": "(10) Storage permissions are used to implement the cache and read and use of pictures or files, reducing traffic consumption.", "label": ["Permission Acquisition", "Important"], "rewrite": "Apply to obtain storage permissions."}
{"task": "rw_56.jsonl", "id": 56918, "text": "After rejecting authorization, the storage pictures of the CCB Life Platform will be unavailable.", "label": ["Permission Acquisition", "Important"], "rewrite": "After rejecting authorization, the storage pictures of the CCB Life Platform will be unavailable."}
{"task": "rw_56.jsonl", "id": 56919, "text": "(11) Mobile phone/phone permissions, used to obtain mobile phone equipment information, operator networks, and mobile phone numbers to ensure your security when logging in, and perform functions such as mobile authentication, push, one -click dial -up.", "label": ["Permission Acquisition", "Important"], "rewrite": "Apply for mobile phone/phone permissions."}
{"task": "rw_56.jsonl", "id": 56920, "text": "After rejecting authorization, the functions of one -click dial, mobile authentication, and push information of CCB's life will be unavailable.", "label": ["Permission Acquisition", "Important"], "rewrite": "After rejecting authorization, the functions of one -click dial, mobile authentication, and push information of CCB's life will be unavailable."}
{"task": "rw_56.jsonl", "id": 56921, "text": "(10) Authentication account to obtain account verification information for starting a third -party software package (SDK).", "label": ["Permission Acquisition", "Important"], "rewrite": "Apply for obtaining certification account permissions."}
{"task": "rw_56.jsonl", "id": 56922, "text": "After rejecting authorization, the SDK related functions of CCB Life Platform will be unavailable.", "label": ["Permission Acquisition", "Important"], "rewrite": "After rejecting authorization, the SDK related functions of CCB Life Platform will be unavailable."}
{"task": "rw_56.jsonl", "id": 56923, "text": "(11) Manage accounts, allow a program to access account management through account verification to start the third -party software package (SDK).", "label": ["Permission Acquisition", "Important"], "rewrite": "Apply for obtaining management account permissions."}
{"task": "rw_56.jsonl", "id": 56924, "text": "After rejecting authorization, the SDK related functions of CCB Life Platform will be unavailable.", "label": ["Permission Acquisition", "Important"], "rewrite": "After rejecting authorization, the SDK related functions of CCB Life Platform will be unavailable."}
{"task": "rw_56.jsonl", "id": 56925, "text": "(12) Read the log and allow a program to read the underlying system log file for the abnormal performance and cause of the positioning of the program.", "label": ["Permission Acquisition", "Important"], "rewrite": "Apply to obtain a log reading permissions."}
{"task": "rw_56.jsonl", "id": 56926, "text": "After rejecting authorization, the CCB Life Plata will not be repaired in a timely manner for the abnormal situation of the program.", "label": ["Permission Acquisition", "Important"], "rewrite": "After rejecting authorization, the CCB Life Plata will not be repaired in a timely manner for the abnormal situation of the program."}
{"task": "rw_56.jsonl", "id": 56927, "text": "(13) DEBUG settings, allowing a program settings whether it can be debugged by itself for mobile application security settings.", "label": ["Permission Acquisition", "Important"], "rewrite": "Apply to obtain Debug settings permissions."}
{"task": "rw_56.jsonl", "id": 56928, "text": "After rejecting authorization, the SDK related functions of CCB Life Platform will be unavailable.", "label": ["Permission Acquisition", "Important"], "rewrite": "After rejecting authorization, the SDK related functions of CCB Life Platform will be unavailable."}
{"task": "rw_56.jsonl", "id": 56929, "text": "(14) Settings are written to allow a program to read or write to the system settings for writing system settings.", "label": ["Permission Acquisition", "Important"], "rewrite": "Apply to obtain setting authority."}
{"task": "rw_56.jsonl", "id": 56930, "text": "After rejecting authorization, the CCB Life Plata will not be able to modify the system settings.", "label": ["Permission Acquisition", "Important"], "rewrite": "After rejecting authorization, the CCB Life Plata will not be able to modify the system settings."}
{"task": "rw_56.jsonl", "id": 56931, "text": "The above features may require you to turn on your camera (camera), album, microphone, text message, address book, geographical location (location information), read the installation application list, Bluetooth, and network communication access to your device in your devicePermanent to achieve the collection and use of information involved in these functions.", "label": ["Permission Acquisition", "Important"], "rewrite": "You need to open your camera (camera), album, microphone, microphone, text messages, address book, geographical location information) to our device in your device."}
{"task": "rw_56.jsonl", "id": 56932, "text": "Please note that when you turn on these permissions, it means that you can authorize our bank to collect and use this information to implement the above functions. If you cancel these authorization, our bank will no longer continue to collect and use your information, and you cannot do it for you for youProvide the above functions corresponding to these authorization.", "label": ["Permission Acquisition", "Important"], "rewrite": "Your opening authority means that you authorize our bank to collect and use this information. If you cancel the authorization, our bank will no longer continue to collect and use information, nor can it provide you with corresponding functions."}
{"task": "rw_56.jsonl", "id": 56933, "text": "If you collect or use your information beyond the above situation, we will ask your consent in advance and fully inform you the purpose, method, scope, and preservation period of information collection and use, and the way you exercise your rights and procedures.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting or using your information beyond the above situations will solicit consent in advance, and fully notify the purpose, method, scope, and preservation period of information collection and use, and the way you exercise your rights and procedures."}
{"task": "rw_56.jsonl", "id": 56934, "text": "6. In order to bring you better products and services, we are continuously working hard to improve our products, services and technologies. As we may launch new or optimized functions from time to time, we may need to collect and use new individualsInformation or change of personal information usage purpose or method.", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56935, "text": "If the above situation occurs, we will explain to you in detail by updating this policy, pop -up window, page prompts, etc., and provide you with the way of self -selection consent, and start and use after obtaining your consent in accordance with the law.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you collect your personal information, we will explain in detail to you, and provide you with the way you choose independently, and then start and use after obtaining your consent in accordance with the law."}
{"task": "rw_56.jsonl", "id": 56936, "text": "(2) How to use information", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56937, "text": "1. The products and/or services of the CCB living platform with your authorization consent will be provided with you, and our bank will also use this information to maintain and improve the aforementioned business functions.", "label": ["First Party Collection Information", "Permission Acquisition"], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56938, "text": "2. During our trip to you, you authorize our bank to continue to collect and use your information.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "During our trip to you, you authorize our bank to continue to collect and use your information."}
{"task": "rw_56.jsonl", "id": 56939, "text": "When you cancel the service, we will stop collecting your relevant personal information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you cancel the service, we will stop collecting your relevant personal information."}
{"task": "rw_56.jsonl", "id": 56940, "text": "Please understand that in order to cooperate with the statistics and archives management activities organized by the ownership department, carry out various audit activities in accordance with the law and perform the obligations of supervision and investigation.Strict protection measures will be taken.", "label": ["Important", "Data Security", "Usage"], "rewrite": "Our bank only continues to use the previous personal information collected in related fields, but our bank will take strict protection measures."}
{"task": "rw_56.jsonl", "id": 56941, "text": "3. In order to make you know the use of the product and/or service of the construction platform of CCB, or let you learn more about the service of CCB Living Platform, our bank will send you a service status notice and the commercial information of related products or services.", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56942, "text": "4. In order to improve your product or service experience and recommend you better or suitable products or services, our bank will adopt desensitization, de -identification and other methods to summarize, analyze, and process the service usage.It will not include any identification information of your identity.", "label": ["Important", "Usage"], "rewrite": "Our bank will adopt desensitization, de -identification and other methods to summarize, analyze, and process the service usage. This information will not include any identity information information."}
{"task": "rw_56.jsonl", "id": 56943, "text": "Our travel may form a group feature label based on your information to provide you with information such as marketing activities that may be interested in, commercial electronic information or advertising.Choose a copy.", "label": ["Important", "Usage"], "rewrite": "Our travel may form a group characteristics tag based on your information for personalized content push."}
{"task": "rw_56.jsonl", "id": 56944, "text": "If you refuse such information notifications, you can close the message notification or withdraw the SMS notification in the APP settings, or call the 95533 customer service phone call to the withdrawal method.", "label": ["Important", "Edit/Control"], "rewrite": "If you refuse to notify personalized information, you can close the message notification or unsubs a SMS notification in the APP settings, or call the 95533 customer service telephone consultation method."}
{"task": "rw_56.jsonl", "id": 56945, "text": "5. We may use the personal information collected in the business to statistical analysis and improvement operations, and use information that has been identified and cannot recognize your identity and cannot be restored to establish a database and commercialize.", "label": ["Important", "Usage"], "rewrite": "We may use the personal information collected in the business to statistical analysis and improvement of operations, and use information that has been removed to identify the identity and cannot be restored to establish a database and commercialize it."}
{"task": "rw_56.jsonl", "id": 56946, "text": "For example, statistical analysis is performed through your location, preferences, etc., so as to improve our product, service or marketing plan;", "label": ["Important", "Usage"], "rewrite": "We analyze statistical analysis through your location, preferences, etc., so as to improve our products, services or marketing plans."}
{"task": "rw_56.jsonl", "id": 56947, "text": "Or to improve the technical transformation, network maintenance, failure elimination, internal policy and process formulation, and generating internal reports to improve our system.", "label": ["Usage"], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56948, "text": "6. Our bank may report to relevant departments in accordance with laws and regulations or regulatory requirements.", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56949, "text": "7. Our bank may invite you to participate in our service -related customers for investigation.", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56950, "text": "8. When our bank wants to use your information for other purposes that the policy is not stated, you will use the following methods to obtain your consent, including: in accordance with the requirements of laws and regulations and national standardsConfirmation action and other forms.", "label": ["Important", "First Party Collection Information"], "rewrite": "When our bank wants to use your information for other uses that unloaded, you will get your consent again."}
{"task": "rw_56.jsonl", "id": 56951, "text": "9. What you authorize to agree and other purposes allowed by laws, regulations, and regulatory regulations.", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56952, "text": "(3) Exceptions of obtaining authorization consent", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56953, "text": "According to relevant laws and regulations, regulatory requirements, and national standards, in the following circumstances, our bank may collect and use your relevant personal information without asking for your authorization consent:", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "In the following situations, our bank may collect and use your relevant personal information without asking for your authorization consent:"}
{"task": "rw_56.jsonl", "id": 56954, "text": "1. Directly related to national security and national defense security;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting personal information directly related to national security and national defense security does not need to solicit consent."}
{"task": "rw_56.jsonl", "id": 56955, "text": "2. Directly related to public safety, public health, and major public interests;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect personal information directly related to public safety, public health, and major public interests without soliciting consent."}
{"task": "rw_56.jsonl", "id": 56956, "text": "3. Directly related to criminal investigation, prosecution, trial and judgment execution;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect direct personal information related to criminal investigation, prosecution, trial, and execution of judgments without asking for consent."}
{"task": "rw_56.jsonl", "id": 56957, "text": "4. Out of maintaining major legitimate rights and interests such as life, property such as you or other individuals, but it is difficult to get your consent;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting and maintaining major legitimate rights and interests but difficult to get personal information that I agree, without asking for consent."}
{"task": "rw_56.jsonl", "id": 56958, "text": "5. The collected personal information is publicly disclosed to the public by itself, but you clearly refuse or collect or use this information to infringe your major interests;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "The collected personal information is made to the public by itself without asking for consent."}
{"task": "rw_56.jsonl", "id": 56959, "text": "6. Collect personal information from the information disclosed by legal publicly, such as legal news reports and government information disclosure, but you clearly refuse or collect or use this information to infringe your major interests;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If you collect personal information from the legal disclosure information, you do not need to ask for consent."}
{"task": "rw_56.jsonl", "id": 56960, "text": "7. Signing and fulfilling the contract according to your requirements;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting the personal information necessary for the signing and performing the contract without soliciting consent."}
{"task": "rw_56.jsonl", "id": 56961, "text": "8. It is necessary to maintain the safe and stable operation of the products or services provided by maintenance, such as the failure of discovering and disposing of products or services;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting personal information necessary for the safe and stable operation of products or services, there is no need to solicit consent."}
{"task": "rw_56.jsonl", "id": 56962, "text": "9. Other circumstances stipulated in laws and regulations and regulatory requirements.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect personal information under other circumstances stipulated in laws and regulations and regulatory requirements, without asking for consent."}
{"task": "rw_56.jsonl", "id": 56963, "text": "2. How can our trip use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56964, "text": "(1) Cookie", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56965, "text": "To ensure the normal operation of the website, our guillers store small data files named Cookie on your computer or mobile device.", "label": ["Important", "First Party Collection Information"], "rewrite": "Our will store small data files named Cookie on your computer or mobile device."}
{"task": "rw_56.jsonl", "id": 56966, "text": "Cookie usually contains identifiers, site names, and some numbers and characters.", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56967, "text": "With Cookie, websites can store data such as your preferences.", "label": ["Data Retention", "Important"], "rewrite": "With Cookie, websites can store data such as your preferences."}
{"task": "rw_56.jsonl", "id": 56968, "text": "Our bank will not use Cookie for any purpose outside of the purpose of this policy.", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56969, "text": "You can manage or delete Cookie according to your preferences.", "label": ["Important", "Edit/Control"], "rewrite": "You can manage or delete Cookie according to your preferences."}
{"task": "rw_56.jsonl", "id": 56970, "text": "You can clear all the cookies saved on the computer, and most of the network browsers have the function of preventing cookies.", "label": ["Important", "Edit/Control"], "rewrite": "You can clear all the cookies saved on the computer."}
{"task": "rw_56.jsonl", "id": 56971, "text": "But if you do this, you need to change the user settings when you visit our website.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56972, "text": "(2) Do Not Track (Do not track)", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56973, "text": "Many network browsers have the Do not track function, which can release the DO Not Track request to the website.", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56974, "text": "At present, the major Internet standard organization has not yet established relevant policies to stipulate how websites should respond to such requests.", "label": ["Important", "Risk"], "rewrite": "The main Internet standard organization has not yet established relevant policies to stipulate how the website should respond to the DO Not Track request."}
{"task": "rw_56.jsonl", "id": 56975, "text": "But if your browser enables Do, Not, Track, then all our websites will respect your choice.", "label": ["Important", "Edit/Control"], "rewrite": "If your browser enables Do Not Track, then all our websites will respect your choices."}
{"task": "rw_56.jsonl", "id": 56976, "text": "3. How can our bank share, transfer and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56977, "text": "(1) Sharing", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56978, "text": "1. Unless you get your separate consent or authorization, our bank will not share or transfer your personal information from any other companies, organizations and individuals.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Unless you get your separate consent or authorization, our bank will not share or transfer your personal information."}
{"task": "rw_56.jsonl", "id": 56979, "text": "2. If the business needs to share or transfer your personal information to the outside world, we will inform you that the purpose, processing method, personal information types, names or names of data receiving parties, and contact information of sharing or transfer of personal information will be informed.Solid consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will inform you that the purpose, processing method, the type of personal information, the name or name of the data receiver, and the name of the data receiver will be obtained."}
{"task": "rw_56.jsonl", "id": 56980, "text": "3. Please understand that our bank may share your personal information to the outside world in accordance with the provisions of laws and regulations, or in accordance with the mandatory requirements of the government authority.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Our bank may share your personal information to the outside world in accordance with the provisions of laws and regulations, or in accordance with the mandatory requirements of the government authority."}
{"task": "rw_56.jsonl", "id": 56981, "text": "4. When you complain about others or are complained by others, in order to protect the legitimate rights and interests of you and others, we may provide your name and valid certificate number, contact information, and complaints to the consumer rights protection department and regulatory authority.In order to resolve complaint disputes in a timely manner, the laws and regulations are clearly prohibited.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may provide your name and valid certificate number, contact information, and complaints to the consumer rights protection department and regulatory authorities to resolve complaint disputes in a timely manner, except for laws and regulations clearly prohibited."}
{"task": "rw_56.jsonl", "id": 56982, "text": "5. Please understand that most of the products or services we provide cannot be completed separately. Under the premise of obtaining your consent in accordance with the law, and based on the agreement: According to the relevant agreements you signed with us (including the electronic agreement and platform signed online and the platform you signed, youRules) or legal documents, we may share with business partners to provide you with the necessary order information, account information, payment information, etc. of the necessary services.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Based on the relevant agreements or legal documents you signed with us, we may share with business partners with order information, account information, payment information, etc. to provide you with services."}
{"task": "rw_56.jsonl", "id": 56983, "text": "Our business partners include the following types:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Our business partners include the following types:"}
{"task": "rw_56.jsonl", "id": 56984, "text": "(1) Platform service provider.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Business partners include platform service providers."}
{"task": "rw_56.jsonl", "id": 56985, "text": "In order to achieve the purpose of this policy, some of our services will be provided by business partners.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56986, "text": "To ensure the successful completion of the services provided by you, we may share your personal information with the above partners, including takeaway business, taxi business, distribution business, technical services, payment services, financial services, and recharge services.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share your personal information with the above partners, including takeaway business, taxi business, distribution business, technical services, payment services, financial services, and recharge services."}
{"task": "rw_56.jsonl", "id": 56987, "text": "It may include your contact information, order information, payment information, and address information to ensure the smooth completion of the services provided by you.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Will share your contact information, order information, payment information, address information."}
{"task": "rw_56.jsonl", "id": 56988, "text": "For example, when you use our takeaway service, we must share your orders and distribution information with the delivery service provider to ensure the safe and accurate delivery of the order;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We must share your order and distribution information with the distribution service provider to ensure the safe and accurate delivery of the order."}
{"task": "rw_56.jsonl", "id": 56989, "text": "For another example, we need to share your order number and order amount with third -party payment institutions to achieve your confirmation of your payment instructions and complete payment.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We need to share your order number and order amount with third -party payment institutions to confirm your payment instructions and complete payment."}
{"task": "rw_56.jsonl", "id": 56990, "text": "(2) Platform businessmen.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share with platform merchants."}
{"task": "rw_56.jsonl", "id": 56991, "text": "We must share your order information and necessary transaction information with platform merchants so that they can provide you with goods, services and after -sales.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We must share your order information and necessary transaction information with platform merchants so that they can provide you with goods, services and after -sales."}
{"task": "rw_56.jsonl", "id": 56992, "text": "(3) Business partners such as advertising, analysis of service.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share it with business partners such as advertising, analysis service."}
{"task": "rw_56.jsonl", "id": 56993, "text": "After authorization, we may share information with partners who provide advertising promotion and statistical analysis, but we will only provide these partners with information such as advertising promotion, effectiveness, and statistics.If we need to identify this information for personal information, it is necessary to avoid identification of your identity.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share information with partners, but we will only provide these partners with information such as advertising promotion, effectiveness, and statistical categories, and will not share personal information that can recognize your identity."}
{"task": "rw_56.jsonl", "id": 56994, "text": "Relevant partners may gather analysis of the above information to provide advertising exposure monitoring or service decisions.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Relevant partners may gather analysis of the above information to provide advertising exposure monitoring or service decisions."}
{"task": "rw_56.jsonl", "id": 56995, "text": "Please know that our bank will only share your personal information for the purpose of legal, correct, necessary, specific, and clear purposes., Our guild signed strict information protection and confidentiality agreements, requiring them to abide by the agreement and take relevant security measures to protect your personal information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Our bank will only share your personal information for legal, correct, necessary, specific, and clear purposes. Our guilities signed strict information protection and confidentiality agreements with the shared objects."}
{"task": "rw_56.jsonl", "id": 56996, "text": "(2) Transfer", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56997, "text": "According to laws and regulations and business practices, in similar transactions such as mergers, acquisitions, asset transfer, etc., if involving personal information transfer, our bank will inform you that the name or name and contact information of the receiver will be requiredInformation companies and organizations continue to be subject to this personal information protection policy, otherwise our bank will ask the company and the organization to reconcile your authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When it comes to the transfer of personal information, our bank will inform you that the name or name and contact information of the receiver will be asked to be constrained by the personal information protection policy, otherwise it will request that it will ask for authorization consent."}
{"task": "rw_56.jsonl", "id": 56998, "text": "(3) Public disclosure", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 56999, "text": "1. I will not disclose your personal information publicly. If you really need to disclose, we will tell you the purpose and type of personal information;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Our bank will not disclose your personal information publicly. If you really need to disclose, we will tell you the purpose and type of personal information."}
{"task": "rw_56.jsonl", "id": 57000, "text": "Those involved in sensitive information will also inform the content of sensitive information and obtain your separate consent in advance.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Those involved in sensitive information will also inform the content of sensitive information and obtain your separate consent in advance."}
{"task": "rw_56.jsonl", "id": 57001, "text": "2. Please understand that under the circumstances of legal, legal procedures, litigation or government authorities, our bank may disclose your personal information publicly.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "With the compulsory requirements of legal, legal procedures, litigation, or government authorities, our bank may disclose your personal information publicly."}
{"task": "rw_56.jsonl", "id": 57002, "text": "3. When our travel is required to announce the list of winning activities, it will desensitize the information of the winner's information to ensure the fairness and transparency of the results.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "When the list of winning events is required, it will be desertensive to ensure the fairness and transparency of the results."}
{"task": "rw_56.jsonl", "id": 57003, "text": "Please note that when you use our service, you voluntarily publish or even publicly shared information may involve your personal information and even personal sensitive information, such as your transaction information, and you choose to upload texts containing personal information when evaluatingVarious forms of information such as pictures or videos.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_56.jsonl", "id": 57004, "text": "When using our services, please consider whether to publish or even share relevant information.", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 57005, "text": "(4) Exception of obtaining authorization consent", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 57006, "text": "According to relevant laws and regulations, regulatory requirements, and national standards, in the following circumstances, we may share, transfer, and openly disclose user information without requiring your authorization consent in advance:", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "In the following circumstances, we may share, transfer, and publicly disclose user information without obtaining your authorization consent in advance:"}
{"task": "rw_56.jsonl", "id": 57007, "text": "1. Directly related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Personal information directly related to national security and national defense security does not need to solicit consent."}
{"task": "rw_56.jsonl", "id": 57008, "text": "2. Directly related to public safety, public health, and major public interests;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Personal information directly related to public safety, public health, and direct public interests does not need to solicit consent."}
{"task": "rw_56.jsonl", "id": 57009, "text": "3. Directly related to criminal investigation, prosecution, trial and judgment execution;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Direct related personal information such as sharing with criminal investigation, prosecution, trial and judgment execution does not need to solicit consent."}
{"task": "rw_56.jsonl", "id": 57010, "text": "4. For major legitimate rights and interests such as maintaining your life, property, and reputation of your or other individuals, it is difficult to get my consent;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Sharing and maintaining major legitimate rights and interests but difficult to get personal information that I agree, without asking for consent."}
{"task": "rw_56.jsonl", "id": 57011, "text": "5. Personal information that you disclose to the public yourself, but you clearly refuse or collect or use this information to infringe your major interests;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "You do not need to solicit with your own personal information to the public, except for your clear rejection or infringement of major interests."}
{"task": "rw_56.jsonl", "id": 57012, "text": "6. User information collected from legal publicly disclosed information, such as legal news reports, government information disclosure, etc., but you clearly refuse or collect or use this information to infringe your major interests.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "The user information collected from the legal disclosure information does not need to ask for consent, but you clearly reject or infringe on your major interests."}
{"task": "rw_56.jsonl", "id": 57013, "text": "According to the law, sharing, transfer, and publicly disclose personal information that is identified by de -identification processing, and ensure that the data receiver cannot restore and re -identify the subject of personal information. We will not notify you separately and obtain it to youYour consent.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Share, transfer, and publicly disclose personal information that has been identified by de -identification processing, and ensure that the data receiver cannot restore and re -identify the subject of personal information. The processing of such data will not be notified separately and obtained consent."}
{"task": "rw_56.jsonl", "id": 57014, "text": "Fourth, how can our trip store and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 57015, "text": "(1) Storage", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 57016, "text": "1. The personal information collected and generated in the territory of the People's Republic of China will be stored in the People's Republic of China.", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in the territory of the People's Republic of China will be stored in the People's Republic of China."}
{"task": "rw_56.jsonl", "id": 57017, "text": "2. In addition to other provisions of laws and regulations, our bank only retains your personal information within the time limit required by laws and regulations and to achieve the time limit for the purpose of realizing the purpose of this policy.", "label": ["Data Retention", "Important"], "rewrite": "Our bank only retains your personal information within the time limit of laws and regulations, as well as the time limit for the purpose of realizing the purpose of this policy."}
{"task": "rw_56.jsonl", "id": 57018, "text": "For example:", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 57019, "text": "Mobile phone number: When you need to use the CCB Life Platform service, our bank needs to keep your mobile phone number to ensure that you use the service normally. When you cancel the CCB Life Platform account, our bank will delete the corresponding information;", "label": ["Data Retention", "Important"], "rewrite": "When you need to use the CCB Life Platform, our bank needs to keep your mobile phone number. When you cancel your account, our bank will delete the corresponding information."}
{"task": "rw_56.jsonl", "id": 57020, "text": "User avatar: When you set up your avatar, our guild has always saved your avatar for login page display.", "label": ["Data Retention", "Important"], "rewrite": "When you set the avatar, our guild has always saved your avatar for login page display."}
{"task": "rw_56.jsonl", "id": 57021, "text": "When you choose to restore the default avatar, our bank will delete the avatar information you set.", "label": ["Data Retention", "Important"], "rewrite": "When you choose to restore the default avatar, our bank will delete the avatar information you set."}
{"task": "rw_56.jsonl", "id": 57022, "text": "(2) Protection", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 57023, "text": "1. Our bank has used security protection measures that meet the industry standards to protect your personal information, prevent data from being interviewed, publicly disclosed, used, modified, damaged or lost.", "label": ["Important", "Data Security"], "rewrite": "Our bank has used security measures that meet industry standards to protect your personal information."}
{"task": "rw_56.jsonl", "id": 57024, "text": "Our trip will take all reasonable and feasible measures to protect your personal information.", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 57025, "text": "For example: we will use encryption technology to ensure the confidentiality of the data;", "label": ["Important", "Data Security"], "rewrite": "We will use encryption technology to ensure the confidentiality of the data."}
{"task": "rw_56.jsonl", "id": 57026, "text": "Our guilty uses a trusted protection mechanism to prevent data from being maliciously attacked;", "label": ["Important", "Data Security"], "rewrite": "Our guided use of trusted protection mechanisms to prevent data from being maliciously attacked."}
{"task": "rw_56.jsonl", "id": 57027, "text": "Our conference deploys the access control mechanism to ensure that only authorized personnel can access personal information;", "label": ["Important", "Data Security"], "rewrite": "Our conference deploys the access control mechanism to ensure that only authorized personnel can access personal information."}
{"task": "rw_56.jsonl", "id": 57028, "text": "And our guild holds safety and hidden.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_56.jsonl", "id": 57029, "text": "Private protection training courses to strengthen employees' awareness of protecting the importance of personal information.", "label": ["Important", "Data Security"], "rewrite": "Our guild organizes safety and privacy protection training courses to strengthen employees' awareness of protecting the importance of personal information."}
{"task": "rw_56.jsonl", "id": 57030, "text": "2. If all or part of the business provided by our bank will stop operation, the related products of the CCB Life Platform will be informed by you through the announcement. At the same timeWait for operation to protect your personal information security.", "label": ["Important", "Data Security"], "rewrite": "If the operation is stopped, it will be informed by you, and the collection of your personal information will be stopped to protect your personal information security."}
{"task": "rw_56.jsonl", "id": 57031, "text": "If all or some of the business interruption of CCB living platforms is caused due to various or some reasons such as technical failure, network attacks, natural disasters and accidents, and human factors, our bank will take emergency treatment and restoration measures to respond to restore services as soon as possible.", "label": ["Important", "Data Security"], "rewrite": "For example, the business interruption of CCB Life Platform, our bank will take emergency treatment and restoration measures to respond to restore services as soon as possible."}
{"task": "rw_56.jsonl", "id": 57032, "text": "3. We have obtained the following certification: At present, we have passed the evaluation and filing of national network security level protection. The data center of information security has met the requirements of ISO27001 certification standards and obtained corresponding certification.", "label": ["Important", "Data Security"], "rewrite": "At present, we have passed the evaluation and filing of national network security level protection. In terms of information security, the data center has reached the requirements of ISO27001 certification standards and obtained corresponding certification."}
{"task": "rw_56.jsonl", "id": 57033, "text": "4. We will take all reasonable and feasible measures to ensure unrelated personal information.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "We will take all reasonable and feasible measures to ensure unrelated personal information."}
{"task": "rw_56.jsonl", "id": 57034, "text": "5. Please understand that due to the limitation of technical level and possible malicious attacks, there may be unexpected situations that cannot be reasonably foresee, prevent, avoid, and control.", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 57035, "text": "The Internet is not an absolutely secure environment. Please use the verification code to assist our travel to ensure your account security.", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 57036, "text": "6. If a personal information security incident occurs, our bank will inform you in accordance with the requirements of the laws and regulations in the form of email, letter, telephone, push notification, etc., or in a reasonable and effective manner.", "label": ["Important", "Data Security"], "rewrite": "Our trip will inform you of the relevant information of personal information security incidents in a timely manner, or publish an announcement in a reasonable and effective way."}
{"task": "rw_56.jsonl", "id": 57037, "text": "At the same time, our bank will also report to the disposal of personal information security incidents in accordance with regulatory regulations.", "label": ["Important", "Data Security"], "rewrite": "Our bank will also report to the disposal of personal information security incidents in accordance with regulatory regulations."}
{"task": "rw_56.jsonl", "id": 57038, "text": "5. The right to control personal information", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 57039, "text": "In accordance with China's relevant laws and regulations and regulatory regulations, our bank guarantees the following rights to exercise your personal information. You have the right to control personal information through our 95533 customer service phone.", "label": ["Important", "Contact Information"], "rewrite": "Our bank guarantees your right to exercise your personal information. You have the right to control your personal information through our 95533 customer service phone."}
{"task": "rw_56.jsonl", "id": 57040, "text": "(1) Visit, correct and update your personal information", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 57041, "text": "You have the right to access, correct, and supplement your personal information through our 95533 customer service phone or go to the offline outlets of Construction Bank.", "label": ["Important", "Contact Information"], "rewrite": "You have the right to access, correct, and supplement your personal information through our 95533 customer service phone or go to the offline outlets of Construction Bank."}
{"task": "rw_56.jsonl", "id": 57042, "text": "You have a responsibility to correct your personal information in time.", "label": ["Important", "Edit/Control"], "rewrite": "You have a responsibility to correct your personal information in time."}
{"task": "rw_56.jsonl", "id": 57043, "text": "Before you modify your personal information, we will verify your identity.", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 57044, "text": "When you propose corrections and supplement your personal information through our bank 95533 customer service phone, our bank will complete the verification and processing within 15 working days.", "label": ["Important", "Contact Information"], "rewrite": "When you make a correction and supplement your personal information through the 95533 customer service phone, our bank will complete the verification and processing within 15 working days."}
{"task": "rw_56.jsonl", "id": 57045, "text": "(2) Delete your personal information", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 57046, "text": "In the following circumstances, you can make a request to delete personal information from our bank:", "label": ["Important", "Edit/Control"], "rewrite": "In the following circumstances, you can make a request to delete personal information from our bank:"}
{"task": "rw_56.jsonl", "id": 57047, "text": "1. If our behavior of handling personal information violates laws and regulations;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_56.jsonl", "id": 57048, "text": "2. If we collect and use your personal information, you have not obtained your consent;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_56.jsonl", "id": 57049, "text": "3. If our behavior of handling personal information violates your agreement;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_56.jsonl", "id": 57050, "text": "4. If you no longer use our products or services, or you cancel your account;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_56.jsonl", "id": 57051, "text": "5. If our bank will no longer provide you with products or services or your information storage period, it has expired.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_56.jsonl", "id": 57052, "text": "6. If the purpose of dealing with personal information has been achieved, unable to achieve, or for the purpose of processing the purpose, your personal information is no longer necessary.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_56.jsonl", "id": 57053, "text": "7. Other circumstances stipulated in laws and administrative regulations.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_56.jsonl", "id": 57054, "text": "You can use our bank 95533 customer service phone call or go to the offline outlets of Construction Bank to ask our bank to delete personal information, and our bank will complete the verification and processing within 15 working days.", "label": ["Important", "Contact Information"], "rewrite": "You can ask our bank to delete personal information to our bank through our 95533 customer service phone or offline outlets. Our bank will complete the verification and processing within 15 working days."}
{"task": "rw_56.jsonl", "id": 57055, "text": "If we decide to respond to your deletion request, we will also notify the entities that obtain your personal information from our bank, asking them to delete them in time, unless.", "label": ["Important", "Edit/Control"], "rewrite": "If we decide to respond to your deletion request, we will also notify the entities that obtain your personal information from our bank at the same time, asking them to delete them in time."}
{"task": "rw_56.jsonl", "id": 57056, "text": "Laws and regulations have other regulations, or these entities have obtained your independent authorization.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_56.jsonl", "id": 57057, "text": "When you delete the information from our services, we may not immediately delete the corresponding information in the backup system, but will delete these information when the backup is updated.", "label": ["Important", "Edit/Control"], "rewrite": "When you delete the information, we may not immediately delete the corresponding information in the backup system, but this information will be deleted when the backup is updated."}
{"task": "rw_56.jsonl", "id": 57058, "text": "If the preservation period stipulated in laws and administrative regulations has not expired, or delete your information is difficult to achieve technically, our bank will stop processing except for storage and necessary security measures.", "label": ["Edit/Control", "Important"], "rewrite": "If the preservation period is not expired or it is difficult to achieve technology, our bank will stop handling except for storage and adopting necessary safety protection measures."}
{"task": "rw_56.jsonl", "id": 57059, "text": "(3) Change the scope of your authorization consent", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 57060, "text": "Each business function requires some basic personal information to complete.", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 57061, "text": "For the collection and use of personal information that are collected and used for the product or service experience (such as location, mobile phone address book, etc.), you can follow the different brands and models of the mobile phone.Permanent, read -contact human rights, call permissions, etc., give or withdraw your authorization consent at any time.", "label": ["Permission Acquisition", "Important", "Edit/Control"], "rewrite": "You can give or withdraw your authorization consent at any time by opening or closing the location service authority, reading contact human rights, dial -call permissions, etc. at any time."}
{"task": "rw_56.jsonl", "id": 57062, "text": "Please note that when you cancel our service -based life platform service independently, you will depend on your consent of the \"Personal Information Protection Policy of the CCB Life Platform\". When you withdraw the consentpersonal information.", "label": ["Important", "Edit/Control"], "rewrite": "Your independent cancellation will be deemed that you have withdrawn the consent of our privacy policy. When you withdraw your consent, we will no longer process the corresponding personal information."}
{"task": "rw_56.jsonl", "id": 57063, "text": "But your decision to withdraw consent will not affect personal information processing based on your authorization.", "label": ["Permission Acquisition", "Important", "Edit/Control"], "rewrite": "But your decision to withdraw consent will not affect personal information processing that was previously authorized."}
{"task": "rw_56.jsonl", "id": 57064, "text": "(4) Profile accounts for personal information main body", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 57065, "text": "If you want to cancel your personal account, you can log in to the CCB Life APP. Through \"my-settings-cancellation\" submitting an account cancellation application, our bank will complete the verification and processing within 15 working days.", "label": ["Important", "Edit/Control"], "rewrite": "You can log in to the CCB Life APP and submit an account cancellation application through \"My-Settings-Logging out\". Our bank will complete the verification and processing within 15 working days."}
{"task": "rw_56.jsonl", "id": 57066, "text": "Please note that if you only delete the CCB Life APP in your mobile phone device, our bank will not cancel your CCB life platform, and all information about your CCB living platform will not be deleted.", "label": ["Important", "Edit/Control"], "rewrite": "When you delete the CCB Life APP alone in your mobile phone device, you will not cancel your CCB life platform. All information about your CCB living platform will not be deleted."}
{"task": "rw_56.jsonl", "id": 57067, "text": "You still need to cancel your CCB life platform account to achieve this purpose.", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 57068, "text": "(5) Automatic decision -making of constraint information systems", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 57069, "text": "In certain business functions, we may make decisions only based on the non -artificial automatic decision mechanism, including information systems, algorithms, etc..", "label": ["Important", "Usage"], "rewrite": "We may make decisions based on non -artificial automatic decision -making mechanisms, including information systems, algorithms, etc.."}
{"task": "rw_56.jsonl", "id": 57070, "text": "If these decisions significantly affect your legitimate rights and interests, you have the right to ask us to explain, and we will also provide appropriate treatment methods.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_56.jsonl", "id": 57071, "text": "(6) Check and copy your personal information", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 57072, "text": "If you want to check and copy your personal information, you can pass the 95533 customer service phone or log in to the CCB Life APP, and submit personal information download needs through \"Settings-Download Personal Information\" to realize the viewing and copying personal information.Complete the inspection and processing within 15 working days.", "label": ["Important", "Edit/Control"], "rewrite": "You can submit personal information download needs through \"My-Settings-Download Personal Information\" through \"My Settings-Download Personal Information\" through our bank's 95533 customer service phone."}
{"task": "rw_56.jsonl", "id": 57073, "text": "(7) Responsive your above request", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 57074, "text": "Message push-if you don't want to receive message notifications on the APP page, you can refuse to receive message notification when installing the APP for the first time, or in the mobile operating systemEssence", "label": ["Important", "Edit/Control"], "rewrite": "You can refuse to receive message notifications when installing the APP for the first time, or \"My-Settings-Message Push\" in the mobile operating system to turn off the notification function."}
{"task": "rw_56.jsonl", "id": 57075, "text": "At the same time, you can also select the 95533 customer service phone to select manual services. After passing the authentication, you can explain to the customer service representative to the consent authorization of the collection and use of its personal information. Our bank will no longer handle your personal information;", "label": ["Important", "Contact Information", "Edit/Control"], "rewrite": "You can call the 95533 customer service phone to select artificial services to explain to customer service representatives to withdraw consent authorization, and our bank will no longer process your personal information."}
{"task": "rw_56.jsonl", "id": 57076, "text": "Ask customer service representatives to refuse to receive commercial advertisements based on your personal information, our bank will no longer push you business advertisements based on your personal information;", "label": ["Edit/Control", "Important"], "rewrite": "To ask customer service representatives to refuse to receive commercial advertising, our bank will no longer push you."}
{"task": "rw_56.jsonl", "id": 57077, "text": "For customer service representatives request to refuse to share, transfer, and publicly disclose your personal information from the outside world. Our bank will no longer share, transfer, and publicly disclose your personal information.", "label": ["Important", "Edit/Control"], "rewrite": "Requirement from customer service representatives to refuse to share, transfer, and publicly disclose your personal information. Our bank will no longer share, transfer, and publicly disclose it."}
{"task": "rw_56.jsonl", "id": 57078, "text": "We have a complete user appeal tracking and management mechanism, and we will respond to your appeal within 15 working days.", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 57079, "text": "To ensure safety, you may need to provide a written request or prove your identity in other ways.", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 57080, "text": "Our bank may ask you to verify your identity first, and then process your request.", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 57081, "text": "Please understand that for some unprovoral repetitions, too much technical means, risk or very unrealistic requests to others' legitimate rights and interests, our bank may refuse.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Our bank may refuse to reject some unprovoing, too much technical means, risk or very unrealistic requests to others."}
{"task": "rw_56.jsonl", "id": 57082, "text": "Although there are above, in accordance with the requirements of laws and regulations, if the following circumstances, our bank may not be able to respond to your request:", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "According to the requirements of laws and regulations, if the following circumstances, our bank may not be able to respond to your request:"}
{"task": "rw_56.jsonl", "id": 57083, "text": "1.Related to national security and national defense security;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Those who are related to national security and national defense security cannot respond to requests."}
{"task": "rw_56.jsonl", "id": 57084, "text": "2.It is related to public safety, public health, and major public interests;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Those who are related to public safety, public health, and major public interests cannot respond to requests."}
{"task": "rw_56.jsonl", "id": 57085, "text": "3.Related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Those who are related to criminal investigation, prosecution, trial, and judgment execution cannot respond to the request."}
{"task": "rw_56.jsonl", "id": 57086, "text": "4.There is sufficient evidence that you have subjective malicious or abuse of rights;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "If there is sufficient evidence that you have subjective malicious or abuse of rights, you cannot respond to the request."}
{"task": "rw_56.jsonl", "id": 57087, "text": "5.Responding to your request will cause serious damage to the legitimate rights and interests of you or other individuals and organizations;", "label": ["Important", "Edit/Control"], "rewrite": "The response request will cause serious damage to the legitimate rights and interests and cannot respond to the request."}
{"task": "rw_56.jsonl", "id": 57088, "text": "6.Involved in business secrets.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Those who involve business secrets in our bank cannot respond to requests."}
{"task": "rw_56.jsonl", "id": 57089, "text": "6. How do we handle minor information", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 57090, "text": "Without the consent of the guardian, minors may not create their own user account.", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 57091, "text": "If you are a minor, please read this policy carefully and use our services or provide information to us under the premise of obtaining your guardian's consent.", "label": ["Specific Audiences", "Important"], "rewrite": "Under the premise of obtaining the consent of the guardian, minors use our services or provide information to us."}
{"task": "rw_56.jsonl", "id": 57092, "text": "We will only use this information when the laws and regulations and regulatory requirements are allowed or protect the minors.", "label": ["Specific Audiences", "Important"], "rewrite": "We will only use this information when the laws and regulations and regulatory requirements are allowed or protect the minors."}
{"task": "rw_56.jsonl", "id": 57093, "text": "For more details, please consult the \"Personal Information Protection Rules for Children's Life in CCB\".", "label": ["Specific Audiences", "Important"], "rewrite": "For details, please refer to the \"Personal Information Protection Rules of Children's Life in CCB\"."}
{"task": "rw_56.jsonl", "id": 57094, "text": "7. How to update this policy", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 57095, "text": "According to the changes in national laws and regulations and the needs of service operations, our bank will modify this policy and related rules from time to time.Essence", "label": ["Policy Change", "Important"], "rewrite": "Our bank will modify this policy and related rules from time to time. The modified content will be published in a pop -up window and solicit user authorization consent again."}
{"task": "rw_56.jsonl", "id": 57096, "text": "From time to time, you should pay attention to changes in relevant prompt information, protocols, rules and other related content.", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 57097, "text": "You know and confirm that if you do not agree with the updated content, you should immediately stop using the corresponding service and cancel relevant users. Our bank will stop collecting your personal information;", "label": ["Policy Change", "Important"], "rewrite": "If you do not agree with the updated content, you should immediately stop using the corresponding service and cancel the relevant users. Our bank will stop collecting your relevant personal information."}
{"task": "rw_56.jsonl", "id": 57098, "text": "If you continue to use your service, our bank will execute the update content.", "label": ["Policy Change", "Important"], "rewrite": "If you continue to use your service, our bank will execute the update content."}
{"task": "rw_56.jsonl", "id": 57099, "text": "8. How to contact me", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 57100, "text": "If you have any questions, opinions or suggestions on this personal information protection policy, you can consult or reflect the 95533 customer service hotline.", "label": ["Important", "Contact Information"], "rewrite": "You can consult or reflected by calling our 95533 customer service hotline."}
{"task": "rw_56.jsonl", "id": 57101, "text": "After accepting your problem, we will deal with it in time and properly.", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 57102, "text": "Under normal circumstances, we will give a reply within 15 working days.", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 57103, "text": "When you have any disputes with the implementation of this policy and our trip, you should first be negotiated and friendly;", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 57104, "text": "If you cannot negotiate, you and our bank have the right to submit disputes to courts with jurisdictions in our place of residence.", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 57105, "text": "Office address: China Construction Bank Co., Ltd. Zhejiang Branch, No. 33 Jiefang East Road, Shangcheng District, Hangzhou City, Zhejiang Province;", "label": ["Important", "Contact Information"], "rewrite": "Office address: China Construction Bank Co., Ltd. Zhejiang Branch, No. 33 Jiefang East Road, Shangcheng District, Hangzhou City, Zhejiang Province."}
{"task": "rw_56.jsonl", "id": 57106, "text": "Please read this personal information protection policy carefully before logging in to the CCB Life Plata to ensure that the meaning of its content, especially the font and black content, and the corresponding legal consequences have been well known and fully understood.", "label": [], "rewrite": []}
{"task": "rw_56.jsonl", "id": 57107, "text": "You check the (or other same significance buttons) have agreed to this personal information protection policy and log in to the CCB living platform, which is deemed to be you accepting this personal information protection policy. Our bank will legalize and protect your legally use and protect you in accordance with relevant laws and regulations and this policy.personal information.", "label": ["Policy Change", "Important"], "rewrite": "You check the (or other same significant buttons) have agreed to this personal information protection policy and log in to the CCB life platform, which is deemed to be you accepting this personal information protection policy."}
{"task": "rw_56.jsonl", "id": 57108, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
