{"task": "rw_63.jsonl", "id": 59101, "text": "Legal terms", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59102, "text": "Audemars Piguet welcomes China's privacy policy", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59103, "text": "Last update date: October 31, 2021", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59104, "text": "Effective date: November 30, 2021", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59105, "text": "Audemars Piguet is to help build a connection between people to make the world more open and tolerant.", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59106, "text": "In short, the purpose of Euda Bybon is to build a world of home in the Quartet.", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59107, "text": "We are a community based on trust.", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59108, "text": "In order to win your trust, it is necessary to clearly explain to you how Aibi Ying uses your information and protect your privacy.", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59109, "text": "This privacy policy is applicable to users (\"You\" or \"Members\") in China (\"You\" or \"Members\") in China (not under this policy).Or how to deal with the personal information of your Piguet Piguet's platform.", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59110, "text": "However, if you (i) book the landlord/experience expert service outside China, or (ii) publish the landlord/experience expert service located outside China, even if your place of residence is in China, please go to Audemars Piguet to welcome the privacy policy page,Understand the specific personal information protection rules applicable to you, as well as data controller involved in personal information involved in overseas activities.", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59111, "text": "The unfielded terms in this privacy policy are the same as our definitions in our service terms (\"terms\").", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59112, "text": "Table of contents", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59113, "text": "1. Personal information processing and purpose", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59114, "text": "2. Sharing and disclosure", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59115, "text": "3. Other important information", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59116, "text": "4. How do we store your personal information", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59117, "text": "5. Your rights", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59118, "text": "6. About minor protection", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59119, "text": "7. Security", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59120, "text": "8. Modification of this privacy policy", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59121, "text": "9. Contact us", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59122, "text": "1. Personal information processing and purpose", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59123, "text": "1.1 Use the information required by the Piguet Piguet platform", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59124, "text": "When you use the Audemars Piguet platform, we need to collect and process the following personal information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59125, "text": "If you do not provide this information, we will not be able to provide you with the service agreed in the \"Service Terms\", show the core function of the Audemars Piguet platform and/or to ensure a security transaction and community environment:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59126, "text": "Account registration and management: We need at least your phone number.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your phone number for account registration and management."}
{"task": "rw_63.jsonl", "id": 59127, "text": "Otherwise, you will not be able to create Aigu Ying account, but you can still browse the listing/experience on the Audemars Piguet platform.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59128, "text": "We also need to use your phone number to send messages, update prompts, and security reminders and notifications related to account number.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We also need to use your phone number to send you account -related security reminders and notifications."}
{"task": "rw_63.jsonl", "id": 59129, "text": "Browse and search for listings/experience: We need your log data, device information, and use information, including the details of your use of Audema Piguet (including whether you click on the links of a third -party application), IP, address, access date, and access dateTime, hardware and software information, equipment events information, unique identification symbols, collapse data, cookies, data, and pages you check or operate before or after using Audemars Piguet.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We need your log data, device information, and use information, including the details of your use of Aibigubang (including whether to click on the links of a third -party application), IP address, access date and time, hardware and software information, equipment events, and equipment eventsInformation, unique identification symbols, collapse data, cookies data, and pages you have viewed or operated before or after using Audemars Piguet."}
{"task": "rw_63.jsonl", "id": 59130, "text": "Even if you have not created or logged in to Ai By welcome account, we may collect this information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59131, "text": "Booking service: The required information includes your name, phone number, email address, booking and check -in/check -up information (including cities, date, payment amount, housing address, other public housing information), and all public housing information) and all check -inThe detailed information of the tenant's name, nationality, gender, date of birth, and passport or ID card (including passport/ID number and expiration date) to complete the reservation.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your name, phone number, email address, booking and check -in/check -up information, as well as the detailed information of the names, nationality, gender, birth date, and passport or ID card of all householders, and to complete the booking."}
{"task": "rw_63.jsonl", "id": 59132, "text": "learn more.", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59133, "text": "Landlord and experience expert service: The required information includes your name, mobile phone number, passport/ID details, and the address, photos, profile, booking, and check -in information of the listings you postedDate, time and payment amount).", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your name, mobile phone number, passport/ID details, and the address, photos, profile, booking, and check -in/check -up information of the listings you posted (including tenant information, date, time, and payment amount)."}
{"task": "rw_63.jsonl", "id": 59134, "text": "If you operate through a market entity registered in China, we also need the names of the legal representative and responsible person of the subject, as well as related business licenses and licenses.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you operate through a market entity registered in China, we also need the name of the legal representative and responsible person of the subject, as well as the details of related business licenses and licenses."}
{"task": "rw_63.jsonl", "id": 59135, "text": "learn more.", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59136, "text": "Payment service: The information we need includes your ID number, bank account or payment account information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The information we need includes your ID number, bank account or payment account information."}
{"task": "rw_63.jsonl", "id": 59137, "text": "Depending on the payment method you add, we will further collect your payment information, such as the payment tools you use, the Alipay user ID, date and time, payment amount, payment tool expiration date, and other transaction -related details.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will further collect your payment information, such as the payment tools you use, Alipay user ID, date and time, payment amount, payment tool expiration date, and other detailed information related to transactions."}
{"task": "rw_63.jsonl", "id": 59138, "text": "Send message: You need to provide the content of the message.", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59139, "text": "When you use the message service, we will automatically collect the information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the message service, we will automatically collect the information."}
{"task": "rw_63.jsonl", "id": 59140, "text": "Customer service support: We need your account information (such as name, email address, and phone number) and identity information (such as passport/ID number and other detailed information), your communication or call records, booking and other usage information with usAnd other information provided by your complaints or resolving disputes.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We need your account information and identity information, your communication or call records with us, booking and other information, and other information provided by your complaints or resolving disputes."}
{"task": "rw_63.jsonl", "id": 59141, "text": "Maintenance trust and security: You understand that maintaining community trust and security is our top priority. The information we need includes such as your account information (such as name, e -mail and mobile phone number), the image or the image of the identity document issued by the government or the image or the governmentOther identity information (including passport or ID number and other detailed information), background investigation situation, risk assessment or illegal reporting report provided by related service providers (within the scope allowed by law) and related information described by our cookie policyIn order to use our trust, security and risk assessment.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The information we need includes information such as your account information, the image of the government's ID or other identity information, the background investigation situation, the risk assessment or illegal behavior report provided by the relevant service provider, and the relevant information described by our cookie policy."}
{"task": "rw_63.jsonl", "id": 59142, "text": "We also need this information to analyze and identify potential risks to create and maintain a more secure and reliable environment, including but not limited to testing and preventing fraud, spam, abuse, safety and safety events, other harmful acts, prevent discrimination prevention discrimination, Verify or verify the information you provide to maintain the health of our members and the public, solve disputes between members, protect our rights, and fulfill our terms, policies, and applicable agreements with third -party.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We also need this information to analyze and identify potential risks to create and maintain a more secure and reliable environment."}
{"task": "rw_63.jsonl", "id": 59143, "text": "In a few cases, if the relevant automation process believes that some of your behavior constitutes a security threat or other risks to the Audemars Piguet platform, community or third -party, it may automatically restrict or suspend your visit to Audemars Piguet platform.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If the relevant automation process believes that some of your behavior constitutes a security threat to the Audemars Piguet platform, community or third -party, you may automatically restrict or suspend your access to Audemars Piguet."}
{"task": "rw_63.jsonl", "id": 59144, "text": "Business products invitation and account management: Organizations using our business products may submit and receive personal information to facilitate account management and invitations to use business products.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Organizations using our business products may submit and receive personal information to facilitate account management and invitations to use business products."}
{"task": "rw_63.jsonl", "id": 59145, "text": "1.2 The information you choose", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59146, "text": "We may collect and process the additional personal information you choose to provide us.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may collect and process the additional personal information you choose to provide us."}
{"task": "rw_63.jsonl", "id": 59147, "text": "Without this information, we may not be able to provide you with extension functions in our products and services, enhanced or personalized user experience, send advertisements or marketing information to you, and improve our products and services, but you can still use other unnecessary to use these.Product functions or services of additional personal information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59148, "text": "You can manage this information in the following ways, including updating, deleting the information provided by related product functions, changing privacy settings or closing related equipment permissions;", "label": ["Important", "Edit/Control"], "rewrite": "You can manage this information in the following ways, including updating, deleting the information provided by related product functions, changing privacy settings or closing related equipment permissions."}
{"task": "rw_63.jsonl", "id": 59149, "text": "If necessary, you can seek help through the contact information provided by the \"Contact Us\" chapter below.", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59150, "text": "This information may include:", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59151, "text": "Extra personal information: For example, personal photos, preferred language, city, and personal description.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect additional personal information: For example, personal photos, preferred language, city, and personal description."}
{"task": "rw_63.jsonl", "id": 59152, "text": "Part of the information listed in your account settings constitutes part of your personal homepage and will be visible.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Part of the information listed in your account settings constitutes part of your personal homepage and will be visible."}
{"task": "rw_63.jsonl", "id": 59153, "text": "Evaluation and scoring information of landlords/experience experts and tenants/participants: your evaluation, scoring, and picture information attached.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your evaluation, score, and picture information attached."}
{"task": "rw_63.jsonl", "id": 59154, "text": "Location -based service information: geographical location information, such as accurate or rough location information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect geographical location information, such as accurate or rough location information."}
{"task": "rw_63.jsonl", "id": 59155, "text": "This information is determined by your IP address or GPS data of mobile devices, depending on your device settings.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59156, "text": "If you enable geographical location information by setting or device permissions, even if you do not use the Audemars Piguet application, we may collect this information.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If you enable geographical location information by setting or device permissions, even if you do not use the Audemars Piguet application, we may collect this information."}
{"task": "rw_63.jsonl", "id": 59157, "text": "Information for personalized and customized experience: your interaction with Audemars Piguet, the page and content you browse, your search and booking records, your personal information and preferences, equipment information, other content you submit, and the content you submitOther operations on Audemars Piguet platform.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect information for personalized and customized experiences."}
{"task": "rw_63.jsonl", "id": 59158, "text": "We may use these personal information for the following goals: (i) to provide you with personalized and customized experience based on your preference (learn more about how to generate the search results about housing and how to close the function);", "label": ["Usage"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59159, "text": "(Ii) Personalized customization, evaluation and improvement of our advertisements;", "label": ["Usage"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59160, "text": "(III) Management recommendation plan, reward, investigation, lottery, competition, or other promotion activities or events sponsored or managed by Audemars Piguet to welcome or manage in China or our third -party partners;", "label": ["Usage"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59161, "text": "(IV) Analysis characteristics and preferences;", "label": ["Usage"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59162, "text": "Or (V) invite you to participate in activities and use related opportunities.", "label": ["Usage"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59163, "text": "Information about marketing and advertising: If you choose to subscribe to marketing and promotional information, we will use your mobile phone number, email address and device information to send you preferential promotion messages, marketing information, advertisements, and others that we think you may feel that you may feel that you may feel that you may feel that you may feel that you may feel that you may feel that you may feel that you may feel that you may feel that you may feel that you may feel that you may feel that you may feel that you may feel that you may feel that you may feel that you may feel that you may feel that you may feel that you may feel that you may feel that you may feel that you may feel that you may feel that you may feel that you may feel that you may feel that you may feel you feelInterested information.", "label": ["Important", "Usage"], "rewrite": "If you choose to subscribe to marketing and promotion information, we will use your mobile phone number, email address and device information to push you information to you."}
{"task": "rw_63.jsonl", "id": 59164, "text": "Third -party service: If you use a third -party service platform (for example: WeChat) associated, connected or logged in to Aiwi Ying platform, it means that you directly instructed or authorized the service platform to send us relevant information to us, for example, by it, it is because it is.Control your registration information and personal information.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If you use a third -party service platform to associate, connect, or log in to Aiwi Ying platform, it means that you directly instructed or authorized the service platform to send us relevant information to us through its privacy settings."}
{"task": "rw_63.jsonl", "id": 59165, "text": "Service improvement and platform research and development: your use information (including page browsing details, such as access time, web pages and duration of viewing), application lists on mobile devices, log data and equipment information, and through cookies and cookies policiesInformation obtained by similar technologies described in.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your use information, application lists on mobile devices, log data and equipment information, and information obtained by cookies and similar technologies."}
{"task": "rw_63.jsonl", "id": 59166, "text": "The information collected by the landlord directly: The landlord may collect some of your information through the Audemars Piguet platform, such as your name, contact information, the number or photo of the identity document issued by the government, to help you complete the check -in.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The landlord may collect some of your information directly through the Audemars Piguet platform, such as your name, contact information, the number or photo of the ID card issued by the government to help you complete the check -in."}
{"task": "rw_63.jsonl", "id": 59167, "text": "At this time, the landlord was obliged to comply with the personal information of adapting to laws and our terms (including our landlord/experience expert privacy standards).", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59168, "text": "Other information: For example, when you voluntarily fill in the form, add Audema Piguet account information, answer the investigation, publish content in the community forum, participate in promotion activities, communicate with our customer service team and other members, or share your experience with us,The information you choose to provide us may include the health information you choose or your emergency contact information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The information you choose to provide us may include the health information you choose or your emergency contact information."}
{"task": "rw_63.jsonl", "id": 59169, "text": "1.3 We may collect and process personal information without obtaining your consent", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59170, "text": "When or within the scope of applicable laws or requirements, we may collect and use your personal information in the following situation without requiring your consent:", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may collect and use your personal information as follows without requiring your consent:"}
{"task": "rw_63.jsonl", "id": 59171, "text": "If relevant personal information may be used for: (i) fulfill our legal obligations;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collecting personal information that fulfills the legal obligations does not need to ask for consent."}
{"task": "rw_63.jsonl", "id": 59172, "text": "(Ii) Protect public safety, public health, or major public interests;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collecting personal information that guarantees public safety, public health, or major public interests does not require consent."}
{"task": "rw_63.jsonl", "id": 59173, "text": "(III) Assist in investigation, prosecution, trial, judgment execution, etc.;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collecting personal information to assist criminal investigations, prosecution, trials, and judgments does not need to solicit consent."}
{"task": "rw_63.jsonl", "id": 59174, "text": "(IV) Protect major legitimate rights and interests, such as our members and other individuals' life and property, but it is difficult to get my consent;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collecting personal information that protects major legitimate rights and interests does not need to ask for consent."}
{"task": "rw_63.jsonl", "id": 59175, "text": "or", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59176, "text": "These personal information: (i) You voluntarily disclose to the public;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Personal information that you voluntarily disclose to the public without asking for consent."}
{"task": "rw_63.jsonl", "id": 59177, "text": "(Ii) It has been legal and publicly disclosed, such as legal news reports, government information disclosure;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Personal information that has been legal and publicly disclosed does not need to ask for consent."}
{"task": "rw_63.jsonl", "id": 59178, "text": "And (III) is necessary to maintain the safe and stable operation of our products or services, such as the failure of discovering and disposing of products and services.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The personal information necessary for maintaining the safe and stable operation of products or services does not need to solicit consent."}
{"task": "rw_63.jsonl", "id": 59179, "text": "The specific situation may include:", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59180, "text": "Identity verification: The required information is such as your phone number or the number of identity documents issued by the government (within the scope permitted by the applicable law), or other identity information (in the case of applicable legal requirements).", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect identity verification information."}
{"task": "rw_63.jsonl", "id": 59181, "text": "We need this information to verify your identity to fulfill our platform responsibilities or obligations in applicable laws.", "label": ["Usage"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59182, "text": "Checking registration: The required information such as the name, phone number, passport or ID card details (including passport/ID number and expiration date), booking and check -in/check -up information (including housing address, date, time) andThe above information of the same pedestrian.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect check -in registration information: tenant's name, phone number, passport or ID card details (including passport/ID number and expiration date), booking and check -in/check -out information (including housing address, date, time) and peersThe above information."}
{"task": "rw_63.jsonl", "id": 59183, "text": "According to the legal specifications and regulatory requirements of the hotel accommodation industry, we need this information for check -in registration.", "label": ["Usage"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59184, "text": "learn more.", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59185, "text": "The GPS data of the address or mobile device is determined, depending on your device settings).", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect security guarantee information: your account information, browsing, searching and booking records, and other use information, device information, IP address, and geographical location information."}
{"task": "rw_63.jsonl", "id": 59186, "text": "We may receive a background investigation report or fraud warning of identity verification service providers to prevent fraud and risk assessment, or to identify and prevent money laundering, abuse and security incidents.", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59187, "text": "We also need these personal information to fulfill our legal obligations, or protect our members' property and personal safety and system security.", "label": ["Usage"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59188, "text": "Response in public health emergencies and guarantee public interests: For example, we may receive health information, including but not limited to health information related to infectious diseases (such as, COVID-19).", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may collect health information, including but not limited to health information related to infectious diseases, to respond to public health emergencies and protect public interests."}
{"task": "rw_63.jsonl", "id": 59189, "text": "Personal information collected from other sources, such as:", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59190, "text": "Friends invite and peers: If you are invited to join the Audemars Piguet platform, such as your inviter can submit you to your personal information as your colleagues, including your email address or other contact information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Your inviter can submit your personal information as a colleague, including your email address or other contact information."}
{"task": "rw_63.jsonl", "id": 59191, "text": "We will process this information for: (i) assist your friends invitations;", "label": ["Usage"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59192, "text": "(Ii) Share your journey details and help you make a travel plan;", "label": ["Usage"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59193, "text": "(III) identify and prevent fraud;", "label": ["Usage"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59194, "text": "(IV) respond to your request or authorize for any other purpose;", "label": ["Usage"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59195, "text": "And (v) check -in registration.", "label": ["Usage"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59196, "text": "Other sources: Within the scope of applicable laws, we may receive other information about you from third -party service providers and/or partners, such as invites and population statistics or information to help us prevent fraud and securityThe question and integrate it with the information we have.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may collect other information about you from third -party service providers and/or partners."}
{"task": "rw_63.jsonl", "id": 59197, "text": "For example, we may receive information or activities inside and outside the platform of Audemars Piguet, or your experience and interactive information on our partners.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may collect your information or activities inside and outside the platform of Audemars Piguet, or your experience and interactive information on our partners."}
{"task": "rw_63.jsonl", "id": 59198, "text": "1.4 Equipment permissions we request", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59199, "text": "You can choose to open up related equipment permissions to authorize us to collect some of your personal information to request our service or improve your experience on Audemars Piguet.", "label": ["Permission Acquisition", "Important"], "rewrite": "You can choose to turn on the relevant equipment permissions to authorize us to collect some of your personal information."}
{"task": "rw_63.jsonl", "id": 59200, "text": "You can also turn off these permissions by changing the privacy settings on your device.", "label": ["Important", "Edit/Control"], "rewrite": "You can also turn off the device authority by changing the privacy settings on your device."}
{"task": "rw_63.jsonl", "id": 59201, "text": "Learn the device permissions that we may be retrieved.", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59202, "text": "1.5 cookie policy", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59203, "text": "We use cookies, mobile identifiers, tracking links (URL), log data and similar technologies to provide, protect and improve the Piguet welcoming platform.", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59204, "text": "For example, we use, cookies, the purpose includes record your login status, better understand how you browse and use the Audemars Piguet platform, improve and ensure security.", "label": ["Important", "First Party Collection Information"], "rewrite": "The purpose of us using cookies includes record your login status, better understand how you browse the use of Audemars Piguet platform and improve and ensure security."}
{"task": "rw_63.jsonl", "id": 59205, "text": "We also use this type of technology for marketing goals.", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59206, "text": "Cookies and similar technologies, see our Cookie policy for details.", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59207, "text": "2. Sharing and disclosure", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59208, "text": "2.1 Sharing with your consent or in accordance with your instructions", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59209, "text": "With your consent, we can share your information as described as described when you agree. For example, when you authorize third -party application software or website to visit your Audemars Piguet, or when you participate in the partner or partner of Audemars Piguet orDuring the promotion activities carried out by third parties.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We can share your information in the way you agree."}
{"task": "rw_63.jsonl", "id": 59210, "text": "Within the scope of applicable laws, we may share this information with social media platforms to develop potential customers, attract traffic or to platforms, attract traffic or to the platform, to attract traffic or attract traffic on social media platforms.Promote our products and services in other ways.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share this information with social media platforms after identifying some of your personal information (such as your email address)."}
{"task": "rw_63.jsonl", "id": 59211, "text": "2.2 Sharing between members", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59212, "text": "In order to assist in booking and other interactions between members, we may need to share certain information, such as:", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59213, "text": "When submitting an application or controversy, the landlord/experience expert and tenant/experience participants may share certain information, including personal information, names, the names of the same pedestrians, cancel the historical records of booking, evaluate information, and tenants.Age (unless the law prohibit), dispute processing results (such as applicable) and other information you choose to share and submit.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "The landlord/experience expert and tenant/experience participants may share certain information, including personal information, names, names of the same pedestrian, cancel the booking history records, evaluate information, the age of tenants, the result of dispute processing, and other you choose to share sharingAnd the information submitted."}
{"task": "rw_63.jsonl", "id": 59214, "text": "If a booking has been confirmed, in order to coordinate the itinerary, more information will be shared between members, such as personal avatars and phone numbers.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Members will also share more information, such as personal avatars and phone numbers."}
{"task": "rw_63.jsonl", "id": 59215, "text": "When you confirm the reservation as a landlord/experience expert, in order to coordinate the booking arrangement, some of your information will be shared with tenants/experience participants (and other tenants/experience participants that may invite, such as your individualInformation, name, phone number, listing or experience address.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Some of your information will be shared with tenants/experience participants, such as your personal information, names, phone numbers, listings or experience addresses."}
{"task": "rw_63.jsonl", "id": 59216, "text": "When you invite another member as a landlord/experience master to become a co -landlord/experience expert, you authorize the joint landlord/experience expert to visit and update your information and membership content, including but not limited to your name and phone number, Accommodation address, calendar, housing/experience information, housing/experience photos and email address.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "You authorize the common landlord/experience expert visit and update your information and membership content, including but not limited to your name, phone number, accommodation address, calendar, housing/experience information, housing/experience photos and email addressWaiting for information."}
{"task": "rw_63.jsonl", "id": 59217, "text": "When you invite other tenants/experience participants as a tenant/experience participant, your name, travel date, landlord/experience expert name, listing/experience details, accommodation address and other related information will be and every other related information and every other related information will be and every other related information.Tassers/experience participants shared.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Your name, travel date, landlord/experience expert name, listing/experience details, accommodation address and other related information will be shared with each other tenant/experience participants."}
{"task": "rw_63.jsonl", "id": 59218, "text": "2.3 The information, listing/experience information and other public information you posted in your personal information", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59219, "text": "You can disclose certain information to others, such as:", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59220, "text": "Your personal homepage includes your personal avatars, names, descriptions and cities.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Your personal homepage includes your personal avatars, names, descriptions and cities."}
{"task": "rw_63.jsonl", "id": 59221, "text": "The listing/experience page, including the following information: rough or accurate location of accommodation or experience, reservation date, avatar, certain statistics (such as the number of times of the page within a certain period of time) and any other information you choose to share or submittedEssence", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "The listing/experience page, including the following information: rough or accurate location of accommodation or experience, reservation date, avatar, certain statistical data, and any other information you choose to share or submit."}
{"task": "rw_63.jsonl", "id": 59222, "text": "Evaluation, score and other public feedback.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59223, "text": "Contents in communities or forums, blogs or social media posts.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59224, "text": "We may show some of your public information on third -party websites, platforms, and applications and other contents you disclosed to the public, such as details/experience details.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We may show some of your public information and other contents of your public information on third -party websites, platforms and applications."}
{"task": "rw_63.jsonl", "id": 59225, "text": "Third -party search engines may establish indexes for you to publicly share information on the Audemars Piguet platform.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Third -party search engines may establish indexes for you to publicly share information on the Audemars Piguet platform."}
{"task": "rw_63.jsonl", "id": 59226, "text": "In some cases, you can choose not to use this function in the account settings.", "label": ["Important", "Edit/Control"], "rewrite": "In some cases, you can choose not to use a third -party search engine function in the account settings."}
{"task": "rw_63.jsonl", "id": 59227, "text": "2.4 Landlord/Experienced Service Provider", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59228, "text": "The landlord/experience expert may need to use third -party services to help manage or provide their services, such as cleaning services or door lock suppliers.", "label": ["Usage"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59229, "text": "The landlord/experience expert may use the features of the Piguet platform to share the information of the tenant/experience participants in such a third -party service provider (such as the date of check -in and check -out, the name of the guest/experience participants, the tenant/experience participantsPhone number).", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The landlord/experience expert may use the Audemars Piguet platform function to share the information of the tenant/experience participants in such a third -party service provider."}
{"task": "rw_63.jsonl", "id": 59230, "text": "2.5 Comply with the law, respond to legal requirements, prevent infringement and protect our rights", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59231, "text": "In the case of legal requirements or allowed or disclosed behaviors, we can disclose your information to the courts, law enforcement agencies, government agencies, tax authorities, or authorized third parties to abide by legal obligations in: (i);", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We can disclose your information to the courts, law enforcement agencies, government agencies, tax authorities, or authorized third parties: (i) comply with legal obligations."}
{"task": "rw_63.jsonl", "id": 59232, "text": "(Ii) Comply with legitimate legal requirements or in response to the claims for Audemars Piguet to welcome China;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to comply with legitimate legal requirements or response to the claims of Audemars Piguet to welcome China, disclose information to third parties."}
{"task": "rw_63.jsonl", "id": 59233, "text": "(III) Responsive legitimate legal requirements related to criminal investigations to solve any other activities that are suspected of or suspected of illegal activities, or responded or dealt with may cause us, or any user to face the liability of law or regulatory liability (see Audemars Piguet and welcome law enforcement guidelines);", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to respond to legitimate legal requirements related to criminal investigations, disclose information to third parties."}
{"task": "rw_63.jsonl", "id": 59234, "text": "(IV) Implement and manage the agreement signed with members;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to execute and manage the agreement signed with members, disclose information to a third party."}
{"task": "rw_63.jsonl", "id": 59235, "text": "Or (V) Protect the rights, property or personal safety of Ai Pi Ying to welcome China and their employees, members, or public members.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to protect the rights and safety of Ai Biwan China and their employees, members, or public members, they disclose information to third parties."}
{"task": "rw_63.jsonl", "id": 59236, "text": "For example, if the above situation allows, the tax information of the landlord/experience expert may be shared with tax authorities or other government agencies.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The tax information of landlords/experience experts may be shared with tax authorities or other government agencies."}
{"task": "rw_63.jsonl", "id": 59237, "text": "In appropriate circumstances, we will inform members of the law, unless: (i) legal procedures, court orders we receive or applicable to the law to prohibit us from notifying;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59238, "text": "Or (ii) We believe that issuing notifications may be meaningless and ineffective, and will bring the risk of damage or personal injury to individuals or groups, or to meet the members of Audemines to welcome China, our members may increase the risk of fraud or damage, or make it to make it.Audemars Piguet welcomes China to obstruct public affairs or judicial allegations.", "label": ["Third Party Sharing/ Disclosure", "Risk"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59239, "text": "Chinese government agencies ask Piguet to welcome China to disclose landlords and housing information related to Chinese listings, as well as tenants related to Chinese listings and their booking and check -in information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Chinese government agencies ask Piguet to welcome China to disclose landlords and housing information related to Chinese listings, as well as tenants related to Chinese listings and their booking and check -in information."}
{"task": "rw_63.jsonl", "id": 59240, "text": "Similar to other companies that operate hotel accommodation or short -term rental industries in China, Audemars Piguet will disclose your information to the Chinese government without providing you without further notification.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Audemars Piguet will disclose your information to the Chinese government without providing you with further notifications."}
{"task": "rw_63.jsonl", "id": 59241, "text": "2.6 Property manager and owner arrangement", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59242, "text": "We may share the personal information of the landlord, the property management company and the/or owner (hereinafter referred to as the \"property management\") to share the personal information of the landlord/experience expert and tenants/experience participants, suchRelated information for rent specifications to facilitate the arrangement of property managers.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We may share the personal information of the Land/Experience Master and Tennis/Experience Participants with the property manager."}
{"task": "rw_63.jsonl", "id": 59243, "text": "For example, the booking of tenants/experience participants and personal information (including the contact information of the tenant/experience participants) may be possible with the landlord's residence and/or housing/experience, the property manager of the property manager of the place where the place where the people live and the place/experience is located.Shared to facilitate providing residential facilities services, abide by applicable laws, security, bills and other services.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "The reservation and personal information of the tenant/experience participants may be shared with the landlord's residence and/or housing/experience building, comprehensive building or community property manager."}
{"task": "rw_63.jsonl", "id": 59244, "text": "2.7 The landlord/experience expert information provided by business Aiwi Ying customers", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59245, "text": "If a reservation is designated for business or work purposes, and (i) is booked by the tenant/experience participants associated with a certain enterprise, (ii) The company has registered to join the business Ai Biwang, we can fully be fully fully enjoys, we can fully be fully fulfilledPerform our contract with the company and the scope required to provide services to the company (such as the name of the landlord/experience expert, the address of the residential facilities, the date of booking, the details of the listing/experience).", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We can disclose information related to booking related to the company within the scope of fully fulfilling the contract and providing services (such as the name of the landlord/experience expert, the address of the residential facilities, the date of booking, the details of the listing/experience, etc.)."}
{"task": "rw_63.jsonl", "id": 59246, "text": "At the requirements of enterprises or tenants/experience participants, we can also share such information with third -party supporting services providing support services for enterprises.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We can also share such information with third parties providing supporting services to the enterprise."}
{"task": "rw_63.jsonl", "id": 59247, "text": "2.8 Service Provider", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59248, "text": "We share personal information with affiliated and non -related service providers to help us carry out business.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We share personal information with affiliated and non -related service providers to help us carry out business."}
{"task": "rw_63.jsonl", "id": 59249, "text": "For example, service providers can help us: (i) verify your identity or identify your identity document, (ii) use public database to check information, (iii) for background or police investigation, fraud prevention and risk assessment. (IV) Product development, maintenance and debugging, (V) allows the Piguet Welcome platform service through third -party platforms and software tools (such as integrating our API), (VI) provides customer service, advertising or payment services, (VII) processingOr evaluate insurance claims or similar claims, or (VIII) to promote non -profit and charity activities that meet the mission of Aibly Piguet.", "label": ["Usage", "Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59250, "text": "These service providers have contract obligations to protect your personal information and have the right to access your personal information to perform these tasks.", "label": ["Usage"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59251, "text": "2.9 Business transfer", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59252, "text": "If Audemars Piguet welcomes China to engage in or involves any merging, acquisition, reorganization, asset sales, bankruptcy or non -debt debts, then we may sell, transfer or share our parts or all assets, including such transactions or considering this categoryRelated information about transactions (such as due diligence).", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If Audemars Piguet welcomes China to engage in or involves any merging, acquisition, reorganization, asset sales, bankruptcy or non -debt debts, then we may sell, transfer or share our parts or all assets, including such transactions or considering this categoryYou information related to transaction."}
{"task": "rw_63.jsonl", "id": 59253, "text": "In this case, we will notify you before transferring your personal information and the constraints of other privacy policies.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will notify you before transferring your personal information and before it becomes subject to a different privacy policy."}
{"task": "rw_63.jsonl", "id": 59254, "text": "2.10 Affiliated companies", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59255, "text": "In order to support us to provide, integrate, promote, and improve the services of love Piguet to welcome the platform, payment services and related companies, even if your place of residence is China, some of your personal information may be sent to our connected relationship based on co -ownership or common control relationshipThe company is dealt with by it.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Some of your personal information may be sent to our affiliates based on shared or common control relationship for processing."}
{"task": "rw_63.jsonl", "id": 59256, "text": "For example:", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59257, "text": "Shared with Airbnb,, Inc.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Shared with Airbnb, Inc."}
{"task": "rw_63.jsonl", "id": 59258, "text": "Even if you do not reside in the United States, your information will be shared with Airbnb, Inc., which provides the technical infrastructure for the Airbnb platform.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Your information will be shared with Airbnb, INC., Airbnb, Inc. provides technical infrastructure for the Piguet platform."}
{"task": "rw_63.jsonl", "id": 59259, "text": "Shared with the Airbnb payment entity.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Shared with the Airbnb payment entity."}
{"task": "rw_63.jsonl", "id": 59260, "text": "If you (i) book or provide any host/experience host services outside of China;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59261, "text": "or (ii) book a host/experiment host service located in China, but the host/experiment host lives outside of China, your payment information will also be shared with the Airbnb payment entity in order for you to complete the payment.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to facilitate your payment, your payment information will also be shared with Audemars Piguet."}
{"task": "rw_63.jsonl", "id": 59262, "text": "Shared with Airbnb, Ireland, UC, Airbnb, Travel, LLC, and Airbnb, Stays,, Inc.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Share with Airbnb Ireland Uc, Airbnb Travel LLC and Airbnb Stays, Inc."}
{"task": "rw_63.jsonl", "id": 59263, "text": "When you book or provide any host/experience host services outside of China, your information may also be shared with Airbnb, Ireland, UC or, in some cases, Airbnb, Travel, LLC, or Airbnb, Stays,,In, specifically Shared companies will be displayed on the booking or listing interface.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Your information may be shared with Airbnb Ireland UC or in some cases with Airbnb Travel LLC or Airbnb Stays, In, and the specific shared company will be displayed on the booking or listing interface."}
{"task": "rw_63.jsonl", "id": 59264, "text": "The three companies provide customer support and other business operations services to other Airbnb entities.", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59265, "text": "Shared with Airbnb Information Technology (Tianjin) Co., Ltd.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Shared with Airbnb Information Technology (Tianjin) Co., Ltd."}
{"task": "rw_63.jsonl", "id": 59266, "text": "When you book or provide accommodation services in China in accordance with the \"Additional Terms of Accommodation Services for Business Travel in China\", your information will be shared with Airbnb Information Technology (Tianjin) Co., Ltd.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Your information will be shared with Airbnb Information Technology (Tianjin) Co., Ltd."}
{"task": "rw_63.jsonl", "id": 59267, "text": "The above-mentioned data sharing is necessary for the performance of the contract between you and us, and it is also necessary for you to publish or book host/experience host services located outside of China and communicate with overseas members.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59268, "text": "2.11 Third-party service integration", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59269, "text": "Some components of Audemars Piguet Welcome platform may be associated with third -party services that we have or controlled.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Some components of Audemars Piguet Welcome platform may be associated with third -party services that we have or controlled."}
{"task": "rw_63.jsonl", "id": 59270, "text": "These include third-party software development kits (Software Development Kit, referred to as \"SDK\") or third-party application programming interfaces (Application Programming Interface, referred to as \"API\") integrated by our products to provide specific services or implement specific functions.", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59271, "text": "These third-party services may require necessary personal information to provide their services, such as your location (such as Amap, click here to view the terms of service and privacy policy of Amap) or device information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "These third-party services may require personal information necessary to provide their services, such as your location or device information."}
{"task": "rw_63.jsonl", "id": 59272, "text": "Your use of these third-party services is subject to their terms of service, and their privacy policies will also apply.", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59273, "text": "From time to time, we will conduct technical testing, testing and behavioral audits on SDK or API provided by related third parties, and ask them to promise to follow the applicable laws, regulations, and agree with usAnd use data.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "From time to time, we will conduct technical inspections, tests and behavioral audits on the SDKs or APIs provided by relevant third parties."}
{"task": "rw_63.jsonl", "id": 59274, "text": "Learn about our associated SDKs and third-party services.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59275, "text": "3. Other important information", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59276, "text": "3.1 Analysis of your communications", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59277, "text": "We may review, review or analyze the content of your communications on the Airbnb platform for the reasons described in the \"Personal Information Processing and Purposes\" section of this Policy, for fraud prevention, risk assessment, regulatory compliance, investigations, Product development, research, analysis, enforcement of our terms of service, policies, and for customer support.", "label": ["Important", "Usage"], "rewrite": "We review, review or analyze your communications on the Airbnb Platform."}
{"task": "rw_63.jsonl", "id": 59278, "text": "For example, in fraud prevention, we may review and analyze information to hide contact information and links to other websites.", "label": ["Important", "Usage"], "rewrite": "We may review and analyze information to conceal contact information and links to other websites."}
{"task": "rw_63.jsonl", "id": 59279, "text": "In some cases, we also review, audit or analyze information for the purpose of debugging, improving and expanding product services.", "label": ["Usage"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59280, "text": "We will use automated methods where reasonably practicable.", "label": ["Important", "Usage"], "rewrite": "We will use automated methods where reasonably practicable."}
{"task": "rw_63.jsonl", "id": 59281, "text": "However, we still sometimes need humans to review some communications for purposes such as investigating fraud incidents, customer support, or evaluating improved automated tool functionality.", "label": ["Usage"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59282, "text": "We do not review, review or analyze the content of your communications for the purpose of sending third-party marketing communications, nor do we sell the results of reviewing or analyzing those communications.", "label": ["Important", "Usage"], "rewrite": "We do not review, review or analyze the content of your communications for the purpose of sending third-party marketing communications."}
{"task": "rw_63.jsonl", "id": 59283, "text": "3.2 Linking third-party accounts", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59284, "text": "You can link your Airbnb account with third-party services such as social networking sites.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You can link your Airbnb account with third-party services such as social networking sites."}
{"task": "rw_63.jsonl", "id": 59285, "text": "Your contacts on these third-party services are called \"friends.\"", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59286, "text": "When you request data sharing by creating such an association:", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59287, "text": "Some of the information you provide to us through linked accounts may be published on your Airbnb account profile;", "label": ["Important", "First Party Collection Information"], "rewrite": "Some of the information you provide to us through linked accounts may be published on your Airbnb account profile."}
{"task": "rw_63.jsonl", "id": 59288, "text": "Your activity on the Airbnb Platform may be visible to your friends on the Airbnb Platform and/or third-party services;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Your activity on the Airbnb Platform may be visible to your friends on the Airbnb Platform and/or third-party services."}
{"task": "rw_63.jsonl", "id": 59289, "text": "Your public profile on the Airbnb platform may contain links to your public profile on third-party services;", "label": ["Important", "First Party Collection Information"], "rewrite": "Your Audemars Piguet Platform's disclosure of personal information may include a link to your personal information on your third -party service."}
{"task": "rw_63.jsonl", "id": 59290, "text": "Other Audemars Piguet users may be able to see your common friends with them, or you are a friend of their friends (such as applicable); if you apply it; if you apply it);", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Other Audemars Piguet users can see your common friends with them, or you are friends of their friends."}
{"task": "rw_63.jsonl", "id": 59291, "text": "Other Audemars Piguet users may be able to see any school, hometown, or other groups that you listed on the related social network services;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Audemars Piguet users can see that you listed on any school, hometown, or other groups listed on related social network services."}
{"task": "rw_63.jsonl", "id": 59292, "text": "Some of the information you provide to us through linked accounts may be stored, processed and transmitted for fraud prevention and risk assessment;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59293, "text": "as well as", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59294, "text": "The release and display of the information you provide to us through such associations depends on your settings and authorization on the Airbnb platform and third-party services.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59295, "text": "4. How do we store your personal information", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59296, "text": "We will keep your personal information for as long as necessary to fulfill the processing purposes, unless applicable law requires a longer retention period.", "label": ["Data Retention", "Important"], "rewrite": "We will keep your personal information for as long as necessary to fulfill the processing purposes, unless applicable law requires a longer retention period."}
{"task": "rw_63.jsonl", "id": 59297, "text": "After the expiration of the storage period, your personal information will be deleted or anonymized.", "label": ["Data Retention", "Important"], "rewrite": "After the expiration of the storage period, your personal information will be deleted or anonymized."}
{"task": "rw_63.jsonl", "id": 59298, "text": "According to the applicable law, the preservation period will depend on the following standards, and the maximum period is subject to:", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59299, "text": "To provide products or services that you have agreed to use;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59300, "text": "Ensure the safety and quality of our products and services;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59301, "text": "You agree to a longer period of time;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59302, "text": "or", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59303, "text": "Other special agreements on storage period.", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59304, "text": "In order to provide Audemars Power Welcome platform services and facilitate our global operations, you understand that we will transmit, store and process your information between our global affiliated companies, partners, and service providers.", "label": ["Data Retention", "Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "We will transmit, store and process your information between our global affiliated companies, partners and service providers."}
{"task": "rw_63.jsonl", "id": 59305, "text": "In these cases, we will abide by relevant laws and take appropriate measures to ensure that your personal information is fully protected.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59306, "text": "5. Your rights", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59307, "text": "You can exercise the rights described in this section according to the applicable laws and regulations.", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59308, "text": "Please note that before responding to your request, we may ask for verification of your identity and request to ensure information security.", "label": ["Important", "Data Security"], "rewrite": "Before responding to your request, we may ask you to verify your identity and request to ensure information security."}
{"task": "rw_63.jsonl", "id": 59309, "text": "We will respond to your request within the time limit stipulated by laws and regulations.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59310, "text": "Learn more personal information rights.", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59311, "text": "5.1 Query and manage your information", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59312, "text": "You can query and update some of your personal information through account settings.", "label": ["Edit/Control", "Important"], "rewrite": "You can query and update some of your personal information through account settings."}
{"task": "rw_63.jsonl", "id": 59313, "text": "You can also check your historical order details in the order center, and check the evaluation information you made or received on your personal data page.", "label": ["Edit/Control", "Important"], "rewrite": "You can also check your historical order details and view the evaluation information on your personal data page."}
{"task": "rw_63.jsonl", "id": 59314, "text": "5.2 Personal information copy and transfer", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59315, "text": "You can make a request through the contact information of the \"Contact Us\" chapter according to the applicable laws and regulations, apply for copying your personal information or asking for the transfer of your personal information to the personal information processor you designated.", "label": ["Edit/Control", "Important"], "rewrite": "You can make a request through the contact information of the \"Contact Us\" chapter according to the applicable laws and regulations."}
{"task": "rw_63.jsonl", "id": 59316, "text": "To ensure your personal information security, we may require your identity and request before responding to your request.", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "Before we respond to your request, we may require your identity and request."}
{"task": "rw_63.jsonl", "id": 59317, "text": "5.3 Delete your personal information", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59318, "text": "You can directly delete some of your personal information through your account settings.", "label": ["Important", "Edit/Control"], "rewrite": "You can directly delete some of your personal information through your account settings."}
{"task": "rw_63.jsonl", "id": 59319, "text": "In the following circumstances, you can also ask the contact information provided in the chapter of \"Contact Us\" to request delete some types of personal information:", "label": ["Important", "Edit/Control"], "rewrite": "You can also need to delete some types of personal information provided by the contact information provided in the \"Contact Us\" chapter:"}
{"task": "rw_63.jsonl", "id": 59320, "text": "You have withdrawn your consent;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59321, "text": "The purpose of personal information processing has been achieved, cannot be achieved or achieved by the purpose of processing;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59322, "text": "The handling of personal information violates applicable laws, regulations and agreements;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59323, "text": "Expiration of shelf life", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59324, "text": "as well as", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59325, "text": "We stop the operation of China to welcome China.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59326, "text": "In this case, we will issue a notice as soon as possible.", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59327, "text": "After receiving your request, we will deal with your request in time unless we must be retained according to the applicable law.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59328, "text": "If it is still within the storage period or the information is difficult to achieve technically, we will limit the processing of personal information as much as possible to storage and necessary security measures.", "label": ["Important", "Edit/Control"], "rewrite": "If it is still within the storage period or the information is difficult to achieve technically, we will limit the processing of personal information as much as possible to storage and necessary security measures."}
{"task": "rw_63.jsonl", "id": 59329, "text": "Please note that if you want to delete your personal information:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59330, "text": "We may retain and use your personal information to fulfill their legal obligations.", "label": ["Edit/Control", "Important"], "rewrite": "We may retain and use your personal information to fulfill their legal obligations."}
{"task": "rw_63.jsonl", "id": 59331, "text": "For example, we may retain your information in order to fulfill taxation, legal reports and audit obligations and legal obligations (such as protecting users' property or security and our system security).", "label": ["Important", "Edit/Control"], "rewrite": "You may retain your information in order to fulfill taxation, legal reports and audit obligations and legal obligations."}
{"task": "rw_63.jsonl", "id": 59332, "text": "For example, if we suspend an Aip platform for fraud or security reasons, we may retain information about Audemars Piguet's account to prevent the members from opening up Aipudi New Account in the future.", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "We may retain the information of Audema Piguet's account to prevent the members from opening up Audema Valley's New Account in the future."}
{"task": "rw_63.jsonl", "id": 59333, "text": "Even if your Audemars Piguet's account is canceled, the information you shared with others (such as evaluation, forum posts) can still be displayed publicly on the Audemars Piguet platform.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Even if the Audemars Piguet's account is canceled, the information you shared with others can still be displayed publicly on the Audemars Piguet platform."}
{"task": "rw_63.jsonl", "id": 59334, "text": "However, this information will be deleted with your association.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59335, "text": "Some of your information (such as log records) may be kept in our database, but it will no longer be associated with personal.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Some of your information (such as log records) may be kept in our database, but it will no longer be associated with personal."}
{"task": "rw_63.jsonl", "id": 59336, "text": "We have taken necessary measures for data loss and damage caused by preventing accidents or malicious behaviors. Therefore, in a limited period of time, the copy of your information may not be deleted from our backup system.", "label": ["Data Retention", "Edit/Control", "Risk", "Important"], "rewrite": "We have taken necessary measures for data loss and damage caused by preventing accidents or malicious behaviors.Therefore, for a period of time, the copy of your information may not be deleted from our backup system."}
{"task": "rw_63.jsonl", "id": 59337, "text": "In addition, if it is difficult to delete technology in technology, we may not delete your personal information, but in this case, we will stop processing your personal information, and only storage and adopting necessary security measures to protect theseinformation.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "If it is difficult to delete it technically, we may not delete your personal information, but in this case, we will stop processing and only store and take necessary security measures to protect this information."}
{"task": "rw_63.jsonl", "id": 59338, "text": "5.4 Logging out account", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59339, "text": "You can cancel your Audema Piguet account directly from our mobile applications.", "label": ["Important", "Edit/Control"], "rewrite": "You can cancel your Audema Piguet account directly from our mobile applications."}
{"task": "rw_63.jsonl", "id": 59340, "text": "After logging in to your Audemars Piguet account, you can go to your personal information page and click \"Settings\" and \"Logging out\" to cancel your account.", "label": ["Important", "Edit/Control"], "rewrite": "You can go to your personal information page and click \"Settings\" and \"Logging out\" to cancel your account."}
{"task": "rw_63.jsonl", "id": 59341, "text": "After the account cancellation, except for the application of applicable laws, we will delete your personal information in time.", "label": ["Important", "Edit/Control"], "rewrite": "After the account cancellation, except for the application of applicable laws, we will delete your personal information in time."}
{"task": "rw_63.jsonl", "id": 59342, "text": "Learn more about the specific requirements and processing processes of cancellation accounts.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59343, "text": "5.5 Withdrawal of consent", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59344, "text": "Within the scope of applicable laws and regulations, you can withdraw the consent of your personal information through the following ways:", "label": ["Edit/Control", "Important"], "rewrite": "You can withdraw the consent of your personal information through the following ways:"}
{"task": "rw_63.jsonl", "id": 59345, "text": "Delete your personal information through update or management account settings.", "label": ["Important", "Edit/Control"], "rewrite": "You can delete your personal information through update or management account settings."}
{"task": "rw_63.jsonl", "id": 59346, "text": "Go to the \"I\", \"Settings\" and \"Notice\" interface to cancel the subscription to receive our marketing email, message, reminder or other notifications.", "label": ["Important", "Edit/Control"], "rewrite": "You can go to the \"I\", \"Settings\" and \"Notice\" interface to cancel subscriptions, messages, reminders, or other notifications to receive our marketing emails."}
{"task": "rw_63.jsonl", "id": 59347, "text": "Go to the \"privacy\" or \"setting\" interface on the device to close the permissions granted.", "label": ["Important", "Edit/Control"], "rewrite": "You can go to the \"privacy\" or \"setting\" interface on the device to close the permissions granted."}
{"task": "rw_63.jsonl", "id": 59348, "text": "Go to the \"Settings\" interface in our mobile applications or visit the personalized recommendation of closing the listing/experience here.", "label": ["Edit/Control", "Important"], "rewrite": "Go to the \"settings\" interface in our mobile applications or personalized recommendations for closing listings/experiences."}
{"task": "rw_63.jsonl", "id": 59349, "text": "5.6 Require the right of interpretation", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59350, "text": "You can ask us to explain the rules of our personal information processing activities.", "label": ["Important", "Edit/Control"], "rewrite": "You can ask us to explain the rules of our personal information processing activities."}
{"task": "rw_63.jsonl", "id": 59351, "text": "You can make a request to us through the following contact information provided by the \"Contact Us\" chapter.", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59352, "text": "6. About minor protection", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59353, "text": "We only allow natural people to register an account on the platform of Aip counterpart.", "label": ["Specific Audiences", "Important"], "rewrite": "We only allow natural people who are 18 years old to register account on the Audemars P mutual platform."}
{"task": "rw_63.jsonl", "id": 59354, "text": "If you find that natural people under 18 years of age use our platform, please immediately notify us.", "label": ["Specific Audiences", "Important"], "rewrite": "If you find that natural people under 18 years of age use our platform, please immediately notify us."}
{"task": "rw_63.jsonl", "id": 59355, "text": "If a member provides personal information on a minor on the platform of iPimbow, we will delete it as much as possible after knowing it or obtain the parents of the relevant minor or other guardians as soon as possible if the legal requirements must be collected.agree.", "label": ["Specific Audiences", "Important"], "rewrite": "If a member provides personal information of minors, we will delete it as much as possible if it is required to obtain the consent of the guardian as soon as possible."}
{"task": "rw_63.jsonl", "id": 59356, "text": "7. Security", "label": ["Data Security"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59357, "text": "We use a series of security technologies and procedures, such as firewalls, encryption, de -identification, and access restrictions to prevent the loss, misuse, unauthorized access or disclosure of personal information.", "label": ["Important", "Data Security"], "rewrite": "We use a series of security technologies and procedures, such as firewalls, encryption, de -identification and access restrictions."}
{"task": "rw_63.jsonl", "id": 59358, "text": "We have passed the protection evaluation of network security levels, and we also take management measures, such as designated full -time departments or personnel to protect your personal information security, classify personal information, evaluate privacy impacts, and organize the training of our personnel to protect personal information.", "label": ["Important", "Data Security"], "rewrite": "We have passed the protection evaluation of network security level, and also adopted management measures to protect personal information."}
{"task": "rw_63.jsonl", "id": 59359, "text": "If a security incident occurs, we will perform our notification obligations according to the applicable law, and in accordance with the requirements of Chinese law, notify you the following information: the basic information on security events and its potential impact (including the personal information types that leaked, lost, and tampered with, Causes of the accident, and potential harm), the remedial measures we have taken, and the suggestions we provide about self -protection and reducing risks.", "label": ["Important", "Data Security"], "rewrite": "If a security incident occurs, we will fulfill our notification obligations based on the applicable law and notify you the following information: the basic information, remedial measures, and suggestions on security events and its potential impact."}
{"task": "rw_63.jsonl", "id": 59360, "text": "We will do our best to inform you in time through email, push information, short message, etc.", "label": ["Important", "Data Security"], "rewrite": "We will do our best to inform you in time through email, push information, short message, etc."}
{"task": "rw_63.jsonl", "id": 59361, "text": "In some cases, we may also issue a statement on the Audemars Piguet platform and notify you in time.", "label": ["Important", "Data Security"], "rewrite": "We may also issue a statement on the Piguet Powers and inform you in a timely manner."}
{"task": "rw_63.jsonl", "id": 59362, "text": "Although no organization can ensure absolute security, we will continue to implement and update management, technology and physical security measures to ensure that your information is exempted from unauthorized access, loss, destruction or change.", "label": ["Important", "Data Security"], "rewrite": "We will continue to implement and update management, technical and physical security measures to ensure that your information is exempted from unauthorized access, loss, destruction or change."}
{"task": "rw_63.jsonl", "id": 59363, "text": "8. Modification of this privacy policy", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59364, "text": "Audemars Piguet China reserves the right to modify the privacy policy at any time according to the law of applicable.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59365, "text": "If we modify the privacy policy, we will publish the revised privacy policy on the website page and update the \"final update date\" at the top of the page.", "label": ["Policy Change", "Important"], "rewrite": "We will publish the modified privacy policy on the website page and update the \"Last Update Date\" on the top of the page."}
{"task": "rw_63.jsonl", "id": 59366, "text": "If the privacy policy has changed significantly (such as changes in the purpose of handling or processing), we will also publicize before the privacy policy is effective according to the applicable laws and send messages, emails or other applicable laws to inform you the relevant modificationEssence", "label": ["Policy Change", "Important"], "rewrite": "If the privacy policy has changed significantly, we will publicize before the effectiveness of privacy policy and informs you the relevant amendments."}
{"task": "rw_63.jsonl", "id": 59367, "text": "If you do not agree with the modified privacy policy, you can cancel your account.", "label": ["Policy Change", "Important"], "rewrite": "If you do not agree with the modified privacy policy, you can cancel your account."}
{"task": "rw_63.jsonl", "id": 59368, "text": "In the case of obtaining your consent or you choose to continue accessing or using the Audemars Piguet platform, the modified privacy policy will be applicable to you.", "label": ["Policy Change", "Important", "Risk"], "rewrite": "With the consent of consent or you choose to continue accessing or using the Audemars Piguet platform, the modified privacy policy will be applied to you."}
{"task": "rw_63.jsonl", "id": 59369, "text": "But even if you disagree, you still enjoy the rights under this privacy policy.", "label": ["Policy Change", "Important"], "rewrite": "But even if you disagree, you still enjoy the rights under this privacy policy."}
{"task": "rw_63.jsonl", "id": 59370, "text": "9. Contact us", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59371, "text": "You are welcome to ask questions, opinions, and requests on this policy, and you can send it to us by email.", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59372, "text": "If you need to make a complaint with our personal information, please contact us here, we will handle your demand as soon as possible within 15 working days.", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59373, "text": "Check the past privacy policy here.", "label": [], "rewrite": []}
{"task": "rw_63.jsonl", "id": 59374, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
