{"task": "rw_67.jsonl", "id": 60351, "text": "Release and update date: August 15, 2022", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60352, "text": "Effective date: August 15, 2022", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60353, "text": "Scan all -around king privacy policy", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60354, "text": "Scan the Almighty King Department by Shanghai Linguan Data Technology Co., Ltd. (Shanghai Holy Information Technology Co., Ltd., a wholly -owned subsidiary, registered address: Room 1102, 1256, 1258, Wanrong Road, Jing'an District, Shanghai, Tel: 4006083063, hereinafter referred to as abbreviationThe application of practical tools (intelligent scanning and text recognition) operations operated by \"Linguan Data\" or \"We\").", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60355, "text": "We attach great importance to the personal information and privacy of protecting users (hereinafter referred to as \"you\").", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60356, "text": "When you register, log in, and use the scanning Almighty King, we will collect, use, save, and share your personal information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60357, "text": "In order to show our personal information, we specially formulated the \"Scanning Almighty Privacy Policy\" (hereinafter referred to as the \"Privacy Policy\"), and we promised to handle your personal information strictly in accordance with this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60358, "text": "You can also quickly learn about the previous descriptions through the \"Summary of the Privacy of the Almighty King\".", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60359, "text": "Before you register and log in to scan the Almighty King, please read this privacy policy carefully and fully understand the content of each terms.", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60360, "text": "You know and confirm that when you check or click \"Agree\" privacy policy, you agree that you agree that we will process your personal information in accordance with this privacy policy.", "label": ["Policy Change", "Important"], "rewrite": "When you check or click \"Agree\" privacy policy, you agree to deal with personal information in accordance with this privacy policy."}
{"task": "rw_67.jsonl", "id": 60361, "text": "The scope of the application of this privacy policy includes scanning the Almighty King App (Android), scanning Almighty King-Custom Edition App (Android), and Camscanner App (Android).", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60362, "text": "This privacy policy will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60363, "text": "1. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60364, "text": "2. How do we save your personal information", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60365, "text": "3. How can we share, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60366, "text": "4. How do we use cookie technology", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60367, "text": "5. How to get your personal information of third -party products or services", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60368, "text": "6. How do we protect your personal information", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60369, "text": "7. How do you manage your personal information", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60370, "text": "8. How do we deal with the personal information of minors", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60371, "text": "9. How can your personal information be transferred globally", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60372, "text": "10. How to update this privacy policy", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60373, "text": "Eleven, how to contact us", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60374, "text": "1. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60375, "text": "We divide the business functions of the Almighty King into basic business functions and expand business functions:", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60376, "text": "(1) Basic business functions are the necessary functions of document scanning and management, including document scanning, storage, and management.", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60377, "text": "(2) Extended business functions include OCR recognition based on scanning documents and personalized accounts.", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60378, "text": "Please understand that scanning all -round king may need to open part of the authority and collect the necessary personal information to achieve part of the service.", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60379, "text": "You can quickly understand the personal information and calls collected by our personal information and calls by querying the \"Personal Information Collection List\" and \"Application Railing Restrictions\" in specific business functions/scenarios.", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60380, "text": "(1) In basic business functions, we collect and use your personal information.", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60381, "text": "1. Account registration", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60382, "text": "When you register and scan the whole king, we need to collect your mobile phone number, e -mail, and login password.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you register to scan the whole king, you need to collect your mobile phone number, email, and login password."}
{"task": "rw_67.jsonl", "id": 60383, "text": "We collect your above information to help you complete the registration of scanning the Almighty King account and protect your account security. If you do not provide such information, we will not be able to create and provide you normally.", "label": ["Important", "Usage"], "rewrite": "Collect your mobile phone number, email address, and login password to complete registration and protect account security."}
{"task": "rw_67.jsonl", "id": 60384, "text": "You can also provide us with your avatar, nickname, and binding your WeChat account according to your own needs to improve your personal information or increase the convenience of login, but you do not provide this information, do not affect your normal use of us, we use us normally.Services.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can choose to provide your avatar, nickname, and bind your WeChat account to improve your personal data or increase the convenience of login."}
{"task": "rw_67.jsonl", "id": 60385, "text": "You can choose to certify the school, that is, to provide us with your school name and school mailbox for college student certification to obtain the exclusive special rights of students provided by our users (the content of the equity is based on the information announced by the certification page), butYou do not provide this information and do not affect your normal use of our services.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "You can provide your school name and school mailbox for college student certification to obtain students' exclusive special rights."}
{"task": "rw_67.jsonl", "id": 60386, "text": "2. Team version account application", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60387, "text": "You can click \"My-Team Edition\" to apply for the team version account. We need to collect your name, mobile phone number, mailbox, scanning all-around king's registered account ID (selected), number of people, industry, and application reasons.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When applying for a team version account, we need to collect your name, mobile phone number, mailbox, scanning all -round king registered account ID (selected), number of people, industries, and application reasons."}
{"task": "rw_67.jsonl", "id": 60388, "text": "We collect your above information to understand your use needs and help you open the scanning all -round king team version account function.", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60389, "text": "If you do not provide such information, we will not be able to receive your application or open a team version account for you, but it will not affect your other functions.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60390, "text": "3. Document scanning", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60391, "text": "When you perform scan documents and automatic cutting operations, we need to call the camera, album and clipboard permissions of your device. We call your camera and album authority to obtain your active shooting or selected document.The board permissions are to facilitate you to directly choose a document for scanning to copy to the clipboard. The extraction of the above permissions is to help you complete the document scanning and automatic cutting.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "When you perform scanning documents and automatic cutting operations, you need to call the camera, album and clipboard permissions of your device."}
{"task": "rw_67.jsonl", "id": 60392, "text": "We need to collect your device sensor list and equipment sensor information. We collect your above information to use the horizontal instrument to adjust the document angle during the automatic cutting process.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your equipment sensor list and equipment sensor information in order to adjust the document angle."}
{"task": "rw_67.jsonl", "id": 60393, "text": "Document scanning and automatic cutting are completed locally, we will not collect and use your other personal information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Document scanning and automatic cutting are completed locally, we will not collect and use your other personal information."}
{"task": "rw_67.jsonl", "id": 60394, "text": "If you do not agree with us to collect the above information, you may not be able to use our services normally because you cannot complete the document scanning and automatic cutting.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60395, "text": "Please know, even if you have agreed to turn on the camera permissions, you will only be processed within the range of your active shooting or selected photo;", "label": ["Permission Acquisition", "Important"], "rewrite": "Even if you have agreed to turn on the camera permissions, it will only be processed within the scope of your active shooting or selected photo."}
{"task": "rw_67.jsonl", "id": 60396, "text": "If you don't choose the content of scanning the clipboard, we will not read the contents of your clipboard for related processing.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60397, "text": "4. Reading and management of documentation", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60398, "text": "When you conduct document scanning, storage, reading, and deleting operations, we need to call your device storage, access to all document access and shear board permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you perform document scanning, storage, reading, and deleting, you need to call your device storage, access to all document access and shear board permissions."}
{"task": "rw_67.jsonl", "id": 60399, "text": "We call your storage and all document access permissions to obtain documents that you are ready to read and manage. We call your clipboard permissions to facilitate you to directly choose the document that reads and manage the clipboard.The retraction is to help you complete the reading, management, document search, document naming and content editing of the document. Except for your shooting and selected document materials, we will not handle your other document materials in the storage space.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "Equipment storage, access to all document access, and cutting board permissions are used to help you complete the reading, management, document search, document naming and content editing of the documentation, and will not process other document materials you have not selected."}
{"task": "rw_67.jsonl", "id": 60400, "text": "In addition, every time you enter the [Home] or [Document] page, we will also read the pictures in your storage space to detect whether there is a screenshot and indicate whether you need to identify or read the corresponding screenshots to facilitate your operation.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you enter the [Homepage] or [Document] page, read the pictures in your storage space to detect whether there is a screenshot."}
{"task": "rw_67.jsonl", "id": 60401, "text": "We promise that we only conduct screenshots. Except for you selected to identify the screenshot, we will not collect the content of the screenshot.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60402, "text": "If you do not agree that we call the above permissions, you may not be able to use our services normally because you cannot complete the document reading and management.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60403, "text": "5. Ensure the basic security of online access and services", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60404, "text": "In order to ensure the basic security of your account, network access and services, we need to call the process permissions of the application of your device being running, so as to query whether the scanning all -round king is the main running program.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "Call the process permissions of the application that your device is running to in order to query whether the scanning all -round king is the main running program."}
{"task": "rw_67.jsonl", "id": 60405, "text": "We need to call the phone permissions of your device. We need to collect your only device recognition symbols (IMEI, IMSI, Meid (you can get once after you allow you to obtain the phone permissions), IDFA, Androidid, OUID, UUID (IDFV)The only identification of the phone), the language of the mobile phone system, the country, the city, the IP address, and the MAC address of the mobile phone (collecting it once when the app was launched for the first time, if you clear the cache, it will be collected once when you start the app next time), device information (browser type type type (browser type type type, Equipment type and model, CPU, system language, memory, operating system version, Wi-Fi status, timestamp and regional, device motion parameters and carrier, SIM card serial number, device hardware sequence number), your network behavior trajectory (Including the number of clicks, participation time), software installation list, access date and time, and service log information.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "Call the phone permissions of your device, collect your only device recognition symbol, the language of the mobile phone system, the country, the city, the IP address, the MAC address, the equipment information, your network behavior trajectory, software installation list, visit date and time, service log, service log, service log, service loginformation."}
{"task": "rw_67.jsonl", "id": 60406, "text": "The information provided by the above information with the above information (including: network type, IMSI, network address, operator type, number of mall numbers, number of SIM cards, mobile phone equipment types, mobile phone operating systems, hardware manufacturers, hardware manufacturers, hardware manufacturers, hardware manufacturers, hardware manufacturersThe information you provided will change according to your phone number. You can change the different operators. You can confirm the information provided when you query [third -party list] or [third -party information data sharing list]), and the information provided when paying the settlement service (includingIDFA, OAID), and areas, the information you provide will change according to the different payment channels you choose. You can combine the data analysis by querying the [third -party list] or [third -party information data sharing list]).Form user portraits and related risk control records for accounts.", "label": ["Important", "Usage"], "rewrite": "Combining your equipment information, system information, service log information, etc. with the information provided by you when you use one -click login service to perform data analysis, and form user portraits and related risk control records for account numbers."}
{"task": "rw_67.jsonl", "id": 60407, "text": "If you do not agree with us to collect the aforementioned information, we may not be able to use our services normally because we cannot complete the security risk control verification.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60408, "text": "6. Ensure the reliability and stability of the service", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60409, "text": "In order to ensure the reliability and stability of the service, we need to collect your device model, operating system version, browser type, language used, the method of accessing the network, network quality and data, scanning all -around king registered account ID.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your device model, operating system version, browser type, language use language, connection network method, network quality and data, scanning all -around king registered account ID to ensure the reliability and stability of the service."}
{"task": "rw_67.jsonl", "id": 60410, "text": "We will also collect the operating data and software collapse data of scanning all -round king through Firebase, SDK, Friends SDK, Bugly, SDK, and monitor problems.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect the operating data and software collapse data of the scanning all -round king, and monitor the problem."}
{"task": "rw_67.jsonl", "id": 60411, "text": "If you do not agree with us to collect the aforementioned information, we may not be able to use our services normally due to the reliability and stability of the service.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60412, "text": "(2) The situation of we collect and use your personal information in the extended business function", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60413, "text": "1. OCR recognition function", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60414, "text": "When you use the OCR recognition function, whether it is done locally or in the cloud, we need to call your camera, storage and shear permissions. We call your camera and storage authorityImage or document information, we call your clipboard permissions to facilitate you to directly select the picture or document information that has been copied to the clipboard. We get your above information to help you achieve OCR identification, document naming and content editing functions.If you refuse to turn on the corresponding permissions, we will not be able to provide you with OCR recognition function, but it does not affect your other functions that use us normally.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the OCR recognition function, call your camera, storage, and shear board permissions to help you realize OCR recognition, document naming and content editing functions."}
{"task": "rw_67.jsonl", "id": 60415, "text": "Even if you have agreed to start the camera and device storage permissions, you will only process relevant information within the scope of your active photos or the document scope you choose;", "label": ["Important", "First Party Collection Information"], "rewrite": "Even if you have agreed to start the camera and device storage permissions, you will only process relevant information within the scope of your active photos or the document scope you choose."}
{"task": "rw_67.jsonl", "id": 60416, "text": "If you don't choose to identify the contents of the shear plate, we will not read the content of your shear plate for related processing.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60417, "text": "The cloud OCR service will improve the accuracy of text recognition. If you choose the cloud OCR service, we will automatically collect and analyze the results of OCR recognition to optimize the image processing engine and OCR algorithm.\"Mine-more settings-text recognition OCR\" is set to \"local recognition\". The accuracy of your text recognition may decline, but it does not affect your other services normally.", "label": ["Edit/Control", "First Party Collection Information", "Usage", "Important"], "rewrite": "If you choose the cloud OCR service, it will automatically collect and analyze the results of OCR recognition to optimize the image processing engine and the OCR algorithm. You can set it in \"Mine-more settings-text recognition OCR\"Refuse to provide such information."}
{"task": "rw_67.jsonl", "id": 60418, "text": "2. Certificate mode (scan)", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60419, "text": "When you choose to use the document mode for document scanning, we need to call the camera, storage and shear permissions of your device. You need to select the type of document that you need to scan in the document mode and submit the certificate picture (scan).The camera and storage permissions are to obtain the certificate picture of your active shooting or selected. We call your clipboard permissions to facilitate you to directly select the certificate of the scanning to the clipboard. We call the above permissions to help you complete the certificate scanningAnd automatic cutting.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "When you choose to use the document mode for document scanning, call your device's camera, storage and cutting board permissions to help you complete the certificate scan and automatic cutting."}
{"task": "rw_67.jsonl", "id": 60420, "text": "We need to call your device sensor list. We collect your above information to use the horizontal instrument during automatic cutting to adjust the angle of the document.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Call your device sensor list to use the horizontal instrument during automatic cutting to adjust the angle of the document."}
{"task": "rw_67.jsonl", "id": 60421, "text": "The scanning, automatic cutting, and type logo of the documents will be performed locally on your device. When you choose to save the certificate picture (scan), your certificate picture (scan) will be sent to the cloud. We promise your document information andThe content will not be used for any other purposes. If you do not agree that we collect the above information, we will not be able to provide you with a document scanning, but it will not affect your other functions that use our functions normally.", "label": ["Data Retention", "Important", "First Party Collection Information"], "rewrite": "The scanning, automatic tailoring and type identification of the documents are carried out locally. When you choose to save the certificate picture, the certificate picture will be sent to the cloud, but it will not be used for any other purposes."}
{"task": "rw_67.jsonl", "id": 60422, "text": "The types of documents above include ID cards, passports, hukou books, driving licenses, driving licenses, bank cards, real estate certificates, business licenses, and conventional documents, student credits, children's documents, vocational qualifications, death certificates.", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60423, "text": "You can click \"More Certificate\" through the document mode to learn and view the type supported certificate.", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60424, "text": "3. Payment settlement", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60425, "text": "When you scan the Almighty King for payment and settlement, we will collect your order information and transaction status, and we will obtain the information of your payment from WeChat and Alipay. We collect the above information to confirm your order status to goYou provide services, protect your property security, and deal with user disputes. If you do not agree with us to collect the above information, you may not be able to purchase value -added services because you cannot complete the payment settlement (including member services, redeeming cloud space services, increasing the number of cloud recognition times service serviceIncrease translation services and purchase fax services).", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you scan the Almighty King for payment and settlement, collect your order information and transaction status to confirm your order status to provide you with services."}
{"task": "rw_67.jsonl", "id": 60426, "text": "If you apply for electronic invoices, we need to collect your mailbox address, order number, price, invoice head, and taxpayer identification number through Baiwang API;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If you apply for an electronic invoice, collect your mailbox address, order number, price, invoice head, and taxpayer identification number through Baiwang API."}
{"task": "rw_67.jsonl", "id": 60427, "text": "If you apply for a dedicated invoice for paper VAT, we need to collect your recipient's name, receiving address, contact telephone number, company invoicing information (invoice head, account opening name, account opening account number, taxpayer identification number, company address, company address,Contact information).", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If you apply for a dedicated invoice for paper VAT, collect your recipient's name, receipt address, contact phone number, and company invoicing information."}
{"task": "rw_67.jsonl", "id": 60428, "text": "If you do not provide this information, we cannot issue an invoice for you, but it will not affect your other services that use our other services normally.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60429, "text": "4. Account nickname and functional settings", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60430, "text": "When you set a personalized setting of the account, we need to collect your account nickname and functional settings option.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you set a personalized setting of your account, you need to collect your account nickname and functional settings option."}
{"task": "rw_67.jsonl", "id": 60431, "text": "We collect your above information to protect your privacy or to ensure that the generated documents meet or approach your expectations. If you do not provide such information, we will not be able to provide you with account nicknames and functional settings, but it will not affect it without affecting it.You use our other services normally.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your account nickname and functional setting option to protect your privacy or ensure that the generated document meets or approach your expectations."}
{"task": "rw_67.jsonl", "id": 60432, "text": "5. Search for recommendation", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60433, "text": "When you use the in -application search function, in order to show you and provide a document or service that you may be searching for or interested, we may use your account user portrait to make the documents, products or services you are interested inThe information is preferred to you, that is, personalized recommendation.", "label": ["Important", "Usage"], "rewrite": "When you use an in -app search function, use your account user portrait for personalized recommendations."}
{"task": "rw_67.jsonl", "id": 60434, "text": "If you do not want to receive personalized products or services, you can use [Mine]-[more settings]-[Close personalized service push] to close the personalized recommendation function through the application. When youWhen using a low version of the client, you may not be able to find the button. You can directly click on the rear text button [Personalized Service] for setting.", "label": ["Edit/Control", "Important"], "rewrite": "You can use [Mine]-[More Settings]-[Message Settings]-[Close Personalized Service Push] to close the personalized recommendation function, or directly click the rear text button [Personalized Service] to set up."}
{"task": "rw_67.jsonl", "id": 60435, "text": "When you close, we will not push you to personalized recommendation content, but will only push you to you with universal content or advertisements that have nothing to do with your preference.", "label": ["Edit/Control", "Important"], "rewrite": "When you close personalized recommendations, we will not push you personalized recommendation content, but will only push universal content or advertisements."}
{"task": "rw_67.jsonl", "id": 60436, "text": "6. Fax service", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60437, "text": "For scanning Almighty King 5.42.0 below, when you use fax service, we need to call the storage permissions of your device. We need to collect the documents you uploaded and the fax number you send objects.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "For scanning all -round king 5.42.0, when you use fax service, you need to call the storage permissions of your equipment to collect the documents you uploaded and the fax number you send."}
{"task": "rw_67.jsonl", "id": 60438, "text": "We collect the above information to complete the fax service. If you do not provide such information, we will not be able to provide you with fax services normally, but it will not affect your other services normally.", "label": ["Usage"], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60439, "text": "For scanning Almighty King 5.42.0 and above, when you use the fax service, we need to call the camera and storage permissions of your equipment. We needThe third -party service provider PAMFAX completes the document fax.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "For scanning all -round king 5.42.0 and above, when you use fax services, you need to call the camera and storage permissions, collect your uploaded documents and fax numbers you send objects, and transmit it to the third -party service provider PAMFAX to complete the document fax.Essence"}
{"task": "rw_67.jsonl", "id": 60440, "text": "We collect the above information and transfer the above information to the third party to complete the fax service.Other services.", "label": ["Usage", "Third Party Sharing/ Disclosure", "First Party Collection Information"], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60441, "text": "7. PDF document type conversion service", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60442, "text": "When you use the PDF document type conversion service, we need to call the storage authority of your device to obtain the document or picture you need to convert the document type conversion according to your needs.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the PDF document type conversion service, you need to call the storage authority to obtain a document or picture that needs to be converted."}
{"task": "rw_67.jsonl", "id": 60443, "text": "If you don't agree with us to collect this kind of information, you can use this function without using this feature. Your PDF document will not be converted to other types of formats, but it will not affect your other services that use our services normally.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60444, "text": "8. OCR translation service", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60445, "text": "When you use the OCR translation service, we need to call the storage permissions of your device. We need to upload the text identified in the picture to Microsoft Translation API.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the OCR translation service, you need to call the storage permissions to upload the text identified in your picture to the Microsoft Translation API."}
{"task": "rw_67.jsonl", "id": 60446, "text": "We collect the above information to complete the translation service. If you do not provide such information, we will not be able to provide you with translation services normally, but will not affect your other services normally.", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60447, "text": "9. One -click login service", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60448, "text": "When you log in to the service with one -click, the telecommunications operator will send us your mobile phone number to us through mid -migration SDK. We need to call the phone equipment permissions of your device. SDK will collect your IP, address, software and hardware feature information information, User identifier (IMSI) and SIM cards. We collect the above information to help you complete one -click login. If you do not agree with us to collect this kind of information, scanning the Almighty King may not be able to realize your mobile phone number and cannot achieve one.The key is on, but it does not affect your other services that use our other services normally.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "When you use one -click login service, the telecommunications operator will send us your mobile phone number to us, and we will call the device's phone equipment permissions to collect IP addresses, software and hardware feature information, user identifiers, SIM card signs to help youComplete one -click login."}
{"task": "rw_67.jsonl", "id": 60449, "text": "10. Certificate photo service", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60450, "text": "When you use your document service, we need to call the camera and storage permissions of your device. Piao Piao Baby Certificate Photos will obtain your portrait photos and make an electronic certificate photo.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "When you use your certificate to follow the service, you need to call the camera and storage permissions of the device to obtain your portrait photo and make an electronic document photo."}
{"task": "rw_67.jsonl", "id": 60451, "text": "We need to obtain your document through the follow -up service of the Piaopolopal Baby Certificate and save it to your device to ensure that you can see and store the license photos that are made.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Get your certificate photo and save it to your device so that you can check and store it."}
{"task": "rw_67.jsonl", "id": 60452, "text": "We collect the above information to provide the license photo service. If you do not agree that we collect this kind of information, you will not be able to use the license photo function, but it will not affect your other services normally.", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60453, "text": "11. Electronic evidence service", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60454, "text": "When you use the electronic evidence service, we need to call the camera and storage permissions of your device. We need to collect your documents, geographical location, and ID information through the China Economic Economic Electronics Electronic Evidence Cloud Services.You will obtain your explicit consent through pop -ups. We collect the above information to provide electronic evidence services. If you do not agree with us to collect such information, you will not be able to use electronic evidence functions, but it will not affect your normally use usother service.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "When you use electronic evidence services, call the device's camera and storage permissions, and you agree to collect your documentation, geographical location, and ID information you uploaded in order to provide electronic evidence services."}
{"task": "rw_67.jsonl", "id": 60455, "text": "12. Document radar", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60456, "text": "When you use the document radar function, we need to call the album permissions of your equipment to obtain the photos in your album. We obtain your above information to automatically identify and show you priority to the type of document type to improve your office efficiencyIf you refuse to turn on the corresponding permissions, we will not be able to provide you with a document radar function, but it does not affect your other functions that use us normally.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the document radar function, call the album permissions of your device to obtain the photos in your album so that you can automatically identify and show you priority to the document -type photos."}
{"task": "rw_67.jsonl", "id": 60457, "text": "All recognition work of the document radar function will be completed locally. Even if you have agreed to open the album permissions, we will only collect and process photos of you to import and scan all -around king, and will not read all the contents of your mobile phone album.", "label": ["Data Retention", "Important", "First Party Collection Information"], "rewrite": "All recognition work of the document radar function will be completed locally. Even if you have agreed to open the album authority, we will not read the content you did not choose to introduce."}
{"task": "rw_67.jsonl", "id": 60458, "text": "13. Photo repair", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60459, "text": "When you use the photo repair function, we need to call your camera, album, storage, and network permissions to obtain the photos you need to upload and save the repaired photos for you.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the photo repair function, call your camera, album, storage, network permissions to obtain the photos you uploaded and save the repaired photos."}
{"task": "rw_67.jsonl", "id": 60460, "text": "We need to collect your device sensor list. We collect your above information to use the horizontal instrument to adjust the photo angle during the photo repair process.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your device sensor list to use the horizontal instrument to adjust the photo angle during the photo repair process."}
{"task": "rw_67.jsonl", "id": 60461, "text": "We get your above information to provide you with photo repair services. If you refuse to turn on the corresponding permissions or do not agree with us to collect this kind of information, you can not use this function. You will not be able to use the photo repair function, but it will not affect your normalUse our other services.", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60462, "text": "14. Black and white photos color", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60463, "text": "When you use black and white photos, we need to call your camera, album, storage, network permissions to obtain and process the photos you need to upload and save the photos after coloring.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "When you use black and white photos, call your camera, album, storage, and network permissions to obtain and process photos that need to be uploaded and save photos after coloring."}
{"task": "rw_67.jsonl", "id": 60464, "text": "We need to collect your device sensor list. We collect your above information to use the horizontal instrument during the color of the photo to adjust the angle of the photo.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your device sensor list to use the horizontal instrument to adjust the photo angle during the color of the photo."}
{"task": "rw_67.jsonl", "id": 60465, "text": "Your selected photos will be sent to the cloud for processing.", "label": ["Data Retention", "Important"], "rewrite": "The selected photos will be sent to the cloud for processing."}
{"task": "rw_67.jsonl", "id": 60466, "text": "We get your above information to provide you with black and white photo color services., But it does not affect your other services normally.", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60467, "text": "15. Print document", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60468, "text": "When you use the printing document function, we will call the Bluetooth permissions of your device. In view of the need to apply for positioning permissions in the Android system, we will also call the positioning authority of your device.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "When you use the printing document function, call the Bluetooth permissions of your device and the positioning authority of the equipment of the Android system."}
{"task": "rw_67.jsonl", "id": 60469, "text": "We get your above information to provide you with a printing document service. If you refuse to open the corresponding permissions or do not agree with us to collect and transmit such information, you will not be able to use the printing document function, but it will not affect your normally use our other services.Essence", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60470, "text": "16. Recommend for you", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60471, "text": "Our services will integrate or access third -party advertising service providers to push you universal ads.", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60472, "text": "In the process, we will share the identified device information or statistical information with the advertising service provider. The aforementioned information is difficult or unable to associate with your true identity. We collect and share this informationEffectiveness and optimization of advertising effects.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Share and analyze de -identified equipment information or statistical information with advertising service providers to analyze and measure the effectiveness of advertising services and optimize the effect of advertising."}
{"task": "rw_67.jsonl", "id": 60473, "text": "You can learn about the details of the advertising service provider and your information collected by checking the detailed information of advertising service providers and your information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You can check the details of the advertising service provider and your information collected by viewing the [third -party list] or [third -party information data sharing list]."}
{"task": "rw_67.jsonl", "id": 60474, "text": "We will ask advertising service providers to follow the principles of legal, correctness, and necessary information to ensure that your legitimate rights are not violated.", "label": ["Important", "Data Security"], "rewrite": "Advertising service providers are required to follow the information of legal, correct, and necessary principles to protect your legitimate rights."}
{"task": "rw_67.jsonl", "id": 60475, "text": "If you don't agree with us to collect the aforementioned information, it will not affect your other services that use our services normally.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60476, "text": "17. Test papers erase", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60477, "text": "When you use the test papers to erase function, we need to call the camera, album, storage, and network permissions of your device to obtain and process the photos you need to upload and save you the test papers after the removal processing.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the test papers to erase the function, call the camera, album, storage, and network permissions of your device to obtain and process the photos you need to upload and save the test paper photos after removal processing."}
{"task": "rw_67.jsonl", "id": 60478, "text": "We need to collect your device sensor list. We collect your above information to use the horizontal instrument to adjust the test paper angle during the test paper removal process.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your device sensor list to use the horizontal instrument during the test paper removal process to adjust the test paper angle."}
{"task": "rw_67.jsonl", "id": 60479, "text": "Your selected photos will be sent to the cloud for processing.", "label": ["Data Retention", "Important"], "rewrite": "The selected photos will be sent to the cloud for processing."}
{"task": "rw_67.jsonl", "id": 60480, "text": "In particular, the test papers may include your name or other personal information. If you are unwilling to upload this type of information, we recommend that you cover or erase the type of information before scanning the test paper, as you uploaded the test papers photo photos uploaded, as uploaded by the test papers photo photos, as uploaded by the test papers photo photos, as uploaded by the test papers photo photos, the photo paper photos uploaded the photo paper photo photos, as you uploaded the test papers photo photos, the photo papers photos of the papers uploaded the photo paper photos, such as the test papers you uploaded.It contains your personal information, and we promise that we will not identify, collect and use this type of information.", "label": ["Important", "Risk"], "rewrite": "You can cover or erase the personal information before uploading the test papers. If it is not processed, we will not identify, collect and use this type of information."}
{"task": "rw_67.jsonl", "id": 60481, "text": "We obtain your above information to provide you with a test paper eraseed service. If you refuse to turn on the corresponding permissions or do not agree with us to collect and transmit such information, you can not use this function.It does not affect your other services normally.", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60482, "text": "18. Message push", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60483, "text": "We will pass the Huawei SDK, Xiaomi SDK, vivo, SDK or OPPO, SDK (matching the mobile phone model you currently use) to scan the product introduction, business promotion, value -added service promotion, functional update, functional renewal, abnormal functional update, functional renewal, abnormal functional update,2. Background task completion progress.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Through Huawei SDK, Xiaomi SDK, vivo SDK or OPPO SDK, send the product introduction, business promotion, value -added service promotion, functional update, functional abnormalities, and background tasks to complete the progress of the device."}
{"task": "rw_67.jsonl", "id": 60484, "text": "We need to collect your MAC address information (collect it once when the app was launched for the first time, if you clear the cache, it will be recharged once when the app is launched next) and calls the phone, network authority, network status, Wi-Fi status, writing, write, write, write, write, and write your device.Entering the outer storage permissions, Huawei SDK, Xiaomi SDK, vivo, SDK or OPPO, SDK will collect your software installation list, AndroidId (Androidid), and message record information when you open the scanning all -round king application.One or more types of messages, if you do not agree to receive the information of the above push, you can close the message push through the \"mobile phone settings-notification center-scan all-around king-allow notification\".News, but does not affect your other services normally.", "label": ["Edit/Control", "Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your MAC address information and call your phone, network authority, network status, Wi-Fi status, and write external storage permissions. The SDKs of each manufacturer will collect your software installation list, user logo, message record information, and use it for towards towardIf you send messages, you can close the message push through the \"mobile phone setting-notification center-scanning Almighty King-Allowing Notice\"."}
{"task": "rw_67.jsonl", "id": 60485, "text": "At the same time, we will retrieve the process permissions you are running for applications in order to query whether the scanning all -round king is the main running program, and then determine whether it can receive message push. When we scan the all -around king of the operation, we can only operate the program.It is possible to push you a message.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "The process permissions that are running the application that are running in order to query whether the scanning all -round king is the main running program, and then determine whether it can receive message push."}
{"task": "rw_67.jsonl", "id": 60486, "text": "19. Business promotion", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60487, "text": "We will send the product promotion information of the entire energy king to your mobile phone number and mailbox address. If you do not agree to receive business promotion information, you can contact us in accordance with the method of promoting information or in accordance with the method provided by this privacy policy.Promoting information.", "label": ["Edit/Control", "Usage", "Important"], "rewrite": "Send the product promotion information of the full -energy king to your mobile phone number and mailbox address. You can lift your bips in a load or contact us."}
{"task": "rw_67.jsonl", "id": 60488, "text": "We will not be able to provide you with business promotion information normally, but it will not affect your other services normally.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60489, "text": "20. Customer service", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60490, "text": "When you make complaints, suggestions or feedback to us, in order to facilitate the treatment plan and results of helping you to solve the problem or recording related issues as soon as possible, we may collect your communication or call records with us, and you provide itAccount information, contact information you provided, and information you provided in order to prove related facts.", "label": ["Edit/Control", "First Party Collection Information", "Usage", "Important"], "rewrite": "When you make complaints, suggestions or feedback to us, you may collect your communication or call records with us, account information, contact information you provide, and information you provide to prove the relevant facts."}
{"task": "rw_67.jsonl", "id": 60491, "text": "If you choose to upload the picture, we need to call the album/storage permissions of your equipment to obtain the picture you uploaded.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "If you choose to upload the picture, call the album/storage permissions to obtain the picture you uploaded."}
{"task": "rw_67.jsonl", "id": 60492, "text": "We collect the above information to complete customer service. If you do not provide such information, your complaints, suggestions and feedback may not be processed in a timely manner, but it does not affect your other services normally.", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60493, "text": "(3) Exemption to obtain consent to handle personal information in accordance with the law", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60494, "text": "Please understand that in the following circumstances, according to laws and regulations, we handle your personal information without obtain your authorization consent.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In the following situations, according to laws and regulations, we do not need to obtain your authorization consent."}
{"task": "rw_67.jsonl", "id": 60495, "text": "1., must be established or performed according to your requirements;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The collection and use information necessary for the contract according to your requirements is required to solicit authorization."}
{"task": "rw_67.jsonl", "id": 60496, "text": "2. In order to fulfill the statutory responsibility or statutory obligations such as national security, defense security, criminal investigation, prosecution, trial, and judgment implementation with national security, national security, national security, national defense security, national investigation, prosecution, trial and judgment implementation;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to fulfill the statutory duties or the collection and usage information necessary for the statutory volunteer, there is no need to solicit authorization consent."}
{"task": "rw_67.jsonl", "id": 60497, "text": "3. In order to cope with emergencies, or in urgent situations to protect the health and property safety of natural people;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to cope with emergencies, or in urgent cases to protect the life and health of natural persons and the necessary collection and use information, no need to solicit authorization."}
{"task": "rw_67.jsonl", "id": 60498, "text": "4. Implement news reports and public opinion supervision for public interests, and handle personal information within a reasonable range;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to implement news reports and public opinion supervision, deal with personal information within a reasonable scope without soliciting authorization consent."}
{"task": "rw_67.jsonl", "id": 60499, "text": "5. To deal with your own personal information within a reasonable range, or other legal information that has been legal (such as legal news reports, government information disclosure and other channels to legal public information);", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In accordance with laws and regulations, personal information is processed by individuals or other legal disclosure within a reasonable range, and no authorization consent is required."}
{"task": "rw_67.jsonl", "id": 60500, "text": "6. Other circumstances stipulated in laws and regulations.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Other collection and use information stipulated in laws and regulations does not need to solicit authorization."}
{"task": "rw_67.jsonl", "id": 60501, "text": "Special explanation: According to the law, if the information cannot be separated or combined with other information to identify specific individuals, it does not belong to personal information.", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60502, "text": "When your information can be identified alone or in combination with other information, or we use the combination of data that is not connected with any specific individuals with your personal information, we will use it as your personal information and according to this privacy policyTreatment and protection.", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60503, "text": "2. How do we save your personal information", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60504, "text": "We will preserve your personal information within the shortest storage period required by the privacy policy, unless the laws and regulations have other provisions, or you can separate the storage period to us.", "label": ["Data Retention", "Important"], "rewrite": "Generally, your personal information is retained within the time limit required to achieve service purposes, unless the law requires other requirements, or you can authorize separately."}
{"task": "rw_67.jsonl", "id": 60505, "text": "After the previous period expires, we will delete or treat your personal information.", "label": ["Data Retention", "Important"], "rewrite": "After exceeding the storage period, your personal information will be deleted or anonymous."}
{"task": "rw_67.jsonl", "id": 60506, "text": "We save your personal information in China.", "label": ["Data Retention", "Important"], "rewrite": "Your personal information is preserved in China."}
{"task": "rw_67.jsonl", "id": 60507, "text": "If you want to transmit your personal information abroad, please contact us through support@camscanner.com, and we will comply with relevant laws and regulations for processing.", "label": ["Important", "Edit/Control"], "rewrite": "If you want to transmit your personal information abroad, please contact us through support@camscanner.com."}
{"task": "rw_67.jsonl", "id": 60508, "text": "3. How can we share, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60509, "text": "1. Sharing", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60510, "text": "You agree that we provide services to you to support us, and we provide a third party that supports us with service integration or access to you (see [third -party list] or [third -party information data sharing list]) Share youPersonal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You agree to share your personal information to the related parties and third parties to the service for you."}
{"task": "rw_67.jsonl", "id": 60511, "text": "These supports include providing us with infrastructure technical services, payment services, and data processing. The affiliated parties that support our functions have no right to use your personal information for other purposes that have nothing to do with the purpose of this privacy policy;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The affiliated parties have no right to use your personal information for other purposes that have nothing to do with the purpose of the purpose."}
{"task": "rw_67.jsonl", "id": 60512, "text": "If they want to change the purpose of personal information, they will obtain another authorized consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you want to change the purpose of personal information, related parties or third parties will obtain your authorization consent separately."}
{"task": "rw_67.jsonl", "id": 60513, "text": "Except for the third parties with a clear affiliate and this privacy policy, we will not share your personal information with other parties. If we need to share your personal information with other parties, we will solicit your consent separately.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you need to share your personal information with other prescriptions, you will consider your consent."}
{"task": "rw_67.jsonl", "id": 60514, "text": "2. Transfer", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60515, "text": "We will not transfer your personal information to any company, organization and individual, but when involving mergers, acquisitions or bankruptcy liquidation, if you involve personal information transfer, we will inform you and ask you to hold your personal informationThe companies and organizations continue to be subject to this personal information protection policy, otherwise we will ask the company and the organization to reconcile your authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When involving mergers, acquisitions, or bankruptcy liquidation, if personal information transfer is involved, it will be required to continue to be bound by the policy, otherwise it will request that it will re -solicit authorization consent."}
{"task": "rw_67.jsonl", "id": 60516, "text": "3. Public disclosure", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60517, "text": "We will only publicize your personal information only when we obtain your clear consent, or based on the legal requirements of the law, or the legal requirements of the administrative organs or judicial organs.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only publicize your personal information only when we obtain your clear consent, or based on the legal requirements of the law, or the legal requirements of the administrative organs or judicial organs."}
{"task": "rw_67.jsonl", "id": 60518, "text": "In accordance with the requirements of the law and the requirements of administrative organs or judicial organs, we must provide your personal information, and we may disclose your personal information according to the types and disclosure methods required.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you provide your personal information in accordance with the requirements of the law and the requirements of administrative organs or judicial organs, disclosure will be publicly disclosed in accordance with the types of personal information and disclosure required."}
{"task": "rw_67.jsonl", "id": 60519, "text": "Under the premise of compliance with the law, when we receive the requirements of the above disclosure information, we will require a corresponding legal document, such as a subpoena or an investigation letter.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When we receive the requirements of the above disclosure information, we must be required to issue corresponding legal documents."}
{"task": "rw_67.jsonl", "id": 60520, "text": "We will carefully review all requirements to ensure that it has a legal basis, and is limited to data obtained by law enforcement agencies for specific investigation purposes and legal power obtained.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "It is limited to the law enforcement department because of the purpose of specific investigations and has legal power to obtain data."}
{"task": "rw_67.jsonl", "id": 60521, "text": "4. How do we use cookie technology", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60522, "text": "1. When you use the scanning Almighty King website, get a easier access experience for you, we will store small data files named Cookie on your terminal device.", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60523, "text": "Cookie usually contains identifiers, site names, and some numbers and characters.", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60524, "text": "With the help of cookies, the website can store your login record.", "label": ["Important", "First Party Collection Information"], "rewrite": "With the help of cookies, the website can store your login record."}
{"task": "rw_67.jsonl", "id": 60525, "text": "We send you cookies to simplify your repeated login steps.", "label": ["Important", "Usage"], "rewrite": "Cookie can help you simplify your login steps."}
{"task": "rw_67.jsonl", "id": 60526, "text": "2. We will not use Cookie for any purpose except the purpose of this privacy policy.", "label": ["Usage"], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60527, "text": "You can manage or delete Cookies according to your preferences.", "label": ["Important", "Edit/Control"], "rewrite": "You can manage or delete Cookies according to your preferences."}
{"task": "rw_67.jsonl", "id": 60528, "text": "For details, see https://www.aboutcookies.org/.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60529, "text": "You can remove all the cookies saved on the computer, and most of the network browsers have the functions of stopping, cookies, and the functions.", "label": ["Important", "Edit/Control"], "rewrite": "You can remove all the cookies saved on the computer through the browser."}
{"task": "rw_67.jsonl", "id": 60530, "text": "But if you do this, you need to change the user settings when you visit our website, and the corresponding information you recorded before will be deleted, and it may have a certain impact on the security of the services you use.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60531, "text": "To learn more about how to change the browser settings in detail, visit the related setting page of the browser you use.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60532, "text": "5. How to get your personal information of third -party products or services", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60533, "text": "You agree and understand that in order to better provide services, our products may integrate or access third -party services, including SDK, API or H5.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You agree with our product integration or access to third -party services."}
{"task": "rw_67.jsonl", "id": 60534, "text": "To make you better understand the type and access method of third -party services, you can view [third -party list] or [third -party information and data sharing list] to further understand.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You can view [third -party list] or [third -party information and data sharing list] for further understanding."}
{"task": "rw_67.jsonl", "id": 60535, "text": "6. How do we protect your personal information", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60536, "text": "We attach great importance to the security of user personal information.", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60537, "text": "To this end, we have adopted industry -through data protection technology and management measures, such as network isolation, data encryption, access control, identity verification, malicious code prevention, security audit and other measures.", "label": ["Important", "Data Security"], "rewrite": "Adopt measures such as network isolation, data encryption, access control, identity verification, malicious code prevention, security audit and other measures to protect your personal information."}
{"task": "rw_67.jsonl", "id": 60538, "text": "Please know that although we have taken reasonable measures to protect your information in accordance with the law, it is absolutely secure without any system or network.", "label": ["Important", "Data Security"], "rewrite": "Although there are security measures, it is impossible to fully guarantee that there is no security problem."}
{"task": "rw_67.jsonl", "id": 60539, "text": "If our physical, technical, or management protection facilities are damaged, the information is caused by unauthorized access, public disclosure, tampering, or destruction, resulting in damage to your legitimate rights and interests. We will bear responsibility within the scope of the law.We will do our best to investigate the legal responsibility of the infringer, and hope that you will work hard to cooperate with our work.", "label": ["Important", "Data Security"], "rewrite": "If our physical, technical, or management protection facilities are damaged, the information is caused by unauthorized access, public disclosure, tampering or destruction, which will cause your legitimate rights and interests to be damaged, and we will bear the corresponding legal responsibility."}
{"task": "rw_67.jsonl", "id": 60540, "text": "After unfortunately a personal information security incident, we will inform you in accordance with the requirements of the laws and regulations: the basic situation and possible impact of the security incident, the disposal measures we have taken or we will take, the suggestions that you can prevent and reduce the risk,Remedy for your remedy.", "label": ["Important", "Data Security"], "rewrite": "If a personal information security incident occurs, we will inform your basic situation, possible impact, disposal measures, independent prevention suggestions, etc."}
{"task": "rw_67.jsonl", "id": 60541, "text": "In the event related to the incident, we will inform you in the form of mail, letter, telephone, push notification, etc. When it is difficult to inform the subject of personal information one by one, we will publish an announcement in a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "It is difficult to inform personal information by mail, letter, telephone, and push notification one by one, and will publish an announcement in a reasonable and effective way"}
{"task": "rw_67.jsonl", "id": 60542, "text": "At the same time, we will also report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "The disposal of personal information security incidents will be reported in accordance with the requirements of the regulatory authorities."}
{"task": "rw_67.jsonl", "id": 60543, "text": "Our personal information security responsibility department is the [Information Security Committee], the contact phone number is 4006083063, and the mailbox is support@camscanner.com.", "label": ["Important", "Contact Information"], "rewrite": "The personal information security responsibility department is the [Information Security Commission], the contact phone number is 4006083063, and the mailbox is support@camscanner.com."}
{"task": "rw_67.jsonl", "id": 60544, "text": "7. How do you manage your personal information", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60545, "text": "During your use of scanning Almighty King, you can access, correct, delete your personal information, and exercise the scope of changing authorization consent and the right to cancel the account. Your opinion will be dealt with in time.", "label": ["Important", "Edit/Control"], "rewrite": "You can access, correct, delete your personal information, and exercise the right to change the scope of authorization and cancel your account."}
{"task": "rw_67.jsonl", "id": 60546, "text": "1. Visit your personal information", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60547, "text": "You have the right to access your personal information, except for the exception stipulated in laws and regulations.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60548, "text": "If you want to exercise data access rights, you can access it through [Mine]-[Account].", "label": ["Important", "Edit/Control"], "rewrite": "You can exercise the right to access by [Mine]-[Account]."}
{"task": "rw_67.jsonl", "id": 60549, "text": "If you can't access your personal information by yourself, please contact customer service for access, and we will deal with it within the 15 working days that receive the request.", "label": ["Important", "Edit/Control"], "rewrite": "If you can't access your personal information by yourself, please contact customer service for access."}
{"task": "rw_67.jsonl", "id": 60550, "text": "2. Correct your personal information", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60551, "text": "When you find that we have a mistake on your personal information, you have the right to ask us to make corrections.", "label": ["Edit/Control", "Important"], "rewrite": "You have the right to ask us to correct the wrong personal information."}
{"task": "rw_67.jsonl", "id": 60552, "text": "You can correct it by yourself through [Mine]-[Account]. You can also contact the customer service to ask us to correct it. We will deal with it within the 15 working days when we receive the request.", "label": ["Important", "Edit/Control"], "rewrite": "You can correct it by yourself through the [Mine]-[Account] page, or contact customer service to correct it."}
{"task": "rw_67.jsonl", "id": 60553, "text": "3. Update your personal information", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60554, "text": "You have the right to update your personal information.", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60555, "text": "If you need to change the mobile phone number, WeChat code, mailbox, and password binding of account numbers, please change or contact customer service to change through the [My]-[Account] page.deal with.", "label": ["Important", "Edit/Control"], "rewrite": "Please change or contact customer service to change your account number binding mobile phone number, WeChat code, mailbox, and password through [Mine]-[Account] page."}
{"task": "rw_67.jsonl", "id": 60556, "text": "4. Delete your personal information", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60557, "text": "For your personal information in your upload scan file, you can select the scan file you want to delete through the [Document] page.", "label": ["Important", "Edit/Control"], "rewrite": "You can select the scan file you want to delete through the [Document] page."}
{"task": "rw_67.jsonl", "id": 60558, "text": "If you cannot delete your personal information by yourself, please contact customer service to delete it, and we will process it within the 15 working days when you receive the request.", "label": ["Edit/Control", "Important"], "rewrite": "If you can't delete your personal information by yourself, please contact customer service to delete."}
{"task": "rw_67.jsonl", "id": 60559, "text": "In the following circumstances, you can make a request to delete personal information to us, but except for anonymous treatment or other regulations: except:", "label": ["Edit/Control", "Important"], "rewrite": "In the following circumstances, you can make a request to delete personal information to us, but except for anonymous treatment or other regulations: except:"}
{"task": "rw_67.jsonl", "id": 60560, "text": "(1), we violate laws and regulations or collect and use personal information with your agreement;", "label": ["Important", "Edit/Control"], "rewrite": "We can ask for deletion in violation of laws and regulations or collecting personal information with your agreement."}
{"task": "rw_67.jsonl", "id": 60561, "text": "(2) In violation of laws and regulations or sharing or transfer your personal information with your agreement with your agreement, we will immediately stop sharing and transfer behavior, and notify the third parties to delete it in time;", "label": ["Important", "Edit/Control"], "rewrite": "We violate laws and regulations or share or transfer your personal information with your agreement with your agreement. We will immediately stop sharing and transfer behaviors and notify third parties to delete them in time."}
{"task": "rw_67.jsonl", "id": 60562, "text": "(3) In violation of laws and regulations, we will publicly disclose your personal information, and we will immediately stop public disclosure and issue notifications to request the relevant receiver to delete the corresponding information;", "label": ["Important", "Edit/Control"], "rewrite": "We violate the provisions of laws and regulations or to disclose your personal information publicly, and we will immediately stop the public disclosure behavior and issue a notice to require the relevant receiver to delete the corresponding information."}
{"task": "rw_67.jsonl", "id": 60563, "text": "(4) You no longer use our products or services, or you cancel your account, or we terminate the service and operation.", "label": ["Important", "Edit/Control"], "rewrite": "You no longer use our products or services, or if you cancel your account, or we terminate the service and operation, you can ask for deletion."}
{"task": "rw_67.jsonl", "id": 60564, "text": "If we decide to respond to your deletion request, we will also inform the entities that obtain your personal information in accordance with the provisions of laws, regulations and standard documents, and request them to delete them in time. Unless laws and regulations have other provisions, or these entities will obtain you to youIndependent authorization.", "label": ["Important", "Edit/Control"], "rewrite": "If we decide to respond to your deletion request, we will notify the entity that obtains your personal information in time, unless the laws and regulations have other provisions, or your independent authorization."}
{"task": "rw_67.jsonl", "id": 60565, "text": "When you delete the information from our services, we may not immediately delete the corresponding information in the backup system, but will delete these information when the backup is updated.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "After you delete the information from our service, the information in the backup system will be deleted during update."}
{"task": "rw_67.jsonl", "id": 60566, "text": "5. Change the scope of your authorization consent", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60567, "text": "If you need to change the scope of the device authority that we have authorized, you can click [My]-[More Settings]-[Permanent Management] through the app to add or withdraw the authority.", "label": ["Important", "Edit/Control"], "rewrite": "You can click [Mine]-[More Settings]-[Permanent Management] to add or withdraw the authorized permissions through the app."}
{"task": "rw_67.jsonl", "id": 60568, "text": "If you need to withdraw the authorization of the privacy policy, you can withdraw your authorization by clicking [Mine]-[Privacy Settings]-[Cancellation of Privacy Policy and User Agreement] to withdraw your authorization.", "label": ["Important", "Edit/Control"], "rewrite": "You can withdraw your authorization by clicking [Mine]-[Privacy Settings]-[Rejuvenation of Privacy Policy and User Agreement] Withdrawing your authorization."}
{"task": "rw_67.jsonl", "id": 60569, "text": "You can also contact us through the way stated in this privacy policy to change the scope of consent or withdraw your authorization. We will deal with it within the 15 working days when we receive the request.", "label": ["Important", "Edit/Control"], "rewrite": "You can contact us to change the scope of consent or withdraw your authorization."}
{"task": "rw_67.jsonl", "id": 60570, "text": "Please understand that scanning all -round king may need to open part of the authority and collect the necessary personal information to achieve part of the service.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60571, "text": "When you withdraw your consent, we will not be able to continue to provide you with the service corresponding to the withdrawal consent, but it will not affect the personal information processing service that has been carried out based on your authorization.", "label": ["Important", "Edit/Control"], "rewrite": "Withdrawal authorization will not affect personal information processing services that were previously authorized."}
{"task": "rw_67.jsonl", "id": 60572, "text": "6. Logging out the account", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60573, "text": "You can use [Mine]-[Account]-Click [Nickname]/[Add Nickname]-Click [Permanent Logging out of the Account] on the bottom of the page to apply for a cancellation of your account.", "label": ["Important", "Edit/Control"], "rewrite": "You can use [Mine]-[Account]-Click [Nickname]/[Add Nickname]-Click [Permanent Logging up the Account] at the bottom of the page to apply for a cancellation of your account."}
{"task": "rw_67.jsonl", "id": 60574, "text": "If you need to cancel your account, please make sure that the contents of all documents, folders and document conversion records have been deleted, otherwise you may not be able to cancel.", "label": ["Important", "Edit/Control"], "rewrite": "Logging out the account must ensure that all documents, folders and document conversion records have been deleted."}
{"task": "rw_67.jsonl", "id": 60575, "text": "If you have any questions, please contact us in the following way.", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60576, "text": "We will handle it within the 15 working days when they receive the request.", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60577, "text": "Customer Service Tel: 4006083063", "label": ["Important", "Contact Information"], "rewrite": "Customer Service Tel: 4006083063"}
{"task": "rw_67.jsonl", "id": 60578, "text": "Customer service mailbox: support@camscanner.com", "label": ["Important", "Contact Information"], "rewrite": "Customer service mailbox: support@camscanner.com"}
{"task": "rw_67.jsonl", "id": 60579, "text": "Your behavior of canceling the above account is irreversible. We will stop providing you with products or services, no longer collect your personal information, and delete personal information related to your account according to your requirements or do it anonymous processing, but laws and regulationsOther regulations or regulatory departments except other requirements.", "label": ["Edit/Control", "Important"], "rewrite": "Once canceled, it will stop providing products or services, no longer collect information, and delete or anonymous operations on your personal information."}
{"task": "rw_67.jsonl", "id": 60580, "text": "7. Get personal information copy", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60581, "text": "You can contact us through the way stated in this privacy policy to obtain your personal information copy, and we will handle it within the 15 working days when we receive the request.", "label": ["Important", "Edit/Control"], "rewrite": "You can contact us to get your personal information copy."}
{"task": "rw_67.jsonl", "id": 60582, "text": "Customer Service Tel: 4006083063", "label": ["Important", "Contact Information"], "rewrite": "Customer Service Tel: 4006083063"}
{"task": "rw_67.jsonl", "id": 60583, "text": "Customer service mailbox: support@camscanner.com", "label": ["Important", "Contact Information"], "rewrite": "Customer service mailbox: support@camscanner.com"}
{"task": "rw_67.jsonl", "id": 60584, "text": "8. Automatic decision -making results appeal", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60585, "text": "In certain business functions, we may make decisions only based on the non -artificial automatic decision mechanism, including the information system and algorithm.", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60586, "text": "If these decisions significantly affect your legitimate rights and interests, you have the right to contact us through the way stated by this privacy policy to require us Treatment within working days.", "label": ["Edit/Control", "Important"], "rewrite": "If non -manual automatic decision -making affects your legitimate rights and interests, you have the right to ask us to explain or complain about the results of the automatic decision -making of the information system."}
{"task": "rw_67.jsonl", "id": 60587, "text": "Customer Service Tel: 4006083063", "label": ["Important", "Contact Information"], "rewrite": "Customer Service Tel: 4006083063"}
{"task": "rw_67.jsonl", "id": 60588, "text": "Customer service mailbox: support@camscanner.com", "label": ["Important", "Contact Information"], "rewrite": "Customer service mailbox: support@camscanner.com"}
{"task": "rw_67.jsonl", "id": 60589, "text": "9. respond to your above request", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60590, "text": "If you cannot exercise your rights in the above way, you can use the contact information stated by this privacy policy to contact us.", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60591, "text": "To ensure safety, you may need to provide a written request or prove your identity in other ways.", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "When you contact us, you may need to provide a written request or prove your identity in other ways."}
{"task": "rw_67.jsonl", "id": 60592, "text": "We may ask you to verify your identity first, and then process your request.", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "We may ask you to verify your identity first, and then process your request."}
{"task": "rw_67.jsonl", "id": 60593, "text": "We will handle it within the 15 working days when they receive the request.", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60594, "text": "For your reasonable request, we do not charge fees in principle, but we will charge a certain cost fee as appropriate for repeated and more reasonable requests.", "label": ["Important", "Edit/Control"], "rewrite": "Reasonable requests are not charged in principle without charging and exceeding the reasonable limit."}
{"task": "rw_67.jsonl", "id": 60595, "text": "We may refuse to reject those who have no repetition, need too much technical means, bring risks or very unrealistic requests to others.", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "We may refuse to repeat for unseen, need too much technical means, bring risks or very unrealistic requests to others' legitimate rights and interests."}
{"task": "rw_67.jsonl", "id": 60596, "text": "If your request is rejected, we will tell you the reason, you can complain through the contact information stated by this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60597, "text": "10. The exception of response situation", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60598, "text": "In the following circumstances, we will not be able to respond to your request:", "label": ["Important", "Edit/Control"], "rewrite": "In the following circumstances, we will not be able to respond to your request:"}
{"task": "rw_67.jsonl", "id": 60599, "text": "(1), related to the obligations stipulated by our performance and regulations;", "label": ["Important", "Edit/Control"], "rewrite": "If your request is related to the obligations stipulated in our laws and regulations, it may not be responding."}
{"task": "rw_67.jsonl", "id": 60600, "text": "(2), directly related to national security and national defense security;", "label": ["Edit/Control", "Important"], "rewrite": "If your request is directly related to national security and national defense security, you may not be responded."}
{"task": "rw_67.jsonl", "id": 60601, "text": "(3) directly related to public safety, public health, and major public interests;", "label": ["Important", "Edit/Control"], "rewrite": "Your request is directly related to public safety, public health, and major public interests and may not be responded."}
{"task": "rw_67.jsonl", "id": 60602, "text": "(4) Directly related to criminal investigation, prosecution, trial, and execution judgment;", "label": ["Important", "Edit/Control"], "rewrite": "Your request is related to criminal investigation, prosecution, and trial, and may not be responded."}
{"task": "rw_67.jsonl", "id": 60603, "text": "(5), we have sufficient evidence to indicate that the subject of personal information has subjective malice or abuse of rights;", "label": ["Important", "Edit/Control"], "rewrite": "If we have sufficient evidence that the subject of personal information has subjective malicious or abuse of rights, it may refuse to respond."}
{"task": "rw_67.jsonl", "id": 60604, "text": "(6) For the major legitimate rights and interests of the lives and property of the subject of personal information or other individuals, it is difficult to get my consent;", "label": ["Important", "Edit/Control"], "rewrite": "Out of the major legitimate rights and interests of the life and property of personal information subjects or other individuals, but it is difficult to get my consent, we may not be able to respond to the request."}
{"task": "rw_67.jsonl", "id": 60605, "text": "(7) In response to the request of the subject of personal information, the legitimate rights and interests of the personal information subject or other individuals and organizations will be severely damaged;", "label": ["Important", "Edit/Control"], "rewrite": "We may not be able to respond to requests that exceed the storage range, exceed the reasonable limit, or the legitimate rights and interests of personal information subjects or other individuals and organizations will be seriously damaged."}
{"task": "rw_67.jsonl", "id": 60606, "text": "(8), involved business secrets.", "label": ["Important", "Edit/Control"], "rewrite": "We may not be able to respond."}
{"task": "rw_67.jsonl", "id": 60607, "text": "8. How do we deal with the personal information of minors", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60608, "text": "Our products or services are mainly for adults (that is, over 18 years of age). In the process of providing products or services, we presumed that you have the corresponding civil behavior capabilities.", "label": ["Specific Audiences", "Important"], "rewrite": "Our products or services are mainly for adults. In the process of providing products or services, it is presumed that you have the corresponding civil behavior capabilities."}
{"task": "rw_67.jsonl", "id": 60609, "text": "If you are minors (that is, under the age of 18, the same below), we ask you to ask your parents or other guardians to read the privacy policy carefully and use us on the premise that your parents or other guardians agreeService or information to us.", "label": ["Specific Audiences", "Important"], "rewrite": "Minors under the age of 18 should obtain the consent of the guardian before use."}
{"task": "rw_67.jsonl", "id": 60610, "text": "If you are the legal guardian of the minor, please pay attention to whether the minors you are monitoring use our products or services after obtaining your authorization consent.", "label": ["Specific Audiences", "Important"], "rewrite": "The legal guardian is requested to use the service after obtaining your authorization consent."}
{"task": "rw_67.jsonl", "id": 60611, "text": "If you have doubts about the personal information of the minors you monitor, please contact us through the way stated in this privacy policy.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60612, "text": "In particular, if you are a child (that is, at the age of 14, the same below), in order to protect the personal information of children, we have also released the \"Guidelines for Scanning the Privacy of Children in Almighty King\".", "label": ["Specific Audiences", "Important"], "rewrite": "In order to protect the personal information of children (that is, under 14 years old), we issued the \"Guidelines for Scanning Almighty King Children's Privacy Protection\"."}
{"task": "rw_67.jsonl", "id": 60613, "text": "Before you use our products or services, you and your guardians should also read the \"Guidelines for Scanning Almighty Privacy Privacy Protection Protection\" carefully.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60614, "text": "You can use our products or services only after obtaining the consent of the guardian's guidance of the \"Privacy Protection Protection Protection of King Children\".", "label": ["Specific Audiences", "Important"], "rewrite": "Only after obtaining the consent of the guardian's guidance of the \"Privacy Protection Protection of Children in the King\", children can use products or services."}
{"task": "rw_67.jsonl", "id": 60615, "text": "9. How can your personal information be transferred globally", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60616, "text": "In principle, we collect and process your personal information in the country will also save your personal information in China.", "label": ["Data Retention", "Important"], "rewrite": "In principle, collect and process and save your personal information in China."}
{"task": "rw_67.jsonl", "id": 60617, "text": "Because we provide products and services all over the world's resources and servers, this means that after obtaining your authorization consent, your personal information may be transferred to other judicial jurisdictions of your country/region where your products or services are located.Or are accessed by these jurisdictions.", "label": ["Data Retention", "Important", "Risk"], "rewrite": "After getting your authorization consent, your personal information may be transferred to the country/region where the product or service is located, or it is accessed by these jurisdictions."}
{"task": "rw_67.jsonl", "id": 60618, "text": "Such judicial jurisdictions may have different data protection laws, and no relevant laws are set up.", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60619, "text": "In such circumstances, we will ensure that your personal information gets sufficient and equal protection for all applicable laws and regulations.", "label": ["Important", "Data Security"], "rewrite": "We will ensure that your personal information is sufficient and equally protected overseas."}
{"task": "rw_67.jsonl", "id": 60620, "text": "For example, we will ask for security measures such as the consent of cross -border transfer of personal information or implementing data anonymous data before cross -border transfer.", "label": ["Important", "Data Security"], "rewrite": "We will ask you to agree to cross -border transfer of personal information or implement security measures before cross -border transfer."}
{"task": "rw_67.jsonl", "id": 60621, "text": "10. How to update this privacy policy", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60622, "text": "Our privacy policy may change in time.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60623, "text": "We will post any changes to this privacy policy on this page.", "label": ["Policy Change", "Important"], "rewrite": "Any changes made on this page of privacy policies will be released on this page."}
{"task": "rw_67.jsonl", "id": 60624, "text": "For major changes, we will also provide more significant notifications (we will use pop -up methods to explain the specific changes in privacy policy) and re -obtain your consent.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60625, "text": "Without your clear consent, we will not reduce the rights you should enjoy in accordance with this privacy policy.", "label": ["Policy Change", "Important"], "rewrite": "Without your clear consent, we will not reduce the rights you should enjoy in accordance with this privacy policy."}
{"task": "rw_67.jsonl", "id": 60626, "text": "The major changes referred to this privacy policy include, but not limited to:", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60627, "text": "(1) Our service model has changed significantly (such as the purpose of dealing with personal information, the type of personal information, the use of personal information, etc.); changes in the use of personal information);", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60628, "text": "(2) The main object of personal information sharing, transfer or public disclosure changes;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60629, "text": "(3) The right to participate in personal information processing and its exercise methods have changed significantly;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60630, "text": "(4) We are responsible for the responsibility department, contact methods and complaint channels for handling personal information security;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60631, "text": "(5) Evaluation report on personal information security impact indicates that there is a high risk.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60632, "text": "Eleven, how to contact us", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60633, "text": "If you have any questions, consultations, opinions, suggestions or complaints about the protection of privacy policies or personal information, please contact us in the following ways:", "label": ["Important", "Contact Information"], "rewrite": "Please contact us in the following way:"}
{"task": "rw_67.jsonl", "id": 60634, "text": "Customer Service Tel: 4006083063", "label": ["Important", "Contact Information"], "rewrite": "Customer Service Tel: 4006083063"}
{"task": "rw_67.jsonl", "id": 60635, "text": "Customer service mailbox: support@camscanner.com", "label": ["Important", "Contact Information"], "rewrite": "Customer service mailbox: support@camscanner.com"}
{"task": "rw_67.jsonl", "id": 60636, "text": "We receive your questions, opinions or suggestions, and verify your user identity, and we will reply within 15 working days.", "label": ["Important", "Contact Information"], "rewrite": "We will reply within 15 working days after verifying your user identity."}
{"task": "rw_67.jsonl", "id": 60637, "text": "If you are not satisfied with our response, especially our personal information processing behavior harms your legitimate rights and interests, you can also complain or report to the regulatory authorities such as online information, telecommunications, public security, and industry and commerce.", "label": [], "rewrite": []}
{"task": "rw_67.jsonl", "id": 60638, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
