{"task": "rw_64.jsonl", "id": 60133, "text": "Tencent Music Entertainment Group (TME) privacy policy", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60134, "text": "Overview", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60135, "text": "Tencent Music Entertainment Group (hereinafter referred to as \"TME\") depends on user information security and privacy protection as its own \"lifeline\".", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60136, "text": "We adhere to the concept of \"all user values are based on\", and we are committed to improving the transparency of information processing, enhancing your convenience of information management, and ensuring your information and communication security.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60137, "text": "TME strictly abides by relevant laws and regulations, follow the following principles of privacy protection to provide you with more secure and reliable services:", "label": ["Data Security"], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60138, "text": "· Safe and reliable: We do our best to prevent your information from being leaked, damaged, or lost through reasonable and effective information security technology and management processes.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60139, "text": "· Autonomous choice: We provide you with convenient information management options so that you can make appropriate choices and manage your personal information.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60140, "text": "· Protecting communication secrets: We strictly follow laws and regulations, protect your communication secrets, and provide you with secure communication services.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60141, "text": "· Reasonable necessity: In order to provide better services to you and other users, we only collect the necessary information.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60142, "text": "· Clear and transparent: We strive to use simple and easy -to -understand expressions to introduce you privacy policies in order to clearly understand our information processing methods.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60143, "text": "· Incorporate privacy protection into product design: We are integrated into the concept of privacy protection in all aspects of product or service development, comprehensive law, product, design and other factors.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60144, "text": "This \"Tencent Music Entertainment Group (TME) Privacy Policy\" (hereinafter referred to as \"this policy\") mainly explains what information we collect, the purpose of our collection information, and the rights you enjoy.", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60145, "text": "I hope you can read this policy carefully and learn more about our collection and use of information in order to better understand our products or services and make appropriate choices.", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60146, "text": "This policy will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60147, "text": "1. What necessary information do we collect", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60148, "text": "2. How do we use collected information", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60149, "text": "3. How do we use cookie and related technologies", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60150, "text": "4. The information you share", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60151, "text": "5. How do you manage your information", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60152, "text": "6. The information we share", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60153, "text": "7. The information we may send to you", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60154, "text": "8. The location and period of storage information", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60155, "text": "9. Information security", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60156, "text": "10. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60157, "text": "11. Scope of application", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60158, "text": "12. Contact us", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60159, "text": "13. Change", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60160, "text": "If you use it, TME's products or services, it means you agree with what we described in this policy.", "label": ["Policy Change", "Important", "Risk"], "rewrite": "If you use TME's products or services, it means that you agree with this policy."}
{"task": "rw_64.jsonl", "id": 60161, "text": "If you or your guardian does not agree with any content of this policy, you should stop using it immediately.", "label": ["Policy Change", "Important"], "rewrite": "If you or your guardian does not agree with any content of this policy, you should stop using it immediately."}
{"task": "rw_64.jsonl", "id": 60162, "text": "If you have any questions, please contact us.", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60163, "text": "The first part of the relevant definition", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60164, "text": "Phone number, etc.", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60165, "text": "Personal sensitive information: It refers to personal information such as leakage, illegal provision or abuse that may endanger people's body and property, which can easily lead to personal information that causes personal reputation, physical and mental health, or discriminatory treatment.", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60166, "text": "For example, personal sensitive information includes identity documents, personal biometric information, bank accounts, communication content, health and physiological information, etc.", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60167, "text": "Equipment: It refers to a device that can be used to access the TME service, such as desktop computers, laptops, tablet computers or smartphones.", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60168, "text": "The only device identifier (exclusive ID or UUID): refers to a string of characters in the device from the device manufacturer, which can be used to identify the corresponding device in a unique way (such as the IMEI number of the mobile phone).", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60169, "text": "The only device identifier has a variety of uses, which can be used to provide advertisements when COOKIES (eg is in mobile applications).", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60170, "text": "Cookie: It is a neutral technology that allows website server to store data on the client or read data from the client.", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60171, "text": "The Cookie file is a file with information related to the user's access to the website. The format is .txt.", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60172, "text": "Cookie content is usually encrypted.", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60173, "text": "Safe Cookie technology will provide users with more convenient services when surfing the Internet.", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60174, "text": "IP address: Each internet device specifies a number called the Internet protocol (IP) address.", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60175, "text": "These numbers are usually specified according to geographical areas.", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60176, "text": "IP addresses can usually be used to identify the location where device is connected to the Internet.", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60177, "text": "GPS: The abbreviation of Global Positioning System (Global Positioning System).", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60178, "text": "The GPS signal receiver on the device you use can receive the signal from the GPS satellite and use the information to calculate your location.", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60179, "text": "WiFi: Wi-Fi is a technology that allows electronic devices to connect to a wireless LAN (WLAN), which is usually what we call wireless networks.", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60180, "text": "Base station: That is, public mobile communication base stations are a form of radio station station. It refers to a radio receipt of information transmission between information transmission between the mobile phone terminal through a mobile communication exchange center in a certain radio coverage area.", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60181, "text": "TLS: TLS (Transport Layer Security), also known as a security transmission layer protocol, consists of TLS Record and TLS Handshake for providing confidentiality and data completeness between two communication applications.Essence", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60182, "text": "SSL: SSL (Secure Socket Layer), also known as convergence, is a security protocol implemented on the transmission communication protocol (TCP/IP).", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60183, "text": "SSL supports various types of networks, and also provides three basic security services. Both use public key and symmetrical key technology to achieve the effect of information confidentiality.", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60184, "text": "Information collection technology: The \"Automatic Collection\" described in the Privacy Policy in Tencent Music Entertainment Group (TME) includes the following ways:", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60185, "text": "(1) Cookie (cookie file)", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60186, "text": "Cookie is a small text file in the client (your computer, mobile phone, or other smart terminals) when you browse the web. It can be used to improve your experience.", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60187, "text": "(2) Web Beacon (network beacon)", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60188, "text": "Web Beacon is an electronic image file case or other technologies embedded in the website or email. It can be used to calculate the number of visitors, record whether you read emails or websites, or use some cookies.", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60189, "text": "(3) Log Files (Log File)", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60190, "text": "Several data for automatic collection of LOG FILES storage.", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60191, "text": "These data include the Internet protocol (IP) address, browser type, Internet service provider (ISP), reference /exit page, operating system, date /time stamp, and click stream data.", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60192, "text": "(4) ET TAG (physical tag)", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60193, "text": "ET TAG is the HTTP protocol header that is transmitted behind the Internet browse and the Internet server, which can replace Cookie to track individual users, so that we can understand and improve our services more deeply.", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60194, "text": "(5)JavaScript", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60195, "text": "JavaScript is a programming language for making more interactive and dynamic web pages.", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60196, "text": "JavaScript can set cookies, read cookies, and delete cookies.", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60197, "text": "Related Company: Refers to the operator of Tencent Music Entertainment Group (TME) and other products of the company or other companies that are related to TME.Entertainment (Shenzhen) Co., Ltd., Guangzhou Cool Dog Computer Technology Co., Ltd., Beijing Kuwu Technology Co., Ltd., Shenzhen Tencent Computer System Co., Ltd., etc.).", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60198, "text": "\"Related relationship\" refers to the subject (including individuals, companies, organizations, or other entities), which is directly or indirectly controlled by the subject, or the subject that is directly or indirectly controlled, or directly or indirectly as the same subject.Control subject.", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60199, "text": "The aforementioned \"control\" refers to the power or other relationships that directly or indirectly have the power or other relationships that have instructed others by holding voting rights, contracts or other methods to directly or indirectly have other relationships that instructions or instructions that to make instructions.", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60200, "text": "Products or services: Refers to the platforms or products of Tencent Music Entertainment Group (TME) (including QQ music, cool dog music, cool me music, national K song, cool dog live broadcast, Cool me Julxing, Tencent musician, 5SING and othersThe products or services provided by TME), applications, clients, services and tools.", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60201, "text": "Part II Terms of Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60202, "text": "1. What necessary information do we collect", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60203, "text": "Based on the principles of legal, correctness, and necessary, we only collect the need to implement the product function, information.", "label": ["Important", "Data Security"], "rewrite": "According to the principles of legal, legitimate, and necessary, we only collect information necessary for the implementation of product functions."}
{"task": "rw_64.jsonl", "id": 60204, "text": "1.1 The information you actively provided when using our product or service", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60205, "text": "1.1.1, the information you fill in when you register or log in.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the information you filled in when you register or log in."}
{"task": "rw_64.jsonl", "id": 60206, "text": "For example, the nicknames and mobile numbers filled in when you use, QQ, WeChat registration or login account.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the nicknames and mobile numbers you filled in when you use QQ, WeChat registration or login account."}
{"task": "rw_64.jsonl", "id": 60207, "text": "1.1.2, information you uploaded when using products or services.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the information you uploaded when you use the product or service."}
{"task": "rw_64.jsonl", "id": 60208, "text": "For example, when you use it, QQ music, the whole people, when you are, the avatars uploaded and shared photos.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your avatars and shared photos when you use QQ Music and National K songs."}
{"task": "rw_64.jsonl", "id": 60209, "text": "1.1.3, the information submitted by our customer service or participating in the activities we organized.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the information you submitted through our customer service or participating in the activities we organized."}
{"task": "rw_64.jsonl", "id": 60210, "text": "For example, you may include information such as your name, telephone, home address and other information in the questionnaire you filled in during our online activities.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the information in the questionnaire you filled in."}
{"task": "rw_64.jsonl", "id": 60211, "text": "Some of our services may require you to provide specific functions to achieve specific functions.", "label": ["Important", "First Party Collection Information"], "rewrite": "Some services may require you to provide specific personal sensitive information to achieve specific functions."}
{"task": "rw_64.jsonl", "id": 60212, "text": "If you choose not to provide such information, you may not be able to use specific functions in the service normally, but it does not affect other functions in your service.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60213, "text": "If you take the initiative to provide your personal sensitive information, it means that you agree that we will process your personal sensitive information according to the purpose and method of this policy.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you take the initiative to provide your personal sensitive information, it means that you agree to process your personal sensitive information according to this policy."}
{"task": "rw_64.jsonl", "id": 60214, "text": "1.2 The information we get when you use the product or service", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60215, "text": "1.2.1 log information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60216, "text": "When you use our products or services, we may automatically collect, related information and store as a service log information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use our products or services, automatically collect relevant information and store service log information."}
{"task": "rw_64.jsonl", "id": 60217, "text": "(1) Equipment information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60218, "text": "For example, equipment models, operating system versions, unique device identifiers, batteries, signal strength and other information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60219, "text": "(2) Software information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60220, "text": "For example, the software version number, browser type.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60221, "text": "To ensure the security of the operating environment or provide services, we will collect information about mobile applications and other software you use.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "Collect information about mobile applications and other software you use to ensure the security of the operating environment or provide services."}
{"task": "rw_64.jsonl", "id": 60222, "text": "(3) IP address.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60223, "text": "(4) Service log information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60224, "text": "For example, you searched, viewed information, service failure information, recommendation website and other information when using our products or services.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use our products or services, collect information such as your search, viewing information, service failure information, and recommendation website."}
{"task": "rw_64.jsonl", "id": 60225, "text": "(5) Communication log information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60226, "text": "For example, you have a communication account, communication time, and duration that you have communicated when using our product or service.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the accounts, communication time and duration of communication when you use your product or service."}
{"task": "rw_64.jsonl", "id": 60227, "text": "1.2.2 Location information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60228, "text": "When you use the service related to the location, we may record the location of your device to provide you with related services.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the location related to the location, you may record the location of your device."}
{"task": "rw_64.jsonl", "id": 60229, "text": "(1), when you use the service, we may pass, pass, IP, address ,,,,,,,,,, or, base stations, etc. to obtain your geographical information;", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the service, your geographical location information may be obtained through IP address, GPS, WiFi or base station."}
{"task": "rw_64.jsonl", "id": 60230, "text": "(2), the information provided by your or other users may include your geographical location information, such as the information that you may contain in the account information you provides, andinformation.", "label": ["Important", "First Party Collection Information"], "rewrite": "The information provided by you or other users when using the service may include your geographic location information."}
{"task": "rw_64.jsonl", "id": 60231, "text": "1.2.3 Other related information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60232, "text": "To help you better use our products or services, we will collect relevant information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60233, "text": "For example, we collected friends list, song list information, and sound lines feature value information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect friends list, song list information, sound lines feature value information to provide you with better services."}
{"task": "rw_64.jsonl", "id": 60234, "text": "In order to ensure that you can contact people you know when using our services, if you choose to enable the function of importing contacts, we may encrypt the names and phone numbers of your contacts and only collect encrypted information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If you choose to turn on the introduction of the address book, you may encrypt and collect your contact name and phone number."}
{"task": "rw_64.jsonl", "id": 60235, "text": "1.3 The information shared by other users contains your information", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60236, "text": "For example, photos or shared videos posted by other users may include your information.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Photos posted or videos shared by other users collected may contain your information."}
{"task": "rw_64.jsonl", "id": 60237, "text": "1.4 Information obtained from third -party partners", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60238, "text": "We may obtain information generated or shared when you use products or services of third-party partners.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may obtain information generated or shared when you use products or services of third-party partners."}
{"task": "rw_64.jsonl", "id": 60239, "text": "For example, when you use a third -party partner product or service with business cooperation with, TME, we will get you through third -party partner products or services, TME services time and place, so that you can manage authorization.", "label": ["Important", "First Party Collection Information"], "rewrite": "Obtain the time and place of your TME service through third -party partners products or services to facilitate your authorization management."}
{"task": "rw_64.jsonl", "id": 60240, "text": "Please read the user agreement or privacy policy of the third -party partner service.", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60241, "text": "2. How do we use collected information", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60242, "text": "We strictly abide by the provisions of laws and regulations and the agreement with users, and use the collected information for the following uses.", "label": ["Usage"], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60243, "text": "If we use your information below, we will explain to you again and obtain your consent.", "label": ["Important", "Usage"], "rewrite": "If we use your information to use your information, we will explain it to you again and obtain your consent."}
{"task": "rw_64.jsonl", "id": 60244, "text": "2.1, to provide services to you.", "label": ["Important", "Usage"], "rewrite": "Use your information to provide you with services."}
{"task": "rw_64.jsonl", "id": 60245, "text": "2.2, meet your personalized needs.", "label": ["Important", "Usage"], "rewrite": "Use your information to meet your personalized needs."}
{"task": "rw_64.jsonl", "id": 60246, "text": "For example, language settings, location settings, and personalized help services.", "label": ["Usage"], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60247, "text": "2.3, product development and service optimization.", "label": ["Important", "Usage"], "rewrite": "Use your information for product development and service optimization."}
{"task": "rw_64.jsonl", "id": 60248, "text": "For example, when our system fails, we will record and analyze the information generated by the system failure to optimize our services.", "label": ["Important", "Usage"], "rewrite": "When our system fails, it will record and analyze the information generated during the system failure to optimize our services."}
{"task": "rw_64.jsonl", "id": 60249, "text": "2.4, security.", "label": ["Important", "Usage"], "rewrite": "Use your information to facilitate security."}
{"task": "rw_64.jsonl", "id": 60250, "text": "For example, we will use your information for authentication, security precautions, anti -fraud monitoring, archive backup, customer security services, etc.", "label": ["Important", "Data Security", "Usage"], "rewrite": "We will use your information for authentication, security precautions, anti -fraud monitoring, archive backup, customer security services, etc."}
{"task": "rw_64.jsonl", "id": 60251, "text": "2.5, recommend advertisements, information, etc. to you may be interested in.", "label": ["Important", "Usage"], "rewrite": "Use your information to recommend advertisements, information, etc. to you that you may be interested in."}
{"task": "rw_64.jsonl", "id": 60252, "text": "For example, we may use your relevant information to provide you with more related advertisements to you on related websites, applications and other channels.", "label": ["Important", "Usage"], "rewrite": "We may use your relevant information to provide you with personalized advertisements on related websites, applications and other channels."}
{"task": "rw_64.jsonl", "id": 60253, "text": "2.6, evaluate and improve the effect of advertising and other promotion and promotion activities.", "label": ["Important", "Usage"], "rewrite": "Use your information assessment and improve the effects of our advertising and other promotions and promotion activities."}
{"task": "rw_64.jsonl", "id": 60254, "text": "2.7, management software.", "label": ["Important", "Usage"], "rewrite": "Use your information to manage software."}
{"task": "rw_64.jsonl", "id": 60255, "text": "For example, software certification, software upgrade, etc.", "label": ["Usage"], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60256, "text": "2.8, invite you to participate in surveys about our services.", "label": ["Important", "Usage"], "rewrite": "Invites you to participate in surveys about our services."}
{"task": "rw_64.jsonl", "id": 60257, "text": "In order to allow you to have a better experience, improve our services or other purposes you agree with, under the premise of compliance with relevant laws and regulations, we may use the information collected by certain services for our other services.", "label": ["Important", "Usage"], "rewrite": "We may use the information collected through certain services for our other services within the scope permitted by laws and regulations."}
{"task": "rw_64.jsonl", "id": 60258, "text": "For example, use information when using our service to show you personalized content or advertisements to you in another service, and for user research and analysis and statistics.", "label": ["Important", "Usage"], "rewrite": "The information of you when using our service to show you personalized content or advertisements to you in another service, and for user research and analysis and statistics."}
{"task": "rw_64.jsonl", "id": 60259, "text": "In order to ensure the security of services and help us better understand the operation of our application, we may record relevant information, for example, you use the frequency, failure information, overall usage conditions, performance data, and the source of the application.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "Record information such as the frequency, fault information, and overall usage of your application to ensure the security of the service."}
{"task": "rw_64.jsonl", "id": 60260, "text": "We will not store the information we store in the analysis software with the personal identity information you provided in the application.", "label": ["Important", "Data Security"], "rewrite": "The information stored in the analysis software will not be combined with the personal identity information you provided in the application."}
{"task": "rw_64.jsonl", "id": 60261, "text": "3. How do we use cookies and related technologies", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60262, "text": "We or our third -party partners may collect your information through safe, cookie, and related technologies to provide you with more personalized user experience and services.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "We or our third -party partners may collect your information by putting safe cookies and related technologies to provide you with personalized services."}
{"task": "rw_64.jsonl", "id": 60263, "text": "We will strictly require third -party partners to abide by the relevant provisions of this policy.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60264, "text": "You can also manage cookies through your browser settings.", "label": ["Edit/Control", "Important"], "rewrite": "You can manage cookies through the browser."}
{"task": "rw_64.jsonl", "id": 60265, "text": "But please note that if Cookie is discontinued, you may not be able to enjoy the best service experience, and certain services may not be used normally.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60266, "text": "4. The information you share", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60267, "text": "You can share your information with your friends, family and other users through our services.", "label": ["Important", "Edit/Control"], "rewrite": "You can share your relevant information with your friends, family and other users."}
{"task": "rw_64.jsonl", "id": 60268, "text": "For example, you publicly shared videos, text and photos in the whole people.", "label": ["Important", "Edit/Control"], "rewrite": "You publicly share videos, text and photos in the national K song."}
{"task": "rw_64.jsonl", "id": 60269, "text": "Please note that this may include sensitive information such as your personal identity information and personal property information.", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60270, "text": "Please consider disclosing your relevant personal sensitive information.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60271, "text": "You can control the scope of your sharing information through the privacy settings in our service. You can also delete the information you shared publicly through the service settings or the guidelines we provide.", "label": ["Edit/Control", "Important"], "rewrite": "You can control the scope of the information through privacy settings, or delete the information you shared through the service settings or guidance."}
{"task": "rw_64.jsonl", "id": 60272, "text": "But please note that this information may still be stored independently by other users or non -associated third parties that are not controlled by us.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "After deleting the information you share, it may still be independently preserved by other users or the third parties that are not controlled by us."}
{"task": "rw_64.jsonl", "id": 60273, "text": "5. How do you manage your information", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60274, "text": "5.1, you can access, modify, and delete the registration information and other personal information in the process of using our services. You can also contact us according to the notice guidelines.", "label": ["Important", "Edit/Control"], "rewrite": "You can access, modify and delete your registration information and other personal information in the process of using our services. You can also contact us according to the notice."}
{"task": "rw_64.jsonl", "id": 60275, "text": "The scope and method of your access, modification and deletion of personal information will depend on the specific services you use.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60276, "text": "For example, if you use geographical related services, you want to stop sharing your geographical location information, you can stop sharing by the closing method of closing functions, software and hardware service providers and communication service providers through your mobile phone. It is recommended that you read related guidelines carefully.Essence", "label": ["Important", "Edit/Control"], "rewrite": "If you use geographical related services, you can stop sharing geographical location information through your mobile phone positioning, software and hardware service providers, and communication service providers."}
{"task": "rw_64.jsonl", "id": 60277, "text": "5.2 We will collect and use your information in accordance with the functions of our products or services in accordance with the functions of our products or services.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60278, "text": "If you find that we violate laws and regulations or the agreed collection and use your personal information, you can ask us to delete it.", "label": ["Important", "Edit/Control"], "rewrite": "If you find that we violate the provisions of laws and regulations or the agreed collection and use your personal information, we can ask us to delete it."}
{"task": "rw_64.jsonl", "id": 60279, "text": "If you find that our personal information we collect and store is wrong, you can also ask us to correct it.", "label": ["Important", "Edit/Control"], "rewrite": "You can ask us to correct the wrong personal information of collecting and storage."}
{"task": "rw_64.jsonl", "id": 60280, "text": "Please contact us through the contact information of this policy.", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60281, "text": "5.3, when you access, modify and delete relevant information, we may ask you to verify your identity to ensure the security of the account.", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "When you access, modify and delete related information, we may ask you to verify your identity to ensure account security."}
{"task": "rw_64.jsonl", "id": 60282, "text": "5.4 Please understand that due to technical restrictions, legal or regulatory requirements, we may not be able to meet all your requirements. We will answer your request within a reasonable period.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60283, "text": "6. The information we share", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60284, "text": "We follow the provisions of laws and regulations and strictly restrict the sharing of information, such as:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We follow the provisions of laws and regulations to strictly restrict the sharing of information."}
{"task": "rw_64.jsonl", "id": 60285, "text": "6.1, after you agree, we may share your personal information with a third party;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After you agree, we may share your personal information with a third party."}
{"task": "rw_64.jsonl", "id": 60286, "text": "6.2, in order to achieve external treatment, we may be with third -party partners (third -party service providers, contractors, agents, advertising partners, application developers, etc., for example, on behalf of us issued an email or push notificationCorresponding service providers, map service providers provided us with location services) (they may not be located in your homeland) to share your personal information and let them follow our instructions, privacy policies, and other related confidentiality and security measuresT handling the above information for us, and for the following purposes:", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "In order to achieve external treatment, we may share your personal information with third -party partners and let them handle information according to our instructions, privacy policies, and other related confidentiality and security measures."}
{"task": "rw_64.jsonl", "id": 60287, "text": "6.2.1 Provide you with our services;", "label": ["Usage"], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60288, "text": "6.2.2 Implement the purpose of the \"How do we use the collected information\" part;", "label": ["Usage"], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60289, "text": "6.2.3 Perform our obligations and the right to exercise our rights in the TME Service Agreement or this policy;", "label": ["Usage"], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60290, "text": "6.2.4 Understand, maintain and improve our services.", "label": ["Usage"], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60291, "text": "If we share your information with the above third parties, we will use encryption, anonymous processing and other means to ensure your information security.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We share your information with a third party, and we will use encryption, anonymous processing and other means to ensure your information security."}
{"task": "rw_64.jsonl", "id": 60292, "text": "6.3, with the sustainable development of our business, when transactions such as mergers, acquisitions, and asset transfer cause your personal information to third parties, we will inform you of the relevant situations in the form of push notifications, announcements and other forms, in accordance with laws, regulations and notContinue to protect or require new managers to continue to protect your personal information below the standards required by this policy.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "If business mergers, acquisitions, asset transfer and other transactions will be informed of the relevant situation, and it will continue to protect your personal information in accordance with laws and regulations and not lower than the standards required by this guideline."}
{"task": "rw_64.jsonl", "id": 60293, "text": "6.4, we will use the collected information for big data analysis.", "label": ["Important", "Usage"], "rewrite": "We will use the collected information for big data analysis."}
{"task": "rw_64.jsonl", "id": 60294, "text": "For example, we use the information collected to analyze the formation of urban thermal maps or industry insights that do not include any personal information.", "label": ["Important", "Usage"], "rewrite": "The collected information is used to analyze the urban heat map or industry insight report that does not include any personal information."}
{"task": "rw_64.jsonl", "id": 60295, "text": "We may disclose and share information with our partners with information that does not include identity recognition content after statistical processing, to understand how users use our service or let the public understand the overall trend of our service.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We may disclose and share with partners with information that does not include identity recognition content after statistical processing, to understand how users use services or let the public understand the overall use trend of services."}
{"task": "rw_64.jsonl", "id": 60296, "text": "6.5, we may disclose your personal information based on the following goals:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may disclose your personal information based on the following goals:"}
{"task": "rw_64.jsonl", "id": 60297, "text": "6.5.1, comply with relevant regulations of applicable laws and regulations, etc.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Comply with the relevant provisions of applicable laws and regulations to disclose your personal information."}
{"task": "rw_64.jsonl", "id": 60298, "text": "6.5.2, abide by the court's judgment, ruling or other legal procedures;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Comply with the court's judgment, ruling or other legal procedures to disclose your personal information."}
{"task": "rw_64.jsonl", "id": 60299, "text": "6.5.3, comply with the requirements of relevant government agencies or other legal authorization organizations;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Comply with the requirements of relevant government agencies or other legal authorized organizations to disclose your personal information."}
{"task": "rw_64.jsonl", "id": 60300, "text": "6.5.4, we have reason to be convinced that we need to comply with relevant regulations such as laws and regulations;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We have reason to be convinced that we need to comply with relevant regulations such as laws and regulations to disclose your personal information."}
{"task": "rw_64.jsonl", "id": 60301, "text": "6.5.5, to implement relevant service agreements or policies, safeguard the public interests of the society, and protect our customers, or our affiliates, other users or employees' personal property safety or other legitimate rights and interests.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to implement relevant service agreements or policies and safeguard social public interests, to protect your personal information in order to protect the safety of personal property or other legitimate rights and interests of all parties."}
{"task": "rw_64.jsonl", "id": 60302, "text": "7. The information we may send to you", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60303, "text": "7.1 Information push", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60304, "text": "When you use our services, we may send you email, text message, information or push notification to you.", "label": ["Important", "Usage"], "rewrite": "When you use our services, you may send you email, SMS, information, or push notification to you."}
{"task": "rw_64.jsonl", "id": 60305, "text": "You can choose to cancel the subscription on the device according to our relevant tips.", "label": ["Important", "Edit/Control"], "rewrite": "You can choose to cancel the subscription on the device."}
{"task": "rw_64.jsonl", "id": 60306, "text": "7.2 Announcement related to service", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60307, "text": "We may issue an announcement related to the service -related announcement when necessary (for example, when the system maintenance is suspended due to system maintenance).", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60308, "text": "You may not be able to cancel these announcements related to services and nature.", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60309, "text": "8. The location and period of storage information", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60310, "text": "8.1 Location of storage information", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60311, "text": "We comply with the provisions of laws and regulations and store personal information collected in the country to the territory.", "label": ["Data Retention", "Important"], "rewrite": "Personal information collected in the country is stored in the country."}
{"task": "rw_64.jsonl", "id": 60312, "text": "8.2 The time limit for storage information", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60313, "text": "Generally speaking, we only retain your personal information for the shortest time to achieve the goal.", "label": ["Data Retention", "Important"], "rewrite": "Keep your personal information in the shortest time for the purpose of realizing the goal."}
{"task": "rw_64.jsonl", "id": 60314, "text": "But in the following circumstances, we may change the storage time of personal information due to the need to meet the requirements of laws and regulations:", "label": ["Data Retention", "Important"], "rewrite": "We may change the storage time of personal information due to the need to meet the requirements of laws and regulations."}
{"task": "rw_64.jsonl", "id": 60315, "text": "8.2.1, in order to comply with relevant regulations such as applicable laws and regulations;", "label": ["Data Retention", "Important"], "rewrite": "In order to comply with relevant provisions such as applicable laws and regulations, change the storage time of personal information."}
{"task": "rw_64.jsonl", "id": 60316, "text": "8.2.2, to comply with the court's judgment, ruling or other legal procedures;", "label": ["Data Retention", "Important"], "rewrite": "In order to abide by the court's judgment, ruling or other legal procedures, the storage time of personal information is changed."}
{"task": "rw_64.jsonl", "id": 60317, "text": "8.2.3, in order to comply with the requirements of relevant government agencies or legal authorization organizations;", "label": ["Data Retention", "Important"], "rewrite": "In order to comply with the requirements of relevant government agencies or legal authorized organizations, the storage time of personal information is changed."}
{"task": "rw_64.jsonl", "id": 60318, "text": "8.2.4 We have reason to be convinced that we need to comply with relevant regulations such as laws and regulations;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60319, "text": "8.2.5, in order to implement relevant service agreements or policies, safeguard the public interests of the society, and protect our customers, or our affiliates, other users, or employees' personal property security or other legitimate rights and interests, or other legitimate rights and interests.", "label": ["Data Retention", "Important"], "rewrite": "In order to implement relevant service agreements or policies, safeguard the public interests of the society, and protect the storage time of personal information in order to protect the safety of personal property or other legitimate rights and interests of all parties."}
{"task": "rw_64.jsonl", "id": 60320, "text": "When our products or services are stopped, we will notify you in the form of push notifications, announcements, etc., and delete or deal with your personal information within a reasonable period.", "label": ["Data Retention", "Important"], "rewrite": "When stopping operation, we will make an announcement notice and delete or processes your personal information."}
{"task": "rw_64.jsonl", "id": 60321, "text": "Nine, information security", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60322, "text": "We provide corresponding security guarantees for your information to prevent information loss, improper use, unauthorized access or disclosure.", "label": ["Important", "Data Security"], "rewrite": "Provide corresponding security guarantees for your information to prevent information loss, improper use, unauthorized access or disclosure."}
{"task": "rw_64.jsonl", "id": 60323, "text": "9.1, we strictly abide by laws and regulations to protect users' communication secrets.", "label": ["Important", "Data Security"], "rewrite": "Strictly abide by laws and regulations to protect users' communication secrets."}
{"task": "rw_64.jsonl", "id": 60324, "text": "9.2, we will use various security protection measures within a reasonable level to ensure information security.", "label": ["Important", "Data Security"], "rewrite": "Use various security protection measures within a reasonable level to ensure the security of information."}
{"task": "rw_64.jsonl", "id": 60325, "text": "For example, we use encryption technology (for example, TLS ,, SSL,), anonymous processing and other means to protect your personal information.", "label": ["Important", "Data Security"], "rewrite": "Use encrypted technology and anonymous processing to protect your personal information."}
{"task": "rw_64.jsonl", "id": 60326, "text": "9.3, we establish a special management system, process and organization to ensure information security.", "label": ["Important", "Data Security"], "rewrite": "Establish a specialized management system, process and organization to ensure information security."}
{"task": "rw_64.jsonl", "id": 60327, "text": "For example, we strictly restrict the scope of the personnel of access information, ask them to obey the confidentiality obligations and conduct review.", "label": ["Important", "Data Security"], "rewrite": "Strictly restrict the scope of the personnel of access information, and require them to comply with confidentiality obligations and review them."}
{"task": "rw_64.jsonl", "id": 60328, "text": "9.4, if security incidents such as personal information leakage occur, we will start emergency plans to prevent the security incident from expanding, and inform you in the form of push notifications and announcements.", "label": ["Important", "Data Security"], "rewrite": "We will start emergency plans to deal with information security incidents."}
{"task": "rw_64.jsonl", "id": 60329, "text": "Ten, minor protection", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60330, "text": "We attach great importance to the protection of personal information of minors.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60331, "text": "According to the relevant laws and regulations, if you are, minors under the age of 18, before using, TME's products or services, you should obtain the consent of your parents or legal guardians in advance.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a minor under the age of 18, you should obtain the consent of your parents or legal guardians before using TME products or services."}
{"task": "rw_64.jsonl", "id": 60332, "text": "If you are the guardian of minors, when you have any questions about the personal information of the minors you monitor, please contact us through the contact information in part 12.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are the guardian of the minor, when you have any questions about the personal information of the minors you monitor, please contact us."}
{"task": "rw_64.jsonl", "id": 60333, "text": "11. Scope of application", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60334, "text": "All our products or services are applicable to this policy.", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60335, "text": "However, some products or services may have its specific privacy guidelines /statements. The specific privacy guidance /declaration more specifically illustrates how we handle your information in the service.", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60336, "text": "If this policy is inconsistent with the privacy guidelines /declarations of specific services, please refer to this specific privacy guideline /declaration.", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60337, "text": "Please note that this policy does not apply products or services provided by other companies or individuals.", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60338, "text": "If you use these third -party products or services, you must be subject to the third -party privacy policy (rather than this policy), and you need to read its policy content carefully.", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60339, "text": "Twelve, contact us", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60340, "text": "If you have any questions about this policy or other related matters, please contact us, http://kf.qq.com/.", "label": ["Important", "Contact Information"], "rewrite": "If you have any questions about this policy or other related matters, please contact us through http://kf.qq.com/."}
{"task": "rw_64.jsonl", "id": 60341, "text": "You can also send your question to, QQmusic155@tencent.com or send it to the following address:", "label": ["Important", "Contact Information"], "rewrite": "You can also send your question to QQmusic155@tencent.com or send it to the following address:"}
{"task": "rw_64.jsonl", "id": 60342, "text": "Wanlida Science and Technology Building, Science and Technology of Nanshan District, Guangdong Province, China, 17th Floor, Tencent Music Legal Department", "label": ["Important", "Contact Information"], "rewrite": "Tencent Music Legal Ministry, 17th Floor, Wandaida Technology Building, Nanshan District, Guangdong Province, China"}
{"task": "rw_64.jsonl", "id": 60343, "text": "Postcode:, 518000", "label": ["Important", "Contact Information"], "rewrite": "Postcode: 518000"}
{"task": "rw_64.jsonl", "id": 60344, "text": "We will review the issues involved as soon as possible and reply within 30 days after verifying your user identity.", "label": ["Important", "Contact Information"], "rewrite": "We will reply within 30 days after verifying your user identity."}
{"task": "rw_64.jsonl", "id": 60345, "text": "13. Change", "label": [], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60346, "text": "We may amend the content of this policy in a timely manner.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60347, "text": "If such changes will cause the substantial loss of rights under this policy, we will notify you by prompting a prominent position on the page before the change of the page, sending emails to you.", "label": ["Policy Change", "Important"], "rewrite": "If the change of privacy policy will cause you to reduce the essence of rights under this policy, we will notify you by prompting a prominent position on the page and sending emails to you before the change."}
{"task": "rw_64.jsonl", "id": 60348, "text": "In this case, if you continue to use our products or services, it means that you agree with the policy content of the revised policy.", "label": ["Policy Change", "Important", "Risk"], "rewrite": "If you continue to use our products or services, it means that you agree with the policy content constraints after being revised."}
{"task": "rw_64.jsonl", "id": 60349, "text": "Recent update date: June 27, 2018", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_64.jsonl", "id": 60350, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
