{"task": "rw_61.jsonl", "id": 58473, "text": "Alibaba (1688) Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58474, "text": "Update date: June 17, 2022", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58475, "text": "【introduction】", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58476, "text": "You are welcome to use our products and services!", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58477, "text": "We know the importance of personal information to you. Your trust is very important to us. We will strictly abide by laws and regulations to take corresponding security protection measures to protect your personal information security and controlling.", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58478, "text": "Based on this, the 1688 platform service provider (or \"we\") formulates this \"Alibaba (1688) Privacy Policy\" (hereinafter referred toIn the process of service, how will we collect, use, share, store, and protect your personal information, as well as how you can manage your personal information so that you can make better choices.", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58479, "text": "Before you start using our products and services, please read and understand this policy carefully. In particular, we should focus on reading the clauses we logging in the threatening of the body/coarse body to ensure that you fully understand and agree to use it before starting to use.", "label": ["Policy Change", "Important"], "rewrite": "Before using our products and services, please read and understand this policy carefully. In particular, we should focus on reading the clauses that are identified by the threading of the lines/thick body to ensure that you fully understand and agree to use it before you start using it."}
{"task": "rw_61.jsonl", "id": 58480, "text": "The professional vocabulary involved in this policy, we try to explain to you in a concise and popular expression in order to facilitate your understanding.", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58481, "text": "If you have any questions, opinions or suggestions on the content of this policy, you can contact us through the contact information at the end of this policy.", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58482, "text": "You agree that the privacy policy said that you have understood the functions provided by the application, and the necessary personal information required for functional operation, and give corresponding collection and use authorization, but it does not mean that you have agreed to open up additional functions and handle non -necessary personal information.The opening, processing non -necessary personal information and processing sensitive personal information, we will solicit your consent separately according to your actual usage.", "label": ["Policy Change", "Important", "First Party Collection Information"], "rewrite": "The opening, processing non -necessary personal information and processing sensitive personal information of related additional functions, we will solicit your consent separately according to your actual usage."}
{"task": "rw_61.jsonl", "id": 58483, "text": "This privacy policy will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58484, "text": "1. Scope of application", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58485, "text": "2. Information collection and use", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58486, "text": "3. Provide information to the outside world", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58487, "text": "Fourth, your rights", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58488, "text": "5. Storage of information", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58489, "text": "6. Policy update", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58490, "text": "7. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58491, "text": "Eight, contact us", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58492, "text": "Appendix: Related Definition", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58493, "text": "1. Scope of application", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58494, "text": "This policy is suitable for the various products and services provided by the 1688 platform service providers with new forms provided to you with new forms that appeared with technology development with technology.", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58495, "text": "We and affiliated companies have a privacy policy separately for the products or services that it provided to you (such as \"1688 Merchant Version Privacy Policy\", \"1688 Industrial Privacy Policy\" and \"Privacy Policy of the Performance Bao\"), then corresponding products or servicesApplicable corresponding privacy policies.", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58496, "text": "Except for the relevant information collection and use activities described in this policy, this policy is not applicable to other services you provided by the 1688 platform sellers and other third directions. Other services apply to the personal information collection and use rules that they explain to you.", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58497, "text": "For example, when you join the seller or brand member, the use of such sellers or brands to use the rules that they specifically explained to you.", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58498, "text": "2. Information collection and use", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58499, "text": "When you use our products/services, the personal information we need/may need to collect and use includes the following:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58500, "text": "1. In order to realize the basic functions of providing you with our products and/or services, you must authorize us to collect and use the necessary information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58501, "text": "If you refuse to provide the corresponding information, you will not be able to use our products and/or services normally", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58502, "text": "2. In order to provide you with additional functions to our products and/or services, you can choose to agree or disagree with the information we collected and used alone.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58503, "text": "If you refuse to provide it, you will not be able to use related additional functions normally or cannot achieve the functional effects we intend to achieve, which will not affect your basic functions.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58504, "text": "We are here to remind you that we are committed to creating a variety of products and services to meet your needs.", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58505, "text": "Because there are many types and services we provide to you, and there are differences in the scope of the specific product/service selected by different users, the basic/additional functions and the personal information types and scope of personal information and use will be different. Please use specific ones.Product/service function shall prevail.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58506, "text": "The specific feature scenarios we will provide you include::", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58507, "text": "(1) Help you become our member and account management", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58508, "text": "1. Basic member service", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58509, "text": "We provide you with services based on 1688 platform accounts.", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58510, "text": "In order to create a 1688 platform account, you need to provide us with at least your mobile phone number, the member name and password you are going to use.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to create a 1688 platform account, you need to provide us with at least your mobile phone number, the member name and password you are going to use."}
{"task": "rw_61.jsonl", "id": 58511, "text": "If you refuse to provide the above information, you will not be able to register the 1688 platform account, you can only use browsing and search services.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide information, you will not be able to register for 1688 platform accounts, you can only use browsing and search services."}
{"task": "rw_61.jsonl", "id": 58512, "text": "We will determine your current level based on your 1688 platform account usage and the account level computing rules set by the platform, and provide you with the basic equity corresponding to the corresponding account level.", "label": ["Usage"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58513, "text": "2. Additional member service", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58514, "text": "Special member rights: If you provide the following additional information completion information, it will help us provide you with more personalized products or services: your real name, fixed telephone, contact information, position, main industry, nickname and avatarsWe can also provide you with special member services.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If you provide the following additional information completion information, it will help provide more personalized products or services: your real name, fixed telephone, contact information, position, main industry, nickname and avatar."}
{"task": "rw_61.jsonl", "id": 58515, "text": "Among them, the nicknames and avatars you set will be displayed publicly.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "The nicknames and avatars you set will be displayed publicly."}
{"task": "rw_61.jsonl", "id": 58516, "text": "Real personal certification: You can submit the corresponding ID information (ID card, passport and other ID information), facial information to complete real -person authentication according to the certification requirements.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "You can submit the corresponding ID information (ID card, passport and other ID information), facial information to complete real -person certification according to the certification requirements."}
{"task": "rw_61.jsonl", "id": 58517, "text": "Authorized login: We may obtain your third -party account information from a third party based on your separate consent and bind it with your 1688 platform account, so that you can log in to the third party and use our products and//Or service.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may obtain your third -party account information from a third party based on your individual consent and bind it with your 1688 platform account."}
{"task": "rw_61.jsonl", "id": 58518, "text": "We will use your relevant information within the scope of the authorization you agree with.", "label": ["Usage"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58519, "text": "Other member role services: If you apply for registration as a seller, service provider or other member roles that have additional identity certification requirements, you need to take the initiative to provide us with identity information and/or corporate related information, or authorize us to obtain your correspondence from Alipay to get your corresponding correspondenceThe above -mentioned relevant certification information of the Alipay account is used for verification, registration, publicity, and other purpose of obtaining qualifications for your identity and other member characters.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "You need to actively provide us with identity information and/or corporate related information, or authorize us to obtain the above -mentioned relevant certification information of your corresponding Alipay account for your identity and other member characters to qualify for qualifications."}
{"task": "rw_61.jsonl", "id": 58520, "text": "If you already have a 1688 platform account, we may display your above personal information in the 1688 platform service, and the operations that you perform in the 1688 platform or associated with the 1688 platform account (you can use the 1688 platformAccounts use the products or services provided by/or related companies provided by our website or client, or other products/service entrances provided by/or related companies), including displaying your personal data, preferential rights, and transaction orders through 1688 platform accounts.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We may display your personal information, preferential rights, and transaction orders in 1688 platform services."}
{"task": "rw_61.jsonl", "id": 58521, "text": "We will respect your choices of 1688 platform services and 1688 platform account settings.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58522, "text": "3. Authentication", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58523, "text": "In order to meet relevant laws and regulations and regulatory requirements, ensure the authenticity of the user's identity, and achieve anti -fraud, such as risk control, guarantee system and service security, when you use specific services/functions, we need to collect your relevant information for identity verification, such as:", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use a specific service/function, we need to collect your relevant information for authentication."}
{"task": "rw_61.jsonl", "id": 58524, "text": "Real -name/actual certification: Based on a member role (such as sellers, content creators), and other scenarios that need to be used in accordance with the law (including protecting the rights and interests of minors in accordance with the law)The need to crack down on telecommunications network fraud, deduct personal income tax, administrative law enforcement or relevant subjects in the relevant subjects in the judicial lawsuit, and retrieve account passwords), you need to provide real -name or real -person certification.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "You need real -name or real -person certification."}
{"task": "rw_61.jsonl", "id": 58525, "text": "In order to achieve the purpose of certification, you need to actively provide relevant real identity information (name, document number and other documents or facial recognition information, which may be different according to the actual situation, subject to page prompts) and authorize us to pass the national authority and credible identity certificationThe agency conducts information verification, or authorizes us to obtain the necessary authentication information of your Alipay account (including Alipay account bound to your Taobao account) from Alipay. We will record, save certification information and certification results in accordance with the law.The purpose of completing the certification, or the purpose stipulated in other laws and regulations, will not be used as other purposes without your authorization.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "In order to achieve the purpose of certification, you need to actively provide relevant authentic identity information and authorize us to conduct information verification through the national authoritative and trusted identity certification agency, or authorize us to obtain the necessary certification information of your Binding Alipay account from Alipay."}
{"task": "rw_61.jsonl", "id": 58526, "text": "In addition, when you participate in the promotion and interactive activities on the platform, we need to check the real -name authentication status of the Alipay account that you binding the Alipay account is used to verify your basic participation conditions and ensure your activities.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "When you participate in the promotion and interactive activities on the platform, we need to check the real -name authentication status of the Alipay account that you binding the Alipay account is used to verify your basic participation conditions."}
{"task": "rw_61.jsonl", "id": 58527, "text": "(2) Show you product or service information to you", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58528, "text": "In order to show you product or service information, including your access footprint and historical search, we will collect and use your browsing and search records when you visit or use the 1688 platform website or client.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We will collect and search and search for your browsing and search records when you visit or use the 1688 platform website or client."}
{"task": "rw_61.jsonl", "id": 58529, "text": "Sorting services or other information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We will combine the information you have authorized to predict your preferences through the algorithm model."}
{"task": "rw_61.jsonl", "id": 58530, "text": "In order to meet your diverse needs, we will introduce diversified recommendation technologies during the sorting process, expand the recommended content, and avoid excessive concentration of the same type of content.", "label": ["Important", "Usage"], "rewrite": "We will introduce diversified recommendation technologies during the sorting process, expand the recommended content, and avoid excessive concentration of the same type of content."}
{"task": "rw_61.jsonl", "id": 58531, "text": "We will also push you a business advertisement and other information that you may be interested in based on your preferences on the 1688 platform and other third -party applications based on your preferences, or send you commercial short information to you.", "label": ["Important", "Usage"], "rewrite": "We will also push you commercial advertisements and other information that may be interested in based on your preferences, or send you commercial short information to you."}
{"task": "rw_61.jsonl", "id": 58532, "text": "At the same time, we strive to ensure your privacy experience through the following measures:", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58533, "text": "1. If you want to delete your browsing and search records, you can log in to the account to choose to delete through \"My Footprint\";", "label": ["Important", "Edit/Control"], "rewrite": "If you want to delete your browsing and search records, you can log in to the account to choose to delete through \"My Footprint\"."}
{"task": "rw_61.jsonl", "id": 58534, "text": "2. If you don't want to accept the commercial advertisement we send to you, you can reply or close the booking or other ways we provided by SMS prompt;", "label": ["Edit/Control", "Important"], "rewrite": "You can reply to the withdrawal or other ways we provide through the SMS prompt or close the commercial advertisement."}
{"task": "rw_61.jsonl", "id": 58535, "text": "3. If you need to check the sorting of your personal characteristics when using the site search service you provide, you can click \"Filter\" on the search results page, select it, \"General Sorting\" for settings;", "label": ["Important", "Edit/Control"], "rewrite": "If you check the sorting of your personal characteristics, you can click \"Filter\" on the search results page and select the \"GM Sorting\" for settings."}
{"task": "rw_61.jsonl", "id": 58536, "text": "4. If you don't want to see the products or services recommended by us on the homepage or entering the purchase order, the collection clip to you, you can choose the recommended product or service picture of the recommended product or in the subsequent pop -up window according to the prompts.Shield the category of similar products or products or services;", "label": ["Important", "Edit/Control"], "rewrite": "You can select the recommended products or service pictures by long pressing, and select the category of similar products or belonging in the subsequent pop -up window."}
{"task": "rw_61.jsonl", "id": 58537, "text": "5. If you want to manage the personalized advertisements we send to you, you can set it in \"Settings -Privacy -Advertising Management -Whether to Disable Personalized Advertising Display\".", "label": ["Important", "Edit/Control"], "rewrite": "You can manage personalized advertisements in \"My — Settings -Privacy -Advertising Management -Whether to Disable Personalized Advertising Show\"."}
{"task": "rw_61.jsonl", "id": 58538, "text": "(Click to manage personalized advertisements)", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58539, "text": "6. If you want to manage the personalized content we push you, you can set it in \"My-Settings-Privacy-Recommended Management-Personalized Content Recommendation Settings\".", "label": ["Important", "Edit/Control"], "rewrite": "You can manage personalized content in \"My-Settings-Privacy-Recommended Management-Personalized Content Recommended Settings\"."}
{"task": "rw_61.jsonl", "id": 58540, "text": "(Click Management Personalized Recommendation)", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58541, "text": "(3) Provide you with the functions of collection, purchase, attention and sharing", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58542, "text": "1. In the process of browsing our website or client, you can choose to collect, add to shopping carts, build a concern relationship with the merchants/brands you are interested in, through what we provided by the merchant/brand you are interested in.Functional components share product/service information from third -party.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "You can share product/service information to third parties through the functional components we provide."}
{"task": "rw_61.jsonl", "id": 58543, "text": "In the process of using the above functions, we will collect the records of your collection and adding a shopping cart, focusing on relationships, and sharing service log information, including history to achieve the above functions and other purposes we have clearly notified.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect the records of your collection and adding a shopping cart, focusing on relationships, and sharing service log information, including history, to achieve the above functions and other purposes."}
{"task": "rw_61.jsonl", "id": 58544, "text": "You can check or manage your collection and purchase information in the collection clip, shopping cart.", "label": ["Important", "Edit/Control"], "rewrite": "You can check or manage your collection and purchase information in the collection clip, shopping cart."}
{"task": "rw_61.jsonl", "id": 58545, "text": "2. When you copy the password shared by others, we will need to access your shear board so that you can provide you with a better shopping experience and will not store your shear information.", "label": ["Data Retention", "Important", "First Party Collection Information"], "rewrite": "We need to access your shear board so that you can provide you with a better shopping experience and will not store your shear information."}
{"task": "rw_61.jsonl", "id": 58546, "text": "(4) Help you complete the order and order management", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58547, "text": "When you order specific products and/or services in our products and/or services, we will generate orders for you to buy the product and/or service for you through the system.", "label": ["Important", "Usage"], "rewrite": "We will use the system to generate orders to buy the product and/or service."}
{"task": "rw_61.jsonl", "id": 58548, "text": "In the process of ordering, you need to provide at least your consignee's name, delivery address, and consignee contact phone number. For some special types of goods and services, you also need to provide other information necessary for the product or service, such as involving it involvedYou need to provide your identity information during cross -border transactions to complete customs clearance.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In the process of ordering, you need to provide at least your consignee's name, the delivery address, and the contact number of the consignee. For some special types of goods and services, you also need to provide other necessary information."}
{"task": "rw_61.jsonl", "id": 58549, "text": "At the same time, this order will contain the goods and/or service information you purchased, the specific order number, the time of order creation, the amount you should pay, your remarks information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58550, "text": "We collect this information to help you successfully complete the transaction, ensure your transaction security, facilitate your inquiry of order information, provide customer service and after -sales service and other purposes that we clearly notify.", "label": ["Usage"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58551, "text": "You can order goods and/or services for others through the 1688 platform. You need to provide the aforementioned personal information of the actual consignee and make sure that the actual consignee has obtained the consent of the actual consignee.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "You can order goods and/or services for others through the 1688 platform. You need to provide the aforementioned personal information of the actual consignee and ensure that you have obtained consent."}
{"task": "rw_61.jsonl", "id": 58552, "text": "To facilitate your understanding, query order information and manage order information, we will collect the order information you generated during our service process to display and facilitate the management of your order.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We will collect the order information you generate in the process of using our service to show you and facilitate your management."}
{"task": "rw_61.jsonl", "id": 58553, "text": "You can fill in/select more additional information including other contact calls and receipt time to ensure the accurate delivery of goods or services.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "You can fill in/select more additional information including other contact calls and receipt time to ensure the accurate delivery of goods or services."}
{"task": "rw_61.jsonl", "id": 58554, "text": "You can view and manage your order information through \"My Order\".", "label": ["Important", "Edit/Control"], "rewrite": "You can view and manage your order information through \"My Order\"."}
{"task": "rw_61.jsonl", "id": 58555, "text": "(5) Help you complete the payment", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58556, "text": "In order to complete the order payment, you need to bind the Alipay account, online banking or other third -party payment methods and choose the payment method.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "You need to bind the Alipay account, online banking or other third -party payment methods and choose the payment method."}
{"task": "rw_61.jsonl", "id": 58557, "text": "We will develop your 1688 platform account member name, the corresponding Alipay account member name, order payment related information, order security related equipment information, and other necessary information required by other anti -money laundering laws through the Alipay software tools embedded in the website or clientThe package (software tool development package is referred to as \"SDK\" in this policy) and other security methods to share with Alipay, online banking or third -party payment platforms.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "We will share the necessary information required by your anti -money laundering law through \"SDK\" and other security methods with Alipay, online banking or third -party payment platforms."}
{"task": "rw_61.jsonl", "id": 58558, "text": "If you choose to provide you with a payment service by other financial institutions, we will also share your bank card payment, which is valid for the bank card, and share the necessary information of bank card payment with the corresponding financial institutions you choose.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "We will also share the necessary information of your bank card payment with the corresponding financial institutions you choose."}
{"task": "rw_61.jsonl", "id": 58559, "text": "You can ask other people to pay for you, then you need to provide third -party payment accounts and/or mobile phone numbers such as Alipay accounts for Alipay accounts.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can ask others to pay for you, so you need to provide a third -party payment account and/or mobile phone number."}
{"task": "rw_61.jsonl", "id": 58560, "text": "In order to allow us to learn and confirm your payment progress and status in a timely manner, and to provide you with service after -sales and dispute solutions, you agree that we can collect the transaction objects, Alipay or other financial institutions you choose.information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "You agree that we can collect and pay the progress related information from other financial institutions you choose."}
{"task": "rw_61.jsonl", "id": 58561, "text": "You can check the Alipay account information bound by your 1688 platform account or apply for replacing the bound Alipay account.", "label": ["Important", "Edit/Control"], "rewrite": "You can check the Alipay account information bound by your 1688 platform account or apply for replacing the bound Alipay account."}
{"task": "rw_61.jsonl", "id": 58562, "text": "(6) Help you complete the delivery of goods or services", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58563, "text": "In order to ensure that the goods and/or services you buy can be smoothly, safe, accurate, and provide, we will disclose the delivery information related to the order of Zhejiang Cainiao Supply Chain Management Co., Ltd. to provide logistics information systems and technical services to the 1688 platform, andProvide the main body of the main body according to the product and/or service to synchronize related distribution information to the corresponding logistics distribution subject.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "We will disclose distribution information related to orders to Zhejiang Cainiao Supply Chain Management Co., Ltd., which provides logistics information systems and technical services for 1688 platforms."}
{"task": "rw_61.jsonl", "id": 58564, "text": "You know and agree that the corresponding logistics distribution subject will inevitably know and use your delivery information to complete the delivery purpose.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "You know and agree that the corresponding logistics distribution subject will inevitably know and use your delivery information to complete the delivery purpose."}
{"task": "rw_61.jsonl", "id": 58565, "text": "In order to provide you with the purpose of after -sales and dispute solutions, we need to learn and confirm the delivery progress and status in a timely manner. You agree that we can collect information related to the delivery progress related to the main body of logistics.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We need to learn and confirm the delivery progress and status in a timely manner. You agree that we can collect information related to the delivery progress related to the main body of the logistics."}
{"task": "rw_61.jsonl", "id": 58566, "text": "(7) Customer service and dispute handling", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58567, "text": "When you contact us or propose the application for sale, after -sales, and dispute dispute handling, in order to ensure your account and system security, we need you to provide the necessary personal information to verify your membership status.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "To ensure your account and system security, we need you to provide the necessary personal information to verify your membership status."}
{"task": "rw_61.jsonl", "id": 58568, "text": "In order to facilitate the processing plan and results of helping you solve the problem or record related issues as soon as possible, we may preserve your communication, communication/call records and related content (including account information, order information, to prove the relevant related to related related to the relevantOther information provided by the facts, or the contact information you leave).", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may preserve your communication, communication/call records and related content (including account information, order information, other information provided by the relevant facts, or the contact information you leave)."}
{"task": "rw_61.jsonl", "id": 58569, "text": "If you consult, complain or provide suggestions for specific orders, we will use your account information and order information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If you consult, complain or provide suggestions for specific orders, we will use your account information and order information."}
{"task": "rw_61.jsonl", "id": 58570, "text": "In order to provide reasonable needs of services and improve service quality, other information we may also use, including the relevant information you provided when you contact the customer service, the questionnaire answering information you sent to us during the questionnaire survey.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may also use your information, including the relevant information you provided when you contact the customer service, and the questionnaire you sent to us."}
{"task": "rw_61.jsonl", "id": 58571, "text": "(8) Provide you with information disclosure release function", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58572, "text": "You can select the comments, Q & A, forum, personal homepage and other information release functions we provide for you. Select publicly publish graphic/video/live content, publish comments and Q & A content, one -click to sell products to Taobao, Taotte, and as well asPublish products and/or service -related information and store -related information as sellers.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "You can choose to publish graphic/video/live content, publish and question and answer content through information release function."}
{"task": "rw_61.jsonl", "id": 58573, "text": "We respect and protect your settings of the relevant information and the scope of the release.", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58574, "text": "We may judge whether you can enjoy the corresponding information release function permissions based on your membership type and network log information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may judge whether you can enjoy the corresponding information release function permissions based on your membership type and network log information."}
{"task": "rw_61.jsonl", "id": 58575, "text": "Please note that the information you publish may involve your or other people's personal information and even sensitive personal information. If you choose to upload pictures containing personal information when evaluating.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The information you publish may involve your or other people's personal information and even sensitive personal information."}
{"task": "rw_61.jsonl", "id": 58576, "text": "Please consider whether to share or even publicly share relevant information when using our services.", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58577, "text": "If you involve the personal information of others in your public release, you need to obtain the consent of others before the release.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If you involve the personal information of others in your public release, you need to obtain the consent of others before the release."}
{"task": "rw_61.jsonl", "id": 58578, "text": "(9) Provide you with security", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58579, "text": "In order to fulfill the statutory obligations to ensure the security of e -commerce transactions, improve the security of your use of services provided by us and our affiliated companies and partners, protect the safety of personal property of you or other users or the public, and better prevent fishing websites.Fraud, network vulnerabilities, computer viruses, cyber attacks, network invasion risks, and more accurately identify the cases that violate laws and regulations or 1688 platform related agreements and rules.Information, service log information, and may use or integrate your member information, transaction information, equipment information, service log information, and information that our affiliated companies and partners obtain your authorization or sharing according to law (Among them, we may be in the background of the application background in the background of the application.Collect the MAC address, IMEI and other device identifiers for risk verification during the operation period) to comprehensively judge your account and transaction risk, authenticate, test and prevent security incidents, and take necessary records, audit, analysis, and disposal measures in accordance with the law.Essence", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "In the application, we embed the application security SDK to collect your device information, service log information, and may use or integrate your membership information, trading information, equipment information, service log information, and obtain your authorization or information shared according to law.Comprehensively judge your account and transaction risk"}
{"task": "rw_61.jsonl", "id": 58580, "text": "(10) Other additional services provided for you", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58581, "text": "1. Additional services based on system permissions", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58582, "text": "To provide you with more convenient, better, personalized products and/or services, and strive to improve your experience, we may collect and use your personal information by opening system permissions in the following additional services.", "label": ["Permission Acquisition", "Important"], "rewrite": "We may collect and use your personal information by opening system permissions in the following additional services."}
{"task": "rw_61.jsonl", "id": 58583, "text": "If you do not agree to start the relevant authority, it will not affect your basic services to use the 1688 platform, but you may not be able to obtain the user experience brought by these additional services to you.", "label": ["Permission Acquisition", "Important"], "rewrite": "Do not agree that the relevant authority will not affect the basic services of using the 1688 platform, but may not be able to obtain the user experience brought by these additional services to you."}
{"task": "rw_61.jsonl", "id": 58584, "text": "You can decide these permissions to open or close at any time.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58585, "text": "Please note that when you start the right of power, it means that you authorize us to collect and use relevant personal information to provide you with corresponding services. Once you turn off the right of power, it means that you cancel the authorization.With relevant personal information, you cannot continue to provide you with the service corresponding to the permissions.", "label": ["Permission Acquisition", "Important", "Risk"], "rewrite": "If you turn on the one -right power, it means that you authorize us to collect and use relevant personal information to provide you with corresponding services. Once you turn off the right of power, it means that you cancel the authorization.Continue to provide corresponding services."}
{"task": "rw_61.jsonl", "id": 58586, "text": "The decision of your closure authority will not affect the collection and use of information based on your authorization.", "label": ["Important", "Risk"], "rewrite": "The decision of your closure authority will not affect the collection and use of information based on your authorization."}
{"task": "rw_61.jsonl", "id": 58587, "text": "You can click here to view the application authority application and usage description.", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58588, "text": "2. Cookie and services of similar technologies", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58589, "text": "Cookie and similar device information identification technology are commonly used in the Internet.", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58590, "text": "When you use our service, we may use related technologies to send one or more, cookie, or anonymous identifiers (hereinafter referred to as \"Cookie\") to collect, identify and store your access, use this product, use this productInformation about time.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may use related technologies to send one or more cookies or anonymous identifiers to your device."}
{"task": "rw_61.jsonl", "id": 58591, "text": "We promise that it will not be used for any other uses besides the purpose of the privacy policy.", "label": ["Important", "First Party Collection Information"], "rewrite": "Cookie will not be used for any other purpose outside the purpose of this privacy policy."}
{"task": "rw_61.jsonl", "id": 58592, "text": "We use Cookie to ensure the safety and efficient operation of products and services. It can make us confirm the security status of your account and transaction, check the related abnormal conditions of collapse and delay, and help you save the steps of filling in your form and entering search content.And process.", "label": ["Usage"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58593, "text": "At the same time, we may use, cookie, show you the information or function you may be interested in, and optimize your choice of advertising.", "label": ["Important", "Usage"], "rewrite": "We may use Cookie to show you the information or functions you may be interested in and optimize your choice of advertising."}
{"task": "rw_61.jsonl", "id": 58594, "text": "Most browsers provide users with the function of removing the browser cache data. You can perform the corresponding data clearing operation, or you can modify the degree of acceptance of cookies or reject our cookies.", "label": ["Edit/Control", "Important"], "rewrite": "You can perform the corresponding data clearing operation, or you can modify the degree of acceptance of Cookie or reject our cookies."}
{"task": "rw_61.jsonl", "id": 58595, "text": "You may not be able to use services or corresponding functions that depend on cookies because of these modifications.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58596, "text": "3. Provide information to the outside world", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58597, "text": "(1) Sharing", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58598, "text": "We will not share your personal information with companies, organizations and individuals other than 1688 platform service providers, except for the following situations:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not share your personal information with companies, organizations and individuals other than 1688 platform service providers, except for the following situations:"}
{"task": "rw_61.jsonl", "id": 58599, "text": "1. Perform the sharing necessary for the legal obligations: we may share your personal information in accordance with the requirements of laws and regulations, litigation, and disputes in accordance with the requirements of administrative and judicial organs in accordance with the requirements of administrative and judicial organs in accordance with the law, and other legal obligations.", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58600, "text": "2. Share sharing when you get your consent: After getting your clear consent, we will share your personal information with other parties.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After getting your clear consent, we will share your personal information with other parties."}
{"task": "rw_61.jsonl", "id": 58601, "text": "3. Share sharing in order to establish and fulfill your contract as a party as a party: You purchase goods or services through 1688 platforms, and we will share the necessary information related to transaction information in your order information according to your choice.To provide relevant products or services providers to realize your needs of transactions, distribution and after -sales service.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You purchase goods or services through 1688 platforms, and we will share the necessary information related to transaction information in your order information with relevant products or services providers."}
{"task": "rw_61.jsonl", "id": 58602, "text": "4. Sharing with affiliated companies: In order to facilitate us to provide some services with you, we provide you with products and services based on the 1688 platform account. It is recommended that you may be interested in information.Personal property of the company or other users or the public is unruly, and your personal information may be shared with our affiliated company and/or its designated service provider.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Your personal information may be shared with our affiliated companies and/or its designated service providers."}
{"task": "rw_61.jsonl", "id": 58603, "text": "We will only share the necessary personal information and be restricted by the purpose declared in this policy. If we share your sensitive personal information or the purpose of changing personal information to change personal information, we will solicit your authorization consent again.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If we share your sensitive personal information or related companies to change the purpose of the use and processing of personal information, we will solicit your authorization consent again."}
{"task": "rw_61.jsonl", "id": 58604, "text": "You can click here to view the data sharing of the 1688 platform.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You can click here to view the data sharing of the 1688 platform."}
{"task": "rw_61.jsonl", "id": 58605, "text": "Please note that when you use our service, you voluntarily share or even publicly share information, which may involve your or other people's personal information and even sensitive personal information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "The information you shared when using our service may involve personal information of you or others and even sensitive personal information."}
{"task": "rw_61.jsonl", "id": 58606, "text": "Please consider and make a decision more cautiously.", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58607, "text": "(2) Entrusted processing", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58608, "text": "We may entrust a partner to handle your personal information in order to authorize partners to represent you to provide you with certain services or fulfilling functions.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may entrust a partner to handle your personal information."}
{"task": "rw_61.jsonl", "id": 58609, "text": "We will only entrust their information for the legal, correct, necessary, specific, and clear goals of this policy statement. We can authorize partners to only contact the information required by their duties, and we will ask for the agreement to request that it must not be requiredThis information is used for any other purpose beyond the scope of commission.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will only entrust them to process your information for the legal, fair, necessary, specific, and clear purpose of this policy statement."}
{"task": "rw_61.jsonl", "id": 58610, "text": "If the authorized partner will use your information for our unreasonable purpose, it will obtain your consent alone.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "If the authorized partner will use your information for our unreasonable purpose, it will obtain your consent alone."}
{"task": "rw_61.jsonl", "id": 58611, "text": "At present, our authorized partners include the following types:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The authorized partners we commission include the following types:"}
{"task": "rw_61.jsonl", "id": 58612, "text": "1. Authorized partners of advertising and analysis of service.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58613, "text": "Under the premise of using industry -universal security technology, we will entrust these partners to handle information about advertising, coverage, and effectiveness related to advertising.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Under the premise of using industry -universal security technology, we will entrust these partners to handle information about advertising, coverage, and effectiveness related to advertising."}
{"task": "rw_61.jsonl", "id": 58614, "text": "We will not commission your personal identity information to commission partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not commission your personal identity information to commission partners."}
{"task": "rw_61.jsonl", "id": 58615, "text": "2. Suppliers, service providers and other partners.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58616, "text": "We entrust the information to the suppliers, service providers and other partners who support our business to handle it. These support for the technical infrastructure services that we are entrusted to provide, analyze the usage methods of our services, provide customer service, pay conveniently, or perform academic academic academicsResearch and investigations, and when you choose \"becoming a seller, you will, contact information, platform account information, your registration time and the recent login system time provider to help you to help you become our merchantmember.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We entrust the information to the suppliers, service providers and other partners who support our business."}
{"task": "rw_61.jsonl", "id": 58617, "text": "In order to ensure the stable operation and functional implementation of our client, so that you can use and enjoy more services and functions. Our application will embed the SDK or other similar applications of authorized partners.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Our applications are embedded in SDK or other similar applications of authorized partners."}
{"task": "rw_61.jsonl", "id": 58618, "text": "We will strictly test the application interface (API) and software tool development package (SDK) of the authorized partners to obtain relevant information, and strict data protection measures with the authorized partners, so that it will be in accordance with this policy and any other any otherRelated confidentiality and security measures to handle personal information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will strictly test the application interface (API) and software tool development package (SDK) of authorized partners to obtain relevant information, and strict data protection measures with authorized partners."}
{"task": "rw_61.jsonl", "id": 58619, "text": "Except for the authorized partners to obtain your consent alone.", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58620, "text": "You can click here to view the details we access.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You can click here to view the details we access."}
{"task": "rw_61.jsonl", "id": 58621, "text": "(3) Transfer", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58622, "text": "If we need to transfer personal information for the reasons for merging, separation, dissolution, and declaration of bankruptcy, we will inform you the name or name and contact information of the receiver.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If we need to transfer personal information for the reasons for merging, separation, dissolution, and declaration of bankruptcy, we will inform you the name or name and contact information of the receiver."}
{"task": "rw_61.jsonl", "id": 58623, "text": "The receiver will continue to fulfill this policy and other legal obligations.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The receiver of personal information will continue to fulfill this policy and other legal obligations."}
{"task": "rw_61.jsonl", "id": 58624, "text": "If the receiver changes the original treatment purpose and method of processing, you will re -obtain your consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If the receiver changes the original treatment purpose and method of processing, you will re -obtain your consent."}
{"task": "rw_61.jsonl", "id": 58625, "text": "(4) Public disclosure", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58626, "text": "We will only publicly disclose your personal information in the following circumstances:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only publicly disclose your personal information in the following circumstances:"}
{"task": "rw_61.jsonl", "id": 58627, "text": "1. Based on your active choice and other individual consent, we may publicly disclose your personal information;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Based on your active choice and other individual consent, we may publicly disclose your personal information."}
{"task": "rw_61.jsonl", "id": 58628, "text": "2., if we determine that you have violated laws and regulations or seriously violated the relevant agreements and rules of 1688 platforms, or to protect the safety of personal property of the 1688 platform users or the public, we may disclose your personal information, including related related information, including related related information, including related related information, including related related information, including related related information, including related related information, including related related informationViolations and measures that 1688 platforms have taken you.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to protect the safety of personal property of the 1688 platform users or the public, we may disclose personal information about you, including related violations, and measures that the 1688 platform has taken you."}
{"task": "rw_61.jsonl", "id": 58629, "text": "Fourth, your rights", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58630, "text": "You can check and manage your information through the following ways, and we will respond to your request in the case of compliance with laws and regulations:", "label": ["Important", "Edit/Control"], "rewrite": "You can check and manage your information through the following ways, and we will respond to your request in the case of compliance with laws and regulations:"}
{"task": "rw_61.jsonl", "id": 58631, "text": "(1) Review, correct and supplement", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58632, "text": "You have the right to check, correct and supplement your information through the following ways:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58633, "text": "1., log in to the 1688 platform, enter the homepage of \"My 1688\", and enter \"My Ali-Settings-Account Information and Account Security\";", "label": ["Important", "Edit/Control"], "rewrite": "Log in to the 1688 platform, enter the \"My 1688\" homepage, and enter \"My Ali-Settings-Account Information and Account Security\"."}
{"task": "rw_61.jsonl", "id": 58634, "text": "2. Log in to the 1688 platform client and enter \"My-Settings-Account and Security\";", "label": ["Important", "Edit/Control"], "rewrite": "Log in to the 1688 platform client and enter \"Mine-Settings-Account and Security\"."}
{"task": "rw_61.jsonl", "id": 58635, "text": "3. Log in to the 1688 platform website to select contact customer service, or log in to the 1688 platform client, and select \"My-Application-Service Center\" to contact customer service.", "label": ["Important", "Edit/Control"], "rewrite": "Log in to the 1688 platform website to select contact customer service, or log in to the 1688 platform client, and select \"My-Application-Service Center\" to contact customer service."}
{"task": "rw_61.jsonl", "id": 58636, "text": "(2) Delete", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58637, "text": "You can delete your information through the path of \"(1), correct, and supplement your information\" column, or apply for a cancellation account to delete all your information.", "label": ["Important", "Edit/Control"], "rewrite": "You can delete your information through the path of \"(1), correct, and supplement your information\" column, or apply for a cancellation account to delete all your information."}
{"task": "rw_61.jsonl", "id": 58638, "text": "In the following circumstances, you can make a request to delete personal information to us by contacting customer service:", "label": ["Important", "Edit/Control"], "rewrite": "In the following circumstances, you can make a request to delete personal information to us by contacting customer service:"}
{"task": "rw_61.jsonl", "id": 58639, "text": "1. If our behavior of handling personal information violates laws and regulations;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58640, "text": "2. If we collect and use your personal information, it has not obtained your clear consent;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58641, "text": "3. If our behavior of handling personal information seriously violates your agreement;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58642, "text": "4. If our treatment purpose has been achieved, cannot be achieved or is not necessary for the purpose of the treatment;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58643, "text": "5. If we stop providing products or services, or the storage period has expired.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58644, "text": "If we decide to respond to your deletion request, we will also notify the subject of your personal information from our personal information as much as possible at the same time, and ask them to delete it in time (unless laws and regulations have other regulations, or these subjects have independently obtained your authorization)Essence", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "If we decide to respond to your deletion request, we will also notify the subject of your personal information from us and ask them to delete timely (unless the laws and regulations have other regulations, or these subjects have obtained your authorization independently)."}
{"task": "rw_61.jsonl", "id": 58645, "text": "When you or we assisted you to delete the relevant information, because of the applicable legal and security technical restrictions, we may not be able to immediately delete the corresponding information from the backup system.Treatment until the backup can be removed or achieved anonymous.", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "When you or we assist you to delete the relevant information, we may not be able to immediately delete the corresponding information from the backup system. We will securely store your personal information and restrict any further processing of it until the backup can be removed or achieved anonymous.Essence"}
{"task": "rw_61.jsonl", "id": 58646, "text": "(3) Change the scope of authorization", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58647, "text": "You can change or withdraw the scope of your personal information in the following ways or withdrawn or process your personal information:", "label": ["Important", "Edit/Control"], "rewrite": "You can change or withdraw the scope of your personal information in the following ways or withdrawn or process your personal information:"}
{"task": "rw_61.jsonl", "id": 58648, "text": "Manage system permissions for managing APP in \"Mine-Settings-Privacy-System permissions\".", "label": ["Important", "Edit/Control"], "rewrite": "Manage system permissions for managing APP in \"Mine-Settings-Privacy-System permissions\"."}
{"task": "rw_61.jsonl", "id": 58649, "text": "For the authorization that you cannot directly set through the above method, you can modify it through customer service contact, but please note that for some types of personal information, such as the information necessary for the basic functions of the 1688 platform, or the obligations required by our law and regulationsFor information, we may not be able to respond to your request to change the scope of authorization.", "label": ["Important", "Edit/Control"], "rewrite": "You can modify it through customer service, but please note that for some types of personal information, we may not be able to respond to requests that you change the scope of authorization."}
{"task": "rw_61.jsonl", "id": 58650, "text": "When you withdraw authorization, we will no longer process the corresponding personal information.", "label": ["Important", "Edit/Control"], "rewrite": "When you withdraw authorization, we will no longer process the corresponding personal information."}
{"task": "rw_61.jsonl", "id": 58651, "text": "But your decision to withdraw authorization will not affect our personal information processing based on your previous authorization.", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "But your decision to withdraw authorization will not affect our personal information processing based on your previous authorization."}
{"task": "rw_61.jsonl", "id": 58652, "text": "(4) Logging out the account", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58653, "text": "You can apply for a cancellation of your account in the following ways:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58654, "text": "1. On the 1688 platform website \"Account Management-Account Logging\" or 1688 platform client \"Settings-Account and Security-Logging up the Account\" submits an account cancellation application;", "label": ["Important", "Edit/Control"], "rewrite": "In the 1688 platform website \"Account Management-Account Logging out\" or 1688 platform client \"Settings-Account and Security-Lambage Account\" submitted an account cancellation application."}
{"task": "rw_61.jsonl", "id": 58655, "text": "2. Apply to cancel your account through customer service contact.", "label": ["Important", "Edit/Control"], "rewrite": "Apply for your account through customer service."}
{"task": "rw_61.jsonl", "id": 58656, "text": "After you take the initiative to cancel your account, we will stop providing you with products or services and delete or process your personal information according to the requirements of applicable laws.", "label": ["Important", "Edit/Control"], "rewrite": "After actively canceling the account, it will stop providing you with products or services and delete or processes your personal information."}
{"task": "rw_61.jsonl", "id": 58657, "text": "(5) Automatic decision -making of constraint information systems", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58658, "text": "In certain business functions, we may make decisions only based on the non -artificial automatic decision mechanism, including the algorithm.", "label": ["Important", "Usage"], "rewrite": "We may make a decision based on the non -artificial automatic decision mechanism, including the algorithm."}
{"task": "rw_61.jsonl", "id": 58659, "text": "If these decisions affect your legitimate rights and interests, you can contact us through customer service.", "label": ["Important", "Edit/Control"], "rewrite": "If these decisions affect your legitimate rights and interests, you can contact us through customer service."}
{"task": "rw_61.jsonl", "id": 58660, "text": "(6) Copy your personal information", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58661, "text": "You can make a request to copy personal information through contact with customer service, except for laws and regulations.", "label": ["Important", "Edit/Control"], "rewrite": "You can make a request to copy personal information through contact with customer service, except for laws and regulations."}
{"task": "rw_61.jsonl", "id": 58662, "text": "(7) Responsive your above request", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58663, "text": "For your or your guardians, close relatives, and other authority to make the above requests to us, and your relevant personal information rights stipulated in the laws of the People's Republic of China and other applicable laws, you can contact us through customer service or directly to us to usPersonal information protection full -time departments initiated complaints.", "label": ["Important", "Edit/Control"], "rewrite": "You can contact us through customer service or to directly launch a complaint with our personal information protection department."}
{"task": "rw_61.jsonl", "id": 58664, "text": "We will make a reply within 15 days.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58665, "text": "To ensure your account security and your personal information security, when you make a request to us, we may verify your identity (such as adding account verification, requesting you to provide written requests or other reasonable ways), and then process youRequest.", "label": ["Important", "Edit/Control"], "rewrite": "When you make a request to us, we may verify your identity first, and then process your request."}
{"task": "rw_61.jsonl", "id": 58666, "text": "For your reasonable request, we do not charge fees in principle, but we will charge a certain fee as appropriate for requests that repeat and beyond the reasonable limit.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58667, "text": "For information that is not directly associated with your identity, the information that is repeatedly applied without reasonable reasons, or you need too many technical means (if you need to develop a new system or change the current convention fundamentally), bring risks to others' legitimate rights or notIn actual requests, we may refuse.", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "For information that is not directly associated with your identity, the information that is repeatedly applied without reasonable reasons, or requires too much technical means, bring risks or unrealistic requests to others' legitimate rights and interests, we may refuse."}
{"task": "rw_61.jsonl", "id": 58668, "text": "5. Storage of information", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58669, "text": "(1) Storage period", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58670, "text": "We will only retain your personal information within the time limit required for the cost of reaching the cost policy, unless the law has compulsory retention requirements, for exampleIt is no less than three years from the date of completion.", "label": ["Data Retention", "Important"], "rewrite": "We will only retain your personal information within the time limit of the cost of reaching the cost of the cost, unless the law has compulsory retention requirements."}
{"task": "rw_61.jsonl", "id": 58671, "text": "We judge the storage period of personal information mainly based on the following standards:", "label": ["Data Retention", "Important"], "rewrite": "We judge the storage period of personal information mainly based on the following standards:"}
{"task": "rw_61.jsonl", "id": 58672, "text": "1. Complete your related transaction purpose, maintain the corresponding transactions and business records to cope with your possible inquiries or complaints;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58673, "text": "2. Ensure that we provide you with service safety and quality;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58674, "text": "3. Do you agree to a longer retention period;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58675, "text": "4. Make sure we proof of the court in possible litigation cases;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58676, "text": "5. Whether there are other special agreement or laws and regulations on the retention period.", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58677, "text": "After exceeding the reservation period, we will delete or deal with your personal information according to the requirements of the applicable law.", "label": ["Data Retention", "Important"], "rewrite": "After exceeding the reservation period, we will delete or deal with your personal information according to the requirements of the applicable law."}
{"task": "rw_61.jsonl", "id": 58678, "text": "(2) Storage location", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58679, "text": "The personal information we collected and generated in the operation of the People's Republic of China will be stored in China.", "label": ["Data Retention", "Important"], "rewrite": "The personal information we collected and generated in the operation of the People's Republic of China will be stored in China."}
{"task": "rw_61.jsonl", "id": 58680, "text": "In the following circumstances, we will provide your personal information to possible overseas entities after fulfilling the obligations stipulated in the law:", "label": ["Data Retention", "Important", "Risk"], "rewrite": "In the following circumstances, we will provide your personal information to possible overseas entities after fulfilling the obligations stipulated in the law:"}
{"task": "rw_61.jsonl", "id": 58681, "text": "1. The applicable laws have clear regulations;", "label": ["Data Retention", "Important"], "rewrite": "If the applicable laws are clearly stipulated, they provide information to the overseas."}
{"task": "rw_61.jsonl", "id": 58682, "text": "2. Get your alone consent;", "label": ["Data Retention", "Important"], "rewrite": "Those who get your own consent will provide information overseas."}
{"task": "rw_61.jsonl", "id": 58683, "text": "3., you are necessary for cross -border e -commerce transactions and other types of contracts for one party.", "label": ["Data Retention", "Important"], "rewrite": "If the contract is established and fulfilled, you provide personal information to the abroad."}
{"task": "rw_61.jsonl", "id": 58684, "text": "In response to the above situations, we will protect your personal information security in accordance with this policy.", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58685, "text": "(3) Storage safety", "label": ["Data Security"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58686, "text": "1. Data protection technical measures", "label": ["Data Security"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58687, "text": "We have adopted our information that meets industry standards, reasonable and feasible security measures to protect your information, and prevent personal information from being disclosed, used, modified, damaged or lost by unauthorized access, publicly disclosed, used, modified, damaged, or lost.", "label": ["Important", "Data Security"], "rewrite": "We have taken information that meets industry standards, reasonable and feasible security measures to protect your information."}
{"task": "rw_61.jsonl", "id": 58688, "text": "For example, we will use encrypted technology to improve the security of personal information. When you exchange data between your browser and the server, the SSL protocol is encrypted and protected, and we provide the HTTPS protocol security browsing method;", "label": ["Important", "Data Security"], "rewrite": "We will use encrypted technology to improve the security of personal information. When you exchange data between your browser and the server, we are encrypted by SSL protocols. We provide the HTTPS protocol security browsing method."}
{"task": "rw_61.jsonl", "id": 58689, "text": "We will use a trusted protection mechanism to prevent personal information from being maliciously attacked;", "label": ["Important", "Data Security"], "rewrite": "We will use a trusted protection mechanism to prevent personal information from being maliciously attacked."}
{"task": "rw_61.jsonl", "id": 58690, "text": "We will deploy the access control mechanism to make every effort to ensure that only authorized personnel can access personal information.", "label": ["Important", "Data Security"], "rewrite": "We will deploy the access control mechanism to make every effort to ensure that only authorized personnel can access personal information."}
{"task": "rw_61.jsonl", "id": 58691, "text": "At present, our important information systems have been evaluated through the third level of network security level protection.", "label": ["Important", "Data Security"], "rewrite": "Our important information system has been evaluated through the third level of network security level."}
{"task": "rw_61.jsonl", "id": 58692, "text": "2. Measures for data protection management organization", "label": ["Data Security"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58693, "text": "We have established a data security management system that is advanced in the industry with data as the core and the data security management system around the data life cycle, and improves the security of personal information from organizational construction, institutional design, personnel management and product technology.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58694, "text": "We have set up a full -time department for personal information protection.", "label": ["Important", "Data Security"], "rewrite": "We have set up a full -time department for personal information protection."}
{"task": "rw_61.jsonl", "id": 58695, "text": "Through training courses and examinations, we have continuously strengthened employees' awareness of protecting the importance of personal information.", "label": ["Important", "Data Security"], "rewrite": "Through training courses and examinations, we have continuously strengthened employees' awareness of protecting the importance of personal information."}
{"task": "rw_61.jsonl", "id": 58696, "text": "3. Response of personal information security incident", "label": ["Data Security"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58697, "text": "If our physical, technical, or management protection facilities are damaged, and the information is caused by unauthorized access, public disclosure, tampering or destruction, and damage to your legitimate rights and interests, we will launch an emergency plan in time and take reasonable and necessary measures.In order to reduce the impact on your personal.", "label": ["Important", "Data Security"], "rewrite": "If a security incident occurs, we will launch an emergency plan in time and take reasonable and necessary measures to minimize the impact on your personal."}
{"task": "rw_61.jsonl", "id": 58698, "text": "If a personal information security incident occurs, we will also inform you the basic situation and possible impact of the security incident in accordance with the requirements of the laws and regulations.Remedy.", "label": ["Important", "Data Security"], "rewrite": "If a personal information security incident occurs, we will also inform you the basic situation and possible impact, disposal measures, suggestions, and remedy measures of the security incident."}
{"task": "rw_61.jsonl", "id": 58699, "text": "We will inform you in SMS, telephone, push notification, and other reasonable channels that it is difficult to inform one by one. We will publish an announcement in a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "We will inform you in SMS, telephone, push notification, and other reasonable channels that it is difficult to inform one by one. We will publish an announcement in a reasonable and effective way."}
{"task": "rw_61.jsonl", "id": 58700, "text": "At the same time, we will also report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "We will also report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities."}
{"task": "rw_61.jsonl", "id": 58701, "text": "4. Prevention of account security risk", "label": ["Data Security"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58702, "text": "When using 1688 platform services for online transactions, you inevitably disclose your personal information to the other party or potential transaction of the transaction, such as contact or contact address.", "label": ["Important", "Data Security"], "rewrite": "When conducting online transactions, it is inevitable to disclose your personal information to the transaction party, such as contact or contact address."}
{"task": "rw_61.jsonl", "id": 58703, "text": "In addition, you can also establish communication, exchange information or analysis content with our services.", "label": ["Important", "Data Security"], "rewrite": "You can also establish communication, exchange information or analysis content with third parties through our services."}
{"task": "rw_61.jsonl", "id": 58704, "text": "Please protect your personal information properly, provides others only under the necessary circumstances, and do not trust the transaction through other trading tools to avoid the stolen information or even encounter telecommunications network fraud.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58705, "text": "If you are worried that your personal information, especially your account or password, please contact [our customer service] immediately so that we can take corresponding measures based on your application.", "label": ["Important", "Data Security"], "rewrite": "If you are worried that your personal information will be leaked, please contact [our customer service] immediately so that we can take corresponding measures based on your application."}
{"task": "rw_61.jsonl", "id": 58706, "text": "You can also modify the login password in \"My-Settings-Account and Security\".", "label": ["Edit/Control", "Data Security", "Important"], "rewrite": "You can also modify the login password in \"My-Settings-Account and Security\"."}
{"task": "rw_61.jsonl", "id": 58707, "text": "6. Policy update", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58708, "text": "In order to bring you a better product and service experience, we continue to strive to improve our products, services and technology.", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58709, "text": "When the new service and business processes change, we may update our privacy policy to inform you of specific changes.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58710, "text": "But without your clear consent, we will not limit your rights you enjoy in accordance with this policy.", "label": ["Policy Change", "Important"], "rewrite": "But without your clear consent, we will not limit your rights you enjoy in accordance with this policy."}
{"task": "rw_61.jsonl", "id": 58711, "text": "We will release any changes to this policy on the special page.", "label": ["Policy Change", "Important"], "rewrite": "We will release any changes to this policy on the special page."}
{"task": "rw_61.jsonl", "id": 58712, "text": "For major changes, we will also provide more significant notifications (including we will notify or provide you with pop -up window prompts through 1688 platforms).", "label": ["Policy Change", "Important"], "rewrite": "For major changes, we will also provide a more significant notice."}
{"task": "rw_61.jsonl", "id": 58713, "text": "The major changes in this policy include, but not limited to:", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58714, "text": "1. The business model of the product has changed significantly.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58715, "text": "Such as the purpose of handling personal information, the type of personal information, and the use of personal information;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58716, "text": "2. The main body of the privacy policy caused by business adjustment and transaction mergers and acquisitions, and the new subject receiving party changes the original processing purpose and method of treatment;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58717, "text": "3. The main object of personal information sharing or public disclosure changes;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58718, "text": "4. User personal information rights and their exercise methods have changed significantly;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58719, "text": "5. When dealing with the person in charge of the person in charge of the personal information protection and the change of complaint channels;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58720, "text": "6. Personal information protection assessment report shows that the existence of products has a significant impact on personal rights.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58721, "text": "We will also archive the old version of this policy on the special page of the 1688 platform for you to check.", "label": ["Policy Change", "Important"], "rewrite": "We will also archive the old version of this policy on the special page of the 1688 platform for you to check."}
{"task": "rw_61.jsonl", "id": 58722, "text": "7. Protection of minors", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58723, "text": "In e -commerce activities, we preferably you have the corresponding civil behavior capabilities.", "label": ["Important", "Risk"], "rewrite": "In e -commerce activities, we preferably you have the corresponding civil behavior capabilities."}
{"task": "rw_61.jsonl", "id": 58724, "text": "If you are a minor, we ask you to ask your parents or other guardians to read this policy carefully, and use our services or provide information to us under the consent of your parents or other guardians.", "label": ["Specific Audiences", "Important"], "rewrite": "Under the premise of obtaining our parents or other guardians, minors use our services or provide information to us."}
{"task": "rw_61.jsonl", "id": 58725, "text": "If you are under 14 years of age, [Before you use our service, you and your guardian should read our \"Personal Information Protection Rules for Children\" carefully to ensure that the guardian's \"Personal Information Protection Rules\" is obtainedAfter you agree], you can use our services under the guidance of the guardian to ensure that you are safe when using our services and trading.", "label": ["Specific Audiences", "Important"], "rewrite": "Before the child under the age of 14, you and the guardian should read the \"Personal Information Protection Rules\" carefully to ensure that the consent of the guardian is obtained."}
{"task": "rw_61.jsonl", "id": 58726, "text": "If you are a child's parents or other guardians, please pay attention to whether the child uses our service after obtaining your authorization consent.", "label": ["Specific Audiences", "Important"], "rewrite": "Children's parents or other guardians, please pay attention to whether the child uses our service after obtaining authorization."}
{"task": "rw_61.jsonl", "id": 58727, "text": "If you have any questions about your child's personal information, please contact our personal information protection department.", "label": ["Specific Audiences", "Important"], "rewrite": "If you have any questions about your child's personal information, please contact our personal information protection department."}
{"task": "rw_61.jsonl", "id": 58728, "text": "Eight, contact us", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58729, "text": "You can contact us in the following ways. We will reply to your request within 15 days:", "label": ["Important", "Contact Information"], "rewrite": "You can contact us in the following ways. We will reply to your request within 15 days:"}
{"task": "rw_61.jsonl", "id": 58730, "text": "1. If you have any questions, opinions or suggestions on the content of this policy, you can contact us through 1688 platform customer service and 1688 platform service center online customer service;", "label": ["Important", "Contact Information"], "rewrite": "You can contact us through 1688 platform customer service and 1688 platform service center online customer service."}
{"task": "rw_61.jsonl", "id": 58731, "text": "2. We have also set up a full -time information protection department for personal information. You can use [pipwg1688@service.alibaba.com] to contact it (please indicate that it is related to the 1688 platform and explain the specific facts), office address: [Hangzhou City, Hangzhou CityFlooring Legal Service Desk, Building No. 4, No. 969, Wenyi Road, Yuhang District].", "label": ["Important", "Contact Information"], "rewrite": "We have also set up a full -time department for personal information protection. You can contact it through [pipwg1688@service.alibaba.com]."}
{"task": "rw_61.jsonl", "id": 58732, "text": "It should be noted that we may not reply to the issue that has nothing to do with the right to this policy or your personal information.", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58733, "text": "If you are not satisfied with our reply, especially if you think our personal information processing behavior has harm your legitimate rights and interests, you can also seek solutions by filed a lawsuit to a court with jurisdiction in the place of residence in the defendant.", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58734, "text": "Appendix: Related Definition", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58735, "text": "1688 platform: refers to the 1688 platform (the domain name involved in Alibaba.com.cn, Alibaba.cn, 1688.com) website and Alibaba (1688) client.", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58736, "text": "1688 platform service provider: refers to the 1688 platform's Internet information and software technology service providers Hangzhou Alibaba Advertising Co., Ltd., Alibaba (China) Network Technology Co., Ltd.", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58737, "text": "Related Company: Refers to the affiliated company of 1688 platform service providers disclosed by Alibaba Group Holding Limited (Alibaba Group Holding Limited).", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58738, "text": "Alipay: Refers to the main Alipay (China) Network Technology Co., Ltd. providing Alipay services.", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58739, "text": "Personal information: Various information related to the recognized or recognized natural persons recorded in electronics or other ways, excluding information after anonymous processing.", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58740, "text": "Sensitive personal information: Once sensitive personal information is leaked or illegally, it is easy to lead to personal information that is harmful to natural person's personality dignity or personality and property security.Track information, and personal information of minors under the age of 14.", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58741, "text": "Child: Refers to minors under the age of 14.", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58742, "text": "Equipment information: Including device identifiers (IMEI, IDFA, Android ID, Mac, OAID, IMSI and other device -related information), application information (application crash information, notification switch status, application installation list, and other application related information), equipment parameters), equipment parametersAnd system information (device type, device model, operating system and hardware -related information), device network environment information (IP address, WIFI information, base station information and other network -related information).", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58743, "text": "The actual collection of the product shall prevail.", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58744, "text": "Service log information: Including browsing records, click to view records, search query records, collection, add to shopping carts, transactions, after -sales, follow sharing information, publishing information, and IP address, browser type, telecommunications operator, use language, access, accessDate and time and the webpage record you visit.", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58745, "text": "Decoration: Refers to the process of personal information processing, so that it cannot recognize specific natural persons without using additional information.", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58746, "text": "Anonymous: Refers to the process that personal information cannot identify specific natural persons and cannot recover.", "label": [], "rewrite": []}
{"task": "rw_61.jsonl", "id": 58747, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
