{"task": "rw_68.jsonl", "id": 60639, "text": "Douyu Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60640, "text": "Version update prompt:", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60641, "text": "Dear Douyu users, thank you for trusting and using Douyu's products and services. Recently, we have made a major update on Douyu's \"Privacy Policy\", mainly including:", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60642, "text": "1. Optimize the content of the document to make the document more suitable for reading and understanding;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60643, "text": "2. Modified and optimized the content of each chapter in part of the second part of this privacy policy, and at the same time, the eighth chapter \"Protection of the Personal Information of the Death\";", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60644, "text": "3. Optimize the paths and methods of personal information management, query, deletion, change;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60645, "text": "4. Refine the \"Sharing Personal Information List of Douyu and Third Party\", and add \"Douyu Has Collection Personal Information List\" at the same time;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60646, "text": "In order to better protect your personal information, it is recommended that you carefully read the updated \"Douyu Privacy Policy\", especially the black bold part.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60647, "text": "If you have any objections or doubts about the terms of privacy policy, you can communicate with us through the contact information published in the second part of the \"Privacy Policy\" in the second part of this \"Privacy Policy\".", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60648, "text": "【Special Note】", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60649, "text": "Before using the products or services of the Douyu platform, please be sure to read and thoroughly understand this policy, especially the clauses that are identified by the threatening line. You should focus on reading.Product or service.", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60650, "text": "Once you start using the products or services of Douyu platform, it means that you have fully understood and agree with this policy.", "label": ["Policy Change", "Important", "Risk"], "rewrite": "Once you start using the products or services of Douyu platform, it means that you have fully understood and agree with this policy."}
{"task": "rw_68.jsonl", "id": 60651, "text": "Douyu's product/service is Wuhan Yueyue.com (registered address: Wuhan Donghu New Technology Development Zone Software Garden East Road Software Industry 4.1 Phase 8 Building B1 8th Floor) and its related parties providersProducts/services provided to you: including but not limited to Douyu APP, Douyu Speed Edition APP, Douyu HD App, Douyu Mobile Games Live Assistant App, Douyu PC, Douyu Live Partner PC and other client client applications and other client application applicationsProgram, Douyu's official website (www.douyu.com), and software development tool packs (SDK) and application programming interface (API) for third -party website applications;", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60652, "text": "Users under 14 years of age apply for this policy and the \"Personal Information Protection Rules and Guardian Instructions of Douyu Minors\".", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60653, "text": "What needs to be specifically explained is that this policy is not applicable to other third -party products/services connected to your products/services (\"Other third parties\", including your dearcular, any third -party website, and third -party servicesFor provisions, etc., please refer to the privacy policy or similar statement of the third party, and do not take any responsibility for any third party's use of information.", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60654, "text": "The functions between the products of the Douyu Platform may be different. If the privacy policy is set up separately, it will give priority to its separate privacy policy.", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60655, "text": "If the separate privacy policy is inconsistent with the existence of this policy, it is subject to a separate privacy policy;", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60656, "text": "The parts that are not mentioned in a separate privacy policy clause shall prevail in this policy.", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60657, "text": "The first part of the noun explanation", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60658, "text": "1. Douyu Platform: Refers to Douyu website (domain name Douyu.com), Douyu APP client and its associated version.", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60659, "text": "The affiliated version includes but not limited to the client application such as Douyu Speed App, Douyu HD App, Douyu Mobile Games Live Assistant App, Douyu PC, Douyu Live Partner PC and other client applications.", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60660, "text": "2. Douyu Platform Service: Refers to the various forms (including the new service forms of future technological development) based on the Internet, including the Internet, including the Internet, including the Internet, including the Douyu platform website, client and its related versions.You provide various services, communities, games and other services.", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60661, "text": "3. Douyu Platform Service Provider: The following is called \"We\", which refers to Wuhan Yueyue.com and its related parties, including but not limited to Wuhan Douyu Network Technology Co., Ltd.And its domestic branch.", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60662, "text": "4. User: The following is called \"you\" or \"user\", which refers to individuals or organizations registered, logged in, use, browse, and obtain the service under this policy.", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60663, "text": "5. Personal information: Refers to various information related to the recognized or recognizable natural person recorded in electronics or other ways, excluding information after anonymous processing.", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60664, "text": "6. Sensitive personal information: It refers to personal information that can easily lead to the personality of natural person's personality and dignity once it is leaked or illegally used.Information such as trajectory, as well as personal information of minors under the age of 14.", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60665, "text": "7. Delete of personal information: Refers to removing personal information in a system involved in daily business functions, so that it keeps them from being retrieved and accessible.", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60666, "text": "8. Children: Refers to minors under the age of 14.", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60667, "text": "9. Devision: Refers to the processing of personal information to make it unable to identify specific natural persons without using additional information.", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60668, "text": "10. Anonymous: Refers to the process of processing personal information that cannot be recognized by specific natural persons and cannot be restored.", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60669, "text": "Part 2 Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60670, "text": "The following will help you understand how we collect, use, store, transmit, open and protect personal information;", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60671, "text": "Help you know how to query, correct, supplement, delete, copy, and transfer personal information.", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60672, "text": "Among them, the important part of your personal information rights, especially sensitive personal information, have been prompting in bold forms, please pay special attention.", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60673, "text": "1. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60674, "text": "2. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60675, "text": "3. How can we share, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60676, "text": "4. How do we save personal information", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60677, "text": "5. How do we protect personal information", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60678, "text": "6. How do you manage your personal information", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60679, "text": "7. Our personal information for the personal information of minors", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60680, "text": "8. We protect the personal information of the dead users", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60681, "text": "Nine, the inspection and revision of privacy policies", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60682, "text": "10. Contact us", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60683, "text": "1. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60684, "text": "(1) Account service", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60685, "text": "1. Douyu unified account number", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60686, "text": "In order to facilitate us to provide you with the needs of consistent services, improve personalized experience, and realize safety risk control, Douyu's products/services will apply a unified account system.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The unified account system of products/services is allowed to provide consistent services and the needs of safety control."}
{"task": "rw_68.jsonl", "id": 60687, "text": "You can use Douyu account to log in to the Douyu platform conveniently to use the corresponding product/service function.", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60688, "text": "In order to provide a consistent service experience in the Douyu platform, we will use the accounts and contents of the Douyu platform with SDK or related technologies, which may include: sharing nicknames, avatars, regions, gender, etc. It is set to open account information;", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Use SDK or related technologies to synchronize the account and content in the Douyu platform to provide consistent services."}
{"task": "rw_68.jsonl", "id": 60689, "text": "Simultaneous attention, fans and other user relationships;", "label": ["Third Party Sharing/ Disclosure", "First Party Collection Information"], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60690, "text": "Synchronize the content published by this account;", "label": ["Third Party Sharing/ Disclosure", "First Party Collection Information"], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60691, "text": "Synchronize other information you authorize.", "label": ["Third Party Sharing/ Disclosure", "First Party Collection Information"], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60692, "text": "2. Register and log in", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60693, "text": "In order to provide you with account registration and login function, you need to provide the following information:", "label": ["Important", "Usage"], "rewrite": "You need to provide information to provide you with account registration and login function."}
{"task": "rw_68.jsonl", "id": 60694, "text": "(1) When you register and log in to the Douyu platform through your mobile phone number, you need to provide us with mobile phone numbers, login passwords, and mobile phone verification codes.", "label": ["Important", "First Party Collection Information"], "rewrite": "When registering and logging in through the mobile phone number, you need to provide mobile phone numbers, login passwords, and mobile phone verification codes."}
{"task": "rw_68.jsonl", "id": 60695, "text": "Collecting the mobile phone number is a necessary information on the requirements of the national laws and regulations on the requirements of the online real -name system (real identity information certification). If you refuse to provide the mobile phone number for registration and login, we may not be able to provide you with information release related functions;", "label": ["Important", "Usage"], "rewrite": "Collecting the mobile phone number is the requirements of the online real -name system."}
{"task": "rw_68.jsonl", "id": 60696, "text": "(2) When you log in to the Douyu platform through the nickname, you need to provide us with a nickname and login password;", "label": ["Important", "First Party Collection Information"], "rewrite": "When logging in to the Douyu platform through the nickname, you need to provide nicknames and login passwords."}
{"task": "rw_68.jsonl", "id": 60697, "text": "(3) You can use a third -party account to register and log in to the Douyu platform, but you need to authorize us to obtain information on your third -party platform (avatar, nickname and other public information and information you authorize) to generate the third party and the third partyThe account binding of the Douyu account allows you to register, log in and use the Douyu platform directly.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When registering with a third -party account and login platform, the information of the third -party platform needs to be authorized to generate Douyu accounts bound to the third -party account."}
{"task": "rw_68.jsonl", "id": 60698, "text": "Among them, when you use Apple, ID to register, log in to Douyu platform, we will get your Apple, ID, nickname, avatars and access vouchers;", "label": ["Important", "First Party Collection Information"], "rewrite": "When you register and log in with Apple ID, you will get your Apple ID, nickname, avatar, and access vouchers."}
{"task": "rw_68.jsonl", "id": 60699, "text": "(4) Provide the above information and read and agree, agree to the \"User Registration Agreement\", \"Specifications for Sunshine Behavior\" and this policy, and will complete the registration and login of the account. After that, you can use the Douyu platform to watch the live content, publish barrage information, and publish barrage information, and release the barrage information, and release the barrage information, and release the barrage information.Use bucket game service.", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60700, "text": "If you do not provide the above information or do not register an account, it will not affect your browsing and search services provided by the Douyu platform, but it may affect other additional functions of your Douyu platform.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60701, "text": "3. Real -name authentication", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60702, "text": "When you open a live broadcast or use other functions or services that require real -name authentication, in order to comply with the provisions of laws and regulations and related regulatory requirements, you need to provide you with real identity information (real name, ID number, face information) to complete the real -name authentication.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you open a live broadcast or use other real -name authentication functions or services, you need to provide real identity information to complete the real -name authentication."}
{"task": "rw_68.jsonl", "id": 60703, "text": "In the process of real -name authentication, a third -party certification agency that provides certification services may verify your true identity information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "A third -party certification agency that provides certification services can verify your true identity information."}
{"task": "rw_68.jsonl", "id": 60704, "text": "For specific personal information processing rules, please refer to the privacy policy, service agreement or similar text set up by the third -party institution.", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60705, "text": "This information is for the purpose stipulated in the real -name certification and laws and regulations. It will not be used as other purposes without authorization.", "label": ["Important", "Usage"], "rewrite": "The information that is authorized for real -name certification and laws and regulations without your explicit authorization will not be used as other purposes."}
{"task": "rw_68.jsonl", "id": 60706, "text": "The above information is a sensitive personal information. You can refuse to provide it and will not affect the normal use of other functions/services of the Douyu platform, but you may not be able to use the features or related services that must be authenticated in real -name authentication.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60707, "text": "4. Recove on the account", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60708, "text": "When you need to retrieve your Douyu account/password, in order to ensure the security of the account, you need to provide some personal information to perform your identity test, including but not limited to mailbox, nickname, mobile phone number, dynamic verification code, ID number, ID number, and ID number, ID number, ID number, and ID number, and ID number, ID number, ID number, and ID number.Face information, registration information, historical information, other information, specific information is different according to the type of object type you need to retrieve.", "label": ["Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "When you need to retrieve your account/password, you need to provide some personal information for your identity test."}
{"task": "rw_68.jsonl", "id": 60709, "text": "In addition, a third -party institution that provides certification services may verify your true identity information. For specific personal information processing rules, please refer to the privacy policy, service agreement or similar text set up by the third -party institution.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "A third -party agency that provides certification services to verify your true identity information."}
{"task": "rw_68.jsonl", "id": 60710, "text": "5. Account open information", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60711, "text": "(1) After you log in to Douyu account, you can voluntarily choose whether to improve your avatar, nickname, gender, birthday, location, personalized signature and other personal information;", "label": ["Important", "Edit/Control"], "rewrite": "After you log in to your account, you can choose whether to improve your avatar, nickname, gender, birthday, location, personalized signature and other personal information."}
{"task": "rw_68.jsonl", "id": 60712, "text": "(2) Your attention and attention list, the number of fans and the list of fan, your personal information (constellation, social relationship, additional time, etc.), the fans' medal, the fish bar you addedDynamic/video, anchor encyclopedia information will be publicly displayed on the personal homepage (personal space) of the account.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Your attention and attention list, fan number and fan list, your personal information, etc. will be displayed publicly in the personal homepage (personal space) of your account."}
{"task": "rw_68.jsonl", "id": 60713, "text": "You can close the public display of fan badge, follow list, and fan lists through the path of \"Settings-Privacy-Personal Space Privacy Settings\" path;", "label": ["Important", "Edit/Control"], "rewrite": "You can close the public display of fan badge, focus list, and fan lists through the \"Settings-Privacy-Privacy Settings\" path."}
{"task": "rw_68.jsonl", "id": 60714, "text": "(3) When we publish a prize announcement, we will publish information such as the relevant account nicknames;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When we issue a prize announcement, we will publish information such as the relevant account nickname."}
{"task": "rw_68.jsonl", "id": 60715, "text": "We will anonymous processing of the information published by the illegal user account.", "label": ["Important", "Data Security"], "rewrite": "Anonymous processing of the information published by the illegal user account."}
{"task": "rw_68.jsonl", "id": 60716, "text": "6. The anchor signing", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60717, "text": "When you use the \"Signing Center\" to sign an anchor, we need you to provide a contract with personal information, emergency contact information, and collection account information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the \"Signing Center\" to sign an anchor, you need to provide you with a contract with personal information, emergency contact information, and receipt account information."}
{"task": "rw_68.jsonl", "id": 60718, "text": "Among them, the signing of personal information includes at least names, documents, mailboxes, addresses, contact numbers, and front and back photos of ID cards. You can also voluntarily choose whether to provide us with QQ/Weibo/WeChat/Alipay account.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you provide a contract with personal information, you can also choose whether to provide us with QQ/Weibo/WeChat/Alipay account."}
{"task": "rw_68.jsonl", "id": 60719, "text": "Emergency contact information includes names, telephones, mailboxes and address.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60720, "text": "The receipt account information includes the cardholder's name, the cardholder's certificate number, the bank card number, the account opening bank, the place of account opening, the name of the branch, and the bank number.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60721, "text": "(2) Service content browse/search/play/download", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60722, "text": "1. Service content browse/play/download", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60723, "text": "When you use our live broadcast room, fish bar community (circle), video, audio and other service content to browse and playback functions, provide you with a continuous and consistent experience and optimized page display for you.Browser type, equipment information, personal access to the Internet.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the service content browsing and playback function, you need to collect your browser type, equipment information, and personal Internet records to provide you with consistent services and optimized page display."}
{"task": "rw_68.jsonl", "id": 60724, "text": "The aforementioned device information includes: device model, operating system version, device settings, Android, MAC address, IMEI, IDFA, OAID and other device logo and equipment environment.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60725, "text": "The aforementioned personal Internet records include: browsing/click/play records, collection/attention/attention/reservation records, likes/sharing/release records, etc.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60726, "text": "When you use the download function, after you agree, we will use your storage permissions so that you can write related files within your device.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "When you use the download function, you can obtain the storage permissions in order to write related files within the device."}
{"task": "rw_68.jsonl", "id": 60727, "text": "In the process of browsing, you can follow the anchors and users you are interested in.", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60728, "text": "2. Service content search", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60729, "text": "When you use the search function, we will automatically collect some of your information, including the following information: the content of the search, shear, and log records.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the search function, collect information such as the content of your search, cutting plate, log record and other information."}
{"task": "rw_68.jsonl", "id": 60730, "text": "In order to provide efficient search services, some of the aforementioned information will be temporarily stored on your local device, and show you the content of the search results and search history.", "label": ["Data Retention", "Important"], "rewrite": "The content of the search, shear board, and log record information will be temporarily stored on the local device side, and show you the search results content and search historical records."}
{"task": "rw_68.jsonl", "id": 60731, "text": "In addition, please know that when you download the Douyu APP through the webpage, app store, etc., in order to clarify your download source, after you click \"Download/Installation\", we will collect your clipboard information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to clarify your download source, after you click \"Download/Installation\", we will collect your clipboard information."}
{"task": "rw_68.jsonl", "id": 60732, "text": "(3) Information production and release", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60733, "text": "1. When you use pictures/audio and video production, release, live broadcast, posts, barrage, comment, message and other functions, you may actively provide relevant graphic/audio and video content information.", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60734, "text": "We will collect your above information and show your nicknames, avatars, and publishing content.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "When you use pictures/audio and video production, release and other functions, collect the graphic/audio and video content information you actively provide, and display your nickname, avatar, and publishing content."}
{"task": "rw_68.jsonl", "id": 60735, "text": "The information you posted may include personal information of others. Please obtain legal authorization of others to avoid illegally leaking personal information of others.", "label": ["Important"], "rewrite": "If the information you posted contains the personal information of others, please be able to obtain legal authorization of others to avoid illegal leakage."}
{"task": "rw_68.jsonl", "id": 60736, "text": "As for the production and release function of the aforementioned part of the information, when you use it, we will ask you to authorize the rights of the camera, album, and microphone.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use the information of the information and publish, we will ask you to authorize the rights of cameras, albums, and microphones."}
{"task": "rw_68.jsonl", "id": 60737, "text": "At the same time, when you use the live video function, your live broadcast content will be stored in our server because storage is necessary to achieve this function.", "label": ["Data Retention", "Important", "First Party Collection Information"], "rewrite": "When you use the live video function, the live broadcast content will be stored in our server."}
{"task": "rw_68.jsonl", "id": 60738, "text": "2. Live tool", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60739, "text": "(1) Virtual image function", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60740, "text": "When you use the face -based virtual image -based virtual image function, we will collect your facial expression flow in real time. The data will not share with any third party or store.", "label": ["Data Retention", "Important", "First Party Collection Information"], "rewrite": "When you use a virtual image function, we will collect your facial expression flow in real time, and the data will not be shared with any third party and will not be stored."}
{"task": "rw_68.jsonl", "id": 60741, "text": "When you use this type of additional features, we will collect your facial features and use it strictly within the scope of your authorization.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use a virtual image function, we will collect your facial features and use it within the scope of your authorization."}
{"task": "rw_68.jsonl", "id": 60742, "text": "(2) Visual tools", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60743, "text": "In order to provide you with better video visual effects, we provide you with video beautification functions such as beauty, beauty, beauty, filter, gestures, face stickers and other video.", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60744, "text": "When you use this function, we will recognize your skin and facial features to locate your facial features and judge the results according to the location to match makeup or provide corresponding special effects.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use various beautification functions, we will identify your skin and facial features to locate your facial features and match your makeup or provide corresponding special effects."}
{"task": "rw_68.jsonl", "id": 60745, "text": "This function is implemented on your local device. We will not use the aforementioned information for face recognition, nor will it be passed on, storage or shares your information with a third party.", "label": ["Data Retention", "Important"], "rewrite": "The various beautification functions are only implemented on the local device side. We will not use skin and facial parameters for face recognition, nor will we return, store or share your information with third parties."}
{"task": "rw_68.jsonl", "id": 60746, "text": "In addition, we will record the beauty parameters you set in the login state (such as the grinding index, whitening index, etc.), so that you can directly match the corresponding parameters when you log in to use this function next time, so that you can use it.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We will record the beauty parameters you set, so that you can log in directly next time."}
{"task": "rw_68.jsonl", "id": 60747, "text": "(4) Exchange interaction", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60748, "text": "1. Follow", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60749, "text": "You can follow the anchor/user by searching for the nickname/room number, click on the user's nickname, etc.", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60750, "text": "When you follow or cancel the anchor/user in Douyu, we will create/adjust the number of fans and the list of fan lists, the number of attention and the list of attention, and the list of friends.", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60751, "text": "2. Friends/group interaction", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60752, "text": "(1) When you interact between fighting fish users, in order to maintain the stability of the service, we may collect your interactive information;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you interact between fighting fish users, we may collect your interactive information."}
{"task": "rw_68.jsonl", "id": 60753, "text": "(2) When you interact with your friends, we will form your \"recent interaction\" friends list;", "label": ["Important", "Usage"], "rewrite": "When you interact with your friends, we will form your \"recent interaction\" friends list."}
{"task": "rw_68.jsonl", "id": 60754, "text": "(3) When you use Douyu Group/Team Function to interact with, we will collect information related to group/team, team, group/team member, and form group/queue list and members list;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the Douyu group/fleet function for interactive exchanges, collect information related to group/team and group/team member, and form group/team list and members list."}
{"task": "rw_68.jsonl", "id": 60755, "text": "(4) You can use the microphone to use microphone to achieve voice -even -wheat chat or recording after turning on the microphone.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60756, "text": "In the process, we will collect your recording content.", "label": ["Important", "First Party Collection Information"], "rewrite": "When your voice chats or recording, we will collect your recording content."}
{"task": "rw_68.jsonl", "id": 60757, "text": "Please know, even if you have agreed to turn on the microphone rights, we will only obtain voice information through the microphone when you actively click on the microphone icon in the client;", "label": ["Important", "First Party Collection Information"], "rewrite": "Even if you have agreed to turn on the microphone rights, you will only get voice information through the microphone when you actively click the microphone icon."}
{"task": "rw_68.jsonl", "id": 60758, "text": "(5) To share the needs of links such as activities, we may read the picture link address you recently actively saved in the device;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to achieve linking needs such as activities such as activities, read the link address you have recently actively saved in the device."}
{"task": "rw_68.jsonl", "id": 60759, "text": "(6) If you are published and commented@Other users, browse, forward, and share the content of other users, and visit the personal homepage of other users, we will record the interaction between you.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you interact with other users when publishing content and comments, we will record the interaction between you."}
{"task": "rw_68.jsonl", "id": 60760, "text": "3. Live interactive interaction", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60761, "text": "(1) If you are the anchor of the live broadcast, the live broadcast room will show your room number, Douyu account nickname and avatar.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you are the anchor of the live broadcast, the live broadcast room will show your room number, Douyu account nickname and avatar."}
{"task": "rw_68.jsonl", "id": 60762, "text": "At the same time, information you received in the live broadcast room, gifts, live broadcasts, live broadcast duration and other information will also be displayed publicly;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Demonstrate information you received in the live broadcast room, gifts, live broadcasts, live broadcast time and other information."}
{"task": "rw_68.jsonl", "id": 60763, "text": "(2) If you are a user watching live broadcast, your nickname, avatar, level, fan card, housing management identity and other account -related information, interactive information in the live broadcast room (interactive information includes but not limited to barrage, gifts, etc.) will be liveInternal display, we will form statistics in the live broadcast room based on your interaction and active situation (such as lists, heat, etc.) and publicly display.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you are a user watching live broadcast, your nickname, avatar, level, fan card, housing management identity and other account -related information, and the interactive information in the live broadcast room will be displayed publicly in the live broadcast room and publicly display the active statistics."}
{"task": "rw_68.jsonl", "id": 60764, "text": "In addition, based on the Douyu unified account system and providing consistent services, your interactive information will be synchronized in real time on the Douyu platform.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Your interactive information will be synchronized in real time on the Douyu platform."}
{"task": "rw_68.jsonl", "id": 60765, "text": "(5) Subscribe to reminder service", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60766, "text": "When you use the predetermined function of Douyu Live or Live Campaign, we will ask you to authorize/write to your calendar permissions so that we can record and notify you to the start time of the live broadcast.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "When you use the predetermined function, we will ask you to authorize/write to your calendar permissions."}
{"task": "rw_68.jsonl", "id": 60767, "text": "We will not access and change the content that has nothing to do with Douyu live broadcast in your calendar.", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60768, "text": "Rejection of authorization will not be able to use subscription reminder services, but it will not affect the normal use of other functions of Douyu.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60769, "text": "(6) Place order, payment and delivery", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60770, "text": "1. Place order, order management function", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60771, "text": "When you buy goods/services, we need to collect the following or all of personal information based on the type of goods/service (including but not limited to fighting fish shopping, shark fin recharge, opening nobles, diamond fans, etc.)(It may include the name of the consignee, the national region, the mobile phone number, the area where it is located, and the detailed address.Order time, order amount, virtual property information (such as shark fins), transaction and consumption records, we collect this information to help you successfully complete the purchase of goods/services, ensure your transaction security, query order information/transaction records, provide customersServices, etc.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you buy goods/services, collect personal information such as the consignee information, trading product/service information, order number, and other personal information to help you successfully complete the purchase of goods/services and ensure the security of transaction."}
{"task": "rw_68.jsonl", "id": 60772, "text": "At the same time, in order to facilitate your understanding, query order information, and manage order information, we will collect the order information you generated during our service process to display it to you and facilitate the management of your order.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect the order information you generated during the service process to display it to you and facilitate the management of your order."}
{"task": "rw_68.jsonl", "id": 60773, "text": "2. Payment and settlement", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60774, "text": "(1) In order to complete the order payment and guarantee transaction security, we may need to collect your transaction amount, order time, order merchant, order number, payment method, payment account, payment status information, andPayment institutions such as WeChat, Alipay, Banking, etc.) are shared by the aforementioned part or all information;", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "In order to complete the order payment and ensure the security of transactions, collect orders such as your transaction amount and order time, and sharing the aforementioned part or all information with the payment institution."}
{"task": "rw_68.jsonl", "id": 60775, "text": "(2) When you use our withdrawal function, you need to provide your bank card or Alipay related information to complete the bank card/Alipay binding and fund settlement.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the withdrawal function, you need to provide your bank card or Alipay related information to complete the bank card/Alipay binding and fund settlement."}
{"task": "rw_68.jsonl", "id": 60776, "text": "You can view the bank card/Alipay information bound to your Douyu account on the related page of the Douyu platform or apply for a bank card/Alipay for replacement.", "label": ["Important", "Edit/Control"], "rewrite": "You can view the bank card/Alipay information bound to your Douyu account or apply for a bank card/Alipay."}
{"task": "rw_68.jsonl", "id": 60777, "text": "At the same time, we will also collect your withdrawal records for you to inquire in real time.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your withdrawal record for your real -time inquiry."}
{"task": "rw_68.jsonl", "id": 60778, "text": "3. Delivery", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60779, "text": "When you successfully place an order, such as providing or product/services for third -party merchants in the product/service department requires third -party distribution. In order to complete the distribution and delivery of goods/services in order to smoothly, safe and accurate, third -party merchants and logistics service providers cannot cannotAvoid knowing your consignee information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "When you successfully place an order, such as the provided or product/service of a third -party merchant in the product/service department requires third -party distribution, sharing your consignee information to the third party."}
{"task": "rw_68.jsonl", "id": 60780, "text": "At the same time, in order to provide you with the purpose of after -sales and dispute solutions, we may need to learn and confirm the delivery progress and status in a timely manner. You agree that we can collect information related to the delivery progress from the aforementioned subject.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to provide you with the purpose of after -sales and dispute solutions, you agree that we have collected information related to the progress related to the progress of delivery from third parties."}
{"task": "rw_68.jsonl", "id": 60781, "text": "(7) Marketing and message notification", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60782, "text": "1. Event participation", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60783, "text": "We will hold online or offline marketing activities from time to time.", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60784, "text": "In such marketing activities, we need users to provide identity information or receiving information so that we can provide ticket services or send gifts.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In marketing activities, we need to collect identity information or receiving information in order to provide ticket services or send gifts."}
{"task": "rw_68.jsonl", "id": 60785, "text": "In the absence of Douyu paying you, we may need to collect your identity information to pay for taxes.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In the absence of Douyu paying you, you need to collect your identity information to pay for taxes."}
{"task": "rw_68.jsonl", "id": 60786, "text": "2. Marketing promotion and message notification", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60787, "text": "For your contact information (such as contact telephone number, contact mailbox) you provided during the use process, we may send one or more of them in operation, for user message notification, identity verification, securityVerification, user use experience research and other uses.", "label": ["Important", "Usage"], "rewrite": "We use the contact information you provided in operation to send you notifications."}
{"task": "rw_68.jsonl", "id": 60788, "text": "After your authorization consent, we may provide you with commercial information such as advertising and business activities that you may be interested in through text messages or other ways.", "label": ["Important", "Usage"], "rewrite": "After you have authorized consent, we will personalize your recommendation to you through text messages or other ways."}
{"task": "rw_68.jsonl", "id": 60789, "text": "If you do not want to receive our commercial information, you can choose to refuse to receive through [My-Settings-Privacy-Personalized Advertising Recommendation] path, and you can also withdraw bips through the withdrawal method provided in the SMS.", "label": ["Important", "Edit/Control"], "rewrite": "You can refuse to receive commercial information through [Mine-Settings-Privacy-Personalized Advertising Recommendation] Path selection, or withdrawing through the withdrawal method provided in the SMS."}
{"task": "rw_68.jsonl", "id": 60790, "text": "(8) Service content display and recommendation", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60791, "text": "1. Positioning function", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60792, "text": "Some service content (such as \"Live-Yan Value-Near\", Live Positioning, etc.) may need to use the equipment positioning function. We will obtain the location information of your device (including IP address, GPS location, and can provide relevant information based on your authorizationSensor information such as WLAN access points, Bluetooth and base stations).", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "If some service content needs to use the device positioning function, we will obtain the location information of your device based on your authorization."}
{"task": "rw_68.jsonl", "id": 60793, "text": "If you refuse to authorize us to obtain your location permissions, you will not be able to use the aforementioned service/function, but it will not affect the normal use of other functions of Douyu.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60794, "text": "2. Direct push", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60795, "text": "We will analyze your preferences, habits, location or user portraits based on the collected information to provide you with more suitable customized services. To this end, we need to collect your device information (such as Guid, IMEI, IDFA, IDFA), Browser model, equipment installation application list information, equipment operation application name, log information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Use the collected information to analyze your preferences, habits, location, or user portraits in order to provide you with more suitable customized services."}
{"task": "rw_68.jsonl", "id": 60796, "text": "The above log information includes:", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60797, "text": "(1) The behavior information you operate and use: click, follow, collect, search, browse, and share;", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60798, "text": "(2) The information you actively provide: feedback, reward, release information (such as barrage, post bar);", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60799, "text": "(3) The location information of the device: IP address, GPS location, and sensor information such as WLAN access points, Bluetooth and base stations that can provide relevant information. GPS geographical location is sensitive personal information. If you refuse to provide, we will not according to GPSThe information is pushing you customized content without affecting the normal use of other functions of Douyu;", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60800, "text": "(4) Equipment operation application information: During the live broadcast process, the current application name and application resources of the live broadcast equipment are used to statistically analyze the anchor live broadcast behavior and ensure the stable live broadcast environment.", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60801, "text": "Unless you obtain your authorization or laws and regulations, we will not combine the above information with any personal identity information you provided in the application to ensure that you do not recognize your individual.", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60802, "text": "We may combine the above information with other non -identity information collected from our service, and use the program algorithm to analyze and prefer analysis, and use the characteristic label to perform indirect crowd portraits to use it to recommend, display or push you that you may be interested in you may be interested in.Or more suitable for your specific function or service:", "label": ["Important", "Usage"], "rewrite": "We may combine your equipment information, log information, etc. with other non -identity information we collected, and provide you with more fit services through features and preference analysis."}
{"task": "rw_68.jsonl", "id": 60803, "text": "(1) Show you, recommend, or push a higher level of live broadcast, audio and video and other content with you. You can turn off the aforementioned service through [My-Settings-Privacy-Personalized Content Recommendation];", "label": ["Edit/Control", "Usage", "Important"], "rewrite": "The data analysis results are used to show, recommend or push to you with a higher level of live broadcast, audio and video, and other content. You can turn off the aforementioned service through [My-Settings-Privacy-Personalized Content Recommendation]."}
{"task": "rw_68.jsonl", "id": 60804, "text": "(2) Recommend your personalized advertisement with higher levels of you.", "label": ["Important", "Usage"], "rewrite": "The data analysis results are used to recommend personalized advertisements with you more than you."}
{"task": "rw_68.jsonl", "id": 60805, "text": "Personalized advertisements can reduce the invasion of unrelated advertisements. You can turn off the \"personalized advertising\" service through [My-Settings-Privacy-Personalized Advertising Recommendation].", "label": ["Important", "Edit/Control"], "rewrite": "You can close the \"personalized advertising\" service through [Mine-Settings-Privacy-Personalized Advertising Recommendation]."}
{"task": "rw_68.jsonl", "id": 60806, "text": "When you turn off the above services, we will not process your personal information based on the purpose of targeted push, but will only push you to you with universal content or advertisements that have nothing to do with your preference.", "label": ["Important", "Usage"], "rewrite": "When you close personalized advertising services, you will not process your personal information based on the purpose of targeted push, and only push universal content or advertising."}
{"task": "rw_68.jsonl", "id": 60807, "text": "Please know that personalized recommendation management services are services provided by users in the login state, and the personalized recommendation management path cannot be queried without login.", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60808, "text": "(9) Fighting Fish Game Service", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60809, "text": "1. When you use Douyu game services, in accordance with relevant laws and regulations and regulatory requirements, and to meet the realistic verification of user identity, guarantee system and service security needs, you need to provide your name and ID number to verify your verification of youReal identity and compare information with the government authority department to complete anti -addiction verification.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the Douyu game service, collect your name and ID number for your identity verification and compare information with the government authority department to complete anti -addiction verification."}
{"task": "rw_68.jsonl", "id": 60810, "text": "In order to protect the legitimate rights and interests of minors through the anti -addiction system, the game provider may collect information such as your login time, game duration, etc., and automatically intervene in the system level and restrict the time of the minor game time, enable the compulsory offline function, etc.Methods to guide minors for reasonable games.", "label": ["Specific Audiences", "First Party Collection Information", "Usage", "Important"], "rewrite": "Collect information such as login time, game duration, etc., automatically intervention and restrict the game time of minors at the system level, and enable the forced offline function."}
{"task": "rw_68.jsonl", "id": 60811, "text": "In addition, due to business operation needs, we may collect your duration of using the fish game service.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your duration of your use of fighting fish game services to meet the needs of operations."}
{"task": "rw_68.jsonl", "id": 60812, "text": "2. When you use Douyu game services, depending on the type and content of the game service, you can use Douyu account or third -party game account registration and log in to related games.", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60813, "text": "At the same time, when you register and log in with a third -party account, the game provider may need to collect your registration information in the game, such as mobile phone numbers, game accounts and passwords. You should be registered and using the third -party game account numberTake the initiative to view its privacy policies and similar texts to understand and follow its personal information collection and protection rules.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you register and log in with a third -party game account, the game provider may need to collect your registration information in the game."}
{"task": "rw_68.jsonl", "id": 60814, "text": "3. When you use Douyu game services, we will collect and show you your use records in order to make real -time viewing. The record records include but not limited to game history records, game download records, game attention/appointment/appointmentRecord.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you are using Douyu game services, collect and show you your use records in order to view in real time."}
{"task": "rw_68.jsonl", "id": 60815, "text": "(10) Information from third parties", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60816, "text": "1. When you use the \"game account binding function\", we will get the nicknames, avatars, and operating information in the game account, including your login status, battle status, achievement information, etc. for details to be used for for it for use for it for use for it for forDouyu platform information recommendation and event reward distribution.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the \"Game Account Binding Function\", get the nickname, avatar, and operating information in the game in the corresponding game account for information recommendation and activity reward distribution."}
{"task": "rw_68.jsonl", "id": 60817, "text": "You can set the function through the corresponding path in the Douyu APP.", "label": ["Important", "Edit/Control"], "rewrite": "You can set the game account binding function through the corresponding path in the Douyu APP."}
{"task": "rw_68.jsonl", "id": 60818, "text": "2. The information shared by other users contain your information.", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60819, "text": "(11) Security security", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60820, "text": "In order to improve the security of your services to provide services with our affiliated companies and partners, protect the security of personal property of you or other users or the public, and better prevent fishing websites, fraud, network vulnerabilities, computer viruses, and cyber attacks., Security risks such as network invasion, we will collect the necessary information to achieve security guarantee functions.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "Collect the necessary information to achieve security and guarantee functions to improve the security of services, prevent security risks, and protect the safety of personal property of all parties."}
{"task": "rw_68.jsonl", "id": 60821, "text": "Location information (including IP address, GPS location, and sensor information such as WLAN access points, Bluetooth and base stations that can provide relevant information), network access methods, types, status, network quality data, operation, use, service log.", "label": ["Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "In order to ensure the safe operation of software and services, collect your equipment information, location information, network information, operation, use, and service log."}
{"task": "rw_68.jsonl", "id": 60822, "text": "In addition, please understand that when you will be switched to the equipment background of the \"Douyu\" mobile application on the device screen, due to some equipment models and system reasons, you have previously used the information generated by the \"Douyu\" mobile application related functions.The collection of behaviors may not stop immediately, resulting in a short -term background information collection behavior.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you switch the \"Douyu\" mobile application to the background of the device, you may not stop the information collection immediately."}
{"task": "rw_68.jsonl", "id": 60823, "text": "Application source.", "label": ["Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "Collect the application information you installed or running the process information, the overall operation of the application to prevent malicious procedures and safe operations."}
{"task": "rw_68.jsonl", "id": 60824, "text": "3. We may use your account information, transaction information, equipment information, service log information, as well as information that our affiliated parties and partners are obtained or shared by you to determine the status and transaction risks of the account, Test and prevent safety incidents, and take necessary records, audits, analysis, and disposal measures in accordance with the law.", "label": ["Important", "Data Security", "Usage"], "rewrite": "Use your account information, transaction information, equipment information, service log information and related parties, and partners to obtain information that you can share or shared according to law to judge risks, verify, test and prevent security incidents."}
{"task": "rw_68.jsonl", "id": 60825, "text": "(12) Customer service, dispute processing and self -service service", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60826, "text": "1. Customer service and dispute processing", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60827, "text": "When you contact us or make a complaint, appeal, or consult, for your account and system security, we may need you to provide the necessary personal information to verify your true user identity.", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "When you contact us or make a complaint, appeal or consult, we may need to verify your identity."}
{"task": "rw_68.jsonl", "id": 60828, "text": "In order to facilitate the processing plan and results of helping you solve the problem or record related issues as soon as possible, we may save your communication, communication/call records and related content (including account information, to prove the relevant facts provided by the facts provided by the factsOther information, or contact information you left).", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Save your communication, communication/call records and related content in order to contact you and help you solve the problem and record processing results."}
{"task": "rw_68.jsonl", "id": 60829, "text": "If you refuse to provide the above information, we may not be able to feedback complaints, appeals or consult results in time.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60830, "text": "2. Self -service service", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60831, "text": "When you are in a specific scene or situation, you may need to check your information about your Douyu account, or feedback the related problems you encountered on the Douyu platform. In order to meet your needs more efficiently, safely, and conveniently, we will do it for you for you.Provide corresponding self -service channels.", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60832, "text": "When you conduct information inquiry or feedback through specific self -service channels, you need to provide some of your personal information, including but not limited to account nicknames, mobile phone numbers, names, ID numbers, mailboxes, registration information and other related information (The specific information type has changed depending on the self -service service), and at the same time, we may also ask for your part of your authority, including but not limited to the camera/album permissions.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "When you conduct information inquiry or feedback through specific self -service channels, you need to provide personal information such as account nickname, mobile phone number, and obtain permissions such as cameras/albums."}
{"task": "rw_68.jsonl", "id": 60833, "text": "(13) Equipment rights adjustment", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60834, "text": "In order to ensure the normal implementation of the relevant business functions, we need to call the corresponding permissions according to the specific use scenarios, and make a pop -up window before calling.", "label": ["Permission Acquisition", "Important"], "rewrite": "Receive the necessary permissions according to the specific use scenario and ask you in advance."}
{"task": "rw_68.jsonl", "id": 60835, "text": "You can also withdraw authorization.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60836, "text": "In particular, it is necessary to point out that even after your authorization, we have obtained these permissions, and we will not collect your information sometimes in related functions or services.", "label": ["Permission Acquisition", "Important"], "rewrite": "Our authority obtained by your authorization will not be used to collect your information when related functions or services are not needed."}
{"task": "rw_68.jsonl", "id": 60837, "text": "See the table below for specific permissions calling instructions:", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60838, "text": "Douyu APP application application right list list", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60839, "text": "You can select the closing part or all permissions in the setting of the device, which may cause the corresponding business functions to be unable to achieve or achieve the expected effect.", "label": ["Edit/Control", "Important"], "rewrite": "You can select the closing part or all permissions in the settings of the device."}
{"task": "rw_68.jsonl", "id": 60840, "text": "(14) Exception of authorization consent", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60841, "text": "Please understand that in the following situations, according to laws and regulations, we handle your personal information without obtain your authorization consent:", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In the following situations, according to laws and regulations, we do not need to obtain your authorization consent:"}
{"task": "rw_68.jsonl", "id": 60842, "text": "1. It is necessary for the contract to establish and fulfill the person as a party as a party;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to establish and fulfill the collection and use information necessary for the person as a party as a party, there is no need to solicit authorization consent."}
{"task": "rw_68.jsonl", "id": 60843, "text": "2. In order to perform legal procedures such as (possible) lawsuits, arbitration, execution and other legal procedures for fulfilling legal duties or statutory volunteers;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to fulfill the statutory duties or the collection and usage information necessary for the statutory volunteer, there is no need to solicit authorization consent."}
{"task": "rw_68.jsonl", "id": 60844, "text": "Or, in accordance with the requirements of laws and regulations, administrative organs or public prosecution laws, etc.);););", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60845, "text": "3. In order to deal with emergencies, or in urgent situations, it is necessary to protect the health and property security of natural people in emergencies;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to cope with emergencies, or in urgent cases to protect the life and health of natural persons and the necessary collection and use information, no need to solicit authorization."}
{"task": "rw_68.jsonl", "id": 60846, "text": "4. Implement news reports and public opinion supervision in public interests, and handle personal information within a reasonable range;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to implement news reports and public opinion supervision, deal with personal information within a reasonable scope without soliciting authorization consent."}
{"task": "rw_68.jsonl", "id": 60847, "text": "5. Treat personal information on your own or other legal disclosure within a reasonable range;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "To handle individuals and other personal information that have been disclosed by themselves within a reasonable scope, no need to solicit authorization consent."}
{"task": "rw_68.jsonl", "id": 60848, "text": "6. Other circumstances stipulated in laws and administrative regulations.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Other collection and use information stipulated in laws and regulations does not need to solicit authorization."}
{"task": "rw_68.jsonl", "id": 60849, "text": "Please note that it is not personal information that cannot identify your identity alone or combined with other information alone or directly establishing contact with you.", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60850, "text": "If we will be unable to connect with any specific individuals to combine with other information to identify the personal identity of natural people, or use it with personal information, such information will be regarded as personal information during the combination of use.", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60851, "text": "Please understand that due to the update and iteration of the Douyu platform product/service, if a function or service has not been declared to collect your information in this privacy policy in a timely manner, we will still use the on -site letter, website announcement or other appropriate ways to do separately separately.Explain the content, scope and purpose of information collection to obtain your authorization consent.", "label": ["Policy Change", "Important"], "rewrite": "If you fail to declare your information in this privacy policy in a timely manner, we will explain the content, scope and purpose of the information collection to you to obtain your authorization consent."}
{"task": "rw_68.jsonl", "id": 60852, "text": "For the details of our personal information list, you can check the following \"Fish Fish Has Collected Personal Information List\".", "label": ["Important", "First Party Collection Information"], "rewrite": "You can check the \"List of Personal Information for Douyu\"."}
{"task": "rw_68.jsonl", "id": 60853, "text": "2. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60854, "text": "(1) Cookie definition", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60855, "text": "Cookie is a neutral technology that allows website server to store data on the client or read data from the client.", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60856, "text": "In the form of small files in a string, send and store and store it in your computer, mobile device or other devices when you log in and use your website or other network content.", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60857, "text": "Cookie content is usually encrypted.", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60858, "text": "Cookie set up by the website owner is called \"First Cookie\".", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60859, "text": "Cookie set up by the website owner is called \"third -party cookie\".", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60860, "text": "Third -party cookies are allowed to provide third -party functions on the website or through the website (such as advertising, interactive content and analysis).", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60861, "text": "All parties to set these third -party cookies can recognize you when visiting related websites or other websites.", "label": ["Important", "Usage"], "rewrite": "All parties to set up third -party cookies can recognize you when visiting related websites or other websites."}
{"task": "rw_68.jsonl", "id": 60862, "text": "(2) The purpose of using cookies", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60863, "text": "In order to make you get a easier access experience, when you visit the Douyu platform website or use the services provided by Douyu platform, we may identify your identity through small data files.Step, or help judge your account security.", "label": ["Important", "Usage"], "rewrite": "When you use your service, use cookie to identify your identity so that you can access it."}
{"task": "rw_68.jsonl", "id": 60864, "text": "These data files may be Cookie, Flash Cookie, or other local storage provided by your browser or associated application (collectively referred to as \"Cookie\").", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60865, "text": "Please understand that certain services of Douyu can only be achieved by using \"cookie\".", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60866, "text": "If your browser or browser additional service allows, you can modify the degree of acceptance of Cookie or the Cookie of Douyu, but this move may affect your safe access to Douyu platform related websites and use Dou Dou in some cases and use Dou Dou Dou Dou.The services provided by the fish platform.", "label": ["Important", "Edit/Control"], "rewrite": "You can modify the degree of acceptance of Cookie through the browser or browser additional service or the Cookie of Douyu."}
{"task": "rw_68.jsonl", "id": 60867, "text": "We use cookies and similar technologies to achieve the following functions or services:", "label": ["Usage"], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60868, "text": "1. Safe and efficient products", "label": ["Usage"], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60869, "text": "We may set up Cookie or anonymous identifiers that guarantee security and ensure security, so that we can confirm whether you log in to the service safely, or whether you encounter dispersion, fraud and other illegal acts.", "label": ["Important", "Data Security", "Usage"], "rewrite": "Set up certification and security cookies or anonymous identifiers to confirm whether you log in safely or if you are illegal."}
{"task": "rw_68.jsonl", "id": 60870, "text": "Cookie can also avoid unnecessary server loads, improve service efficiency, and save resources and energy.", "label": ["Important", "Usage"], "rewrite": "Cookie can avoid unnecessary server loads and improve service efficiency."}
{"task": "rw_68.jsonl", "id": 60871, "text": "Help us improve service efficiency, improve landing and response speed.", "label": ["Usage"], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60872, "text": "2. Faster access experience", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60873, "text": "Cookie can inform us when you access our services so that we can verify your identity information and help you save the steps and processes of personal information and enter search content.", "label": ["Important", "Usage"], "rewrite": "When you access the service, Cookie can help verify your identity and simplify the login process."}
{"task": "rw_68.jsonl", "id": 60874, "text": "In Douyu's sharing page, we may use Cookie to record the browsing activities to recommend information and check the collapse, delay related abnormal conditions, and explore better service methods.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In the sharing page of Douyu, use Cookie to record the browsing activities to recommend information and check the collapse."}
{"task": "rw_68.jsonl", "id": 60875, "text": "3. More accurate preference push", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60876, "text": "Cookie can help us provide you with a personalized setting of the service style and appearance you want.", "label": ["Important", "Usage"], "rewrite": "Cookie helps you provide you with a personalized setting of the service style and appearance you want."}
{"task": "rw_68.jsonl", "id": 60877, "text": "We may use such technologies to understand your preferences and use habits. The collected information includes your equipment information, browsing information, and click information, and uses such information as log information to improve product services and recommend users, recommend users, recommend users, recommend users, recommend users, recommend users, recommend users, and recommend users.Interested information or functions and optimize your choice of advertising.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Use cookie technology to collect your device information, browse information, click on information, and store logo information for data analysis to improve product services and personalized recommendations."}
{"task": "rw_68.jsonl", "id": 60878, "text": "At the same time, we may also use third -party SDK to achieve the above collection and use.", "label": ["Usage", "Third Party Sharing/ Disclosure", "First Party Collection Information"], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60879, "text": "(3) How to manage cookies", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60880, "text": "Douyu fully respects your personal information rights. You can choose to disable some types of cookies, but you cannot refuse the necessary cookies because they are strict necessary conditions for you to provide services.", "label": ["Edit/Control", "Important"], "rewrite": "You can choose to disable some types of cookies, but you cannot refuse the necessary cookies."}
{"task": "rw_68.jsonl", "id": 60881, "text": "Absolutely necessary cookies will not store any personal information.", "label": ["Data Retention", "Important"], "rewrite": "Absolutely necessary cookies will not store any personal information."}
{"task": "rw_68.jsonl", "id": 60882, "text": "Douyu reminds you that most browsers provide users with the function of clearing the cache data of the browser. You can perform the corresponding data clearance operation in the browser settings function.", "label": ["Important", "Edit/Control"], "rewrite": "The data clearance operation can be performed in the browser settings function."}
{"task": "rw_68.jsonl", "id": 60883, "text": "However, preventing certain types of cookies may affect your continued use of services or corresponding functions that depend on Cookie provided by us.", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60884, "text": "(4) Update of the cookie policy", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60885, "text": "We may update this cookie policy from time to time or for other operations, legal or regulatory reasons to reflect the changes in the cookies we use.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60886, "text": "Therefore, please read the cookie policy in \"Privacy Policy\" regularly to understand our usage of Cookie and related technologies.", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60887, "text": "3. How can we share, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60888, "text": "(1) Sharing", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60889, "text": "1. Confidential obligations and exceptions", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60890, "text": "We have a confidential obligation to your information and will not sell or rent any information of your information, except for the following situations: except:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We have a confidential obligation to your information and will not sell or rent any information of your information, except for the following situations: except:"}
{"task": "rw_68.jsonl", "id": 60891, "text": "(1) Sharing in statutory situations: We may share your personal information to the outside world in accordance with the requirements of laws and regulations, litigation, and disputes in accordance with the requirements of administrative and judicial organs in accordance with the requirements of administrative and judicial organs;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share your personal information to the outside world in accordance with the requirements of laws and regulations, litigation, and disputes, or in accordance with the requirements of administrative and judicial organs in accordance with law."}
{"task": "rw_68.jsonl", "id": 60892, "text": "(2) Share in the case of obtaining clear consent: After getting your clear consent, we will share your personal information with other parties;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After getting your clear consent, we will share your personal information with other parties."}
{"task": "rw_68.jsonl", "id": 60893, "text": "(3) In the scope of legal requirements or permits, it is necessary to provide your personal information to the third party in order to protect the interests of Douyu and its users or the public.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the scope of legal requirements or permits, it is necessary to provide your personal information to third parties in order to protect the interests of all parties."}
{"task": "rw_68.jsonl", "id": 60894, "text": "(4) Sharing with affiliated companies: In order to facilitate us to provide you with products or services based on Douyu account, recommend information that you may be interested in, identify the Douyu account abnormal, your personal information may be with our affiliated company and//Or shared the designated service provider.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to provide you with products or services, I recommend information that you may be interested in and identify an account abnormal. Your personal information may be shared with our affiliated company and/or its designated service provider."}
{"task": "rw_68.jsonl", "id": 60895, "text": "We will only share the necessary personal information and be restricted by the purpose declared in this privacy policy. If we share your sensitive personal information or related companies to change the purpose of the use and processing of personal information, we will solicit your authorization consent again;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you share your sensitive information or change the purpose of the purpose of the collection, you will solicit your authorization consent again."}
{"task": "rw_68.jsonl", "id": 60896, "text": "(5) Sharing with authorized partners: In order to provide you with more complete and high -quality products and services, we may entrust to authorize partners or use third -party SDK related technologies to provide you with services or represent us to perform functions.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may entrust a partner or use the third -party SDK related technologies to provide you with services or represent our functions."}
{"task": "rw_68.jsonl", "id": 60897, "text": "We will only share your information for the legal, correct, necessary, specific, and clear goals of this privacy policy statement. Partners can only expose the information required for their duties, and shall not use this information for any other purposes for any other purposes.Essence", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only share your information for the purpose of this privacy policy statement. The post -workshop can only expose the necessary information of its duties and cannot use this information for other purposes."}
{"task": "rw_68.jsonl", "id": 60898, "text": "2. Sharing information scenario", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60899, "text": "At present, our authorization information includes the following:", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60900, "text": "(1) Realize the sharing information of functions or services", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60901, "text": "① When you use the functions provided by our affiliated parties, third parties, or when software service providers, smart equipment providers, system service providers are used to provide you with services, we will realize the businessThe required information shares with these related parties and third parties. It is used for comprehensive statistics and analyzes the characteristics and preferences through algorithms to form indirect crowd portraits to recommend, display or push information that you may be interested in, or push youMore suitable for your specific functions, services or commercial advertisements.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "When you use the functions provided by related parties, third parties, or third parties to provide us with us, we will share the necessary information with related parties and third parties for comprehensive statistics, preference analysis, and forming crowd portraits in order to perform portraits in order to carry out the portrait of the crowd in orderPersonalized recommendation, etc."}
{"task": "rw_68.jsonl", "id": 60902, "text": "② Login and bind other account numbers: When you log in to the third -party product or service when you use the Douyu account, or bind the Douyu account with other third -party accounts. After your consent, we will bring your nickname, avatar and other otherYour authorized information is shared with the aforementioned product or service.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "When you use the Douyu account to log in to a third -party product or service, or bind the Douyu account with other third -party accounts, we will share your nickname, avatar and other information you authorized by your consent."}
{"task": "rw_68.jsonl", "id": 60903, "text": "③ When you choose to publish the information to synchronize to our related parties or third -party products or services, Douyu may use SDK or related technologies to share information and reviews with these products or services.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "When you choose to publish information to our related parties or third -party products or services, you may share information and comments published with related parties and third -party sharing."}
{"task": "rw_68.jsonl", "id": 60904, "text": "④ Mini Program: When you use the applet, without your consent, we will not share your personal information with these developers and operators.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When you use a small program, we will not share personal information with these developers and operators without your consent."}
{"task": "rw_68.jsonl", "id": 60905, "text": "When you use a mini -program, the applet may use the authorized system authority, you can withdraw authorization in the applet.", "label": ["Important", "Edit/Control"], "rewrite": "You can withdraw system authorization in the applet."}
{"task": "rw_68.jsonl", "id": 60906, "text": "⑤ Geographical location service: When you use geographical location -related services, we will use SDK or related technologies to share the equipment location information with the location service provider so that the contents of the location include: IP information, GPS information, WLAN, WLAN, WLAN, WLAN, and WLANAccess point, Bluetooth and base station sensor information.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "When you use geographical location -related services, share the equipment location information with the location service provider so that you can respond to the results of the location."}
{"task": "rw_68.jsonl", "id": 60907, "text": "GPS information is a sensitive personal information. It refuses to provide normal use that will only affect geographical location service functions, but does not affect other functions.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60908, "text": "⑥ Payment function: The payment function will provide you with a third -party payment institution that cooperates with us.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The payment function will provide you with a third -party payment institution that cooperates with us."}
{"task": "rw_68.jsonl", "id": 60909, "text": "Third -party payment institutions may need to collect your name, bank card type and card number, validity period and mobile phone number.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Third -party payment institutions may need to collect your name, bank card type and card number, validity period and mobile phone number."}
{"task": "rw_68.jsonl", "id": 60910, "text": "The bank card number, validity period, and mobile phone number are sensitive personal information. This information is an information necessary for payment functions. It refuses to provide normal use that will cause you to use this function, but does not affect other functions.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60911, "text": "⑦ In order to adapt the message push function with the terminal model you use, we may share mobile phone models, versions and related equipment information through SDK and other technologies and terminal equipment manufacturers.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Share mobile phone models, versions and related equipment information through SDK and other technologies and terminal equipment manufacturers to achieve message push functions."}
{"task": "rw_68.jsonl", "id": 60912, "text": "⑧ Drive -free service: When you use some operators' communication package services and use our products, you may need to provide equipment information, mobile phone numbers, operators, equipment system versions, software installation lists.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "You need to provide equipment information, mobile phone numbers, operators, equipment system versions, software installation lists in order to provide you with free traffic services."}
{"task": "rw_68.jsonl", "id": 60913, "text": "您 Share service: In order to provide you with one-click sharing service, our cooperative third-party product integration Friends League+U-Share, SDK, will collect your device logo information (IMei/Androidid/IDFA) and social accounts you need to sharePublic information to complete one -click sharing service.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "+U-Share SDK collects your device logo information and open information on social accounts you need to share to complete one-click sharing services."}
{"task": "rw_68.jsonl", "id": 60914, "text": "For your information security, we have provided data security confidentiality agreement with third -party SDK service providers, and cooperation companies will strictly abide by our data privacy and security requirements.", "label": ["Important", "Data Security"], "rewrite": "We have a data security confidentiality agreement with third -party SDK service providers, and partners will comply with data privacy and security requirements."}
{"task": "rw_68.jsonl", "id": 60915, "text": "Unless you get your authorization, we will not share your personal identity information with them.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Unless you get your authorization, we will not share your personal identity information with them."}
{"task": "rw_68.jsonl", "id": 60916, "text": "(2) Realizing advertising -related shared information", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60917, "text": "① Advertising push: We may share with our partners who entrust us to promote and advertise.Increase the effective touch rate of advertising with the premise that it does not recognize your personal identity.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "We may share with your partners to share the indirect portrait label and de -identified equipment information, anonymous browsing records, search habits, and common software application list information with your personal identity to help them improve the effective touch rate of advertising."}
{"task": "rw_68.jsonl", "id": 60918, "text": "② Advertising statistics: We may share the analysis of device information or statistical information with business service providers, suppliers and other partners. This information is difficult or unable to associate with your true identity.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share with partners to analyze device information or statistical information."}
{"task": "rw_68.jsonl", "id": 60919, "text": "This information will help us analyze and measure the effectiveness of advertising and related services.", "label": ["Important", "Usage"], "rewrite": "Delaid equipment information or statistical information will help us analyze and measure the effectiveness of advertising and related services."}
{"task": "rw_68.jsonl", "id": 60920, "text": "(3) Sharing information of safety and analysis statistics", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60921, "text": "① Safe security: We attach great importance to accounts, services and content security. In order to ensure the security of your and other users' accounts and property security, so that you and our legitimate rights and interests are exempted from illegal infringement.Share the necessary equipment information, the relevant information of the device, the log information, the application information, or the process information that is being run, the overall operation of the application, the frequency of use, the application crash, the overall installation of usage, performance data, and the source of application.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "We may share the necessary equipment information, the location of the device, the relevant information, log information, application information, etc. with related parties or service providers to ensure the safety of use."}
{"task": "rw_68.jsonl", "id": 60922, "text": "② Analysis of product usage: In order to analyze the use of our services and enhance the experience of user use, it may be statistically data with related parties or third -party sharing products (collapse and flashback).Identify your personal identity.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We may analyze the statistical data of the use of products with related parties or third -party sharing products to analyze product usage."}
{"task": "rw_68.jsonl", "id": 60923, "text": "③ Academic research and scientific research: In order to improve the scientific research capabilities in related fields and promote the level of scientific and technological development, we may share the identified or anonymous data with institutions, universities and other institutions such as scientific research institutes, universities and other institutions on the premise of ensuring data security and purposes.Essence", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Under the premise of ensuring data security and purpose, we may share the identified or anonymous data with scientific research institutes, universities and other institutions to be used for academic research and scientific research."}
{"task": "rw_68.jsonl", "id": 60924, "text": "(4) Help you participate in marketing promotion activities", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60925, "text": "When you choose to participate in the relevant marketing activities organized by us and our affiliates or third parties, you may need to provide you with name, communication address, contact information, and bank account information.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "When you participate in marketing activities, you may need to provide name, communication address, contact information, and bank account information."}
{"task": "rw_68.jsonl", "id": 60926, "text": "Part of this information is sensitive personal information, refusing to provide provision that it may affect your participation in related activities, but it will not affect other functions.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60927, "text": "Only after your consent can we share this information with related parties or third parties to ensure that you get consistent services in the joint event, or entrust a third party to reward you in time.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Only after your consent can we share your name, communication address, contact information, bank account information with related parties or third parties so that you can participate in marketing activities."}
{"task": "rw_68.jsonl", "id": 60928, "text": "In order to ensure the stable operation and functional implementation of our client, so that you can enjoy and use more services and functions, we will embed the software tool development package of authorized partners in our applications (referred to as \"SDK\" in this policy) or other similar similarityapplication.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60929, "text": "We will conduct strict security tests on the application interface (API) and software tool development package (SDK) of authorized partners to obtain relevant information, and require the authorized partners to deal with personal information in accordance with this policy and other related confidentiality and security measures to handle personal information in orderProtect data security.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will conduct security testing on the API and SDKs of the authorized partners, and require them to handle personal information in accordance with this policy and other confidentiality and security measures."}
{"task": "rw_68.jsonl", "id": 60930, "text": "For the third -party software tool development package (\"SDK\") we use, and personal information shared with third parties, you can click \"Douyu and Shared Personal Information List\" to check.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You can click \"Douyu and Sharing Personal Information List with a Third Party\" to view the SDK and share personal information used."}
{"task": "rw_68.jsonl", "id": 60931, "text": "(2) Transfer", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60932, "text": "Douyu will not transfer your personal information to any company, organization, and individual, except the following situations: except:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Douyu will not transfer your personal information to any company, organization, and individual, except the following situations: except:"}
{"task": "rw_68.jsonl", "id": 60933, "text": "1. After getting your clear consent, we will transfer your personal information to other parties.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After getting your clear consent, we will transfer your personal information to other parties."}
{"task": "rw_68.jsonl", "id": 60934, "text": "2. In the case of merging, acquisition or bankruptcy liquidation on the Douyu platform service provider, or other cases involving mergers, acquisitions or bankruptcy liquidation, if you involve personal information transfer, we will ask for new companies that hold your personal information, andOrganization will continue to be subject to this policy, otherwise we will ask the company, organization or individual to re -authorize your authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When involving mergers, acquisitions, or bankruptcy liquidation, if personal information transfer is involved, it will be required to continue to be bound by the policy, otherwise it will request that it will re -solicit authorization consent."}
{"task": "rw_68.jsonl", "id": 60935, "text": "(3) Public disclosure", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60936, "text": "Douyu will publicly disclose your personal information only in the following circumstances:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Douyu will publicly disclose your personal information only in the following circumstances:"}
{"task": "rw_68.jsonl", "id": 60937, "text": "1. Get your clear consent or based on your active choice, we may publicly disclose your personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Obtain your clear consent or based on your active choice, we may publicly disclose your personal information."}
{"task": "rw_68.jsonl", "id": 60938, "text": "2. If we determine that you have violated laws and regulations or serious violations of the relevant agreements and rules of the Douyu platform, or to protect the security of the personal property of the Douyu platform users or the publicDiscover personal information about you.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you have a violation of laws and regulations or serious violations of platform agreements and rules, or to protect the safety of personal property of all parties, we may disclose your personal information based on laws and regulations or obtain your consent."}
{"task": "rw_68.jsonl", "id": 60939, "text": "(4) Removal of personal information that can be shared, transferred, and publicly disclosed in accordance with the law", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60940, "text": "Please understand that in the following circumstances, in accordance with laws and regulations and related national standards, sharing, transfer, and publicly disclose your personal information without obtaining your authorization consent in advance:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the following circumstances, in accordance with laws and regulations and related national standards, sharing, transferred, and publicly disclose your personal information without obtain your authorization consent in advance:"}
{"task": "rw_68.jsonl", "id": 60941, "text": "1. It is necessary for the contract to establish and fulfill the person as a party as a party;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to establish and fulfill the sharing, transfer or disclosure of the contract as a party as a party, no authorization is required."}
{"task": "rw_68.jsonl", "id": 60942, "text": "2. In order to perform legal procedures such as (possible) lawsuits, arbitration, execution and other legal procedures for fulfilling legal duties or statutory volunteers;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to fulfill the shared, transferred or disclosed by the statutory duties or the necessary sharing, transfer, or disclosure necessary for the statutory duty, no authorization is required."}
{"task": "rw_68.jsonl", "id": 60943, "text": "Or, in accordance with the requirements of laws and regulations, administrative organs or public prosecution laws, etc.);););", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60944, "text": "3. In order to deal with emergencies, or in urgent situations, it is necessary to protect the health and property security of natural people in emergencies;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to cope with emergencies, or in urgent situations to protect the health of natural people and the must -sharing, transfer or disclosure of property security, no authorization is required."}
{"task": "rw_68.jsonl", "id": 60945, "text": "4. Implement news reports and public opinion supervision in public interests, and handle personal information within a reasonable range;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to implement news reports and supervision of public opinion, deal with personal information within a reasonable scope without authorization."}
{"task": "rw_68.jsonl", "id": 60946, "text": "5. Treat personal information on your own or other legal disclosure within a reasonable range;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "To handle individuals' self -disclosure or other legitimate personal information within a reasonable scope, no authorization is required."}
{"task": "rw_68.jsonl", "id": 60947, "text": "6. Other circumstances stipulated in laws and administrative regulations.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The sharing or disclosure of other laws and regulations and other regulations does not need to be authorized."}
{"task": "rw_68.jsonl", "id": 60948, "text": "Please know that if we take technical measures and other necessary measures for personal information, so that the data receiver cannot re -identify specific individuals and cannot be restored, then the sharing, transfer, and public disclosure of this type of data will not be notified to you separately.Get your consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If the data receiver cannot re -identify the specific individual and cannot be restored by accepting the data, the sharing, transfer, and public disclosure will not be notified to you and obtain your consent."}
{"task": "rw_68.jsonl", "id": 60949, "text": "4. How do we save personal information", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60950, "text": "(1) Save location", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60951, "text": "The personal information we collected and generated in the operation of the People's Republic of China is stored in the territory of the People's Republic of China.", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in domestic operations will be stored in China."}
{"task": "rw_68.jsonl", "id": 60952, "text": "After the following situations, and after meeting the relevant provisions of the laws and regulations and the regulatory authorities, we may provide your personal information to the overseas entities, and strictly require the receiver to handle your personal information in accordance with the requirements of relevant laws and regulations and this policy.The", "label": ["Data Retention", "Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "After meeting the relevant provisions of the laws and regulations and the regulatory authorities, in accordance with the clear provisions of the laws and regulations or obtaining a separate consent of you or actively providing personal information to overseas, we may provide personal information to the overseas entities."}
{"task": "rw_68.jsonl", "id": 60953, "text": "1. The laws and regulations have clear stipulation;", "label": ["Third Party Sharing/ Disclosure", "Data Retention"], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60954, "text": "2. Obtain your individual consent separately;", "label": ["Third Party Sharing/ Disclosure", "Data Retention"], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60955, "text": "3. The products you use are cross -border with/or services, and you take the initiative to provide personal information to overseas.", "label": ["Third Party Sharing/ Disclosure", "Data Retention"], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60956, "text": "(2) Save time limit", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60957, "text": "We only retain your personal information for the purpose of providing our products and/or services during the purpose of providing our products and/.", "label": ["Data Retention", "Important"], "rewrite": "After exceeding the storage period, your personal information will be deleted or anonymous, except for other provisions of laws and regulations."}
{"task": "rw_68.jsonl", "id": 60958, "text": "We judge the storage period of personal information mainly refer to the following standards and are based on the elderly:", "label": ["Data Retention", "Important"], "rewrite": "We judge the storage period of personal information mainly refer to the following standards and the elders are based on the elders: 1) as the provisions of complying with applicable laws and regulations; 2) to comply with the court's decision, ruling or other legal procedures; 3) to comply with the government to abide by the governmentThe requirements of organs or legal authorized organizations; 4) In order to implement the platform agreement or this policy, to safeguard the public interests of the society, and protect the personal safety or other legitimate rights and interests of all parties."}
{"task": "rw_68.jsonl", "id": 60959, "text": "1. In order to comply with the applicable laws and regulations, for example, Article 21 of the Cyber Security Law of the People's Republic of China requires monitoring, recording the network operation status of the network, and technical measures for network security incidents.In a month, the \"E -commerce Law of the People's Republic of China\" requires that the saving time of goods and service information and transaction information is not less than three years from the date of completion of the transaction;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60960, "text": "2. In order to abide by the court's judgment, ruling or other legal procedures;", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60961, "text": "3. In order to comply with the requirements of government agencies or legal authorization organizations;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60962, "text": "4. In order to implement the Douyu platform agreement or this policy, protect the public interest of the social, protect the personal safety or other legitimate rights and interests of Douyu and Douyu related companies, other users or employees.", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60963, "text": "After you actively delete your personal information, cancel your account or information exceeding the necessary storage period, we will delete or processes your personal information, except for the following situations:", "label": ["Data Retention", "Important"], "rewrite": "After you actively delete your personal information, cancel your account or information beyond the necessary storage period, your personal information will be deleted or anonymous."}
{"task": "rw_68.jsonl", "id": 60964, "text": "1. Comply with the requirements for information retention of laws and regulations;", "label": ["Data Retention", "Important"], "rewrite": "In order to comply with the requirements of information retention of laws and regulations, your personal information will not be deleted or anonymized immediately."}
{"task": "rw_68.jsonl", "id": 60965, "text": "2. For the purpose of finance, auditing, and dispute resolution, the period needs to be reasonably extended.", "label": ["Data Retention", "Important"], "rewrite": "If you need to extend your duration reasonably for the purpose of finance, auditing, and dispute resolution, your personal information will not be deleted or anonymous immediately."}
{"task": "rw_68.jsonl", "id": 60966, "text": "(3) Termination operation", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60967, "text": "If we stop operating the Douyu platform product/service, we will stop the activities of continuing to collect your personal information in time, notify you in the form of notification of operation in the form of one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -oneBusiness -related personal information is deleted or anonymous.", "label": ["Important", "Cessation of Operations"], "rewrite": "When stopping operation, we will make an announcement notice and delete or processes your personal information."}
{"task": "rw_68.jsonl", "id": 60968, "text": "5. How do we protect personal information", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60969, "text": "(1) Safety measures", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60970, "text": "In order to ensure your information security, we have adopted various types of physical, electronics and management security measures that meet industry standards, reasonable and feasible, to protect your information, so that your information will not be leaked, damaged or lost, including but not, but notIt is limited to setting up the deployment host invasion detection system, important sensitive data encryption storage, and log record security audit.", "label": ["Important", "Data Security"], "rewrite": "Adopting various physical, electronic and management security measures that meet industry standards, reasonable and feasible, and feasible measures to protect your information, including but not limited to setting up the deployment host invasion detection system, important sensitive data encryption storage, and log record security audit."}
{"task": "rw_68.jsonl", "id": 60971, "text": "(2) Management system", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60972, "text": "We will establish a special security department, security management system, and data security process to ensure your personal information security.", "label": ["Important", "Data Security"], "rewrite": "Establish special security departments, security management systems, and data security processes to ensure personal information security."}
{"task": "rw_68.jsonl", "id": 60973, "text": "We adopt strict data use and access system to ensure that only authorized personnel can access your personal information.", "label": ["Important", "Data Security"], "rewrite": "Adopt data use and access systems to ensure that only authorized personnel can access personal information."}
{"task": "rw_68.jsonl", "id": 60974, "text": "We will regularly conduct security education and training on personnel, and conduct security audit on data and technology in a timely manner.", "label": ["Important", "Data Security"], "rewrite": "Regular security education and training on personnel, and timely security audit of data and technology."}
{"task": "rw_68.jsonl", "id": 60975, "text": "We will formulate and organize the implementation of the emergency plan of personal information security incidents, and immediately start the emergency plan when the personal information security incident occurs, strive to control the impact of these security events, and prevent adverse consequences from expanding.", "label": ["Important", "Data Security"], "rewrite": "We will start emergency plans to deal with information security incidents."}
{"task": "rw_68.jsonl", "id": 60976, "text": "Once a personal information security incident may occur or may occur (leak, tampering, and loss), we will tell you the following situations in a timely manner in accordance with the requirements of laws and regulations: the types, reasons, and possible personal information, reasons and possibilities that may occur or may be tampered, and lostThe remedial measures we have taken, the measures you can take to reduce the harm and the way of contacting us.", "label": ["Important", "Data Security"], "rewrite": "If you have a personal information security incident, we will inform you the basic situation of the incident, the measures you can use to reduce the harm, and the way you contact us."}
{"task": "rw_68.jsonl", "id": 60977, "text": "We will promptly inform you of the incident -related situation with push notifications, emails, letters, text messages, and related forms. When it is difficult to inform one by one, we will publish an announcement in a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "The relevant situation of security incidents will be informed by mail, letter, telephone, push notification, etc. When it is difficult to inform one by one, it will issue an announcement."}
{"task": "rw_68.jsonl", "id": 60978, "text": "At the same time, we will also report to the disposal of personal information security incidents in accordance with the requirements of the relevant regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "The disposal of personal information security incidents will be reported in accordance with the requirements of the regulatory authorities."}
{"task": "rw_68.jsonl", "id": 60979, "text": "(3) Safety reminder", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60980, "text": "Your account has a security protection function, please keep your account and password information properly.", "label": ["Important", "Data Security"], "rewrite": "Properly keep your account and password information."}
{"task": "rw_68.jsonl", "id": 60981, "text": "Douyu will ensure that your information is not lost and not abused and altered by backup security measures such as backup of other servers and encrypted user passwords.", "label": ["Important", "Data Security"], "rewrite": "Safety measures such as backup of other servers and encrypting user passwords ensure that your information is not lost, and it is not abused and altered."}
{"task": "rw_68.jsonl", "id": 60982, "text": "However, please understand that due to the technical restrictions and various malicious means, in the Internet industry, even if you can do your best to strengthen security measures, it is impossible to ensure that the information is 100 % security.", "label": ["Important", "Data Security"], "rewrite": "Although there are security measures, it is impossible to fully guarantee that there is no security problem."}
{"task": "rw_68.jsonl", "id": 60983, "text": "You need to understand that if you use the system and communication network you used in this software, you may have problems due to factors outside the controlled range of fighting fish.", "label": ["Important", "Data Security"], "rewrite": "Systems and communication networks may have problems due to unprepared factors."}
{"task": "rw_68.jsonl", "id": 60984, "text": "Once you leave Douyu, browse or use other products or services provided by a third party, we will not be able to protect any personal information submitted to the third party, whether you log in, browse or use the above products or services based on Dou -based Dou based on Dou Dou based on Dou Dou.Links or guidance of fish.", "label": ["Data Security", "Important", "Risk"], "rewrite": "Regardless of whether you are based on Douyu's link or guidance to leave Douyu, we will not be able to protect any personal information submitted to the third party."}
{"task": "rw_68.jsonl", "id": 60985, "text": "But we will prompt you to pay attention to entering third -party products or services so that you can better protect your personal information.", "label": ["Important", "Data Security"], "rewrite": "We will prompt you to pay attention to entering third -party products or services so that you can protect your personal information."}
{"task": "rw_68.jsonl", "id": 60986, "text": "At the same time, we strongly recommend that you take the following positive measures to protect the security of personal information:", "label": ["Important", "Data Security"], "rewrite": "It is recommended that you take the following positive measures to protect the security of personal information:"}
{"task": "rw_68.jsonl", "id": 60987, "text": "1. Protect your personal information properly and provide others with only necessary situations.", "label": ["Important", "Data Security"], "rewrite": "Protecting your personal information properly, it is provided to others only under the necessary situation."}
{"task": "rw_68.jsonl", "id": 60988, "text": "2. Use complex passwords, modify passwords regularly, do not disclose your account password and related personal information to others.", "label": ["Important", "Data Security"], "rewrite": "Use complex passwords, regularly modify passwords, do not disclose your account password and related personal information to others."}
{"task": "rw_68.jsonl", "id": 60989, "text": "3. When using the Douyu platform service online transactions, you inevitably disclose your personal information to the other party or the potential transaction of the transaction, such as bank account information, contact method or mailing address.", "label": ["Important", "Data Security"], "rewrite": "Don't use the communication method recommended by the non -Douyu platform to disclose your personal information to the other party or the potential transaction."}
{"task": "rw_68.jsonl", "id": 60990, "text": "We strongly recommend that you do not use the communication method recommended by the non -Douyu platform to send your information.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60991, "text": "4. If you find your personal information leakage, especially your account and password leak, please contact the Douyu customer service immediately so that Douyu can take corresponding measures.", "label": ["Important", "Data Security"], "rewrite": "If the personal information discovered, please contact our customer service immediately."}
{"task": "rw_68.jsonl", "id": 60992, "text": "(4) Safety events", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60993, "text": "After unfortunately a personal information security incident, we will tell you the basic situation and possible impact of the security incident in accordance with the requirements of the laws and regulations.Your remedy, etc.", "label": ["Important", "Data Security"], "rewrite": "If a personal information security incident occurs, we will inform your basic situation, possible impact, disposal measures, independent prevention suggestions, etc."}
{"task": "rw_68.jsonl", "id": 60994, "text": "In the event related to the incident, we will inform you in the form of mail, letter, telephone, push notification, etc. When it is difficult to inform the subject of personal information one by one, we will publish an announcement in a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "The relevant situation of security incidents will be informed by mail, letter, telephone, push notification, etc. When it is difficult to inform one by one, it will issue an announcement."}
{"task": "rw_68.jsonl", "id": 60995, "text": "At the same time, we will also report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "The disposal of personal information security incidents will be reported in accordance with the requirements of the regulatory authorities."}
{"task": "rw_68.jsonl", "id": 60996, "text": "6. How do you manage your personal information", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60997, "text": "We attach great importance to the personal information rights and interests of users, and we will do our best to protect your own rights for your personal information so that you have full ability to ensure your information security.", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60998, "text": "Your rights include:", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 60999, "text": "(1) Query, correct, supplement, and delete your personal information", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 61000, "text": "You can query and manage your personal information through multiple paths in our products:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_68.jsonl", "id": 61001, "text": "1. Douyu website (www.douyu.com)", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 61002, "text": "You can use [Account] → [Personal Center] → [Account Settings] to query/modify your account information, including mobile phone numbers, account passwords, binding mailboxes, real -name authentication/ID certification information, bank card information;", "label": ["Important", "Edit/Control"], "rewrite": "You can query/modify your account information through [account] → [personal center] → [account settings]."}
{"task": "rw_68.jsonl", "id": 61003, "text": "You can use [account] → [personal center] → [third -party account binding] Query/modify your third -party account binding information;", "label": ["Edit/Control", "Important"], "rewrite": "You can query/modify your third -party account binding information through [account] → [personal center] → [third -party account binding]."}
{"task": "rw_68.jsonl", "id": 61004, "text": "You can use [account] → [personal center] → [personal information] to query/modify your receiving address, guild information, supplier information, etc.;", "label": ["Edit/Control", "Important"], "rewrite": "You can use [Account] → [Personal Center] → [Personal Information] to query/modify your receiving address, guild information, supplier information, etc."}
{"task": "rw_68.jsonl", "id": 61005, "text": "You can use [Account] → [Personal Center] → [In -site Letter] to query, delete friends and related dialogue information;", "label": ["Important", "Edit/Control"], "rewrite": "You can query, delete friends and related dialogue information through [account] → [personal center] → [station letter]."}
{"task": "rw_68.jsonl", "id": 61006, "text": "You can use [Account] → [Personal Center] → [My Follow] to query and cancel the relevant anchors and live broadcast rooms;", "label": ["Important", "Edit/Control"], "rewrite": "You can query and cancel the relevant anchors and live broadcast rooms through [Account] → [Personal Center] → [My Follow]."}
{"task": "rw_68.jsonl", "id": 61007, "text": "You can check your gifts, nobles, videos, videos, videos, guilds, etc.", "label": ["Edit/Control", "Important"], "rewrite": "You can check your gifts, nobles, videos, videos, videos, guilds, etc."}
{"task": "rw_68.jsonl", "id": 61008, "text": "2. Douyu app", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 61009, "text": "You can use [Mine] → [Avatar/Nickname] → [Personal Information] to query, modify the avatar, nickname, gender, birthday, contact QQ, location, login password, binding mobile phone, bank card, bank card, bank cardInformation, delivery address and other information information.", "label": ["Important", "Edit/Control"], "rewrite": "You can use [Mine] → [Avatar/Nickname] → [Personal Information] to query, modify the avatar, nickname, gender, birthday, contact QQ, location, login password, binding mobile phone, bank card, bank card, bank cardInformation, delivery address and other information information."}
{"task": "rw_68.jsonl", "id": 61010, "text": "You can also check the real -name authentication of the Douyu account and bind the mailbox information through this path.", "label": ["Edit/Control", "Important"], "rewrite": "You can use [Mine] → [Avatar/Nickname] → [Personal Information] to query the real -name authentication and binding mailbox information of the Douyu account."}
{"task": "rw_68.jsonl", "id": 61011, "text": "You can also use [Mine] → [Settings] → [Account and Security] to query, modify the login password of Douyu account, binding mobile phones and other information information, login device information, and the binding of the third -party platform login account.", "label": ["Important", "Edit/Control"], "rewrite": "You can use [Mine] → [Settings] → [Account and Security] to query, modify the login password of Douyu account, binding mobile phones and other information information, login device information, and the binding of the third -party platform login account."}
{"task": "rw_68.jsonl", "id": 61012, "text": "You can also check the real -name authentication of the Douyu account and bind the mailbox information through this path.", "label": ["Important", "Edit/Control"], "rewrite": "You can check the real -name authentication and binding mailbox information of the Douyu account through [Mine] → [Account and Security]."}
{"task": "rw_68.jsonl", "id": 61013, "text": "You can also use [My → Settings → Account and Security → Game Account Binding], [My → Function Center → Game Account Binding] to check the game account related to Douyu account binding.", "label": ["Important", "Edit/Control"], "rewrite": "You can use [My → Settings → Account and Security → Game Account Binding], [My → Function Center → Game Account Binding] Query the game account related to Douyu account binding."}
{"task": "rw_68.jsonl", "id": 61014, "text": "Note: Different mobile terminals such as Android and iOS may be different. Actually, the content and path of the Douyu APP interface on the mobile terminal you use shall prevail.", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 61015, "text": "If you cannot manage these personal information through the above path, you can contact us at any time through the contact information provided by this privacy policy.", "label": ["Important", "Edit/Control"], "rewrite": "If you cannot manage these personal information, you can contact us at any time."}
{"task": "rw_68.jsonl", "id": 61016, "text": "We will reply to your access request as soon as possible.", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 61017, "text": "(2) User authorization withdrawal", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 61018, "text": "You can revoke the authorized authorization through the following channels:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_68.jsonl", "id": 61019, "text": "1. Contact Douyu's official online customer service https://kefu.douyu.com/nx/index.html;", "label": ["Important", "Contact Information"], "rewrite": "You can contact Douyu's official online customer service https://kefu.douyu.com/nx/index.html to revoke the authorized authorization."}
{"task": "rw_68.jsonl", "id": 61020, "text": "2. Dial customer service hotline: 027-87750710/027-87057679;", "label": ["Important", "Contact Information"], "rewrite": "You can call the customer service hotline: 027-87750710/027-87057679 to revoke the authorized authorization."}
{"task": "rw_68.jsonl", "id": 61021, "text": "3. Send mail to yonghushensu@douyu.tv.", "label": ["Important", "Contact Information"], "rewrite": "You can send mail to yonghushensu@douyu.tv to revoke the authorized authorization."}
{"task": "rw_68.jsonl", "id": 61022, "text": "After you apply for authorization, Douyu will no longer process the corresponding personal information.", "label": ["Important", "Edit/Control"], "rewrite": "After the authorization is withdrawn, the corresponding personal information will no longer be processed."}
{"task": "rw_68.jsonl", "id": 61023, "text": "Please understand that because of your authorization withdrawal, we cannot continue to provide you with a specific function or/and service corresponding to the withdrawal consent or authorization.", "label": ["Important", "Edit/Control"], "rewrite": "We cannot continue to provide you with a specific function or/and service corresponding to the withdrawal consent or authorization."}
{"task": "rw_68.jsonl", "id": 61024, "text": "But your decision to withdraw consent will not affect personal information processing based on your authorization.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "The withdrawal consent will not affect the collection and use of information based on authorization."}
{"task": "rw_68.jsonl", "id": 61025, "text": "(3) Privacy settings", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 61026, "text": "Douyu APP:", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 61027, "text": "1. Message privacy settings", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 61028, "text": "You can use [Mine] → [Settings] → [Privacy] → [Message Privacy Settings] Paths for \"Add Friends Settings\", \"Free Disturbance Settings\" and \"Message Blacklist\" settings.", "label": ["Important", "Edit/Control"], "rewrite": "You can use [Mine] → [Settings] → [Privacy] → [Message Privacy Settings] Paths for \"Add Friends Settings\", \"Free Disturbance Settings\" and \"Message Blacklist\" settings."}
{"task": "rw_68.jsonl", "id": 61029, "text": "2. Personal space privacy settings", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 61030, "text": "You can use [Mine] → [Settings] → [Privacy] → [Personal Space Privacy Settings] Paths for \"fan badge\", \"person I follow\", and \"my fan\" display settings.", "label": ["Edit/Control", "Important"], "rewrite": "You can use [Mine] → [Settings] → [Privacy] → [Personal Space Privacy Settings] Paths for \"fan badge\", \"person I follow\", and \"my fan\" display settings."}
{"task": "rw_68.jsonl", "id": 61031, "text": "3. Preference settings", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 61032, "text": "You can display the \"Picture Water Printing\" display settings through [Mine] → [Settings] → [Privacy] → [Personal Space Privacy Settings] Path.", "label": ["Edit/Control", "Important"], "rewrite": "You can display the \"Picture Water Printing\" display settings through [Mine] → [Settings] → [Privacy] → [Personal Space Privacy Settings] Path."}
{"task": "rw_68.jsonl", "id": 61033, "text": "4. Interactive settings", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 61034, "text": "You can set the \"interactive blacklist\" settings through [Mine] → [Settings] → [Privacy] → [Interactive Settings] The path.", "label": ["Important", "Edit/Control"], "rewrite": "You can set the \"interactive blacklist\" settings through [Mine] → [Settings] → [Privacy] → [Interactive Settings] The path."}
{"task": "rw_68.jsonl", "id": 61035, "text": "5. Message reminder settings", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 61036, "text": "You can broadcast the settings of the \"Mine] → [Settings] → [Message reminder settings] paths to broadcast the setting of the path, friend message notification, stranger message notification, and other interactive notification settings.", "label": ["Edit/Control", "Important"], "rewrite": "You can broadcast the settings of the \"Mine] → [Settings] → [Message reminder settings] paths to broadcast the setting of the path, friend message notification, stranger message notification, and other interactive notification settings."}
{"task": "rw_68.jsonl", "id": 61037, "text": "(4) Privacy settings", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 61038, "text": "Douyu APP:", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 61039, "text": "You can use [Mine] → [Settings] → [Privacy]-[Personalized Advertising Recommendation] Path Management Personalized Advertising.", "label": ["Important", "Edit/Control"], "rewrite": "You can use [Mine] → [Settings] → [Privacy]-[Personalized Advertising Recommendation] Path Management Personalized Advertising."}
{"task": "rw_68.jsonl", "id": 61040, "text": "You can use [Mine] → [Settings] → [Privacy]-[Personalized content recommendation] Path management of personalized content.", "label": ["Important", "Edit/Control"], "rewrite": "You can use [Mine] → [Settings] → [Privacy]-[Personalized content recommendation] Path management of personalized content."}
{"task": "rw_68.jsonl", "id": 61041, "text": "You can use [Mine] → [Settings] → [Privacy]-[Watch History-Most often visit] Path management of your viewing history and the most common visit records.", "label": ["Important", "Edit/Control"], "rewrite": "You can use [Mine] → [Settings] → [Privacy]-[Watch History-Most often visit] Path management of your viewing history and the most common visit records."}
{"task": "rw_68.jsonl", "id": 61042, "text": "You can use [Mine] → [Settings] → [Privacy]-[Synchronization of local viewing records after logging in] Path management of the synchronization of local viewing records.", "label": ["Important", "Edit/Control"], "rewrite": "You can use [Mine] → [Settings] → [Privacy]-[Synchronization of local viewing records after logging in] Path management of the synchronization of local viewing records."}
{"task": "rw_68.jsonl", "id": 61043, "text": "In addition, if you have any problems/objection to the results of our automated decision, you can contact us in accordance with the contact information shown in Chapter 10 of this policy.", "label": ["Important", "Edit/Control"], "rewrite": "If you have any problems/objection to the results of us to make automated decision -making, you can contact us."}
{"task": "rw_68.jsonl", "id": 61044, "text": "(5) Copy for personal information", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 61045, "text": "You can obtain a copy of your personal information through the following channels:", "label": ["Important", "Edit/Control"], "rewrite": "You can obtain a copy of your personal information through the following channels:"}
{"task": "rw_68.jsonl", "id": 61046, "text": "1. Contact Douyu's official online customer service https://kefu.douyu.com/nx/index.html;", "label": ["Important", "Contact Information"], "rewrite": "Contact Douyu's official online customer service https://kefu.douyu.com/nx/index.html to get a copy of personal information."}
{"task": "rw_68.jsonl", "id": 61047, "text": "2. Dial customer service hotline: 027-87750710/027-87057679;", "label": ["Important", "Contact Information"], "rewrite": "Dial customer service hotline: 027-87750710/027-87057679 to get a copy of personal information."}
{"task": "rw_68.jsonl", "id": 61048, "text": "3. Send mail to yonghushensu@douyu.tv.", "label": ["Important", "Contact Information"], "rewrite": "Send mail to yonghushensu@douyu.tv to get a copy of personal information."}
{"task": "rw_68.jsonl", "id": 61049, "text": "Douyu will provide you with a copy of personal information within the time limit stipulated by laws and regulations.", "label": ["Important", "Edit/Control"], "rewrite": "It will provide you with personal information copy within the period stipulated by laws and regulations."}
{"task": "rw_68.jsonl", "id": 61050, "text": "(6) Account logout", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 61051, "text": "You can submit your account to cancel your account on your own.", "label": ["Edit/Control", "Important"], "rewrite": "You can submit your account to cancel your account on your own."}
{"task": "rw_68.jsonl", "id": 61052, "text": "Logicing method:", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 61053, "text": "[Douyu web page side → Personal center → My information → personal information → account cancellation]", "label": ["Important", "Edit/Control"], "rewrite": "Reambying method: Douyu web page → Personal center → My information → personal information → account cancellation."}
{"task": "rw_68.jsonl", "id": 61054, "text": "[Douyu Mobile terminal → Setting → account and security → account logout]", "label": ["Important", "Edit/Control"], "rewrite": "Logicing method: Douyu mobile terminal → Setting → account and security → account cancellation."}
{"task": "rw_68.jsonl", "id": 61055, "text": "You know and understand that the behavior of canceling the account is irreversible.", "label": ["Important", "Edit/Control"], "rewrite": "The behavior of canceling the account is irreversible."}
{"task": "rw_68.jsonl", "id": 61056, "text": "After you actively cancel your account, Douyu Platform will stop providing you with products or services and delete or processes your relevant information, except for laws and regulations and related national standards.", "label": ["Important", "Edit/Control"], "rewrite": "After you take the initiative to cancel your account, the platform will stop providing products or services and delete or processes your information. Except for other regulations and related national standards."}
{"task": "rw_68.jsonl", "id": 61057, "text": "After the account of the account is canceled, all the content you posted will be converted anonymous. If you need to delete the content, please handle it yourself before applying for cancellation.", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "If you need to delete the content, please handle it yourself before applying for cancellation. The content you posted will be anonymous after cancellation."}
{"task": "rw_68.jsonl", "id": 61058, "text": "Logging into the Douyu account does not mean that the behavior before the cancellation of the account cancellation and the relevant responsibilities have been exempted or reduced by any form.", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 61059, "text": "(7) Personal information transfer", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 61060, "text": "If you need to transfer our personal information to collect storage, we will provide you with a transfer path according to the requirements of laws and regulations.", "label": ["Edit/Control", "Important"], "rewrite": "We will provide you with a path to transfer personal information according to the requirements of laws and regulations."}
{"task": "rw_68.jsonl", "id": 61061, "text": "7. Our personal information for the personal information of minors", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 61062, "text": "We attach great importance to the protection of personal information of minors.", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 61063, "text": "If you are a minor who is over 14 years old and under the age of 18, before using Douyu products/services and providing personal information to us, you should read and agree with your parents or other guardians under the supervision and guidance of this privacy policy.Items", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a minor who is already 14 years old and under the age of 18, you should read and agree to the privacy policy together under the guardian monitoring and guidance."}
{"task": "rw_68.jsonl", "id": 61064, "text": "If you are a guardian under the age of 14, you should read and agree to the privacy policy and the \"Child Privacy Protection Statement\" before using Douyu products/services and providing personal information to us.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a guardian under the age of 14, before using the product/service and providing personal information to us, you should read and agree to the privacy policy and the \"Child Privacy Protection Statement\"."}
{"task": "rw_68.jsonl", "id": 61065, "text": "We only use, provide or need to protect minors, provide or openly disclose the information in the case of laws and regulations, the guardian of minors, or the need to protect minors.", "label": ["Specific Audiences", "Important"], "rewrite": "Only in the case of laws and regulations, the guardians of minors clearly agreed or needed to protect minors, provide or disclose children's information."}
{"task": "rw_68.jsonl", "id": 61066, "text": "We will protect the confidentiality and security of the user's user information in accordance with relevant national laws and regulations and the provisions of this policy.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_68.jsonl", "id": 61067, "text": "If we find that we have collected personal information of minors without the consent of parents or legal guardians who can be confirmed in advance, we will delete relevant data as soon as possible.", "label": ["Specific Audiences", "Important"], "rewrite": "If the personal information of minors was collected without the consent of the legal guardian, he would try to delete relevant information as soon as possible."}
{"task": "rw_68.jsonl", "id": 61068, "text": "If you are the guardian of minors, when you use our service or the user information you provide to us when you are monitored, please contact us in time through the contact information of this privacy policy.Essence", "label": ["Specific Audiences", "Important"], "rewrite": "If you are the guardian of minors, you can contact us when you have any questions about the guardian's service or information."}
{"task": "rw_68.jsonl", "id": 61069, "text": "8. We protect the personal information of the dead users", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 61070, "text": "After the death of the Douyu platform users, its close relatives can exercise the rights of inspection, replication, correction, deletion, etc. on the path and contact information of the relevant users through the path and contact information of the privacy policies in this privacy policy.However, there are so many arranges before their lifetime.", "label": ["Specific Audiences", "Important"], "rewrite": "After the death of the platform users, its close relatives can exercise the rights to check, copy, correct, and delete relevant personal information for the relevant personal information of the old users for their own legal and legitimate interests. So there have been other arranges that users have arranged during their lifetime."}
{"task": "rw_68.jsonl", "id": 61071, "text": "Nine, query and revision of privacy policies", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 61072, "text": "(1) Review", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 61073, "text": "1. You can check this privacy policy on the login page or login account in [Mine] → [Settings] → [About Us]-[Privacy Policy] page.", "label": ["Policy Change", "Important"], "rewrite": "You can view this privacy policy on the page of [Mine] → [Settings] → [About Us]-[Privacy Policy] Page."}
{"task": "rw_68.jsonl", "id": 61074, "text": "2. Please understand that in order to meet the needs of operation, we may develop different versions based on factors such as the mobile phone model, system version, and mobile clients you use. ThereforeThere is a difference between the privacy policy description, but it does not affect the purpose, method, and scope of data processing. The specific available functions are based on your actual use.", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 61075, "text": "(2) Update and notice", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 61076, "text": "We encourage you to consider our \"Douyu Privacy Policy\" carefully before using our products or services.", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 61077, "text": "In order to provide you with better services, we will update the terms of this policy according to the update of the product and the relevant requirements of laws and regulations, which constitutes part of the cost of the policy.", "label": ["Policy Change", "Important"], "rewrite": "The update of this policy terms will constitute a part of the cost."}
{"task": "rw_68.jsonl", "id": 61078, "text": "We will remind you of the updated content in the station or other appropriate ways so that you can understand the latest version of this policy in a timely manner.", "label": ["Policy Change", "Important"], "rewrite": "We will remind you of the updated content in the station letter or other appropriate ways."}
{"task": "rw_68.jsonl", "id": 61079, "text": "If the update involves major changes, we will notify you through a significant way before this policy takes effect (such as reminders and pop -ups in the page).", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_68.jsonl", "id": 61080, "text": "But without your clear consent, we will not reduce or infringe your personal rights and interests you enjoy in accordance with this policy.", "label": ["Policy Change", "Important"], "rewrite": "Without your clear consent, we will not reduce or infringe your personal rights and interests you enjoy in accordance with this policy."}
{"task": "rw_68.jsonl", "id": 61081, "text": "The major changes in this policy include, but not limited to:", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_68.jsonl", "id": 61082, "text": "1. Our service model has changed significantly.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_68.jsonl", "id": 61083, "text": "Such as the purpose of handling personal information, the type of personal information, the use of personal information, etc.;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_68.jsonl", "id": 61084, "text": "2. We have changed significantly in the aspects of ownership structure and organizational structure.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_68.jsonl", "id": 61085, "text": "Such as changes caused by business adjustments, bankruptcy mergers and acquisitions, etc.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_68.jsonl", "id": 61086, "text": "3. The main object of personal information sharing, transfer or public disclosure changes;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_68.jsonl", "id": 61087, "text": "4. The right to participate in personal information processing and its exercise methods have changed significantly;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_68.jsonl", "id": 61088, "text": "5. We are responsible for handling the responsible departments, contact methods and complaint channels of personal information security;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_68.jsonl", "id": 61089, "text": "6. Personal information security impact assessment report shows that there is a high risk.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_68.jsonl", "id": 61090, "text": "If you do not agree with the modified privacy policy, you have the right to and immediately stop using Douyu services.", "label": ["Policy Change", "Important"], "rewrite": "If you do not agree with the modified privacy policy, you have the right to stop using the service immediately."}
{"task": "rw_68.jsonl", "id": 61091, "text": "If you continue to use Douyu's service, you are deemed to be a modification of Douyu to the relevant terms of this policy.", "label": ["Policy Change", "Important", "Risk"], "rewrite": "If you continue to use your service, you are deemed to be amended to accept the relevant terms of this policy."}
{"task": "rw_68.jsonl", "id": 61092, "text": "10. Contact us", "label": [], "rewrite": []}
{"task": "rw_68.jsonl", "id": 61093, "text": "If you have any complaints, suggestions, and questions about the implementation of this policy or our privacy protection related matters, you can contact us through the following ways. We will reply to you within 15 working days after verifying your user identity:", "label": ["Important", "Contact Information"], "rewrite": "You can contact us in the following way:"}
{"task": "rw_68.jsonl", "id": 61094, "text": "1. Douyu online customer service https://kefu.douyu.com/nx/index.html or dial customer service hotline: 027-87750710/027-87057679;", "label": ["Important", "Contact Information"], "rewrite": "1. Douyu online customer service https://kefu.douyu.com/nx/index.html or dial customer service hotline: 027-87750710/027-87057679;"}
{"task": "rw_68.jsonl", "id": 61095, "text": "2. We also set up the person in charge of the professional information protection department and personal information protection. You can send an email or mailing method to contact us.", "label": ["Important", "Contact Information"], "rewrite": "2. You can send emails or mailing methods to contact us."}
{"task": "rw_68.jsonl", "id": 61096, "text": "Email: dataprivacy@douyu.tv", "label": ["Important", "Contact Information"], "rewrite": "Email: dataprivacy@douyu.tv"}
{"task": "rw_68.jsonl", "id": 61097, "text": "Enterprise Registration Address: Hubei Province Wuhan Donghu New Technology Development Zone Software Garden East Road No. 1 Software Industry 4.1 Phase B3 Building B3 12-19 Floor Room 01", "label": ["Important", "Contact Information"], "rewrite": "Enterprise Registration Address: Hubei Province Wuhan Donghu New Technology Development Zone Software Garden East Road No. 1 Software Industry 4.1 Phase B3 Building B3 12-19 Floor Room 01"}
{"task": "rw_68.jsonl", "id": 61098, "text": "Common office address: 8th floor, Building F1 Building F1, Guanggu Software Park, Donghu New Technology Development Zone, Wuhan City, Hubei Province", "label": ["Important", "Contact Information"], "rewrite": "Common office address: 8th floor, Building F1 Building F1, Guanggu Software Park, Donghu New Technology Development Zone, Wuhan City, Hubei Province"}
{"task": "rw_68.jsonl", "id": 61099, "text": "Postcode: 430000", "label": ["Important", "Contact Information"], "rewrite": "Postcode: 430000"}
{"task": "rw_68.jsonl", "id": 61100, "text": "Douyu Legal Department received", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_68.jsonl", "id": 61101, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
