{"task": "rw_65.jsonl", "id": 59375, "text": "Gaode Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59376, "text": "Effective date: May 19, 2022", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59377, "text": "Update date: May 12, 2022", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59378, "text": "You are welcome to use our products and services!", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59379, "text": "We know the importance of personal information to you. Your trust is very important to us. We will strictly abide by laws and regulations to take corresponding security protection measures to protect your personal information security and controlling.", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59380, "text": "Based on this, Gaode (or \"we\") formulates this \"Gaode Privacy Policy\" (hereinafter referred to as \"this policy\"/\"this privacy policy\") to help you fully understandHow will we collect, use, share, store, and protect your personal information, as well as how you can manage your personal information so that you can make better choices.", "label": ["Usage", "Third Party Sharing/ Disclosure", "Data Retention", "First Party Collection Information"], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59381, "text": "Before you start using our products and services, please read and understand this policy carefully. In particular, we should focus on reading the clauses we logging in the threatening of the body/coarse body to ensure that you fully understand and agree to use it before starting to use.", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59382, "text": "The professional vocabulary involved in this policy, we try to explain to you in a concise and popular expression in order to facilitate your understanding.", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59383, "text": "If you have any questions, opinions or suggestions on the content of this policy, you can contact us through the contact information at the end of this policy.", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59384, "text": "You agree that this privacy policy said that you have understood the functions provided by the application, as well as the necessary personal information required for functional operation, and give corresponding collection and use authorization, but it does not mean that you have agreed to open up additional functions and handle non -necessary personal information.The opening, processing non -necessary personal information and processing sensitive personal information of related additional functions, we will solicit your consent separately according to your actual usage.", "label": ["First Party Collection Information", "Permission Acquisition"], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59385, "text": "This privacy policy will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59386, "text": "1. The scope of application of privacy policies", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59387, "text": "2. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59388, "text": "3. How do we provide your personal information outside", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59389, "text": "Fourth, your rights", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59390, "text": "5. Storage of information", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59391, "text": "6. Applicable laws and dispute resolution", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59392, "text": "Seven, policy updates", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59393, "text": "8. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59394, "text": "Nine, contact us", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59395, "text": "Appendix: Related Definition", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59396, "text": "1. The scope of application of privacy policies", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59397, "text": "This policy is applicable to you with various products and services provided to you with a website, application, API/SDK and background systems, operating systems, and new forms that emerge with technology development, as well as hardware terminals including the aforementioned products and services (It is called \"Gaode Products and Services\").", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59398, "text": "If the affiliated company has a privacy policy for the products or services it provides you, the corresponding privacy policy is applicable to the corresponding products or services.", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59399, "text": "We and the affiliated company have a privacy policy (such as Gaode member account service and car service service) for the products or services that it provided to you, and this policy is also applicable to this part of the product or service.", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59400, "text": "The content of Gaode products and services you have obtained may be different from the software versions you use and equipped with equipment.) Instead of covering certain services or not providing specific functions, the provisions of this privacy policy involving the above service/function and related personal information will not be applicable.", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59401, "text": "Except for the relevant information collection and use activities described in this policy, this policy is not applicable to the products and services you provided in other third directions.", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59402, "text": "When you use the services provided by a third party through Gaode products or services, your information should apply the rules of personal information collection and use of third parties. We will clearly notify that the service is provided by a specific third party on the specific service page, and it is highly recommendedUnder the use of the above -mentioned third -party products and services (especially services related to personal information), understand and confirm the privacy protection of the product and service provider.", "label": ["Important", "Risk"], "rewrite": "When you use the services provided by third parties through Gaode products or services, your information should apply the rules of personal information collection and use of third -party."}
{"task": "rw_65.jsonl", "id": 59403, "text": "2. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59404, "text": "When you use Gaode products and services, the personal information we need/may need to collect and use includes the following: the following:", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59405, "text": "1. In order to provide you with basic functions to provide you with Gaode products and services, including positioning services, search services, map services, travel services (navigation services, route planning services, vehicle service services), and living peripheral services, you must authorize usThe necessary information used.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59406, "text": "If you refuse to provide the corresponding information, you will not be able to use our products and/or services normally.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59407, "text": "2. In order to provide you with additional functions to Gaode products and services, you can choose to agree with or disagree with the information we collected and used alone.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59408, "text": "If you refuse to provide it, you will not be able to use related additional functions normally or cannot achieve the functional effects we intend to achieve, which will not affect your basic functions.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59409, "text": "We are here to remind you that we are committed to creating a variety of products and services to meet your needs.", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59410, "text": "Because there are many types and services we provide to you, and there are differences in the scope of the specific product/service selected by different users, the basic/additional functions and the personal information types and scope of personal information and use will be different. Please use specific ones.Product/service function shall prevail.", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59411, "text": "(1) The functional scenario we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59412, "text": "1. Member account registration, login and management", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59413, "text": "When you use Gaode products and services, you can log in to the registered Gaode account or use a third -party account (including Alipay, Taobao, WeChat, QQ, Weibo, Apple, mobile phone system account).", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59414, "text": "When you register for Gaode account, we will collect your account name, password, email address (partial situation), mobile phone number;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you register for Gaode account, collect your account name, password, email address, and mobile phone number."}
{"task": "rw_65.jsonl", "id": 59415, "text": "If you use a mobile phone number to register or one -click login service, we will collect your device information and mobile phone number mask;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If you use a mobile phone number to register or one -click login service, collect your device information and mobile phone number mask."}
{"task": "rw_65.jsonl", "id": 59416, "text": "If you log in with a third -party account or bind the third -party account with the Gaode account, you will authorize Gaode to read the public information registered in the third -party account (nickname, avatar, information provided by the third -party license login service,Prevant);", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If you log in with a third -party account or bind the third -party account with the Gaode account, you will authorize Gaode to read the public information registered in a third -party account."}
{"task": "rw_65.jsonl", "id": 59417, "text": "If you use a third -party product or service to be bound to the Gaode account, we will provide your account information to a third party based on your authorization (nickname, avatar, information provided by the authorized login service).", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If you use a third -party product or service, you need to bind to the Gaode account, and provide your account information to the third party authorized by you."}
{"task": "rw_65.jsonl", "id": 59418, "text": "After the registration/login is successful, you can choose whether to improve your personal homepage information (such as avatar, nickname, gender, age, birthday, label);", "label": ["Important", "First Party Collection Information"], "rewrite": "After the registration/login is successful, you can choose whether to complete your personal homepage information."}
{"task": "rw_65.jsonl", "id": 59419, "text": "After you log in to Gaode's products and services, you can also bind multiple third -party accounts. Binding a third -party account can help find the account and password more conveniently when you encounter your account loss and forget the password problem, and make you make you make youYou can directly book the products and/or services provided by third parties through Gaode products and services.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "After you log in to Gaode products and services, you can bind multiple third -party account numbers to help you find your account and password, and allow you to directly book the products and/or services provided by the third party."}
{"task": "rw_65.jsonl", "id": 59420, "text": "Some services support only when using the mobile phone number login, and the verification code is required to verify.", "label": ["Important", "First Party Collection Information"], "rewrite": "Only part of the service with mobile phone number login requires verification code verification."}
{"task": "rw_65.jsonl", "id": 59421, "text": "To facilitate your use, Gaode provides a way to read the verification code in your SMS and automatically fill in through the device system to save your time and avoid filling in errors.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "After authorization, read the verification code in your text message and fill in automatically to facilitate your use."}
{"task": "rw_65.jsonl", "id": 59422, "text": "If you apply for registration as a member of the Gaode Map Open Platform, a service provider or other members who have additional identity authentication requirements, you need to actively provide us with identity information and/or corporate related information, or authorize us to obtain your corresponding Alipay account from Alipay.The above -mentioned relevant certification information is used for verification, registration, publicity, and other purpose of obtaining qualifications for your identity and other membership characters.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If you apply for registration as a member, you need to actively provide identity information and/or corporate related information, or authorize us to obtain relevant information from Alipay for qualification verification, registration, publicity, etc."}
{"task": "rw_65.jsonl", "id": 59423, "text": "2. Provide you with location -based services", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59424, "text": "(1) When you turn on the device positioning permissions and use the relevant services provided by our position, we will collect and process your dynamic location information.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "When you turn on the device positioning authority and use the relevant services provided by the location, you will collect and process your dynamic location information."}
{"task": "rw_65.jsonl", "id": 59425, "text": "Positioning of Guangmin, pressure, gravity, step -by -step detection), and equipment signal strength information).", "label": ["Important", "Usage"], "rewrite": "We will use various technical processing equipment information to locate."}
{"task": "rw_65.jsonl", "id": 59426, "text": "(2) In order to provide you and other Gaode users with real -time road conditions and road conditions forecasting services, we will conduct data statistics and analysis of the location information of Gaode users, and judge the traffic congestion status based on this.", "label": ["Important", "Usage"], "rewrite": "In order to provide real -time road conditions and road conditions prediction services, we will carry out data statistics and analysis of the user's location information."}
{"task": "rw_65.jsonl", "id": 59427, "text": "(3) In order to facilitate you to quickly discover the food, hotels, attractions, shopping malls, real estate and other living service information, we will also choose your nearby services and information based on your location information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Based on your location information, you prefer the services and information of you near you so that you can find the surrounding food, hotels, etc."}
{"task": "rw_65.jsonl", "id": 59428, "text": "(4) In order to provide you with better historical data recording services (such as driving report, novice graduation report, annual billing, footprint, etc.), we will be based on the cumulative positioning (location information) and the cumulative map of Gaode map and the cumulative map of Gaode Maps (location information) andThe navigation information is visualized and displayed, and the content of the service protocol for specific services shall prevail.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Based on the cumulative positioning and navigation information of Gaode Map, you can see the visual analysis and display of the navigation information, thinking that you provide historical data record services."}
{"task": "rw_65.jsonl", "id": 59429, "text": "Unless you take the initiative to share with others, the aforementioned visual analysis and display are only visible to you alone.", "label": ["Important", "Usage"], "rewrite": "In addition to your initiative to share with others, the visual analysis and display of historical data records can only be visible to you alone."}
{"task": "rw_65.jsonl", "id": 59430, "text": "(5) In order to bring you more convenient travel services, we may provide customized services based on scenes, such as commuting models and familiar road travel.", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59431, "text": "When using this service, you can set your own place (including home and company) or you can speculate and confirm you according to the historical data (navigation, location information) when you use the map.", "label": ["Important", "Usage"], "rewrite": "When using customized services, you can set up your own place or we speculate on your place to go according to historical data and confirm with you."}
{"task": "rw_65.jsonl", "id": 59432, "text": "Your frequent location (when you log in to the Gaode account, you can open the cloud synchronization function by yourself to upload the common place to the cloud to facilitate you to synchronize the relevant information after replacing the device). You can only see it yourself.Modify or choose whether to use such services.", "label": ["Edit/Control", "Important"], "rewrite": "You can only see it yourself, and you can delete, modify or choose whether to use such services."}
{"task": "rw_65.jsonl", "id": 59433, "text": "(6) When you use the location labeling and claiming service, based on the requirements of laws and regulations and to ensure the effectiveness and accuracy of the audit information, we may collect the qualification information (such as business licenses) and necessary benefits of your uploading information related subjects (such as business licenses) and necessary benefits.Related person (such as uploader) face information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the location labeling the claiming service, collect the face information of the qualification information of the information -related subject, and the face information of the person who necessary interests."}
{"task": "rw_65.jsonl", "id": 59434, "text": "You can stop the collection of your location information through system authorization to close the positioning service or system authority, but you may not be able to obtain related services or functions, or to achieve the effect that the relevant services intend to achieve.", "label": ["Permission Acquisition", "Important", "Edit/Control"], "rewrite": "It can be authorized to close the positioning service or system permissions through the system authorization to stop Gaode's collection of location information, but it may lead to the inability to achieve the expected results."}
{"task": "rw_65.jsonl", "id": 59435, "text": "3. Provide you search, information display and consulting services", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59436, "text": "When you use the search, information display and information consulting services we provide (such as the product/service information of the platforms such as real estate, life services, new car used cars), our server will automatically record your service log information, including you enter theSearch for keyword information (including information you entered through voice interaction) and the link to clicks, and your device information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use search, information display and information consulting services, the server automatically records your service log information."}
{"task": "rw_65.jsonl", "id": 59437, "text": "When you use search and information display services, we will recommend or show you a higher or more interested place based on your location information, historical behavior, order records, and retrieval behavior.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use search and information display services, use your location information, historical behavior, order records, and retrieval behavior to show you related locations."}
{"task": "rw_65.jsonl", "id": 59438, "text": "When you call the third -party service provider to seek information consulting services, we will also collect your mobile phone number, name (partial involved), and browsing records of related products in Gaode products and services, Model, etc.), and share with third -party service providers so that they can provide you with corresponding consulting services.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you seek information consulting services from a third party, you will collect your mobile phone number, name, and related products browsing records and share it with third parties."}
{"task": "rw_65.jsonl", "id": 59439, "text": "At the same time, we will record the call content of you and third -party service providers in order to provide you with customer service services and disputes.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Critic the call content of you and third -party service providers in order to provide you with customer service services and dispute dispute solutions."}
{"task": "rw_65.jsonl", "id": 59440, "text": "4. voice interaction service", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59441, "text": "In order to allow you to use some Gaode products and services more conveniently and safely through voice instructions, we provide you with voice interactive services. After you authorize us to use microphone rights, you can open the service by awakening words or click the voice button.", "label": ["Permission Acquisition", "Important"], "rewrite": "In order to allow you to use products and services through voice instructions, you can start the service after using microphone rights."}
{"task": "rw_65.jsonl", "id": 59442, "text": "During your use, we will send your voice instructions to the server, receive and record the session and audio information generated during the interaction with Gaode products and services, and the running status of Gaode Map.Feedback.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "During the use of voice interaction, the server will receive and record the session and audio information generated during the interactive process, the running status of the Gaode map, and make feedback."}
{"task": "rw_65.jsonl", "id": 59443, "text": "You can also enter the voice interactive page by clicking the voice button in the search box or the explicit manner in other products, or cancel or close it through the options in the setting function.", "label": ["Important", "Edit/Control"], "rewrite": "You can enter the voice interactive page, or cancel or close it through the options in the setting function."}
{"task": "rw_65.jsonl", "id": 59444, "text": "5. Car owner service", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59445, "text": "When you use the owner service we provide, you need to provide us with vehicle information (depending on the service type, it may include your license plate number, vehicle type, power type, vehicle brand, vehicle model and number, vehicle parameter, ETC account number, ETC account numberTo.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the owner's service, you need to provide us with vehicle information."}
{"task": "rw_65.jsonl", "id": 59446, "text": "In order to provide you with the necessary service, when the service is actually provided by the third party, you authorize us to provide the information we submit to the actual service provider. We will inform you the identity of the relevant service provider on the specific functional page.For you to decide whether to agree to share.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "When the third party provides the owner service, you authorize the information you submit to the service provider, we will inform you the identity of the service provider for you to decide whether to agree to share."}
{"task": "rw_65.jsonl", "id": 59447, "text": "If you do not provide the above information or the information provided is incorrect, you may not be able to obtain related services or functions, or to achieve the effect that the relevant services intend to achieve.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59448, "text": "For example, you can use the restricted planning service after entering the license plate number;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "After you enter the license plate number, you can use the restricted planning service."}
{"task": "rw_65.jsonl", "id": 59449, "text": "After entering the ETC account, you can estimate and record the cost of ETC through the ETC reconciliation assistant.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "After you enter the ETC account, you can estimate and record the cost of ETC through the ETC reconciliation assistant."}
{"task": "rw_65.jsonl", "id": 59450, "text": "6. Car service service", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59451, "text": "You can use car service in some Gaode map products and services, and car information services are provided by Beijing Yixing Travel and Tourism Co., Ltd. for you.", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59452, "text": "When you use a car service, in order to provide you with location -based related services, we will collect your equipment information, account information, mobile phone number, dynamic location information;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use a car service, we will collect your equipment information, account information, mobile phone number, and dynamic location information."}
{"task": "rw_65.jsonl", "id": 59453, "text": "If you use the dial -up function to contact the driver, we will collect your mobile phone number and call records;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If you contact the driver with the dial -up function, we will collect your mobile phone number and call records."}
{"task": "rw_65.jsonl", "id": 59454, "text": "If you use information interactive functions to contact the driver, we collect your equipment information and chat content.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If you use information interactive functions to contact the driver, we collect your equipment information and chat content."}
{"task": "rw_65.jsonl", "id": 59455, "text": "Based on your use of car service, we will share your aforementioned personal information with Beijing Yixing Travel and Tourism Co., Ltd..", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Based on your use of car service, we will share your personal information with Beijing Yixing Travel and Tourism Co., Ltd.."}
{"task": "rw_65.jsonl", "id": 59456, "text": "In order to provide you with a car information service to ensure your travel safety, Beijing Yixing Travel Travel Co., Ltd. will collect your equipment information. In specific scenarios, you may collect names, mobile phones, and mobile phones in accordance with the law.Number, ID number, flight number;", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Beijing Yixing Travel and Tourism Co., Ltd. may collect names, mobile phone numbers, ID numbers, and flight numbers to you in accordance with the law to ensure your travel safety."}
{"task": "rw_65.jsonl", "id": 59457, "text": "Beijing Yixing Travel and Tourism Co., Ltd. will collect invoices based on your invoice request, tax number, recipient name, mobile phone number, mailbox.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Based on your invoice request, Beijing Yixing Travel and Tourism Co., Ltd. will collect invoices, tax numbers, recipient names, mobile phone numbers, mailboxes."}
{"task": "rw_65.jsonl", "id": 59458, "text": "Based on your use of car information services and laws, Beijing Yixing Travel and Tourism Co., Ltd. will share your equipment information, names, ID numbers, location information, flight number to No. 1 based on different car information services you choose.The three -party capacity provider, and based on your invoice request, share the above invoicing information with a third -party capacity provider.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk", "Usage"], "rewrite": "Based on the car information service you choose, Beijing Yixing Travel and Tourism Co., Ltd. will share your equipment information, name, ID number, location information, flight number, and ticket information to third -party capacity providers."}
{"task": "rw_65.jsonl", "id": 59459, "text": "7. Help you complete orders, order management and invoice services", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59460, "text": "Gaode Map has created a rich travel life service for you. When you order specific goods and/or services, in order to help you complete the transaction, ensure your transaction security, query order information, provide customer service and after -sales service, and we other usTo clearly inform the purpose, we will collect personal information of your (or actual user, such as hotels, tickets entering the park, actual passenger, etc.), including Gaode account information, third -party service account information (some scenarios involve involvedFor example, some hotel booking services), name, identity information, contact information, contact information, order information, payment information, and other services described.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you order specific products and/or services, we will collect your personal information so that you can successfully complete the transaction and ensure the security of transaction."}
{"task": "rw_65.jsonl", "id": 59461, "text": "In some scenarios of the above information, you need to fill in your own or automatically generate. In some scenarios, you need to authorize us to obtain it from the product and/or service provider based on the provision of services;", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59462, "text": "At the same time, we will also share the names, contact information, identity information, accommodation information, accommodation information, order information, payment information, etc. from the products and/or services provided by you to order third parties.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Based on the products and/or services provided by your order, we will share the names, contact information, identity information, accommodation information, order information, payment information, etc. of the actual user."}
{"task": "rw_65.jsonl", "id": 59463, "text": "You can view and manage your order information through \"My Order\".", "label": ["Important", "Edit/Control"], "rewrite": "You can view and manage your order information through \"My Order\"."}
{"task": "rw_65.jsonl", "id": 59464, "text": "In some service scenarios, in order to facilitate your subsequent booking service fast, we have established a travel service card for you to automatically store the travel information, contact information, and mailing address provided by your services as common information in order to be able to use it.Select and use directly in the service, no need to fill in again.", "label": ["Important", "Usage"], "rewrite": "We will automatically store the travel information, contact information, and mailing address provided by your services as common information, so that you do not need to fill in again."}
{"task": "rw_65.jsonl", "id": 59465, "text": "You book goods or services for others, and you need to provide information about the actual ordering person/pedestrian/passenger according to the prompts.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you book goods or services for others, you need to provide information about the actual ordering person/pedestrian/passenger."}
{"task": "rw_65.jsonl", "id": 59466, "text": "Before you provide us with information about the actual subscriber/travelers/passengers, you make sure you have obtained the consent of the actual subscriber/pedestrian/passenger himself, and ensure that it is known and accepts the privacy policy.", "label": ["Important", "First Party Collection Information"], "rewrite": "Before you provide us with information about the actual subscriber/travelers/passengers, you should ensure that you have obtained the consent of the actual subscriber/pedestrian/passenger himself, and ensure that it is known and accepts the privacy policy."}
{"task": "rw_65.jsonl", "id": 59467, "text": "If you order air tickets, hotels, train tickets, car tickets or other products or services for children, you need to obtain the consent of the child's guardian's guardian before order.", "label": ["Specific Audiences", "Important", "First Party Collection Information"], "rewrite": "If you order goods or services for children, you need to obtain the consent of the child's guardian's guardian involved before ordering."}
{"task": "rw_65.jsonl", "id": 59468, "text": "When you need to issue an invoice based on the specific products and/or services you order, you need to provide the type of invoice head, invoice head, tax number, date, mobile phone number, mailbox address, recipient/leaving information, entering the park, enter the park according to the prompts/Leave the park information, if you need to issue a paper invoice, you also need to provide the recipient, mobile phone number, and delivery address information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you need to issue an invoice, you need to provide information such as the type of invoice head, invoice head, tax number, date, mobile phone number, etc. If you need paper invoices, you also need to provide recipients, mobile phone numbers, and delivery address information."}
{"task": "rw_65.jsonl", "id": 59469, "text": "If the specific goods and/or services you order are provided by a third party, we will share the aforementioned invoice information to the service provider in order to issue an invoice for you.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "If the specific products and/or services you order are provided by a third party, we will share invoice information to the service provider."}
{"task": "rw_65.jsonl", "id": 59470, "text": "When you use the invoice to issue the function, this service is provided by Shanghai Suduan Information Technology Co., Ltd. to provide underlying technical support.", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59471, "text": "8. You participate in operating activities", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59472, "text": "When you participate in our operating activities, we may need you to provide your Gaode account, name, delivery address, location, postcode, identity information, contact information, bank or payment transaction accounts.The operation of the operation activity page shall prevail.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you participate in operating activities, you need to provide your Gaode account, name, receipt address, location, postcode, identity information, contact information, bank or payment transaction account number."}
{"task": "rw_65.jsonl", "id": 59473, "text": "When you participate in some operating activities, such as the list of lists, you may need to disclose your Gaode account avatar and nickname.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "When you participate in some operational activities, you may need to disclose your Gaode account avatar and nickname."}
{"task": "rw_65.jsonl", "id": 59474, "text": "After you start reading/write the calendar authority, we will collect your calendar information to provide you with related records and reminders of receiving equity.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "After you open the read/write calendar authority, we will collect your calendar information to provide relevant records and reminders of receiving equity."}
{"task": "rw_65.jsonl", "id": 59475, "text": "If you do not participate in related operating activities, you do not need to provide the aforementioned information.", "label": ["First Party Collection Information", "Permission Acquisition"], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59476, "text": "You know and agree that for your contact information that you use when registering, logging in or bound to your mobile phone number, we may send one or more of them in the operation, for user messagesSafety verification, user experience research, dispute treatment, etc.;", "label": ["Important", "Usage"], "rewrite": "We may send multiple types of notifications to your contact information, for user messages, authentication, security verification, user experience research, dispute processing, etc."}
{"task": "rw_65.jsonl", "id": 59477, "text": "In addition, we may also use the mobile phone number collected in the previous description to provide you with the purpose of commercial information such as services, functions or activities that you may be interested in, but please rest assured that if you wantThis information, you can be withdrawing through the withdrawal method provided in the mobile phone SMS, or you can contact us directly to the withdrawal.", "label": ["Important", "Usage", "Edit/Control"], "rewrite": "We may provide you with business information such as services, functions or activities that you may be interested in through your contact information."}
{"task": "rw_65.jsonl", "id": 59478, "text": "9. Customer service and dispute processing", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59479, "text": "When you contact us or ask for consultation, complaints, reports or application for sale, after -sales, dispute disputes, in order to ensure your account and system security, we need you to provide the necessary individuals in order to protect your account and system security.Information to verify your member status.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you conduct consultation, complaints, reports, or application for sale, after -sales, and dispute disputes, we need you to provide the necessary personal information to verify your membership."}
{"task": "rw_65.jsonl", "id": 59480, "text": "In order to facilitate the processing plan and results of helping you solve the problem or record related issues as soon as possible, we may preserve your communication, communication/call records and related content (including account information, order information, to prove the relevant related to related related to the relevantOther information provided by the facts, or the contact information you leave).", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may save your communication, communication/call records and related content in order to contact you, help you solve the problem or record the processing plan and results."}
{"task": "rw_65.jsonl", "id": 59481, "text": "For specific services, orders, functions, and operation activities, we will use your account information and order information or service record information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We will use your account information and order information or service record information to feedback your consultation, complaints, and suggestions for specific services, orders, functions, and operation activities."}
{"task": "rw_65.jsonl", "id": 59482, "text": "In order to provide reasonable needs for services and improve service quality, we may actively contact you through your mobile phone number bound to you when you register, log in or use Gaode Map. We may also use your other information, including: software running interface, youWhen you contact the relevant information provided by the customer service, you will send us the questionnaire answer information to us during the questionnaire survey.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may take the initiative to contact you through your mobile phone number, or use your other information to provide services and improve service quality."}
{"task": "rw_65.jsonl", "id": 59483, "text": "In order to ensure the service experience and processing service disputes, when you contact some third -party service providers (or drivers in the car service) provided by the applet provided by Gaode products and services, we will open virtualThe real number of the number function protection you or the third -party service provider (or the driver in the car service) (based on the page notification, because the virtual number is not opened in some scenarios, the service provider will collect your mobile phone number at this timeHe Call Records), this virtual number protection service provides underlying technical support by Alibaba Cloud Computing (Beijing) Co., Ltd..", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "When you contact the third -party service provider through the phone function, we will turn on the virtual number function to protect the real number of your or third -party service providers. This virtual number protection service is provided by Alibaba Cloud Computing (Beijing) Co., Ltd. provided underlying technical support."}
{"task": "rw_65.jsonl", "id": 59484, "text": "You use the virtual number function to make a call, and we will collect your mobile phone number and call recording. When you have a service dispute with a third party, after you are authorized, we and third -party service providers can retrieve and use recording information as a resolution of disputes as disputes.Reference basis.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you have a service dispute with a third party, after you are authorized, we and third -party service providers can retrieve the collected mobile phone number and call recording as a reference for the dispute."}
{"task": "rw_65.jsonl", "id": 59485, "text": "We will effectively ensure the privacy and security of the two parties, and the parties to the relevant parties cannot download, retrieve or play recording by themselves;", "label": ["Important", "Data Security"], "rewrite": "All parties cannot download, retrieve or play recording by themselves."}
{"task": "rw_65.jsonl", "id": 59486, "text": "Except for the following circumstances, we will not provide the recording to anyone (including the master of the call, the call of the call): a.", "label": ["Important", "Data Security", "Usage"], "rewrite": "Except for the following circumstances, we will not provide the recording to anyone: a. The authority has the right to retrieve it according to legal procedures; b."}
{"task": "rw_65.jsonl", "id": 59487, "text": "b. The recording of the legal documents issued by the judicial organs was retrieved according to law.", "label": ["Usage"], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59488, "text": "10. Provide you with collection, recording and sharing functions", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59489, "text": "In the process of using Gaode products and services, you can choose to collect the location, route, and information of interest, mark the location you choose, make the route you like or take, record your dynamic location, you also you stillBased on our sharing function components and group (team) functional components, share your or your collection or the location and route you tagged with others, social networks.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In the process of using the product and service, you can choose to collect, label, make, and produce the place, route, and information that are interested in, and share it with others and social networks."}
{"task": "rw_65.jsonl", "id": 59490, "text": "In the process of using the above functions, we will collect information including your collection records, production and records, and dynamic location, and the service log information generated by your use of above.the goal of.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In your use of collection, records and sharing functions, we will collect your information to share history and service log information."}
{"task": "rw_65.jsonl", "id": 59491, "text": "You can view or manage your collection and record information on the collection clip and related functional pages.", "label": ["Important", "Edit/Control"], "rewrite": "You can view or manage the collection and record information on the collection clip and related functional pages."}
{"task": "rw_65.jsonl", "id": 59492, "text": "11. Provide you with information and problem feedback functions", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59493, "text": "In the process of using Gaode products and services, you can submit feedback to us to the data update intelligence, Gaode products and services in Gaode products and services. For example, you can report to us through the feedback function entranceIncrease, wrong location, roads, road conditions, etc.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can submit feedback to us for errors or problems in the data update information, products and services you discovered."}
{"task": "rw_65.jsonl", "id": 59494, "text": "You agree to review the information you feedback and use to improve and improve our product and service quality.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "You agree to review the information you feedback and use it to improve and improve product and service quality."}
{"task": "rw_65.jsonl", "id": 59495, "text": "In the process of using the above features, we will collect your feedback records (specific feedback information will be different due to the different types of your feedback, it may include the graphic information, voice information, location information, and contact telephone number you uploaded.Essence", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In your use of intelligence and feedback functions, we will collect your feedback records and service log information."}
{"task": "rw_65.jsonl", "id": 59496, "text": "Special reminder, if you grant your mobile phone camera or photo positioning permissions, the picture information you upload will contain your location information, you can close the mobile phone camera or photo positioning permissions through the mobile phone system) and the service log generated by your use of the above featuresThe information is used to achieve the above functions and the purpose we have clearly notified.", "label": ["Usage", "First Party Collection Information", "Permission Acquisition"], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59497, "text": "Please note that the information you feed to us may involve your or other people's personal information and even sensitive personal information, such as the content you feeds up uploading contains personal information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Please note that the information you feedback may involve your or others' personal information or even sensitive personal information."}
{"task": "rw_65.jsonl", "id": 59498, "text": "If you involve personal information of others in your feedback, you need to obtain the consent of others before publishing.", "label": ["Important", "First Party Collection Information"], "rewrite": "If your feedback information involves personal information of others, you need to obtain the consent of others before release."}
{"task": "rw_65.jsonl", "id": 59499, "text": "12. Provide you with information release and interactive communication functions", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59500, "text": "You can choose the functions of comments, Q & A, forum, topic, traffic, and other information release functions for you. Choose to publish graphic, voice, location and positioning information, publish evaluation and Q & A content.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You can select graphic, voice, location and positioning information through information release function, and publish comments and Q & A content."}
{"task": "rw_65.jsonl", "id": 59501, "text": "In the process of using the above features, we will collect and publicly display your Gaode account, nickname, avatar, content you posted, and at the same time we will collect the service log information generated by your above functions to achieve the above functions and other us.The purpose of the notification is clear.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the information publishing function, we will collect and publicly display your AutoNavi account number, nickname, avatar, the content you posted, and collect your service log information."}
{"task": "rw_65.jsonl", "id": 59502, "text": "When you post a comment, we will collect and use location information such as your location when you post a comment, whether you have navigated to the commented merchants navigation end information, the location when you uploaded a photo, and other location information to verify your posting comment. Authenticity, and display your location information with your consent.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We will collect and use your various location information to determine the authenticity of your publishing comments and show your location information after your consent."}
{"task": "rw_65.jsonl", "id": 59503, "text": "If you use groups (teaming), family maps, work maps and other interactive communication functions, you can choose to publish and share graphics, voice, location and positioning information with others.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you use groups, family maps, work maps, and other interactive communication functions, you can choose to publish and share graphic, voice, location and positioning information with others."}
{"task": "rw_65.jsonl", "id": 59504, "text": "When you use the above functions, we will collect member group nicknames, setting information, group names (if any), mobile phone numbers (if any), license plate numbers (if any), the content of the information you post, and record your interactions with others. Members' co-group membership for using the above services;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the interactive communication function, we will collect member group nicknames, setting information, group names, mobile phone numbers, license plate numbers, the content of the information you post, and record the relationship between members of the same group."}
{"task": "rw_65.jsonl", "id": 59505, "text": "Your clipboard function will be called when reading the shared password, you can turn off the clipboard usage setting through \"Settings\" - \"About Gaode Map\" - \"Privacy Settings\" (after closing, the password function will not be able to be used normally ).", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "When reading and sharing passwords, your shear plate function will be called. You can use the \"setting\"-\"About Gaode Map\"-\"Privacy Settings\" to turn off the cutting plate."}
{"task": "rw_65.jsonl", "id": 59506, "text": "At the same time, we will also provide you with instant messaging, sports health and other interesting information sharing functions (subject to the specific product form), and we will detail the collected information and permissions in the service agreement of the specific service.", "label": ["Usage"], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59507, "text": "Based on the need for you to use the interactive communication function, we will share your device information, nickname and avatar with our service partners Dingding (China) Information Technology Co., Ltd. and Dingding Technology Co., Ltd.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Based on the need for you to use the interactive communication function, we will share your device information, nickname and avatar with our service partners Dingding (China) Information Technology Co., Ltd. and Dingding Technology Co., Ltd."}
{"task": "rw_65.jsonl", "id": 59508, "text": "Please note that the information you posted may involve your or others' personal information or even sensitive personal information, and the business information of other companies.It will be collected and used by others. Please consider it more cautiously whether to publicly, share, and even publicly share relevant information when using our services.", "label": ["Important", "Risk"], "rewrite": "Please consider whether to open, share, or even publicly share personal information involving you or others, or even sensitive personal information, and business information of other companies."}
{"task": "rw_65.jsonl", "id": 59509, "text": "If you involve personal information and corporate information involved in the information you publish, you need to obtain the consent of others or enterprises before release.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you involve personal information and corporate information involved in the information you publish, you need to obtain the consent of others or enterprises before release."}
{"task": "rw_65.jsonl", "id": 59510, "text": "If the information you publish publicly involves children's personal information, you need to obtain the authorization and consent of the guardians of the children involved before publishing.", "label": ["Specific Audiences", "First Party Collection Information", "Important"], "rewrite": "If the information you publish publicly involves children's personal information, you need to obtain the authorization and consent of the guardians of the children involved before publishing."}
{"task": "rw_65.jsonl", "id": 59511, "text": "Under the aforementioned circumstances, other obligees or guardians of children have the right to contact us through the channels stipulated in this policy or the specific functional service agreement, and request to correct or delete the content involving their own personal information or that of their guardian children.", "label": ["Edit/Control", "Important"], "rewrite": "The right holder or child guardian has the right to contact us to require more correct or delete the personal information involving its own or their guardianship."}
{"task": "rw_65.jsonl", "id": 59512, "text": "13. To provide you with security", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59513, "text": "Due to the needs of security services or in accordance with laws and regulations, in some services or scenarios (in services and scenes, we will clearly inform you), you need you to perform real -name authentication, face recognition or qualification certification. The specific service will be based on Alipay (China)Network Technology Co., Ltd. provides you.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Due to the needs of security services or in accordance with laws and regulations, you need to provide real -name authentication, face recognition or qualification certification. The specific services will be provided by Alipay (China) Network Technology Co., Ltd."}
{"task": "rw_65.jsonl", "id": 59514, "text": "In order to improve the accuracy and security of the verification service, the verification service provider may save your face information or qualification information, and when necessary, the relevant information authorized by the institutions or government organs allowed by the information and laws and regulationsComparison test.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Verify the service provider may save your face information or qualification information and compare with the information saved by qualified institutions."}
{"task": "rw_65.jsonl", "id": 59515, "text": "In order to improve the security of your services to provide services with our affiliated companies and partners, protect the safety of personal property of you or other users or the public, and better prevent fishing websites, fraud, network vulnerabilities, computer viruses, cyber attacks, Internet intrusion risk, more accurately identify violations of laws and regulations or related agreements and rules of Gaode products and services. We embed the application security SDK developed by our affiliated companies in the application to collect your equipment information, service log information, or will beThe necessary equipment information, service logs and other information to share with security service providers, and may use or integrate your membership information, trading information, equipment information, service log information, and our affiliated companies and partners to obtain your authorization or sharing based on law sharing according to lawLet's comprehensively judge your accounts and transaction risks, conduct authentication, test and prevent security incidents, and take necessary records, audit, analysis, and disposal measures in accordance with the law.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "Equipment information, service log information, etc. to judge your account risk, authentication, and prevent security incidents."}
{"task": "rw_65.jsonl", "id": 59516, "text": "14. Guarantee product and service normal operation", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59517, "text": "In order to ensure the normal operation of AutoNavi products and services, provide you with problem diagnosis or equipment testing services and perform data statistics, as well as the convenience of your use of AutoNavi products and services, push information to you, we will collect your device information, Including device identifiers (IMEI, IDFA, Android, ID, MAC address, OAID, IMSI, OpenUDID, hardware serial number, and other device-related information), application information (application crash information, notification switch status, application installation list, and other application-related information) Information), device parameters and system information (device type, device model, operating system and hardware-related information), device network environment information (IP address, WiFi information, base station information and other network-related information), based on different devices and systems ( Android/iOS) and system versions, the collected device information will be different, the actual collection shall prevail.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your device information to ensure the normal operation of products and services, data statistics, push messages, etc."}
{"task": "rw_65.jsonl", "id": 59518, "text": "When you use the client software or hardware devices you use frequently report an error or display an error log information to us, in order to check the software or hardware equipment error and provide you with better services, we will record and collect your equipment on your device.Configure information, abnormal data, etc. for diagnosis and improvement of products and services.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When client software or hardware devices frequently report errors or display error log information, it will record, collect your configuration information, and abnormal data on your device for diagnosis."}
{"task": "rw_65.jsonl", "id": 59519, "text": "(2) Service interaction", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59520, "text": "1. We will provide applet services in Gaode products and services so that you can access and use products and services provided by third parties through mini -program.", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59521, "text": "When you use the applet, you authorize that we need to collect your equipment information, Gaode account information, Alipay account information, Alipay avatar and nickname, and the necessary service log information to implement this function, thinking that you provide applet -related technologiessupport.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use a small program, you have authorized to collect your equipment information, Gaode account information, Alipay account information, Alipay avatar and nickname, service log information."}
{"task": "rw_65.jsonl", "id": 59522, "text": "We promise that the scope of collecting and using your personal information will not exceed the scope of the privacy policy.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The scope of collecting and using your personal information will not exceed the scope of privacy policy."}
{"task": "rw_65.jsonl", "id": 59523, "text": "However, the function of collecting information and providing services will be affected by small programs or technical solutions, which shall prevail on the content of the service page.", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59524, "text": "Please note that these small programs in Gaode products and services will be provided by Beijing Gaodeyun Tu Technology Co., Ltd. and Hangzhou Squeaks Sound Information Technology Co., Ltd. to provide you with technical support.", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59525, "text": "2. On some smart terminal devices, we will provide you with your device system and third -party application interaction. Gaode may provide your device system or third -party software basedYour location information, your collection or location information, in a special situation will include the contact information you fill in.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Gaode may provide your location information, collection or location information, and contact information to your device system or third -party software to provide you with services."}
{"task": "rw_65.jsonl", "id": 59526, "text": "If you refuse to collect and use such information, you need to set or close the software to provide services in the device system. Gaode cannot automatically or manually set off related services.", "label": ["Edit/Control", "Important"], "rewrite": "If you refuse to collect and use location information and location information, you need to set or close the software to provide services in the device system."}
{"task": "rw_65.jsonl", "id": 59527, "text": "(3) Personalized recommendation and independent control", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59528, "text": "We will converge, identify and analyze the equipment information, log information, or other information collected by Gaode products and services to gather, identify and analyze, or further process it to predict the characteristics of group preferences.", "label": ["Important", "Usage"], "rewrite": "Use your device information, log information, or other information that you have authorized to gather, identify and analyze, or further process it to predict the characteristics of group preferences."}
{"task": "rw_65.jsonl", "id": 59529, "text": "Based on the characteristics of group preferences, we will show or push the content that may be interested or correlated with higher correlations (including some search results) to the relevant population, and sort the displayed content.", "label": ["Important", "Usage"], "rewrite": "Based on the characteristics of group preferences, show or push to relevant populations that may be interested or correlated."}
{"task": "rw_65.jsonl", "id": 59530, "text": "If you are not interested in our information display, you can click \"My\"-\"Settings\"-\"About Gaode Map\"-\"Privacy Settings\" to close personalized recommendations.", "label": ["Important", "Edit/Control"], "rewrite": "If you are not interested in our information display, you can click \"My\"-\"Settings\"-\"About Gaode Map\"-\"Privacy Settings\" to close personalized recommendations."}
{"task": "rw_65.jsonl", "id": 59531, "text": "You understand that the shutdown path on different devices may be different. If you cannot find the closing button, you can contact us through artificial customer service.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59532, "text": "If you need to check the searches in the site we provide, you need to check the sorting of its personal characteristics. You can click \"Recommended Sort\" on the search results page, and select the \"distance priority\" and \"praise priority\".", "label": ["Important", "Edit/Control"], "rewrite": "If you need to check the sorting of its personal characteristics, you can click \"Recommended Sort\" on the search results page, and select the \"distance priority\" and \"praise priority\"."}
{"task": "rw_65.jsonl", "id": 59533, "text": "(4) Equipment rights adjustment", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59534, "text": "In the process of providing the service, Gaode will call some of your equipment permissions. You can check the authority status in the setting function of the device or \"Privacy Settings\", and you can choose to open or close part or all permissions.", "label": ["Important", "Edit/Control"], "rewrite": "You can check the authority status in the setting function of the device or \"Privacy Settings\", and you can choose to open or close part or all permissions."}
{"task": "rw_65.jsonl", "id": 59535, "text": "Please note that when you start the right of power, it means that you authorize us to collect and use relevant personal information to provide you with corresponding services. Once you turn off the right of power, it means that you cancel the authorization.And the use of relevant personal information can not provide you with the service corresponding to the permissions.", "label": ["Risk", "Edit/Control", "First Party Collection Information", "Important"], "rewrite": "The opening of one authority means that the authorization is authorized to collect and use the relevant information to provide corresponding services. Close the authority to cancel the authorization representative, and no longer continue to collect and use relevant information based on the corresponding permissions."}
{"task": "rw_65.jsonl", "id": 59536, "text": "However, your decision to close permissions will not affect the collection and use of information based on your authorization.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Close authority will not affect the collection and use of information based on authorization."}
{"task": "rw_65.jsonl", "id": 59537, "text": "In different devices, the right display mode and closing method are different. Please refer to the device or system development instructions and guidance.", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59538, "text": "Your device system may open other permissions at the same time as necessary information authorization, and Gaode itself cannot close the authorization through manual or automatic settings.", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "Your device system may open other permissions at the same time as necessary information authorization, and Gaode itself cannot close the authorization through manual or automatic settings."}
{"task": "rw_65.jsonl", "id": 59539, "text": "You can click here to view the application authority application and usage description.", "label": ["Important", "Edit/Control"], "rewrite": "You can click here to view the application authority application and usage description."}
{"task": "rw_65.jsonl", "id": 59540, "text": "(5) Technical treatment description", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59541, "text": "Please know that, according to the applicable laws, we may de -identify the collected personal information after researching, statistical analysis, prediction, big data calculation, etc., to help evaluate, improve, and design the various products and services we provide, So that we can provide more accurate, personality and convenient services, or provide product and service support and operating activities for business decisions.", "label": ["Important", "Usage"], "rewrite": "We may conduct de -identified research, statistical analysis, prediction, big data calculation, etc. of the collected personal information to evaluate, improve, design products and services, and provide personalized services."}
{"task": "rw_65.jsonl", "id": 59542, "text": "We will follow the industry's leading data security technologies such as de -identification, anonymity, pseudonymization, and privacy protection computing technologies such as federal learning, security multi -party computing, and confidential computing based on the situation.The collected data is analyzed and excavated, and you do not need to notify you and obtain your consent.", "label": ["Important", "Data Security", "Usage"], "rewrite": "The data we collected cannot identify specific personal data for analysis and processing, and there is no need to notify you and obtain your consent."}
{"task": "rw_65.jsonl", "id": 59543, "text": "We will take technical measures and other necessary measures for processing, and conduct data aggregated and anonymous group analysis and research on data in the form of unable to identify or push personal information. It may also use data for machine learning or algorithm model training.And provide data technical services, such as helping optimize advertising to launch marketing effects, assist in commercial decision -making analysis, and carry out analysis of commercial site selection.", "label": ["Important", "Data Security", "Usage"], "rewrite": "We conduct aggregate and anonymous group analysis and research on data, and may also be used for machine learning or algorithm model training, and provide data technical services."}
{"task": "rw_65.jsonl", "id": 59544, "text": "If you signed a corresponding authorization agreement or document with the credit reporting agency (such as Credit Credit, Park Dao Credit, etc.), financial institutions or other institutions, and based on your aforementioned authorization and this policy, we will comprehensively comprehensively make your personal informationStatistics, analysis or processing and providing data processing results to the aforementioned agency.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Based on your authorization and consent and financial institutions and financial institutions, comprehensive statistics, analysis or processing of your personal information are provided to the institution with data processing results."}
{"task": "rw_65.jsonl", "id": 59545, "text": "You can also explain more information processing through the principle of Gaode algorithm.", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59546, "text": "(6) Service of Cookie and similar technologies", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59547, "text": "Cookie and similar device information identification technology are commonly used in the Internet.", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59548, "text": "When you use our service, we may use related technologies to send one or more, cookie, or anonymous identifiers (hereinafter referred to as \"Cookie\") to collect, identify and store your access, use this product, use this productInformation about time.", "label": ["Important", "First Party Collection Information"], "rewrite": "Use cookie or anonymous identifiers to collect, identify, and store your information when you access and use the product."}
{"task": "rw_65.jsonl", "id": 59549, "text": "We promise that cookies will not be used for any other purposes other than the purpose of this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59550, "text": "We use, cookies, mainly to ensure the safety and efficient operation of products and services, allow us to confirm the security status of your account and transaction, check the relevant abnormal situation of collapse and delay, and help you save you to fill in the form, enter the search contentSteps and processes.", "label": ["Important", "Usage"], "rewrite": "Use Cookie to confirm the security status of your account and transaction, check the related abnormal conditions of collapse, delay, and simplify the use process."}
{"task": "rw_65.jsonl", "id": 59551, "text": "At the same time, we may use, cookie, show you information or functions you may be interested in, conduct data analysis, and optimize your choice of advertising, improve product services and user experience.", "label": ["Important", "Usage"], "rewrite": "Use Cookie to show you information or functions to you, analyze data, and improve product services and user experience."}
{"task": "rw_65.jsonl", "id": 59552, "text": "Most browsers provide users with the function of removing the browser cache data. You can perform the corresponding data clearing operation, or you can modify the degree of acceptance of cookies or reject our cookies.", "label": ["Important", "Edit/Control"], "rewrite": "You can set the data through the browser settings, or you can modify the degree of acceptance of cookies or reject cookies."}
{"task": "rw_65.jsonl", "id": 59553, "text": "You may not be able to use services or corresponding functions that depend on cookies because of these modifications.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59554, "text": "(7) Others", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59555, "text": "Please understand that the services we provide to you are constantly updated and developed.", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59556, "text": "If you choose to use other services that have not been covered in the aforementioned description, based on the service we need to collect your information, we will explain the scope and purpose of the information collection through page prompts, interaction processes, and agreement.Get your consent.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59557, "text": "3. How do we provide your personal information outside", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59558, "text": "(1) Sharing", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59559, "text": "We will not share your personal information with companies, organizations and individuals outside Gaode, except the following situations:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not share your personal information with companies, organizations and individuals outside Gaode, except the following situations:"}
{"task": "rw_65.jsonl", "id": 59560, "text": "1. Perform the sharing necessary for the legal obligations: we may share your personal information in accordance with the requirements of laws and regulations, litigation, and disputes in accordance with the requirements of administrative and judicial organs in accordance with the requirements of administrative and judicial organs in accordance with the law, and other legal obligations.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share your personal information in accordance with the requirements of laws and regulations, litigation, and disputes in accordance with the requirements of administrative and judicial organs in accordance with the requirements of administrative and judicial organs in accordance with the law, as well as other legal obligations."}
{"task": "rw_65.jsonl", "id": 59561, "text": "2. Sharing your consent: After getting your clear consent, we will share your personal information with other parties.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After getting your clear consent, we will share your personal information with other parties."}
{"task": "rw_65.jsonl", "id": 59562, "text": "3. The sharing of sharing in order to set up and fulfill your contract as a party as a party: When you choose or order the goods or services provided by a third party, in order to complete the booking service, after -sales service, and ensuring the security of the service safety for you smoothlyWe will provide your personal information based on service providers.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to establish and fulfill your contract as a party, we will share your personal information."}
{"task": "rw_65.jsonl", "id": 59563, "text": "4. Sharing with affiliated companies: In order to facilitate us to provide some services with related companies, provide you with products and services based on Gaode accounts, recommend information that you may be interested in, identify the abnormal membership account, protect the Gaode affiliated company or to protect the Gaode affiliated company orThe safety of personal property of other users or the public is exempted from violations, and your personal information may be shared with our affiliated companies and/or its designated service providers.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Your personal information may be shared with our affiliated companies and/or its designated service providers to provide services, identify account abnormalities, and protect the safety of personal property of all parties."}
{"task": "rw_65.jsonl", "id": 59564, "text": "We will only share the necessary personal information and be restricted by the purpose declared in this policy. If we share your sensitive personal information or the purpose of changing personal information to change personal information, we will solicit your authorization consent again.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If we share your sensitive personal information or change the purpose of the use and processing of personal information, we will solicit your authorization consent again."}
{"task": "rw_65.jsonl", "id": 59565, "text": "You can click here to view the \"Sharing Personal Information List with a Third Party\".", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You can click here to view the \"Sharing Personal Information List with a Third Party\"."}
{"task": "rw_65.jsonl", "id": 59566, "text": "Before sharing information, we will sign strict data security and confidentiality agreements with third parties in shared personal information, asking them to take relevant confidentiality and security measures to handle personal information in accordance with our instructions and privacy policies.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Before sharing information, we will sign a data security and confidentiality agreement with the partner."}
{"task": "rw_65.jsonl", "id": 59567, "text": "Please note that when you use our service, you voluntarily share or even publicly share information, which may involve your or other people's personal information and even sensitive personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Please note that the information you share may involve your or other people's personal information and even sensitive personal information."}
{"task": "rw_65.jsonl", "id": 59568, "text": "Please consider and make a decision more cautiously.", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59569, "text": "(2) Entrusted processing", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59570, "text": "We may entrust a partner to handle your personal information in order to authorize partners to represent you to provide you with certain services or fulfilling functions.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59571, "text": "We will only entrust their information for the legal, correct, necessary, specific, and clear goals of this policy statement. We can authorize partners to only contact the information required by their duties, and we will ask for the agreement to request that it must not be requiredThis information is used for any other purpose beyond the scope of commission.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will only entrust them to process your information for the purpose of this policy, and the trustee can only contact the information required for the performance of its duties, and shall not exceed the scope of the commission."}
{"task": "rw_65.jsonl", "id": 59572, "text": "If the authorized partner will use your information for our unreasonable purpose, it will obtain your consent alone.", "label": ["Third Party Sharing/ Disclosure", "Data Security"], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59573, "text": "At present, our authorized partners include the following types:", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59574, "text": "1. Authorized partners of advertising and analysis of service.", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59575, "text": "Under the premise of using industry -universal security technology, we will entrust these partners to handle information about advertising, coverage, and effectiveness related to advertising.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We will entrust partners to process information related to advertising, coverage, and effectiveness related to advertising."}
{"task": "rw_65.jsonl", "id": 59576, "text": "Unless you obtain your permission, we will not commission your personal identity information entrustment partners;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Unless you get your permission, we will not commission your personal identity information to commission partners."}
{"task": "rw_65.jsonl", "id": 59577, "text": "Or we will identify this information to identify it so that the partners can not identify your individual.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will identify the information of the entrusted processing to identify it so that the trustees cannot recognize your individual."}
{"task": "rw_65.jsonl", "id": 59578, "text": "Such partners may combine the above information with other data they have legally obtained to implement the advertising services or decision -making suggestions that we entrust.", "label": ["Important", "Usage"], "rewrite": "The trustees may combine the entrusted information with other legally obtained data to fulfill their obligations."}
{"task": "rw_65.jsonl", "id": 59579, "text": "2. Suppliers, service providers and other partners.", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59580, "text": "We entrust the information to the suppliers, service providers and other partners who support our business to handle it. These supports technical infrastructure services that are entrusted to our commission, analyze our service methods, provide customer analysis and statistics, provide customer service, provide customer serviceAnd survey, pay convenience or conduct academic research and investigation.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We entrust the information to the supplier, service provider and other partners to handle the business support to provide customer analysis and statistics, provide customer service and investigation."}
{"task": "rw_65.jsonl", "id": 59581, "text": "(3) Transfer", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59582, "text": "If we need to transfer personal information for the reasons for merging, separation, dissolution, and declaration of bankruptcy, we will inform you the name or name and contact information of the receiver.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "If business mergers, acquisitions, asset transfer, etc. involve the transfer of personal information, you will inform you of the relevant situation."}
{"task": "rw_65.jsonl", "id": 59583, "text": "The receiver will continue to fulfill this policy and other legal obligations.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59584, "text": "If the receiver changes the original treatment purpose and method of processing, you will re -obtain your consent.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59585, "text": "(4) Public disclosure", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59586, "text": "We will only publicly disclose your personal information in the following circumstances:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only publicly disclose your personal information in the following circumstances:"}
{"task": "rw_65.jsonl", "id": 59587, "text": "1. Based on your active choice and other individual consent, we may publicly disclose your personal information;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Based on your initiative and other individual consent, we may publicly disclose your personal information;"}
{"task": "rw_65.jsonl", "id": 59588, "text": "2. If we determine that you have violated laws and regulations or seriously violated Gaode related agreements and rules, or to protect the security of the personal property of Gaode users or the public, we may disclose personal information about you, including related violations of regulations, including relevant violations of regulationsBehavior and Gaode have taken measures for you.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you violate laws and regulations or seriously violate Gaode related agreements and rules, or to protect the safety of personal property of all parties, we may disclose personal information about you."}
{"task": "rw_65.jsonl", "id": 59589, "text": "(5) Third -party SDK service", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59590, "text": "In order to ensure the stable operation and functional implementation of Gaode products and services, so that you can use and enjoy more services and functions. Our products and services will embed SDK or other similar applications of authorized partners.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59591, "text": "We will strictly test the application interface (API) and software tool development package (SDK) of the authorized partners to obtain relevant information, and strict data protection measures with the authorized partners, so that it will be in accordance with this policy and any other any otherRelated confidentiality and security measures to handle personal information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will conduct security testing of the relevant information for the partners and agreed to data protection measures."}
{"task": "rw_65.jsonl", "id": 59592, "text": "You can click here to view the details we access.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You can click here to view the details we access."}
{"task": "rw_65.jsonl", "id": 59593, "text": "(6) Advertising business", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59594, "text": "In order to provide the purpose of advertising push, advertising, advertising analysis and statistics for our partners (such as advertisers and advertising operators), we will provide the device information that is identified or anonymous to the aforementioned partner to achieveThe purpose of advertising optimization and improving the effective touch rate of advertising.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We will provide device information that is identified or anonymous to advertising partners to achieve advertising optimization and enhance the effective reach of advertising."}
{"task": "rw_65.jsonl", "id": 59595, "text": "Fourth, your rights", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59596, "text": "You can check and manage your information through the following ways, and we will respond to your request in the case of compliance with laws and regulations:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59597, "text": "(1) Review, correct and supplement", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59598, "text": "Except for the exception stipulated in laws and regulations, no matter when you use our services, we will strive to allow you to visit your personal information smoothly.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59599, "text": "You can exercise your inquiries, correction and supplementary rights in the following ways:", "label": ["Important", "Edit/Control"], "rewrite": "You can exercise your inquiries, correction and supplementary rights in the following ways:"}
{"task": "rw_65.jsonl", "id": 59600, "text": "1. Account information: log in to Gaode Map, click \"My\"-\"Avatar\", you can query, modify or supplement your personal information;", "label": ["Important", "Edit/Control"], "rewrite": "Account information: Log in to Gaode Map, click \"My\"-\"Avatar\", you can query, modify or supplement your personal information;"}
{"task": "rw_65.jsonl", "id": 59601, "text": "Click \"My\"-\"Settings\"-\"Account and Security\" setting and changing your password.", "label": ["Important", "Edit/Control"], "rewrite": "Click \"My\"-\"Settings\"-\"Account and Security\" setting and changing your password."}
{"task": "rw_65.jsonl", "id": 59602, "text": "2. Use information: You can check or clear your search records, navigation records and historical trajectories in Gaode products and services.", "label": ["Edit/Control", "Important"], "rewrite": "Use information: You can check or clear your search records, navigation records and historical trajectories."}
{"task": "rw_65.jsonl", "id": 59603, "text": "For example, click \"Light City\" in Gaode Map APP- \"My\", \"After walking through a certain city (after the Gaode Map 1073)\", \"travel mileage\", \"check-in point\" module, you can see youRelated information.", "label": ["Important", "Edit/Control"], "rewrite": "Click \"Light City\", \"Make Light City\", \"After walking through a certain city (Gaode Map 1073)\", \"Travel Mileage\", \"Pickup Point\" module in the Gaode Map APP- \"Tour\" modules, you can see your related relatedinformation."}
{"task": "rw_65.jsonl", "id": 59604, "text": "3. Order information: You can check or clear your order records, transaction records and invoice records in Gaode products and services.", "label": ["Important", "Edit/Control"], "rewrite": "Order information: You can check or clear your order records, transaction records and invoice records."}
{"task": "rw_65.jsonl", "id": 59605, "text": "For example, open the Gaode Map APP- \"My\"-\"My Order\", you can check your various service orders. Since the order is passed back to the third-party service provider, it cannot be changed in Gaodene.", "label": ["Important", "Edit/Control"], "rewrite": "Open the Gaode Map App- \"My\"-\"My Order\", you can check your various service orders. Since the order is passed back to the third-party service provider, it cannot be changed in Gaodene."}
{"task": "rw_65.jsonl", "id": 59606, "text": "If you log in to the user for the Gaode Map Machine version, you can exercise your inquiries, correction and supplementary rights on the mobile version of the Gaode Map APP as shown above.", "label": ["Important", "Edit/Control"], "rewrite": "If you log in to the Gaode Map Machine version, you can exercise your inquiries, correction and supplementary rights on the mobile version of the Gaode Map app."}
{"task": "rw_65.jsonl", "id": 59607, "text": "You can contact customer service for your inability to exercise your inquiries, correction and supplementary rights directly through the above way.", "label": ["Important", "Edit/Control"], "rewrite": "If you exercise your inquiries, correction and supplementary rights, you can contact customer service."}
{"task": "rw_65.jsonl", "id": 59608, "text": "(2) Delete", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59609, "text": "1. You can exercise your deletion rights in the following ways, or apply for cancellation account to delete all your information:", "label": ["Important", "Edit/Control"], "rewrite": "You can exercise your deletion rights in the following way, or apply for a cancellation account to delete all your information:"}
{"task": "rw_65.jsonl", "id": 59610, "text": "(1) Delete historical data records through \"My\"-Settings \"-\" Footprint Settings \"or\" Footprint Settings \";", "label": ["Important", "Edit/Control"], "rewrite": "Delete historical data records through \"My\"-Settings \"-\" Footprint Settings \"or\" Footprint \"-footprint settings\";"}
{"task": "rw_65.jsonl", "id": 59611, "text": "(2) Delete the common location through the \"Going Location\" card- \"Settings\";", "label": ["Important", "Edit/Control"], "rewrite": "Delete the common place through the \"Frequent Location\" card- \"Settings\";"}
{"task": "rw_65.jsonl", "id": 59612, "text": "(3) Delete search history through the \"search box\"-\"clear historical record\";", "label": ["Important", "Edit/Control"], "rewrite": "Delete search history through \"Search Box\"-\"Clear History Record\";"}
{"task": "rw_65.jsonl", "id": 59613, "text": "(4) Delete the order information through \"My\"-\"My Order\";", "label": ["Important", "Edit/Control"], "rewrite": "Delete the order information through \"My\"-\"My Order\";"}
{"task": "rw_65.jsonl", "id": 59614, "text": "(5) Delete the entry-entered vehicle information through \"car owner service\"-\"editing vehicle\";", "label": ["Important", "Edit/Control"], "rewrite": "Delete the entry-entered vehicle information through \"car owner service\"-\"editing vehicle\";"}
{"task": "rw_65.jsonl", "id": 59615, "text": "(6) Delete locations, routes, and maps through \"DIY Map\"-\"Settings\";", "label": ["Important", "Edit/Control"], "rewrite": "Delete locations, routes, and maps through \"DIY Map\"-\"Settings\";"}
{"task": "rw_65.jsonl", "id": 59616, "text": "(7) Delete the content of the group through the \"group\"/\"family map\"-\"setting\"-\"dissolution/exit group\"/\"close the family map\";", "label": ["Important", "Edit/Control"], "rewrite": "Delete the content of the group through \"group\"/\"family map\"-\"setting\"-\"dissolution/exit group\"/\"close home map\";"}
{"task": "rw_65.jsonl", "id": 59617, "text": "(8) Delete the created tasks through \"Working Map\"-\"Task\", and delete the team content through \"Work Map\"-\"Settings\"-Disbanding Team \"/\" Exit Team \";", "label": ["Important", "Edit/Control"], "rewrite": "Delete the content of the team through \"Working Map\"-\"Task\" to delete the content of the team through \"Work Maps\"-\"Settings\"-Dripping Team \"/\" Exit Team \";"}
{"task": "rw_65.jsonl", "id": 59618, "text": "(9) Delete the location, route, video, and map of the collection through the \"collection clip\";", "label": ["Important", "Edit/Control"], "rewrite": "Delete favorite places, routes, videos, maps through \"Favorites\";"}
{"task": "rw_65.jsonl", "id": 59619, "text": "(10) Delete the recorded good voice through \"Navigation Voice\" - \"I have chosen\";", "label": ["Important", "Edit/Control"], "rewrite": "Delete the good sound of recording through \"Navigation Voice\"-\"I chose\";"}
{"task": "rw_65.jsonl", "id": 59620, "text": "(11) Delete reviews and Q & A through \"Comment\" and \"My Q & A\".", "label": ["Important", "Edit/Control"], "rewrite": "Delete the comments and Q & A content through \"comment\" and \"My Q&A\"."}
{"task": "rw_65.jsonl", "id": 59621, "text": "If different devices (such as the vehicle system) have differences on the deleting path, you cannot delete your personal information through the path of the above prompts. You can contact the customer service to make a request to delete personal information to us.", "label": ["Important", "Edit/Control"], "rewrite": "If you can't delete your personal information, you can contact customer service."}
{"task": "rw_65.jsonl", "id": 59622, "text": "2. In the following circumstances, you can contact the customer service to make a request to delete personal information:", "label": ["Edit/Control", "Important"], "rewrite": "In the following circumstances, you can make a request to delete personal information: (1) our behavior of handling personal information violates laws and regulations; (2) We collect and use your personal information, but we have not obtained your consent;3) The behavior of our personal information violates your agreement; (4) Our processing purpose has been achieved, unable to achieve or to achieve the purpose of processing;Full."}
{"task": "rw_65.jsonl", "id": 59623, "text": "(1) Our behavior of handling personal information violates laws and regulations;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59624, "text": "(2) We collect and use your personal information, but we have not obtained your clear consent;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59625, "text": "(3) The behavior of our personal information seriously violates your agreement;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59626, "text": "(4) Our treatment purpose has been achieved, cannot be achieved or is not necessary for the purpose of processing;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59627, "text": "(5) We stop providing products or services, or the storage period has expired;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59628, "text": "If we decide to respond to your deletion request, we will also notify the subject of your personal information from our personal information as much as possible at the same time, and ask them to delete it in time (unless laws and regulations have other regulations, or these subjects have independently obtained your authorization)Essence", "label": ["Important", "Edit/Control"], "rewrite": "If we decide to respond to your deletion request, we will also require the subject of personal information to delete in time from us. Unless the laws and regulations have other provisions, or these subjects have independently obtained your authorization."}
{"task": "rw_65.jsonl", "id": 59629, "text": "When you or we assisted you to delete the relevant information, because of the applicable legal and security technical restrictions, we may not be able to immediately delete the corresponding information from the backup system.Treatment until the backup can be removed or achieved anonymous.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "If we cannot delete the information in the backup system, store safely and restrict it until the backup can be removed or achieved anonymous."}
{"task": "rw_65.jsonl", "id": 59630, "text": "(3) Change the scope of authorization", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59631, "text": "You can change or withdraw the scope of your personal information in the following ways or withdrawn or process your personal information:", "label": ["Important", "Edit/Control"], "rewrite": "You can change or withdraw the scope of your personal information in the following ways or withdrawn or process your personal information:"}
{"task": "rw_65.jsonl", "id": 59632, "text": "1. Manage authorized authorization in \"My-Settings-Account and Security\", lifting third-party account binding, and managing applications that have been authorized to log in.", "label": ["Important", "Edit/Control"], "rewrite": "1. Manage authorized authorization in \"My-Settings-Account and Security\", lifting third-party account binding, and managing applications that have been authorized to log in."}
{"task": "rw_65.jsonl", "id": 59633, "text": "2. Manage the system permissions authorized by managing APP in \"Mine-Settings-About Gaode Map-Privacy Settings-System permissions Settings\".", "label": ["Important", "Edit/Control"], "rewrite": "2. Manage the system permissions authorized by managing APP in \"Mine-Settings-About Gaode Map-Privacy Settings-System permissions Settings\"."}
{"task": "rw_65.jsonl", "id": 59634, "text": "3. Manage the system permissions of the system permissions through the device system permissions management page you use.", "label": ["Edit/Control", "Important"], "rewrite": "3. Manage the system permissions of the system permissions through the device system permissions management page you use."}
{"task": "rw_65.jsonl", "id": 59635, "text": "4. Revide authority by modifying personal data, deleting personal information, and closing functions.", "label": ["Edit/Control", "Important"], "rewrite": "4. Revide authority by modifying personal data, deleting personal information, and closing functions."}
{"task": "rw_65.jsonl", "id": 59636, "text": "For you cannot change the authorization directly through the above way, you can contact the customer service to modify it, but please note that for some types of personal information, if you implement the information necessary for the basic functions of Gaode, or the information required by our law and regulations, we must fulfill the information stipulated by the law and regulationsWe may not be able to respond to your request to change the scope of authorization.", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "You can contact the customer service to modify the authorization, but you may not be able to modify the authorization of the information necessary for the implementation of the basic functions or the authorization of the information necessary for the law and regulations of the law and regulations."}
{"task": "rw_65.jsonl", "id": 59637, "text": "When you withdraw authorization, we will no longer process the corresponding personal information.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59638, "text": "But your decision to withdraw authorization will not affect our personal information processing based on your previous authorization.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Withdrawal authorization will not affect the collection and use of information based on authorization."}
{"task": "rw_65.jsonl", "id": 59639, "text": "(4) Logging out the account", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59640, "text": "You can apply for a cancellation of your account in the following ways:", "label": ["Edit/Control", "Important"], "rewrite": "You can apply for a cancellation of your account in the following ways:"}
{"task": "rw_65.jsonl", "id": 59641, "text": "1. Submit an account cancellation application in \"My-Settings-Account and Security-Account Logging\" (Gaode Map Machine Edition can pass \"My-Settings-Other-Account Logging\");", "label": ["Important", "Edit/Control"], "rewrite": "1. Submit an account cancellation application in \"My-Settings-Account and Security-Account Logging\" (Gaode Map Machine Edition can pass \"My-Settings-Other-Account Logging\");"}
{"task": "rw_65.jsonl", "id": 59642, "text": "2. Contact customer service and apply for cancellation of your account.", "label": ["Important", "Edit/Control"], "rewrite": "2. Contact customer service and apply for cancellation of your account."}
{"task": "rw_65.jsonl", "id": 59643, "text": "In order to protect the legitimate rights and interests of you or others, we need to verify your identity before cancel your account, and combine your use of Gaode products to determine whether to support your cancellation application.", "label": ["Important", "First Party Collection Information", "Edit/Control"], "rewrite": "Before canceling your account for you, we need to verify your identity and judge your usage."}
{"task": "rw_65.jsonl", "id": 59644, "text": "For example, if your account has an order generated through the Gaode information service jump, or the order that has not yet been paid in your calling function, or if you do not unbind or close the third -party service with the third -party account, we will not be a third -party service.Will immediately support your request.", "label": ["Important", "Edit/Control"], "rewrite": "If your account has an order generated by the Gaode information service jump, an order that has not been paid, or the third -party service with a third -party account may not support your cancellation requested."}
{"task": "rw_65.jsonl", "id": 59645, "text": "After you take the initiative to cancel your account, we will stop providing you with products or services and delete or process your personal information according to the requirements of applicable laws.", "label": ["Important", "Edit/Control"], "rewrite": "After canceling the account, it will stop providing you with products or services and delete or anonymous operations on your information."}
{"task": "rw_65.jsonl", "id": 59646, "text": "When you are authorized to log in to Gaode products through a third -party account, you must apply to a third party for canceling the account.", "label": ["Important", "Edit/Control"], "rewrite": "When you are authorized to log in to Gaode products through a third -party account, you must apply to a third party for canceling the account."}
{"task": "rw_65.jsonl", "id": 59647, "text": "(5) Get personal information copy", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59648, "text": "If you want to get a copy of your personal basic information and itinerary information, you can get in touch with us through customer service, and we will reply to your acquisition request within 15 days.", "label": ["Important", "Edit/Control"], "rewrite": "If you want to get a copy of your personal basic information and itinerary, you can contact us, and we will reply to your acquisition request within 15 days."}
{"task": "rw_65.jsonl", "id": 59649, "text": "(6) In response to your above request", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59650, "text": "For your or your guardians, close relatives, and other authority to make the above requests to us, and your relevant personal information rights stipulated in the laws of the People's Republic of China and other applicable laws, you can contact us through customer service or directly to us to usThe person in charge of personal information protection initiated a complaint.", "label": ["Important", "Edit/Control"], "rewrite": "You can contact us or directly to our personal information protection person through customer service to exercise personal information rights."}
{"task": "rw_65.jsonl", "id": 59651, "text": "In order to ensure your account security and your personal information security, when you make a request to us, we may verify your identity first (such as adding account verification, requesting you to provide written requests or other reasonable ways), and we will acceptGo to your feedback and verify your identity within 15 days of processing your request.", "label": ["Edit/Control", "Important"], "rewrite": "We handle your personal information rights request within 15 days after receiving your feedback and verifying your identity."}
{"task": "rw_65.jsonl", "id": 59652, "text": "For your reasonable request, we do not charge fees in principle, but we will charge a certain fee as appropriate for requests that repeat and beyond the reasonable limit.", "label": ["Important", "Edit/Control"], "rewrite": "Reasonable requests are not charged in principle without charging and exceeding the reasonable limit."}
{"task": "rw_65.jsonl", "id": 59653, "text": "For information that is not directly associated with your identity, the information that is repeatedly applied without reasonable reasons, or you need too many technical means (if you need to develop a new system or change the current convention fundamentally), bring risks to others' legitimate rights or notIn actual requests, we may refuse.", "label": ["Important", "Edit/Control"], "rewrite": "We may refuse to repeat for unseen, need too much technical means, bring risks or very unrealistic requests to others' legitimate rights and interests."}
{"task": "rw_65.jsonl", "id": 59654, "text": "(7) exception", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59655, "text": "In accordance with the requirements of laws and regulations, in the following situations, we will not be able to respond to your request to correct, delete, and cancel information:", "label": ["Important", "Edit/Control"], "rewrite": "In accordance with the requirements of laws and regulations, in the following situations, we will not be able to respond to your request to correct, delete, and cancel information:"}
{"task": "rw_65.jsonl", "id": 59656, "text": "1. It is related to national security and national defense security;", "label": ["Edit/Control", "Important"], "rewrite": "If your request is directly related to national security and national defense security, you may not be responded."}
{"task": "rw_65.jsonl", "id": 59657, "text": "2. Related to public safety, public health, and major public interests;", "label": ["Important", "Edit/Control"], "rewrite": "Your request is directly related to public safety, public health, and major public interests and may not be responded."}
{"task": "rw_65.jsonl", "id": 59658, "text": "3. It is related to criminal investigation, prosecution, and trial;", "label": ["Important", "Edit/Control"], "rewrite": "Your request is related to criminal investigation, prosecution, and trial, and may not be responded."}
{"task": "rw_65.jsonl", "id": 59659, "text": "4. There is sufficient evidence that you have subjective malice or abuse of rights;", "label": ["Important", "Edit/Control"], "rewrite": "If there is sufficient evidence that you have subjective malicious or abuse of rights, you may not be able to respond to your request."}
{"task": "rw_65.jsonl", "id": 59660, "text": "5. Involved in business secrets;", "label": ["Important", "Edit/Control"], "rewrite": "We may not be able to respond."}
{"task": "rw_65.jsonl", "id": 59661, "text": "6. Response your request will cause the legitimate rights and interests of you or other individuals and organizations to be seriously damaged;", "label": ["Important", "Edit/Control"], "rewrite": "We may not be able to respond to requests that exceed the storage range, exceed the reasonable limit, or the legitimate rights and interests of personal information subjects or other individuals and organizations will be seriously damaged."}
{"task": "rw_65.jsonl", "id": 59662, "text": "7. The preservation period stipulated in laws and administrative regulations has not yet expired, or it is difficult to achieve technically deleting personal information.", "label": ["Important", "Edit/Control"], "rewrite": "The preservation period stipulated in laws and administrative regulations is not expired, or it is difficult to achieve technically deleting personal information, and may not respond to your deletion request."}
{"task": "rw_65.jsonl", "id": 59663, "text": "5. Storage of information", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59664, "text": "(1) Storage period", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59665, "text": "Unless the laws and regulations have other provisions, Gaode will save your information as follows the following period:", "label": ["Data Retention", "Important"], "rewrite": "Unless the laws and regulations have other provisions, Gaode will save your information as follows the following period:"}
{"task": "rw_65.jsonl", "id": 59666, "text": "1. During your use of Gaode products or services, we will continue to save you unless you delete this information or cancel your account.", "label": ["Data Retention", "Important"], "rewrite": "We continue to save you during your use, unless you delete this information or cancel your account."}
{"task": "rw_65.jsonl", "id": 59667, "text": "2. When you delete your personal information or cancel your account, we will take timely measures to delete your personal information from the business function system, so that it will keep it from retrieval and access.", "label": ["Data Retention", "Important"], "rewrite": "After you delete your personal information or cancel your account, you will take measures to delete your personal information from the business function system to keep it in a state where it cannot be retrieved and visited."}
{"task": "rw_65.jsonl", "id": 59668, "text": "3. In order to safeguard your legitimate rights and interests, we have the right to continue to save your information in a separate system within 36 months from the date of your delete or canceling account.", "label": ["Data Retention", "Important"], "rewrite": "Continue to save your information in a separate system within 36 months from the date of deleting or canceling your account for evidence preservation."}
{"task": "rw_65.jsonl", "id": 59669, "text": "After the evidence preservation period expires, we will timely processes the personal information of these preserved personal information in a timely manner.", "label": ["Data Retention", "Important"], "rewrite": "After the evidence preservation period expires, the personal information will be anonymous."}
{"task": "rw_65.jsonl", "id": 59670, "text": "If you are willing to give up all the legal relief rights related to Gaode and delete information when you cancel your account or delete information, Gaode will be based on the legal period of your deletion of information in accordance with the network security law and other laws and regulations (for example, \"Network, the Internet, the InternetThe Security Law requires no less than six months for online logs, and the \"E -commerce Law\" requires that the product and service information and transaction information saving time will delete relevant data after the expiration of the transaction is not less than three years).", "label": ["Data Retention", "Important"], "rewrite": "If you are willing to abandon all legal relief rights related to Gaode and delete information when you cancel your account or delete information, Gaode will delete relevant data after the statutory period of your delete information after deleting the information."}
{"task": "rw_65.jsonl", "id": 59671, "text": "(2) Storage area", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59672, "text": "The personal information we collected and generated in the operation of the People's Republic of China will be stored in China.", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in domestic operations will be stored in China."}
{"task": "rw_65.jsonl", "id": 59673, "text": "In the following circumstances, we will provide your personal information to possible overseas entities after fulfilling the obligations stipulated in the law:", "label": ["Data Retention", "Important", "Risk"], "rewrite": "In the following circumstances, we will provide your personal information to possible overseas entities after fulfilling the obligations stipulated in the law: 1. The applicable laws have clearly stipulated; 2. Get your separate consent."}
{"task": "rw_65.jsonl", "id": 59674, "text": "1. Applicable laws have clear regulations;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59675, "text": "2. Get your individual consent.", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59676, "text": "In response to the above situations, we will protect your personal information security in accordance with this policy.", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59677, "text": "(3) Safety measures", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59678, "text": "1. Data protection technical measures", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59679, "text": "We will adopt industry standards, reasonable and feasible security protection measures to protect your personal information and prevent personal information from being disclosed, use, modify, damage or lose.", "label": ["Important", "Data Security"], "rewrite": "Safety protection measures are taken to prevent personal information from being interviewed, publicly disclosed, used, modified, damaged or lost."}
{"task": "rw_65.jsonl", "id": 59680, "text": "For example, we will use encrypted technology to improve the security of personal information. When you exchange data between your browser and the server, the SSL protocol is encrypted and protected, and we provide the HTTPS protocol security browsing method;", "label": ["Important", "Data Security"], "rewrite": "Use encryption technology to improve the security of personal information."}
{"task": "rw_65.jsonl", "id": 59681, "text": "We will use a trusted protection mechanism to prevent personal information from being maliciously attacked;", "label": ["Important", "Data Security"], "rewrite": "Using a trusted protection mechanism to prevent personal information from being maliciously attacked."}
{"task": "rw_65.jsonl", "id": 59682, "text": "We will deploy the access control mechanism to make every effort to ensure that only authorized personnel can access personal information.", "label": ["Important", "Data Security"], "rewrite": "The deployment of the access control mechanism ensures that only authorized personnel can access personal information."}
{"task": "rw_65.jsonl", "id": 59683, "text": "At present, our important information systems have passed the evaluation of network security level protection and ISO27001 and ISO27701 certification.", "label": ["Important", "Data Security"], "rewrite": "Important information systems have been certified by the evaluation and ISO27001 and ISO27701 of ISO27001 and ISO27701."}
{"task": "rw_65.jsonl", "id": 59684, "text": "2. Measures for data protection management organization", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59685, "text": "We have established a data security management system that is advanced in the industry with data as the core and the data security management system around the data life cycle, and improves the security of personal information from organizational construction, institutional design, personnel management and product technology.", "label": ["Important", "Data Security"], "rewrite": "The data security management system improves the security of personal information from organizational construction, system design, personnel management and product technology."}
{"task": "rw_65.jsonl", "id": 59686, "text": "Through training courses and examinations, we have continuously strengthened employees' awareness of protecting the importance of personal information.", "label": ["Important", "Data Security"], "rewrite": "Through training courses and examinations, strengthen the understanding of the importance of employees' personal information."}
{"task": "rw_65.jsonl", "id": 59687, "text": "(4) Response of personal information security incident", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59688, "text": "If our physical, technical, or management protection facilities are damaged, and the information is caused by unauthorized access, public disclosure, tampering or destruction, and damage to your legitimate rights and interests, we will launch an emergency plan in time and take reasonable and necessary measures.In order to reduce the impact on your personal.", "label": ["Important", "Data Security"], "rewrite": "We will start emergency plans to deal with information security incidents."}
{"task": "rw_65.jsonl", "id": 59689, "text": "If a personal information security incident occurs, we will also inform you the basic situation and possible impact of the security incident in accordance with the requirements of the laws and regulations.Remedy.", "label": ["Important", "Data Security"], "rewrite": "If a personal information security incident occurs, we will inform your basic situation, possible impact, disposal measures, independent prevention suggestions, etc."}
{"task": "rw_65.jsonl", "id": 59690, "text": "We will inform you in SMS, telephone, push notification, and other reasonable channels that it is difficult to inform one by one. We will publish an announcement in a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "It is difficult to inform personal information by mail, letter, telephone, and push notification one by one, and will publish an announcement in a reasonable and effective way"}
{"task": "rw_65.jsonl", "id": 59691, "text": "At the same time, we will also report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "The disposal of personal information security incidents will be reported in accordance with the requirements of the regulatory authorities."}
{"task": "rw_65.jsonl", "id": 59692, "text": "(5) Prevention of account security risk", "label": ["Data Security"], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59693, "text": "When using Gaode products and services, you inevitably disclose your personal information to the other party or the potential transaction of the transaction, such as the contact method or contact address.", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59694, "text": "In addition, you can also establish communication, exchange information or analysis content with our services.", "label": ["Important", "Data Security"], "rewrite": "You can establish communication, exchange information or analysis content with third parties through our services."}
{"task": "rw_65.jsonl", "id": 59695, "text": "Please protect your personal information properly, provides others only under the necessary circumstances, and do not trust the transaction through other trading tools to avoid the stolen information or even encounter telecommunications network fraud.", "label": ["Important", "Data Security"], "rewrite": "Protecting your personal information properly, it is provided to others only under the necessary situation."}
{"task": "rw_65.jsonl", "id": 59696, "text": "If you are worried about your personal information, especially your account or password, please contact our customer service immediately so that we can take corresponding measures based on your application.", "label": ["Important", "Data Security"], "rewrite": "If the personal information discovered, please contact our customer service immediately."}
{"task": "rw_65.jsonl", "id": 59697, "text": "You can also perform \"equipment management\" autonomously on the Gaode Map APP \"Mine-Settings-Account and Security\".", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "You can independently perform \"equipment management\" on the Gaode Map APP \"My-Settings-Account and Security\"."}
{"task": "rw_65.jsonl", "id": 59698, "text": "In order to protect your information security, if the user's personal information is wrong, Gaode will visit, correct or delete relevant information according to the user's requirements after strictly verifying and verifying the identity of the applicant (unless Gaode must retain these for legal reasons, you must retain these these.personal information).", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "After verifying and verifying the identity of the applicant, Gaode will access, correct or delete relevant information according to the user's requirements."}
{"task": "rw_65.jsonl", "id": 59699, "text": "(6) Special reminder", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59700, "text": "1. The Internet is not an absolutely secure environment. Email, information release, social software, and trading platforms cannot determine whether it is completely encrypted with other users. Please pay attention to protect your personal information when using it.", "label": ["Important", "Data Security"], "rewrite": "Please pay attention to protect your personal information when using it."}
{"task": "rw_65.jsonl", "id": 59701, "text": "2. Please understand that due to the rapid development of computer and Internet technology and limitation of synchronization speed, there may be various malicious or non -malicious attack methods.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59702, "text": "Although Gaode continues to be committed to improving and strengthening security measures to protect your information from accident or damage, it still cannot always guarantee that the information is 100 % security.", "label": ["Important", "Data Security"], "rewrite": "Although there are security measures, it is impossible to fully guarantee that there is no security problem."}
{"task": "rw_65.jsonl", "id": 59703, "text": "3. The system and communication network used when you use the product or service, or Gaode, or hardware equipment, can not be controlled. Please understand and pay attention to protecting your personal information security.", "label": ["Important", "Data Security"], "rewrite": "Systems and communication networks may have problems due to unprepared factors."}
{"task": "rw_65.jsonl", "id": 59704, "text": "4. Your personal information will form data that can be used and circulate after anonymous processing. Gaode does not need to be notified separately and obtains your consent on the preservation and processing of such data.", "label": ["Important"], "rewrite": "Gaode's preservation and processing of anonymous processing data does not need to be notified separately and obtain your consent."}
{"task": "rw_65.jsonl", "id": 59705, "text": "6. Applicable laws and dispute resolution", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59706, "text": "(1) Applicable law", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59707, "text": "The implementation, interpretation and disputes of this policy are applicable to the laws of the People's Republic of China, without considering any conflict law.", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59708, "text": "(2) Dispute resolution", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59709, "text": "If you and Gaode have any controversy on the content of this policy or its execution, the two parties should be friendly and negotiated;", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59710, "text": "If the two parties cannot negotiate the dispute, the two parties agreed to submit the dispute to the people's court of the defendant's residence.", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59711, "text": "Seven, policy updates", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59712, "text": "This policy will be revised from the adjustment or update of the business model, and these revisions constitute a part of the privacy policy.", "label": ["Policy Change", "Important"], "rewrite": "The revision of the adjustment or update of the business model will constitute part of the policy privacy policy."}
{"task": "rw_65.jsonl", "id": 59713, "text": "Without your clear consent, we will not reduce your rights enjoyed in accordance with the privacy policy.", "label": ["Policy Change", "Important"], "rewrite": "Without your clear consent, we will not reduce your rights enjoyed in accordance with the privacy policy."}
{"task": "rw_65.jsonl", "id": 59714, "text": "We will release changes to the privacy policy on the special page.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59715, "text": "If the changes will reduce your rights or increase your obligations (that is, \"major changes\"), we will also provide more notice Essence", "label": ["Policy Change", "Important"], "rewrite": "If the changing clause will reduce your rights or increase your obligations, it will provide you with more significant notifications."}
{"task": "rw_65.jsonl", "id": 59716, "text": "If you continue to use our products or services, it means you agree with the revised privacy policy.", "label": ["Policy Change", "Important", "Risk"], "rewrite": "If you continue to use products or services, it means you agree with the revised privacy policy."}
{"task": "rw_65.jsonl", "id": 59717, "text": "The major changes in this policy include, but not limited to:", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59718, "text": "1. The business model of the product has changed significantly.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59719, "text": "Such as the purpose of handling personal information, the type of personal information, and the use of personal information;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59720, "text": "2. The main body of the privacy policy caused by business adjustment and transaction mergers and acquisitions, and the new subject receiving party changes the original treatment purpose and method of treatment;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59721, "text": "3. The main object of personal information sharing or public disclosure changes;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59722, "text": "4. User personal information rights and their exercise methods have changed significantly;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59723, "text": "5. When our contact methods and complaint channels change;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59724, "text": "6. Personal information protection assessment report shows that the existence of products has a significant impact on personal rights.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59725, "text": "We will also archive the old version of this policy on the special page for you to check.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59726, "text": "8. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59727, "text": "(1) We attach great importance to the protection of personal information of minors", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59728, "text": "We presumed that you have the corresponding civil abilities.", "label": ["Important"], "rewrite": "We presumed that you have the corresponding civil abilities."}
{"task": "rw_65.jsonl", "id": 59729, "text": "If you are a minor, we ask you to ask your parents or other guardians to read this policy carefully, and use our services or provide information to us under the consent of your parents or other guardians.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a minor, please use services or provide information on the premise of obtaining the consent of the guardian."}
{"task": "rw_65.jsonl", "id": 59730, "text": "If you are the parents of the minor or other guardians, please pay attention to whether the minor uses our service after obtaining your authorization consent.", "label": ["Specific Audiences", "Important"], "rewrite": "The legal guardian is requested to use the service after obtaining your authorization consent."}
{"task": "rw_65.jsonl", "id": 59731, "text": "(2) Remedial measures", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59732, "text": "1. If you fail to obtain the consent of your guardian or you have not agreed that your guardian to use our services and provide information to us, please or the guardian to immediately stop using our services and contact us in time.", "label": ["Specific Audiences", "Important"], "rewrite": "If the service of the guardian is not obtained, please stop using and contact us immediately."}
{"task": "rw_65.jsonl", "id": 59733, "text": "2. Knowing that when receiving your written notice, when Gaode collected minors' personal information without obtaining the consent of the guardian in advance, Gaode will immediately stop the collection and use of relevant information.", "label": ["Specific Audiences", "First Party Collection Information", "Important"], "rewrite": "When Gaode knows that he has not obtained the consent of the guardian and collects minor personal information, he will immediately stop information collection and use."}
{"task": "rw_65.jsonl", "id": 59734, "text": "Nine, contact us", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59735, "text": "(1) Customer service channel", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59736, "text": "If you have any questions, opinions or suggestions on this privacy policy, or if you use Gaode products or services, you have any opinions or suggestions on the collection, use, sharing, inquiry, deletion, and correction of your personal information.Or what problems you encounter when using a product or service, you can contact us by calling GD.Service@autonavi.com by sending mail 4008100080 or sending emails.", "label": ["Important", "Contact Information"], "rewrite": "Gaode customer service: 4008100080; mailbox: gd.service@autonavi.com."}
{"task": "rw_65.jsonl", "id": 59737, "text": "(2) Special reminder", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59738, "text": "1. Gaode reminds you that if your feedback is involved in your personal information, especially your sensitive information, please do not disclose directly on the phone or email. We will be with your personal information security.You further communicate.", "label": ["Important", "Contact Information", "Data Security"], "rewrite": "Please do not disclose your personal information directly in your phone or email. We will communicate with you further without your personal information security."}
{"task": "rw_65.jsonl", "id": 59739, "text": "2. In some cases, in order to ensure the security of your personal information, we may need to provide a written request or prove your identity in other ways.", "label": ["Important", "Contact Information", "Data Security"], "rewrite": "In some cases, we may need to provide a written request or prove your identity in other ways."}
{"task": "rw_65.jsonl", "id": 59740, "text": "We will reply to your relevant request within 15 days after receiving your feedback and verifying your identity.", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59741, "text": "(3) Others", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59742, "text": "If you are not satisfied with our reply, you can also send your right notification and support information to the following address:", "label": ["Important", "Contact Information"], "rewrite": "If you are not satisfied with the reply, your right notice and support information are sent to the following address:"}
{"task": "rw_65.jsonl", "id": 59743, "text": "1. No. 10 Floor Alibaba Post Office, No. 10, Furong Street, Chaoyang District, Beijing, China, the person in charge of personal information protection, postcode 100102;", "label": ["Important", "Contact Information"], "rewrite": "Fourth -floor Alibaba Post Office, No. 10, No. 10, Furong Street, Chaoyang District, Beijing, the person in charge of personal information protection, postcode 100102."}
{"task": "rw_65.jsonl", "id": 59744, "text": "2. Personal information of personal information protection person_information_officer@autonavi.com.", "label": ["Important", "Contact Information"], "rewrite": "Personal information protection person mailbox personal_information_officer@autonavi.com."}
{"task": "rw_65.jsonl", "id": 59745, "text": "Appendix: Name Explanation", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59746, "text": "Gaode: Refers to Gaode Software Co., Ltd., a provider of Gaode products and services.", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59747, "text": "Related company: Refers to the affiliated company of Gaode Software Co., Ltd., the latest listed company annual report of Alibaba Group Holding Limited.", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59748, "text": "The aforementioned \"associated relationship\" refers to the subject (including individuals, companies, partnerships, organizations, or other entities), the subject that directly or indirectly controls, or the subject that directly controls itsMaster controlled by the same subject.", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59749, "text": "The aforementioned \"control\" refers to the power or other relationships that directly or indirectly have the power or other relationships that have instructed others by holding voting rights, contracts or other methods to directly or indirectly have other relationships that instructions or instructions that to make instructions.", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59750, "text": "Personal information: Various information related to the recognized or recognized natural persons recorded in electronics or other ways, excluding information after anonymous processing.", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59751, "text": "Sensitive personal information: Once sensitive personal information is leaked or illegally, it is easy to lead to personal information that is harmful to natural person's personality dignity or personality and property security.Track information, and personal information of minors under the age of 14.", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59752, "text": "Equipment information: Including device identifier (IMEI, IDFA, Android ID, Mac, OAID, IMSI, OpenUDID, hardware serial number and other device -related information), application information (application crash information, notification switch status, application installation list and other applicationsRelated information), device parameters and system information (device type, equipment model, operating system and hardware -related information), device network environment information (IP address, WIFI information, base station information and other network -related information).", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59753, "text": "The actual collection of the product shall prevail.", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59754, "text": "Service log information: Including browsing records, click to view records, search query records, collection, transactions, after -sales, follow -up information, publishing information, and IP address, browser type, telecommunications operator, use language, access date and time.", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59755, "text": "Decoration: Refers to the process of personal information processing, so that it cannot recognize specific natural persons without using additional information.", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59756, "text": "Anonymous: Refers to the process that personal information cannot identify specific natural persons and cannot recover.", "label": [], "rewrite": []}
{"task": "rw_65.jsonl", "id": 59757, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
