{"task": "rw_6.jsonl", "id": 38453, "text": "【UC Browser】 Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38454, "text": "Effective date: [2022] Year [9] month [9] Day", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38455, "text": "Update date: [2022] Year [9] month [2] Day", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38456, "text": "【introduction】", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38457, "text": "You are welcome to use our products and services!", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38458, "text": "We know the importance of personal information to you. Your trust is very important to us. We will strictly abide by laws and regulations to take corresponding security protection measures to protect your personal information security and controlling.", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38459, "text": "Based on this, [UC Browser] service provider (or \"we\") formulates this \"[UC Browser] Privacy Policy\" (hereinafter referred to as \"this policy\"/\"this privacy policy\") to help you fully understand you in youIn the process of using our products and services, how will we collect, use, share, store, and protect your personal information, as well as how you can manage your personal information so that you can make better choices.", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38460, "text": "Before you start using our products and services, please read and understand this policy carefully. In particular, we should focus on reading the clauses we logging in the threatening of the body/coarse body to ensure that you fully understand and agree to use it before starting to use.", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38461, "text": "The professional vocabulary involved in this policy, we try to explain to you in a concise and popular expression in order to facilitate your understanding.", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38462, "text": "If you have any questions, opinions or suggestions on the content of this policy, you can contact us through the contact information at the end of this policy.", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38463, "text": "You agree that the privacy policy said that you have understood the functions provided by the application, and the necessary personal information required for functional operation, and give corresponding collection and use authorization, but it does not mean that you have agreed to open up additional functions and handle non -necessary personal information.The opening, processing non -necessary personal information and processing sensitive personal information, we will solicit your consent separately according to your actual usage.", "label": ["Policy Change", "Important"], "rewrite": "You agree that the privacy policy states that you can collect and use it accordingly, but it does not mean that you have agreed to open up additional functions and handle non -necessary personal information."}
{"task": "rw_6.jsonl", "id": 38464, "text": "This privacy policy will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38465, "text": "1. Scope of application", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38466, "text": "2. Information collection and use", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38467, "text": "3. Provide information to the outside world", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38468, "text": "Fourth, your rights", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38469, "text": "5. Storage of information", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38470, "text": "6. Policy update", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38471, "text": "7. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38472, "text": "Eight, contact us", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38473, "text": "Appendix: Related Definition", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38474, "text": "1. Scope of application", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38475, "text": "This policy is applicable to the various products and services provided by the [UC Browser] service providers with new forms that appeared with the development of technology.", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38476, "text": "We and affiliated companies have a privacy policy on the products or services that it provide to you, such as: \"Book Banner Privacy Policy\" and \"Songta Shop Privacy Policy\", and the corresponding products or services are applicable to the corresponding privacy policy.", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38477, "text": "In addition to the relevant information collection and use activities described in this policy, this policy is not applicable to other services you provided by [UC Browser Cooperator] and other third directions. Other services apply to the personal information collection and use rules that it explained to you.", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38478, "text": "2. Information collection and use", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38479, "text": "When you use our products/services, the personal information we need/may need to collect and use includes the following:", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38480, "text": "1. In order to realize the basic functions of providing you with our products and/or services, you must authorize us to collect and use the necessary information.", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38481, "text": "If you refuse to provide the corresponding information, you will not be able to use our products and/or services normally;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38482, "text": "2. In order to provide you with additional functions to our products and/or services, you can choose to agree or disagree with the information we collected and used alone.", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38483, "text": "If you refuse to provide it, you will not be able to use related additional functions normally or cannot achieve the functional effects we intend to achieve, which will not affect your basic functions.", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38484, "text": "We are here to remind you that we are committed to creating a variety of products and services to meet your needs.", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38485, "text": "Because there are many types and services we provide to you, and there are differences in the scope of the specific product/service selected by different users, the basic/additional functions and the personal information types and scope of personal information and use will be different. Please use specific ones.Product/service function shall prevail.", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38486, "text": "The specific feature scenarios we will provide you include::", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38487, "text": "(1) Help you become our member and account management", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38488, "text": "1. Basic member service", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38489, "text": "We provide you based on the UC browser account.", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38490, "text": "To create a UC browser account, you need to provide us with at least your mobile phone number and password (verification code).", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to create a UC browser account, you need to provide us with your mobile phone number and password."}
{"task": "rw_6.jsonl", "id": 38491, "text": "If you refuse to provide the above information, you will not be able to register the UC browser account, you can only use browsing and search services.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38492, "text": "2. Third party authorization Login", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38493, "text": "In order to facilitate your login of the UC account, you can also log in to UC through third -party accounts (including Taobao, Alipay, Weibo, WeChat, QQ, Xiaomi, Apple).", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38494, "text": "In order to achieve the previous description, you understand and agree that we will obtain and collect your third -party account information from a third party, such as the information that you agree to the granted by your nickname and avatar on the authorization interface.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "When registering and logging in with a third -party account, visit and collect your personal information after your authorization."}
{"task": "rw_6.jsonl", "id": 38495, "text": "3. Account certification service", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38496, "text": "When you use the functions or services that you can provide to provide, such as network disks, mini -games or live broadcast services, free stream card verification, and event reward tax deduction services provided by third parties, according to relevant lawsRegulations, you may need to provide names, ID numbers, and phone numbers to prove your true identity.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the function or service that you need to authenticate to provide, you may need to provide the name, ID number, and phone number to prove your true identity."}
{"task": "rw_6.jsonl", "id": 38497, "text": "You can refuse to provide it, but you may not be able to obtain related services, but do not affect the normal use of other functions and services.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38498, "text": "4. Additional member service", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38499, "text": "You can choose to further improve the account information of this product, which can provide us with your avatars, nicknames, gender, and birthday to obtain more personalized additional services.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can choose to provide your avatar, nickname, gender, birthday to obtain more personalized additional services."}
{"task": "rw_6.jsonl", "id": 38500, "text": "If you provide a real and effective mobile phone number, Taobao account, and Alipay account for binding, when you encounter accounts such as registered accounts, forgetting passwords and other accounts, you can more conveniently find your account and password.", "label": ["Important", "Usage"], "rewrite": "If you provide machine numbers, Taobao accounts, Alipay accounts for binding, when you encounter accounts such as registered accounts, forgetting passwords and other accounts, you can more conveniently find your account and password."}
{"task": "rw_6.jsonl", "id": 38501, "text": "By binding Taobao accounts and Alipay accounts, you can participate in services such as Alipay/Taobao's marketing activities organized in UC, completing coupon collection, and enjoyment of convenient cash.", "label": ["Important", "Usage"], "rewrite": "By binding Taobao account and Alipay account, you can participate in the marketing activities organized by Alipay/Taobao in UC."}
{"task": "rw_6.jsonl", "id": 38502, "text": "You can also choose not to bind, but you will not be able to obtain related services, but do not affect the normal use of other functions and services.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38503, "text": "You can manage the binding relationship through \"My-Account Management-Binding Account\".", "label": ["Important", "Edit/Control"], "rewrite": "You can manage the binding relationship through \"My-Account Management-Binding Account\"."}
{"task": "rw_6.jsonl", "id": 38504, "text": "(2) Provide you with browsing and search services", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38505, "text": "1. Web browsing", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38506, "text": "In the process of using our service, to identify the abnormal status of the account, understand the product adaptability, and provide you with the page display and search results that meet your needs.You need to obtain your storage read and write permissions, and may automatically collect your usage, including equipment information, service log information.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "In order to identify the abnormal state of the account and understand the product adaptability, at the same time, based on the basic operational needs of web file cache, download, log storage, we need to obtain your storage read and write permissions and may collect your usage."}
{"task": "rw_6.jsonl", "id": 38507, "text": "Please note that separate equipment information and service log information are information that cannot recognize specific natural person status.", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38508, "text": "If we use this type of non -personal information with other information to identify a specific natural person or use it with personal information, during the combination of use, such non -personal information will be regarded as personal information, except for obtaining your authorization.Or in addition to laws and regulations, we will anonymous and de -identify such information.", "label": ["Important", "Data Security"], "rewrite": "If we use non -personal information with other information to identify a specific natural person, or use it with personal information, we will anonymous such information and identify it."}
{"task": "rw_6.jsonl", "id": 38509, "text": "Used to display, push information and possible commercial advertisements.", "label": ["Important", "Usage"], "rewrite": "We will use indirect portrait portraits based on your equipment information and service log information to display, push information and possible commercial advertising."}
{"task": "rw_6.jsonl", "id": 38510, "text": "At the same time, we strive to ensure your privacy experience through the following measures:", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38511, "text": "(1) If you want to manage the personalized advertisements we send to you, you can enter the related page in \"My\"-\"Settings\"-\"Privacy Settings\"-\"Personalized Advertising Recommendation Management\";", "label": ["Important", "Edit/Control"], "rewrite": "You can enter relevant pages to manage personalized advertising in \"My\"-\"Settings\"-\"Privacy Settings\"-\"Personalized Advertising Recommendation Management\"."}
{"task": "rw_6.jsonl", "id": 38512, "text": "(2) If you want to manage the personalized content we push you, you can enter the related page in \"My\"-\"Settings\"-\"Privacy Settings\"-\"Personalized Recommendation\";", "label": ["Important", "Edit/Control"], "rewrite": "You can enter the relevant page to manage personalized content in \"My\"-\"Settings\"-\"Privacy Settings\"-\"Personalized Recommendation\"."}
{"task": "rw_6.jsonl", "id": 38513, "text": "(3) If you do not want to accept the SMS push information we send to you, you can reply to the withdrawal or other ways we provided by the SMS prompt.", "label": ["Important", "Edit/Control"], "rewrite": "You can reply to the withdrawal or other methods provided by the SMS prompt or close the SMS push."}
{"task": "rw_6.jsonl", "id": 38514, "text": "In the non -marking browse mode, we will still collect the above related data.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38515, "text": "When you use no trace browsing mode, your search history, web browsing history, cookie, and local storage cache will be cleared after you exit the no trace browse mode or restart the browser.", "label": ["Important", "Data Security"], "rewrite": "When you use the non -traceless browsing mode, your search history, web browsing history, cookie and local storage cache will be cleared after you withdraw."}
{"task": "rw_6.jsonl", "id": 38516, "text": "In addition, we will use your above information to continuously improve and optimize the above functions.", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38517, "text": "2. Information browsing", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38518, "text": "UC may recommend more interesting information to you. To achieve this function, we may use the relevant information of your device.", "label": ["Important", "Usage"], "rewrite": "We may use the relevant information of your device to recommend more interested information to you."}
{"task": "rw_6.jsonl", "id": 38519, "text": "Among them, the location permissions involve personal sensitive information. If you refuse to provide it, we will not recommend information to you according to your location information, and will not affect the normal use of services that do not need location permissions.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38520, "text": "We will show you and recommend local related information to your area based on cities corresponding to the IP address.", "label": ["Important", "Usage"], "rewrite": "We will show you and recommend local related information to your area based on cities corresponding to the IP address."}
{"task": "rw_6.jsonl", "id": 38521, "text": "The above -mentioned information we collected and used are all identified. The data analysis only corresponds to a specific coding that cannot directly associate your identity and will not be associated with your true identity.", "label": ["Important", "Data Security"], "rewrite": "The collection and use of the location information are degraded. The data analysis only corresponds to a specific code that cannot directly associate your identity."}
{"task": "rw_6.jsonl", "id": 38522, "text": "3. Search", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38523, "text": "When you use UC search services, we will collect your search keywords.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use UC search services, we will collect your search keywords."}
{"task": "rw_6.jsonl", "id": 38524, "text": "In order to provide efficient search services, some search keywords and service log information will be temporarily stored in your local storage device, and you can show you the content of search results and search history.", "label": ["Data Retention", "Important"], "rewrite": "Some search keywords and service log information will temporarily store in your local storage device, and you can show you the content of the search results and search history."}
{"task": "rw_6.jsonl", "id": 38525, "text": "When you use scanning two -dimensional code search and voice search function, we need to obtain the system's camera/album reading permissions and microphone recording permissions to support the provision of the aforementioned function.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use scanning two -dimensional code search and voice search function, we need to obtain the system's camera/album read permissions and microphone recording permissions."}
{"task": "rw_6.jsonl", "id": 38526, "text": "We can only collect the information only when you use click the two -dimensional code scan/voice search entrance, or to evoke the corresponding search function in other future UC. If you refuse us to collect the above information, please close it, please close itThe device's camera/album read permissions, microphone recording permissions or do not evoke the corresponding function, but this will also cause you to not get related services.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will obtain the camera/album read permissions and microphone recording permissions only when you evoke the corresponding search function."}
{"task": "rw_6.jsonl", "id": 38527, "text": "(3) Provide you with information release and interactive services", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38528, "text": "1. Content upload, release and use", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38529, "text": "(1) When you use the functions of content publishing, comments, questions, answers, collection, etc., we will show your nickname, avatar, publishing content (graphic, video and audio).", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When you use content publishing, comments, questions, answers, collection and other functions, we will show your nickname, avatar, and publishing content."}
{"task": "rw_6.jsonl", "id": 38530, "text": "When you use uploading pictures and publishing audio and video functions, we will ask you to authorize the camera/album read, write/store reading and write/microphone permission.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use uploading pictures and publishing audio and video functions, we will ask you to authorize the camera/album read, write/store reading and write/microphone permission."}
{"task": "rw_6.jsonl", "id": 38531, "text": "If you refuse to authorize, you will not be able to use related functions, but it does not affect other functions of your use of UC normally.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38532, "text": "(2) When you need to interact based on the service provided by a third party on the UC, we will ask you to authorize the location permissions and collect the location information related to the service.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "When you need to do your place based on your interaction, we ask you to authorize position permissions and collect location information related to services."}
{"task": "rw_6.jsonl", "id": 38533, "text": "If you refuse to provide accurate geographical information, you will not be able to use this function, but it does not affect other functions of your normal use of UC.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38534, "text": "(3) UC network disks provide you with services such as content storage, downloading, synchronization, management and sharing, and you need to request you to grant the function of reading and writing storage permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "UC network disk provides you with services such as content storage, downloading, synchronization, management and sharing, and you need to request you to grant the function of reading and writing storage permissions."}
{"task": "rw_6.jsonl", "id": 38535, "text": "At the same time, the UC network disk can help you backup the album, video, etc. You specify the files you need to backup to avoid loss.", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38536, "text": "The automatic backup function only needs to be realized in the case of mobile phone connection and login UC. This function requires you to choose whether to open it by yourself, and the network conditions and file types that you choose to set up automatic backup.", "label": ["Important", "Edit/Control"], "rewrite": "The automatic backup function needs to be achieved under the condition of mobile phone connection and login UC. You can choose whether to open it yourself."}
{"task": "rw_6.jsonl", "id": 38537, "text": "To help you find and manage the pictures you backup, we will use technology to intelligently classify some of your pictures.", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38538, "text": "You can manage or delete information that has been stored to the UC network disk through UC network disk.", "label": ["Important", "Edit/Control"], "rewrite": "You can manage or delete information that has been stored to the UC network disk through UC network disk."}
{"task": "rw_6.jsonl", "id": 38539, "text": "At the same time, you can also turn off the corresponding automatic backup function through \"UC Web Disk-upload-backup\".", "label": ["Important", "Edit/Control"], "rewrite": "You can turn off the corresponding automatic backup function through \"UC Web Disk-upload-backup\"."}
{"task": "rw_6.jsonl", "id": 38540, "text": "After closing, unless you back up, we will no longer read and synchronize corresponding information.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38541, "text": "(4) Please note that the information you upload may involve your or others' personal information and even personal sensitive information, if you choose to upload pictures containing personal information.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Please note that the information you upload may involve your or others' personal information and even personal sensitive information."}
{"task": "rw_6.jsonl", "id": 38542, "text": "Please consider whether to share or even publicly share relevant information when using our services.", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38543, "text": "If your public information involves personal information of children, you need to obtain the authorization of the child involved before the release.", "label": ["Specific Audiences", "Important"], "rewrite": "If your public information involves personal information of children, you need to obtain the authorization of the child involved before the release."}
{"task": "rw_6.jsonl", "id": 38544, "text": "In the aforementioned situation, children or guardians have the right to contact us through this policy, asking for more correct or deleting content involving children's personal information.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38545, "text": "2. Information communication and interaction", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38546, "text": "(1) Communication and interaction with other users: You take the initiative to pay attention to the accounts, channels, activities, topics, etc. that you are interested in and generate interaction (when you pay attention, browsing, comments, private messages, collections, likes, or sharing content), we willCollect the account you follow and show you the content of your account publishing.", "label": ["Important", "First Party Collection Information"], "rewrite": "You take the initiative to pay attention to the accounts, channels, activities, topics, etc. that you are interested in and have interaction. We will collect your attention accounts and show you the content of your account publishing."}
{"task": "rw_6.jsonl", "id": 38547, "text": "(2) Participate in operating activities: UC will launch operating activities for newly launched services and functions from time to time, and provide you with page display, notification, in -site letter, out -of -site push, valid contact information you provide to us, etc.information.", "label": ["Important", "Usage"], "rewrite": "From time to time, UC will launch operating activities for newly launched services and functions and provide you with operating activities."}
{"task": "rw_6.jsonl", "id": 38548, "text": "If you participate in related operating activities, we may collect your identity information and contact information through the operation activity interface, so that you can get in touch with you, verify your rewards to obtain qualifications, and issue operational rewards to you.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you participate in related operating activities, we may collect your identity information and contact information."}
{"task": "rw_6.jsonl", "id": 38549, "text": "If you do not participate in related operating activities, you do not need to provide the aforementioned information. If you participate in the operating activities but refuse to provide it, you will not be able to participate in the event or get relevant rewards.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38550, "text": "(4) Help you complete the payment service", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38551, "text": "In order to complete the order payment, you need to provide Alipay accounts, WeChat accounts or other payment methods for payment.", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to complete the order payment, you need to provide Alipay accounts, WeChat accounts or other payment methods for payment."}
{"task": "rw_6.jsonl", "id": 38552, "text": "If you choose Alipay for payment, we will use your UC account, the corresponding Alipay account member name, order payment related information, order security related equipment information, and other necessary information required by other anti -money laundering laws through Alipay embedded in the application through the application.Software tool development package (SDK) and other methods shared with Alipay.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you choose Alipay for payment, we will share your UC account, the corresponding Alipay account member name and share information with Alipay."}
{"task": "rw_6.jsonl", "id": 38553, "text": "If you choose WeChat for payment, we will put your UC account, the corresponding WeChat account member name, order payment related information, order security related equipment information, and other necessary information required by other anti -money laundering laws.Software tool development package (SDK) and other methods to share with WeChat.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you choose WeChat for payment, we will share your UC account, the corresponding WeChat account member name and other information with WeChat."}
{"task": "rw_6.jsonl", "id": 38554, "text": "If you choose to provide you with a payment service by other financial institutions (if any), we will also share your necessary information including bank card number and validity period, including the necessary information of bank card payment with the corresponding financial institutions you choose.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you choose to provide payment services with other financial institutions, we will also share your necessary information including bank card number and validity period, and share the necessary information of bank card payment with the corresponding financial institutions you choose."}
{"task": "rw_6.jsonl", "id": 38555, "text": "In order to allow us to learn and confirm your payment progress and status in a timely manner, and to provide you with service after -sales and dispute solutions, you agree that we can collect the transaction objects, Alipay or other financial institutions you choose.information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You agree that we can collect and pay the progress related information from the transaction objects you choose, Alipay or other financial institutions you choose."}
{"task": "rw_6.jsonl", "id": 38556, "text": "(5) Customer service and dispute handling", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38557, "text": "When you contact us or put forward the application for dispute dispute between the UC browser, in order to ensure your account and system security, we need you to provide the necessary personal information to verify your membership status.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you contact us or submit an application for dispute dispute handling, we need you to provide the necessary personal information to verify your membership status."}
{"task": "rw_6.jsonl", "id": 38558, "text": "In order to facilitate the processing plan and results of helping you solve the problem or record related issues as soon as possible, we may preserve your communication, communication/call records and related content (including account information, order information, to prove the relevant related to related related to the relevantThe facts provided by the facts or the contact information you left).", "label": ["Data Retention", "Important"], "rewrite": "To facilitate contact with you, help you solve the problem or record the processing plan and results, we may save your communication, communication/call records and related content."}
{"task": "rw_6.jsonl", "id": 38559, "text": "If you consult, complain or provide suggestions for specific orders, we will use your account information and order information.", "label": ["Important", "Usage"], "rewrite": "If you consult, complain or provide suggestions for specific orders, we will use your account information and order information."}
{"task": "rw_6.jsonl", "id": 38560, "text": "In order to provide reasonable needs of services and improve service quality, other information we may also use, including the relevant information you provided when you contact the customer service, the questionnaire answering information you sent to us during the questionnaire survey.", "label": ["Important", "Usage"], "rewrite": "In order to provide reasonable needs for services and improve service quality, we may use the relevant information provided by you when you contact the customer service/when you participate in the questionnaire survey."}
{"task": "rw_6.jsonl", "id": 38561, "text": "(6) You provide technical docking support", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38562, "text": "When you use small programs in UC, in order to achieve the purpose of providing technical support such as docking, we need to obtain the necessary personal information, equipment information, service logs to achieve the necessary personal information, equipment information, and service logs for the small program developers and technical service providers.information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use a small program in UC, we need to obtain you to achieve the necessary personal information, equipment information, and service log information for the previous purpose."}
{"task": "rw_6.jsonl", "id": 38563, "text": "When you use the mini -program service through UC, your information will apply the privacy policy of mini -program developers and Alipay. It is recommended that you read and confirm the relevant agreement before receiving the relevant services.", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38564, "text": "(7) Provide you with security", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38565, "text": "In order to fulfill the statutory obligations of laws and regulations such as the \"Network Security Law\", improve the security of your use of us and our affiliates and partners, and protect the safety of your or other users or the public.Fishing websites, fraud, network vulnerabilities, computer viruses, network attacks, network attack risks, and more accurately identify the situation of violating laws and regulations or [UC browser] related agreements and rules.Safety SDK collects your equipment information, service log information, and may use or integrate your membership information, trading information, equipment information, service log information, and our related companies and partners to obtain information that you authorize or sharing according to law (wherein,We may collect MAC addresses, IMEI, and other device identifiers during the application background operation) to comprehensively judge your account and transaction risk, authenticate, test and prevent security incidents, and take necessary records in accordance with the law, and take necessary records.Audit, analysis, and disposal measures.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "We collect your equipment information and service log information, and may use or integrate your information to comprehensively judge your account and transaction risk, conduct authentication, test and prevent security incidents, and take necessary records, audit, analysis, disposal, and disposal in accordance with the law.measure."}
{"task": "rw_6.jsonl", "id": 38566, "text": "(8) Other additional services provided you", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38567, "text": "1. Additional services based on system permissions", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38568, "text": "To provide you with more convenient, better, personalized products and/or services, and strive to improve your experience, we may collect and use your personal information by opening system permissions in the following additional services.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may collect and use your personal information by opening system permissions in the following additional services."}
{"task": "rw_6.jsonl", "id": 38569, "text": "If you do not agree to start the relevant permissions, it will not affect your basic services to use [UC browser], but you may not be able to obtain the user experience brought by these additional services to you.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38570, "text": "You can decide these permissions to open or close at any time.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38571, "text": "Please note that when you start the right of power, it means that you authorize us to collect and use relevant personal information to provide you with corresponding services. Once you turn off the right of power, it means that you cancel the authorization.With relevant personal information, you cannot continue to provide you with the service corresponding to the permissions.", "label": ["Important", "First Party Collection Information", "Edit/Control"], "rewrite": "The opening of one authority means that the authorization is authorized to collect and use the relevant information to provide corresponding services. Close the authority to cancel the authorization representative, and no longer continue to collect and use relevant information based on the corresponding permissions."}
{"task": "rw_6.jsonl", "id": 38572, "text": "The decision of your closure authority will not affect the collection and use of information based on your authorization.", "label": ["Permission Acquisition", "Edit/Control", "Risk", "Important"], "rewrite": "The decision of your closure authority will not affect the collection and use of information based on your authorization."}
{"task": "rw_6.jsonl", "id": 38573, "text": "You can click here to view the application authority application and usage description.", "label": ["Important", "Edit/Control"], "rewrite": "You can click here to view the application authority application and usage description."}
{"task": "rw_6.jsonl", "id": 38574, "text": "2. Cookie and services of similar technologies", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38575, "text": "Cookie and similar device information identification technology are commonly used in the Internet.", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38576, "text": "When you use our service, we may use related technologies to send one or more, cookie, or anonymous identifiers (hereinafter referred to as \"Cookie\") to collect, identify and store your access, use this product, use this productInformation about time.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may use cookies or anonymous identifiers to collect, identify and store information when you access and use this product."}
{"task": "rw_6.jsonl", "id": 38577, "text": "We promise that cookies will not be used for any other purposes other than the purpose of this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38578, "text": "We use Cookie to ensure the safety and efficient operation of products and services. It can make us confirm the security status of your account and transaction, check the related abnormal conditions of collapse and delay, and help you save the steps of filling in your form and entering search content.And process.", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38579, "text": "At the same time, we may use, cookie, show you the information or function you may be interested in, and optimize your choice of advertising.", "label": ["Important", "Usage"], "rewrite": "We may use Cookie to show you the information or functions you may be interested in and optimize your choice of advertising."}
{"task": "rw_6.jsonl", "id": 38580, "text": "Most browsers provide users with the function of removing the browser cache data. You can perform the corresponding data clearing operation, or you can modify the degree of acceptance of cookies or reject our cookies.", "label": ["Important", "Edit/Control"], "rewrite": "You can perform cache data clearing operations, or you can modify the degree of acceptance of Cookie or reject our cookies."}
{"task": "rw_6.jsonl", "id": 38581, "text": "You may not be able to use services or corresponding functions that depend on cookies because of these modifications.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38582, "text": "3. Provide information to the outside world", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38583, "text": "(1) Sharing", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38584, "text": "We will not share your personal information with companies, organizations, and individuals other than [UC Browser Service Provider], except the following situations: except:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not share your personal information with companies, organizations, and individuals other than [UC Browser Service Provider], except the following situations: except:"}
{"task": "rw_6.jsonl", "id": 38585, "text": "1. The sharing necessary for fulfilling the law office: we may share your personal information in accordance with the requirements of laws and regulations, lawsuits, and disputes in accordance with the requirements of administrative and judicial organs in accordance with the requirements of administrative, judicial organs, and other legal obligations.Essence", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share your personal information in accordance with the requirements of laws and regulations, litigation, and disputes, or in accordance with the requirements put forward by administrative and judicial organs in accordance with the law, as well as other legal obligations."}
{"task": "rw_6.jsonl", "id": 38586, "text": "2. Share sharing when you get your consent: After getting your clear consent, we will share your personal information with other parties.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After getting your clear consent, we will share your personal information with other parties."}
{"task": "rw_6.jsonl", "id": 38587, "text": "3. Share sharing in order to set up and fulfill your contract as a party as a party: You can browse or other services through the UC browser.Relevant necessary information sharing with providers of related products or services to realize your needs of transactions, distribution and after -sales service.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share your personal information in order to set up and fulfill your contract as a party's contract."}
{"task": "rw_6.jsonl", "id": 38588, "text": "4. Sharing with affiliated companies: In order to facilitate us to provide some services with you, I recommend information that you may be interested in, identify abnormal membership accounts, and protect the safety of UC related companies or other users or public personal property.In infringement, your personal information may be shared with our affiliated companies and/or its designated service providers.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Your personal information may be shared with our affiliated companies and/or its designated service providers."}
{"task": "rw_6.jsonl", "id": 38589, "text": "We will only share the necessary personal information and be restricted by the purpose declared in this policy. If we share your sensitive personal information or the purpose of changing personal information to change personal information, we will solicit your authorization consent again.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only share the necessary personal information and be restricted by the purpose declared in this policy. If we share your sensitive personal information or the purpose of changing personal information to change personal information, we will solicit your authorization consent again."}
{"task": "rw_6.jsonl", "id": 38590, "text": "Please note that when you use our service, you voluntarily share or even publicly share information, which may involve your or other people's personal information and even sensitive personal information.", "label": ["Important"], "rewrite": "Please note that the information you shared or even publicly shared may involve personal information of you or others and even sensitive personal information."}
{"task": "rw_6.jsonl", "id": 38591, "text": "Please consider and make a decision more cautiously.", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38592, "text": "(2) Entrusted processing", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38593, "text": "We may entrust a partner to handle your personal information in order to authorize partners to represent you to provide you with certain services or fulfilling functions.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may entrust a partner to handle your personal information in order to provide you with certain services or fulfilling functions."}
{"task": "rw_6.jsonl", "id": 38594, "text": "We will only entrust their information for the legal, correct, necessary, specific, and clear goals of this policy statement. We can authorize partners to only contact the information required by their duties, and we will ask for the agreement to request that it must not be requiredThis information is used for any other purpose beyond the scope of commission.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Authorized partners can only expose the information required for their duties, and must not use this information for any other purpose that exceeds the scope of entrustment."}
{"task": "rw_6.jsonl", "id": 38595, "text": "If the authorized partner will use your information for our unreasonable purpose, it will obtain your consent alone.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If the authorized partner will use your information for our unreasonable purpose, it will obtain your consent alone."}
{"task": "rw_6.jsonl", "id": 38596, "text": "At present, our authorized partners include the following types:", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38597, "text": "1. Authorized partners of advertising and analysis of service.", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38598, "text": "Under the premise of using industry -universal security technology, we will entrust these partners to handle information about advertising, coverage, and effectiveness related to advertising.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We commissioned advertising partners to handle information about advertising, coverage, and effectiveness related to advertising."}
{"task": "rw_6.jsonl", "id": 38599, "text": "We will not commission your personal identity information to commission partners.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will not commission your personal identity information to commission partners."}
{"task": "rw_6.jsonl", "id": 38600, "text": "2. Suppliers, service providers and other partners.", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38601, "text": "We entrust the information to the suppliers, service providers and other partners who support our business to handle it. These support for the technical infrastructure services that we are entrusted to provide, analyze the usage methods of our services, provide customer service, pay conveniently, or perform academic academic academicsResearch and investigation.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We entrust the information to the suppliers, service providers and other partners who support our business."}
{"task": "rw_6.jsonl", "id": 38602, "text": "In order to ensure the stable operation and functional implementation of our client, so that you can use and enjoy more services and functions. Our application will embed the SDK or other similar applications of authorized partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Our applications are embedded in SDK or other similar applications of authorized partners."}
{"task": "rw_6.jsonl", "id": 38603, "text": "We will strictly test the application interface (API) and software tool development package (SDK) of the authorized partners to obtain relevant information, and strict data protection measures with the authorized partners, so that it will be in accordance with this policy and any other any otherRelated confidentiality and security measures to handle personal information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will conduct strict security testing of authorized partners and strict data protection measures with them."}
{"task": "rw_6.jsonl", "id": 38604, "text": "You can click here to view the details we access.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You can click here to view the details we access."}
{"task": "rw_6.jsonl", "id": 38605, "text": "(3) Transfer", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38606, "text": "If we need to transfer personal information for the reasons for merging, separation, dissolution, and declaration of bankruptcy, we will inform you the name or name and contact information of the receiver.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you need to transfer personal information for the reasons for merging, separation, dissolution, and declaration of bankruptcy, we will tell you the name or name and contact information of the receiver."}
{"task": "rw_6.jsonl", "id": 38607, "text": "The receiver will continue to fulfill this policy and other legal obligations.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The receiver will continue to fulfill this policy and other legal obligations."}
{"task": "rw_6.jsonl", "id": 38608, "text": "If the receiver changes the original treatment purpose and method of processing, you will re -obtain your consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If the receiver changes the original treatment purpose and method of processing, you will re -obtain your consent."}
{"task": "rw_6.jsonl", "id": 38609, "text": "(4) Public disclosure", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38610, "text": "We will only publicly disclose your personal information in the following circumstances:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only publicly disclose your personal information in the following circumstances:"}
{"task": "rw_6.jsonl", "id": 38611, "text": "1. Based on your active choice and other individual consent, we may publicly disclose your personal information;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Based on your active choice and other individual consent, we may publicly disclose your personal information."}
{"task": "rw_6.jsonl", "id": 38612, "text": "2., if we are sure that you violate laws and regulations or seriously violate the relevant agreements and rules of [UC Browser], or to protect the safety of the personal property of the [UC browser] user or the public, we may disclose you about youPersonal information, including related violations and [UC browser], has taken measures you have taken.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you determine your violations of laws and regulations or to protect the safety of all parties, we may disclose personal information about you."}
{"task": "rw_6.jsonl", "id": 38613, "text": "Fourth, your rights", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38614, "text": "You can check and manage your information through the following ways, and we will respond to your request in the case of compliance with laws and regulations:", "label": ["Important", "Edit/Control"], "rewrite": "You can check and manage your information in the following ways:"}
{"task": "rw_6.jsonl", "id": 38615, "text": "(1) Review, correct and supplement", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38616, "text": "You have the right to check, correct and supplement your information through the following ways:", "label": ["Edit/Control", "Important"], "rewrite": "You have the right to check, correct and supplement your information through the following ways:"}
{"task": "rw_6.jsonl", "id": 38617, "text": "1. Log in to the UC browser, click \"My\", click the avatar in the upper left corner to enter \"account management\";", "label": ["Important", "Edit/Control"], "rewrite": "Log in to the UC browser, click \"My\", click on the upper left corner to enter \"Account Management\"."}
{"task": "rw_6.jsonl", "id": 38618, "text": "2. Log in to the UC browser and select \"My-upper right corner-Privacy Settings-Permanent Cleaning Historical Behavior\"", "label": ["Important", "Edit/Control"], "rewrite": "Log in to the UC browser and select \"My-upper right corner-Privacy Settings-Permanent Cleaning Historical Behavior\"."}
{"task": "rw_6.jsonl", "id": 38619, "text": "3. Log in to the UC browser and select \"My-upper right corner-help and feedback-customer service center\".", "label": ["Important", "Edit/Control"], "rewrite": "Log in to the UC browser and select \"My — Upper Right River-Help and Feedback-Customer Service Center\"."}
{"task": "rw_6.jsonl", "id": 38620, "text": "(2) Copy right", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38621, "text": "You have the right to obtain your personal information copy.", "label": ["Edit/Control", "Important"], "rewrite": "You have the right to obtain your personal information copy."}
{"task": "rw_6.jsonl", "id": 38622, "text": "If you need to get the copy of your personal information we collected, you can contact us with our customer service center or contact us through the contact information stated by Article 8.", "label": ["Important", "Edit/Control"], "rewrite": "If you need to get a copy of your personal information we collected, you can contact us."}
{"task": "rw_6.jsonl", "id": 38623, "text": "Under the premise of meeting relevant laws and feasibility, we will provide you with a copy of your personal information.", "label": ["Edit/Control", "Important"], "rewrite": "Under the premise of meeting relevant laws and feasibility, we will provide you with a copy of your personal information."}
{"task": "rw_6.jsonl", "id": 38624, "text": "(3) Delete", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38625, "text": "You can delete your information through the path of \"(1), correct, and supplement your information\", or apply for a cancellation account to delete all your information.", "label": ["Important", "Edit/Control"], "rewrite": "You can delete your information through the path of \"(1), correct, and supplement your information\", or apply for a cancellation account to delete all your information."}
{"task": "rw_6.jsonl", "id": 38626, "text": "In the following circumstances, you can make a request to delete personal information through the contact information stated with the \"customer service center\" or eighth:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38627, "text": "1. If our behavior of handling personal information violates laws and regulations;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38628, "text": "2. If we collect and use your personal information, it has not obtained your clear consent;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38629, "text": "3. If our behavior of handling personal information seriously violates your agreement;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38630, "text": "4. If our treatment purpose has been achieved, cannot be achieved or is not necessary for the purpose of the treatment;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38631, "text": "5. If we stop providing products or services, or the storage period has expired.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38632, "text": "If we decide to respond to your deletion request, we will also notify the subject of your personal information from our personal information as much as possible at the same time, and ask them to delete it in time (unless laws and regulations have other regulations, or these subjects have independently obtained your authorization)Essence", "label": ["Important", "Edit/Control"], "rewrite": "If we decide to respond to your deletion request, we will also notify the main body of your personal information from us at the same time as much as possible and ask them to delete them in time."}
{"task": "rw_6.jsonl", "id": 38633, "text": "When you or we assisted you to delete the relevant information, because of the applicable legal and security technical restrictions, we may not be able to immediately delete the corresponding information from the backup system.Treatment until the backup can be removed or achieved anonymous.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "We stop the processing of personal information that is difficult to delete due to applicable laws or technical restrictions, except for storage and adopting necessary security measures until we can be deleted or achieved anonymous."}
{"task": "rw_6.jsonl", "id": 38634, "text": "(3) Change the scope of authorization", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38635, "text": "You can change or withdraw the scope of your personal information in the following ways or withdrawn or process your personal information:", "label": ["Important", "Edit/Control"], "rewrite": "You can change or withdraw authorization through the following ways:"}
{"task": "rw_6.jsonl", "id": 38636, "text": "1. Object a third-party (Taobao, Alipay) account that is authorized in \"My-Avatar-Binding Account\".", "label": ["Edit/Control", "Important"], "rewrite": "The third party (Taobao, Alipay) account is bound in \"My-Avatar-Binded Account\"."}
{"task": "rw_6.jsonl", "id": 38637, "text": "2. Manage your authorized reading interest label in \"My-Settings-Privacy Settings-UC Reading Interest Management\".", "label": ["Important", "Edit/Control"], "rewrite": "Manage your authorized reading interest label in \"Mine-Settings-Privacy Settings-UC Reading Interest Management\"."}
{"task": "rw_6.jsonl", "id": 38638, "text": "3. Manage the system authorization of the APP in \"My-Settings-Privacy Settings-Personal Information Collection Management\".", "label": ["Important", "Edit/Control"], "rewrite": "Manage the system authority authorization of the APP in \"Mine-Settings-Privacy Settings-Personal Information Collection Management\"."}
{"task": "rw_6.jsonl", "id": 38639, "text": "For the authorization that you cannot directly set through the above method, you can modify it through the \"customer service center\" or the eighth contained in the eighth, but please note that for some types of personal information, such as the basic function of the [UC browser], the basic function of the [UC browser]The necessary information or the required information required by the law and regulations of our law and regulations may not be able to respond to the request that you change the scope of authorization.", "label": ["Important", "Edit/Control"], "rewrite": "We may not be able to respond to your request to change the basic functions or fulfill the authorization required by the law and regulations."}
{"task": "rw_6.jsonl", "id": 38640, "text": "When you withdraw authorization, we will no longer process the corresponding personal information.", "label": ["Important", "Edit/Control"], "rewrite": "When you withdraw authorization, we will no longer process the corresponding personal information."}
{"task": "rw_6.jsonl", "id": 38641, "text": "But your decision to withdraw authorization will not affect our personal information processing based on your previous authorization.", "label": ["Permission Acquisition", "Edit/Control", "Risk", "Important"], "rewrite": "Your decision to withdraw authorization will not affect personal information processing based on your authorization."}
{"task": "rw_6.jsonl", "id": 38642, "text": "(4) Logging out the account", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38643, "text": "You can apply for a cancellation of your account in the following ways:", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38644, "text": "1. Submit an account cancellation application in \"My-Avatar-Account Appeal/Logging\" \";", "label": ["Important", "Edit/Control"], "rewrite": "You can apply for a cancellation of your account through the following ways: \"My-left avatar-account appeal/cancellation\" \"submit an account to cancel the application."}
{"task": "rw_6.jsonl", "id": 38645, "text": "2. Apply to cancel your account through customer service contact.", "label": ["Edit/Control", "Important"], "rewrite": "You can apply for a cancellation of your account through customer service."}
{"task": "rw_6.jsonl", "id": 38646, "text": "3. After you actively cancel your account, we will stop providing you with products or services, and delete or deal with your personal information according to the requirements of applicable laws.", "label": ["Important", "Edit/Control"], "rewrite": "After canceling the account, we will stop providing you with products or services, delete or processed personal information."}
{"task": "rw_6.jsonl", "id": 38647, "text": "(5) Automatic decision -making of constraint information systems", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38648, "text": "In certain business functions, we may make decisions only based on the non -artificial automatic decision mechanism, including the algorithm.", "label": ["Important", "Usage"], "rewrite": "We may make decisions based on non -artificial automatic decision -making mechanisms."}
{"task": "rw_6.jsonl", "id": 38649, "text": "If these decisions affect your legitimate rights and interests, you can contact us through customer service.", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38650, "text": "(6) In response to your above request", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38651, "text": "For your or your guardians, close relatives, and other authority to make the above requests to us, and your relevant personal information rights stipulated in the laws and other applicable laws of the People's Republic of China, you can carry through the customer service center or Article 8Ming's contact information initiates complaints.", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38652, "text": "We will make a reply within 15 days.", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38653, "text": "To ensure your account security and your personal information security, when you make a request to us, we may verify your identity (such as adding account verification, requesting you to provide written requests or other reasonable ways), and then process youRequest.", "label": ["Important", "Edit/Control"], "rewrite": "We may verify your identity first, and then process your request."}
{"task": "rw_6.jsonl", "id": 38654, "text": "For your reasonable request, we do not charge fees in principle, but we will charge a certain fee as appropriate for requests that repeat and beyond the reasonable limit.", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38655, "text": "For information that is not directly associated with your identity, the information that is repeatedly applied without reasonable reasons, or you need too many technical means (if you need to develop a new system or change the current convention fundamentally), bring risks to others' legitimate rights or notIn actual requests, we may refuse.", "label": ["Important", "Edit/Control"], "rewrite": "We may refuse to repeat for unseen, need too much technical means, bring risks or very unrealistic requests to others' legitimate rights and interests."}
{"task": "rw_6.jsonl", "id": 38656, "text": "5. Storage of information", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38657, "text": "(1) Storage period", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38658, "text": "We will only retain your personal information within the time limit required for the cost of reaching the cost policy, unless the law has compulsory retention requirements, for exampleIt is no less than three years from the date of completion.", "label": ["Data Retention", "Important"], "rewrite": "Generally, your personal information is retained within the time limit required to achieve service purposes, unless the law has other requirements."}
{"task": "rw_6.jsonl", "id": 38659, "text": "We judge the storage period of personal information mainly based on the following standards:", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38660, "text": "1. Complete your related transaction purpose, maintain the corresponding transactions and business records to cope with your possible inquiries or complaints;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38661, "text": "2. Ensure that we provide you with service safety and quality;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38662, "text": "3. Do you agree to a longer retention period;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38663, "text": "4. In accordance with the requirements of the effective regulations of the applicable lawsuit or the legal prosecution and defense needs of the company's business;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38664, "text": "5. Whether there are other special agreement or laws and regulations on the retention period.", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38665, "text": "After exceeding the reservation period, we will delete or deal with your personal information according to the requirements of the applicable law.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "After exceeding the storage period, your personal information will be deleted or anonymous, except for other provisions of laws and regulations."}
{"task": "rw_6.jsonl", "id": 38666, "text": "(2) Storage location", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38667, "text": "The personal information we collected and generated in the operation of the People's Republic of China will be stored in China.", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in domestic operations will be stored in China."}
{"task": "rw_6.jsonl", "id": 38668, "text": "In the following circumstances, we will provide your personal information to possible overseas entities after fulfilling the obligations stipulated in the law:", "label": ["Data Retention", "Important", "Risk"], "rewrite": "In the following circumstances, after fulfilling the obligations stipulated by the law, we will provide your personal information to your overseas: 1. The applicable laws are clearly stipulated;Establishing and performed by transactions and other types of contracts."}
{"task": "rw_6.jsonl", "id": 38669, "text": "1. Applicable laws have clear regulations;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38670, "text": "2. Get your individual consent;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38671, "text": "3. As a cross -border e -commerce transaction and other types of contracts for one party, you are necessary for the establishment and other types of contracts.", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38672, "text": "In response to the above situations, we will protect your personal information security in accordance with this policy.", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38673, "text": "(3) Storage safety", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38674, "text": "1. Data protection technical measures", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38675, "text": "We have adopted our information that meets industry standards, reasonable and feasible security measures to protect your information, and prevent personal information from being disclosed, used, modified, damaged or lost by unauthorized access, publicly disclosed, used, modified, damaged, or lost.", "label": ["Important", "Data Security"], "rewrite": "We have taken security measures to protect your information."}
{"task": "rw_6.jsonl", "id": 38676, "text": "For example, we will use encrypted technology to improve the security of personal information. When you exchange data between your browser and the server, the SSL protocol is encrypted and protected, and we provide the HTTPS protocol security browsing method;Personal information is maliciously attacked; we will deploy the access control mechanism to make every effort to ensure that only authorized personnel can access personal information.", "label": ["Important", "Data Security"], "rewrite": "We will use encrypted technology to improve the security of personal information and deploy access control mechanisms to make every effort to ensure that only authorized personnel can access personal information."}
{"task": "rw_6.jsonl", "id": 38677, "text": "At present, our important information systems have been protected by the third level of network security levels].", "label": ["Important", "Data Security"], "rewrite": "Important information systems have been evaluated through three or above through network security levels."}
{"task": "rw_6.jsonl", "id": 38678, "text": "2. Measures for data protection management organization", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38679, "text": "We have established a data security management system that is advanced in the industry with data as the core and the data security management system around the data life cycle, and improves the security of personal information from organizational construction, institutional design, personnel management and product technology.", "label": ["Important", "Data Security"], "rewrite": "We have established a data security management system to improve the security of personal information from organizational construction, system design, personnel management and product technology."}
{"task": "rw_6.jsonl", "id": 38680, "text": "We have set up a full -time department for personal information protection, and through training courses and examinations, we have continuously strengthened employees' awareness of protecting the importance of personal information.", "label": ["Important", "Data Security"], "rewrite": "We have set up a full -time department for personal information protection and continue to strengthen employee understanding through training courses and examinations."}
{"task": "rw_6.jsonl", "id": 38681, "text": "3. Response of personal information security incident", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38682, "text": "If our physical, technical, or management protection facilities are damaged, and the information is caused by unauthorized access, public disclosure, tampering or destruction, and damage to your legitimate rights and interests, we will launch an emergency plan in time and take reasonable and necessary measures.In order to reduce the impact on your personal.", "label": ["Important", "Data Security"], "rewrite": "We will start emergency plans to deal with information security incidents and take reasonable and necessary measures to reduce the impact on your personal impact as much as possible."}
{"task": "rw_6.jsonl", "id": 38683, "text": "If a personal information security incident occurs, we will also inform you the basic situation and possible impact of the security incident in accordance with the requirements of the laws and regulations.Remedy.", "label": ["Important", "Data Security"], "rewrite": "If a personal information security incident occurs, we will inform your basic situation, possible impact, disposal measures, independent prevention suggestions, etc."}
{"task": "rw_6.jsonl", "id": 38684, "text": "We will inform you in SMS, telephone, push notification, and other reasonable channels that it is difficult to inform one by one. We will publish an announcement in a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "The relevant situation of security incidents will be informed by mail, letter, telephone, push notification, etc. When it is difficult to inform one by one, it will issue an announcement."}
{"task": "rw_6.jsonl", "id": 38685, "text": "At the same time, we will also report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "Report the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities."}
{"task": "rw_6.jsonl", "id": 38686, "text": "4. Prevention of account security risk", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38687, "text": "When using UC browser to access third -party websites or applets, you inevitably disclose your personal information from the other party or potential transaction of the transaction, such as contact or contact address.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38688, "text": "In addition, you can also establish communication, exchange information or analysis content with our services.", "label": ["Important", "Data Security"], "rewrite": "You can establish communication, exchange information or analysis content with third parties through our services."}
{"task": "rw_6.jsonl", "id": 38689, "text": "Please protect your personal information properly, provides others only under the necessary circumstances, and do not trust the transaction through other trading tools to avoid the stolen information or even encounter telecommunications network fraud.", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38690, "text": "If you are worried that your personal information, especially your account or password, please contact [Customer Service Center] immediately so that we can take corresponding measures based on your application.", "label": ["Important", "Data Security"], "rewrite": "If your personal information is leaked, please contact our customer service immediately."}
{"task": "rw_6.jsonl", "id": 38691, "text": "(4) Stop operation", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38692, "text": "If the UC browser stops operation, we will stop collecting your personal information in time, and inform you of the situation where the operation will be stopped or announced in accordance with the requirements of laws and regulations.", "label": ["Important", "Cessation of Operations"], "rewrite": "When stopping operations, we will stop collecting your personal information in time and inform."}
{"task": "rw_6.jsonl", "id": 38693, "text": "At the same time, we will delete or processes the personal information related to the products or services that have been held.", "label": ["Important", "Data Security", "Cessation of Operations"], "rewrite": "We will delete or processes the personal information related to the product or service that have been operated."}
{"task": "rw_6.jsonl", "id": 38694, "text": "6. Policy update", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38695, "text": "In order to bring you a better product and service experience, we continue to strive to improve our products, services and technology.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38696, "text": "When the new service and business processes change, we may update our privacy policy to inform you of specific changes.", "label": ["Policy Change", "Important"], "rewrite": "When the new service and business process change, we may update our privacy policy to inform you."}
{"task": "rw_6.jsonl", "id": 38697, "text": "But without your clear consent, we will not limit your rights you enjoy in accordance with this policy.", "label": ["Policy Change", "Important"], "rewrite": "Without your clear consent, we will not limit your rights you enjoy in accordance with this policy."}
{"task": "rw_6.jsonl", "id": 38698, "text": "For major changes, we will also provide more significant notifications (including we will notify or provide you with pop -up window prompts through the way we will publicize by the UC browser official website).", "label": ["Policy Change", "Important"], "rewrite": "For major changes, we will also provide a more significant notice."}
{"task": "rw_6.jsonl", "id": 38699, "text": "The major changes in this policy include, but not limited to:", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38700, "text": "1. The business model of the product has changed significantly.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38701, "text": "Such as the purpose of handling personal information, the type of personal information, and the use of personal information;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38702, "text": "2. The main body of the privacy policy caused by business adjustment and transaction mergers and acquisitions, and the new subject receiving party changes the original processing purpose and method of treatment;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38703, "text": "3. The main object of personal information sharing or public disclosure changes;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38704, "text": "4. User personal information rights and their exercise methods have changed significantly;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38705, "text": "5. When dealing with the person in charge of the person in charge of the personal information protection and the change of complaint channels;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38706, "text": "6. Personal information protection assessment report shows that the existence of products has a significant impact on personal rights.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38707, "text": "7. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38708, "text": "UC browser can be used without account registration and login, which is generally impossible to recognize your specific age.", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38709, "text": "If you are a minor, we ask you to ask your parents or other guardians to read this policy carefully, and use our services or provide information to us under the consent of your parents or other guardians.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a minor, please use our services or provide information to us or provide information on your parents or other guardians."}
{"task": "rw_6.jsonl", "id": 38710, "text": "If you are under 14 years of age, before you use our service, you and your guardian should read our \"Personal Information Protection Rules\" that we specially formulates to ensure that the guardian's guardian's personal information protection rules are obtained.After agreeing, you can use our services under the guidance of the guardian to ensure that you are safe when using our services and trading.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are under 14 years of age, please use our services under the guidance of the guardian after obtaining the consent of the guardian's personal information protection rules."}
{"task": "rw_6.jsonl", "id": 38711, "text": "If you are a child's parents or other guardians, please pay attention to whether the child uses our service after obtaining your authorization consent.", "label": ["Specific Audiences", "Important"], "rewrite": "Please pay attention to whether the child will use our service after obtaining your authorization consent."}
{"task": "rw_6.jsonl", "id": 38712, "text": "If you have any questions about your child's personal information, please contact our personal information protection department.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38713, "text": "Eight, contact us", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38714, "text": "You can contact us in the following ways. We will reply to your request within 15 days:", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38715, "text": "1. If you have any questions, opinions or suggestions on the content of this policy, you can contact us through [customer service center];", "label": ["Important", "Contact Information"], "rewrite": "If you have any questions, opinions or suggestions on the content of this policy, you can contact us through [customer service center]."}
{"task": "rw_6.jsonl", "id": 38716, "text": "2. We have also set up a full -time department for personal information protection. You can use [privacy_zx@service.alibaba.com] to contact it (please indicate that it is related to the [UC browser], and explain the specific facts), office address:[South Tower, Guangzhou, Guangzhou, No. 88 Dingxin Road, Haizhu District, Guangzhou City, Guangdong Province].", "label": ["Important", "Contact Information"], "rewrite": "Personal information protection full -time department: privacy_zx@Service.alibaba.comSouth Tower]."}
{"task": "rw_6.jsonl", "id": 38717, "text": "It should be noted that we may not reply to the issue that has nothing to do with the right to this policy or your personal information.", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38718, "text": "If you are not satisfied with our reply, especially if you think our personal information processing behavior has harm your legitimate rights and interests, you can also seek solutions by filed a lawsuit to a court with jurisdiction in the place of residence in the defendant.", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38719, "text": "Appendix: Related Definition", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38720, "text": "UC: It refers to a website and application of UC browser (domain name www.uc.cn).", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38721, "text": "UC browser service provider: Refers to UC's Internet information and software technology service providers Guangzhou Morality Computer Technology Co., Ltd. (Registration address: No. 38 room 305 room 306 room 307 room 307 room 307 room 307 room 307 room 306 room 306 room 306 room 306Room 308).", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38722, "text": "Related company: Refers to the related company of Taobao platform service providers disclosed by the latest listed company annual report of Alibaba Group Holding Limited.", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38723, "text": "Alipay: Refers to the main Alipay (China) Network Technology Co., Ltd. providing Alipay services.", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38724, "text": "Personal information: Various information related to the recognized or recognized natural persons recorded in electronics or other ways, excluding information after anonymous processing.", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38725, "text": "Sensitive personal information: Once sensitive personal information is leaked or illegally, it is easy to lead to personal information that is harmful to natural person's personality dignity or personality and property security.Track information, and personal information of minors under the age of 14.", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38726, "text": "Child: Refers to minors under the age of 14.", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38727, "text": "Equipment information: We will receive and record the device -related information (including device models, operating system versions, device settings, MAC address and IMEI, IDFA, OAID, etc. according to your software installation and/or in use.Equipment identifiers, equipment environment, mobile application lists and other software and hardware feature information), related information related to the location of the device (including the GPS location you authorted, and sensor information such as WLAN access points, Bluetooth and base stations).", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38728, "text": "Service log information: When you use the products or services we provide, we will automatically collect your detailed usage of our service as a service log, including browsing, clicking, searching, collecting, focusing on sharing information, publishing information, publishing information, Crash log, performance log, IP address, browser type, telecommunications operator, use language, access date and time.", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38729, "text": "Decoration: Refers to the process of personal information processing, so that it cannot recognize specific natural persons without using additional information.", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38730, "text": "Anonymous: Refers to the process that personal information cannot identify specific natural persons and cannot recover.", "label": [], "rewrite": []}
{"task": "rw_6.jsonl", "id": 38731, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
