{"task": "rw_62.jsonl", "id": 58748, "text": "\"Light -faced Camera\" Privacy Policies Concise Version: Personal Information Protection Guide", "label": ["Usage"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58749, "text": "We know that personal information security and privacy protection are very important. This guidance will help you understand how we collect, process personal information, and protect your privacy.", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58750, "text": "1. How do we collect and use information", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58751, "text": "1.1 Account Information and Contact Information", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58752, "text": "(1) [Register and login] You can authorize login camera through a third -party account (eg: Douyin account, Apple, ID), you will authorize the light face camera to obtain the public information registered on the third -party platform (avatar, avatar, avatar, avatar, avatar, avatar, avatar, avatar, avatar, avatar, avatar, avatar, avatar, avatar, avatar, avatar, avatar, avatar, avatar, avatar, avatar, avatar, avatar, avatar, avatar, avatar, avatar, avatar, avatar, avatar, avatar,Nickname) and other information you authorized.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "You can log in to the light face camera through a third -party account, and you will authorize the light -face camera to obtain the public information registered on the third -party platform and other information you authorize."}
{"task": "rw_62.jsonl", "id": 58753, "text": "(2) [Real -name authentication] When you use the relevant functions or services that need to be authenticated (for example, you can upload, publish, share, comment, etc. through light -face cameras), according to relevant laws and regulations, you should ensure that your placeRelevant third -party accounts used have completed the real -name system registration;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "According to relevant laws and regulations, you should ensure that the relevant third -party accounts you use have completed the real -name registration registration."}
{"task": "rw_62.jsonl", "id": 58754, "text": "Or you may need to provide your real identity information to complete the real -name authentication before you can use the relevant functions.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "You may need to provide your real identity information to complete the real -name authentication before you can use related functions."}
{"task": "rw_62.jsonl", "id": 58755, "text": "(3) [Contact you] We may send you operations, promotion, activities and other information to you through the contact information (mobile phone number, mailbox, etc.) actively provided during the use of light cameras.Provided with the withdrawal entrance or contact us to the withdrawal.", "label": ["Edit/Control", "First Party Collection Information", "Usage", "Important"], "rewrite": "We may send you operations, promotion, activities and other information to you through the contact information (mobile phone number, mailbox, etc.) in the process of using light cameras."}
{"task": "rw_62.jsonl", "id": 58756, "text": "1.2 Camera/microphone/album", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58757, "text": "(1) Take photos, videos, provide beauty, filters, etc., and support downloading, preservation to local and sharing are the basic functions of lightweight cameras.", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58758, "text": "To achieve these functions, we need to obtain cameras, microphones, and album permissions. These permissions are sensitive permissions. We will only obtain these permissions after your authorization consent.", "label": ["Permission Acquisition", "Important"], "rewrite": "We need to obtain the camera, microphone and album permissions, and we will only obtain such permissions after you authorize."}
{"task": "rw_62.jsonl", "id": 58759, "text": "If you refuse to authorize certain necessary permissions, you will not be able to use the corresponding functions, but it will not affect your normal use of other services.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you refuse to authorize certain necessary permissions, you will not be able to use the corresponding function, but it will not affect your normal use of other services."}
{"task": "rw_62.jsonl", "id": 58760, "text": "You understand and agree that after you have authorized the lightweight camera to access the storage space/album permissions, you provide you with a high -quality service experience (including but not limited to increasing the speed and content preview speed of the local album, and realize the lower left corner of the shooter page.Real -time album preview and other functions), we will access your album with a reasonable minimum frequency every time you exit and reopen the light camera for the local album pre -loaded for the aforementioned purpose.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "After you authorize access to the storage space/album permissions, we will access your album with a reasonable minimum frequency for pre -loaded local albums for the aforementioned purpose."}
{"task": "rw_62.jsonl", "id": 58761, "text": "If you do not agree, you do not authorize our permissions, or if you authorize, you can also withdraw authorization according to the path provided by the light camera or in the mobile phone system at any time.", "label": ["Permission Acquisition", "Important", "Edit/Control"], "rewrite": "After you authorize, you can also withdraw authorization in accordance with the path provided by the lightweight camera or in the mobile phone system at any time."}
{"task": "rw_62.jsonl", "id": 58762, "text": "(2) We will never open sensitive authority to steal your privacy, read your picture content, or collect your dialogue during your daily chat, and we will not use such illegal means to push information and advertising.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "We will never open sensitive permissions to steal privacy and personal information, let alone use such illegal means to push information and advertising."}
{"task": "rw_62.jsonl", "id": 58763, "text": "1.3 shear plate", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58764, "text": "(1) When you log in with a third -party account, we will write and read the information necessary for logging in to achieve.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We will write and read the information necessary for logging in to achieve."}
{"task": "rw_62.jsonl", "id": 58765, "text": "This information is for the purpose of achieving the relevant purpose of login and will not collect your privacy information.", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58766, "text": "(2) When participating in the activity by sharing the return method, we will judge whether there is information in the shear plate that meets the rules of the event on the mobile phone, and we will not return you to the personal privacy information of the shear plate.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We will judge whether there is information that meets the rules of the event on the mobile phone, and will not return you to the personal privacy information of the shear plate."}
{"task": "rw_62.jsonl", "id": 58767, "text": "(3) Systems of terminal devices such as mobile phones will prompt the application (APP) to read the shear plate, but the system prompts that it cannot distinguish whether to collect shear information and do not rule out the error.", "label": ["First Party Collection Information", "Permission Acquisition"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58768, "text": "Therefore, if you find a similar prompt, please contact us so that we can locate the problem.", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58769, "text": "1.4 Equipment information and log information", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58770, "text": "(1) When you use light -face cameras and related services, in order to ensure the quality and efficiency of the safe operation and operation of software and services, we will collect your hardware model, operating system version number, equipment identifier (Android, androidid, OAID, GAID, hardware serial number, iOS, such as IDFV, IDFA), WLAN access points (SSID, BSSID), Bluetooth, base station, IP address, software version number, network access method and type, network, network, network, network, network, network, network, network, network, network, network, network, network, network, network, network, network, network, network, network, network, network, network, network, network, network, network, network, network, network, network, network, network, network, network, and networkQuality data, operation, use, service log information and sensor information.", "label": ["Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "We will collect your hardware model, operating system version number, equipment identifier (Android, Androidid, OAID, GAID, hardware serial number, iOS such as IDFV, IDFA), WLAN access points (SSID, BSSID), Bluetooth), Base station, IP address, software version number, network access method and type, status, network quality data, operation, use, service log information and sensor information."}
{"task": "rw_62.jsonl", "id": 58771, "text": "When you use the light camera and the props, special effects, filters, stickers and other tools it provide to shoot and publish content, we will use sensors based on your operation and tool types (including acceleration sensors, gravity sensors, rotation vectorSensor and gyroscope sensor) to identify your device horizontal and vertical screen and adapt to the tools to be selected.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We will identify your device horizontal and vertical screen and adapt to the tools to be selected."}
{"task": "rw_62.jsonl", "id": 58772, "text": "(2) Equipment and log information are usually used in anti -cheating and judging whether the account is in a safe environment.", "label": ["Important", "Data Security", "Usage"], "rewrite": "Equipment and log information are also usually used in anti -cheating and judging whether the account is in a safe environment."}
{"task": "rw_62.jsonl", "id": 58773, "text": "Some information may also be used for advertising push.", "label": ["Important", "Usage"], "rewrite": "Some information may also be used for advertising push."}
{"task": "rw_62.jsonl", "id": 58774, "text": "At present, most mobile phone systems can support changes to the equipment identifier. For specific methods, please refer to the device or manufacturer's description.", "label": ["Important", "Edit/Control"], "rewrite": "At present, most mobile phone systems can support changes to the equipment identifier."}
{"task": "rw_62.jsonl", "id": 58775, "text": "1.5 Use information", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58776, "text": "(1) The use information mainly includes: click, focus, collect, search, query, browse, download, share, comment, like (like) and other information generated by using light -face cameras.", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58777, "text": "(2) When you actively publish the content, we will record the pictures, texts you posted.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you actively publish the content, we will record the pictures, text, and so on."}
{"task": "rw_62.jsonl", "id": 58778, "text": "(3) We will recommend information and advertisements that may be more interested in according to your use of behavior.", "label": ["Important", "Usage"], "rewrite": "We will recommend information and advertisements that may be more interested in according to your use algorithm based on your use of acts."}
{"task": "rw_62.jsonl", "id": 58779, "text": "View detailed personal information collection list", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58780, "text": "2. Use of personal information in the main functions or services", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58781, "text": "2.1 Provide unique features such as personalized beautification tools, style templates and other features", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58782, "text": "Provide a personalized tool (filter, beauty, beauty, etc.), style templates (photo templates), etc. are the core functions and services of lightweight cameras.", "label": ["Usage"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58783, "text": "To achieve these functions and services, we may collect and use the following information:", "label": ["Important", "First Party Collection Information"], "rewrite": "We may collect and use the following information:"}
{"task": "rw_62.jsonl", "id": 58784, "text": "Facial recognition information", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58785, "text": "a. When you choose to use some beautification tools and style templates that need to be adjusted or feedback based on facial recognition information, in order to provide a better functional experience and display effect, we need to identify and process your facial feature information on the local clientFor rendering effects, we will not transmit this information to the server, will not store any form of storage, and we will not use this information to any other goals other than that.Items", "label": ["Data Retention", "Important", "First Party Collection Information", "Usage"], "rewrite": "We need to identify and handle your facial feature information on the local client for rendering effects. We will not transmit this information to the server, will not store it, and will not use this information for any other purposes.Provide to any third party."}
{"task": "rw_62.jsonl", "id": 58786, "text": "b. When you choose to use some creative functions, special effects gameplay (including but not limited to \"super -clear portrait\"), in order to achieve image processing and facial effect optimization faster and accurately, we need, Video and other media information temporarily uploaded to the server for the effect optimization processing.", "label": ["Data Retention", "Important", "First Party Collection Information", "Usage"], "rewrite": "We need to temporarily upload the media information such as pictures, videos and other media that you choose to process to optimize the effect."}
{"task": "rw_62.jsonl", "id": 58787, "text": "The media information you uploaded will only be used to optimize images, video processing and/or effect optimization through specific creative functions and special effects.Forms of storage will not be provided to third parties.", "label": ["Data Retention", "Important", "First Party Collection Information", "Usage"], "rewrite": "We will not use the media data you uploaded for any other purposes, nor do you store any form of storage, and will not provide it to a third party."}
{"task": "rw_62.jsonl", "id": 58788, "text": "After completing the relevant function processing and returning the effect content to you, we will immediately delete the relevant pictures, videos and other media information and all information involved from the server.", "label": ["Data Retention", "Important"], "rewrite": "After completing the relevant functions, we will immediately delete the relevant pictures, video and other media information and all information involved from the server."}
{"task": "rw_62.jsonl", "id": 58789, "text": "We will authorize the special functions that need to upload media information to the server for the effect optimization processing. If you refuse to authorize, it will only make you unable to use specific functions, but it will not affect other services that use your normally use lightweight cameras.Essence", "label": ["Important", "First Party Collection Information"], "rewrite": "We will authorize you alone. If you refuse to authorize, it will only make you unable to use specific functions, but it does not affect your normal use of other services."}
{"task": "rw_62.jsonl", "id": 58790, "text": "Please understand that when we collect and process the above information, we have de -identified processing/anonymous processing. The data analysis only corresponds to the identification of specific and cannot directly associate the user's personal identity.", "label": ["Usage"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58791, "text": "2.2 Personalized content recommendation", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58792, "text": "In order to ensure the quality of the recommended content, and recommend the templates, search content and related information that you may be interested in. We will provide you with personalized content recommendation services based on the following necessary log information, and we will be committed to bringing you betterExperience:", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58793, "text": "The behavior information you operate and use: click, use, share, save to local, search;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58794, "text": "The information you actively provide: like (like), cancel the like (cancel love).", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58795, "text": "2.3 Personalized Advertising Push", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58796, "text": "In order to provide you with free and high -quality services, we will show you as much as possible to you as much as possible according to the situation where you use related services. At the same time, we will strive to ensure that dataSafety.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We will show you as more interested and correlated advertisements as much as possible based on the situation of your related services, while trying to ensure the security of data."}
{"task": "rw_62.jsonl", "id": 58797, "text": "3. How to better control the use of personal information", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58798, "text": "3.1 Visit, delete, correct personal information", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58799, "text": "(1) You can access your avatar and user nickname in [Style]-[Style Store]-[My] Page;", "label": ["Important", "Edit/Control"], "rewrite": "You can visit your avatar and user nickname in [Style]-[Mine]-[Mine]."}
{"task": "rw_62.jsonl", "id": 58800, "text": "(2) You can visit and cancel your favorite information in [Mine]-[Like];", "label": ["Important", "Edit/Control"], "rewrite": "You can visit and cancel your favorite information in [Mine]-[Like]."}
{"task": "rw_62.jsonl", "id": 58801, "text": "(3) You can access and query the account information you follow in [Mine]-[Following], click the \"Follow\" button after clicking on the list of followers, you can choose to cancel the account number;", "label": ["Important", "Edit/Control"], "rewrite": "You can access and query the account information you can follow in [Mine]-[Following]. Click the \"Follow\" button to choose to cancel the account number."}
{"task": "rw_62.jsonl", "id": 58802, "text": "(4) For the consideration of security and identity, you may not be unable to modify some registration information submitted during the registration or use during the registration (information after the real -name authentication);", "label": ["Important", "Edit/Control"], "rewrite": "You may not be unable to modify some registered information submitted during the registration or use during the registration (information after the real -name authentication)."}
{"task": "rw_62.jsonl", "id": 58803, "text": "If you really need to modify this type of information, please feedback the path of [camera settings]-[opinion feedback and report] path on the upper left corner of the homepage of the mobile client on the light camera.Return or deal with timely working days.", "label": ["Edit/Control", "Important"], "rewrite": "If it is indeed necessary to modify this type of information, please feedback the path of [Camera Settings]-[Opinion Feedback and Report] path through the upper left corner of the homepage of the light camera mobile client."}
{"task": "rw_62.jsonl", "id": 58804, "text": "3.2 Management of personalized content recommendation", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58805, "text": "You can provide the \"Manageed Personalized Content Recommendation] or a light-looking camera mobile client\" 1,-, 1.5 \"through the\" \"Light-faced Camera\" privacy policy [Camera Settings]-[Personalized Recommendation Settings]The path of the personalized recommendation function is turned on or closed. You can choose to close the personalized recommendation of all one click. When you choose to close all personalized recommendations, you will no longer show you the recommendation information content. You cannot enjoy personalized recommendation services., But you can continue to browse non -individualized recommendations such as attention and hotspots.", "label": ["Important", "Edit/Control"], "rewrite": "You can use the \"Manageed Personalized Content Recommendation] under the\" 1 -1.5 \"clause\" \"\" Privacy Policy \"of\" Light Family Camera \"or the Power of Camera Mobile Client [Camera Settings] - [Personalized Recommendation Settings].Open or close the personalized recommendation function."}
{"task": "rw_62.jsonl", "id": 58806, "text": "When you are not interested in specific information or want to reduce some types of information, you can submit our opinions and suggestions through the [camera settings]-[opinion feedback and report] of the mobile client of the light camera. We will adjust based on your feedback adjustment.Strategy.", "label": ["Important", "Edit/Control"], "rewrite": "You can submit opinions and suggestions to us through [Camera Settings]-[Opinion Feedback and Report]"}
{"task": "rw_62.jsonl", "id": 58807, "text": "3.3 Account Logging out", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58808, "text": "iOS User: You can cancel accounts in [Camera Settings]-[Account Logging up].", "label": ["Important", "Edit/Control"], "rewrite": "iOS-side users can cancel accounts in [Camera Settings]-[Account Logging out]."}
{"task": "rw_62.jsonl", "id": 58809, "text": "Before you cancel your account, we will verify your personal identity, security status, equipment information, etc. you have authorized us.", "label": ["Important", "Edit/Control"], "rewrite": "Before canceling the account, we will verify the personal identity, security status, equipment information, etc. you have authorized us."}
{"task": "rw_62.jsonl", "id": 58810, "text": "For the process and content of the injection, see \"Light Camera Account Logging out\".", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58811, "text": "You know and understand that the behavior of canceling the account is irreversible. When you log out the account, we will delete relevant information about you. If you delete personal information, it is difficult to achieve technically, we will perform anonymous processing, or stop removing removing removalIn addition to the storage and necessary safety protection measures, the laws and regulations are otherwise stipulated.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "The behavior of canceling the account is irreversible behavior. When the account is canceled, we will delete relevant information about you. If it is difficult to achieve technically, we will perform anonymous treatment, or stop storage and take necessary safety protection measures.Treatment."}
{"task": "rw_62.jsonl", "id": 58812, "text": "Android user: You can apply for a light-looking camera account through the [Camera Settings]-[Opinion Feedback and Report] through the lightweight camera mobile client.Reply to your request within the time limit required by working days or laws and regulations.", "label": ["Important", "Edit/Control"], "rewrite": "Android users can apply for the logging camera account through the [camera settings]-[opinion feedback and report] of the light-looking camera mobile client."}
{"task": "rw_62.jsonl", "id": 58813, "text": "Before you cancel your account, we will verify your personal identity, security state, equipment information, etc.", "label": ["Important", "Edit/Control"], "rewrite": "Before you cancel your account, we will verify your personal identity, security state, equipment information, etc."}
{"task": "rw_62.jsonl", "id": 58814, "text": "You know and understand that the cancellation account is an irreversible behavior. When you cancel your account, we will delete relevant information about you or make promise, except for the laws and regulations.", "label": ["Edit/Control", "Important"], "rewrite": "When you cancel your account, we will delete the relevant information about you or perform anonymous processing, except for the laws and regulations."}
{"task": "rw_62.jsonl", "id": 58815, "text": "3.4 Management of personalized advertising recommendations", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58816, "text": "Autonomous decision to receive personalized advertising information: Personalized advertising is one of the advertising display technology, and the advertisers are intelligently recommended based on your preferences in its application.", "label": ["Important", "Edit/Control"], "rewrite": "Personalized advertising is one of the advertising display technology, and the advertisers make intelligent recommendations based on your preferences in its application."}
{"task": "rw_62.jsonl", "id": 58817, "text": "You can choose to close or open a personalized advertisement in \"Settings\" - \"Settings\" - \"Personalized Advertising Display Settings\". When you close, you no longer receive such personalized advertisements, but you stillYou will see advertisements. The number of advertisements will not change, but the correlation of advertising will be reduced.", "label": ["Important", "Edit/Control"], "rewrite": "You can choose to close or open whether to receive personalized advertisements in the \"lightweight camera\" - \"setting\" - \"personalized advertising display settings\"."}
{"task": "rw_62.jsonl", "id": 58818, "text": "Note: This guidance belongs to the component of the Privacy Policy of the \"Light Beauty Camera\"", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58819, "text": "\"Light Face Camera\" privacy policy", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58820, "text": "Update date: 2022 [7] month [19]", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58821, "text": "Shenzhen Facemeng Technology Co., Ltd. and its related parties (\"We\" or \"Company\") as operators of lightweight cameras, we know the importance of personal information to you. We will protect you in accordance with the provisions of laws and regulationsPersonal information and privacy security.", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58822, "text": "We formulate this \"Light -faced Camera\" privacy policy (referred to as \"privacy policy\") and special reminders: I hope you can read and understand the privacy policy carefully before using lightweight cameras and related services to make appropriate choices.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58823, "text": "This privacy policy will help you understand:", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58824, "text": "We will follow your information to collect and use your information, but we will not collect personal information in a package of compulsory binding because you agree with your consent of this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58825, "text": "When you use or open related functions or use services, we will collect and use relevant information for the implementation of functions and services.", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58826, "text": "Unless it is necessary to realize business functions or necessary information that necessary in accordance with laws and regulations, you can refuse to provide and not affect other functions or services.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58827, "text": "We will explain the information we want to collect in the privacy policy.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58828, "text": "When you use light -face cameras for photo shooting, video recording, using specific beautification tools (filters, beauty, beauty, etc.), style templates (photo templates), login, sharing and other services,We must collect or process personal sensitive information such as picture/audio and video files and facial recognition features.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may collect or process personal sensitive information such as picture/audio and video files and facial recognition features."}
{"task": "rw_62.jsonl", "id": 58829, "text": "You have the right to refuse to authorize this information or withdraw your authorization of this information.", "label": ["Important", "First Party Collection Information", "Edit/Control"], "rewrite": "You have the right to refuse to authorize this information or withdraw your authorization of this information."}
{"task": "rw_62.jsonl", "id": 58830, "text": "Please understand, refusing or withdrawing the authorization consent will cause you to be unable to use related specific functions, but it does not affect other services of your normally use light camera.", "label": ["Important", "First Party Collection Information", "Edit/Control"], "rewrite": "Rejection or withdrawal of authorization will cause you to be unable to use relevant functions, but it does not affect your normal use of other services."}
{"task": "rw_62.jsonl", "id": 58831, "text": "When you fully read and agree to this privacy policy and the \"Light -faced Camera User Agreement\", it means that you have agreed to accept the basic functional services of the lightweight camera;", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58832, "text": "Other value -added function services, we will pop up a separate pop -up window to remind you, and only provide you with the consent of your authorization and collect relevant necessary information;", "label": ["Important", "First Party Collection Information"], "rewrite": "For other value -added function services, we will pop up the window alone, and only provide services to you and collect relevant necessary information to you only after obtaining the consent of the authorization."}
{"task": "rw_62.jsonl", "id": 58833, "text": "Please note that after you make a separate authorization consent (including but not limited to your proactive login of the lightweight camera account, authorized use of special beautification tools/style templates, etc., you will automatically exit the basic function mode will be automatically exited.Enter the general mode.", "label": ["Permission Acquisition", "Important"], "rewrite": "After you make a separate authorization consent, you will automatically exit the basic function mode into the general mode."}
{"task": "rw_62.jsonl", "id": 58834, "text": "If you do not log in to the account, we will ensure the basic functions of information push through the identifier information corresponding to the device.", "label": ["Important", "First Party Collection Information"], "rewrite": "If the account is not logged in, we will ensure the basic functions of information push through the identifier information corresponding to the device."}
{"task": "rw_62.jsonl", "id": 58835, "text": "If you log in to your account, we will push information according to account information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will push information according to account information."}
{"task": "rw_62.jsonl", "id": 58836, "text": "The camera (camera), microphone (recording), and album (storage) permissions will not be opened by default. Only by your explicit authorization will you use it when you implement specific functions or services, and you can also withdraw authorization.", "label": ["Permission Acquisition", "Important", "Edit/Control"], "rewrite": "The camera (camera), microphone (recording), and album (storage) permissions will not be opened by default. Only by your explicit authorization will you use it when you implement specific functions or services, and you can also withdraw authorization."}
{"task": "rw_62.jsonl", "id": 58837, "text": "In particular, it is necessary to point out that even after your authorization, we have obtained these sensitive permissions, and we will not collect your information when related functions or services are not needed.", "label": ["Permission Acquisition", "Important"], "rewrite": "Even after your authorization, we have obtained these sensitive permissions, and we will not collect your information sometimes in related functions."}
{"task": "rw_62.jsonl", "id": 58838, "text": "Light -faced camera permission application and use instructions", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58839, "text": "This privacy policy is suitable for your mobile Internet applications, PC -end/web applications, official websites, third -party websites and applications \"light cameras\"Related software development tool packs (SDK) and application programming interface (API) methods to access and use\" lightweight cameras \"products and related services.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58840, "text": "The following will help you understand how we collect, use, store, transfer (as applicable) and protect personal information;", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58841, "text": "Help you understand the way to check, copy, correct, delete, and withdraw authorization of personal information.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58842, "text": "This policy is closely related to your service relationship. We recommend that you read and understand all the contents of this policy, make a proper choice you think, and the important content of your personal information rights and interests.Essence", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58843, "text": "1. How do we collect and use personal information", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58844, "text": "2. How do we use cookie equivalent technologies", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58845, "text": "3. How do we share, transfer, and publicly disclose personal information", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58846, "text": "4. How do we store personal information", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58847, "text": "5. How can we protect the security of personal information", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58848, "text": "6. Personalized recommendation", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58849, "text": "7. Manage your personal information", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58850, "text": "8. Terms of minors", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58851, "text": "9. Amendment and Notice of Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58852, "text": "10. Scope of application", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58853, "text": "11. Contact us", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58854, "text": "1. How do we collect and use personal information", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58855, "text": "We will collect the information you actively provided when using the service, and collect the information you generated during the use of function or accepting service through automation:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58856, "text": "1.1 Registration, login, certification", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58857, "text": "(1) You can use a third -party account (such as: Douyin account, Apple, ID) to authorize and use light -face cameras and related services. To this end, you will authorize us to obtain the public information you registered on the third -party platform (The avatar, nickname) and other information you authorize will be used to create a light -face camera account for you simultaneously, and bind the third -party account you who have authorized you to with your light -face camera account so that you can provide you with lightweight cameras.Related Services.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "You will authorize us to obtain the public information (avatar, nickname) and other information you authorized on the third -party platform."}
{"task": "rw_62.jsonl", "id": 58858, "text": "(2) When logging in with a third -party account, you may need to write and read the information necessary to log in in the shear plate.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When logging in with a third -party account, you may need to write and read the information necessary to log in in the shear plate."}
{"task": "rw_62.jsonl", "id": 58859, "text": "This information is for the purpose of achieving the relevant purpose of login and will not collect your privacy information.", "label": ["Important", "Usage"], "rewrite": "This information is for the purpose of achieving the relevant purpose of login and will not collect your privacy information."}
{"task": "rw_62.jsonl", "id": 58860, "text": "(3) We will still ask you to provide personal information that we need but third parties.", "label": ["Important", "First Party Collection Information"], "rewrite": "This information is for the purpose of achieving the relevant purpose of login and will not collect your privacy information."}
{"task": "rw_62.jsonl", "id": 58861, "text": "If you refuse to provide it, it will cause you to be unable to use related services.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide personal information, it will cause you to be unable to use related services."}
{"task": "rw_62.jsonl", "id": 58862, "text": "(4) You agree and understand that when you need to use the function of identity authentication or related services (for exampleThe related third -party accounts you use have completed the real -name registration registration;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When you use the function or related services that need to be authenticated, according to relevant laws and regulations, you should ensure that the relevant third -party account has completed the real -name registration registration."}
{"task": "rw_62.jsonl", "id": 58863, "text": "Or you may need to provide your real identity information to complete the real -name authentication before you can use the relevant functions.", "label": ["Important", "First Party Collection Information"], "rewrite": "You may need to provide your real identity information to complete the real -name authentication before you can use related functions."}
{"task": "rw_62.jsonl", "id": 58864, "text": "You can refuse to provide it. If you choose to refuse, you may not be able to obtain related services, but it does not affect other functions and services of your normal use of light cameras.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you choose to refuse, you may not be able to obtain related services, but it does not affect your normal use of other functions and services."}
{"task": "rw_62.jsonl", "id": 58865, "text": "1.2 Make protection of light -faced cameras and run safely", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58866, "text": "1.2.1 Operation and Security", "label": ["Data Security"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58867, "text": "We are committed to providing you with a safe, credible product and use environment, and providing high -quality and reliable services and information is our core goal.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58868, "text": "Please understand that in order to maintain the normal operation of our services and protect the legitimate interests of you or other users or the public from losses, we will collect the necessary information for the safe and stable operation of products or services.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "We will collect the necessary information for maintaining the safe and stable operation of products or services."}
{"task": "rw_62.jsonl", "id": 58869, "text": "In addition, the lightweight camera will not collect any other personal sensitive information during the static state and/or in the background operation.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "In the silent state and/or in the background operation, the light camera will not collect any other personal sensitive information of your personal personal."}
{"task": "rw_62.jsonl", "id": 58870, "text": "1.2.2 Equipment information and log information", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58871, "text": "(1) When you use light -face cameras and related services, in order to ensure the quality and efficiency of the safe operation and operation of software and services, we will collect your hardware model, operating system version number, equipment identifier (Android, androidid, OAID, GAID, hardware serial number, iOS such as IDFV, IDFA), WLAN access points (SSID, BSSID), Bluetooth, base station, network device hardware address (MAC), IP address, software version number, network connection, network connectionInput method and type, status, network quality data, operation, use, service log information and sensor information.", "label": ["Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "We will collect your hardware model, operating system version number, equipment identifier (Android, Androidid, OAID, GAID, hardware serial numbers, iOS such as IDFV, IDFA), WLAN access points (SSID, BSSID), Bluetooth), Base station, network equipment hardware address (MAC), IP address, software version number, network access method and type, state, network quality data, operation, use, service log information and sensor information."}
{"task": "rw_62.jsonl", "id": 58872, "text": "When you use the light camera and the props, special effects, filters, stickers and other tools it provide to shoot and publish content, we will use sensors based on your operation and tool types (including acceleration sensors, gravity sensors, rotation vectorSensor and gyroscope sensor) to identify your device horizontal and vertical screen and adapt to the tools to be selected.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We use sensors based on your operation and tool types used to identify your device horizontal and vertical screen and adapt to the tools to be selected."}
{"task": "rw_62.jsonl", "id": 58873, "text": "(2) To help us better understand the operation of lightweight cameras and related services. At the same time, in order to prevent malicious procedures and ensure the quality and efficiency of operating operations, we will record the network log, collect the application information or the process information that is being running, and the processing information that is being running, and the process information that is being running, and the process information that is being running.The overall operation, usage and frequency of application, frequency, application crash, overall installation usage, performance data, and source of application.", "label": ["Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "We will record the application information of the network, collect and install the process information, the overall operation of the application, the use of usage and frequency, the application crash, the overall installation of usage, the performance data, and the source of the application."}
{"task": "rw_62.jsonl", "id": 58874, "text": "(3) We may use your account information, equipment information, service log information, as well as the information that our affiliates and partners are obtained or provided by your authorization or provided by law to judge the security of accounts and transactions, conduct authentication, identify violations of laws and regulations illegal regulationsSituation, testing and preventing safety incidents, and adopting necessary records, analysis, and disposal measures in accordance with the law.", "label": ["Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "We may use your account information, equipment information, service log information, and our related parties and partners to obtain the information you can provide or can provide in accordance with the law to judge the security of accounts and transactions."}
{"task": "rw_62.jsonl", "id": 58875, "text": "1.3 General functions such as photo shooting, video recording and other general functions", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58876, "text": "Light -face camera provides you with general functions and services such as photo shooting, video recording, beauty, filter, media file download/saving to local/sharing.", "label": ["Usage"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58877, "text": "In order to achieve these functions and services, we need to obtain the camera (camera), microphone (recording), and album permissions (storage). These permissions are sensitive permissions. We will only obtain such permissions after your authorization consent.", "label": ["Permission Acquisition", "Important"], "rewrite": "We need to obtain the camera (camera), microphone (recording) and album permissions (storage). We will only obtain these sensitive permissions after you authorize."}
{"task": "rw_62.jsonl", "id": 58878, "text": "If you refuse to authorize certain necessary permissions, you will not be able to use the corresponding functions, but it will not affect your normal use of other services.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you refuse to authorize certain necessary permissions, you will not be able to use the corresponding function, but it will not affect your normal use of other services."}
{"task": "rw_62.jsonl", "id": 58879, "text": "1.4 Provide unique features such as personalized beautification tools, style templates and other features", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58880, "text": "Provide a personalized tool (filter, beauty, beauty, etc.), style templates (photo templates), etc. are the core functions and services of lightweight cameras.", "label": ["Usage"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58881, "text": "To achieve these functions and services, we may collect and use the following information:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58882, "text": "Facial recognition information", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58883, "text": "a. When you choose to use some beautification tools and style templates that need to be adjusted or feedback based on facial recognition information, in order to provide a better functional experience and display effect, we need to identify and process your facial feature information on the local clientFor rendering effects, we will not transmit this information to the server, will not store any form of storage, and we will not use this information to any other goals other than that.Items", "label": ["Data Retention", "Important", "First Party Collection Information", "Usage"], "rewrite": "We need to identify and handle your facial feature information on the local client for rendering effects. We will not transmit this information to the server.Provide to any third party."}
{"task": "rw_62.jsonl", "id": 58884, "text": "b. When you choose to use some creative functions, special effects gameplay (including but not limited to \"super -clear portrait\"), in order to achieve image processing and facial effect optimization faster and accurately, we need, Video and other media information temporarily uploaded to the server for the effect optimization processing.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to achieve image processing and facial effect optimization faster and accurately, we need to temporarily upload media information such as pictures and videos that you choose to process to optimize the effect."}
{"task": "rw_62.jsonl", "id": 58885, "text": "The media information you uploaded will only be used to optimize images, video processing and/or effect optimization through specific creative functions and special effects.Forms of storage will not be provided to third parties.", "label": ["Data Retention", "Important", "Usage"], "rewrite": "We will not use the uploaded media data for any other purposes, no forms of storage, and not provided to third parties."}
{"task": "rw_62.jsonl", "id": 58886, "text": "After completing the relevant function processing and returning the effect content to you, we will immediately delete the relevant pictures, videos and other media information and all information involved from the server.", "label": ["Data Retention", "Important"], "rewrite": "After completing the relevant function processing and returning the effect content to you, we will immediately delete all the information involved from the server."}
{"task": "rw_62.jsonl", "id": 58887, "text": "We will authorize the special functions that need to upload media information to the server for the effect optimization processing. If you refuse to authorize, it will only make you unable to use specific functions, but it will not affect other services that use your normally use lightweight cameras.Essence", "label": ["Important", "First Party Collection Information"], "rewrite": "We will authorize you alone. If you refuse to authorize, it will only make you unable to use specific functions, but it does not affect your normal use of other services."}
{"task": "rw_62.jsonl", "id": 58888, "text": "Please understand that when we collect and process the above information, we have de -identified processing/anonymous processing. The data analysis only corresponds to the identification of specific and cannot directly associate the user's personal identity.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "When we collect and process the above information, we all conduct de -identification/anonymous processing. The data analysis only corresponds to the identification of a specific and cannot directly associate the user's personal identity."}
{"task": "rw_62.jsonl", "id": 58889, "text": "1.5 Information Browse", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58890, "text": "In order to ensure the quality of the template content recommended by the light camera for you, and recommend the templates and advertisements you may be interested in, light -face camera may collect related necessary information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "To recommend templates and advertisements you might be interested, light -face cameras may collect related necessary information."}
{"task": "rw_62.jsonl", "id": 58891, "text": "The above information includes:", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58892, "text": "The behavior information you operate and use: click, use, share, save to local, search", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58893, "text": "The information you actively provided: like (like), cancel the like (cancel love)", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58894, "text": "Manage personalized content recommendation", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58895, "text": "1.6 Information release and interactive communication", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58896, "text": "(1) You can contact us according to the operating rules of the lightweight camera to become a light -face camera creator. We will basicly review your user identity and creative ability. After the review and passYou can publish your creative design works (for example, style template) in light -looking camera after becoming a light camera creator.", "label": ["First Party Collection Information", "Risk"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58897, "text": "(2) When applying for the authority of the above -face camera creator and/or using the creator identity authentication related services, in accordance with the requirements of laws and regulations and security guarantee, you need to provide real identity information (real name, ID number, phone number, phone number, phone number, phone number, phone number, phone number, phone number) Complete online or offline real -name authentication.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "You need to provide real identity information (real name, ID number, phone number, etc.) to complete the online or offline real -name authentication."}
{"task": "rw_62.jsonl", "id": 58898, "text": "Get the collection/like/like, comment.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "When you publish creative design works or comment on the light camera, we will collect information you posted/comments, and show your nickname, avatar, publishing content, collection of collection/like/like/like, comment."}
{"task": "rw_62.jsonl", "id": 58899, "text": "(4) When you pay attention to your account, browse, comment, follow, collect/like/like/like or share, we will collect your account and the aforementioned information, and display the content of the account publishing.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We will collect your account and the aforementioned information, and show the content of the account publishing."}
{"task": "rw_62.jsonl", "id": 58900, "text": "(5) The information that users are collected by our products or services, such as the information posted by other users may contain some of your information (such as: in the creative design works that collect/like/like/likeRelated information).", "label": ["First Party Collection Information", "Risk"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58901, "text": "1.7 Share and event participation", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58902, "text": "In the case of your sharing or receiving information, participating in activities, we may need to access your shear board and read the passwords, sharing code, and links contained in it to achieve functions or functions such as jumping, sharing, activity linkage or linkage.Serve.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "We may need to access your shear board and read the passwords, sharing codes, and links contained in it to achieve functions or services such as jumping, sharing, and activity linkage."}
{"task": "rw_62.jsonl", "id": 58903, "text": "When you choose to participate in the activities we organized, you can provide information such as name, communication address, contact information, bank account and other information according to the event needs.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect information such as names, communication addresses, contact information, bank accounts and other information for participating in activities."}
{"task": "rw_62.jsonl", "id": 58904, "text": "This information is personal sensitive information, which is necessary for you to receive transfer or gift. If you refuse to provide this information, we may not be able to transfer or distribute gifts to you.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide information related to participating in activities, we may not be able to transfer or distribute gifts to you."}
{"task": "rw_62.jsonl", "id": 58905, "text": "1.8 News notice", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58906, "text": "You know and agree that for your contact information (for example: contact telephone number) provided by you in the process of using the product and/or service, we may send one or more of them in the operation.User news notification, authentication, security verification, user experience research research and other purposes;", "label": ["Usage"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58907, "text": "In addition, we may also provide you with commercial information such as services, functions or activities that you may be interested in by text messages and telephones, but please rest assured that if you do not want to accept this information, you can via your mobile phone.The withdrawal method provided in the SMS can also be contacted directly with us.", "label": ["Edit/Control", "Usage", "Important"], "rewrite": "You can be withdrawing the booking method provided by the mobile phone SMS, or you can contact us directly to the withdrawal."}
{"task": "rw_62.jsonl", "id": 58908, "text": "1.9 Other use information", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58909, "text": "The use information mainly includes: click, focus, collect, search, query, browse, download, share, comment, like (like) and other information generated by using light cameras.", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58910, "text": "1.10 collection and use of personal information purpose changes", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58911, "text": "Please understand that with the development of our business, it may be adjusted and changed to the functions of lightweight cameras and the services provided.", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58912, "text": "In principle, when the new features or services are related to the functions or services we are currently provided, the personal information collected and used will be directly or reasonable to the original processing purpose.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "The personal information collected and used will be directly or reasonable to the original processing purpose."}
{"task": "rw_62.jsonl", "id": 58913, "text": "In the scenario that is not directly or reasonable with the original treatment purpose, we collect and use your personal information will be inform again and obtain your consent.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "In the scenario that is not directly or reasonable with the original treatment purpose, we collect and use your personal information will be inform again and obtain your consent."}
{"task": "rw_62.jsonl", "id": 58914, "text": "1.11 Personal information to obtain consent collection and use in accordance with the law", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58915, "text": "Please understand that in the following situations, according to laws and regulations and related national standards, we collect and use your personal information without obtain your authorization consent:", "label": ["Important", "First Party Collection Information"], "rewrite": "In the following situations, according to laws and regulations and related national standards, we collect and use your personal information without obtain your authorization consent:"}
{"task": "rw_62.jsonl", "id": 58916, "text": "(1) Directly related to national security and national defense security;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting personal information directly related to national security and national defense security does not need to solicit consent."}
{"task": "rw_62.jsonl", "id": 58917, "text": "(2) Directly related to public safety, public health, and major public interests;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect personal information directly related to public safety, public health, and major public interests without soliciting consent."}
{"task": "rw_62.jsonl", "id": 58918, "text": "(3) Directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect direct personal information related to criminal investigation, prosecution, trial, and execution of judgments without asking for consent."}
{"task": "rw_62.jsonl", "id": 58919, "text": "(4) For major legitimate rights and interests such as the life and property of the subject of personal information or other individuals, it is difficult to get my consent;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting and maintaining personal information or major legitimate rights and interests, but it is difficult to obtain personal information that I agree, without asking for consent."}
{"task": "rw_62.jsonl", "id": 58920, "text": "(5) The collected your personal information is made to the public by yourself;", "label": ["Important", "First Party Collection Information"], "rewrite": "The collected your personal information is publicly disclosed to the public by itself without asking for consent."}
{"task": "rw_62.jsonl", "id": 58921, "text": "(6) The personal information collected from the legal public disclosure information, such as legal news reports and government information disclosure;", "label": ["Important", "First Party Collection Information"], "rewrite": "If you collect personal information from the legal disclosure information, you do not need to ask for consent."}
{"task": "rw_62.jsonl", "id": 58922, "text": "(7) Sign or perform the contract according to your requirements;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collection of personal information necessary for signing or performing the contract does not need to solicit consent."}
{"task": "rw_62.jsonl", "id": 58923, "text": "(8) The necessary and stable operations for maintaining software and related services, such as the failure of discovering and disposing of software and related services;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting the personal information necessary for the safe and stable operation of maintenance software and related services, there is no need to solicit consent."}
{"task": "rw_62.jsonl", "id": 58924, "text": "(9) It is necessary for legal news reports;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting the personal information necessary for legal news reports does not need to solicit consent."}
{"task": "rw_62.jsonl", "id": 58925, "text": "(10) Academic research institutions are necessary to carry out statistics or academic research based on public interests, and provide the results of academic research or descriptions, to identify the personal information contained in the result;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting academic research institutions to carry out statistics or academic research in the institute based on public interests, without asking for consent."}
{"task": "rw_62.jsonl", "id": 58926, "text": "(11) Other circumstances stipulated in laws and regulations.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect personal information under other circumstances stipulated in the laws and regulations without asking for consent."}
{"task": "rw_62.jsonl", "id": 58927, "text": "Special reminder you pay attention, if the information cannot be identified alone or in combination with other information, it is not your personal information in the legal sense;", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58928, "text": "When your information can identify your personal identity alone or in combination with other information, or we will not be able to connect with any specific personal information with other personal information combined with other personal information, this information will be used as you during combination.Personal information is handled and protected in accordance with this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58929, "text": "2. How do we use cookie equivalent technologies", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58930, "text": "Similar technologies such as Cookie and Equipment Information Makes are commonly used in the Internet.", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58931, "text": "When you use a light camera and related services, we may use related technologies to send one or more cookies to your device, or anonymous identifier to collect and identify the information when you access and use the product.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may use related technologies to send one or more cookie or anonymous identifiers to your device to collect and identify the information when you access and use this product."}
{"task": "rw_62.jsonl", "id": 58932, "text": "We promise that cookies will not be used for any other purposes other than the purpose of this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58933, "text": "We use cookies and similar technologies to achieve the following functions or services:", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58934, "text": "2.1 Guarantee of the safety and efficient operation of products and services", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58935, "text": "We may set up Cookie, or an anonymous identifier that guarantees security, so that we can confirm whether you log in to the service safely, or whether you encounter stolen, fraud and other illegal acts.", "label": ["Important", "Data Security"], "rewrite": "We may set up Cookie or anonymous identifier that guarantees security and ensure security, so that we can confirm whether you are safely logging in to the service."}
{"task": "rw_62.jsonl", "id": 58936, "text": "These technologies also help us improve service efficiency, improve login and response speed.", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58937, "text": "2.2 Help you get a easier access experience", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58938, "text": "Using this kind of technology can also help you save you to fill in your personal information, repeat the steps and processes of the individual beautification tools, template functions (such as: record filter settings, etc.), steps and processes of entering search content (example: Example:Record search, etc.) to help you get a easier access experience.", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58939, "text": "2.3 COOKIE Clear", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58940, "text": "Most browsers provide users with the function of removing browser cache data. You can perform the corresponding data clearance operation in the browser settings function.", "label": ["Important", "Edit/Control"], "rewrite": "You can perform the corresponding data clearance operation in the browser settings function."}
{"task": "rw_62.jsonl", "id": 58941, "text": "If you clear, you may not be able to use the services or corresponding functions that we depend on Cookie.", "label": ["Important", "Edit/Control"], "rewrite": "If you perform data clearance operations, you may not be able to use the services or corresponding functions that we depend on Cookie provided by us."}
{"task": "rw_62.jsonl", "id": 58942, "text": "3. How do we share, transfer, and publicly disclose personal information", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58943, "text": "3.1 Sharing", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58944, "text": "3.1.1 Sharing Principles", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58945, "text": "(1) The principle of authorization consent:, without your consent, we will not share your personal information. Unless the personal information shared is to identify the information after the processing, and the third party cannot re -identify the natural person.Essence", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Without your consent, we will not share your personal information, unless it is to identify the information after processing, and sharing a third party who cannot re -recognize such information."}
{"task": "rw_62.jsonl", "id": 58946, "text": "If the purpose of third -party information uses information beyond the scope of the original authorization consent, they need to re -obtain your consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If the purpose of third -party information uses information beyond the scope of the original authorization consent, they need to re -obtain your consent."}
{"task": "rw_62.jsonl", "id": 58947, "text": "(2) Principles of legitimate legitimacy and minimum must:, shared data must have a legal and legitimate purpose, and the shared data is limited to the purpose of achieving the goal.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "The shared data must have a legitimate and proper purpose, and the shared data is limited to the purpose."}
{"task": "rw_62.jsonl", "id": 58948, "text": "(3) Principles of security and prudential: We will carefully evaluate the purpose of third -party use of shared information, comprehensively evaluate the security guarantee capabilities of these partners, and require them to follow the legal agreement of cooperation.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will carefully evaluate the purpose of third -party use of shared information, comprehensively evaluate the security and guarantee capabilities of these partners, and ask them to follow the legal agreement of cooperation."}
{"task": "rw_62.jsonl", "id": 58949, "text": "We will strictly monitor the software tool development package (SDK) and application interface (API) that the partners obtain information to protect data security.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will strictly monitor the software tool development package (SDK) and application interface (API) that the partners obtain information to protect data security."}
{"task": "rw_62.jsonl", "id": 58950, "text": "Access to cooperative SDK directory", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58951, "text": "3.1.2 The scope of the partner", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58952, "text": "If the specific functions and scenarios are provided by our affiliates and third parties, the scope of the partner includes our affiliates and third parties.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58953, "text": "3.1.3 commission processing", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58954, "text": "For the scene of commissioning to handle personal information, we will sign the relevant processing agreement with the trustee and cooperation in accordance with the law and supervise the personal information usage activities.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For the scene of commissioning to handle personal information, we will sign the relevant processing agreement with the trustee and cooperation in accordance with the law and supervise the personal information usage activities."}
{"task": "rw_62.jsonl", "id": 58955, "text": "3.1.4 Common processing", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58956, "text": "For the scenario of jointly handling personal information, we will sign relevant agreements with the partners in accordance with the law and agreed that their rights and obligations to ensure that in the process of using relevant personal information and protect the security of data and protect data security.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will sign relevant agreements with the partner and agreed to their respective rights and obligations to ensure that they comply with the relevant provisions of the law and protect data security in the process of using relevant personal information."}
{"task": "rw_62.jsonl", "id": 58957, "text": "3.1.5 Sharing information of function or service", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58958, "text": "(1) When you use the functions provided by our partners in the use of light -face cameras, or when software service providers, smart device providers, system service providers and us provide you with services with usRealize the information necessary for business purposes to show you the information you may be interested in, or push more suitable for your specific functions, services or information.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "We may use the information necessary to use the partner to achieve business purposes to show you the information you may be interested in."}
{"task": "rw_62.jsonl", "id": 58959, "text": "(2) In order to adapt the message push function with the terminal model you use, we may share mobile phone models, versions and related equipment information through SDK and other technologies and terminal equipment manufacturers (Huawei, Xiaomi, OPPO, vivo, etc.).", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "We may share mobile phone models, versions and related equipment information through SDK and other technologies and terminal equipment manufacturers (Huawei, Xiaomi, OPPO, Vivo, etc.)."}
{"task": "rw_62.jsonl", "id": 58960, "text": "(3) Payment function: The payment service in the light face camera is provided to you through SDK or related technologies that cooperate with third -party payment institutions (such as Alipay payment, WeChat payment).", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "The payment services in the light camera are provided to you through SDK or related technologies that cooperate with our third -party payment institutions (such as Alipay Pay, WeChat Pay)."}
{"task": "rw_62.jsonl", "id": 58961, "text": "To this end, we must synchronize your equipment recognition information to these third -party payment institutions.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58962, "text": "In addition, other information (including but not limited to your name, bank card type and card number, validity period, ID number and mobile phone number) for specific payment functions or services will applyIt will directly collect and assume data -related legal liability to you.", "label": ["Risk"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58963, "text": "3.1.6 Data use of safety and analysis statistics", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58964, "text": "(1) Safe security: We attach great importance to accounts, services and content security. In order to ensure the security of your and other users' accounts and property security, so that you and our legitimate rights and interests are exempted from illegal infringement.Equipment, account and log information.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "Our partners may use the necessary devices, accounts and log information."}
{"task": "rw_62.jsonl", "id": 58965, "text": "(2) Analysis of product conditions: In order to analyze the use and performance of our products, our partners may need to use the product's usage (collapse, flashback), equipment identification information, and overall installation of usage.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Our partners may need to use the product's usage (collapse, flashback), equipment identification information, and overall installation of usage."}
{"task": "rw_62.jsonl", "id": 58966, "text": "(3) In order to improve the scientific research capabilities in related fields and promote the level of scientific and technological development, we may use de -identifiable or anonymous data with cooperative scientific research institutes, universities and other institutions under the premise of ensuring that data security and purpose are legitimate.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Under the premise of ensuring data security and purpose, we may use de -identified or anonymous data with cooperative scientific research institutes, universities and other institutions."}
{"task": "rw_62.jsonl", "id": 58967, "text": "3.1.7 Help you participate in marketing promotion activities", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58968, "text": "When you choose to participate in the relevant marketing activities organized by us and our partners, in order to ensure that you can get the same experience in the joint event, or entrust the partner to honor you in time, we and our partners may need to use you to use youThe name, communication address, contact information, bank account, etc. (the information used in different activities may have differences, and the specific rules of the activity shall prevail).", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "We and our partners may need to use your name, communication address, contact information, bank account and other information."}
{"task": "rw_62.jsonl", "id": 58969, "text": "Rejection of the above use may affect your participation in related activities, but it will not affect other functions.", "label": ["Important", "First Party Collection Information"], "rewrite": "Rejection of the above use may affect your participation in related activities, but it will not affect other functions."}
{"task": "rw_62.jsonl", "id": 58970, "text": "3.2 Transfer", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58971, "text": "With the continuous development of our business, we will be likely to carry out mergers, acquisitions, and asset transfer, and your personal information may be transferred as a result.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will be likely to be merged, acquired, asset transfer, and your personal information may be transferred as a result."}
{"task": "rw_62.jsonl", "id": 58972, "text": "When the previous described changes occur, we will follow the laws and regulations and the security standards that are not lower than the security standards stated by the privacy policy.We will ask the Fang Fang to re -obtain your authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When the personal information is transferred, we will ask the recipient to continue to fulfill the obligation of personal information processors. If the party changes the original processing purpose and method of processing, we will ask the following party to re -authorize the consent of authorization."}
{"task": "rw_62.jsonl", "id": 58973, "text": "3.3 Public display", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58974, "text": "(1) We will not disclose your information publicly unless it follows national laws and regulations or obtains your consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not disclose your information publicly unless we follow the national laws and regulations or obtain your consent."}
{"task": "rw_62.jsonl", "id": 58975, "text": "We publicly disclose your personal information to adopt security measures that meet the standards of the industry.", "label": ["Third Party Sharing/ Disclosure", "Data Security"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58976, "text": "(2) When a penalty announcement of illegal accounts and fraud, we may disclose information about the relevant account.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When a punishment announcement of illegal accounts and fraud, we may disclose information about the relevant account."}
{"task": "rw_62.jsonl", "id": 58977, "text": "(3) The works you published publicly (including usage, praise/winning the number of likes, a total of praise/winning), the number of fans, and like (like) will be displayed on the personal homepage.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The works you posted publicly, the number of fans, and the works that like (like) will be displayed on the personal homepage."}
{"task": "rw_62.jsonl", "id": 58978, "text": "3.4 Personal information that obtains consent to sharing, transfer, and publicly disclosed in accordance with the law", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58979, "text": "Please understand that in the following situations, according to laws and regulations and national standards, we shared, transferred, and publicly disclosed your personal information without obtain your authorization consent:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the following situations, according to laws and regulations and national standards, we shared, transferred, and publicly disclosed your personal information without obtain your authorization consent:"}
{"task": "rw_62.jsonl", "id": 58980, "text": "(1) For the contract for the contract to establish and fulfill your contract as a party, or implement human resource management in accordance with the labor rules and regulations and collective contracts signed in accordance with the law in accordance with the law;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The personal information necessary for sharing and fulfilling the contract does not need to ask for consent."}
{"task": "rw_62.jsonl", "id": 58981, "text": "(2) To fulfill the statutory duties or the requirements of the statutory volunteer;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "It is not necessary to solicit consent to sharing and performing the personal information of statutory duties or the required personal information necessary for the statutory duty."}
{"task": "rw_62.jsonl", "id": 58982, "text": "(3) Directly related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Personal information directly related to national security and national defense security does not need to solicit consent."}
{"task": "rw_62.jsonl", "id": 58983, "text": "(4) Directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Direct related personal information such as criminal investigation, prosecution, trial and judgment execution does not need to solicit consent."}
{"task": "rw_62.jsonl", "id": 58984, "text": "(5) In order to deal with emergencies, or in emergency situations, it is necessary to protect the health and property safety of natural people;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Personal information to shared the public health incidents does not need to ask for consent."}
{"task": "rw_62.jsonl", "id": 58985, "text": "(6) Implement news reports, public opinion supervision and other behaviors for public interests, and handle personal information within a reasonable scope;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to implement news reports and public opinion supervision, deal with personal information within a reasonable scope without soliciting consent."}
{"task": "rw_62.jsonl", "id": 58986, "text": "(7) Process your own personal information in accordance with relevant laws and regulations;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "It does not need to solicit legal information in accordance with relevant laws and regulations."}
{"task": "rw_62.jsonl", "id": 58987, "text": "(8) Collect personal information from the information disclosed legal and publicly disclosed;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you collect personal information from the legal disclosure information, you do not need to ask for consent."}
{"task": "rw_62.jsonl", "id": 58988, "text": "(9) Other circumstances stipulated in laws and administrative regulations.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Collect personal information under other circumstances stipulated in laws and administrative regulations without asking for consent."}
{"task": "rw_62.jsonl", "id": 58989, "text": "4. How do we store personal information", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58990, "text": "4.1 Storage location", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58991, "text": "In accordance with the provisions of laws and regulations, we will store your personal information collected and generated during the domestic operation process in the territory of the People's Republic of China.", "label": ["Data Retention", "Important"], "rewrite": "Your personal information that will be collected and generated during the domestic operation is stored in the territory of the People's Republic of China."}
{"task": "rw_62.jsonl", "id": 58992, "text": "At present, we will not transmit the above information overseas. If we transmit to overseas, we will follow relevant state regulations or solicit your consent.", "label": ["Data Retention", "Important"], "rewrite": "We will not transmit the above information abroad. If we transmit to overseas, we will follow relevant state regulations or solicit consent."}
{"task": "rw_62.jsonl", "id": 58993, "text": "4.2 Storage period", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 58994, "text": "4.2.1, we only retain your personal information during the period of time for the purpose of providing light appearance and related services: the information you publish, like (like/collection) and related information, you have not withOr when we did not cancel the account, we will retain relevant information.", "label": ["Data Retention", "Important"], "rewrite": "We only retain your personal information during the period for providing light cameras and related services."}
{"task": "rw_62.jsonl", "id": 58995, "text": "After exceeding the necessary period, we will delete or processes your personal information, except for other regulations.", "label": ["Data Retention", "Important"], "rewrite": "After exceeding the necessary period, we will delete or processes your personal information, except for other regulations."}
{"task": "rw_62.jsonl", "id": 58996, "text": "4.2.2, if you cancel your account, take the initiative to delete your personal information, or go beyond the necessary period, we will delete or processes your personal information, except for the following situations:", "label": ["Data Retention", "Edit/Control", "Important"], "rewrite": "If you cancel your account, actively delete your personal information, or exceed the necessary period, we will delete or become anonymous, except for the following situations:"}
{"task": "rw_62.jsonl", "id": 58997, "text": "(1) Comply with the requirements for information retention of laws and regulations (for example: the \"E -commerce Law\" stipulates that the time for the saving time of goods and service information and transaction information is not less than three years from the date of completion of the transaction).", "label": ["Data Retention", "Important"], "rewrite": "If you comply with the requirements for information retention of laws and regulations, you do not need to delete or deal with it anonymous."}
{"task": "rw_62.jsonl", "id": 58998, "text": "(2) For the purpose of finance, auditing, and dispute resolution, the period needs to be reasonably extended.", "label": ["Data Retention", "Important"], "rewrite": "If you need to extend the deadline reasonably for the purpose of finance, auditing, and dispute resolution, no delete or anonymous treatment is required."}
{"task": "rw_62.jsonl", "id": 58999, "text": "5. How can we protect the security of personal information", "label": ["Data Security"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 59000, "text": "(1) We attach great importance to your personal information security, and we will strive to take reasonable security measures (including technical and management) to protect your personal information and prevent your personal information from being used in improperly or in unauthorized situations.It was interviewed, publicly disclosed, used, modified, damaged, lost or leaked.", "label": ["Important", "Data Security"], "rewrite": "We attach great importance to the security of your personal information, and we will strive to take reasonable security measures (including technology and management) to protect your personal information."}
{"task": "rw_62.jsonl", "id": 59001, "text": "(2) We will use the encryption technology, anonymous treatment, and related reasonable and feasible methods that are not lower than industry peers to protect your personal information, and use a security protection mechanism to prevent your personal information from being maliciously attacked.", "label": ["Important", "Data Security"], "rewrite": "We will use related reasonable and feasible means to protect your personal information and use a security protection mechanism to prevent your personal information from being maliciously attacked."}
{"task": "rw_62.jsonl", "id": 59002, "text": "(3) We will establish a special security department, security management system, and data security process to ensure your personal information security.", "label": ["Important", "Data Security"], "rewrite": "We will establish a special security department, security management system, and data security process to ensure your personal information security."}
{"task": "rw_62.jsonl", "id": 59003, "text": "We adopt strict data use and access systems to ensure that only authorized personnel can access your personal information and conduct security audits of data and technology in a timely manner.", "label": ["Important", "Data Security"], "rewrite": "We adopt strict data use and access systems to ensure that only authorized personnel can access your personal information and conduct security audits of data and technology in a timely manner."}
{"task": "rw_62.jsonl", "id": 59004, "text": "(4) Although the above -mentioned reasonable and effective measures have been taken and the standards required by relevant legal regulations have been adopted, please understand that due to the technical restrictions and various malicious means that there may beSecurity measures cannot always ensure that the information is 100 % security. We will try our best to ensure the security of our personal information.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 59005, "text": "(5) You know and understand that the system and communication network you used to access our services may have problems due to factors outside the control scope.", "label": ["Important", "Data Security"], "rewrite": "The systems and communication networks you use to connect to our services may have problems due to factors outside the controlled range."}
{"task": "rw_62.jsonl", "id": 59006, "text": "Therefore, we strongly recommend that you take positive measures to protect the security of personal information, including but not limited to the use of complex passwords, regularly modify the password, do not disclose your account password and related personal information to others.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 59007, "text": "(6) We will develop an emergency treatment plan and immediately start the emergency plan when the user information security incident occurs, and strive to prevent the impact and consequences of these security events expand.", "label": ["Important", "Data Security"], "rewrite": "We will develop an emergency treatment plan and immediately start the emergency plan when the user information security incident occurs."}
{"task": "rw_62.jsonl", "id": 59008, "text": "Once the user information security incident (leaked and lost) occurs, we will inform you in a timely manner in accordance with the requirements of the laws and regulations: the basic situation and possible impact of security incidents, the disposal measures we have taken or we will takeAnd reducing risk suggestions, remedy measures for you.", "label": ["Important", "Data Security"], "rewrite": "Once the user information security incident (leaked and lost) occurs, we will inform you in time: basic situations and possible impacts, disposal measures, suggestions, remedy measures."}
{"task": "rw_62.jsonl", "id": 59009, "text": "We will promptly inform you of the incident -related situation with push notifications, emails, letters, text messages, and related forms. When it is difficult to inform them one by one, we will publish a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "We will inform you of the incident -related situation in time. When it is difficult to inform them one by one, we will publish an announcement in a reasonable and effective way."}
{"task": "rw_62.jsonl", "id": 59010, "text": "At the same time, we will also report to the disposal of user information security incidents in accordance with the requirements of the relevant regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "We will also report to the disposal of user information security incidents in accordance with the requirements of the relevant regulatory authorities."}
{"task": "rw_62.jsonl", "id": 59011, "text": "(7) Once you leave the lightweight camera and related services, browse or use other websites, services and content resources, we will not be able to protect your software and any individual submitted by the software and related services outside the lightweight camera and related services.Information, whether you log in, browse or use the above software, whether the website is based on the link or guidance of a light camera.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 59012, "text": "6. Personalized recommendation", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 59013, "text": "In order to show you and recommend more information, provide services that meet your needs. Light -looking opportunities to collect and use your personal information to automatically calculate and predict your preferences through computer algorithm modelsFor information or other services, we will explain to you in detail the operating mechanism of the personalized product service and the way you implement control.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Light -looking opportunities to collect and use your personal information to automatically calculate and predict your preferences through computer algorithm models to match interested information or other services."}
{"task": "rw_62.jsonl", "id": 59014, "text": "6.1 Personalized recommendation mechanism", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 59015, "text": "(1) The scope of our personalized recommendation services is [display template content, display search results, display advertising content].", "label": ["Important", "Usage"], "rewrite": "The scope of our personalized recommendation services is [display template content, display search results, display advertising content]."}
{"task": "rw_62.jsonl", "id": 59016, "text": "(2) In order to predict your preferences, we may collect and use your equipment information and behavior information when using the product. Behavioral information includes your click, use, sharing, stored, stored to local, collection when you visit/use the product.(Like), cancel collection (cancel your favorite) behavioral information and operation related records.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may collect and use your device information and the behavior information when using the product to predict preferences."}
{"task": "rw_62.jsonl", "id": 59017, "text": "(3) We can automatically analyze the above information through the computer algorithm, extract your user characteristics after calculating, and then predict the content of the content of the content in the information candidate with other relevant characteristics, and select the content based on the results of the prediction.And sorting.", "label": ["Important", "Usage"], "rewrite": "We use automatic analysis and calculation of the above information to extract your user characteristics, and then predict the preferences of preferences based on other relevant characteristics, and select and sort the content based on the results of the prediction."}
{"task": "rw_62.jsonl", "id": 59018, "text": "After the processing of heavy, dispersing, etc., the final content recommendation list is displayed to you in turn.", "label": ["Usage"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 59019, "text": "(4) We will provide real -time feedback on the recommendation model based on your browsing behavior in the process of using the product, and constantly adjust the optimization results to better provide you with high -quality content.", "label": ["Important", "Usage"], "rewrite": "We will give real -time feedback on the recommendation model based on your browsing behavior in the process of using the product, and constantly adjust the optimization results to better provide you with high -quality content."}
{"task": "rw_62.jsonl", "id": 59020, "text": "6.2 Personalized recommendation control and management", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 59021, "text": "Receive information autonomous controllable", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 59022, "text": "We will use the recommendation algorithm to personalize and display the information content you browse. You can control the personalized recommendation of information content in the following way:", "label": ["Edit/Control", "Important"], "rewrite": "We will use the recommendation algorithm to personalize and display the information content you browse."}
{"task": "rw_62.jsonl", "id": 59023, "text": "6.2.1 Autonomous decision to receive personalized recommendation content:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 59024, "text": "(1) You can through the \"1., 1.5\" clause in the privacy policy [Management Personalized Content Recommendation] or through a light-looking camera mobile client [Camera Settings]-, [Personalized Recommendation Settings]The provided path opens or close the personalized content recommendation function.", "label": ["Edit/Control", "Important"], "rewrite": "You can use [Manageed Personalized Content Recommendation] under the \"1. -1.5\" clause in this privacy policy, or through the lightweight camera mobile client [Camera Settings] - [Personalized Recommendation Settings] provided to personalized personalityThe content recommendation function is turned on or closed."}
{"task": "rw_62.jsonl", "id": 59025, "text": "You can choose to close all personalized content recommendations for one click. When you choose to close all personalized content recommendation, you will no longer show you \"recommendation\" content. You cannot enjoy personalized recommendation services, but you can continue to browse attention, hotspotsWait for non -personalized recommendation content.", "label": ["Important", "Edit/Control"], "rewrite": "You can choose to close the personalized content recommendation. When you choose to close, you will no longer show you \"recommendation\" content. You cannot enjoy personalized recommendation services, but you can continue to browse non -personalized recommendation content."}
{"task": "rw_62.jsonl", "id": 59026, "text": "(2) You can also choose to partially close personalized recommendations. You can close personalized recommendations based on search results or pay attention. After partial closure of personalized recommendation functions, we will not use the corresponding information to make personalized recommendations to you.", "label": ["Important", "Edit/Control"], "rewrite": "You can also choose to partially close personalized recommendations. After partial closure of personalized recommendation functions, we will not use the corresponding information to make personalized recommendations to you."}
{"task": "rw_62.jsonl", "id": 59027, "text": "(3) When you are not interested in specific information or want to reduce some types of information, you can put forward your opinions and suggestions through [Camera Settings]-[Opinion Feedback] through a light-face camera. We will be based on you based on youFeedback adjustment strategy.", "label": ["Important", "Edit/Control"], "rewrite": "You can reducing certain types of information push through a light camera mobile client [camera settings]-[feedback] path."}
{"task": "rw_62.jsonl", "id": 59028, "text": "6.2.2, the information required for autonomous subscription: In the follow -up function, you will choose to follow the account number according to your initiative. You can choose to pay attention or cancel your attention.", "label": ["Important", "Edit/Control"], "rewrite": "In the follow -up function, you will take the initiative to focus on the account to display, and you can choose to pay attention or cancel your attention."}
{"task": "rw_62.jsonl", "id": 59029, "text": "6.2.3, when you are not interested in content, you can also enter the keywords interested in the search bar, click and read the search results.", "label": ["Important", "Edit/Control"], "rewrite": "You can also enter the keywords interested in the search bar, click and read the search results."}
{"task": "rw_62.jsonl", "id": 59030, "text": "6.2.4 Manage your personalized advertising push", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 59031, "text": "In order to provide you with free and high -quality services, we will show you as much as possible to you as much as possible according to the situation where you use related services. At the same time, we will strive to ensure that dataSafety.", "label": ["Important", "Usage"], "rewrite": "We will show you as much as possible according to the situation where you use related services to advertise that you may be more interested and corrected. At the same time, we will strive to ensure the security of data."}
{"task": "rw_62.jsonl", "id": 59032, "text": "Autonomous decision to receive personalized advertising information: Personalized advertising is one of the advertising display technology, and the advertisers are intelligent recommendation based on your preferences in its application.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 59033, "text": "You can choose to close or open a personalized advertisement in \"Settings\" - \"Settings\" - \"Personalized Recommendation Settings\". When you close, you no longer receive such personalized advertisements, but you will stillSeeing advertisements, the number of advertisements will not change, but the correlation of advertising will be reduced.", "label": ["Important", "Edit/Control"], "rewrite": "You can select whether to close or open a personalized advertisement in the \"lightweight camera\" - \"setting\" - \"personalized recommendation settings\"."}
{"task": "rw_62.jsonl", "id": 59034, "text": "7. Manage your personal information", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 59035, "text": "We attach great importance to your management of personal information and do our best to protect your personal information inquiry, access, modification, delete, withdrawn, withdrawing, canceling account numbers, complaint reports, and setting up privacy functions to make you capableGuarantee your privacy and information security.", "label": ["Important", "Edit/Control"], "rewrite": "We attach great importance to your management of personal information and do our best to protect your rights to query, access, modify, delete, delete, withdraw, withdraw, cancel account number, complain report, and set privacy functions for your personal information."}
{"task": "rw_62.jsonl", "id": 59036, "text": "7.1 Change or withdraw the scope of authorization", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 59037, "text": "(1) You can turn off the camera (camera), microphone (recording), album (storage) permissions in the device operating system, change the scope of consent or withdraw your authorization.", "label": ["Important", "Edit/Control"], "rewrite": "You can turn off the camera (camera), microphone (recording), album (storage) permissions in the device operating system to change the consent range or withdraw your authorization."}
{"task": "rw_62.jsonl", "id": 59038, "text": "After withdrawal authorization, we will no longer collect information related to these permissions.", "label": ["Important", "First Party Collection Information", "Edit/Control"], "rewrite": "After withdrawal authorization, we will no longer collect information related to these permissions."}
{"task": "rw_62.jsonl", "id": 59039, "text": "(2) Specific business functions and services will need your information to be completed. When you withdraw from consent or authorization, we cannot continue to provide you with the function and services corresponding to the withdrawal consent or authorization, and no longer handle your corresponding correspondencepersonal information.", "label": ["Important", "First Party Collection Information", "Edit/Control"], "rewrite": "Specific business functions and services will need your information to complete. When you withdraw consent or authorization, we cannot continue to provide corresponding functions and services, and we will not process your corresponding personal information."}
{"task": "rw_62.jsonl", "id": 59040, "text": "But your decision to withdraw consent or authorization will not affect the personal information processing we carried out based on your authorization.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "The decision you withdraw from consent or authorization will not affect the personal information processing we carried out based on your authorization."}
{"task": "rw_62.jsonl", "id": 59041, "text": "7.2 Visit, delete, correct your personal information", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 59042, "text": "(1) You can access your avatar and user nickname in [Style]-[Style Community]-[My] Page;", "label": ["Important", "Edit/Control"], "rewrite": "You can visit your avatar and user nickname in [Style]-[Style Community]-[Mine]."}
{"task": "rw_62.jsonl", "id": 59043, "text": "(2) You can visit and cancel your (like) information in [Mine]-[Like];", "label": ["Important", "Edit/Control"], "rewrite": "You can access and cancel your (like) information in [Mine]-[Like]."}
{"task": "rw_62.jsonl", "id": 59044, "text": "(3) You can access and query the account information you follow in [Mine]-[Following], click the \"Follow\" button after clicking on the list of followers, you can choose to cancel the account number;", "label": ["Edit/Control", "Important"], "rewrite": "You can access and query the account information you follow and query, and click the \"Follow\" button after clicking the corresponding account."}
{"task": "rw_62.jsonl", "id": 59045, "text": "Due to the consideration of security and identification, you may not be able to modify some registered information that submit or use during the registration process (after the real -name authentication information);", "label": ["Important", "Edit/Control"], "rewrite": "You may not be unable to modify some registered information submitted during the registration or use during the registration (information after the real -name authentication)."}
{"task": "rw_62.jsonl", "id": 59046, "text": "If you really need to modify this type of information, please feedback through the [camera settings]-[opinion feedback and report] path of the mobile client of the light camera.Reply or process.", "label": ["Important", "Edit/Control"], "rewrite": "Please make a modification opinion through the [Camera Settings]-[Opinion Feedback and Report] through a light-face camera mobile client. We will reply or processed in time within 15 working days after receiving your contact."}
{"task": "rw_62.jsonl", "id": 59047, "text": "In addition to the above, if you have any claims, requirements or questions to the right to personal information given by relevant laws and regulations, you can use [camera settings]-[feedback and report] or send emails to ulikesupport@Faceu.comContact us, we will review the issues involved as soon as possible, and reply within 15 working days after verifying your user identity.", "label": ["Important", "Contact Information", "Edit/Control"], "rewrite": "You can contact us through [camera settings]-[feedback and report] or send emails to ulikesupport@faceu.com."}
{"task": "rw_62.jsonl", "id": 59048, "text": "7.3 Logging out account", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 59049, "text": "iOS User: You can cancel accounts in [Camera Settings]-[Account Logging up].", "label": ["Important", "Edit/Control"], "rewrite": "iOS User: You can cancel accounts in [Camera Settings]-[Account Logging up]."}
{"task": "rw_62.jsonl", "id": 59050, "text": "Before you cancel your account, we will verify your personal identity, security status, equipment information, etc. you have authorized us.", "label": ["Edit/Control", "Data Security", "Important"], "rewrite": "Before you cancel your account, we will verify your personal identity, security status, equipment information, etc. you have authorized us."}
{"task": "rw_62.jsonl", "id": 59051, "text": "For the process and content of the injection, see \"Light Camera Account Logging out\".", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 59052, "text": "You know and understand that the behavior of canceling the account is irreversible. When you log out the account, we will delete relevant information about you. If you delete personal information, it is difficult to achieve technically, we will perform anonymous processing, or stop removing removing removalIn addition to the storage and necessary safety protection measures, the laws and regulations are otherwise stipulated.", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "When you cancel your account, we will delete the relevant information about you. If it is difficult to achieve technically, anonymous treatment will be performed, or it will be processed in addition to storage and adopting necessary safety protection measures, but there are other laws and regulations.Except for regulations."}
{"task": "rw_62.jsonl", "id": 59053, "text": "Android user: You can apply for a light-looking camera account through the [Camera Settings]-[Opinion Feedback and Report] through the lightweight camera mobile client.Reply to your request within the time limit required by working days or laws and regulations.", "label": ["Important", "Edit/Control"], "rewrite": "You can apply through the [Camera Settings]-[Feedback and Report] by the lightweight camera mobile client."}
{"task": "rw_62.jsonl", "id": 59054, "text": "Before you cancel your account, we will verify your personal identity, security state, equipment information, etc.", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "Before you cancel your account, we will verify your personal identity, security state, equipment information, etc."}
{"task": "rw_62.jsonl", "id": 59055, "text": "You know and understand that the cancellation account is an irreversible behavior. When you cancel your account, we will delete relevant information about you or make promise, except for the laws and regulations.", "label": ["Important", "Edit/Control"], "rewrite": "Logging out the account is an irreversible behavior. When you cancel your account, we will delete relevant information about you or perform anonymous processing, except for the laws and regulations."}
{"task": "rw_62.jsonl", "id": 59056, "text": "7.4 Complaint Report", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 59057, "text": "In some business functions of lightweight cameras and related services, we may make decisions based on non -artificial automatic decision -making mechanisms including information systems, algorithms, etc. If these decisions significantly affect your legitimate rights and interests, you have the right to ask us to make us to make Explanation, we will also provide appropriate relief methods.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 59058, "text": "For your reasonable requests, we will not charge any fees in principle.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 59059, "text": "However, we will charge a certain cost fee depending on the actual situation for requests that repeat and beyond the reasonable limit.", "label": ["Important", "Edit/Control"], "rewrite": "We will charge a certain cost fee depending on the actual situation for requests that repeat and beyond a reasonable limit."}
{"task": "rw_62.jsonl", "id": 59060, "text": "We may refuse to reject the risks or very unrealistic requests for unseen repetitive and too many technical means (if you need to develop a new system or fundamentally change the current management), bring risks or very unrealistic requests to others.", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "We may refuse to reject the risk or very unrealistic request for the unprecedented repetition, too much technical means, and a very unrealistic request to the legitimate rights and interests of others."}
{"task": "rw_62.jsonl", "id": 59061, "text": "You can complain or report in accordance with our publicity system.", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 59062, "text": "If you think your personal information rights may be infringed, or you can find a clue to infringe your right to personal information, you can use a lightweight camera mobile client [camera settings]-[feedback and report] or send emails to UlikeSupport@Faceu.COM contacts us, we will review the issues involved as soon as possible, and reply within 15 working days after verifying your user identity.", "label": ["Edit/Control", "Contact Information", "Important"], "rewrite": "You can get in touch with us through a light-face camera mobile client [camera settings]-[feedback and report] or send email to ulikesupport@Faceu.com."}
{"task": "rw_62.jsonl", "id": 59063, "text": "7.5 Visiting Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 59064, "text": "(1) You can check all the contents of this privacy policy on the [Camera Settings] page, official website, etc. on the login page or on the [Camera Settings] page of the light camera mobile client.", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 59065, "text": "(2) Please understand that the light -looking camera and related services described in this privacy policy may be different according to factors such as the equipment models, system versions, software application versions you use.", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 59066, "text": "The final product and service are subject to the lightweight camera and related services you use.", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 59067, "text": "7.6 Stopping operations to inform you", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 59068, "text": "If we stop operations, we will stop collecting your personal information in time, notify you in the form of notification of operation in the form of delivery or announcement one by one, and delete or processes your personal information.", "label": ["Important", "Cessation of Operations"], "rewrite": "If we stop operation, we will stop collecting your personal information in time, stop operation notifications, and delete or anonymous processing of your personal information."}
{"task": "rw_62.jsonl", "id": 59069, "text": "8. Terms of minors", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 59070, "text": "(1) If you are a minor under the age of 18, you should read and agree with your parents or other guardians under the supervision and guidance of your parents or other guardians before using lightweight cameras and related services.", "label": ["Specific Audiences", "Important"], "rewrite": "Uesters under 18 years of age should be read and agreed with their privacy policies under the supervision and guidance of your parents or other guardians before they use light -face cameras and related services."}
{"task": "rw_62.jsonl", "id": 59071, "text": "(2) If you are a guardian of a minor under the age of 14, you should read and agree to your privacy policy for your guardian before using lightweight cameras and related services.", "label": ["Specific Audiences", "Important"], "rewrite": "The guardians of minors under the age of 14 should read and agree to the privacy policy for your guardian before using light -face cameras and related services."}
{"task": "rw_62.jsonl", "id": 59072, "text": "(3) In accordance with the provisions of relevant national laws and regulations, we can protect the personal information of minors in accordance with the provisions of the relevant national laws and regulations, and will only collect, use, share or disclose minors to collect, use, share, or disclose minors when legal permission, parents or other guardians need to protect or protect minors.Personal information;", "label": ["Specific Audiences", "Important"], "rewrite": "We will only collect, use, share, or disclose personal information of minors when legal permission, parents or other guardians need to collect or protect minors."}
{"task": "rw_62.jsonl", "id": 59073, "text": "If we find that the personal information of minors is collected without the consent of parents or other guardians who can be proven in advance, we will try to delete relevant information as soon as possible.", "label": ["Specific Audiences", "Important"], "rewrite": "If we find the personal information of minors without obtaining confirmation in advance, we will try to delete relevant information as soon as possible."}
{"task": "rw_62.jsonl", "id": 59074, "text": "(4) If you are the guardian of a minor, when you have any questions about the personal information of the minors you monitor, please contact us through the contact information of the privacy policy.", "label": ["Specific Audiences", "Important"], "rewrite": "When the guardians of the minor have related questions about the personal information of the monitored minors, please contact us through the contact information of the privacy policy."}
{"task": "rw_62.jsonl", "id": 59075, "text": "9. Amendment and Notice of Privacy Policy", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 59076, "text": "(1) In order to provide you with better services, light -face cameras and related services will be updated and changed from time to time. We will revise this privacy policy in a timely manner. These amendments constitute a part of the privacy policy and have the effect of equivalent privacy policy.Without your clear consent, we will not reduce the rights you should enjoy based on the current privacy policy that take effect.", "label": ["Policy Change", "Important"], "rewrite": "Without your clear consent, we will not cut off the rights you should enjoy based on the current privacy policy that take effect."}
{"task": "rw_62.jsonl", "id": 59077, "text": "(2) After the privacy policy is updated, we will issue a updated version in the lightweight camera, and remind you of the updated content in an appropriate manner before the updated terms take effect, so that you can understand the latest version of this privacy policy in time.", "label": ["Policy Change", "Important"], "rewrite": "After this privacy policy is updated, we will issue a updated version in the lightweight camera, and remind you of the updated content in an appropriate way before taking effect, so that you can understand the latest version in time."}
{"task": "rw_62.jsonl", "id": 59078, "text": "If you continue to use our service, you agree to accept the content of the policy after the revised, but if the updated content needs to collect personal sensitive information such as audio and video, contact information, geographical location, etc., you will still solicit your consent again in a significant way. Essence", "label": ["Policy Change", "Important", "Risk"], "rewrite": "Continue to use our services to represent the content of the revised policy."}
{"task": "rw_62.jsonl", "id": 59079, "text": "(3) For major changes, we will also provide a more significant notice (we will explain the specific changes to the privacy policy through the methods including but not limited to mail, text messages, private messages, or special prompts on the browsing page).", "label": ["Policy Change", "Important"], "rewrite": "For major changes, we will also provide a more significant notice."}
{"task": "rw_62.jsonl", "id": 59080, "text": "\"Material changes\" referred to in this Privacy Policy include, but are not limited to:", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 59081, "text": "a. Significant changes in our service model.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 59082, "text": "Such as the purpose of handling personal information, the type of personal information of the processing, the way of use of personal information, etc.;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 59083, "text": "b. We have changed significantly in the aspects of ownership structure and organizational structure.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 59084, "text": "Such as changes in ownership caused by business adjustment, bankruptcy mergers and acquisitions, etc.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 59085, "text": "c. The main objects of personal information sharing, transfer or public disclosure have changed;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 59086, "text": "d. You participate in the right of personal information processing and its exercise methods have undergone major changes;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 59087, "text": "e. When there are changes in the responsible department, contact information and complaint channels that we are responsible for handling personal information security.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 59088, "text": "10. Scope of application", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 59089, "text": "This privacy policy is suitable for all the light camera -related services provided by Shenzhen Facemeng Technology Co., Ltd. and its related parties.Product or service.", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 59090, "text": "This privacy policy is not applicable::", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 59091, "text": "(1) Products or services of other related parties or third parties may include other products or websites linking to the products or websites and advertising content of the products displayed to you in personalized recommendations;", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 59092, "text": "(2) Other third parties who advertise and promote the products and services of Qingyan Camera.", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 59093, "text": "You use the products and services provided by our related parties or third parties (including any personal information you provided to it), and will be subject to the provision of the service clauses and privacy policy of our affiliated parties or third -party service clauses (not thisPrivacy policy), please read the terms of our affiliated parties or third parties.", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 59094, "text": "Please protect your personal information properly and provide it with it.", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 59095, "text": "If you have any questions, opinions, or suggestions for the content of this privacy policy, you can contact us through [Camera Settings]-[Feedback and Report] or send emails to ulikesupport@faceu.com through a light-face camera mobile client.", "label": ["Important", "Contact Information"], "rewrite": "You can contact us through [Camera Settings] - [Feedback and Report] in Qingyan Camera mobile client or send an email to ulikesupport@faceu.com."}
{"task": "rw_62.jsonl", "id": 59096, "text": "11. Contact us", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_62.jsonl", "id": 59097, "text": "If you have complaints, suggestions, or questions about personal information protection, you can send them to (ulikesupport@faceu.com or Dataprivacy@bytedance.com) or mail them to the following addresses:", "label": ["Important", "Contact Information"], "rewrite": "You can send the problem to (ulikesupport@Faceu.com or dataprivacy@bytedance.com)."}
{"task": "rw_62.jsonl", "id": 59098, "text": "China Satellite Communications Building in Haidian District, Beijing, Ministry of Legal Affairs, Data Security and Privacy Protection Center", "label": ["Important", "Contact Information"], "rewrite": "You can mail the question to: Data Security and Privacy Protection Center of the Ministry of Legal Affairs of China Satellite Communications Building, Haidian District, Beijing."}
{"task": "rw_62.jsonl", "id": 59099, "text": "We will review the issues involved as soon as possible and reply within 15 working days after verifying your user identity.", "label": [], "rewrite": []}
{"task": "rw_62.jsonl", "id": 59100, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
