{"task": "rw_69.jsonl", "id": 61102, "text": "Taobao privacy policy", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61103, "text": "Update date: [2022] Year [04] month [02] Day", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61104, "text": "【introduction】", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61105, "text": "You are welcome to use our products and services!", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61106, "text": "We know the importance of personal information to you. Your trust is very important to us. We will strictly abide by laws and regulations to take corresponding security protection measures to protect your personal information security and controlling.", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61107, "text": "Based on this, Taobao's service provider (or \"we\") formulates this \"Taobao Privacy Policy\" (hereinafter referred to as \"this policy\"/\"this privacy policy\") to help you fully understand the use of our products and services in your product and service.In the process, how will we collect, use, share, store, and protect your personal information, as well as how you can manage your personal information so that you can make better choices.", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61108, "text": "Before you start using our products and services, please read and understand this policy carefully. In particular, we should focus on reading the clauses we logging in the threatening of the body/coarse body to ensure that you fully understand and agree to use it before starting to use.", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61109, "text": "The professional vocabulary involved in this policy, we try to explain to you in a concise and popular expression in order to facilitate your understanding.", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61110, "text": "If you have any questions, opinions or suggestions on the content of this policy, you can contact us through the contact information at the end of this policy.", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61111, "text": "You agree that the privacy policy said that you have understood the functions provided by the application, and the necessary personal information required for functional operation, and give corresponding collection and use authorization, but it does not mean that you have agreed to open up additional functions and handle non -necessary personal information.The opening, processing non -necessary personal information and processing sensitive personal information, we will solicit your consent separately according to your actual usage.", "label": ["Policy Change", "Important"], "rewrite": "You agree that the privacy policy said that you need to understand the necessary personal information you need to collect functions and authorize, but it does not mean that you agree to open up additional functions and handle non -necessary personal information. We will solicit your consent separately."}
{"task": "rw_69.jsonl", "id": 61112, "text": "This privacy policy will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61113, "text": "1. Scope of application", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61114, "text": "2. Information collection and use", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61115, "text": "3. Provide information to the outside world", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61116, "text": "Fourth, your rights", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61117, "text": "5. Storage of information", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61118, "text": "6. Policy update", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61119, "text": "7. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61120, "text": "Eight, contact us", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61121, "text": "Appendix: Related Definition", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61122, "text": "1. Scope of application", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61123, "text": "This policy is applicable to the products and services provided by the Taobao service providers with new forms provided to you with new forms that emerge with technology development.", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61124, "text": "For example, we use Taobao's products or services in the products or services of affiliated companies (such as logging in with Taobao platform accounts), but those who have not set up independent privacy policies will also apply for this part of the product or service.", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61125, "text": "We and affiliated companies have a privacy policy for the products or services that they provided to you (such as \"Tmall Privacy Policy\" and \"Flying Pig Privacy Policy\"), and the corresponding privacy policy is applicable to the corresponding products or services.", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61126, "text": "In addition to the relevant information collection and use activities described by this policy, this policy is not applicable to other services you provided by Taobao sellers and other third directions. Other services apply to the personal information collection and use rules that they explain to you.", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61127, "text": "For example, when you join the seller or brand member, the use of such sellers or brands to use the rules that they specifically explained to you.", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61128, "text": "2. Information collection and use", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61129, "text": "When you use our products/services, the personal information we need/may need to collect and use includes the following:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61130, "text": "1. In order to realize the basic functions of providing you with our products and/or services, you must authorize us to collect and use the necessary information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61131, "text": "If you refuse to provide the corresponding information, you will not be able to use our products and/or services normally;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61132, "text": "2. In order to provide you with additional functions to our products and/or services, you can choose to agree or disagree with the information we collected and used alone.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61133, "text": "If you refuse to provide it, you will not be able to use related additional functions normally or cannot achieve the functional effects we intend to achieve, which will not affect your basic functions.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61134, "text": "We are here to remind you that we are committed to creating a variety of products and services to meet your needs.", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61135, "text": "Because there are many types and services we provide to you, and there are differences in the scope of the specific product/service selected by different users, the basic/additional functions and the personal information types and scope of personal information and use will be different. Please use specific ones.Product/service function shall prevail.", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61136, "text": "The specific feature scenarios we will provide you include::", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61137, "text": "(1) Help you become our member and account management", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61138, "text": "1. Basic member service", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61139, "text": "We provide you based on Taobao platform accounts.", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61140, "text": "In order to create Taobao platform accounts, you need to provide us with at least your mobile phone number, the membership name and password you want to use.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "To create an account, you need to provide your mobile phone number, the membership name and password you are going to use."}
{"task": "rw_69.jsonl", "id": 61141, "text": "If you refuse to provide the above information, you will not be able to register the Taobao platform account, you can only use browsing and search services.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you do not provide your mobile phone number, the membership name and password you want to use, you can only use browsing and search services."}
{"task": "rw_69.jsonl", "id": 61142, "text": "We will determine your current level based on the use of your Taobao platform account and the account level computing rules set by the platform, and provide you with the basic equity corresponding to the corresponding account level.", "label": ["Important", "Usage"], "rewrite": "Determine your level based on your Taobao platform account usage and calculation rules, and provide you with basic rights and interests."}
{"task": "rw_69.jsonl", "id": 61143, "text": "2. Additional member service", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61144, "text": "Special membership rights: If you choose to fill in the real name, gender, date of birth, residence, nickname, avatar, we can provide you with membership privilege services.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If you choose to fill in the real name, gender, date of birth, place of residence, nickname, avatar, you can provide you with membership privilege services."}
{"task": "rw_69.jsonl", "id": 61145, "text": "Among them, the nicknames and avatars you set will be displayed publicly.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The nicknames and avatars you set will be displayed publicly."}
{"task": "rw_69.jsonl", "id": 61146, "text": "Authorized login: We may provide your account information (avatar, nickname, and other pages prompt information) to third parties after you agree, so that you can easily implement the registration of third -party accounts or directly log in.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may provide your account information to the third party with a separate consent to facilitate your registration of a third -party account or log in directly in a third party."}
{"task": "rw_69.jsonl", "id": 61147, "text": "In addition, we may obtain your third -party account information from a third party based on your individual consent and bind it with your Taobao platform account, so that you can log in to the third party and use our products and/or orServe.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "You can obtain your third -party account information from a third party and bind it with your Taobao platform account, so that you can log in, use products and/or services directly in the third party."}
{"task": "rw_69.jsonl", "id": 61148, "text": "We will use your relevant information within the scope of the authorization you agree with.", "label": ["Usage"], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61149, "text": "If you already have a Taobao platform account, we may display your above personal information in the Taobao platform service, and the operations that you perform on the Taobao platform or associated with the Taobao platform account (you can via the Taobao platformAccounts use the link entrances or other products/service entrances provided by our website or client to use products or services provided by/or related companies), including displaying your personal data, preferential rights, and transaction orders through Taobao platform accounts.", "label": ["Important", "Usage"], "rewrite": "If you already have a Taobao platform account, you will display your personal information, preferential rights, transaction orders and other information in the Taobao platform service, as well as your operation."}
{"task": "rw_69.jsonl", "id": 61150, "text": "We will respect your choices of Taobao platform services and Taobao platform account settings.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61151, "text": "3. Authentication", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61152, "text": "In order to meet relevant laws and regulations and regulatory requirements, ensure the authenticity of the user's identity, and achieve anti -fraud, such as risk control, guarantee system and service security, when you use specific services/functions, we need to collect your relevant information for identity verification, such as:", "label": ["Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "When you use a specific service/function, we need to collect your relevant information for authentication to meet the regulatory requirements and ensure service security."}
{"task": "rw_69.jsonl", "id": 61153, "text": "[Retrieve account] When you use the \"Return to Taobao Account\" function, we may collect your identity information, including your real name and identity document number, to prove your identity, help you find the Taobao platform accountEssence", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the \"Retrieve Taobao Account\" function, we may collect your identity information to prove your identity."}
{"task": "rw_69.jsonl", "id": 61154, "text": "[Account Enhancement Protection] When you use your account to enhance the protection function, you can choose to submit facial recognition information or sound lines to open face sweep verification and sound verification. Refusing to provide the aforementioned sensitive personal information will only make you unable to use the corresponding function, but no, noIt affects your normal use of other functions.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use your account to enhance the protection function, you can choose to submit facial recognition information or sound lines to open face sweep verification and sound verification."}
{"task": "rw_69.jsonl", "id": 61155, "text": "[Real -name/actual authentication] Based on a member role (such as sellers, content creators) and other scenarios based on the requirements of special types of goods or service transactions, application for additional identity certification requirementsThe need for equity, cracking down on telecommunications network fraud, deduction of personal income tax, administrative law enforcement or relevant subjects in administrative law enforcement or judicial litigation), you need to make real -name or real person certification.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to achieve a member role of special types of goods or service transactions, the application of additional identity certification, and other scenarios that need to verify the true identity of the user in accordance with the law, you need to perform real -name or real person certification."}
{"task": "rw_69.jsonl", "id": 61156, "text": "In order to achieve the purpose of certification, you need to actively provide relevant real identity information (name, document number and other documents or facial recognition information, which may be different according to the actual situation, subject to page prompts) and authorize us to pass the national authority and credible identity certificationThe agency conducts information verification, or authorizes us to obtain the necessary certification information of your Binding Alipay account from the Alipay Company. We will record, save the certification information and certification results in accordance with the law.Uses will not be used as other purposes without your authorization.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "You need to take the initiative to provide real identity information and authorize us to conduct information verification through the national authoritative and credible authentication agency, or authorize us to obtain your necessary certification information from Alipay to achieve the purpose of certification, and if you are authorized, you will not use it.Do other purposes."}
{"task": "rw_69.jsonl", "id": 61157, "text": "In addition, when you participate in the promotion and interactive activities on the platform, we need to check the real -name authentication status of the Alipay account that you binding the Alipay account is used to verify your basic participation conditions and ensure your activities.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you participate in promotion and interactive activities, you need to check the real -name authentication status of your Alipay account to Alipay to verify the basic participation conditions."}
{"task": "rw_69.jsonl", "id": 61158, "text": "(2) Show you product or service information to you", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61159, "text": "To show you the product or service information, including your access footprint and historical search situation, we will collect and use your browsing and search records when you visit or use the Taobao platform website or client.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect and use your browsing and search records when you visit or use the Taobao platform website or client to show you displayed goods or service information."}
{"task": "rw_69.jsonl", "id": 61160, "text": "We will combine equipment information, service log information collected in accordance with the law, and other information that get your authorization to predict your preference characteristics through algorithm models.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Use collected equipment information, service log information, and other information you authorized to predict your preferences."}
{"task": "rw_69.jsonl", "id": 61161, "text": "We will push you a business advertisement and other information that you may be interested in based on your preferences, or send you commercial short information to you.", "label": ["Important", "Usage"], "rewrite": "Based on your preferences to push you commercial advertisements and other information, or send you commercial short information."}
{"task": "rw_69.jsonl", "id": 61162, "text": "We will also use statistical analysis of the hot spots, trends and trends of Taobao platform users to browse, search for products or services, use sorting selection algorithms to form related lists, and recommend it to you.", "label": ["Important", "Usage"], "rewrite": "Based on the statistical analysis of the hotspots, trends and trends of Taobao platform users browsing, searching for products or services, using a selected class algorithm to form a selected list, and recommend it to you."}
{"task": "rw_69.jsonl", "id": 61163, "text": "Personalized recommendations and retrieval algorithms will predict your preferences based on the model, match the products, services or other information you may be interested in, and sort the products, services or other information displayed to you.", "label": ["Important", "Usage"], "rewrite": "Personalized recommendations and retrieval algorithms will predict your preferences based on model prediction, and match products, services or other information you may be interested in."}
{"task": "rw_69.jsonl", "id": 61164, "text": "We will give real -time feedback on the recommendation model based on the browsing behavior of your product, and constantly adjust the optimization results.", "label": ["Important", "Usage"], "rewrite": "According to your browsing behavior, real -time feedback on the recommendation model, and constantly adjust the optimization results."}
{"task": "rw_69.jsonl", "id": 61165, "text": "In order to meet your diverse needs, we will introduce diversified recommendation technologies during the sorting process, expand the recommended content, and avoid excessive concentration of the same type of content.", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61166, "text": "At the same time, we strive to ensure your privacy experience through the following measures:", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61167, "text": "1. If you want to delete your browsing and search records, you can choose to delete in \"My Taobao-Footprint\" and \"Search Box-History Search\";", "label": ["Edit/Control", "Important"], "rewrite": "You can choose to delete your browsing and search records in \"My Taobao-Footprint\" and \"Search Box-History Search\"."}
{"task": "rw_69.jsonl", "id": 61168, "text": "2. If you don't want to accept the commercial advertisement we send to you, you can reply or close the withdrawal or other ways we provided by the SMS prompt;", "label": ["Important", "Edit/Control"], "rewrite": "Replied to the withdrawal or other methods provided by the SMS prompt for a copy or closing the commercial advertisement."}
{"task": "rw_69.jsonl", "id": 61169, "text": "3. If you need to check the sorting of your personal characteristics when using the site search service you provide, you can click \"Filter\" on the search results page, select the \"sales volume\", \"price\", \"universal sorting\"Settings;", "label": ["Important", "Edit/Control"], "rewrite": "You can click \"Filter\" on the search results page, and select the \"sales volume\", \"price\" and \"general sorting\" in it to set the settings to check the sorting of personal characteristics."}
{"task": "rw_69.jsonl", "id": 61170, "text": "4. If you don't want to see the products or services recommended for you on the homepage or enter the payment page, you can select the product or service picture of the recommended product or service, select a shielding similar product or in the subsequent pop -up window according to the prompt or the prompts or similar products or similar products or similar products or in the prompts.Categories of goods or services;", "label": ["Edit/Control", "Important"], "rewrite": "You can choose the category of similar products or services or services according to the prompts in the subsequent pop -up window."}
{"task": "rw_69.jsonl", "id": 61171, "text": "5. If you want to manage the personalized advertisements we send to you, you can set it in \"My Taobao-Settings-Privacy Settings-Advertising Management\".", "label": ["Important", "Edit/Control"], "rewrite": "Personalized advertising settings are performed in \"My Taobao-Settings-Privacy Settings-Advertising Management\"."}
{"task": "rw_69.jsonl", "id": 61172, "text": "6. If you want to manage the personalized content we push you, you can set it in \"My Taobao-Settings-Privacy Settings-Recommended Management\".", "label": ["Edit/Control", "Important"], "rewrite": "Personalized content push settings can be performed in \"My Taobao-Settings-Privacy Settings-Recommended Management\"."}
{"task": "rw_69.jsonl", "id": 61173, "text": "(3) Provide you with the functions of collection, purchase, attention and sharing", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61174, "text": "In the process of visiting our website or client, you can choose to collect the products and/or services that are interested in, add to the shopping cart, establish a attention relationship with the merchant/brand/other members you are interested in, through the provided by us provided by usFunctional components share product/service information from third -party.", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61175, "text": "In the process of using the above functions, we will collect the records of your collection and adding a shopping cart, focusing on relationships, and sharing service log information, including history to achieve the above functions and other purposes we have clearly notified.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the recording of your collection and adding shopping carts, focusing relationships, and sharing service log information including history to provide you with the functions of collecting, adding purchase, attention and sharing."}
{"task": "rw_69.jsonl", "id": 61176, "text": "You can check or manage your collection and purchase information in the collection clip, shopping cart.", "label": ["Edit/Control", "Important"], "rewrite": "You can view or manage your collection and purchase information in the collection clip, shopping cart."}
{"task": "rw_69.jsonl", "id": 61177, "text": "(4) Help you complete the order and order management", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61178, "text": "When you order specific products and/or services in our products and/or services, we will generate orders for you to buy the product and/or service for you through the system.", "label": ["Important", "Usage"], "rewrite": "When you order specific products and/or services, we will generate orders for you to purchase the product and/or service for you through the system."}
{"task": "rw_69.jsonl", "id": 61179, "text": "In the process of ordering, you need to provide at least your consignee's name, delivery address, and consignee contact phone number. For some special types of goods and services, you also need to provide other information necessary for the product or service, such as involving it involvedYou need to provide your identity information during cross -border transactions to complete customs clearance.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In the process of placing an order, you need to provide at least your consignee's name, the delivery address, and the telephone number of the consignee. In special cases, you need to provide other necessary information."}
{"task": "rw_69.jsonl", "id": 61180, "text": "At the same time, this order will contain the goods and/or service information you purchased, the specific order number, the time of order creation, the amount you should pay, your remarks information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Your order contains the goods and/or service information you purchased, the specific order number, the time of order creation, the amount you should pay, your remarks information."}
{"task": "rw_69.jsonl", "id": 61181, "text": "We collect this information to help you successfully complete the transaction, ensure your transaction security, facilitate your inquiry of order information, provide customer service and after -sales service and other purposes that we clearly notify.", "label": ["Important", "Usage"], "rewrite": "Collect order information to help you complete the transaction smoothly, ensure your transaction security, facilitate your inquiry of order information, provide customer service and after -sales service, and other purposes that we clearly notify."}
{"task": "rw_69.jsonl", "id": 61182, "text": "You can order goods and/or services for others through Taobao. You need to provide the aforementioned personal information of the actual consignee and ensure that the actual consignee has obtained.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When ordering goods and/or services for others, you need to provide personal information of actual consignee and ensure that the actual consignee has obtained the consent of the actual consignee."}
{"task": "rw_69.jsonl", "id": 61183, "text": "To facilitate your understanding, query order information and manage order information, we will collect the order information you generated during our service process to display and facilitate the management of your order.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect the order information you generated during the service process to display it to you and facilitate the management of your order."}
{"task": "rw_69.jsonl", "id": 61184, "text": "You can fill in/select more additional information including other contact calls and receipt time to ensure the accurate delivery of goods or services.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can fill in/select more additional information including other contact calls and receipt time to ensure the accurate delivery of goods or services."}
{"task": "rw_69.jsonl", "id": 61185, "text": "You can view and manage your order information through \"My Order\".", "label": ["Important", "Edit/Control"], "rewrite": "You can view and manage your order information through \"My Order\"."}
{"task": "rw_69.jsonl", "id": 61186, "text": "(5) Help you complete the payment", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61187, "text": "To complete the order payment, you need to bind the Alipay account and choose the payment method.", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61188, "text": "We will develop your Taobao platform account member name, the corresponding Alipay account member name, order payment related information, order security related equipment information, and other necessary information required by other anti -money laundering laws through the Alipay software tools embedded in the website or client.The package (software tool development package is referred to as \"SDK\" in this policy) and other security methods shared with Alipay.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Share your Taobao platform account member name, the corresponding Alipay account member name, order payment related information, order security related equipment information, and other legal requirements to share with Alipay."}
{"task": "rw_69.jsonl", "id": 61189, "text": "If you choose to provide you with a payment service by other financial institutions, we will also share your bank card payment, which is valid for the bank card, and share the necessary information of bank card payment with the corresponding financial institutions you choose.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "If you choose to provide you with payment services by other financial institutions, you will share your bank card payment for the necessary information with the corresponding financial institutions."}
{"task": "rw_69.jsonl", "id": 61190, "text": "You can ask others to pay for you, then you need to provide the Alipay account and/or mobile phone number of the Alipay.", "label": ["Important", "First Party Collection Information"], "rewrite": "When asking others to pay for you, you need to provide the Alipay account and/or mobile phone number of the Alipay."}
{"task": "rw_69.jsonl", "id": 61191, "text": "In order to allow us to learn and confirm your payment progress and status in a timely manner, and to provide you with service after -sales and dispute solutions, you agree that we can collect the transaction objects, Alipay or other financial institutions you choose.information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "You agree that we can collect and pay the progress related information from the transaction objects, Alipay or other financial institutions you choose to learn about your payment progress and status."}
{"task": "rw_69.jsonl", "id": 61192, "text": "You can check the Alipay account information bound by your Taobao platform account or apply for replacing the bound Alipay account.", "label": ["Important", "Edit/Control"], "rewrite": "You can view the Alipay account information bound to your Taobao platform account or apply for replacement of the bound Alipay account."}
{"task": "rw_69.jsonl", "id": 61193, "text": "(6) Help you complete the delivery of goods or services", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61194, "text": "In order to ensure that the goods and/or services you buy can be smooth, safe, and accurate, we will disclose the delivery information related to the order of Zhejiang Cainiao Supply Chain Management Co., Ltd. to provide logistics information systems and technical services to Taobao platforms, andProvide the main body of the main body according to the product and/or service to synchronize related distribution information to the corresponding logistics distribution subject.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "We will disclose delivery information related to order to Zhejiang Cainiao Supply Chain Management Co., Ltd., and synchronize related distribution information from the corresponding logistics distribution subject to ensure the provision and delivery of services or goods."}
{"task": "rw_69.jsonl", "id": 61195, "text": "You know and agree that the corresponding logistics distribution subject will inevitably know and use your delivery information to complete the delivery purpose.", "label": ["Important", "Usage"], "rewrite": "You know and agree that the corresponding logistics distribution subject will inevitably know and use your delivery information to complete the delivery purpose."}
{"task": "rw_69.jsonl", "id": 61196, "text": "In order to provide you with the purpose of after -sales and dispute solutions, we need to learn and confirm the delivery progress and status in a timely manner. You agree that we can collect information related to the delivery progress related to the main body of logistics.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "You agree that we can collect information related to the progress of delivery from logistics -related service entities, thinking that you provide after -sales and dispute solutions."}
{"task": "rw_69.jsonl", "id": 61197, "text": "(7) Customer service and dispute handling", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61198, "text": "When you contact us or propose the application for sale, after -sales, and dispute dispute handling, in order to ensure your account and system security, we need you to provide the necessary personal information to verify your membership status.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you contact us or propose the application for sale, after -sales, and dispute dispute processing, you need to provide the necessary personal information for your identity verification."}
{"task": "rw_69.jsonl", "id": 61199, "text": "In order to facilitate the processing plan and results of helping you solve the problem or record related issues as soon as possible, we may preserve your communication, communication/call records and related content (including account information, order information, to prove the relevant related to related related to the relevantOther information provided by the facts, or the contact information you leave).", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may save your communication, communication/call records and related content with us in order to contact you, help you solve the problem or record the processing plan and results."}
{"task": "rw_69.jsonl", "id": 61200, "text": "If you consult, complain or provide suggestions for specific orders, we will use your account information and order information.", "label": ["Important", "Usage"], "rewrite": "If you consult, complain or provide suggestions for specific orders, we will use your account information and order information."}
{"task": "rw_69.jsonl", "id": 61201, "text": "In order to provide reasonable needs of services and improve service quality, other information we may also use, including the relevant information you provided when you contact the customer service, the questionnaire answering information you sent to us during the questionnaire survey.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may use the relevant information you provided when you contact the customer service, and the questionnaire information you reply to improve the service."}
{"task": "rw_69.jsonl", "id": 61202, "text": "We will use deep learning technology to provide you with intelligent Q & A dialogue and intelligent voice customer service services.", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61203, "text": "It is necessary to identify the communication, communication/call records and related content of you, and use it for the training of smart customer service algorithm models without identifying your identity.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "It is identified to communicate with us to communicate, communicate/call records and related content, and use it for training for smart customer service algorithms."}
{"task": "rw_69.jsonl", "id": 61204, "text": "We will make a significant prompt to you during your time for smart customer service.", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61205, "text": "We will continuously improve the quality of smart customer service based on your smart customer service records.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Based on your intelligent customer service records, the service quality of smart customer service is constantly improving."}
{"task": "rw_69.jsonl", "id": 61206, "text": "(8) Provide you with information disclosure release function", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61207, "text": "You can use the comments, Q & A, forum, personal homepage, live broadcast, Taoyou circle, and other information release functions that we provide for you. Select publicly publish graphic/video/live content, publish evaluation and Q & A contentCommodities to leisure fish, as well as the seller's release of goods and/or service related information, store -related information.", "label": ["Edit/Control", "Important"], "rewrite": "You can choose to publicly publish graphic/video/live content, publish evaluation and Q & A content, one -click to sell purchased products to idle fish, and publish products and/or service related information and store -related information as sellers."}
{"task": "rw_69.jsonl", "id": 61208, "text": "We respect and protect your settings of the relevant information and the scope of the release.", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61209, "text": "We may judge whether you can enjoy the corresponding information release function permissions based on your membership type and network log information.", "label": ["Important", "Usage"], "rewrite": "According to your membership type and network log information, judge whether you can enjoy the corresponding information release function authority."}
{"task": "rw_69.jsonl", "id": 61210, "text": "Please note that the information you publish may involve your or other people's personal information and even sensitive personal information. If you choose to upload pictures containing personal information when evaluating.", "label": ["Important"], "rewrite": "Please note that the information you publish may involve your or other people's personal information and even sensitive personal information."}
{"task": "rw_69.jsonl", "id": 61211, "text": "Please consider whether to share or even publicly share relevant information when using our services.", "label": ["Important"], "rewrite": "Please consider whether to share or even share relevant information."}
{"task": "rw_69.jsonl", "id": 61212, "text": "If you involve the personal information of others in your public release, you need to obtain the consent of others before the release.", "label": ["Important"], "rewrite": "If you involve the personal information of others in your public release, you need to obtain the consent of others before the release."}
{"task": "rw_69.jsonl", "id": 61213, "text": "(9) Provide you with security", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61214, "text": "In order to fulfill the statutory obligations to ensure the security of e -commerce transactions, improve the security of your use of services provided by us and our affiliated companies and partners, protect the safety of personal property of you or other users or the public, and better prevent fishing websites.Fraud, network vulnerabilities, computer viruses, network attacks, network invasion risks, and more accurately identify the cases that violate laws and regulations or Taobao related agreements and rules.Information, service log information, and may use or integrate your member information, transaction information, equipment information, service log information, and information that our affiliated companies and partners obtain your authorization or sharing according to law (Among them, we may be in the background of the application background in the background of the application.Collect the MAC address, IMEI and other device identifiers for risk verification during the operation period) to comprehensively judge your account and transaction risk, authenticate, test and prevent security incidents, and take necessary records, audit, analysis, and disposal measures in accordance with the law.Essence", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "We use the application security SDK developed by related companies to collect your equipment information, service log information, and use or integrate your membership information, trading information, equipment information, service log information, and judgeYour account and transaction risk, authentication, testing and prevention of security incidents, and take records, audit, analysis, and disposal measures."}
{"task": "rw_69.jsonl", "id": 61215, "text": "(10) Other additional services provided for you", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61216, "text": "1. Additional services based on system permissions", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61217, "text": "To provide you with more convenient, better, personalized products and/or services, and strive to improve your experience, we may collect and use your personal information by opening system permissions in the following additional services.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61218, "text": "If you do not agree to start the relevant authority, it will not affect your basic services using Taobao, but you may not get the user experience brought by these additional services to you.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you do not agree to start the relevant authority, it will not affect the use of the basic services of Taobao, but you may use additional services."}
{"task": "rw_69.jsonl", "id": 61219, "text": "You can check the status of the above permissions in your device \"settings\" or our client \"My Taobao-Settings-Privacy-System permissions\", and you can determine that these permissions are open or closed at any time.", "label": ["Important", "Edit/Control"], "rewrite": "You can check the state of permissions in the device \"setting\" or our client \"My Taobao-Settings-Privacy-System permissions\", and you can determine that these permissions are open or closed at any time."}
{"task": "rw_69.jsonl", "id": 61220, "text": "Please note that when you start the right of power, it means that you authorize us to collect and use relevant personal information to provide you with corresponding services. Once you turn off the right of power, it means that you cancel the authorization.With relevant personal information, you cannot continue to provide you with the service corresponding to the permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "The opening of one authority means that the authorization is authorized to collect and use the relevant information to provide corresponding services. Close the authority to cancel the authorization representative, and no longer continue to collect and use relevant information based on the corresponding permissions."}
{"task": "rw_69.jsonl", "id": 61221, "text": "The decision of your closure authority will not affect the collection and use of information based on your authorization.", "label": ["Permission Acquisition", "Important"], "rewrite": "Close authority will not affect the collection and use of information based on authorization."}
{"task": "rw_69.jsonl", "id": 61222, "text": "You can click here to view the application authority application and usage description.", "label": ["Permission Acquisition", "Important"], "rewrite": "You can click here to view the application authority application and usage description."}
{"task": "rw_69.jsonl", "id": 61223, "text": "2. Cookie and services of similar technologies", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61224, "text": "Cookie and similar device information identification technology are commonly used in the Internet.", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61225, "text": "When you use our service, we may use related technologies to send one or more, cookie, or anonymous identifiers (hereinafter referred to as \"Cookie\") to collect, identify and store your access, use this product, use this productInformation about time.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use your service, use cookies to collect, identify and store your information when you access and use this product."}
{"task": "rw_69.jsonl", "id": 61226, "text": "We promise that cookies will not be used for any other purposes other than the purpose of this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61227, "text": "We use, cookies, mainly to ensure the safety and efficient operation of products and services, allow us to confirm the security status of your account and transaction, check the relevant abnormal situation of collapse and delay, and help you save you to fill in the form, enter the search contentSteps and processes.", "label": ["Important", "Usage"], "rewrite": "In order to ensure the security of products and services, to confirm the security status of accounts and transactions, check the abnormal situation, and help you simplify the use process."}
{"task": "rw_69.jsonl", "id": 61228, "text": "At the same time, we may use, cookie, show you the information or function you may be interested in, and optimize your choice of advertising.", "label": ["Important", "Usage"], "rewrite": "Use Cookie to show you the information or functions you may be interested in."}
{"task": "rw_69.jsonl", "id": 61229, "text": "Most browsers provide users with the function of removing the browser cache data. You can perform the corresponding data clearing operation, or you can modify the degree of acceptance of cookies or reject our cookies.", "label": ["Important", "Edit/Control"], "rewrite": "You can remove the browser cache data through the browser settings, or you can modify the degree of acceptance of cookies or reject cookies."}
{"task": "rw_69.jsonl", "id": 61230, "text": "You may not be able to use services or corresponding functions that depend on cookies because of these modifications.", "label": ["Important", "Edit/Control"], "rewrite": "You may not be able to use the Cookie's services or corresponding functions because of the modification of the cookie settings."}
{"task": "rw_69.jsonl", "id": 61231, "text": "(11) Other rules of collecting and using personal information", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61232, "text": "1. If the information you provide contains personal information of other users, you need to ensure that you have obtained legal authorization before providing these personal information to Taobao.", "label": ["Important", "Edit/Control"], "rewrite": "If the information you provide contains personal information of other users, make sure you have legal authorization before you provide it."}
{"task": "rw_69.jsonl", "id": 61233, "text": "2. If we use information for other purposes that are not stated in this policy, or use information collected based on specific purposes for other purposes, we will get your consent in advance.", "label": ["Important", "First Party Collection Information"], "rewrite": "If we use the information that the information is not stated in this policy, or the information collected based on specific purposes for other purposes, you will get your consent in advance."}
{"task": "rw_69.jsonl", "id": 61234, "text": "3. Under the premise of strictly identifying and unable to re -identify specific individuals through security encryption technology, we will use the collected data for machine learning, algorithm model training or other data analysis and mining processing to better guaranteeOur product experience and auxiliary business decision analysis.", "label": ["Important", "Usage"], "rewrite": "We will use the collected de -identification and unable to re -identify the data of specific individuals for machine learning, algorithm model training or other data analysis and mining processing."}
{"task": "rw_69.jsonl", "id": 61235, "text": "You can click here to view the principles and information processing of the Taobao network algorithm.", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61236, "text": "3. Provide information to the outside world", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61237, "text": "(1) Sharing", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61238, "text": "We will not share your personal information with companies, organizations and individuals other than Taobao service providers, except the following situations:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not share your personal information with companies, organizations and individuals other than Taobao service providers, except the following situations:"}
{"task": "rw_69.jsonl", "id": 61239, "text": "1. Perform the sharing necessary for the legal obligations: we may share your personal information in accordance with the requirements of laws and regulations, litigation, and disputes in accordance with the requirements of administrative and judicial organs in accordance with the requirements of administrative and judicial organs in accordance with the law, and other legal obligations.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share your personal information in accordance with the requirements of laws and regulations, litigation, and disputes, or in accordance with the requirements put forward by administrative and judicial organs in accordance with the law, as well as other legal obligations."}
{"task": "rw_69.jsonl", "id": 61240, "text": "2. Sharing your consent: After getting your clear consent, we will share your personal information with other parties.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After getting your clear consent, we will share your personal information with other parties."}
{"task": "rw_69.jsonl", "id": 61241, "text": "3. Share sharing in order to establish and fulfill your contract as a party as a party: If you buy goods or services through Taobao platform, we will share the necessary information related to transaction information in your order information according to your choice.Related goods or services providers to realize your needs of transactions, distribution and after -sales service.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You purchase goods or services through Taobao platform, and we choose to share the necessary information related to the transaction with the relevant product or service providers."}
{"task": "rw_69.jsonl", "id": 61242, "text": "4. Shared with affiliated companies: In order to facilitate us to provide some services with you, we provide you with products and services based on Taobao platform accounts. I recommend information that you may be interested in, identify the abnormal membership account, and protect Taobao related companies.Or for other users or the public's personal property security is unruly, your personal information may be shared with our affiliated company and/or its designated service providers.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Your personal information may be shared with our affiliated companies and/or its designated service providers in order to provide you with services, identify abnormal accounts, and protect the safety of personal property of all parties."}
{"task": "rw_69.jsonl", "id": 61243, "text": "We will only share the necessary personal information and be restricted by the purpose declared in this policy. If we share your sensitive personal information or the purpose of changing personal information to change personal information, we will solicit your authorization consent again.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If we share your sensitive personal information or change the purpose of the use and processing of personal information, we will solicit your authorization consent again."}
{"task": "rw_69.jsonl", "id": 61244, "text": "You can click here to view the data sharing of the Taobao platform.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You can click here to view the data sharing of the Taobao platform."}
{"task": "rw_69.jsonl", "id": 61245, "text": "Please note that when you use our service, you voluntarily share or even publicly share information, which may involve your or other people's personal information and even sensitive personal information.", "label": ["Important"], "rewrite": "Please note that the information you voluntarily shared or even publicly shared may involve personal information of you or others and even sensitive personal information."}
{"task": "rw_69.jsonl", "id": 61246, "text": "Please consider and make a decision more cautiously.", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61247, "text": "(2) Entrusted processing", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61248, "text": "We may entrust a partner to handle your personal information in order to authorize partners to represent you to provide you with certain services or fulfilling functions.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may entrust a partner to handle your personal information in order to provide you with certain services or fulfilling functions."}
{"task": "rw_69.jsonl", "id": 61249, "text": "We will only entrust their information for the legal, correct, necessary, specific, and clear goals of this policy statement. We can authorize partners to only contact the information required by their duties, and we will ask for the agreement to request that it must not be requiredThis information is used for any other purpose beyond the scope of commission.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will only entrust them to process your information for the purpose of this policy, and the trustee can only contact the information required for the performance and cannot exceed the scope of the commission."}
{"task": "rw_69.jsonl", "id": 61250, "text": "If the authorized partner will use your information for our unreasonable purpose, it will obtain your consent alone.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If the trustees are used to use the scope of the commission, you will obtain your consent alone."}
{"task": "rw_69.jsonl", "id": 61251, "text": "At present, our authorized partners include the following types:", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61252, "text": "1. Authorized partners of advertising and analysis of service.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61253, "text": "Under the premise of using industry -universal security technology, we will entrust these partners to handle information about advertising, coverage, and effectiveness related to advertising.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will entrust advertising and analyzing service partners to handle information about advertising, coverage, and effectiveness related to advertising."}
{"task": "rw_69.jsonl", "id": 61254, "text": "We will not commission your personal identity information to commission partners.", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61255, "text": "2. Suppliers, service providers and other partners.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61256, "text": "We entrust the information to the suppliers, service providers and other partners who support our business to handle it. These support for the technical infrastructure services that we are entrusted to provide, analyze the usage methods of our services, provide customer service, pay conveniently, or perform academic academic academicsResearch and investigation.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We entrust the information to the suppliers, service providers and other partners who support our business to provide technical infrastructure services, customer services, payment convenience, or conducting academic research and investigation."}
{"task": "rw_69.jsonl", "id": 61257, "text": "In order to ensure the stable operation and functional implementation of our client, so that you can use and enjoy more services and functions. Our application will embed the SDK or other similar applications of authorized partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "SDKs or other similar applications of authorized partners will be embedded in the application to achieve stable operation and functional implementation of the client."}
{"task": "rw_69.jsonl", "id": 61258, "text": "We will strictly test the application interface (API) and software tool development package (SDK) of the authorized partners to obtain relevant information, and strict data protection measures with the authorized partners, so that it will be in accordance with this policy and any other any otherRelated confidentiality and security measures to handle personal information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will conduct security testing of information to obtain information and obtain data protection measures, so that we will process personal information in accordance with this policy and other confidentiality and security measures."}
{"task": "rw_69.jsonl", "id": 61259, "text": "You can click here to view the details we access.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You can click here to view the details we access."}
{"task": "rw_69.jsonl", "id": 61260, "text": "(3) Transfer", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61261, "text": "If we need to transfer personal information for the reasons for merging, separation, dissolution, and declaration of bankruptcy, we will inform you the name or name and contact information of the receiver.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you transfer your personal information for the reasons for merging, separation, dissolution, and declaration of bankruptcy, the name or name and contact information of the receiver will be informed of the receiver."}
{"task": "rw_69.jsonl", "id": 61262, "text": "The receiver will continue to fulfill this policy and other legal obligations.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The receiver will continue to fulfill this policy and other legal obligations."}
{"task": "rw_69.jsonl", "id": 61263, "text": "If the receiver changes the original treatment purpose and method of processing, you will re -obtain your consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If the receiver changes the original treatment purpose and method of processing, you will re -obtain your consent."}
{"task": "rw_69.jsonl", "id": 61264, "text": "(4) Public disclosure", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61265, "text": "We will only publicly disclose your personal information in the following circumstances:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only publicly disclose your personal information in the following circumstances:"}
{"task": "rw_69.jsonl", "id": 61266, "text": "1. Based on your active choice and other individual consent, we may publicly disclose your personal information;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "1. Based on your active choice and other individual consent, we may publicly disclose your personal information;"}
{"task": "rw_69.jsonl", "id": 61267, "text": "2. If we determine that you have violated laws and regulations or seriously violated the relevant agreement and rules of Taobao platforms, or to protect the security of the personal property of the Taobao platform users or the public, we may disclose your personal information, including related violations of regulations, including related regulationsBehavior and Taobao platforms have taken measures for you.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you violate laws and regulations or seriously violate platform related agreements and rules, or to protect the safety of personal property of all parties, we may disclose personal information about you."}
{"task": "rw_69.jsonl", "id": 61268, "text": "Fourth, your rights", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61269, "text": "You can check and manage your information through the following ways, and we will respond to your request in the case of compliance with laws and regulations:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61270, "text": "(1) Review, correct and supplement", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61271, "text": "You have the right to check, correct and supplement your information through the following ways:", "label": ["Edit/Control", "Important"], "rewrite": "You have the right to check, correct and supplement your information through the following ways:"}
{"task": "rw_69.jsonl", "id": 61272, "text": "1. Log in to Taobao, enter \"My Taobao\", and select \"Account Settings\";", "label": ["Important", "Edit/Control"], "rewrite": "1. Log in to Taobao, enter \"My Taobao\", and select \"Account Settings\";"}
{"task": "rw_69.jsonl", "id": 61273, "text": "2. Log in to the Taobao client and enter \"My Taobao-Settings\";", "label": ["Important", "Edit/Control"], "rewrite": "2. Log in to the Taobao client and enter \"My Taobao-Settings\";"}
{"task": "rw_69.jsonl", "id": 61274, "text": "3. Log in to Taobao to select \"Contact customer service\", or log in to Taobao client, and select \"My Taobao -official customer service/exclusive butler (88VIP).", "label": ["Important", "Edit/Control"], "rewrite": "3. Log in to Taobao to select \"Contact customer service\", or log in to Taobao client, and select \"My Taobao -official customer service/exclusive butler (88VIP)."}
{"task": "rw_69.jsonl", "id": 61275, "text": "(2) Copy", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61276, "text": "You can copy your information through the following ways:", "label": ["Important", "Edit/Control"], "rewrite": "You can copy your information through the following ways:"}
{"task": "rw_69.jsonl", "id": 61277, "text": "1. Log in to the Taobao client and enter \"My Taobao-Settings-Privacy-Personal Information Download\";", "label": ["Important", "Edit/Control"], "rewrite": "1. Log in to the Taobao client and enter \"My Taobao-Settings-Privacy-Personal Information Download\";"}
{"task": "rw_69.jsonl", "id": 61278, "text": "2. You can copy your personal information after checking the path listed in \"(1), correction, and supplement\".", "label": ["Important", "Edit/Control"], "rewrite": "2. You can copy your personal information after checking the path listed in \"(1), correction, and supplement\"."}
{"task": "rw_69.jsonl", "id": 61279, "text": "(3) Delete", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61280, "text": "You can delete your information through the path listed in \"(1), correct, and supplement\", or apply for a cancellation account to delete all your information.", "label": ["Important", "Edit/Control"], "rewrite": "You can delete your information through the path listed in \"(1), correct, and supplement\", or apply for a cancellation account to delete all your information."}
{"task": "rw_69.jsonl", "id": 61281, "text": "In the following circumstances, you can make a request to delete personal information to us by contacting customer service:", "label": ["Edit/Control", "Important"], "rewrite": "In the following circumstances, you can make a request to delete personal information: (1) If our behavior of handling personal information violates laws and regulations; (2) If we collect and use your personal information, it has not obtained your consent.; (3) If our behavior of handling personal information violates your agreement; (4) If our treatment purpose has been achieved, unable to achieve or achieve the purpose of processing the purpose; (5) If we stop providing products or services, we stop providing products or services, Or the storage period has expired.Essence"}
{"task": "rw_69.jsonl", "id": 61282, "text": "1. If our behavior of handling personal information violates laws and regulations;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61283, "text": "2. If we collect and use your personal information, it has not obtained your clear consent;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61284, "text": "3. If our behavior of handling personal information seriously violates your agreement;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61285, "text": "4. If our treatment purpose has been achieved, cannot be achieved or is not necessary for the purpose of the treatment;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61286, "text": "5. If we stop providing products or services, or the storage period has expired.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61287, "text": "If we decide to respond to your deletion request, we will also notify the subject of your personal information from our personal information as much as possible at the same time, and ask them to delete it in time (unless laws and regulations have other regulations, or these subjects have independently obtained your authorization)Essence", "label": ["Important", "Edit/Control"], "rewrite": "If we decide to respond to your deletion request, we will also notify the subject of your personal information from us at the same time, and request them to delete time (unless the laws and regulations have other regulations, or these subjects have independently obtained your authorization)."}
{"task": "rw_69.jsonl", "id": 61288, "text": "When you or we assisted you to delete the relevant information, because of the applicable legal and security technical restrictions, we may not be able to immediately delete the corresponding information from the backup system.Treatment until the backup can be removed or achieved anonymous.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "When you or we assist you to delete relevant information, you may not be able to immediately delete the corresponding information from the backup system. Before the backup is removed or achieves anonymous, you will limit the processing of personal information and store safely."}
{"task": "rw_69.jsonl", "id": 61289, "text": "(4) Change the scope of authorization", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61290, "text": "You can change or withdraw the scope of your personal information in the following ways or withdrawn or process your personal information:", "label": ["Important", "Edit/Control"], "rewrite": "You can change or withdraw the scope of your authorization through the following ways:"}
{"task": "rw_69.jsonl", "id": 61291, "text": "1. Manage authorized authorization in \"My Taobao-Settings-Privacy-Find Me\".", "label": ["Important", "Edit/Control"], "rewrite": "1. Manage authorized authorization in \"My Taobao-Settings-Privacy-Find Me\"."}
{"task": "rw_69.jsonl", "id": 61292, "text": "2. Manage authorized authorization in \"My Taobao-Settings-Privacy-Personal Homepage\".", "label": ["Important", "Edit/Control"], "rewrite": "2. Manage authorized authorization in \"My Taobao-Settings-Privacy-Personal Homepage\"."}
{"task": "rw_69.jsonl", "id": 61293, "text": "3. Manage the system authorization of the APP in \"My Taobao-Settings-Privacy-System permissions Management\".", "label": ["Important", "Edit/Control"], "rewrite": "3. Manage the system authorization of the APP in \"My Taobao-Settings-Privacy-System permissions Management\"."}
{"task": "rw_69.jsonl", "id": 61294, "text": "4. Manage the application you have authorized in \"My Taobao-Settings-Privacy-Authorization Management\".", "label": ["Important", "Edit/Control"], "rewrite": "4. Manage the application you have authorized in \"My Taobao-Settings-Privacy-Authorization Management\"."}
{"task": "rw_69.jsonl", "id": 61295, "text": "For the authorization that you cannot directly set through the above method, you can modify it through customer service contact, but please note that for some types of personal information, such as the information necessary for the basic functions of Taobao or the obligations required by our law and regulations,For information, we may not be able to respond to your request to change the scope of authorization.", "label": ["Important", "Edit/Control"], "rewrite": "If you cannot set up authorization by yourself, you can modify it through customer service contact, but you may not be able to change the scope of authorization for the real function or fulfilling the information required by the legal obligations."}
{"task": "rw_69.jsonl", "id": 61296, "text": "When you withdraw authorization, we will no longer process the corresponding personal information.", "label": ["Important", "Edit/Control"], "rewrite": "When you withdraw authorization, we will no longer process the corresponding personal information."}
{"task": "rw_69.jsonl", "id": 61297, "text": "But your decision to withdraw authorization will not affect our personal information processing based on your previous authorization.", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "Withdrawal authorization will not affect our personal information processing we have previously carried out based on your authorization."}
{"task": "rw_69.jsonl", "id": 61298, "text": "(5) Logging out the account", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61299, "text": "You can apply for a cancellation of your account in the following ways:", "label": ["Edit/Control", "Important"], "rewrite": "You can apply for a cancellation of your account in the following ways:"}
{"task": "rw_69.jsonl", "id": 61300, "text": "1. Submit the account cancellation application in \"My Taobao-Settings-Account and Security-Logging up\" account;", "label": ["Important", "Edit/Control"], "rewrite": "1. Submit the account cancellation application in \"My Taobao-Settings-Account and Security-Logging up\" account;"}
{"task": "rw_69.jsonl", "id": 61301, "text": "2. Apply for your account through customer service.", "label": ["Important", "Edit/Control"], "rewrite": "2. Apply for your account through customer service."}
{"task": "rw_69.jsonl", "id": 61302, "text": "After you take the initiative to cancel your account, we will stop providing you with products or services and delete or process your personal information according to the requirements of applicable laws.", "label": ["Important", "Edit/Control"], "rewrite": "After you actively cancel your account, we will stop providing products or services and delete or processes your information."}
{"task": "rw_69.jsonl", "id": 61303, "text": "(6) Automatic decision -making of constraint information system", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61304, "text": "In certain business functions, we may make decisions only based on the non -artificial automatic decision mechanism, including the algorithm.", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61305, "text": "If these decisions affect your legitimate rights and interests, you can contact us through customer service.", "label": ["Edit/Control", "Important"], "rewrite": "If non -artificial automatic decisions affect your legitimate rights and interests, you can contact us through customer service."}
{"task": "rw_69.jsonl", "id": 61306, "text": "(7) Responsive your above request", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61307, "text": "For your or your guardians, close relatives, and other authority to make the above requests to us, and your relevant personal information rights stipulated in the laws of the People's Republic of China and other applicable laws, you can contact us through customer service or directly to us to usPersonal information protection full -time departments initiated complaints.", "label": ["Important", "Edit/Control"], "rewrite": "You can contact us through customer service or directly to the full -time department of our personal information protection to exercise your personal information rights."}
{"task": "rw_69.jsonl", "id": 61308, "text": "We will make a reply within 15 days.", "label": ["Edit/Control", "Important"], "rewrite": "We will make a reply within 15 days."}
{"task": "rw_69.jsonl", "id": 61309, "text": "To ensure your account security and your personal information security, when you make a request to us, we may verify your identity (such as adding account verification, requesting you to provide written requests or other reasonable ways), and then process youRequest.", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "We may verify your identity first, and then process your request."}
{"task": "rw_69.jsonl", "id": 61310, "text": "For your reasonable request, we do not charge fees in principle, but we will charge a certain fee as appropriate for requests that repeat and beyond the reasonable limit.", "label": ["Important", "Edit/Control"], "rewrite": "Reasonable requests are not charged in principle without charging and exceeding the reasonable limit."}
{"task": "rw_69.jsonl", "id": 61311, "text": "For information that is not directly associated with your identity, the information that is repeatedly applied without reasonable reasons, or you need too many technical means (if you need to develop a new system or change the current convention fundamentally), bring risks to others' legitimate rights or notIn actual requests, we may refuse.", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "We may refuse to repeat for unseen, need too much technical means, bring risks or very unrealistic requests to others' legitimate rights and interests."}
{"task": "rw_69.jsonl", "id": 61312, "text": "5. Storage of information", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61313, "text": "(1) Storage period", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61314, "text": "We will only retain your personal information within the time limit required for the cost of reaching the cost policy, unless the law has compulsory retention requirements, for exampleIt is no less than three years from the date of completion.", "label": ["Data Retention", "Important"], "rewrite": "Generally, your personal information is retained within the time limit required to achieve service purposes, unless the law has other requirements."}
{"task": "rw_69.jsonl", "id": 61315, "text": "We judge the storage period of personal information mainly based on the following standards:", "label": ["Data Retention", "Important"], "rewrite": "We judge the storage period of personal information mainly based on the following standards: 1) to complete the business functions you agree with; 2) to ensure that we provide you with service security and quality; 3) the longer retention period you agree; 4) according to litigation according to litigationRelated needs of time; 5) Whether there are other special agreement or laws and regulations on the retention period."}
{"task": "rw_69.jsonl", "id": 61316, "text": "1. Complete your related transaction purpose, maintain the corresponding transactions and business records to cope with your possible inquiries or complaints;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61317, "text": "2. Ensure that we provide you with service safety and quality;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61318, "text": "3. Do you agree to a longer retention period;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61319, "text": "4. According to the relevant needs of the timeliness of litigation;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61320, "text": "5. Whether there are other special agreement or laws and regulations on the retention period.", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61321, "text": "After exceeding the reservation period, we will delete or deal with your personal information according to the requirements of the applicable law.", "label": ["Data Retention", "Important"], "rewrite": "After exceeding the storage period, your personal information will be deleted or anonymous."}
{"task": "rw_69.jsonl", "id": 61322, "text": "(2) Storage location", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61323, "text": "The personal information we collected and generated in the operation of the People's Republic of China will be stored in China.", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in domestic operations will be stored in China."}
{"task": "rw_69.jsonl", "id": 61324, "text": "In the following circumstances, we will provide your personal information to possible overseas entities after fulfilling the obligations stipulated in the law:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the following circumstances, we will provide your personal information to possible overseas entities after fulfilling the obligations stipulated in the law:"}
{"task": "rw_69.jsonl", "id": 61325, "text": "1. Applicable laws have clear regulations;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The applicable laws are clearly stipulated to provide your personal information to possible overseas entities."}
{"task": "rw_69.jsonl", "id": 61326, "text": "2. Get your individual consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Get your individual consent and provide your personal information to possible overseas entities."}
{"task": "rw_69.jsonl", "id": 61327, "text": "3. As a cross -border e -commerce transaction and other types of contracts for one party, you are necessary for the establishment and other types of contracts.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You are cross -border e -commerce transactions as one party and other types of contracts for the establishment of and fulfilling information to provide information to the abroad."}
{"task": "rw_69.jsonl", "id": 61328, "text": "In response to the above situations, we will protect your personal information security in accordance with this policy.", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61329, "text": "(3) Storage safety", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61330, "text": "1. Data protection technical measures", "label": ["Data Security"], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61331, "text": "We have adopted our information that meets industry standards, reasonable and feasible security measures to protect your information, and prevent personal information from being disclosed, used, modified, damaged or lost by unauthorized access, publicly disclosed, used, modified, damaged, or lost.", "label": ["Important", "Data Security"], "rewrite": "To protect personal information that meets industry standards, reasonable and feasible security measures, prevent personal information from being disclosed, publicized, modified, damaged or lost by unauthorized access, publicly disclosure, use, modification, damage or loss."}
{"task": "rw_69.jsonl", "id": 61332, "text": "For example, we will use encrypted technology to improve the security of personal information. When you exchange data between your browser and the server, the SSL protocol is encrypted and protected, and we provide the HTTPS protocol security browsing method;", "label": ["Important", "Data Security"], "rewrite": "Using encrypted technology to improve the security of personal information, provide a safe browsing method of the HTTPS protocol. When you exchange data between your browser and the server, the SSL protocol is encrypted and protected."}
{"task": "rw_69.jsonl", "id": 61333, "text": "We will use a trusted protection mechanism to prevent personal information from being maliciously attacked;", "label": ["Important", "Data Security"], "rewrite": "Using a trusted protection mechanism to prevent personal information from being maliciously attacked."}
{"task": "rw_69.jsonl", "id": 61334, "text": "We will deploy the access control mechanism to make every effort to ensure that only authorized personnel can access personal information.", "label": ["Important", "Data Security"], "rewrite": "Deploy the access control mechanism to ensure that only authorized personnel can access personal information."}
{"task": "rw_69.jsonl", "id": 61335, "text": "At present, our important information systems have been evaluated through the third level of network security level protection.", "label": ["Important", "Data Security"], "rewrite": "Important information systems have been evaluated through three or above through network security levels."}
{"task": "rw_69.jsonl", "id": 61336, "text": "2. Measures for data protection management organization", "label": ["Data Security"], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61337, "text": "We have established a data security management system that is advanced in the industry with data as the core and the data security management system around the data life cycle, and improves the security of personal information from organizational construction, institutional design, personnel management and product technology.", "label": ["Important", "Data Security"], "rewrite": "The data security management system improves the security of personal information from organizational construction, system design, personnel management and product technology."}
{"task": "rw_69.jsonl", "id": 61338, "text": "We have set up a full -time department for personal information protection and designated the protection of personal information for children.", "label": ["Important", "Data Security"], "rewrite": "The full -time department of personal information protection is set up, and a special person is responsible for the protection of personal information of children."}
{"task": "rw_69.jsonl", "id": 61339, "text": "Through training courses and examinations, we have continuously strengthened employees' awareness of protecting the importance of personal information.", "label": ["Important", "Data Security"], "rewrite": "Through training courses and examinations, employees have been continuously strengthened."}
{"task": "rw_69.jsonl", "id": 61340, "text": "3. Response of personal information security incident", "label": ["Data Security"], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61341, "text": "If our physical, technical, or management protection facilities are damaged, and the information is caused by unauthorized access, public disclosure, tampering or destruction, and damage to your legitimate rights and interests, we will launch an emergency plan in time and take reasonable and necessary measures.In order to reduce the impact on your personal.", "label": ["Important", "Data Security"], "rewrite": "We will start emergency plans to deal with information security incidents."}
{"task": "rw_69.jsonl", "id": 61342, "text": "If a personal information security incident occurs, we will also inform you the basic situation and possible impact of the security incident in accordance with the requirements of the laws and regulations.Remedy.", "label": ["Important", "Data Security"], "rewrite": "If a personal information security incident occurs, we will inform your basic situation, possible impact, disposal measures, independent prevention suggestions, etc."}
{"task": "rw_69.jsonl", "id": 61343, "text": "We will inform you in SMS, telephone, push notification, and other reasonable channels that it is difficult to inform one by one. We will publish an announcement in a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "The relevant situation of security incidents will be informed by mail, letter, telephone, push notification, etc. When it is difficult to inform one by one, it will issue an announcement."}
{"task": "rw_69.jsonl", "id": 61344, "text": "At the same time, we will also report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "The disposal of personal information security incidents will be reported in accordance with the requirements of the regulatory authorities."}
{"task": "rw_69.jsonl", "id": 61345, "text": "4. Prevention of account security risk", "label": ["Data Security"], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61346, "text": "When using Taobao services for online transactions, you inevitably disclose your personal information to the other party or the potential transaction of the transaction, such as contact or contact address.", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61347, "text": "In addition, you can also establish communication, exchange information or analysis content with our services.", "label": ["Important", "Data Security"], "rewrite": "You can establish communication, exchange information or analysis content with third parties through our services."}
{"task": "rw_69.jsonl", "id": 61348, "text": "Please protect your personal information properly, provides others only under the necessary circumstances, and do not trust the transaction through other trading tools to avoid the stolen information or even encounter telecommunications network fraud.", "label": ["Important", "Data Security"], "rewrite": "Protecting your personal information properly, it is provided to others only under the necessary situation."}
{"task": "rw_69.jsonl", "id": 61349, "text": "If you are worried that your personal information, especially your account or password, please immediately contact Taobao customer service or Taobao service center in order to take corresponding measures based on your application.", "label": ["Important", "Data Security"], "rewrite": "If you find that there may be personal information leakage, please contact our customer service immediately."}
{"task": "rw_69.jsonl", "id": 61350, "text": "You can also independently carry out \"equipment management\", \"account maintenance\" and \"account lock\" on \"My Taobao-Settings-Account and Security-Security Center\", and submit fraud complaints.", "label": ["Important", "Edit/Control"], "rewrite": "You can independently carry out \"equipment management\", \"account maintenance\", \"account lock\", and submit fraud complaints on \"my Taobao-Settings-Account and Security-Security Center\"."}
{"task": "rw_69.jsonl", "id": 61351, "text": "6. Policy update", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61352, "text": "In order to bring you a better product and service experience, we continue to strive to improve our products, services and technology.", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61353, "text": "When the new service and business processes change, we may update our privacy policy to inform you of specific changes.", "label": ["Policy Change", "Important"], "rewrite": "When the new service and business processes are changed, our privacy policy may be updated to inform you of specific changes."}
{"task": "rw_69.jsonl", "id": 61354, "text": "But without your clear consent, we will not limit your rights you enjoy in accordance with this policy.", "label": ["Policy Change", "Important"], "rewrite": "Without your clear consent, we will not limit your rights you enjoy in accordance with this policy."}
{"task": "rw_69.jsonl", "id": 61355, "text": "We will release any changes to this policy on the special page.", "label": ["Policy Change", "Important"], "rewrite": "We will release any changes to this policy on the special page."}
{"task": "rw_69.jsonl", "id": 61356, "text": "For major changes, we will also provide a more significant notice (including we will notify or provide you with pop -up window prompts through Taobao.)", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61357, "text": "The major changes in this policy include, but not limited to:", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61358, "text": "1. The business model of the product has changed significantly.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61359, "text": "Such as the purpose of handling personal information, the type of personal information, and the use of personal information;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61360, "text": "2. The main body of the privacy policy caused by business adjustment and transaction mergers and acquisitions, and the new subject receiving party changes the original processing purpose and method of treatment;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61361, "text": "3. The main object of personal information sharing or public disclosure changes;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61362, "text": "4. User personal information rights and their exercise methods have changed significantly;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61363, "text": "5. When dealing with the person in charge of the person in charge of the personal information protection and the change of complaint channels;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61364, "text": "6. Personal information protection assessment report shows that the existence of products has a significant impact on personal rights.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61365, "text": "We will also archive the old version of this policy on Taobao's special page for you to check.", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61366, "text": "7. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61367, "text": "In e -commerce activities, we preferably you have the corresponding civil behavior capabilities.", "label": ["Specific Audiences", "Important"], "rewrite": "In e -commerce activities, we preferably you have the corresponding civil behavior capabilities."}
{"task": "rw_69.jsonl", "id": 61368, "text": "If you are a minor, we ask you to ask your parents or other guardians to read this policy carefully, and use our services or provide information to us under the consent of your parents or other guardians.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a minor, please use services or provide information on the premise of obtaining the consent of the guardian."}
{"task": "rw_69.jsonl", "id": 61369, "text": "If you are under 14 years of age, before you use our service, you and your guardian should read our \"Personal Information Protection Rules\" that we specially formulates to ensure that the guardian's guardian's personal information protection rules are obtained.After agreeing, you can use our services under the guidance of the guardian to ensure that you are safe when using our services and trading.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a child under the age of 14, please use the service to read the policy carefully and the \"Personal Information Protection Rules of the Children\" and agree to use services or provide information under the guidance of the guardian."}
{"task": "rw_69.jsonl", "id": 61370, "text": "If you are a child's parents or other guardians, please pay attention to whether the child uses our service after obtaining your authorization consent.", "label": ["Specific Audiences", "Important"], "rewrite": "Please pay attention to whether the guardian is used to use services or provide personal information after obtaining your authorization consent."}
{"task": "rw_69.jsonl", "id": 61371, "text": "If you have any questions about your child's personal information, please contact our personal information protection department.", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61372, "text": "Eight, contact us", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61373, "text": "You can contact us in the following ways. We will reply to your request within 15 days:", "label": ["Important", "Contact Information"], "rewrite": "You can contact us in the following ways. We will reply to your request within 15 days:"}
{"task": "rw_69.jsonl", "id": 61374, "text": "1. If you have any questions, opinions or suggestions on the content of this policy, you can contact us through Taobao customer service or Taobao service center;", "label": ["Important", "Contact Information"], "rewrite": "1. You can contact us through Taobao customer service or Taobao service center;"}
{"task": "rw_69.jsonl", "id": 61375, "text": "2. We have also set up a full -time department for personal information protection. You can use [pipwg@service.alibaba.com] to contact it (please indicate that it is related to [Taobao] and explain the specific facts), office address: [Hangzhou HangzhouFlooring Flooring Floor, Building No. 4, No. 969, Wenyi West Road, Yuhang District, Shiwan].", "label": ["Important", "Contact Information"], "rewrite": "2. You can contact the full -time department of personal information protection through [pipwg@service.alibaba.com] (please indicate that it is related to [Taobao] and explain the specific facts), and office address: [Yuhang District, Hangzhou City Yichi 1Flooring on the first floor of Building No. 4, No. 969, West Road]."}
{"task": "rw_69.jsonl", "id": 61376, "text": "It should be noted that we may not reply to the issue that has nothing to do with the right to this policy or your personal information.", "label": ["Important", "Contact Information"], "rewrite": "Please note that we may not reply to the problem that has nothing to do with the right to this policy or your personal information."}
{"task": "rw_69.jsonl", "id": 61377, "text": "If you are not satisfied with our reply, especially if you think our personal information processing behavior has harm your legitimate rights and interests, you can also seek solutions by filed a lawsuit to a court with jurisdiction in the place of residence in the defendant.", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61378, "text": "Appendix: Related Definition", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61379, "text": "Taobao: Refers to Taobao (domain name taobao.com) website and Taobao client.", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61380, "text": "Taobao service provider: refers to Taobao's Internet information and software technology service providers Zhejiang Taobao Network Co., Ltd., Taobao (China) Software Co., Ltd.", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61381, "text": "Related company: Refers to the related company of Taobao platform service providers disclosed by the latest listed company annual report of Alibaba Group Holding Limited.", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61382, "text": "Alipay: Refers to the main Alipay (China) Network Technology Co., Ltd. providing Alipay services.", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61383, "text": "Personal information: Various information related to the recognized or recognized natural persons recorded in electronics or other ways, excluding information after anonymous processing.", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61384, "text": "Sensitive personal information: Once sensitive personal information is leaked or illegally, it is easy to lead to personal information that is harmful to natural person's personality dignity or personality and property security.Track information, and personal information of minors under the age of 14.", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61385, "text": "Child: Refers to minors under the age of 14.", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61386, "text": "Equipment information: Including device identifiers (IMEI, IDFA, Android ID, Mac, OAID, IMSI and other device -related information), application information (application crash information, notification switch status, application installation list, and other application related information), equipment parameters), equipment parametersAnd system information (device type, device model, operating system and hardware -related information), device network environment information (IP address, WIFI information, base station information and other network -related information).", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61387, "text": "The actual collection of the product shall prevail.", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61388, "text": "Service log information: Including browsing records, click to view records, search query records, collection, add to shopping carts, transactions, after -sales, follow sharing information, publishing information, and IP address, browser type, telecommunications operator, use language, access, accessDate and time.", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61389, "text": "Decoration: Refers to the process of personal information processing, so that it cannot recognize specific natural persons without using additional information.", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61390, "text": "Anonymous: Refers to the process that personal information cannot identify specific natural persons and cannot recover.", "label": [], "rewrite": []}
{"task": "rw_69.jsonl", "id": 61391, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
