{"task": "rw_73.jsonl", "id": 62239, "text": "Effective time: April 27, 2021", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62240, "text": "Updated: April 27, 2021", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62241, "text": "Welcome to the products and services provided by \"Learning\"!", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62242, "text": "Learning (or \"we\") knows the importance of personal information to you. We have always promised to protect users (hereinafter collectively referred to as \"user\" or \"you\") Personal information and privacy security.", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62243, "text": "You are taking effective time: April 27, 2021", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62244, "text": "Updated: April 27, 2021", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62245, "text": "Welcome to the products and services provided by \"Learning\"!", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62246, "text": "Learning (or \"we\") knows the importance of personal information to you. We have always promised to protect users (hereinafter collectively referred to as \"user\" or \"you\") Personal information and privacy security.", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62247, "text": "When you use your learning service, we may collect and use your relevant personal information (or \"personal information\").", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62248, "text": "\"Learning Privacy Policies\" (hereinafter referred to as \"this privacy policy\") is suitable for us to provide learning through -learning services. Users who are under 18 years of age apply for this policy and the \"Learning Personal Information Protection Rules and Guardian Instructions for the Prosperity of the Underage\".", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62249, "text": "We hope to explain to you through this policy that we correspond to the processing rules corresponding to your personal information, as well as the way we provide you with access, correction, delete and protect these personal information in order to better protect your rights and interestsEssence", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62250, "text": "This privacy policy will help you understand the content of the following content", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62251, "text": "Preface", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62252, "text": "Collection and use of information", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62253, "text": "Cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62254, "text": "Sharing, transfer and disclosure of information", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62255, "text": "Personal information protection", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62256, "text": "Personal information management", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62257, "text": "Minor Information Protection", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62258, "text": "Disclaimer", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62259, "text": "Scope", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62260, "text": "contact us", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62261, "text": "Revise", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62262, "text": "The first preface", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62263, "text": "1.1 Study through the development and operation of Beijing Century Super Star Information Technology Development Co., Ltd., we attach great importance to the protection of user personal information.", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62264, "text": "1.2 When you use the service provided by the learning platform, the learning pass may collect and use your personal information because of actual business needs.", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62265, "text": "Learning Tong hopes to clearly introduce you to the processing method of your personal information (including but not limited to the collection, use, and protection of personal information) to you through this privacy policy. Please read it carefully. When neededGuide, make a choice you think is appropriate.", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62266, "text": "1.3 When you log in to use the learning hook, you need to select all the contents of your privacy policy, and agree to learn about the collection, use and protect your relevant personal information in accordance with this policy.", "label": ["Policy Change", "Important"], "rewrite": "Checking requires all the contents of accepting this policy, and agree to learn to collect, use and protect your relevant personal information."}
{"task": "rw_73.jsonl", "id": 62267, "text": "Article 2 of the collection and use of information", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62268, "text": "You understand and agree that learning through the collection information is to provide you with better services. We will only collect the information necessary for business functions according to the principles of legal, correctness, and necessary.Personal information and non -necessary information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will only collect information necessary for business functions based on the principles of legal, legitimate, and necessary."}
{"task": "rw_73.jsonl", "id": 62269, "text": "When learning the service provides services, it may be collected, stored, and uses the following information related to you:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62270, "text": "2.1 Account Registration", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62271, "text": "First, you need to register a account to become a learning user.", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62272, "text": "(1) Personal user registration: When you register, you need to provide us with your own mobile phone number. At that time, we will verify that your identity is valid by sending a SMS verification code.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect the mobile phone number provided by individual users to verify the identity to help register."}
{"task": "rw_73.jsonl", "id": 62273, "text": "If you belong to a teacher, then when you apply for a school training from your learning pass, the system will automatically fill in the mobile phone number registered when you register.", "label": ["Important", "Usage"], "rewrite": "When teachers and users apply for school training, the system will automatically fill in the mobile phone number."}
{"task": "rw_73.jsonl", "id": 62274, "text": "Mobile phone numbers are sensitive information, but based on national laws and regulations, the real -name system requirements and account security protection needs of the national laws and regulations. If you do not provide this information, some functions will not be used normally.", "label": ["Important", "First Party Collection Information"], "rewrite": "Do not provide a mobile phone number will cause some functions to be unavailable normally."}
{"task": "rw_73.jsonl", "id": 62275, "text": "(2) Unit user registration: Unit user registration needs to provide personal names, login account (school number/work number) for the unit to manage and statistics. The information required for registration is collected and entered by the unit manager and completed the account registration.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect personal names provided by the unit users, login account (school number/work number) for the unit to manage and statistics, and complete account registration."}
{"task": "rw_73.jsonl", "id": 62276, "text": "Unit users use the unit information registered by the unit to log in to the use of learning through learning, and provide the mobile phone number for account binding by themselves (after binding, the unit user can use the mobile phone number to log in and repay the password).", "label": ["Important", "First Party Collection Information"], "rewrite": "Unit users can provide their mobile phone numbers for account binding."}
{"task": "rw_73.jsonl", "id": 62277, "text": "2.2 In order to enable you to get the best user experience, our following additional functions may collect and use your personal information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect and use your personal information to provide additional functions."}
{"task": "rw_73.jsonl", "id": 62278, "text": "If you do not provide these personal information, you can still use the learning pass, but you may not be able to use these additional functions or you need to fill in some information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62279, "text": "These additional functions include:", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62280, "text": "(1) Additional functions based on location information: When you use the location sign -in function, WIFI punching function, and sending position function, you can choose to open your location permissions (this positioning function will be provided by Baidu Map to you) soWe judge where you are.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "Get your location permissions (this positioning function will be provided by Baidu Maps) so that you can use the location sign -in function, the WiFi checkup function, and sending position function."}
{"task": "rw_73.jsonl", "id": 62281, "text": "(2) Additional functions based on cameras (cameras): When you use the sweeping, writing notes (commenting notes), writing topics (comment topics), creative topics (only for teachers' users), sendingOnly teachers' users can be used), participating in classroom activities (theme discussion, selection of people, grabbing, testing, questionnaires, scores, group tasks), super -star classroom functions, upload avatars, creation courses, upload certificates, you can choose to authorize learning through the opening of the learningThe camera (camera) of your device to release information.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "Get your camera (camera) camera permissions to achieve information release, for sweeping, writing notes, writing topics, creating topics, sending notices, posting live video, posting classroom activities, participating in classroom activities, uploading certificates, uploading certificates, uploading certificatesFunction."}
{"task": "rw_73.jsonl", "id": 62282, "text": "(3) Additional functions uploaded based on picture: When you use the sweeping, writing notes (commenting notes), writing topics (comment topics), creative topics (this function is only used by teachers), issuance notice (this function is limited to the user of teachers), issuance notice (notice for teachers) (for teachers' users), issuance notice (notice)This function is limited to the use of teachers only), broadcast live (this function is only used by teachers), posting video, release classroom activities (theme discussion, selection, grabbing, testing, questionnaires, scores, group tasks, such functions are limited to only limited to this function.When you participate in classroom activities (theme discussion, selection of people, answers, testing, questionnaires, scores, group tasks) upload certificates, you can choose to allow learning to read your equipment album to achieve information release.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "Get your album permissions to achieve information publishing, for scanning, writing notes, writing topics, creating topics, sending notices, posting live broadcasts, posting videos, publishing classroom activities, participating in classroom activities, uploading certificates."}
{"task": "rw_73.jsonl", "id": 62283, "text": "(4) Additional functions based on voice technology: When you use the writing notes, submit homework, and creative topics (only for teachers' users), send notice (this function is only used by teachers) and publish homework and publishing homeworkWhen the test papers (this function is only used by the teacher's user), when the live broadcast function and the super -star classroom function, you can choose to allow the learning to open the microphone using your device.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "Get your microphone permission, for writing notes, submitting homework, creative topics, issuing notifications and publishing homework and test papers, post -broadcasting functions, and super -star classroom functions."}
{"task": "rw_73.jsonl", "id": 62284, "text": "In these features, we will collect your recording content to identify your needs.", "label": ["Usage"], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62285, "text": "(5) View, WLAN, Status: When you use the download, upload, and video playback function, you will check whether you connect to Wi-Fi to save your traffic.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Check your WLAN status to achieve downloading, uploading, and video playback functions."}
{"task": "rw_73.jsonl", "id": 62286, "text": "(6) Reading SD card: When you use the learning pass to generate cache, upload mobile phone files to cloud disks, download books to this machine, you will read your SD card to achieve information reading and storage.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "Read your SD card to read and store information for cache, upload mobile phone files to cloud disks, download books to this machine."}
{"task": "rw_73.jsonl", "id": 62287, "text": "(7) Surveillance mobile phone call status: When you use the voice call function in the message, use it to determine whether you have a systemic call in progress.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Surveying the state of mobile phone call status to determine whether to hang out to learn voice calls."}
{"task": "rw_73.jsonl", "id": 62288, "text": "(8) Suspension window permissions: When you use live suspension windows, classroom activities, topics, super -star classroom suspension balls, obtain suspended windows permissions to realize the live suspension window when using software", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "Get the authority of the suspension window to open the live suspension window when using the software."}
{"task": "rw_73.jsonl", "id": 62289, "text": "(9) Bluetooth permissions: You connect to the sports bracelet to achieve record information (including but not limited to heart rate, sleep information, steps, exercise data, weight, personal information that has been uploaded, and personal physical data)", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "Get Bluetooth permissions and connect the movement bracelet to achieve record information."}
{"task": "rw_73.jsonl", "id": 62290, "text": "(10) Get_tasks permissions: For one -click admission number, increase the success rate of telecommunications in the network environment under WiFi+4G.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "Get Get_Tasks permissions for one -click admission number."}
{"task": "rw_73.jsonl", "id": 62291, "text": "2.3 The above additional features may require you to open your geographical location (location information), camera (camera), album (photo), and microphone in your device to achieve the collection and use of information involved in these functions.Essence", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "Get the access of geographical location, camera (camera), album (photo), and microphone to achieve various additional functions."}
{"task": "rw_73.jsonl", "id": 62292, "text": "When you need to close this function, most mobile devices will support your needs. For specific methods, please refer to or contact your mobile device service providers or manufacturers.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62293, "text": "Please note that when you turn on these permissions, it means that you authorize us to collect and use these personal information to achieve the above functions. If you turn off the authority, it means that you cancel these authorization, and we will no longer continue to collect and use your individuals.Information cannot provide you with the above functions corresponding to these authorization.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Risk"], "rewrite": "The opening of one authority means that the authorization is authorized to collect and use the relevant information to provide corresponding services. Close the authority to cancel the authorization representative, and no longer continue to collect and use relevant information based on the corresponding permissions."}
{"task": "rw_73.jsonl", "id": 62294, "text": "The decision to close permissions will not affect the processing of personal information based on your authorization.", "label": ["Important", "Edit/Control"], "rewrite": "Closing authority will not affect the information processing based on authorization."}
{"task": "rw_73.jsonl", "id": 62295, "text": "2.4 When you use the service of the learning pass, the learning pass may automatically collect the following information and store it as a service log information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the service of the learning pass, the learning pass may automatically collect equipment information, software information and store as service log information."}
{"task": "rw_73.jsonl", "id": 62296, "text": "2.4.1 Equipment information.", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62297, "text": "Equipment models, operating systems and versions, client versions, device resolution, package name, equipment settings, processes and software lists, device identifiers (MAC/IMEI/Android ID/idfa/Openudid/Guid/SIM card IMSI information)), Software and hardware feature information, the location of the device where the device is located (IP address, GPS location, and WLAN access point, Bluetooth and base station sensor information, equipment hardware serial numbers, equipment unique identification code, and software installation list.", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62298, "text": "2.4.2 Software information.", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62299, "text": "Software version number, browser type.", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62300, "text": "To ensure the security of the operating environment or provide services to provide services, learning will collect information about mobile applications and other software you use.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect information about mobile applications and other software you use to ensure the security of the operating environment or provide service needs."}
{"task": "rw_73.jsonl", "id": 62301, "text": "Please note that separate equipment information and software information cannot identify the identity information of specific natural persons.", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62302, "text": "If we use this type of non -personal information with other information to identify a specific natural person, or use it with personal information, during the combination of use, such non -personal information will be regarded as personal information.", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62303, "text": "2.4.3 In order to ensure the stable operation or implementation of the learning communication app, we may access the software development package (SDK) provided by a third party to achieve the previous purpose.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We may access the software development package (SDK) provided by a third party to achieve related functions and ensure the stable operation of the APP."}
{"task": "rw_73.jsonl", "id": 62304, "text": "Part of the third -party SDK we access may design collecting user information and provide services to users.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Part of the third -party SDK may involve collecting user information and provide services to users."}
{"task": "rw_73.jsonl", "id": 62305, "text": "We will evaluate the legitimacy, legitimacy, and necessity of the third -party collection information, require third parties to protect your information before protecting measures, and strictly abide by relevant laws and regulations and regulatory requirements.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will evaluate the legality, legitimacy, and necessity of third -party collection information, and require third parties to adopt information protection measures and comply with relevant laws and regulations and regulatory requirements."}
{"task": "rw_73.jsonl", "id": 62306, "text": "This shows that the third -party SDK involved in collecting user information involved in the learning APP:", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62307, "text": "(1). Friends SDK, by obtaining the IMEI, MAC address, the number of new users, the number of active users, the number of startups, and the number of times the number of errors are used for statistics.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Youmeng SDK obtains IMEI and MAC addresses for counting the number of new users, the number of active users, the number of startups, and the number of recording applications."}
{"task": "rw_73.jsonl", "id": 62308, "text": "By obtaining location information, it is used to count the area where users belong.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Youmeng SDK obtains location information for counting the area of users."}
{"task": "rw_73.jsonl", "id": 62309, "text": "(2). The pigeon SDK, by obtaining IMEI and reading mobile phone status and identity, is used to push the notification and curriculum activities of learning through learning.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "The pigeon SDK obtains IMEI and reads the status and identity of the mobile phone, which is used to push the notification and curriculum activities of learning."}
{"task": "rw_73.jsonl", "id": 62310, "text": "(3). HKUST Xunfei SDK, through obtaining recording permissions and reading SD card permissions for speech recognition functions.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "Usage"], "rewrite": "HKUST Xunfei SDK obtains recording rights and reads SD card permissions for speech recognition functions."}
{"task": "rw_73.jsonl", "id": 62311, "text": "(4). Jinshan Live SDK, through obtaining camera permissions and recording authority, used for the normal use of live broadcast functions.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "Usage"], "rewrite": "Kingsoft Live SDK obtains camera permissions and recording authority for normal use of live broadcast functions."}
{"task": "rw_73.jsonl", "id": 62312, "text": "(5). Cloud interactive SDK obtains the camera permissions and is used for normal use of video conference functions.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "Usage"], "rewrite": "Yunshi Interactive SDK obtains camera permissions and is used for normal use of video conference functions."}
{"task": "rw_73.jsonl", "id": 62313, "text": "(6). Baidu OCR recognition text SDK, which obtains the camera permissions to use the text recognition function of the pictures after taking pictures.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important", "Usage"], "rewrite": "Baidu OCR recognition text SDK obtains camera permissions for text recognition functions of the picture."}
{"task": "rw_73.jsonl", "id": 62314, "text": "(7). QQ sharing SDK and obtain a list of software installation applications to provide users with the function of sharing articles to QQ friends.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "QQ sharing SDK acquisition software installation application list is used to provide users with the function of sharing articles to QQ friends."}
{"task": "rw_73.jsonl", "id": 62315, "text": "(8). Alibaba Cloud SDK, obtains common equipment information for pushing messages to users.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Alibaba Cloud SDK obtains commonly used equipment information to push messages to users."}
{"task": "rw_73.jsonl", "id": 62316, "text": "(9). Alipay payment SDK, obtain software installation application list, commonly used equipment information, accurate location information (including network/GPS positioning and WIFI positioning information), for account security environment monitoring, and providing wallet recharge function in learning through the learning APPEssence", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Alipay payment SDK acquisition software installation application list, commonly used equipment information, accurate location information, for account security environment monitoring, and providing wallet recharge function."}
{"task": "rw_73.jsonl", "id": 62317, "text": "(10). WeChat payment SDK, obtaining software installation application list, commonly used equipment information, accurate location information (including network/GPS positioning and WIFI positioning information), for account security environment monitoring, as well as providing wallet recharge function in learning APPEssence", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "WeChat payment SDK acquisition software installation application list, commonly used equipment information, accurate location information, for account security environment monitoring, and providing wallet recharge function."}
{"task": "rw_73.jsonl", "id": 62318, "text": "(11). Xiaomi SDK, obtain common equipment information, equipment identifiers, operator information for users to push messages.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Xiaomi SDK obtains common equipment information, device identifiers, and operator information to push messages to users."}
{"task": "rw_73.jsonl", "id": 62319, "text": "(12). Meizu SDK, commonly used equipment information, equipment logo, operator information to push messages to users.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Meizu SDK obtains common equipment information, device logo, operator information, and is used to push messages to users."}
{"task": "rw_73.jsonl", "id": 62320, "text": "(13). Huawei SDK, obtain common equipment information, equipment identification symbols, operator information for users to push messages.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Huawei SDK obtains common equipment information, device identifiers, and operator information to push messages to users."}
{"task": "rw_73.jsonl", "id": 62321, "text": "(14) .oppo, SDK, obtained common equipment information, equipment identifiers, and operator information for users to push messages.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "OPPO SDK obtains common device information, device logo, operator information, to push messages to users."}
{"task": "rw_73.jsonl", "id": 62322, "text": "(15) .vivo, SDK, obtained common equipment information, equipment identifiers, and operator information for users to push messages.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Vivo SDK obtains common equipment information, device logo, operator information, and is used to push messages to users."}
{"task": "rw_73.jsonl", "id": 62323, "text": "(16). SDK passed the camera permissions and detected the live content of the camera content.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Ruiwei SDK obtains the camera permissions and detects the living content of the camera content, and the face recognition function used for the exam."}
{"task": "rw_73.jsonl", "id": 62324, "text": "(17). Baidu Map SDK will use GPS positioning and obtain Wi-Fi information to obtain the user's location and use the service to sign in the WiFi punch-in function.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Baidu Map SDK obtains GPS positioning and obtains Wi-Fi information for the location of the WIFI punching function."}
{"task": "rw_73.jsonl", "id": 62325, "text": "(18). Chuanglan flashing SDK, obtain device identifier, operator information, MAC address, application list, SIM card IMSI identification code for users to quickly log in to learn through the mobile phone number of this machine.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Chuanglan flashing SDK acquisition equipment identification, operator information, MAC address, application list, SIM card IMSI identification code, used to use the mobile phone number of this machine to quickly log in."}
{"task": "rw_73.jsonl", "id": 62326, "text": "(19). China Mobile license login SDK, obtain the current mobile phone number mask, device identifier, MAC address, SIM card IMSI identification code for users to quickly log in to learn through the mobile phone number of the machine.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "China Mobile Login SDK to obtain the current mobile phone number mask, device identifier, MAC address, SIM card IMSI identification code for users to log in with the mobile phone number of this machine."}
{"task": "rw_73.jsonl", "id": 62327, "text": "(20). China Unicom logs in to SDK, obtain the current mobile phone number mask, device identifier, SIM card IMSI identification code for users to quickly log in to learn through the mobile phone number of this machine.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "China Unicom logs in to SDK to obtain the current mobile phone number mask, device identifier, SIM card IMSI identification code for users to use the mobile phone number of this machine to quickly log in to learn."}
{"task": "rw_73.jsonl", "id": 62328, "text": "(21). China Telecom SDK, obtain the current mobile phone number mask, SIM card IMSI recognition code for users to use the mobile phone number of this machine to quickly log in to learn.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "China Telecom SDK obtains the current mobile phone number mask and SIM card IMSI recognition code for users to use the mobile phone number of this machine to quickly log in to learn."}
{"task": "rw_73.jsonl", "id": 62329, "text": "(22). Huanxin push SDK, Taobao push SDK, and obtain common equipment information to push messages to users.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Huanxin push SDK and Taobao push SDK to obtain commonly used equipment information to push messages to users."}
{"task": "rw_73.jsonl", "id": 62330, "text": "(23). Equipment identifier generates SDK, obtains equipment identifier for learning data statistics related services.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Equipment identification library SDK obtains equipment identifier for data statistics -related services."}
{"task": "rw_73.jsonl", "id": 62331, "text": "(24) .qq login SDK, WeChat login SDK, obtain device identifiers, system versions for users to use QQ and WeChat to quickly log in to learn through.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "QQ login SDK, WeChat login SDK obtain device identifiers and system versions for users to quickly log in to use QQ and WeChat."}
{"task": "rw_73.jsonl", "id": 62332, "text": "(25) .UC Woodpecker SDK, obtaining equipment identifier, and system versions are used to improve service stability and facilitate the rapid and accurate positioning of related services.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "UC Woodpecker SDK obtains equipment identifiers and system versions to improve service stability and facilitate the rapid and accurate positioning of related services after the collapse."}
{"task": "rw_73.jsonl", "id": 62333, "text": "(26) .ijk video player SDK, open source video player", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62334, "text": "(27). Listening to Yun SDK, accessing telephone status, WiFi status, for the collection, statistics and branches of systemic information, in order to improve the stability of the system, there are problems in quickly and accurately positioning", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Listening to Yun SDK access telephone status and WIFI status, for the collection, statistics and branches of systemic information, in order to improve the stability of the system, there are problems with quickly and accurately positioning."}
{"task": "rw_73.jsonl", "id": 62335, "text": "(28). Sound network SDK, obtaining commonly used equipment models, video and audio content, used to learn sound and video interaction in real time", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Sound network SDK obtains common equipment models, video and audio content to learn to interact with sound and video in real time."}
{"task": "rw_73.jsonl", "id": 62336, "text": "2.5 (only) When the user uses the live and withdrawal function, you must fill in your real name and ID number to enable us to verify the user's true identity.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When the user uses the live and withdrawal function, collect your real name and ID number to verify your authentication."}
{"task": "rw_73.jsonl", "id": 62337, "text": "After verification, the user can use the live broadcast and withdrawal function.", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62338, "text": "The above information is a sensitive information. The refusal to provide this information will affect your use of live broadcast and withdrawal functions, but does not affect your use of other functions of learning.", "label": ["Important", "First Party Collection Information"], "rewrite": "Refusing to provide the real name and ID number will affect your use of live broadcast and withdrawal functions, and does not affect the normal use of other functions."}
{"task": "rw_73.jsonl", "id": 62339, "text": "2.6 Please fully know that in the following situations, we collect or use personal information without obtain your authorization consent, and we may not respond to the requests that you have proposed corrections/modifications, delete, cancel, withdraw consent, and obtain information:", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In the following situations, we collect or use personal information without obtain your authorization consent, and we may not respond to the request for the correction/modification, deletion, cancellation, withdrawal of consent, and request information you put forward:"}
{"task": "rw_73.jsonl", "id": 62340, "text": "a. Related to national security and national defense security;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The collection and use information directly related to national security and national defense security does not need to solicit authorization consent."}
{"task": "rw_73.jsonl", "id": 62341, "text": "b. It is related to public safety, public health, and major public interests;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to fulfill the statutory duties or the collection and usage information necessary for the statutory volunteer, there is no need to solicit authorization consent."}
{"task": "rw_73.jsonl", "id": 62342, "text": "c. It is related to criminal investigation, prosecution, trial and judgment execution;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collection and use information related to criminal investigation, prosecution, trial and judgment implementation does not need to solicit authorization consent."}
{"task": "rw_73.jsonl", "id": 62343, "text": "d. Out of maintaining major legitimate rights and interests such as the life and property of the subject of personal information or other individuals, it is difficult to get my consent;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collecting the use of personal information to maintain major legitimate rights and interests of the life and property of personal information subjects or other individuals, but it is difficult to get my consent, and no need to solicit authorization."}
{"task": "rw_73.jsonl", "id": 62344, "text": "e. The personal information collected was made to the public to the public;", "label": ["Important", "First Party Collection Information", "Usage", "Risk"], "rewrite": "The collected personal information is made public to the public by the public, and there is no need to solicit authorization consent."}
{"task": "rw_73.jsonl", "id": 62345, "text": "f. Your personal information collected from the legal publicly disclosed information, such as legal news reports and government information disclosure;", "label": ["Important", "First Party Collection Information", "Usage", "Risk"], "rewrite": "Your personal information collected from the legal disclosure information does not need to solicit authorization consent."}
{"task": "rw_73.jsonl", "id": 62346, "text": "g. Signing the contract for the contract according to your requirements;", "label": ["Important", "First Party Collection Information", "Usage", "Risk"], "rewrite": "The collection and usage information necessary for the contract according to your request does not need to solicit authorization consent."}
{"task": "rw_73.jsonl", "id": 62347, "text": "h. The necessary and stable operation of the products and/or service provided by the provided by the maintenance, the failure of the product and the/or service of the product and/or service;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The collected information is necessary to maintain the safe and stable operation of the products provided and/or service. The failure of the product and/or service of the product and the/or service of the provided is not required to solicit authorization."}
{"task": "rw_73.jsonl", "id": 62348, "text": "i. It is necessary for legal news reports;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The necessary collection and use information for legal news reports does not need to solicit authorization consent."}
{"task": "rw_73.jsonl", "id": 62349, "text": "j. Academic research institutions are necessary to carry out statistics or academic research in accordance with public interests, and when providing academic research or description results, the personal information contained in the results is identified by", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When academic research institutions are necessary to carry out statistics or academic research based on public interests, and provide academic research or description results, they can identify the personal information contained in the results without requiring the consent of authorization."}
{"task": "rw_73.jsonl", "id": 62350, "text": "Other circumstances stipulated by law and regulations.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Other collection and use information stipulated in laws and regulations does not need to solicit authorization."}
{"task": "rw_73.jsonl", "id": 62351, "text": "2.7 We will use the personal information collected for our products and/or service functions according to the agreement of this privacy policy.", "label": ["Usage"], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62352, "text": "After collecting your personal information, we will identify the data through technical means, and the information that identify the processing process will not be able to identify the subject.", "label": ["Important", "Data Security", "Usage"], "rewrite": "We will identify your personal information, and the information that identify the processing process will not be able to identify the subject."}
{"task": "rw_73.jsonl", "id": 62353, "text": "2.8 Please note that all personal information you provided when using our products and/or services, unless you change or delete independently, will continue to authorize us to use us during your product and/or service period.", "label": ["Important", "Usage"], "rewrite": "During your use of products or services, the information you provide will continue to authorize us to use it unless you change or delete itself."}
{"task": "rw_73.jsonl", "id": 62354, "text": "When you cancel your account, we will stop using and delete your personal information, except for laws and regulations.", "label": ["Edit/Control", "Important"], "rewrite": "When you cancel your account, we will stop using and delete your personal information, except for laws and regulations."}
{"task": "rw_73.jsonl", "id": 62355, "text": "2.9 Learning Tong may count the use of product usage.", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62356, "text": "At the same time, learning through learning may share these statistical information with the public to show the overall trend of learning communication services.", "label": ["Important", "Usage"], "rewrite": "Learning through the statistical information of the use of products with the public."}
{"task": "rw_73.jsonl", "id": 62357, "text": "But the above statistical information will not include any identity information.", "label": ["Important", "Usage"], "rewrite": "Product use statistics will not contain any identity information information."}
{"task": "rw_73.jsonl", "id": 62358, "text": "2.10 Please understand that learning through the future will be continuously updated and developed.", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62359, "text": "When we want to use your personal information for other purposes that have not been stated in this privacy policy, or use the information collected based on specific purposes for other purposes, we will invite you to take the initiative to make a form of checking or pass by phone by phone.The form of communication will obtain your consent in advance.", "label": ["Important", "Usage"], "rewrite": "If you use your information beyond the purpose of collecting, we will obtain your explicit consent."}
{"task": "rw_73.jsonl", "id": 62360, "text": "Article 3 The use of cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62361, "text": "3.1 We or our third -party partners may obtain and use user information through cookies or similar technologies, and store the information as a log information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We or our third -party partners may obtain and use user information through Cookies or similar technologies, and store them as logs."}
{"task": "rw_73.jsonl", "id": 62362, "text": "By using Cookies, we provide users with a simple and rich and rich network experience.", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62363, "text": "A cookies are a small amount of data, which are sent from a network server to the user's browser and there are computer hard disks.", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62364, "text": "We use cookies to make users benefit.", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62365, "text": "For example, in order to make the login process of learning passing faster, users can choose to exist in a cookies.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Users can choose to have a cookies in a cookies for quick login."}
{"task": "rw_73.jsonl", "id": 62366, "text": "In this way, the next time the user wants to log in to the service of the learning pass, it can be more convenient and fast.", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62367, "text": "Cookies can help us determine the pages and contents of the user connection, and users spend time on learning service and the learning communication services selected by users.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Cookies can collect user use information."}
{"task": "rw_73.jsonl", "id": 62368, "text": "Cookies enables us to serve users better and faster.", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62369, "text": "However, users should be able to control whether cookies and how they are accepted by browsers.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62370, "text": "Users can check the files attached to their browser to obtain more information in this area.", "label": ["Important", "Edit/Control"], "rewrite": "Users can check the files attached to their browser to control cookies."}
{"task": "rw_73.jsonl", "id": 62371, "text": "We and third -party partners may collect and use user information through cookies or similar technologies, and store the information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We and third -party partners may collect and use user information through cookies or similar technologies, and store the information."}
{"task": "rw_73.jsonl", "id": 62372, "text": "We use our own cookies or similar technologies, which may be used for the following uses:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62373, "text": "(1) Remember the identity of the user.", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62374, "text": "Cookies or similar technologies help us recognize its identity as our registered user, or preserve users with related preferences or other information to us;", "label": ["Important", "First Party Collection Information"], "rewrite": "Cookies or similar technologies can be used to remember the identity of the user, or to preserve the relevant preferences or other information provided by the user."}
{"task": "rw_73.jsonl", "id": 62375, "text": "(2) Analyze the situation of the user's service.", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62376, "text": "We can use cookies or similar technologies to understand what activities or services do users use learning through learning services or services;", "label": ["Important", "First Party Collection Information"], "rewrite": "Cookies or similar technologies can be used to analyze the situation of user service services."}
{"task": "rw_73.jsonl", "id": 62377, "text": "You can refuse or manage cookies or similar technologies through a browser or user selection mechanism.", "label": ["Edit/Control", "Important"], "rewrite": "You can refuse or manage cookies or similar technologies through browser or user selection mechanism."}
{"task": "rw_73.jsonl", "id": 62378, "text": "However, if Cookies or similar technologies are discontinued, we may not be able to provide you with the best service experience that meets its needs or meets its age, certain services may not be used normally.", "label": ["Important", "Edit/Control"], "rewrite": "Cookies or similar technologies may cause some services to be unable to use normally and cannot obtain the best service experience."}
{"task": "rw_73.jsonl", "id": 62379, "text": "Article 4 The sharing, transfer and disclosure of information", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62380, "text": "4.1 Sharing of information", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62381, "text": "4.1.1 In principle, Learning will not share your personal information with any company, organization and individual other than Learning.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62382, "text": "But the following situations are except:", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62383, "text": "(1) Get your clear consent or authorization in advance;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Get your clear consent or authorization in advance, you may share your personal information."}
{"task": "rw_73.jsonl", "id": 62384, "text": "(2) Provide in accordance with the requirements of applicable laws and regulations, legal procedures, mandatory administrative or judicial requirements;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Provide according to the requirements of applicable laws and regulations, legal procedures, mandatory administrative or judicial requirements, and may share your personal information."}
{"task": "rw_73.jsonl", "id": 62385, "text": "(3) Within the scope permitted by laws and regulations, it is necessary to provide it to safeguard the interests of learning, you or other learning users or the public interest, property, or security.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Within the scope permitted by laws and regulations, it is necessary to provide your personal information in order to safeguard the learning of learning, you or other learning, or other public interests, property or security. It may share your personal information."}
{"task": "rw_73.jsonl", "id": 62386, "text": "(4) Only when sharing your information can we realize the core functions of our products and/or services, or provide the services you need;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Only when sharing your information can we realize the core function of our products and/or services or the service you need, and will share your information."}
{"task": "rw_73.jsonl", "id": 62387, "text": "(5) You should handle your disputes or disputes with others for you;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you need to deal with your disputes or disputes with others, you may share your information."}
{"task": "rw_73.jsonl", "id": 62388, "text": "(6) It is provided by the relevant agreements (if any) or other legal documents that meet you;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you meet the relevant agreements (if any) or other legal documents, you may share your information."}
{"task": "rw_73.jsonl", "id": 62389, "text": "(7) Public interest based on social public interests that comply with laws and regulations.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "It may share your information based on the public interests of laws and regulations."}
{"task": "rw_73.jsonl", "id": 62390, "text": "4.1.2 For companies, organizations and individuals who share personal information for learning through learning, learning will require them to comply with confidentiality agreement, and ask them to handle personal information in accordance with the explanation of learning through learning, this privacy policy, and other related confidentiality and security measures.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "The other party that requires the shared parties to observe the confidentiality agreement to handle personal information in accordance with the instructions of learning, this privacy policy, and other related confidentiality and security measures."}
{"task": "rw_73.jsonl", "id": 62391, "text": "4.1.3 In order to abide by the conditions and other protocols of the law, implement or apply the learning through learning, or to protect the rights of learning, the rights of your or other learning customers, and its property or security, such as to prevent fraud and other illegal activities and reduce credit risks to reduce credit risksLearning may exchange information with other companies and organizations.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "In order to abide by the conditions of the use of law, implementation or application of learning, or other agreements, or in order to protect the rights and property or security of all parties, learning may exchange information with other companies and organizations."}
{"task": "rw_73.jsonl", "id": 62392, "text": "However, this does not include the sale, leasing, sharing, or disclosing your personal information for the purpose of violating the commitment in this privacy policy.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Learning Tong will not disclose your personal information in order to sell, rent, share or share in other ways."}
{"task": "rw_73.jsonl", "id": 62393, "text": "4.2 Transfer of information", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62394, "text": "Learning Tong will not transfer your personal information to any company, organization, and individual, except the following situations: except:", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62395, "text": "(1) Get your clear consent or authorization in advance;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Get your clear consent or authorization in advance, you may transfer your personal information."}
{"task": "rw_73.jsonl", "id": 62396, "text": "(2) Provide in accordance with the requirements of applicable laws and regulations, legal procedures, mandatory administrative or judicial requirements;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "It is provided according to the requirements of applicable laws and regulations, legal procedures, mandatory administrative or judicial requirements, and may transfer your personal information."}
{"task": "rw_73.jsonl", "id": 62397, "text": "(3) When involving mergers, acquisitions, asset transfers, or similar transactions, if personal information transfer is involved, the learning communication will require new companies and organizations to continue to be bound by this privacy policy.Tong will ask the company and the organization to re -solicit authorization.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When involving mergers, acquisitions, asset transfers, or similar transactions, if personal information transfer is involved, the party will be required to continue to be subject to this policy."}
{"task": "rw_73.jsonl", "id": 62398, "text": "4.3 Personal information copy", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62399, "text": "If you need a copy of your personal basic information, contact customer service through the APP \"Online Customer Service\" function or directly dial our contact number to apply.", "label": ["Important", "Edit/Control"], "rewrite": "Contact customer service through the APP \"Online Customer Service\" function or call our contact phone number directly to submit a copy of personal information."}
{"task": "rw_73.jsonl", "id": 62400, "text": "Based on the difference in the content of the copy of the personal information, we may need to provide relevant information to verify the identity.", "label": ["Important", "Data Security"], "rewrite": "Based on the difference in the content of the copy of the personal information, we may need to provide relevant information to verify the identity."}
{"task": "rw_73.jsonl", "id": 62401, "text": "Under the premise of technical feasibility, the data interface match, we can directly transfer your personal information copy to the designated third parties specified according to your clear requirements.", "label": ["Important", "Edit/Control"], "rewrite": "Under the premise of technical feasibility, we can directly transmit your personal information copy to third parties according to your clear requirements."}
{"task": "rw_73.jsonl", "id": 62402, "text": "4.3 Disclosure of Information", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62403, "text": "Learning through the following circumstances and adopting security measures that meet the industry standards, you will publicly disclose your personal information:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Learning through the following circumstances and adopting security measures that meet the industry standards, you will publicly disclose your personal information:"}
{"task": "rw_73.jsonl", "id": 62404, "text": "(1) You agree or authorize the disclosure of learning;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you agree or authorize the disclosure of learning, you may disclose your personal information."}
{"task": "rw_73.jsonl", "id": 62405, "text": "(2) You use the sharing function;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you use shared features, you may disclose your personal information."}
{"task": "rw_73.jsonl", "id": 62406, "text": "(3) In accordance with the requirements of laws and regulations, mandatory administrative law enforcement or judicial requirements, you must provide your personal information, and you may disclose your personal information according to the types of personal information and disclosure required.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In accordance with the requirements of laws and regulations, mandatory administrative law enforcement or judicial requirements, you must provide your personal information, and learning may disclose your personal information publicly."}
{"task": "rw_73.jsonl", "id": 62407, "text": "Under the premise of compliance with laws and regulations, when learning through the requirements of the above disclosure information, the learning throughout will require it to issue corresponding legal documents.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "When the requirements of laws and regulations, mandatory administrative law enforcement or disclosure of judicial requirements, the learning throughout will require it to issue corresponding legal documents."}
{"task": "rw_73.jsonl", "id": 62408, "text": "Learning Tong will conduct carefully reviewing all such requirements to ensure that it has a legitimate basis, and is limited to data that law enforcement departments have obtained from legal rights due to specific investigations;", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "If the requirements of laws and regulations, the mandatory administrative law enforcement or disclosure of information, the learning will be self -confident to review the legal basis, and it is limited to the data obtained by the law enforcement department due to specific survey and legitimate rights."}
{"task": "rw_73.jsonl", "id": 62409, "text": "(4) In emergencies, in order to protect the legitimate rights and interests of you, learning and other users, or public safety and interests.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In emergency situations, in order to protect the legitimate rights or public safety and interests of you, and other users, your personal information may be disclosed."}
{"task": "rw_73.jsonl", "id": 62410, "text": "Article 5 Personal Information Protection", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62411, "text": "5.1 Your personal information will be stored in the People's Republic of China.", "label": ["Data Retention", "Important"], "rewrite": "Personal information will be stored in the People's Republic of China."}
{"task": "rw_73.jsonl", "id": 62412, "text": "At present, we do not have a scenario that stores your personal information or provide personal information overseas for the time being.", "label": ["Data Retention", "Important"], "rewrite": "There is no scene of cross -border storage of personal information or providing personal information overseas."}
{"task": "rw_73.jsonl", "id": 62413, "text": "If you need to store cross -border storage or provide your personal information overseas, we will clearly inform you separately (including the purpose of the outbound, receiving party, the method and scope of usage, use content, security measures, security risks) again and again.Your authorization consent and strictly require the receiver to process your personal information in accordance with this privacy policy and other relevant requirements.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "If you need to store cross -border storage or provide your personal information overseas, you will clearly inform and obtain your authorization consent again, and strictly require the receiver to handle personal information in accordance with this privacy policy and other relevant requirements."}
{"task": "rw_73.jsonl", "id": 62414, "text": "5.2 Learning Tong only keep your personal information within the shortest time limit required for service purposes.", "label": ["Data Retention", "Important"], "rewrite": "Reserve personal information only within the shortest time limit required for service purposes."}
{"task": "rw_73.jsonl", "id": 62415, "text": "If you need to use your learning service, we will need to keep your mobile phone number all the time to provide you with various functions and services, to ensure your account and system security;", "label": ["Data Retention", "Important"], "rewrite": "If you need to use your learning service, we will always save your mobile phone number in order to provide you with services, guarantee accounts and system security."}
{"task": "rw_73.jsonl", "id": 62416, "text": "When you cancel your account, we will delete relevant information.", "label": ["Important", "Edit/Control"], "rewrite": "When you cancel your account, we will delete relevant information."}
{"task": "rw_73.jsonl", "id": 62417, "text": "After below the above necessary storage period, we will delete, anonymous or other technical processing of your personal information that cannot recognize it.", "label": ["Data Retention", "Important"], "rewrite": "After exceeding the storage period, your personal information will be deleted or anonymous, except for other provisions of laws and regulations."}
{"task": "rw_73.jsonl", "id": 62418, "text": "However, except that you delete, cancel your account or laws and regulations otherwise (the E -Commerce Law stipulates that the time for the preservation time of goods and service information and transaction information is not less than three years from the date of the transaction).", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62419, "text": "When our products or services have permanently stop operation, we will stop collecting personal information. At the same time, we will notify you in the form of push notification, and delete, anonymous or other in a reasonable period to make it impossibleIdentify technical measures that identify user personal information characteristics to handle your personal information.", "label": ["Important", "Cessation of Operations"], "rewrite": "When stopping operations, we will stop collecting and pushing notifications to inform you related matters and delete or processes personal information."}
{"task": "rw_73.jsonl", "id": 62420, "text": "In the following circumstances, we may change the storage time of personal information due to the need to meet the requirements of laws and regulations:", "label": ["Data Retention", "Important"], "rewrite": "We may change the storage time of personal information due to the need to meet the requirements of laws and regulations."}
{"task": "rw_73.jsonl", "id": 62421, "text": "(1) In order to comply with the relevant provisions of the applicable laws and regulations;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62422, "text": "(2) In order to abide by the court's judgment, ruling or other legal procedures;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62423, "text": "(3) In order to comply with the requirements of relevant government agencies or legal authorized organizations;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62424, "text": "(4) In order to implement relevant service agreements or privacy policies, safeguard the public interests of the social, and protect the personal property of our customers, related companies, other users, or employees, or other legitimate rights and interests, in order to protect us and our customers, affiliates, other users or employees.", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62425, "text": "5.3 Data Security Technical Measures: Learning Link will adopt security protection measures that meet industry standards. To ensure your information security, we strive to take various reasonable physical, electronics and management security measures to protect your information and make yourThe information will not be leaked, damaged or lost, including but not limited to: identity identity (that is, when you register for the first time, the learning pass will determine your identity information through your mobile phone number), data encryption measures (MD5 encryption protection, irreversibilityThe encryption algorithm), access control (you must log in through the password or mobile phone verification code, otherwise you cannot use the learning communication normally), malicious code prevention (web application firewall, can be cleaned on data, prevent malicious code execution), security audit (Audit filtering data to prevent SQL injection).", "label": ["Important", "Data Security"], "rewrite": "Take various physical, electronics and management security measures to protect your information so that your information will not be leaked, damaged or lost, including but not limited to identity identity, data encryption measures, access control, malicious code prevention, security, securityaudit."}
{"task": "rw_73.jsonl", "id": 62426, "text": "However, please understand that due to the technical restrictions and various malicious means, in the Internet industry, even if you can do your best to strengthen security measures, it is impossible to ensure that the information is 100 % security.", "label": ["Important", "Data Security"], "rewrite": "Although there are security measures, it is impossible to fully guarantee that there is no security problem."}
{"task": "rw_73.jsonl", "id": 62427, "text": "You need to understand that the system and communication network used in your products and services that you can connect to learning through learning may be due to factors outside the controlled scope of learning.", "label": ["Important", "Data Security"], "rewrite": "Systems and communication networks may have problems due to unprepared factors."}
{"task": "rw_73.jsonl", "id": 62428, "text": "5.4 Learning Study only allows employees who need to know this information to access user information.", "label": ["Important", "Data Security"], "rewrite": "Employees who are necessary to know about information are allowed to access personal information."}
{"task": "rw_73.jsonl", "id": 62429, "text": "Learning passage also requires all personnel who may contact your personal information to fulfill the corresponding confidentiality obligations.", "label": ["Important", "Data Security"], "rewrite": "All personnel who require contact with personal information to perform the corresponding confidentiality obligations."}
{"task": "rw_73.jsonl", "id": 62430, "text": "If these obligations fail to fulfill these obligations, they will be held legal or terminated with cooperative relationships with learning.", "label": ["Important", "Data Security"], "rewrite": "Those who may contact the information may fail to fulfill their confidentiality obligations, and they will be held legal or terminated."}
{"task": "rw_73.jsonl", "id": 62431, "text": "5.5 The Internet is not an absolutely safe environment. Learning through learning suggests that you pay attention to protecting your personal information security when using learning through learning through learning.", "label": ["Important", "Data Security"], "rewrite": "The Internet is not an absolute security environment. Please pay attention to protect personal information security."}
{"task": "rw_73.jsonl", "id": 62432, "text": "The content and information provided, uploaded or published when you use the products and services of learning through learning pass may be leaked by a third party.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62433, "text": "When you have a serious leakage of information caused by your spontaneous sharing behavior, your learning is not assumed to bear relevant legal responsibilities.", "label": ["Important", "Risk"], "rewrite": "When your spontaneous shared behavior leads to the leakage of information, learning is not responsible for this."}
{"task": "rw_73.jsonl", "id": 62434, "text": "You need to consider carefully whether to disclose your personal information to a third party when using the products and services of learning through learning.", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62435, "text": "(1) When a teacher initiates a survey with you (student/parents) and provides your personal information (including but not limited to sensitive information such as identity card information, family address, etc.) to the teacher,Get any information you provided to the teacher, but given that the teacher will get your personal information because of this, you will remind you that you should pay special attention to protect your personal information security when filling in the relevant information.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Teachers initiate investigations to students/parents and provide personal information to teachers by students/parents. Learning throughout will not collect information provided by students/parents, but teachers will get information."}
{"task": "rw_73.jsonl", "id": 62436, "text": "(2) When you share the download link, invitation link, notes link, topic links, and curriculum activities to WeChat friends, WeChat friends, QQ friends and QQ space, you may involve your or others' personal sensitive information(Including avatars, names, etc.), please pay attention to confirming the privacy policy of a third -party platform to protect your personal information security.", "label": ["Important", "Risk"], "rewrite": "When sharing load links, invitation links, notes links, topic links, and curriculum activities, personal sensitive information may be involved."}
{"task": "rw_73.jsonl", "id": 62437, "text": "If the information you share involves third -party personal privacy information, please confirm that it has been authorized by a third party.", "label": ["Important", "Risk"], "rewrite": "If you involve third -party personal privacy information in the information you share, please confirm that it has been authorized by a third party."}
{"task": "rw_73.jsonl", "id": 62438, "text": "5.6 Automatic decision -making of the information system", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62439, "text": "In certain business functions, we may make decisions only based on the non -artificial automatic decision mechanism, including information systems, algorithms, etc..", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62440, "text": "If these decisions significantly affect your legitimate rights and interests, you have the right to ask us to explain, and we will also provide appropriate relief methods.", "label": ["Important", "Edit/Control"], "rewrite": "If non -artificial automatic decisions affect your legitimate rights and interests, you have the right to ask us to explain that we will also provide relief."}
{"task": "rw_73.jsonl", "id": 62441, "text": "5.7 respond to your above request", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62442, "text": "Any questions, suggestions, opinions, and complaints, you can contact the mailbox published by the outside world (tsk@chaoxing.com", "label": ["Important", "Contact Information"], "rewrite": "You can give feedback and suggestions through mailbox: tsk@chaoxing.com."}
{"task": "rw_73.jsonl", "id": 62443, "text": "Or you can also feedback through the homepage -online customer service. In order to ensure security, we will process it after the necessary authentication is passed. The maximum will be answered within the period of no more than 15 working days or the period of the prescribed period of laws and regulations.", "label": ["Important", "Contact Information"], "rewrite": "You can use the home page -online customer service feedback and suggestions."}
{"task": "rw_73.jsonl", "id": 62444, "text": "For your reasonable request, we do not charge fees in principle.", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62445, "text": "However, in accordance with relevant laws and regulations and national standards, in the following circumstances, we may not be able to respond to your request:", "label": ["Important", "Edit/Control"], "rewrite": "According to relevant laws and regulations and national standards, in the following situations, we may not be able to respond to your request:"}
{"task": "rw_73.jsonl", "id": 62446, "text": "(1) Directly related to national security and national defense security;", "label": ["Edit/Control", "Important"], "rewrite": "If your request is directly related to national security and national defense security, you may not be responded."}
{"task": "rw_73.jsonl", "id": 62447, "text": "(2) Related to public safety, public health, major public interests, etc.;", "label": ["Important", "Edit/Control"], "rewrite": "Your request is directly related to public safety, public health, and major public interests and may not be responded."}
{"task": "rw_73.jsonl", "id": 62448, "text": "(3) Related to crime investigation, prosecution, trial, and execution judgment;", "label": ["Important", "Edit/Control"], "rewrite": "Your request is related to criminal investigation, prosecution, trial, and execution judgments, and may not be responded."}
{"task": "rw_73.jsonl", "id": 62449, "text": "(4) There is sufficient evidence that you have subjective malice or abuse of rights;", "label": ["Important", "Edit/Control"], "rewrite": "If there is sufficient evidence that you have subjective malicious or abuse of rights, you may not be able to respond to the request."}
{"task": "rw_73.jsonl", "id": 62450, "text": "(5) It is difficult to get your consent in maintaining major legitimate rights and interests such as maintaining your or other individuals;", "label": ["Important", "Edit/Control"], "rewrite": "Out of the major legitimate rights and interests of the life and property of personal information subjects or other individuals, but it is difficult to get my consent, we may not be able to respond to the request."}
{"task": "rw_73.jsonl", "id": 62451, "text": "(6) Response your request will cause serious damage to the legitimate rights and interests of other personal information subjects or other individuals and organizations;", "label": ["Important", "Edit/Control"], "rewrite": "In response to your request, the legitimate rights and interests of other personal information subjects or other individuals and organizations are seriously damaged, and we may not be able to respond."}
{"task": "rw_73.jsonl", "id": 62452, "text": "(7) Involving business secrets.", "label": ["Important", "Edit/Control"], "rewrite": "We may not be able to respond."}
{"task": "rw_73.jsonl", "id": 62453, "text": "Article 6 The management of personal information", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62454, "text": "Learning will do your best to protect your rights to your personal information access, correction, deletion, cancellation, and withdrawal, so that you have full ability to ensure your privacy and security.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62455, "text": "Your rights include:", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62456, "text": "6.1 Visit, correct, delete your personal information", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62457, "text": "Mobile phone numbers, account passwords, account types, unit certification, etc. You can also update or delete your personal information through the following channels:", "label": ["Important", "Edit/Control"], "rewrite": "Check all the personal information you submitted in the \"I\" page."}
{"task": "rw_73.jsonl", "id": 62458, "text": "(1) If you need to change your account type from \"Student\" to \"Teacher\", you can correct it through the micro -service platform;", "label": ["Important", "Edit/Control"], "rewrite": "You can change the type of account from \"student\" to \"teacher\" through a micro -service platform."}
{"task": "rw_73.jsonl", "id": 62459, "text": "(2) If you need to modify the authentication information of the unit, you can fill in the unit name and school number/work number to submit a modification application at the unit information department.", "label": ["Important", "Edit/Control"], "rewrite": "Fill in the unit name and school number/job number to submit the authentication information of the unit's authentication information at the unit information department."}
{"task": "rw_73.jsonl", "id": 62460, "text": "The information can be successfully modified if the unit information of the unit you submits the unit that has entered the system that has entered the system will be successfully modified;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62461, "text": "If the match fails, it cannot be modified in this way.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62462, "text": "(3) If you need to change your account or mobile phone number, we will re -verify whether your identity is valid by sending a SMS verification code. If the verification fails, you will not be corrected in this way.", "label": ["Important", "Edit/Control"], "rewrite": "Re -verify your identity by sending a SMS verification code to help you change your account or mobile phone number."}
{"task": "rw_73.jsonl", "id": 62463, "text": "If you cannot access, correct or delete your personal information through the above way, or you need to access, correct or delete other personal information generated when using our products and/or servicesYou can contact us by regulations or your agreement on the collection or use of personal information.", "label": ["Important", "Edit/Control"], "rewrite": "You can contact us if you encounter difficulties in visiting, correcting or deleting your personal information.We need you to provide a written request or verify your identity, and answer your request within 15 days after receiving your feedback and verifying your identity.Essence"}
{"task": "rw_73.jsonl", "id": 62464, "text": "To ensure safety, we may need to provide a written request or prove your identity in other ways. In principle, we will answer your request within 15 days after receiving your feedback and verifying your identity.", "label": ["Data Security", "Edit/Control"], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62465, "text": "6.2 Logging out the account", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62466, "text": "You can connect with learning by learning the mailbox (tsk@chaoxing.com;", "label": ["Important", "Edit/Control"], "rewrite": "Turn through the mailbox: tsk@chaoxing.com contact the cancellation account."}
{"task": "rw_73.jsonl", "id": 62467, "text": "Or you can log out your personal account through the homepage -online customer service.", "label": ["Important", "Edit/Control"], "rewrite": "You can cancel your personal account through the homepage -online customer service."}
{"task": "rw_73.jsonl", "id": 62468, "text": "After you cancel your account, we will stop providing you with products and/or services. At the same time, in addition to other provisions of laws and regulations, we will delete your personal information in time.", "label": ["Important", "Edit/Control"], "rewrite": "After canceling the account, it will stop providing products and/or services and delete your personal information."}
{"task": "rw_73.jsonl", "id": 62469, "text": "Please pay special attention: Logging out and learning accounts are irreparable operations.", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62470, "text": "After the account is canceled, you will not be able to continue to use the cancellation account or retrieve any information or collect any information about your chat history (even if you register with the same mobile phone number), including but not limited to:", "label": ["Important", "Edit/Control"], "rewrite": "After the account was canceled, it was impossible to use the account to retrieve any information about or collected by this account."}
{"task": "rw_73.jsonl", "id": 62471, "text": "(1) You will be unable to log in and use the cancellation account. Teachers/parents/students will not be able to contact you through cancellation of accounts;", "label": ["Important", "Edit/Control"], "rewrite": "Unable to log in and use the cancellation account."}
{"task": "rw_73.jsonl", "id": 62472, "text": "(2) Personal information and historical information in your account (including avatars, names, messages, collection, etc.) will not be retrieved;", "label": ["Important", "Edit/Control"], "rewrite": "The cancellation of the personal information and historical information in the account will not be able to be retrieved."}
{"task": "rw_73.jsonl", "id": 62473, "text": "(3) During the cancellation of the account, if your account is complained by others, investigated by the state organs or in a lawsuit or arbitration process, the study through the right to terminate your account for your own consent without getting it separately;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "During the cancellation of the account, if your account is complained by others, investigated by state organs, or in a lawsuit or arbitration process, learning through the right to terminate the cancellation of your account without your consent."}
{"task": "rw_73.jsonl", "id": 62474, "text": "(4) Please pay special attention: Logging out your account does not mean that the account behavior and related responsibilities before the account cancellation are exempt or reduced.", "label": ["Important", "Edit/Control"], "rewrite": "The cancellation account does not mean that the account behavior and related responsibilities before the account of the account are exempted or reduced."}
{"task": "rw_73.jsonl", "id": 62475, "text": "6.3 Withdrawal of consent", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62476, "text": "If you want to change the scope of the authorization of related functions, you can modify the specific method of setting your personal settings through your hardware device, please refer to or contact your mobile device service provider or manufacturer).", "label": ["Edit/Control", "Important"], "rewrite": "You can modify the individual setting of your personal settings to change the scope of authorization."}
{"task": "rw_73.jsonl", "id": 62477, "text": "You can also retreat us through the way to cancel your learning pass. We will continue to collect all the authorization of your personal information.", "label": ["Edit/Control", "Important"], "rewrite": "The authorization of personal information can be permanently withdrawn by cancellation."}
{"task": "rw_73.jsonl", "id": 62478, "text": "If you encounter operating problems in this process, you can contact us through the method provided at the end of this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62479, "text": "When you cancel the authorization of relevant personal information collection, we will no longer collect this information, and we can no longer provide you with the above -mentioned services.", "label": ["Important", "Edit/Control"], "rewrite": "After withdrawing authorization, we will no longer collect the information and cannot provide corresponding services."}
{"task": "rw_73.jsonl", "id": 62480, "text": "6.4 In the following circumstances, in accordance with the requirements of laws and regulations, we will not be able to respond to your withdrawal request:", "label": ["Important", "Edit/Control"], "rewrite": "In the following circumstances, in accordance with the requirements of laws and regulations, we will not be able to respond to your withdrawal request:"}
{"task": "rw_73.jsonl", "id": 62481, "text": "(1) Related to national security and national defense security;", "label": ["Edit/Control", "Important"], "rewrite": "If your request is directly related to national security and national defense security, you may not be responded."}
{"task": "rw_73.jsonl", "id": 62482, "text": "(2) Related to public safety, public health, and major public interests;", "label": ["Important", "Edit/Control"], "rewrite": "Your request is directly related to public safety, public health, and major public interests and may not be responded."}
{"task": "rw_73.jsonl", "id": 62483, "text": "(3) Crime investigation, prosecution, and trial;", "label": ["Important", "Edit/Control"], "rewrite": "Your request is related to criminal investigation, prosecution, and trial, and may not be responded."}
{"task": "rw_73.jsonl", "id": 62484, "text": "(4) There is sufficient evidence that you have subjective malice or abuse of rights;", "label": ["Important", "Edit/Control"], "rewrite": "If there is sufficient evidence that you have subjective malicious or abuse of rights, you may not be able to respond to the request."}
{"task": "rw_73.jsonl", "id": 62485, "text": "(5) Response your request will cause serious damage to the legitimate rights and interests of you or other individuals and organizations.", "label": ["Important", "Edit/Control"], "rewrite": "In response to your request, the legitimate rights and interests of your or other individuals and organizations are severely damaged, and your request may not be responding."}
{"task": "rw_73.jsonl", "id": 62486, "text": "Article 7: Protection of Minor Information", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62487, "text": "7.1 Professional privacy to protect users (especially minors) is a basic policy of learning.", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62488, "text": "7.2 According to the provisions of relevant laws and regulations, if you are a minor under the age of 18, before using the learning communication service, you suggest that you invite your parents or guardians to read the \"Learn Personal Information Protection Rules and Guardians of the Minor\"\"Notice\", and I suggest you seek the consent and guidance of your parents or guardians before submitting your personal information.", "label": ["Specific Audiences", "Important"], "rewrite": "Minors under the age of 18 should obtain the consent of the guardian before use."}
{"task": "rw_73.jsonl", "id": 62489, "text": "7.3 If Learning Tong does collect personal information of minors without obtaining the consent of the parents or the legal guardian in advance, the learning Tong will try to delete relevant data as soon as possible after knowing the situation.", "label": ["Specific Audiences", "Important"], "rewrite": "If the personal information of minors was collected without the consent of the legal guardian, he would try to delete relevant information as soon as possible."}
{"task": "rw_73.jsonl", "id": 62490, "text": "Article 8", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62491, "text": "In addition to the exemptions that these policies have been listed, there is no need to bear any responsibilities when the following situations have occurred: Learning Pass:", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62492, "text": "(1) Because you inform others of your user's password, share registration accounts with others, or other personal data leakage, loss, stolen or tampered with any personal data.", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62493, "text": "(2) Any leakage, loss, stolen or tampered with personal data caused by hackers attack, computer virus invasion or attack, temporary shutdown caused by government control, etc.", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62494, "text": "(3) The leakage of personal information caused by the direct responsibility of non -learning and direct responsibilities and any legal disputes and consequences generated by it.", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62495, "text": "Article 9 Scope of Application", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62496, "text": "All services provided by learning through learning are applicable to this policy.", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62497, "text": "If certain services have their specific privacy guidelines/declarations, the specific privacy guidelines/declarations are applicable.", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62498, "text": "Article 10 Contact us", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62499, "text": "10.1", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62500, "text": "The contact address of the Beijing Century Super Star Information Technology Development Co., Ltd. is: Room 710, Block C, Block C, No. 9, Jindihua Building, No. 9, Shanghai, Haidian District, Haidian District, Beijing. We will protect your personal information in accordance with this privacy policy.", "label": ["Important", "Contact Information"], "rewrite": "Contact address: Room 710, Block C, Block C, Jindu, No. 9, Shangdi, Haidian District, Haidian District, Beijing"}
{"task": "rw_73.jsonl", "id": 62501, "text": "If you have any issues, complaints, suggestions, etc. in the use of learning products and services, you can contact the language of the mailbox (tsk@chaoxing.com", "label": ["Important", "Contact Information"], "rewrite": "Email: tsk@chaoxing.com"}
{"task": "rw_73.jsonl", "id": 62502, "text": "Or you can also feedback through the homepage -online customer service.", "label": ["Important", "Contact Information"], "rewrite": "You can contact the online customer service."}
{"task": "rw_73.jsonl", "id": 62503, "text": "10.2 In principle, we will reply within 15 days after receiving your opinion and verify your identity;", "label": ["Important", "Contact Information"], "rewrite": "We will reply within fifteen days after receiving your opinion and verifying your identity."}
{"task": "rw_73.jsonl", "id": 62504, "text": "In special circumstances such as legal holidays, our response cycle will make a corresponding delay, and you hope you understand it.", "label": ["Important", "Contact Information"], "rewrite": "In case of special circumstances such as legal holidays, our response cycle will make a corresponding delay."}
{"task": "rw_73.jsonl", "id": 62505, "text": "If you are not satisfied with our reply, especially our personal information processing behavior harms your legitimate rights and interests, you can also complain or report to regulators such as online information, public security, and industry and commerce.", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62506, "text": "Article 11 revision", "label": [], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62507, "text": "You understand and agree that the learning through learning is right to revise the privacy policy in accordance with the development of products and services in a timely manner.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62508, "text": "But without your clear consent, we will not reduce the rights you should enjoy in accordance with the privacy policy.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_73.jsonl", "id": 62509, "text": "At that time, the learning communication will issue the revised policy content to you by pushing notifications. You can confirm whether you are willing to accept the revised policy and continue to use the learning platform service by checking.", "label": ["Policy Change", "Important"], "rewrite": "The revised policy content will be published by pushing notifications. You can confirm whether you are willing to accept and continue to use it by checking."}
{"task": "rw_73.jsonl", "id": 62773, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
