{"task": "rw_79.jsonl", "id": 63866, "text": "Class Optimization Master Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63867, "text": "Updated: 2022 [03] month [17] Day", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63868, "text": "Effective time: 2022 [03] month [24] Day", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63869, "text": "Dear users, you are welcome to use the class optimization master software and products that are provided by Guangzhou Vision Rui Electronic Technology Co., Ltd. and Guangzhou Shining Information Technology Co., Ltd. (hereinafter referred to as \"We\") for you (hereinafter referred to as \"Class Optimization Master\" or \"Class Optimization Master\" or \"This software \"), we attach great importance to the protection of personal information of users (following or\" you \").", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63870, "text": "In view of this, we have formulated a privacy policy in accordance with relevant laws and regulations to help you understand how we will collect, use and protect your personal information.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63871, "text": "Please read and confirm that the privacy policy is fully understood before registering and using the class optimization master.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63872, "text": "If you use this service, it means that you have read all the terms of this privacy policy and agree that we can collect, use and protect your personal information in accordance with this privacy policy.", "label": ["Policy Change", "Important"], "rewrite": "If you use this service, it means that you have read all the terms of this privacy policy and agree that we can collect, use and protect your personal information in accordance with this privacy policy."}
{"task": "rw_79.jsonl", "id": 63873, "text": "If you do not agree with the part of the privacy policy, or have any questions about the content of the privacy policy, you have the right to immediately stop using this service and contact us (see the end of the article).", "label": ["Policy Change", "Important"], "rewrite": "If you do not agree with the part of the privacy policy, or have any questions about the content of the privacy policy, you have the right to immediately stop using this service and contact us (see the end of the article)."}
{"task": "rw_79.jsonl", "id": 63874, "text": "This privacy policy has a provisions that may have a significant relationship with your rights and interests. We may collect personal sensitive information, and to have a significant way to have or have or may have or restricted responsibilities. To remind you, you will also guide you to pay attention to the core content of this policy when you first open this software. Please focus on reading and paying attention.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63875, "text": "Please note that our products and services are designed to provide parents (to avoid doubts, parents mentioned in this agreement are the guardians of students) and class teachers to record the performance of parents in the classroom, increase parents and teachers of parents and teachersThe interaction between the same improvement of the teaching quality of the education of children's children as a whole.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63876, "text": "If you are a minor, especially a minor under the age of 14, please do not register as our users and use our products and services.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63877, "text": "This policy will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63878, "text": "1. Definition", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63879, "text": "2. How do we collect and process your personal information", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63880, "text": "3. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63881, "text": "4. How do we share, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63882, "text": "5. How do we protect your personal information", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63883, "text": "6. Your right to your personal information", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63884, "text": "Seven, third -party service providers and their services", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63885, "text": "8. Personal information storage", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63886, "text": "Nine, care for minors", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63887, "text": "10. How to update this privacy policy", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63888, "text": "Eleven, how to contact us", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63889, "text": "12. Appendix \"Class Optimization Master SDK Catalog\"", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63890, "text": "13. Appendix \"Class Optimization Master and Children's Personal Information Protection Policy\"", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63891, "text": "1. Definition", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63892, "text": "\"Related companies\" refer to companies related to us due to common ownership or control.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63893, "text": "\"Third Party\" refers to companies or people (that is, non -related companies) or other non -related individuals who are not related to common ownership or control.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63894, "text": "Third parties can be finance or non -financial companies, or people other than you and us.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63895, "text": "\"Personal Information\" refers to the various information that can be recorded alone or with other information to identify specific natural persons or reflects the activity of specific natural persons alone or with other information.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63896, "text": "\"Children\" refers to minors under the age of 14.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63897, "text": "\"Students\" refer to the objects that teachers collected information when using this service, including children and minors under the age of 18.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63898, "text": "\"Parents\" refers to the guardian of students.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63899, "text": "2. How do we collect and process your personal information", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63900, "text": "For the purpose of providing \"class optimization masters\" products and services, we will collect personal information of students (including children) and personal information of teachers and parents.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect personal information of students (including children) and personal information of teachers and parents."}
{"task": "rw_79.jsonl", "id": 63901, "text": "We will list you in this chapter to states that our personal information is to collect personal information.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63902, "text": "(1) Basic business functions", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63903, "text": "In order to provide you with the basic business functions of \"Class Optimization Master\", you must authorize us to collect and use the necessary personal information. We will only collect the need for the use of the necessary information of the product / service functions according to the principles of legal, correctness, and the necessary principles.To achieve clear and reasonable treatment purposes.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "You must authorize us to collect and use the necessary personal information. We will only collect the necessary information for realizing products / service functions to achieve clear and reasonable processing purposes based on the principles of legitimate, legitimate, and necessary."}
{"task": "rw_79.jsonl", "id": 63904, "text": "If we intend to use your personal information for other purposes that this policy is not clear, we will get your consent again.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63905, "text": "When collecting your personal information, we will collect them in the three ways listed in this policy. These methods include you actively provide us when using this software. We collect you through automated meansInformation, as well as the way we obtain your personal information through the indirect ways of collecting, transferring, and collecting public information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63906, "text": "In order to be concise and clear, we will no longer repeat this type of collection in related services and functions in this policy.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63907, "text": "We will collect and use the following personal information based on the following goals, methods, and scope.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63908, "text": "If you refuse to provide the corresponding personal information, you may not be able to register as our users or cannot enjoy.Essence", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If you refuse to provide the corresponding personal information, you may not be able to register as our users or cannot enjoy the basic business functions of the \"class optimization master\" or some other products and services we provide, or the effect of using related services to achieve."}
{"task": "rw_79.jsonl", "id": 63909, "text": "1. Register and log in", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63910, "text": "In order to become our users, we will collect your mobile phone number and nickname so that you can complete the account registration and opening of your account. You can see your registration as your parents or teachers.Class information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect your mobile phone number and nickname, so that you can complete the account registration and opening."}
{"task": "rw_79.jsonl", "id": 63911, "text": "If you log in with a WeChat account, we will apply for your WeChat avatar, nickname, regional and gender information.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you log in with a WeChat account, we will apply for your WeChat avatar, nickname, regional and gender information."}
{"task": "rw_79.jsonl", "id": 63912, "text": "The personal information we can finally get will be subject to the content of WeChat.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63913, "text": "If you refuse to provide information under the WeChat account, you cannot choose to register and log in to use WeChat accounts. We promise that the legality of the third -party account channel source of this type of personal information and abide by the third -party account interface permission requirements.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide information under the WeChat account, you cannot choose to register and log in with the WeChat account."}
{"task": "rw_79.jsonl", "id": 63914, "text": "After you log in to this software through WeChat, you still need to provide your mobile phone number plus verification code for binding your WeChat account.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide information under the WeChat account, you cannot choose to register and log in with the WeChat account."}
{"task": "rw_79.jsonl", "id": 63915, "text": "2. Provide products or services", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63916, "text": "(1) Create Class", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63917, "text": "In order to facilitate teachers to achieve class management functions and strengthen communication with parents, you can use the function of creating class.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63918, "text": "The use of this feature requires you to provide student names, nicknames, avatars, parent names and account names.", "label": ["Important", "First Party Collection Information"], "rewrite": "The use of this feature requires you to provide student names, nicknames, avatars, parent names and account names."}
{"task": "rw_79.jsonl", "id": 63919, "text": "Please provide us how to use and handle our personal information in accordance with relevant laws and regulations to establish a class to establish a class and the student files of the students.The Service Agreement and the \"Class Optimization Master Privacy Policy\") informed the parents of students and obtained the consent of the parents of the students.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "Before you provide our personal information to the students 'personal information and the student file, please inform the parents of the purpose, method, scope, transmission, and protection rules of how we use and handle personal information, and obtain the consent of students' parents."}
{"task": "rw_79.jsonl", "id": 63920, "text": "You can choose to refuse to provide us with personal information to us.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can choose to refuse to provide us with personal information to us."}
{"task": "rw_79.jsonl", "id": 63921, "text": "But please note: If you do not provide our personal information to us, you may not be able to achieve the above functions and will not be able to obtain the best product experience.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If you do not provide our personal information to us, you may not be able to achieve the above functions and will not be able to obtain the best product experience."}
{"task": "rw_79.jsonl", "id": 63922, "text": "Parents know and agree to collect and use the personal information of minors for the purpose of this software function for the purpose of this software function. Parents can also withdraw the above consent through contact with our customer service at any time.", "label": ["Important", "First Party Collection Information"], "rewrite": "Parents know and agree to collect and use the personal information of minors for the purpose of this software function for the purpose of this software function. Parents can also withdraw the above consent through contact with our customer service at any time."}
{"task": "rw_79.jsonl", "id": 63923, "text": "When you use the creation of the class, we need to obtain your external storage read and write permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use the creation of the class, we need to obtain your external storage read and write permissions."}
{"task": "rw_79.jsonl", "id": 63924, "text": "When you open the outer storage read and write permissions, we will obtain your local file information.Login normally;", "label": ["Data Retention", "Permission Acquisition", "Important"], "rewrite": "After you open the external storage read and write permissions, we will obtain your local file information, and we will save and read your user login logo on external storage."}
{"task": "rw_79.jsonl", "id": 63925, "text": "We will also save and read pictures and videos you need to save and call for you to upload or save class avatars, personal avatars, student avatars, and review types.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "We will also save and read pictures and videos you need to save and call for you to upload or save class avatars, personal avatars, student avatars, and review types."}
{"task": "rw_79.jsonl", "id": 63926, "text": "If you refuse to provide the information required for this function or the permissions required for authorization, you may not be able to use the creation function normally normally, but it does not affect your use of other basic business functions.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Risk"], "rewrite": "If you refuse to provide the information required for this function or the permissions required for authorization, you may not be able to use the creation function normally normally, but it does not affect your use of other basic business functions."}
{"task": "rw_79.jsonl", "id": 63927, "text": "(2) Teachers 'comment students' classroom performance and parents view function", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63928, "text": "In order to realize the function of \"teachers 'comments on students in the class\", we will collect students' names, classroom performance, assignment assignments, and punch card information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect students' names, classroom performance, submit homework, and punch card information."}
{"task": "rw_79.jsonl", "id": 63929, "text": "In order to achieve \"parent -related students to view students' classroom performance\", we will collect the performance of students' class and parents' requirements.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect the performance of students 'class and parents' requirements."}
{"task": "rw_79.jsonl", "id": 63930, "text": "If you are a school teacher, please provide us with personal information to us, provide the privacy policy to the guardian of the students, and obtain the clear and effective consent of the guardian of the student.", "label": ["Policy Change", "Important"], "rewrite": "If you are a school teacher, please provide us with personal information to us, provide the privacy policy to the guardian of the students, and obtain the clear and effective consent of the guardian of the student."}
{"task": "rw_79.jsonl", "id": 63931, "text": "If you refuse to provide the information required for this function or the permissions required for the authorization, you may not be able to use the teacher's comments to review the student's classroom performance and the parent viewing function normally, but it does not affect your use of other basic business functions.", "label": ["Permission Acquisition", "Important", "Risk"], "rewrite": "If you refuse to provide the information required for this function or the permissions required for the authorization, you may not be able to use the teacher's comments to review the student's classroom performance and the parent viewing function normally, but it does not affect your use of other basic business functions."}
{"task": "rw_79.jsonl", "id": 63932, "text": "We will use the personal information you provide in accordance with the provisions of laws and administrative regulations and the purpose and scope of the agreed and scope of us.", "label": ["Important", "Usage"], "rewrite": "We will use the personal information you provide in accordance with the provisions of laws and administrative regulations and the purpose and scope of the agreed and scope of us."}
{"task": "rw_79.jsonl", "id": 63933, "text": "Due to business needs, we really need to exceed the agreed purpose and scope, we will tell you the relevant situation.", "label": ["Important", "Usage"], "rewrite": "Due to business needs, we really need to exceed the agreed purpose and scope, we will tell you the relevant situation."}
{"task": "rw_79.jsonl", "id": 63934, "text": "If you are a school teacher, please inform the students of the students and obtain its consent;", "label": ["Usage"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63935, "text": "If you are a student of a student, please read the relevant situation we provide to you carefully and decide whether to agree with our collections and use of students' personal information.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you are a student of a student, please read the relevant situation we provide to you carefully and decide whether to agree with our collections and use of students' personal information."}
{"task": "rw_79.jsonl", "id": 63936, "text": "(3) Home -school communication", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63937, "text": "In order to strengthen the communication and linkage between parents and school teachers, we provide you with the communication function of home schools.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63938, "text": "If you are a teacher, you can view the assignment information and punch information of the parents of the student;", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63939, "text": "If you are a student of a student, you can check the teacher's job notification information and punch card information.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63940, "text": "We will collect the job notification information and punch information you actively provide, including related text, pictures, audio, video information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect the job notification information and punch information you actively provide, including related text, pictures, audio, video information."}
{"task": "rw_79.jsonl", "id": 63941, "text": "When you use home -school communication functions, we need to obtain your external storage read and write permissions, camera permissions and microphone permission.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use home -school communication functions, we need to obtain your external storage read and write permissions, camera permissions and microphone permission."}
{"task": "rw_79.jsonl", "id": 63942, "text": "If you refuse to provide the information required for this function or the permissions required for authorization, you may not be able to use home -school communication functions normally, but it does not affect your use of other basic business functions.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you refuse to provide the information required for this function or the permissions required for authorization, you may not be able to use home -school communication functions normally, but it does not affect your use of other basic business functions."}
{"task": "rw_79.jsonl", "id": 63943, "text": "(4) Chat function", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63944, "text": "In order to facilitate the smooth communication between teachers and parents and timely understanding students' learning situation, you can use the software's chat function. We will collect the chat record information you actively provide, including chat words and picture information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect the chat record information you actively provide, including chat and picture information."}
{"task": "rw_79.jsonl", "id": 63945, "text": "When you use the chat function, we need to obtain your external storage read and write permissions and camera permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use the chat function, we need to obtain your external storage read and write permissions and camera permissions."}
{"task": "rw_79.jsonl", "id": 63946, "text": "If you refuse to provide the information required for this function or the permissions required for authorization, you may not be able to use the chat function normally, but it does not affect your use of other basic business functions.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you refuse to provide the information required for this function or the permissions required for authorization, you may not be able to use the chat function normally, but it does not affect your use of other basic business functions."}
{"task": "rw_79.jsonl", "id": 63947, "text": "3. Run safely", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63948, "text": "We are committed to providing you with a safe, credible product and use environment, and providing high -quality and reliable services and information is our core goal.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63949, "text": "When you use this software, the system will automatically record your login situation, duration, usage situation for our network and system security prevention and control, user use statistics, and fulfillment of other Chinese laws and regulations.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide the information required for this function or the permissions required for authorization, you may not be able to use the chat function normally, but it does not affect your use of other basic business functions."}
{"task": "rw_79.jsonl", "id": 63950, "text": "We may also obtain your other information to ensure the security and stable operation of this software and the reasonable needs of the reasonable needs of you, including the relevant feedback information you provided to us, including pictures and text information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63951, "text": "For information collected from your various devices, we may associate them so that we can provide you with consistent services on these devices.", "label": ["Important", "Usage"], "rewrite": "For information collected from your various devices, we may associate them so that we can provide you with consistent services on these devices."}
{"task": "rw_79.jsonl", "id": 63952, "text": "The information collected for the security guarantee function is a necessary information.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63953, "text": "Therefore, we will collect the following device information and log information:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63954, "text": "(1) In order to ensure the safe operation of software and services, we will collect your hardware model, operating system version number, unique device identifier (including IMEI, IMSI, Android, ID, device hardware sequence number, IDFA), network equipment hardwareAddress, IP, address, software version number, network access method, type, status, network quality data, service logs, and location related information of the device (including the GPS location you authorted, and the WLAN access point, Bluetooth and base station information).", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect your hardware model, operating system version number, unique device identifier (including IMEI, IMSI, Android ID, device hardware serial number, IDFA), network device hardware address, IP address, software version number, network access method method, Type, Status, Network Quality and Data, Service Logs, and Location of Equipment (including your GPS location and WLAN access point, Bluetooth and base station information)."}
{"task": "rw_79.jsonl", "id": 63955, "text": "(2) For your safe operating environment and prevent interface hijacking, we will conduct interface security prompts by reading the application list and application process.The overall operation, usage and frequency of application, frequency, application crash, overall installation usage, performance data, and source of application.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will conduct interface security prompts by reading the application list and application process. At the same time, in order to prevent malicious procedures and security operations, the application information collected and installed or running process information, the overall operation of the application, the use of usage and frequency, the application crash situation, Overall installation, performance data, and source of application."}
{"task": "rw_79.jsonl", "id": 63956, "text": "(3) We may use your account information, equipment information, service log information, and our related parties and partners to obtain information that you can share or shared in accordance with the law to judge account security, conduct authentication, test and prevent security incidentsEssence", "label": ["Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "We may use your account information, equipment information, service log information, and our related parties and partners to obtain information that you can share or shared according to law to judge account security, conduct authentication, test and prevent security incidents."}
{"task": "rw_79.jsonl", "id": 63957, "text": "Please note that separate equipment information and service log information are information that cannot recognize specific natural person status.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63958, "text": "If we use this type of non -personal information with other information to identify a specific natural person or use it with personal information, during the combination of use, such non -personal information will be regarded as personal information, except for obtaining your authorization.Or in addition to laws and regulations, we will anonymous and de -identify such information.", "label": ["Data Retention", "Data Security"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63959, "text": "(2) Additional business functions", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63960, "text": "At the same time, in order to provide you with better additional products and services, we provide you with the expansion business function of the \"Class Optimization Master\". You can choose to authorize us to collect and use the corresponding personal information. If you refuse to provideNormally use related extended business functions or cannot achieve the product function effects we expect, but this does not affect the basic business functions of your normal use of \"class optimization masters\".", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "We provide you with the expansion of the \"Class Optimization Master\". You can choose to authorize us to collect and use the corresponding personal information. If you refuse to provide it, you will not be able to use the relevant extension business functions normally or to achieve the product function effect effect that we expect.Essence"}
{"task": "rw_79.jsonl", "id": 63961, "text": "We may need you to authorize the relevant permissions and collect the corresponding information:", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "We may need you to authorize the relevant permissions and collect the corresponding information:"}
{"task": "rw_79.jsonl", "id": 63962, "text": "1. Picture intelligent recognition function", "label": ["First Party Collection Information", "Permission Acquisition"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63963, "text": "When you create a class, we provide you with the intelligent recognition function of the picture. You can use this function to intelligently recognize students' pictures and quickly enter the student's name.", "label": ["First Party Collection Information", "Permission Acquisition"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63964, "text": "We will collect the student pictures and student name information you actively provide.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "We will collect the student pictures and student name information you actively provide."}
{"task": "rw_79.jsonl", "id": 63965, "text": "When you use this function, we need to obtain your external storage read and write permissions and camera permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use this function, we need to obtain your external storage read and write permissions and camera permissions."}
{"task": "rw_79.jsonl", "id": 63966, "text": "If you refuse to provide the information required for this function or the permissions required for authorization, you may not be able to use the image intelligent recognition function normally, but it does not affect your use of other basic business functions.", "label": ["Permission Acquisition", "Important", "Risk"], "rewrite": "If you refuse to provide the information required for this function or the permissions required for authorization, you may not be able to use the image intelligent recognition function normally, but it does not affect your use of other basic business functions."}
{"task": "rw_79.jsonl", "id": 63967, "text": "a) For teachers users, use pictures to intelligently identify the function and feedback function of students;", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63968, "text": "Use sending notifications, assignments, punch cards, electronic awards, and chat functions to send or save photos, audio, video and files;", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63969, "text": "Save the two -dimensional code picture, save student file pictures, save text points rating pictures, save the glorious list of long pictures;", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63970, "text": "Export intelligent evaluation documents, export student single evaluation reports, export students comprehensive evaluation reports, export class evaluation reports;", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63971, "text": "b) For parents users, use the feedback function of opinion;", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63972, "text": "Use submitting operations, punch cards, and enhance planning functions to send or save photos, audio, video and files;", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63973, "text": "Preserve the Love Value Ranking Ranking Picture;", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63974, "text": "Save the special training camp punch card poster.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63975, "text": "2. Invite the service service", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63976, "text": "In order to facilitate you to send invitations to enter the class message, we need to obtain your communication recording authority. When you turn on this permissions, we will collect your friend's mobile phone number information in your communication record.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "We need to obtain your communication records. When you turn on this permissions, we will collect information on your friend's mobile phone number information in your communication record."}
{"task": "rw_79.jsonl", "id": 63977, "text": "If you refuse to provide the information required for this function or the permissions required for the authorization, you may not be able to use the SMS to invite friends to enter the class normally, but you can invite the class to send the invitation link to the QQ friend and WeChat friend.Essence", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Risk"], "rewrite": "If you refuse to provide the information required for this function or the permissions required for the authorization, you may not be able to use the SMS to invite friends to enter the class normally, but you can invite the class to send the invitation link to the QQ friend and WeChat friend.Essence"}
{"task": "rw_79.jsonl", "id": 63978, "text": "3. Student file service", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63979, "text": "In order to facilitate you to save the student's file picture to the local album, we need to obtain your external storage reading permissions. When you turn on the permission, we will collect your children's performance evaluation, potential analysis, parental feedback, participation improvement planning plan in schoolinformation.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "We need to obtain your external storage reading permissions. When you open this permission, we will collect your children's performance evaluation, potential analysis, parental feedback, and participation in planning information."}
{"task": "rw_79.jsonl", "id": 63980, "text": "If you refuse to provide the information required for this function or the permissions required for authorization, you may not be able to save the student's picture to the local album, but it does not affect your use of other basic business functions.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you refuse to provide the information required for this function or the permissions required for authorization, you may not be able to save the student's picture to the local album, but it does not affect your use of other basic business functions."}
{"task": "rw_79.jsonl", "id": 63981, "text": "4. Intelligent comment function", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63982, "text": "To facilitate your export of intelligent evaluation documents, we need to obtain your external storage reading permissions. When you open this permission, we will collect your evaluation information of students.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "We need to obtain your external storage reading permissions. When you turn on this permission, we will collect your evaluation information of students."}
{"task": "rw_79.jsonl", "id": 63983, "text": "If you refuse to provide the information required for this function or the permissions required for authorization, you may not be able to use the intelligent comment function normally, but it does not affect your use of other basic business functions.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "If you refuse to provide the information required for this function or the permissions required for authorization, you may not be able to use the intelligent comment function normally, but it does not affect your use of other basic business functions."}
{"task": "rw_79.jsonl", "id": 63984, "text": "5. Love Ranking", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63985, "text": "To facilitate the preservation of the love value ranking picture to the local album, we need to obtain your external storage reading permissions. When you open this permissions, we will collect picture information of the loving value ranking, including parental names, student names, and student names and student names and student names.Love value.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "We need to obtain your external storage reading permissions. When you open this permission, we will collect pictures information of the loving value rankings, including parent names, student names, and love value."}
{"task": "rw_79.jsonl", "id": 63986, "text": "If you refuse to provide the information required for this function or the permissions required for authorization, you may not be able to save the love value rankings to the local album, but it does not affect your use of other basic business functions.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "If you refuse to provide the information required for this function or the permissions required for authorization, you may not be able to save the love value rankings to the local album, but it does not affect your use of other basic business functions."}
{"task": "rw_79.jsonl", "id": 63987, "text": "6. Special training camp punch card", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63988, "text": "In order to facilitate you to save the special training camp pictures to the local album, we need to obtain your external storage reading permissions. When you turn on this permission, we will collect special training camp punch cards, including student avatars, student learning check -in days.Essence", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "We need to obtain your external storage reading permissions. When you turn on this permission, we will collect special training camp punch cards, including student avatars and students to learn to check card days."}
{"task": "rw_79.jsonl", "id": 63989, "text": "If you refuse to provide the information required for this function or the permissions required for authorization, you may not be able to save the special training camp pictures to the local album, but it does not affect your use of other basic business functions.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "If you refuse to provide the information required for this function or the permissions required for authorization, you may not be able to save the special training camp pictures to the local album, but it does not affect your use of other basic business functions."}
{"task": "rw_79.jsonl", "id": 63990, "text": "7. Scanning function", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63991, "text": "In order to provide you with a scanning code login computer version of the optimization master and the smart student card of the code scanning, you need to authorize us to open the camera (camera) permissions of your device for code scanning.", "label": ["Permission Acquisition", "Important"], "rewrite": "You need to authorize us to turn on the camera (camera) authority of your device for code scanning."}
{"task": "rw_79.jsonl", "id": 63992, "text": "When you use the Android camera to scan the code, the Android operating system will also obtain your current operation list list, which is the behavior of the Android operating system.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63993, "text": "If you do not provide the above information or permissions, you will not be able to use the above -mentioned camera -based code scanning function, but it does not affect other functions of your normal use of the class optimization master software.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "If you do not provide the above information or permissions, you will not be able to use the above -mentioned camera -based code scanning function, but it does not affect other functions of your normal use of the class optimization master software."}
{"task": "rw_79.jsonl", "id": 63994, "text": "8. Weather information intelligent reminder function", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63995, "text": "To facilitate your use of weather information intelligent reminder function, we need to obtain your geographical location permissions. When you open this permissions, we will collect your positioning information.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "To facilitate your use of weather information intelligent reminder function, we need to obtain your geographical location permissions. When you open this permissions, we will collect your positioning information."}
{"task": "rw_79.jsonl", "id": 63996, "text": "If you refuse to provide the information required for this function or the permissions required for authorization, you may not be able to use weather information intelligent reminder functions, but it does not affect your use of other basic business functions.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "If you refuse to provide the information required for this function or the permissions required for authorization, you may not be able to use weather information intelligent reminder functions, but it does not affect your use of other basic business functions."}
{"task": "rw_79.jsonl", "id": 63997, "text": "9. Binding school function", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63998, "text": "When you fill in school information, we can recommend nearby school information for you, so that you can bind your own school in time.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 63999, "text": "If you use this function, we need to obtain your geographical location permissions. When you turn on the permissions, we will collect your positioning information.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "We need to obtain your geographical location permissions. When you turn on this authority, we will collect your positioning information."}
{"task": "rw_79.jsonl", "id": 64000, "text": "If you refuse to provide the information required for this function or the permissions required for authorization, you will not be able to view nearby schools based on positioning recommendations, but you can still bind the school names by manually adding a school name.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "If you refuse to provide the information required for this function or the permissions required for authorization, you will not be able to view nearby schools based on positioning recommendations, but you can still bind the school names by manually adding a school name."}
{"task": "rw_79.jsonl", "id": 64001, "text": "10. Course recommendation function", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64002, "text": "To facilitate personalized courses, we will collect your browsing situation, click records and purchase information.", "label": ["Important", "First Party Collection Information"], "rewrite": "To facilitate personalized courses, we will collect your browsing situation, click records and purchase information."}
{"task": "rw_79.jsonl", "id": 64003, "text": "If you refuse to provide the information required for this function, you may not be able to use the course recommendation function, but it does not affect your other basic business functions", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide the information required for this function, you may not be able to use the course recommendation function, but it does not affect your other basic business functions."}
{"task": "rw_79.jsonl", "id": 64004, "text": "11. Growing manual function", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64005, "text": "In order to facilitate the analysis of students' comments, we will collect students' names, classroom performance, submitted homework, punch card information, and teacher review information in order to generate students' growth manuals.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect students 'names, classroom performance, submitted homework, punch card information, and teacher review information in order to generate students' growth manuals."}
{"task": "rw_79.jsonl", "id": 64006, "text": "If you choose to subscribe and pay the corresponding fee, you agree to collect and process the above information to achieve this function.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you choose to subscribe and pay the corresponding fee, you agree to collect and process the above information to achieve this function."}
{"task": "rw_79.jsonl", "id": 64007, "text": "Please note that this function requires parents to pay separately. You can voluntarily choose whether to subscribe. If you refuse to subscribe, you will not be able to use this function, but it will not affect your use of other basic business functions.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64008, "text": "12. In order to enter and use some information in more quickly and simply, we have submitted the unsurrefered list, copying the experience value system, replication of excellent job answers, replication of radio station text, copying system notification, copying system notification, copying system notification, copying the experience value system, copying the experience value system.When joining the school, joining the class, and copying the chat page message scene, the text review will read the content of your current clipboard.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will read the content of your current clipboard."}
{"task": "rw_79.jsonl", "id": 64009, "text": "During the registration and use process, when you enter the contents of the input box of account, password, verification code, and setting user information, some Android phones (such as vivo mobile phones) In order to facilitate your input and copy content, you will also read your equipment.The content of the shear plate is the behavior of the Android manufacturer system.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "When you enter the contents of the input box input boxes of the account, password, verification code, and setting user information, some Android phones (such as: vivo mobile phone) In order to facilitate the content of the copy of the copy, the contents of the shear plate of your device will be read."}
{"task": "rw_79.jsonl", "id": 64010, "text": "13. Customer service, dispute processing", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64011, "text": "In order to help you and receive feedback, complaints and reports you use, when you contact us or propose the application for sale after sale, dispute dispute processing, in order to ensure your account and system security, we need you to provide the necessary personal informationIncluding the content and contact information you submit, and the service records, communication and call records formed accordingly.", "label": ["Important", "First Party Collection Information"], "rewrite": "We need you to provide the necessary personal information, including the content and contact information you submitted, and the service records, communication and call records formed accordingly."}
{"task": "rw_79.jsonl", "id": 64012, "text": "We will send you important notice to you through the contact information you provide, including the changes in the relevant information and terms, conditions and policies of the purchase.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64013, "text": "Because this information is crucial to the communication between you and us, it is also to protect your legitimate rights and interests. Unless you stop using the \"class optimization master\" software, you will receive such information.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64014, "text": "In order to allow you to have a better experience and improve our services, under the premise of compliance with laws and regulations, we may invite you to participate in investigations on our services through the contact information you provide.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64015, "text": "If you don't want to receive our customer service survey, you can get in touch with us through the contact information provided in this privacy policy at any time.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64016, "text": "14. Marketing information", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64017, "text": "We will use your mobile phone number and email to send you the latest product release, software update and event trailer information (\"marketing information\") to you.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64018, "text": "We will fill in the withdrawal options in marketing information. If you don't want to receive our marketing information, you can be withdrawing bips at any time according to the prompts in the marketing information, or contact us through the contact information provided in this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64019, "text": "We may recommend you to other products and services that are suitable for you according to your product and service situation or preference information.", "label": ["Important", "Usage"], "rewrite": "We may recommend you to other products and services that are suitable for you according to your product and service situation or preference information."}
{"task": "rw_79.jsonl", "id": 64020, "text": "You can see the courses we recommend to you on your parent -side homepage. Click [View All] on the right to view all courses (non -personalized push).", "label": ["Edit/Control", "Usage", "Important"], "rewrite": "You can see the courses we recommend to you on your parent -side homepage. Click [View All] on the right to view all courses (non -personalized push)."}
{"task": "rw_79.jsonl", "id": 64021, "text": "If you don't want to receive our personalized push, you can click \"I\",->, settings,->, privacy settings,-> personalized recommendation switch to close the function.", "label": ["Important", "Edit/Control"], "rewrite": "If you don't want to receive our personalized push, you can turn off the function by clicking \"I\" -> Settings-> Privacy Settings-> Personalized Recommended Switch."}
{"task": "rw_79.jsonl", "id": 64022, "text": "(3) Removal of personal information that obtains consent and use in accordance with the law", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64023, "text": "Please understand that in the following situations, according to laws and regulations and related national standards, we collect and use your personal information without obtain your authorization consent:", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "In the following situations, we collect and use your personal information without obtain your authorization consent:"}
{"task": "rw_79.jsonl", "id": 64024, "text": "1) Directly related to national security and national defense security;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting personal information directly related to national security and national defense security does not need to solicit consent."}
{"task": "rw_79.jsonl", "id": 64025, "text": "2) In order to deal with emergencies (such as epidemic), or in urgent situations, it is necessary to protect the health and property security of natural people;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting personal information to deal with emergencies (such as epidemics), there is no need to solicit consent."}
{"task": "rw_79.jsonl", "id": 64026, "text": "3) Directly related to criminal investigation, prosecution, trial and judgment execution;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect direct personal information related to criminal investigation, prosecution, trial, and execution of judgments without asking for consent."}
{"task": "rw_79.jsonl", "id": 64027, "text": "4) For major legitimate rights and interests such as the life and property of the subject of personal information or other individuals, it is difficult to get my consent;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting major legitimate rights and interests such as life and property, but it is difficult to obtain personal information that I agree, without asking for consent."}
{"task": "rw_79.jsonl", "id": 64028, "text": "5) In accordance with the provisions of the \"Personal Information Protection Law of the People's Republic of China\", handle your own or other legal personal information in a reasonable scope. Except for your clear rejection, when the collected information has a significant impact on your personal rights and interests,We will obtain your consent according to law;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "In accordance with the provisions of the Personal Information Protection Law of the People's Republic of China, handle your own or other legal personal information in a reasonable scope. Except for your clear rejection, when the collected information has a significant impact on your personal rights, we willGet your consent according to law."}
{"task": "rw_79.jsonl", "id": 64029, "text": "6) Your personal information collected from the legal publicly disclosed information, such as legal news reports and government information disclosure;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Your personal information collected from the legal disclosure information does not need to ask for consent."}
{"task": "rw_79.jsonl", "id": 64030, "text": "7) It is necessary to sign or perform a contract according to your request;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collection of personal information necessary for signing or performing the contract does not need to solicit consent."}
{"task": "rw_79.jsonl", "id": 64031, "text": "8) The necessary and stable operation for maintaining software and related services, such as discovering and disposing of software and related services;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting the personal information necessary for the safe and stable operation of maintenance software and related services, there is no need to solicit consent."}
{"task": "rw_79.jsonl", "id": 64032, "text": "9) Implement news reports, public opinion supervision, etc. for the public interest, and process personal information within a reasonable range;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "In order to implement news reports and public opinion supervision, deal with personal information within a reasonable scope without soliciting consent."}
{"task": "rw_79.jsonl", "id": 64033, "text": "10) Academic research institutions are necessary to carry out statistics or academic research in accordance with public interests, and provide the results of academic research or descriptions to identify the personal information contained in the results;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If it is necessary for an academic research institution to conduct statistical or academic research based on the public interest and provide the results to the outside world, it does not need to seek consent for the de-identification of the personal information contained in the results."}
{"task": "rw_79.jsonl", "id": 64034, "text": "11) To fulfill the statutory duties or the requirements of the statutory volunteer;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting and fulfilling the personal information necessary for legal duties or the required obligations of the legal obligation does not need to solicit consent."}
{"task": "rw_79.jsonl", "id": 64035, "text": "12) Other circumstances stipulated in laws and regulations.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting personal information under other circumstances stipulated by laws and regulations does not require consent."}
{"task": "rw_79.jsonl", "id": 64036, "text": "(4) Reminders about sensitive personal information", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64037, "text": "Please note that personal sensitive information refers to personal information once it is leaked, illegally provided or abused that may endanger people's body and property, which is easy to lead to personal information that causes personal reputation, physical and mental health damage or discriminatory treatment.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64038, "text": "Under normal circumstances, the personal information of children under the age of 14 and the information involved in natural person privacy is personal sensitive information, and you may include your personal sensitive information, including your personal information, including personal creature information, including your personal information, including personal creatures, including personal creatures, including personal creaturesIdentification information (including facial recognition features, sound patterns, etc.), bank accounts, transactions and consumption records, ID numbers and other privacy policies listed in personal sensitive information.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64039, "text": "Please be cautious and pay attention to your personal sensitive information. You authorize to agree to provide your personal sensitive information, that is, it means that you agree that we can handle your personal sensitive information according to the purpose and method described in this rule.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64040, "text": "If you provide your personal information, please make sure you have obtained the consent of the relevant personal information subject.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you provide your personal information, please make sure you have obtained the consent of the relevant personal information subject."}
{"task": "rw_79.jsonl", "id": 64041, "text": "If you find that the user's personal information is uploaded and published without your authorization consent in the product or service, please contact us in time according to this rule. After verification, we will try to delete relevant information as soon as possible.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you find that the user's personal information is uploaded and published without your authorization consent in the product or service, please contact us in time according to this rule. After verification, we will try to delete relevant information as soon as possible."}
{"task": "rw_79.jsonl", "id": 64042, "text": "3. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64043, "text": "(1) What is Cookie?", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64044, "text": "Cookie is a small file transmitted and stored on your device.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64045, "text": "Our websites, online services, interactive applications, and advertisements may use cookies and other similar technologies, such as pixel labels and websites beaches, User Agent.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64046, "text": "Cookie may be stored on your device.", "label": ["Important", "First Party Collection Information"], "rewrite": "Cookie may be stored on your device."}
{"task": "rw_79.jsonl", "id": 64047, "text": "(2) Cookie we use", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64048, "text": "1. We use cookies or similar tracking techniques to remember your login account and password so that you can log in directly in the future;", "label": ["Important", "First Party Collection Information"], "rewrite": "We use cookie or similar tracking technologies to remember your login account and password so that you can log in to use directly in the future."}
{"task": "rw_79.jsonl", "id": 64049, "text": "At the same time, we use cookies or similar tracking techniques to better understand the frequency of your product, events that occur in the product, cumulative use, performance data, and the overall audience feature information of the user group, so that we can analyze trends, manage websites, track websites, track websitesUser behavior.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We can better understand the frequency of your product, events in the product, cumulative use, performance data, and overall audience feature information of your product, the events in the product, the incidents of the product, the incidents in the product."}
{"task": "rw_79.jsonl", "id": 64050, "text": "2. Like most websites, we will automatically collect certain information to analyze accumulated trends and manage our website.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Like most websites, we will automatically collect certain information to analyze accumulated trends and manage our website."}
{"task": "rw_79.jsonl", "id": 64051, "text": "This information includes the Internet protocol (IP) address, browser type, Internet service provider (ISP), reference/exit page, files (including HTML pages, graphics), operating systems, date/time stamps you view on our websiteAnd/or click flow data.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64052, "text": "3. Clear/disable Cookie", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64053, "text": "Management of cookies and cookies must be completed within the option/preference of your browser.", "label": ["Important", "Edit/Control"], "rewrite": "Management of cookies and cookies must be completed within the option/preference of your browser."}
{"task": "rw_79.jsonl", "id": 64054, "text": "The following is a guide to how to perform this operation in common browser software:", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64055, "text": " Microsoft Internet Explorer", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64056, "text": " Microsoft Edge", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64057, "text": " Mozilla Firefox", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64058, "text": " Google Chrome", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64059, "text": " Safari for macOS", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64060, "text": " Safari for iOS", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64061, "text": "(3) More information about cookies", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64062, "text": "For more information about cookies and instructions on how to set your browser to accept, delete or disable cookies, please see www.allaboutcookies.org.", "label": ["Important", "Edit/Control"], "rewrite": "For more information about cookies and instructions on how to set your browser to accept, delete or disable cookies, please see www.allaboutcookies.org."}
{"task": "rw_79.jsonl", "id": 64063, "text": "Please note that when you change your browser settings to close the cookie or use the browser's \"Anonymous Browse\" function, Cookie will not continue to collect your personal information, but some of the corresponding on the website are used to improve your browsingThe function of experience will not be used.", "label": ["Important", "First Party Collection Information", "Edit/Control"], "rewrite": "When you change your browser settings to close the cookie or use the browser's \"Anonymous Browse\" function, Cookie will not continue to collect your personal information."}
{"task": "rw_79.jsonl", "id": 64064, "text": "Please know that according to applicable laws, we may study, analyze and predict the collected information to improve our content and layout, provide product or service support for business decisions, and improve our products.And service (including the use of anonymous data for machine learning or model algorithm training), if we take technical measures and other necessary measures for personal information, so that the data receiver cannot re -identify specific individuals and cannot be restored.You do nt need to notify you separately and obtain your consent.", "label": ["Important", "First Party Collection Information", "Data Security", "Risk"], "rewrite": "We may study, statistical analysis and prediction of collected information to improve our content and layout."}
{"task": "rw_79.jsonl", "id": 64065, "text": "4. We sharing, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64066, "text": "(1) Entrusted processing", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64067, "text": "Some specific modules or functions in our product function may be provided by external suppliers.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64068, "text": "For companies, organizations, and individuals who commission our personal information, we will sign a strict confidentiality agreement with them, and with its agreed purpose, time limit, processing method, type of personal information, protection measures, and the rights and obligations of both parties, etc.We will supervise their personal information processing activities and ask them to handle personal information in accordance with our requirements, this policy, and any other related confidentiality and security measures.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For companies, organizations, and individuals who commission our personal information, we will sign a strict confidentiality agreement with them, and agreed that the purpose, time limit, processing method, the types of personal information, the types of protection measures, and the rights and obligations of both parties are agreed."}
{"task": "rw_79.jsonl", "id": 64069, "text": "(2) Sharing", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64070, "text": "When you use our services, you agree that your personal information can be disclosed to teachers, other parents and students in the class.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When you use our services, you agree that your personal information can be disclosed to teachers, other parents and students in the class."}
{"task": "rw_79.jsonl", "id": 64071, "text": "In addition, we will not share your personal information with any company, organization and individual, except for the following situations: except:", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "In addition, we will not share your personal information with any company, organization and individual, except for the following situations: except:"}
{"task": "rw_79.jsonl", "id": 64072, "text": "1. Shared with clear consent: After getting your clear consent, we will share your personal information with other parties.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "After getting your clear consent, we will share your personal information with other parties."}
{"task": "rw_79.jsonl", "id": 64073, "text": "2. We may share your personal information to the outside world in accordance with the provisions of laws and regulations, or in accordance with the mandatory requirements of the government authority.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "We may share your personal information to the outside world in accordance with the provisions of laws and regulations, or in accordance with the mandatory requirements of government authorities."}
{"task": "rw_79.jsonl", "id": 64074, "text": "3. Share with our affiliates: Your personal information may be shared with our affiliated company.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Your personal information may be shared with our affiliated companies."}
{"task": "rw_79.jsonl", "id": 64075, "text": "We will only share the necessary personal information and be restricted by the purpose declared in this privacy policy.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will only share the necessary personal information and be restricted by the purpose declared in this privacy policy."}
{"task": "rw_79.jsonl", "id": 64076, "text": "If related companies want to change the purpose of personal information, they will solicit your authorization consent again.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If related companies want to change the purpose of personal information, they will solicit your authorization consent again."}
{"task": "rw_79.jsonl", "id": 64077, "text": "4. Sharing with authorized partners: Only in order to achieve the purpose of this policy, some of our services will be provided by authorized partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to achieve the purpose of this policy, some of our services will be provided by authorized partners."}
{"task": "rw_79.jsonl", "id": 64078, "text": "We may share some of your personal information with our partners to provide better customer service and user experience.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share some of your personal information with our partners to provide better customer service and user experience."}
{"task": "rw_79.jsonl", "id": 64079, "text": "At present, our authorized partners include: suppliers, service providers, advertisers and other partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Our authorized partners include: suppliers, service providers, advertisers and other partners."}
{"task": "rw_79.jsonl", "id": 64080, "text": "We send information to suppliers, service providers, advertisers and other partners that support our business in China. These support include providing technical infrastructure services, analyzing the use of us services, measurement of service effectiveness, providing customers to provide customersServices, payment convenience or academic research and investigation.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We send information to suppliers, service providers, advertisers and other partners that support our business in China."}
{"task": "rw_79.jsonl", "id": 64081, "text": "Service description, privacy policy, and any other related confidentiality and security measures to handle personal information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will strictly test the application interface (API) and software tool development package (SDK) of authorized partners to obtain relevant information, and strict data protection measures with authorized partners."}
{"task": "rw_79.jsonl", "id": 64082, "text": "At present, the third -party SDK tools we access to collect the purpose, method, and scope of the use of personal information are shown in details.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "For the purpose, method, and scope of the third -party SDK tools we access to use personal information, please refer to 12. Appendix \"Class Optimization Master Third -Party SDK Catalog\"."}
{"task": "rw_79.jsonl", "id": 64083, "text": "Regarding the sharing information related to advertising, the content and advertisements in the class optimization master may be provided to you by our affiliated parties, third parties, or our software service providers, smart device providers, and system service providers.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Regarding the sharing information related to advertising, the content and advertisements in the class optimization master may be provided to you by our affiliated parties, third parties, or our software service providers, smart device providers, and system service providers."}
{"task": "rw_79.jsonl", "id": 64084, "text": "Unless you get your permission, we will not share your personal identity information with partners of content, advertising, and analysis services.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Unless you get your permission, we will not share your personal identity information with partners of content, advertising, and analysis services."}
{"task": "rw_79.jsonl", "id": 64085, "text": "However, we will share the de -identified personal information with these service providers to form an indirect portrait label and device information or anonymous information that does not recognize your personal identity to help it not identifyUnder the premise of your personal identity, improve the effective touch rate of advertising and help us analyze and measure the effectiveness of advertising and related services.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "However, we will share the identified personal information with these service providers to form an indirect portrait label and de -identified device information or anonymous information that does not recognize your personal identity."}
{"task": "rw_79.jsonl", "id": 64086, "text": "Companies, organizations and individuals who share personal information with us, we will sign a strict confidentiality agreement with them, asking them to handle personal information in accordance with our instructions, privacy policies, and any other related confidentiality and security measures.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Companies, organizations and individuals who share personal information with us, we will sign a strict confidentiality agreement with them, asking them to handle personal information in accordance with our instructions, privacy policies, and any other related confidentiality and security measures."}
{"task": "rw_79.jsonl", "id": 64087, "text": "(3) Transfer", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64088, "text": "We will not transfer your personal information to any company, organization and individual, except the following situations: except:", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "We will not transfer your personal information to any company, organization and individual, except the following situations: except:"}
{"task": "rw_79.jsonl", "id": 64089, "text": "1. In the case of obtaining clear consent: After getting your clear consent, we will transfer your personal information to other parties;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "After getting your clear consent, we will transfer your personal information to other parties."}
{"task": "rw_79.jsonl", "id": 64090, "text": "2. When involving mergers, acquisitions, or bankruptcy liquidation, if personal information is transferred, we will require new companies and organizations that hold your personal information to continue to be subject to this privacy policy. Otherwise, we will ask the company and organization to organize the organization and organizationRe -solicitting authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "When involving mergers, acquisitions, or bankruptcy liquidation, if personal information is transferred, we will require new companies and organizations that hold your personal information to continue to be subject to this privacy policy.You ask for authorization consent."}
{"task": "rw_79.jsonl", "id": 64091, "text": "(4) Public disclosure", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64092, "text": "We will only publicly disclose your personal information in the following circumstances:", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64093, "text": "1. After getting your clear consent;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64094, "text": "2. Based on legal disclosure: We may disclose your personal information publicly in the case of legal, legal procedures, litigation or government authorities.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the case of compulsory requirements of legal, legal procedures, litigation, or government authorities, we may disclose your personal information publicly."}
{"task": "rw_79.jsonl", "id": 64095, "text": "(5) Sharing, transfer, and public disclosure of disclosure of personal information.", "label": ["Third Party Sharing/ Disclosure", "Risk"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64096, "text": "In the following circumstances, sharing, transfer, and publicly disclose your personal information without obtaining your authorization consent in advance:", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "In the following circumstances, sharing, transfer, and publicly disclose your personal information without obtaining your authorization consent in advance:"}
{"task": "rw_79.jsonl", "id": 64097, "text": "1), related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Sharing information related to national security and national defense security does not need to solicit consent."}
{"task": "rw_79.jsonl", "id": 64098, "text": "2), related to our obligations stipulated in laws and regulations;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Sharing personal information related to the obligations stipulated in our laws and regulations does not need to solicit consent."}
{"task": "rw_79.jsonl", "id": 64099, "text": "2) Directly related to public safety, public health, and major public interests;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Personal information directly related to public safety, public health, and direct public interests does not need to solicit consent."}
{"task": "rw_79.jsonl", "id": 64100, "text": "3), directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Direct related personal information such as sharing with criminal investigation, prosecution, trial and judgment execution does not need to solicit consent."}
{"task": "rw_79.jsonl", "id": 64101, "text": "4) For major legitimate rights and interests such as maintaining your or other individuals, but it is difficult to get my consent;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Share major legitimate rights and interests such as life and property, but it is difficult to obtain personal information that I agree, without asking for consent."}
{"task": "rw_79.jsonl", "id": 64102, "text": "5), personal information that you disclose to the public by yourself;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Share personal information that you disclose to the public yourself without asking for consent."}
{"task": "rw_79.jsonl", "id": 64103, "text": "6) Collect personal information from the legal disclosure information, such as legal news reports, government information disclosure and other channels;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "If you collect personal information from the legal disclosure information, you do not need to ask for consent."}
{"task": "rw_79.jsonl", "id": 64104, "text": "7) Signing and fulfilling the contract according to your requirements;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "The personal information necessary for sharing and performance of the contract does not need to ask for consent."}
{"task": "rw_79.jsonl", "id": 64105, "text": "8), maintain the safe and stable operation of the product or service provided by the product or service, such as discovering and disposing of products or services.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "The personal information necessary for sharing the safe and stable operation of products or services does not require consent."}
{"task": "rw_79.jsonl", "id": 64106, "text": "According to the law, the personal information of sharing and transferred the identification processing, and ensure that the data receiver cannot restore and re -identify the subject of personal information, which does not belong to the external sharing, transfer and public disclosure of personal information.Save and processing will not be notified to you separately and obtain your consent.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "If the personal information of sharing and transfer is removed, and ensure that the data receiver cannot restore and re -identify the subject of the personal information, it is not a personal information to share, transfer and publicly disclose behavior. The preservation and processing of such data will beNo need to notify you and obtain your consent."}
{"task": "rw_79.jsonl", "id": 64107, "text": "We may use the collected personal information after anonymous processing for big data analysis, such as the heating diagram and insight report that does not contain any personal information.", "label": ["Important", "Risk", "Usage"], "rewrite": "242 of 590 We may use the collected personal information after anonymous processing for big data analysis, such as the heating map and insight report that does not contain any personal information."}
{"task": "rw_79.jsonl", "id": 64108, "text": "We may disclose and share information with our partners with information that does not include identity recognition content after statistical processing, to understand how users use our service or let the public understand the overall trend of our service.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "We may disclose and share information with our partners with information that does not include identity recognition content after statistical processing, to understand how users use our service or let the public understand the overall trend of our service."}
{"task": "rw_79.jsonl", "id": 64109, "text": "5. How do we protect your personal information", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64110, "text": "1. Technical protection", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64111, "text": "In order to ensure your information security, we strive to take various reasonable physical, technical and management security measures that meet industry standards to protect your information, so that your information will not be leaked, damaged or lostSSL, information encryption storage, de -identification, and data center access control.", "label": ["Important", "Data Security"], "rewrite": "We strive to take various reasonable physical, technical and management security measures that meet industry standards to protect your information."}
{"task": "rw_79.jsonl", "id": 64112, "text": "We will use encryption technology to improve the security of personal information;", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64113, "text": "We will use a trusted protection mechanism to prevent personal information from being maliciously attacked;", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64114, "text": "We will deploy the access control mechanism and try our best to ensure that only authorized personnel can access personal information;", "label": ["Important", "Data Security"], "rewrite": "We will deploy the access control mechanism to make every effort to ensure that only authorized personnel can access personal information."}
{"task": "rw_79.jsonl", "id": 64115, "text": "We will manage your personal information classification.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64116, "text": "2. Security system guarantee", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64117, "text": "We have the industry's advanced data security management system based on data -centered data and data security management systems around the data life cycle. From the aspects of organizational construction, system design, personnel management, product technology, and personal information security impact assessment, the security of the entire system is improved.", "label": ["Important", "Data Security"], "rewrite": "We have the industry's advanced data security management system based on data -centered data and data security management systems around the data life cycle. From the aspects of organizational construction, system design, personnel management, product technology, and personal information security impact assessment, the security of the entire system is improved."}
{"task": "rw_79.jsonl", "id": 64118, "text": "3. Personnel safety management", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64119, "text": "We have also adopted strict management of employees or outsourcing personnel who may contact you, including but not limited to adopting different permissions control according to different jobs, signing confidentiality agreements with them, monitoring their operations.", "label": ["Important", "Data Security"], "rewrite": "We have also adopted strict management of employees or outsourcing personnel who may contact you, including but not limited to adopting different permissions control according to different jobs, signing confidentiality agreements with them, monitoring their operations."}
{"task": "rw_79.jsonl", "id": 64120, "text": "We will provide corresponding security measures in accordance with existing technologies to protect your information and provide reasonable security guarantee. We will try our best to make your information from being leaked, damaged or lost.", "label": ["Important", "Data Security"], "rewrite": "We will provide corresponding security measures in accordance with existing technologies to protect your information and provide reasonable security guarantee. We will try our best to make your information from being leaked, damaged or lost."}
{"task": "rw_79.jsonl", "id": 64121, "text": "We will organize safety and privacy protection training courses, formulate and organize the implementation of emergency plans for personal information security incidents, and regularly organize internal personnel to conduct emergency response training and emergency drills, so that they can master job duties and emergency disposal strategies and regulations.", "label": ["Important", "Data Security"], "rewrite": "We will organize safety and privacy protection training courses, formulate and organize the implementation of emergency plans for personal information security incidents, and regularly organize internal personnel to conduct emergency response training and emergency drills, so that they can master job duties and emergency disposal strategies and regulations."}
{"task": "rw_79.jsonl", "id": 64122, "text": "4. Information security protection tips", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64123, "text": "(1) Please keep the SMS verification code you used when you log in to assist us in ensuring your account security.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64124, "text": "We will try our best to ensure the security of any information you send to us.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64125, "text": "If our physical, technical, or management protection facilities are damaged, the information is caused by unauthorized access, public disclosure, tampering or destruction, which will cause your legitimate rights and interests to be damaged, and we will bear the corresponding legal responsibility.", "label": ["Important", "Data Security"], "rewrite": "If our physical, technical, or management protection facilities are damaged, the information is caused by unauthorized access, public disclosure, tampering or destruction, which will cause your legitimate rights and interests to be damaged, and we will bear the corresponding legal responsibility."}
{"task": "rw_79.jsonl", "id": 64126, "text": "(2) Your account has a security protection function. Please keep your account and your SMS verification code.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64127, "text": "We will ensure that your information is not lost and will not be abused and altered by backup security measures such as backup and encryption of user passwords.", "label": ["Important", "Data Security"], "rewrite": "We will ensure that your information is not lost and will not be abused and altered by backup security measures such as backup and encryption of user passwords."}
{"task": "rw_79.jsonl", "id": 64128, "text": "However, the Internet is not an absolutely secure environment, and the communication method of communicating with other users cannot determine whether it is completely encrypted. We strongly recommend that you use complex passwords and regularly modify when using such tools when using such tools.Passwords, refusal to disclose personal account passwords, etc., and pay attention to protecting information security.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64129, "text": "(3) Information disclosure prompt and verification code leakage processing: We strongly recommend that you must keep your personal information and other identity elements properly when using this software and related services.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64130, "text": "When using our service, if you inevitably disclose your personal information to the other party or the potential transaction of the transaction (such as bank account information, contact method, or mailing address), please only provide others with the necessary circumstances to provide others with othersEssence", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64131, "text": "If you find your personal information leakage, especially your account and SMS verification code, please contact us immediately so that we can take corresponding measures.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64132, "text": "(4) Information security incident processing.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64133, "text": "After unfortunately a personal information security incident, we will inform you in accordance with the requirements of the laws and regulations: the basic situation and possible impact of the security incident, the disposal measures we have taken or we will take, the suggestions that you can prevent and reduce the risk,Remedy for your remedy.", "label": ["Important", "Data Security"], "rewrite": "After unfortunately a personal information security incident, we will inform you in accordance with the requirements of laws and regulations: basic situations and possible impacts, disposal measures, suggestions, remedial measures, etc."}
{"task": "rw_79.jsonl", "id": 64134, "text": "In the event related to the incident, we will inform you in the form of mail, letter, telephone, push notification, etc. When it is difficult to inform the subject of personal information one by one, we will publish an announcement in a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "In the event related to the incident, we will inform you in the form of mail, letter, telephone, push notification, etc. When it is difficult to inform the subject of personal information one by one, we will publish an announcement in a reasonable and effective way."}
{"task": "rw_79.jsonl", "id": 64135, "text": "At the same time, we will also report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "We will also report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities."}
{"task": "rw_79.jsonl", "id": 64136, "text": "(5) The Internet environment is not 100 % security. We will try our best to ensure or guarantee the security of your personal information you send to our personal information.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64137, "text": "Due to the technical restrictions and the limitations of risk prevention, even if we have tried to strengthen security measures, we cannot always ensure that information is 100 % security.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64138, "text": "You need to understand that the system and communication network you use to access our services may occur due to the situation outside the control scope.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64139, "text": "If our physics, technology, or management protection facilities are damaged, personal information is caused by non -authorized access, public disclosure, tampering, or destruction, resulting in damage to your legitimate rights and interests, we will bear the corresponding legal responsibility.", "label": ["Important", "Data Security"], "rewrite": "If our physics, technology, or management protection facilities are damaged, personal information is caused by non -authorized access, public disclosure, tampering, or destruction, resulting in damage to your legitimate rights and interests, we will bear the corresponding legal responsibility."}
{"task": "rw_79.jsonl", "id": 64140, "text": "6. Your right to your personal information", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64141, "text": "We respect your right to your personal information.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64142, "text": "The rights you enjoy in accordance with the law, and how we will protect these rights.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64143, "text": "Please note that before safety reasons, we may ask you to verify your identity before handling your request.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64144, "text": "During your use of class optimization masters, in order to make more convenient access, correction, and deleting your personal information, we provide you with the corresponding operation settings in the product design. You can refer to the following guidelines for operation.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64145, "text": "(1) Visit your personal information: If you want to exercise the right to access, you can contact us through the after -sales telephone and WeChat public account, or check directly in the class optimization master APP.", "label": ["Important", "Edit/Control"], "rewrite": "If you want to exercise the right to access, you can contact us through the after -sales telephone and WeChat public account, or check directly in the class optimization master APP."}
{"task": "rw_79.jsonl", "id": 64146, "text": "The steps of accessing the information including the product serial number, model, and storage meeting information:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64147, "text": "1. Teacher users access the avatars, accounts, nicknames (that is, \"name, the same below), school, subject section, region, and binding WeChat basic information.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64148, "text": "1) After entering the class optimization master, click [Me]", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64149, "text": "2) Click the icon in the upper right corner, click [Personal Information]", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64150, "text": "3) For information query access", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64151, "text": "2. Teacher users access the class address book information, the following operation method can be passed:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64152, "text": "1) After entering the class optimization master, click [Address]", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64153, "text": "2) For information query access", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64154, "text": "3. Teacher users can access chat information, and the following operations can be used:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64155, "text": "1) After entering the class optimization master, click [Address]", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64156, "text": "2) Click [Chat Information]", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64157, "text": "3) For information query access", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64158, "text": "4. Parental users access the avatars, accounts, nicknames (that is, \"name, the same below), the area where it is located, and the basic information of WeChat is bound to the following operation method:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64159, "text": "1) After entering the class optimization master, click [Me]", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64160, "text": "2) Click the icon in the upper right corner, click [Personal Information]", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64161, "text": "3) For information query access", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64162, "text": "5. Parents and users access the class address book information, the following operations can be passed:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64163, "text": "1) After entering the class optimization master, click on the blue communication icon in the upper right corner on the homepage of the classroom", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64164, "text": "2) For information query access", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64165, "text": "6. Parental users access the class address book information, the following operations can be used:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64166, "text": "1) After entering the class optimization master, click on the blue communication icon in the upper right corner on the homepage of the classroom", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64167, "text": "2) Click [Chat Information]", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64168, "text": "3) For information query access", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64169, "text": "(2) Correct your personal information: When you find that we have a mistake on your personal information, you have the right to ask us to make corrections or make corrections by yourself.", "label": ["Important", "Edit/Control"], "rewrite": "When you find that we have the error about your personal information, you have the right to ask us to correct or correct it through the product."}
{"task": "rw_79.jsonl", "id": 64170, "text": "You can contact us to ask us to correct your information through the after -sales telephone.", "label": ["Edit/Control", "Important"], "rewrite": "You can contact us to ask us to correct your information through the after -sales telephone."}
{"task": "rw_79.jsonl", "id": 64171, "text": "After confirmation, we will correct it.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64172, "text": "In the class optimization master APP, you can correct the nickname, avatar, subject segment, and personal profile, and correct steps:", "label": ["Important", "Edit/Control"], "rewrite": "In the class optimization master APP, you can correct the nickname, avatar, subject section and personal profile."}
{"task": "rw_79.jsonl", "id": 64173, "text": "1. Teacher users change the avatar, account number, nickname (that is, \"name\", the same below), school, subject section, region, and binding WeChat basic information.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64174, "text": "1) After entering the class optimization master, click [Me]", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64175, "text": "2) Click the icon in the upper right corner, click [Personal Information]", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64176, "text": "3) Correct operation", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64177, "text": "2. Teacher users change the login password, replace the mobile phone number, set up working hours, set up the mobile phone number to the class members, switch the parent status, can pass the following operation method:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64178, "text": "1) After entering the class optimization master, click [Me]", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64179, "text": "2) Click the icon in the upper right corner", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64180, "text": "3) Correct operation", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64181, "text": "3. Parents users change the avatar, account number, nickname (that is, \"name\", the same below), the area where it is, and the basic information of WeChat.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64182, "text": "1) After entering the class optimization master, click [Me]", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64183, "text": "2) Click the icon in the upper right corner, click [Personal Information]", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64184, "text": "3) Correct operation", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64185, "text": "4. Parents users change the login password, replace the mobile phone number, set the eye protection mode, and switch the teacher status. The following operation method can be used:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64186, "text": "1) After entering the class optimization master, click [Me]", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64187, "text": "2) Click the icon in the upper right corner", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64188, "text": "3) Correct operation", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64189, "text": "(3) Delete your personal information: If we have no legal reasons to continue holding and processing your information, you can delete relevant content information through the following path or contact us with WeChat public account and ask us to delete your personal informationThe", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64190, "text": "1. Teacher users delete chat information:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64191, "text": "1) After entering the class optimization master, click [Broadcasting Station]", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64192, "text": "2) Click the message icon in the upper right corner to open the historical chat record in the message list", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64193, "text": "3) Long -press need to delete information, click [Delete]", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64194, "text": "2. Teacher users delete the radio station operation/notification/punch card information:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64195, "text": "1) After entering the class optimization master, click [Broadcasting Station]", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64196, "text": "2) Find the notification/job/check -in information that needs to be deleted, click the [Delete] button in the upper right corner", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64197, "text": "3) Click [Confirm] on the pop -up window to delete the information", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64198, "text": "3. Teacher users to delete the topic of tea rooms:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64199, "text": "1) After entering the class optimization master, click the tea room icon on the upper right corner on the homepage", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64200, "text": "2) Click on the topic [see what you say]", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64201, "text": "3) Find the view information you want to delete, click on the right []", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64202, "text": "4) Click [Delete Dynamics] to delete the viewpoint information", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64203, "text": "4. Parents users delete chat information:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64204, "text": "1) After entering the class optimization master, click on the blue communication icon in the upper right corner on the homepage of the classroom", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64205, "text": "2) Click [chat message] to open historical chat records in the message list", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64206, "text": "3) Long -press need to delete information, click [Delete]", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64207, "text": "5. Parents users delete the binding child information:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64208, "text": "1) After entering the class optimization master, click on the child's name on the homepage of the classroom, and expand the drop -down menu", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64209, "text": "2) Click in the drop -down menu to lift the binding child", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64210, "text": "3) Click [Exit the current Class] to lift the binding", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64211, "text": "In the following circumstances, you can make a request to delete personal information:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64212, "text": "1. If our behavior of handling personal information violates laws and regulations;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64213, "text": "2. If we collect and use your personal information, it has not obtained your consent;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64214, "text": "3. If our behavior of handling personal information violates your agreement;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64215, "text": "4. If you no longer use our products or services, or you cancel your account;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64216, "text": "5. If we no longer provide products or services for you.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64217, "text": "If we decide to respond to your deletion request, we will also also notify the entities that obtain your personal information from our personal information and ask them to delete them in time, unless laws and regulations have other regulations, or these entities have obtained your independent authorization.", "label": ["Important", "Edit/Control"], "rewrite": "If we decide to respond to your deletion request, we will also also notify the entities that obtain your personal information from our personal information and ask them to delete them in time, unless laws and regulations have other regulations, or these entities have obtained your independent authorization."}
{"task": "rw_79.jsonl", "id": 64218, "text": "When you delete information from our services, we may not immediately delete the corresponding information in the backup system, but will delete these information when the backup system is updated.", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "When you delete information from our services, we may not immediately delete the corresponding information in the backup system, but will delete these information when the backup system is updated."}
{"task": "rw_79.jsonl", "id": 64219, "text": "(4) The scope of changing your authorization consent: Each business function requires some basic personal information to be completed (see \"How can we collect and process your personal information\").", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64220, "text": "For the collection and use of extra collective personal information, you can give or withdraw your authorization consent at any time. You can contact us through the after -sales telephone and WeChat public account to request to withdraw your authorization consent.", "label": ["Important", "First Party Collection Information", "Edit/Control"], "rewrite": "For the collection and use of extra collective personal information, you can give or withdraw your authorization consent at any time. You can contact us through the after -sales telephone and WeChat public account to request to withdraw your authorization consent."}
{"task": "rw_79.jsonl", "id": 64221, "text": "When you recover your consent, we will no longer process the corresponding personal information.", "label": ["Important", "First Party Collection Information", "Edit/Control"], "rewrite": "When you recover your consent, we will no longer process the corresponding personal information."}
{"task": "rw_79.jsonl", "id": 64222, "text": "But your decision to recover the consent will not affect personal information processing based on your authorization.", "label": ["Permission Acquisition", "Important", "Edit/Control"], "rewrite": "But your decision to recover the consent will not affect personal information processing based on your authorization."}
{"task": "rw_79.jsonl", "id": 64223, "text": "If you don't want to accept us to send personalized push or commercial advertisements, you can collect and process your personal information 14. Cancel in the way of marketing information.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64224, "text": "If you want to withdraw your personal information authorization, you can operate \"I-Settings-About-Withdrawal Authorization\" to withdraw authorization by yourself.", "label": ["Edit/Control", "Important"], "rewrite": "If you want to withdraw your personal information authorization, you can operate \"I-Settings-About-Withdrawal Authorization\" to withdraw authorization by yourself."}
{"task": "rw_79.jsonl", "id": 64225, "text": "If you want to change the authorization of relevant permissions (including: location, address book, camera, album, microphone, notification, and external storage read and write permissions), you can modify it through the application settings of your hardware equipment, or optimize master in the class.The APP settings interface is operated.", "label": ["Important", "Edit/Control"], "rewrite": "If you want to change the authorization of relevant permissions, you can modify it through the application settings of your hardware equipment."}
{"task": "rw_79.jsonl", "id": 64226, "text": "If you use the iOS system terminal device, you can click \"Settings-Privacy\" by clicking on the phone, select the corresponding permissions to select or turn on. If you use the Android system terminal device, you can choose us through \"Settings-Application Management\" to select us.Application, managing its permissions.", "label": ["Important", "Edit/Control"], "rewrite": "If you use the iOS system terminal device, you can click \"Settings-Privacy\" by clicking on the phone, select the corresponding permissions to select or turn on. If you use the Android system terminal device, you can choose us through \"Settings-Application Management\" to select us.Application, managing its permissions."}
{"task": "rw_79.jsonl", "id": 64227, "text": "The mobile phone operation path of different operating systems may be slightly different, and you can close or withdraw your authorization yourself.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64228, "text": "Please understand that each business function requires some necessary personal information to be completed. When you withdraw consent or authorization, we will not be able to continue to provide you with the service and functions corresponding to the withdrawal consent or authorization, and no longer handle your corresponding corresponding correspondencePersonal information.", "label": ["Permission Acquisition", "Important", "Edit/Control"], "rewrite": "Each business function requires some necessary personal information to complete. When you withdraw consent or authorization, we will not be able to continue to provide you with the service and functions corresponding to the withdrawal consent or authorization, and no longer process your corresponding personal information."}
{"task": "rw_79.jsonl", "id": 64229, "text": "But your decision to withdraw consent or authorization will not affect personal information processing based on your authorization.", "label": ["Permission Acquisition", "Important", "Edit/Control"], "rewrite": "But your decision to withdraw consent or authorization will not affect personal information processing based on your authorization."}
{"task": "rw_79.jsonl", "id": 64230, "text": "(5) Logging out your personal account: You can cancel the previously registered account at any time. You can set up in the APP-about-cancel your account to cancel it. After canceling the account, we will stop providing you with products or services, and based on you according to youThe requirements for deleting your personal information, except for laws and regulations.", "label": ["Important", "Edit/Control"], "rewrite": "You can cancel the previously registered account at any time. You can set up in the app-about-cancel your account to cancel. After the cancellation of the account, we will stop providing you with products or services and delete your personal information according to your requirements."}
{"task": "rw_79.jsonl", "id": 64231, "text": "(6) Get your personal information copy and transfer your personal information: You have the right to obtain your personal information copy.", "label": ["Edit/Control", "Important"], "rewrite": "You have the right to obtain your personal information copy."}
{"task": "rw_79.jsonl", "id": 64232, "text": "You can ask us to obtain your personal information copy through the contact information stated by this privacy policy.", "label": ["Important", "Edit/Control"], "rewrite": "You can ask us to obtain your personal information copy through the contact information stated by this privacy policy."}
{"task": "rw_79.jsonl", "id": 64233, "text": "At the same time, under the premise of technical feasibility, for example, the data interface has been matched, and we can also directly transmit your personal information copy to your designated third party according to your requirements.", "label": ["Important", "Edit/Control"], "rewrite": "Under the premise of technical feasibility, for example, the data interface has been matched, and we can also transmit your personal information copy directly to your designated third party according to your requirements."}
{"task": "rw_79.jsonl", "id": 64234, "text": "(7) Complaints and reports: We have set up complaint report channels, and your opinions will be dealt with in a timely manner.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64235, "text": "You can complain and report in the class optimization master with reference to the following steps.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64236, "text": "1) The first step: enter the class optimization master app, click \"mine\";", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64237, "text": "2) Step 2: Click \"Settings\".", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64238, "text": "3) Step 3: Click \"About\".", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64239, "text": "4) Step 4: Click \"Application Report\" or \"Personal Information Security Complaint and Report\".", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64240, "text": "(8) Constraine information system automatic decision -making results", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64241, "text": "You have the right to appeal the results of the automated decision -making of the information system. If you consciously have a significant impact on your rights and interests, you can contact us or appeal to us through the contact information provided by this privacy policy.", "label": ["Edit/Control", "Important"], "rewrite": "You have the right to appeal the results of the automated decision -making of the information system. If you consciously have a significant impact on your rights and interests, you can contact us or appeal to us through the contact information provided by this privacy policy."}
{"task": "rw_79.jsonl", "id": 64242, "text": "(9) In response to your above request", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64243, "text": "To ensure safety, you may need to provide a written request or prove your identity in other ways.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64244, "text": "We may ask you to verify your identity first, and then process your request.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64245, "text": "We will respond within 15 working days.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64246, "text": "For your reasonable request, we do not charge fees in principle, but we will charge a certain cost fee depending on the request that repeats and beyond the reasonable limit.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "For your reasonable request, we do not charge fees in principle, but we will charge a certain cost fee depending on the request that repeats and beyond the reasonable limit."}
{"task": "rw_79.jsonl", "id": 64247, "text": "For those requests that need to be repeated and need too many technical means (including the need to develop new systems or fundamentally change the current practice), bring risks to others' legitimate rights and interests, or very unrealistic (including information involved in backup tapes),We may refuse.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "We may refuse to reject the risks or very unrealistic requests to the legitimate rights and interests of others, and to bring risks or very unrealistic requests to others."}
{"task": "rw_79.jsonl", "id": 64248, "text": "In the following circumstances, we will not be able to respond to your request:", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "In the following circumstances, we will not be able to respond to your request:"}
{"task": "rw_79.jsonl", "id": 64249, "text": "1. What is related to the obligations stipulated in the performance of the personal information controller;", "label": ["Important", "Risk"], "rewrite": "If the obligations stipulated by the Personal Information Controller's Performance of Laws and Regulations, the request cannot be responded."}
{"task": "rw_79.jsonl", "id": 64250, "text": "2. Directly related to national security and national defense security;", "label": ["Important", "Risk"], "rewrite": "Directly related to national security and national defense security cannot respond to requests."}
{"task": "rw_79.jsonl", "id": 64251, "text": "3. Directly related to public safety, public health, and major public interests;", "label": ["Important", "Risk"], "rewrite": "Those who are directly related to public safety, public health, and major public interests cannot respond to requests."}
{"task": "rw_79.jsonl", "id": 64252, "text": "4. Directly related to criminal investigation, prosecution, trial, and execution judgment;", "label": ["Important", "Risk"], "rewrite": "Those who are directly related to criminal investigation, prosecution, trial and execution judgment cannot respond to requests."}
{"task": "rw_79.jsonl", "id": 64253, "text": "5. Personal information controller has sufficient evidence to indicate that the subject of personal information has subjective malice or abuse of rights;", "label": ["Important", "Risk"], "rewrite": "Personal information controller has sufficient evidence to indicate that the subject of personal information has subjective malice or abuse of rights, and cannot respond to the request."}
{"task": "rw_79.jsonl", "id": 64254, "text": "6. For major legitimate rights and interests of the life and property of the subject of personal information or other individuals, it is difficult to get my consent;", "label": ["Important", "Risk"], "rewrite": "Out of maintaining major legitimate rights and interests of the life and property of personal information subjects or other individuals, it is difficult to get my consent and cannot respond to the request."}
{"task": "rw_79.jsonl", "id": 64255, "text": "7. The request of the person in response to the subject of the personal information will cause the legitimate rights and interests of the personal information subject or other individuals and organizations to be seriously damaged;", "label": ["Important", "Risk"], "rewrite": "In response to the request of the subject of the personal information, the legitimate rights and interests of the personal information subject or other individuals and organizations will be severely damaged, and the request cannot be responded."}
{"task": "rw_79.jsonl", "id": 64256, "text": "8. Involved in business secrets.", "label": ["Important", "Risk"], "rewrite": "Those who involve business secrets cannot respond to requests."}
{"task": "rw_79.jsonl", "id": 64257, "text": "For the personal information of the students you provide, if you are a school teacher, please inform us in time when you receive the request of the student and/or parents to exercise the rights of the above data.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64258, "text": "We will respond in accordance with the requirements of applicable laws and regulations. You need to make a reasonable cooperation with the requests of our response to students and/or parents. For example, if students and/or parents need to delete their personal information, you should stop to the \"class optimization master\"Enter the personal information of the student and convey the requests of students and/or parents in time;", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64259, "text": "If you are a parent, you can exercise the above data subject right or you decide to exercise the above data subject rights for students, and contact us through the information of how to contact us in this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64260, "text": "Seven, third -party service providers and their services", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64261, "text": "Please note that this policy is applicable to the various products and services provided by the class optimization master service providers with other new forms that appeared with the development of technology.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64262, "text": "During the service process of using this software, it may include third -party websites, products and services. They may provide different forms such as the link form or other forms such as the third -party website.The three parties are provided.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64263, "text": "When you use these products or services, you may also collect your information. Therefore, we strongly recommend that you read the privacy policy of the third party carefully, and you choose whether to access or accept the websites, products and services provided by a third party.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64264, "text": "We will also fulfill their prudential reminders and basic review obligations, and require third -party to protect your personal information for third -party websites, products and services.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64265, "text": "If you find that these third -party web pages and products and services are risky, it is recommended that you contact them directly to obtain the details of their privacy policies and stop related operations to better protect your legitimate rights and interests.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64266, "text": "8. Personal information storage", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64267, "text": "Storage location: We will store the collected personal information on our [China] server in accordance with the requirements of the applicable Chinese laws and regulations.", "label": ["Data Retention", "Important"], "rewrite": "We will store the collected personal information on our [China] server in accordance with the requirements of the applicable Chinese laws and regulations."}
{"task": "rw_79.jsonl", "id": 64268, "text": "Without your consent, we will not transmit your personal information abroad.", "label": ["Data Retention", "Important"], "rewrite": "Without your consent, we will not transmit your personal information abroad."}
{"task": "rw_79.jsonl", "id": 64269, "text": "If we transmit to overseas, we will follow relevant state regulations or seek your consent.", "label": ["Data Retention", "Important"], "rewrite": "If we transmit to overseas, we will follow relevant state regulations or seek your consent."}
{"task": "rw_79.jsonl", "id": 64270, "text": "Storage period: In addition to laws and regulations, we will store the personal information you provide according to the following period:", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64271, "text": "We will store your personal information to meet our legitimate business needs (including providing you with services or to meet the corresponding legal, tax and financial requirements).", "label": ["Data Retention", "Important"], "rewrite": "We will store your personal information to meet our legitimate business needs."}
{"task": "rw_79.jsonl", "id": 64272, "text": "When we do not need to use the legitimate business needs you provide or the retain time stipulated by Chinese laws and regulations, we will delete your personal information or do it anonymous processing, or be anonymous or deleted to delete it anonymous or deletedIt is impossible to achieve (including your personal information is stored in the backup), securely store your personal information and separate these personal information from other data processing.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "When we do not need to use the legitimate business needs of your personal information or the expiry of the retaining time stipulated by Chinese laws and regulations, we will delete your personal information or processes it anonymously."}
{"task": "rw_79.jsonl", "id": 64273, "text": "If it is a student's personal information, when we stop providing you with the \"class optimization master\" products and services, we will stop the collection of students' personal information and delete our personal information we hold after the expiration of the legal retention period.", "label": ["Data Retention", "Important", "First Party Collection Information"], "rewrite": "If it is a student's personal information, when we stop providing you with the \"class optimization master\" products and services, we will stop the collection of students' personal information and delete our personal information we hold after the expiration of the legal retention period."}
{"task": "rw_79.jsonl", "id": 64274, "text": "Nine, care for minors", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64275, "text": "We attach great importance to the protection of personal information of minors.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64276, "text": "Our products and services are mainly adults.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64277, "text": "If you are a parent or other guardians of children's users, please read and choose whether to agree and agree with this policy and Appendix XIII.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64278, "text": "We hope that you should jointly protect the personal information of children with us, educate and guide children to enhance personal information protection awareness and ability, guide, remind and ask them to provide any online products and service providers without providing any online products and service providers.personal information.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64279, "text": "In order to better protect the rights and interests of children, we may also collect more information from the guardian (such as names, ID cards, household registrations, or other custody relationships) in order to further verify the guardians of the guardian and children, and in accordance with the provisions of laws and regulationsAfter obtaining the consent of the guardian, children are allowed to continue using our related products or services.", "label": ["Specific Audiences", "First Party Collection Information", "Important"], "rewrite": "We may also collect more information from the guardian (such as names, ID cards, household registrations, or other monitoring relationships) in order to further verify the guardianship relationship between guardians and children."}
{"task": "rw_79.jsonl", "id": 64280, "text": "We will take special measures to protect the personal information of your child obtained in accordance with this policy and the \"Personal Information Protection Policy of Master Children and Children in the Class Optimization Master\".", "label": ["Specific Audiences", "Important"], "rewrite": "We will take special measures to protect the personal information of your child obtained in accordance with this policy and the \"Personal Information Protection Policy of Master Children and Children in the Class Optimization Master\"."}
{"task": "rw_79.jsonl", "id": 64281, "text": "If you do not agree with the above policies and rules, please ask your children to stop access/use our products or services immediately.", "label": ["Specific Audiences", "Important"], "rewrite": "If you do not agree with the above policies and rules, please ask your children to stop access/use our products or services immediately."}
{"task": "rw_79.jsonl", "id": 64282, "text": "If there is no consent of the guardian, children shall not create their own user account. If you are a child user, please be sure to notify your guardian to read this policy and the \"Personal Information Protection Policy for Children and Children of the Master of the Master\", and use our products or in our products orBefore serving and submitting personal information, seek the consent and guidance of your guardian.", "label": ["Specific Audiences", "Important"], "rewrite": "Children's users must notify the guardian to read this policy and the \"Personal Information Protection Policy for Children and Children of the Master of the Master\", and seek your consent and guidance of your guardian before you use our products or services and submit personal information."}
{"task": "rw_79.jsonl", "id": 64283, "text": "For the case where parents or guardians agree to use our products or services to collect personal information of minors, we will only use, share, transfer, transfer, transfer, transfer, transfer, transfer, and transfer they are clearly agreed or protected by laws or guardians.Or disclose this information.", "label": ["Specific Audiences", "Important"], "rewrite": "We will only use, share, transfer, or disclose this information if the laws and regulations are allowed, parents or guardians to clearly agree or protect minors."}
{"task": "rw_79.jsonl", "id": 64284, "text": "If we find the personal information of minors without the consent of the proven parents or guardians in advance, we will try to delete relevant information as soon as possible.", "label": ["Specific Audiences", "Important"], "rewrite": "If we find the personal information of minors without the consent of the proven parents or guardians in advance, we will try to delete relevant information as soon as possible."}
{"task": "rw_79.jsonl", "id": 64285, "text": "Although local laws and customs have different definitions of children, we regard anyone under the age of 14 as children.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64286, "text": "10. How to update this privacy policy", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64287, "text": "We reserve the right to update or modify this policy from time to time.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64288, "text": "We will send you a change notice to you through different channels, including your login and version update in the form of push notifications and pop -ups to show you the change of privacy policy after the change, so that you can understand the latest version of this privacy policy in time.", "label": ["Policy Change", "Important"], "rewrite": "We will send you a change notice to you through different channels, including your login and version update in the form of push notifications and pop -ups to show you the change of privacy policy after the change, so that you can understand the latest version of this privacy policy in time."}
{"task": "rw_79.jsonl", "id": 64289, "text": "If you continue to use our services, you agree to accept the content of the revised privacy policy, but if you need to collect your personal sensitive information, you will still solicit your consent again in a significant way.", "label": ["Policy Change", "Important"], "rewrite": "If you continue to use our services, you agree to accept the content of the revised privacy policy, but if you need to collect your personal sensitive information, you will still solicit your consent again in a significant way."}
{"task": "rw_79.jsonl", "id": 64290, "text": "For major changes in privacy policies, we will also provide a more significant notice (we will make a special prompt method on the login page with a pop -up window to explain the specific changes of the privacy policy).", "label": ["Policy Change", "Important"], "rewrite": "For major changes in privacy policies, we will also provide a more significant notice."}
{"task": "rw_79.jsonl", "id": 64291, "text": "This privacy policy is allowed to adjust, but without your consent, we will not weaken the rights you enjoy in accordance with the privacy policy.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64292, "text": "Eleven, how to contact us", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64293, "text": "If you have any questions or doubts about our privacy policy or approach, please contact us through the following ways:", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64294, "text": "Address: No. 192 Science City, Science City, Economic and Technological Development Zone, Guangzhou City, Guangdong Province", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64295, "text": "Electricity, talk:, 020-82260169 (office hours: Monday to Friday 9:00-18: 00, Saturday 9: 00-12: 00)", "label": ["Important", "Contact Information"], "rewrite": "Electricity: 020-82260169 (office hours: Monday to Friday 9: 00-18: 00, Saturday 9: 00-12: 00)."}
{"task": "rw_79.jsonl", "id": 64296, "text": "Email: shanchang@imshine.com", "label": ["Important", "Contact Information"], "rewrite": "Email: shanchang@imshine.com."}
{"task": "rw_79.jsonl", "id": 64297, "text": "QQ705141382", "label": ["Important", "Contact Information"], "rewrite": "QQ705141382"}
{"task": "rw_79.jsonl", "id": 64298, "text": "WeChat public account: class optimization master", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64299, "text": "We have set up a full -time protection department for personal information, and you can contact them in the following ways:", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64300, "text": "Electricity, talk:, 020-82260169 (office hours: Monday to Friday 9:00-18: 00, Saturday 9: 00-12: 00)", "label": ["Important", "Contact Information"], "rewrite": "Electricity: 020-82260169 (office hours: Monday to Friday 9: 00-18: 00, Saturday 9: 00-12: 00)."}
{"task": "rw_79.jsonl", "id": 64301, "text": "Email: shanchang@imshine.com", "label": ["Important", "Contact Information"], "rewrite": "Email: shanchang@imshine.com."}
{"task": "rw_79.jsonl", "id": 64302, "text": "We will review the issues involved as soon as possible and reply within 15 working days after verifying your identity.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64303, "text": "If you cannot respond to your request, we will send you notifications and explain the reason within the time limit required by the law.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64304, "text": "If you are not satisfied with our response, especially our personal information processing behavior harms your legitimate rights and interests, you can also seek solutions through the following external channels: a lawsuit with the Huangpu District People's Court of Guangzhou.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64305, "text": "12. Appendix \"Class Optimization Master SDK Catalog\"", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64306, "text": "13. Appendix \"Notes for the use of Children and Children in Class Optimization\"", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64307, "text": "Class Optimization Master Children's Personal Information Protection Policy", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64308, "text": "Guangzhou Vision Rui Electronic Technology Co., Ltd. and Guangzhou Flash Information Technology Co., Ltd. (hereinafter referred to as \"we\") know the importance of personal information security and privacy of children (referring to minors under the age of 14).It will abide by the principles of consistency and responsibility in the process of providing products/services, the principles of clear purpose, the principle of selection and consent, the principle of minimum necessary necessity, the principles of ensuring safety, the principle of the subject participation, and the principle of openness and transparency.The consent of \"guardian\" or \"you\") and handle the personal information of children (or \"your child\") in accordance with the law, and use security technical measures and supporting management measures that meet the industry standards to maximize the personal informationDedicated, damaged, unauthorized access or changes.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64309, "text": "In addition to the \"Class Optimization Master Privacy Policy\" and \"Class Optimization Master Software License and Service Agreement\", we also hope to explain to you and/or your child through the \"Children's Personal Information Protection Rules\" (hereinafter referred to as \"this rule\")Provide the purpose, method, scope, and information security protection measures for collecting, using, storage, sharing, transfer, and publicly disclosed during the product/service process, and the rights and implementation methods you manage related personal information.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64310, "text": "Please read carefully and thoroughly understand this rule before using our products/services. Especially the clauses that are identified by the line/below should be read.Children are used by your accompaniment.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64311, "text": "This rule is a special rule formulated on the basis of the \"Privacy Policy of Class Optimization Master\", and it is inconsistent with the \"Class Optimization Master Privacy Policy\".", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64312, "text": "This rule is not stipulated, referring to the \"Class Optimization Master Privacy Policy\" with reference to the application of the \"Class Optimization Master\".", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64313, "text": "In addition to another agreement, the terms and narrowing words used in this rule have the same meaning as the terms and narrowing words in the \"Class Optimization Master Privacy Policy\".", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64314, "text": "Special description of the guardian:", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64315, "text": "Please read and choose whether to agree with this rule carefully. We hope that you and our children to protect your children's personal information and privacy security, educate and guide children to enhance their personal information protection awareness and ability, guide, remind them and ask them to be in the una -guardian who are not guardians.With consent, do not provide any personal information to any product/service provider.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64316, "text": "If you do not agree with the \"Class Optimization Master Privacy Policy\" and this rule, it may lead to the unable to use our related products/services normally, or to achieve the service effect we are going to achieve, you should ask your child to stop using access immediately/use us us.Product/service.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64317, "text": "If you click to agree to this rule, or your child uses/continue to use our product/service or submit personal information, it means that you agree that we can collect and handle your child's personal information in accordance with this rule. We will take special measures according to this rule to protectWe get your child's personal information.", "label": ["Policy Change", "Important"], "rewrite": "If you click to agree to this rule, or your child uses/continue to use our product/service or submit personal information, it means that you agree that we can collect and handle your child's personal information in accordance with this rule. We will take special measures according to this rule to protectWe get your child's personal information."}
{"task": "rw_79.jsonl", "id": 64318, "text": "If your child's school uses our services based on the purpose of education and teaching, you can also communicate with the corresponding services used by your child's school.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64319, "text": "Children's special description:", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64320, "text": "Any child's use of our products/services should obtain the consent of the guardian in advance, or use our product/service through the guardian registration, management and use of our product/service.", "label": ["Specific Audiences", "Important"], "rewrite": "Any child's use of our products/services should obtain the consent of the guardian in advance, or use our product/service through the guardian registration, management and use of our product/service."}
{"task": "rw_79.jsonl", "id": 64321, "text": "If you are a minor under the age of 14, before using our products/services, please read this rule with the accompaniment and help of the guardian, and use our product/service or submission of the guardian's consent.personal information.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a minor under the age of 14, before using our products/services, please read this rule with the accompaniment and help of the guardian, and use our product/service or submission of the guardian's consent.personal information."}
{"task": "rw_79.jsonl", "id": 64322, "text": "Please understand that this rule is not applicable to the services provided by you and/or your children in other third directions.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64323, "text": "For services provided by other third parties (whether these services are provided through our products/services), please be sure to read the relevant privacy policies of the third -party service provider carefully to protect the legitimate rights and interests of you and your child.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64324, "text": "You can use the \"Settings-About\" finding and re-reading of this rule through class optimization master website and class optimization master app.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64325, "text": "If you have any questions or personal information such as personal information in the process of reading this rule, we provide you with special feedback channels. For details, please refer to the \"contact us\" chapter in this rule. We will answer you as soon as possible.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64326, "text": "This rule will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64327, "text": "1. Collection of personal information of children", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64328, "text": "2. Use of children's personal information", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64329, "text": "3. We may entrust the situation of handling, sharing, transfer, and disclosure of personal information of children", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64330, "text": "Fourth, the storage and protection of children's personal information", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64331, "text": "Fifth, the rights of guardians and children", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64332, "text": "6. Application and update of this rule", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64333, "text": "Seven, contact us", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64334, "text": "eight,", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64335, "text": "1. Collection of personal information of children", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64336, "text": "1. We will strictly fulfill the obligations and responsibilities of personal information protection stipulated in laws and regulations, follow the principles of legitimate necessity, knowledge consent, clear purpose, security, and use according to law.", "label": ["Specific Audiences", "First Party Collection Information", "Important"], "rewrite": "We will strictly fulfill the obligations and responsibilities of personal information protection stipulated in laws and regulations, follow the principles of legitimate necessity, consent of knowledge, clear purpose, security, and use in accordance with the law."}
{"task": "rw_79.jsonl", "id": 64337, "text": "In the process of using the products/services we provided by/or your child, I took the initiative to provide us the personal information of your child, saying that you have agreed to collect and use the content of the \"Privacy Policy of the Class Optimization Master\" and the content of this rule.Your child's personal information.", "label": ["Specific Audiences", "First Party Collection Information", "Important"], "rewrite": "In the process of using the products/services we provided by/or your child, I took the initiative to provide us the personal information of your child, saying that you have agreed to collect and use the content of the \"Privacy Policy of the Class Optimization Master\" and the content of this rule.Your child's personal information."}
{"task": "rw_79.jsonl", "id": 64338, "text": "2. Please note that in most cases, we cannot recognize and do not judge whether the personal information of collecting and processing is a child personal information.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64339, "text": "We may collect your children's personal information details. You can specifically check the chapter of \"Class Optimization Master Privacy Policy\" \"How can we collect and use personal information\" to learn more about it. We combine specific services to explain one by one.The type of information, purpose and purpose, and the consequences of rejecting consent.", "label": ["Specific Audiences", "Important", "First Party Collection Information"], "rewrite": "We may collect your children's personal information details. You can specifically check the chapter of \"Class Optimization Master Privacy Policy\" \"How can we collect and use personal information\" to learn more about it."}
{"task": "rw_79.jsonl", "id": 64340, "text": "details as follows:", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64341, "text": "(1) Related functions involved in the teacher's side", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64342, "text": " When the teacher uses the function of \"adding a student\", we will collect the student information entered by the teachers provided by the teachers, including names and avatars to improve class student information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect the students' information entered by the teachers provided by the teachers, including names and avatars to improve the class student information."}
{"task": "rw_79.jsonl", "id": 64343, "text": " When the teacher uses the \"Student Comment/Student Archives/Intelligent Comment\" function, we will collect information from the students entered by the teachers provided by the teachers in order to record students' performance and synchronize them to parents.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect information from the students entered by the teachers provided by the teachers in order to record the performance of students in school and synchronize them to parents."}
{"task": "rw_79.jsonl", "id": 64344, "text": " When the teacher uses the \"transcript\" function, we will collect the test results entered by the teachers that teachers actively provide to the teachers provided by us in order to count students' performance and synchronize them to parents.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect the test results of the students who are actively provided by the teachers to the teachers provided by the teachers in order to count students' results and synchronize them to parents."}
{"task": "rw_79.jsonl", "id": 64345, "text": " When the teacher uses the attendance function, we will collect the information of students entered by the teachers who actively provide by the teachers provided by the teachers provided by the teachers.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect information, leave, absence, and late situation information entered by the teachers provided by teachers to the students provided by our teachers in order to count the attendance data of students and synchronize them to parents."}
{"task": "rw_79.jsonl", "id": 64346, "text": "(2) Related functions involved in the use of parents", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64347, "text": " When parents use the \"Binding Class\" function, we will collect the names and avatar information of the child entered by the parents who actively provide by the parents to join the child's class.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect the names and avatar information of the children entered by the parents provided by our parents to join the children's class."}
{"task": "rw_79.jsonl", "id": 64348, "text": " When the parents use the function of \"submitting homework/check -in content/survey/self -evaluation/realistic record\" function, we will collect the text, pictures, audio, video information of the children entered by the parents that parents actively provide to the parents provided by our parents to complete the homework to completehomework.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect the text, pictures, audio, and video information of parents who take the initiative to provide the parents that parents actively provide, so as to complete family homework."}
{"task": "rw_79.jsonl", "id": 64349, "text": " Parents can apply for the child registration plan through the \"growth manual\". When participating in the promotion plan, we will collect information about children who are entered at home, running, sitting up, and skipping rope at home in the form of text and pictures.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect information about the children who are entered by parents in the form of text and pictures at home, running, sit -ups, and skipping rope."}
{"task": "rw_79.jsonl", "id": 64350, "text": "The \"Growth Manual\" is a paid value -added service provided by us. Parents can choose whether to subscribe to their own. If the parents refuse to subscribe, parents will not be able to use the service, but it will not affect other basic business functions.Normal use.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64351, "text": " Parents can register audio or video courses for their children through the \"supply station\". When children use APP to learn courses, we will collect children's learning duration. We collect this informationThe content and services that may be more interested in, while improving our products and services.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect children's learning duration. We collect this information to count the daily use of children to parents, and at the same time provide children with the content and services they need more interested, while improving our products and services."}
{"task": "rw_79.jsonl", "id": 64352, "text": "The audio and video course in the supply station is a paid value -added service provided by us. Parents can choose whether to buy themselves. Parents refuse to buy it without affecting the normal use of other basic business functions.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64353, "text": "(3) You take the initiative to provide us with personal information of children in our products and services.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64354, "text": "Including the creation classes, reviewing classroom performance, picture intelligent recognition function, chat function and other information release functions shared by us.The content of the rules use children's personal information.", "label": ["First Party Collection Information", "Specific Audiences"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64355, "text": "3. To verify your child's guardianship relationship with your child, we may also collect your contact information (including mobile phone numbers, e -mail), and other information that helps us judge the monitoring relationship.", "label": ["Specific Audiences", "First Party Collection Information", "Important"], "rewrite": "We may also collect your contact information (including mobile phone numbers, emails), and other information that helps us judge the monitoring relationship."}
{"task": "rw_79.jsonl", "id": 64356, "text": "4. The products/services we provide are constantly updated and developed.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64357, "text": "For example, if you and your children choose to use the \"Class Optimization Master Privacy Policy\" and other services that have not been covered in this rule, based on the service we need to collect children's personal information, we will explain it separately through page prompts, interaction processes, and agreement agreed.The scope, purpose and purpose of information collection, and obtain your consent.", "label": ["Specific Audiences", "First Party Collection Information", "Important"], "rewrite": "We will separate the scope, purpose and use of information collection through page prompts, interaction processes, and agreement agents, and obtain your consent."}
{"task": "rw_79.jsonl", "id": 64358, "text": "5. Exceptions of obtaining authorization in advance:", "label": ["First Party Collection Information", "Risk", "Specific Audiences"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64359, "text": "(1) To fulfill the statutory duties or the requirements of the statutory volunteer;", "label": ["Specific Audiences", "First Party Collection Information", "Risk", "Important"], "rewrite": "It is not necessary to solicit consent as a personal information that is collected as a legal duty or a personal information necessary for the legal duty."}
{"task": "rw_79.jsonl", "id": 64360, "text": "(2) In order to deal with emergencies, or in urgent situations, it is necessary to protect the health and property safety of natural people;", "label": ["Specific Audiences", "First Party Collection Information", "Risk", "Important"], "rewrite": "Collecting personal information required to respond to emergencies, no need to solicit consent."}
{"task": "rw_79.jsonl", "id": 64361, "text": "(3) Implement news reports and public opinion supervision for public interests, and handle personal information within a reasonable range;", "label": ["Specific Audiences", "First Party Collection Information", "Risk", "Important"], "rewrite": "In order to implement news reports and public opinion supervision, deal with personal information within a reasonable scope without soliciting consent."}
{"task": "rw_79.jsonl", "id": 64362, "text": "(4) Related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Specific Audiences", "First Party Collection Information", "Risk", "Important"], "rewrite": "Collecting related personal information related to criminal investigation, prosecution, trial, and execution of judgments does not need to ask for consent."}
{"task": "rw_79.jsonl", "id": 64363, "text": "(5) For major legitimate rights and interests such as maintaining children's life, property, etc., it is difficult to obtain the consent of the guardian;", "label": ["Risk", "Specific Audiences", "First Party Collection Information", "Important"], "rewrite": "Collecting personal information that maintains major legitimate rights and interests such as life, property, etc., but it is difficult to obtain personal information that the guardian agrees, and no consent is required."}
{"task": "rw_79.jsonl", "id": 64364, "text": "(6) The collected information is made by children or guardians to the public by themselves;", "label": ["Specific Audiences", "First Party Collection Information", "Risk", "Important"], "rewrite": "The collected information is disclosed by the children or guardians to the public without asking for consent."}
{"task": "rw_79.jsonl", "id": 64365, "text": "(7) Collecting information from the information disclosed by legal publicity, such as legal news reports, government information disclosure and other channels;", "label": ["Specific Audiences", "First Party Collection Information", "Risk", "Important"], "rewrite": "If the information is collected from the legal disclosure information, no consent is required."}
{"task": "rw_79.jsonl", "id": 64366, "text": "(8) It is necessary to sign and perform related agreements or other written documents according to your or your child;", "label": ["Specific Audiences", "First Party Collection Information", "Risk", "Important"], "rewrite": "You do not need to solicit consent according to the signing and fulfilling related agreements or other written documents with you or your child."}
{"task": "rw_79.jsonl", "id": 64367, "text": "(9) It is necessary to maintain the safe and stable operation of our products/services, such as discovering and disposing of our product/service failure;", "label": ["Specific Audiences", "First Party Collection Information", "Risk", "Important"], "rewrite": "It is necessary for the safe and stable operation of our product/service to maintain our products/services."}
{"task": "rw_79.jsonl", "id": 64368, "text": "(10) Academic research institutions are necessary to carry out statistics or academic research based on public interests, and when providing results of academic research or description, the information contained in the results is identified by", "label": ["Risk", "Specific Audiences", "First Party Collection Information", "Important"], "rewrite": "When academic research institutions are necessary to carry out statistics or academic research based on public interests, and provide academic research or description results, the information contained in the results is identified to identify it without soliciting consent."}
{"task": "rw_79.jsonl", "id": 64369, "text": "(11) Other circumstances stipulated in laws and regulations.", "label": ["First Party Collection Information", "Risk", "Specific Audiences"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64370, "text": "6. If you provide your child's personal information, please make sure you have obtained the consent of the guardian of the relevant personal information subject.", "label": ["Specific Audiences", "First Party Collection Information", "Important"], "rewrite": "If you provide your child's personal information, please make sure you have the consent of the guardian of the relevant personal information subject."}
{"task": "rw_79.jsonl", "id": 64371, "text": "If you find the personal information of your child's child without your authorization consent in the product/service you provided, please \"contact us\" in time according to this rule. After verification, we will try to delete relevant information as soon as possibleEssence", "label": ["Specific Audiences", "Data Security", "Important"], "rewrite": "If you find the personal information of your child's child without your authorization consent in the product/service you provided, please \"contact us\" in time according to this rule. After verification, we will try to delete relevant information as soon as possibleEssence"}
{"task": "rw_79.jsonl", "id": 64372, "text": "7. Tips about sensitive personal information", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64373, "text": "Remind you to note that the personal information of children under the age of 14 (inclusive) belongs to personal sensitive information.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64374, "text": "In the process of using our product/service, you and/your child may actively provide or we may collect children's personal information, including identity documents, personal biometric information, communication records and content, travel trajectory, transaction information and other otherInformation stated in the \"Class Optimization Master Privacy Policy\".", "label": ["Specific Audiences", "First Party Collection Information", "Important"], "rewrite": "You and/your children may take the initiative to provide or we may collect children's personal information, including identity documents, personal biometric information, communication records and content, trading information, trading information and other \"Class Optimization Master Privacy Policy\" statedinformation."}
{"task": "rw_79.jsonl", "id": 64375, "text": "Therefore, you need to consider carefully before you and your children use the products/services we provide.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64376, "text": "You agree that your child's related personal information will be processed in accordance with the purpose and method clarified by the \"Class Optimization Master's Privacy Policy\" and the purpose clarified by this rule.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64377, "text": "2. Use of children's personal information", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64378, "text": "1. We will strictly abide by the provisions of laws and regulations and the agreement with the user.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64379, "text": "(1) Verify your and your child's identity;", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64380, "text": "(2) Provide specific functions of the necessary products/services, products/services;", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64381, "text": "(3) The purpose of optimizing products/services, security, and service survey.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64382, "text": "2. When we want to use children's personal information for the \"Class Optimization Master Privacy Policy\" and other uses that are not stated in this rule, we will recruit your consent again in accordance with the requirements of laws and regulations and national standards.", "label": ["Specific Audiences", "Risk", "Important"], "rewrite": "When we want to use children's personal information for the \"Class Optimization Master Privacy Policy\" and other uses that have not been stated in this rule, we will recruit your consent again in accordance with the requirements of laws, regulations and national standards."}
{"task": "rw_79.jsonl", "id": 64383, "text": "3. We may entrust the situation of handling, sharing, transfer, and disclosure of personal information of children", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64384, "text": "1. For the personal information of children, we will only allow the law and regulations to allow the government authority to compulsory requirement, the guardian clearly agrees to authorize, or to maintain the legitimate rights and interests of our and partners, children, guardians or other users, public interests, property, property, property, property, property, propertyOr if necessary, commission the corresponding information to be commissioned, shared, transferred or disclosed.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Important"], "rewrite": "For the personal information of children, we will only allow the government and regulations to allow the mandatory requirements of the government authority to clearly agree with the authorization, or to maintain, share, transfer, transfer, transfer, transfer, transfer, transfer, transfer, transfer, transfer, transfer, or transferred to safeguard the law.Or disclose the corresponding information."}
{"task": "rw_79.jsonl", "id": 64385, "text": "You can check our names or names, contact information, processing purpose, processing methods, processing methods, processing methods, processing methods, processing methods, processing methods, processing methods, processing methods, processing methods, and processing of processing, sharing, sharing, transferring, and publicly disclosing your personal information.The types of personal information and our authorized partners and their service types.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64386, "text": "2. We will only be within the scope of legal, correct, necessary, specific, and clear purposes in the scope of the allowances permitted by laws and regulations to share the personal information of children in this rule.personal information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will only share the personal information of children in the scope of legal, correct, necessary, specific, and clear purposes in the scope of laws and regulations.Essence"}
{"task": "rw_79.jsonl", "id": 64387, "text": "We will carefully evaluate the legality, legitimacy, and necessity of shared information, and require these third parties to take protection measures for their personal information of children, and strictly abide by relevant laws and regulations and regulatory requirements.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Data Security", "Important"], "rewrite": "We will carefully evaluate the legality, legitimacy, and necessity of shared information, and require these third parties to take protection measures for their personal information of children, and strictly abide by relevant laws and regulations and regulatory requirements."}
{"task": "rw_79.jsonl", "id": 64388, "text": "We will jointly determine personal information security requirements with third parties through contracts and assume corresponding responsibilities and obligations in terms of personal information security.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Data Security", "Important"], "rewrite": "We will jointly determine personal information security requirements with third parties through contracts and assume corresponding responsibilities and obligations in terms of personal information security."}
{"task": "rw_79.jsonl", "id": 64389, "text": "The information receiving party has only limited access to children's information. They also need to bear the contractual obligation, including obtaining children's information that is not limited to the use of legitimate compliance, and adopt reasonable security measures to protect children's information.Our agreement assumes corresponding legal liability.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Important"], "rewrite": "The information receiving party has only limited access to children's information. They also need to bear the contractual obligation, including obtaining children's information that is not limited to the use of legitimate compliance, and adopt reasonable security measures to protect children's information.Our agreement assumes corresponding legal liability."}
{"task": "rw_79.jsonl", "id": 64390, "text": "3. Under normal circumstances, we will not entrust third -party personal information for children.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64391, "text": "If we entrust a third -party processing of children's personal information, we will conduct a security assessment of the commissioned party and commissioned behavior, sign the commission agreement, clarify the responsibilities, handling matters, processing period, processing nature and purpose, etc., and restrict the entrusting partyThe entrusted behavior shall not exceed the scope of authorization, and the entrusted party shall fulfill the following obligations:", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Important"], "rewrite": "If we entrust a third -party processing of children's personal information, we will conduct a security assessment of the commissioned party and commissioned behavior, sign the commission agreement, clarify the responsibilities, handling matters, processing period, processing nature and purpose, etc., and restrict the entrusting partyThe entrustment behavior must not exceed the scope of authorization."}
{"task": "rw_79.jsonl", "id": 64392, "text": "(1) Process personal information of children in accordance with the provisions of laws and administrative regulations and the requirements of network operators;", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64393, "text": "(2) Assist online operators to respond to the application made by children's guardians;", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64394, "text": "(3) Take measures to ensure information security, and timely feedback to network operators in time when a child personal information leakage is disclosed;", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64395, "text": "(4) Remove the child's personal information in time when the commission relationship is lifted;", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64396, "text": "(5) Do not transfer to commission;", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64397, "text": "(6) Other personal information protection obligations that should be fulfilled in accordance with the law.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64398, "text": "4. Under normal circumstances, we will not transfer personal information of children to third parties.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Important"], "rewrite": "Under normal circumstances, we will not transfer personal information of children to third parties."}
{"task": "rw_79.jsonl", "id": 64399, "text": "If we must transfer children's personal information to a third party, we will conduct a security assessment by ourselves or entrust third -party institutions.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Data Security", "Important"], "rewrite": "If we must transfer children's personal information to a third party, we will conduct a security assessment by ourselves or entrust third -party institutions."}
{"task": "rw_79.jsonl", "id": 64400, "text": "5. Exceptions of obtaining authorization in advance:", "label": ["Third Party Sharing/ Disclosure", "Risk", "Specific Audiences"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64401, "text": "(1) What is necessary for fulfilling legal obligations or statutory duties;", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Risk", "Important"], "rewrite": "Sharing is a personal information necessary for fulfilling legal obligations or necessary responsibilities, and no consent is required."}
{"task": "rw_79.jsonl", "id": 64402, "text": "(2) Directly related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Risk", "Important"], "rewrite": "Personal information directly related to national security and national defense security does not need to solicit consent."}
{"task": "rw_79.jsonl", "id": 64403, "text": "(3) Directly related to public safety, public health, and major public interests;", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Risk", "Important"], "rewrite": "Personal information directly related to public safety, public health, and direct public interests does not need to solicit consent."}
{"task": "rw_79.jsonl", "id": 64404, "text": "(4) Directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Risk", "Important"], "rewrite": "Direct related personal information such as criminal investigation, prosecution, trial and judgment execution does not need to solicit consent."}
{"task": "rw_79.jsonl", "id": 64405, "text": "(5) For major legitimate rights and interests such as the life and property of children or other individuals, it is difficult to obtain the consent of my authorization;", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Risk", "Important"], "rewrite": "Share major legitimate rights and interests such as the life and property of children or other individuals, but it is difficult to get personal information that I have authorized, and no consent is required."}
{"task": "rw_79.jsonl", "id": 64406, "text": "(6) Child or their guardians are disclosed to the public by themselves;", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Risk", "Important"], "rewrite": "The information of children or their guardians disclosed to the public on its own without asking for consent."}
{"task": "rw_79.jsonl", "id": 64407, "text": "(7) Collect personal information from legal public information, such as legal news reports and government information disclosure.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Risk", "Important"], "rewrite": "Collect personal information from the legal disclosure information.No need to ask for consent."}
{"task": "rw_79.jsonl", "id": 64408, "text": "6. According to the law, sharing, transfer, and disclose personal information that is identified by de -identified processing, and ensure that the data receiver cannot restore and re -identify the information of the information, which is not shared, transferred, and publicly disclosed in personal information.The preservation and processing of class data do not need to notify you separately and obtain your consent.", "label": ["Third Party Sharing/ Disclosure", "Risk", "Specific Audiences"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64409, "text": "We may use the collected children's information after anonymous processing of big data analysis, such as forming insights that do not contain any personal information.", "label": ["Specific Audiences", "Usage", "Important"], "rewrite": "We may use the collected children's information after anonymous processing of big data analysis, such as forming insights that do not contain any personal information."}
{"task": "rw_79.jsonl", "id": 64410, "text": "We may disclose and share information with our partners with information that does not include identity recognition content after statistical processing, to understand how users use our service or let the public understand the overall trend of our service.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may disclose and share information with our partners with information that does not include identity recognition content after statistical processing, to understand how users use our service or let the public understand the overall trend of our service."}
{"task": "rw_79.jsonl", "id": 64411, "text": "Fourth, the storage and protection of children's personal information", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64412, "text": "1. We will adopt encrypted measures to store personal information in accordance with the \"Class Optimization Master Privacy Policy\" and this rule, and the personal information of children's personal information will not exceed the time limit for the purpose of achieving information collection and use.Delete or processes the personal information of children.", "label": ["Data Retention", "Specific Audiences", "Important"], "rewrite": "We will adopt encrypted measures to store personal information in accordance with the \"Privacy Policies of Class Optimization Master\" and this rule, and the personal information of children's personal information will not exceed the time limit for the purpose of achieving information collection and use. After expiry, we will treat children to childrenPersonal information is deleted or anonymous."}
{"task": "rw_79.jsonl", "id": 64413, "text": "We will take all reasonable and feasible measures to confirm the personal information of unrelated children.", "label": ["Specific Audiences", "First Party Collection Information", "Data Security", "Important"], "rewrite": "We will take all reasonable and feasible measures to confirm the personal information of unrelated children."}
{"task": "rw_79.jsonl", "id": 64414, "text": "2. The personal information of children collected and generated in the operation of the People's Republic of China is stored in China. When we really need to provide your children's personal information outside the People's Republic of China, we strictly follow the supervision of the People's Republic of China.Requirement of the necessary procedures, and you will fully inform you that the name or name, contact information, processing purpose, processing methods, personal information types, and individuals to exercise the \"Personal Information Protection Law of the People's Republic of China\" regulations from the overseas receiving party.The way of rights and procedures and procedures, and get your individual consent again.", "label": ["Specific Audiences", "First Party Collection Information", "Data Security", "Important"], "rewrite": "The personal information of the children collected and generated in the operation of the People's Republic of China is stored in China. When we really need to provide your children's personal information outside the People's Republic of China, we strictly follow the regulatory requirements of the People's Republic of China.The essential procedure will also fully inform you that the names or names, names, contact information, processing purpose, processing methods, personal information types, and individuals to exercise the rights stipulated in the \"Personal Information Protection Law of the People's Republic of China\" stipulated in the Personal Information Protection Law of the People's Republic of China.Methods and procedures and other matters, and get your individual consent again."}
{"task": "rw_79.jsonl", "id": 64415, "text": "We will take necessary measures to ensure that the activities of overseas receiving parties to handle your children's personal information have reached the protection standards stipulated in my country's laws.", "label": ["Specific Audiences", "Data Security", "Important"], "rewrite": "We will take necessary measures to ensure that the activities of overseas receiving parties to handle your children's personal information have reached the protection standards stipulated in my country's laws."}
{"task": "rw_79.jsonl", "id": 64416, "text": "3. We attach great importance to children's personal information and privacy security. We have established a special data security team to record the impact of personal information protection and processing of personal information in advance, and take all reasonable and feasible measures to protect children to protect children to protect children to protect childrenpersonal information:", "label": ["Specific Audiences", "Important", "Data Security"], "rewrite": "We attach great importance to children's personal information and privacy security. We have established a special data security team to conduct a personal information protection assessment and records of personal information protection and processing of personal information in advance, and take all reasonable and feasible measures to protect children's personal informationEssence"}
{"task": "rw_79.jsonl", "id": 64417, "text": "(1) Children's personal information is all stored on a safe server and protected in the controlled facilities.", "label": ["Data Retention", "Specific Audiences", "Important"], "rewrite": "Children's personal information is all stored on a safe server and protected in controlling facilities."}
{"task": "rw_79.jsonl", "id": 64418, "text": "We will adopt safety protection measures that meet the industry standards, including establishing reasonable institutional norms and security technology to prevent personal information from children from being accessed and modified, avoiding data damage or loss of data.", "label": ["Data Security", "Specific Audiences"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64419, "text": "We will use encryption technology (such as SSL) to encrypt and save children's personal information and isolate through isolation technology.", "label": ["Specific Audiences", "Data Security", "Important"], "rewrite": "We will use encryption technology (such as SSL) to encrypt and save children's personal information and isolate through isolation technology."}
{"task": "rw_79.jsonl", "id": 64420, "text": "When the personal information of children, such as information display and information association calculations, we will use multiple data desensitization technology to enhance the security of information in use.", "label": ["Specific Audiences", "Data Security", "Important"], "rewrite": "When the personal information of children, such as information display and information association calculations, we will use multiple data desensitization technology to enhance the security of information in use."}
{"task": "rw_79.jsonl", "id": 64421, "text": "(2) We designate the special person in charge of the personal information of children, and adopt the minimum principle of authorization for the staff who may contact the personal information of the child. Only employees and partners who are necessary to know about this information can be allowedThis sets a strict access control and monitoring mechanism.", "label": ["Specific Audiences", "Data Security", "Important"], "rewrite": "We designated a special person in charge of the protection of personal information of children, and adopted the minimum principle of authorization for the staff who might contact the personal information of the child. Only employees and partners who were necessary to know about this information were allowedStrict access to control and monitoring mechanisms."}
{"task": "rw_79.jsonl", "id": 64422, "text": "If all personnel visit the personal information of children, they will be approved by the person in charge of the child's personal information protection or their authorized managers to record the visits, and take technical measures to avoid illegal copying and downloading personal information of children.", "label": ["Specific Audiences", "Data Security", "Important"], "rewrite": "If all personnel visit the personal information of children, they will be approved by the person in charge of the child's personal information protection or their authorized managers to record the visits, and take technical measures to avoid illegal copying and downloading personal information of children."}
{"task": "rw_79.jsonl", "id": 64423, "text": "We also demand that all personnel who may contact the personal information of children to fulfill their corresponding confidentiality obligations.", "label": ["Specific Audiences", "Data Security", "Important"], "rewrite": "We also demand that all personnel who may contact the personal information of children to fulfill their corresponding confidentiality obligations."}
{"task": "rw_79.jsonl", "id": 64424, "text": "If these obligations fail to fulfill these obligations, they may be held legal or suspended with our cooperative relationships.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64425, "text": "(3) We have developed an emergency plan for children's personal information security incidents, and regularly organized internal personnel to conduct emergency response training and emergency drills to master their job responsibilities and emergency disposal strategies and regulations.", "label": ["Specific Audiences", "Data Security", "Important"], "rewrite": "We have developed an emergency plan for children's personal information security incidents, and regularly organized internal personnel to conduct emergency response training and emergency drills, so that they can master job duties and emergency disposal strategies and procedures."}
{"task": "rw_79.jsonl", "id": 64426, "text": "After unfortunately a child personal information security incident, we will inform you in a timely manner in accordance with the requirements of laws and regulations: the basic situation and possible impact of the security incident, the disposal measures we have taken or will take, your and your children can take it alone to prevent themselves from preventing themselves.And reducing risk suggestions, remedial measures for you and your children, etc.", "label": ["Specific Audiences", "Data Security", "Important"], "rewrite": "After unfortunately a child's personal information security incident, we will tell you in a timely manner in accordance with the requirements of laws and regulations: basic situations and possible impacts, disposal measures, suggestions, remedy measures, etc."}
{"task": "rw_79.jsonl", "id": 64427, "text": "We will promptly tell you that the incident -related situation is pushed to the APP notification or sending emails.", "label": ["Specific Audiences", "Data Security", "Important"], "rewrite": "We will promptly tell you that the incident -related situation is pushed to the APP notification or sending emails."}
{"task": "rw_79.jsonl", "id": 64428, "text": "(4) After you and your children terminate our services, we will stop the collection and use of your children's personal information, except for laws and regulations or regulatory authorities.", "label": ["Specific Audiences", "Cessation of Operations", "Important"], "rewrite": "After your and your children terminate our services, we will stop the collection and use of your children's personal information, except for laws and regulations or regulatory authorities."}
{"task": "rw_79.jsonl", "id": 64429, "text": "If we stop operations, we will stop collecting children's personal information in a timely manner, notify the notification of operating in the form of one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -time service, and delete the personal information of the child.", "label": ["Specific Audiences", "Cessation of Operations", "Important"], "rewrite": "If we stop operations, we will stop collecting children's personal information in a timely manner, notify the notification of operating in the form of one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -time service, and delete the personal information of the child."}
{"task": "rw_79.jsonl", "id": 64430, "text": "Fifth, the rights of guardians and children", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64431, "text": "1. During your or your children's use of our products/services, for you to access and correct information more conveniently, to ensure that you can enjoy deletion, withdrawing, canceling account number, obtaining personal information copy, constraint system automation decision, requirements for you can enjoy in accordance with the lawWe respond to the rights of other requests, and you can operate the corresponding guidelines in the chapter of \"The Rights for Your Personal Information\" in the \"Class Optimization Master Privacy Policy\".", "label": ["Edit/Control", "Specific Audiences"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64432, "text": "At the same time, you can also \"contact us\" the channels listed in this rule, requiring to correct or delete, cancel the account number or refuse to allow further collection or use relevant information on the children's personal information.", "label": ["Specific Audiences", "Edit/Control", "Important"], "rewrite": "You can also \"contact us\" in this rule to \"contact us\", requiring personal information to be more correct or deleted, canceled an account or refusing to allow further collection or use of relevant information."}
{"task": "rw_79.jsonl", "id": 64433, "text": "To ensure safety, when in response to the request of you and/or your child, we may need you and/or your child to verify your identity.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64434, "text": "2. If there is the following situations, you can ask us to delete personal information of children according to the contact information of this rule. We will take measures to delete in time after completing the identity verification and verification problem:", "label": ["Edit/Control", "Specific Audiences", "Important"], "rewrite": "You can ask us to delete personal information of related children in accordance with the contact information of this rule. We will take measures to delete in time after completing the identity verification and verification problem."}
{"task": "rw_79.jsonl", "id": 64435, "text": "(1) If our behavior of handling children's personal information violates the laws and administrative regulations;", "label": ["Edit/Control", "Specific Audiences"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64436, "text": "(2) If our behavior of handling personal information violates your agreement;", "label": ["Edit/Control", "Specific Audiences"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64437, "text": "(3) If we are exceeded the scope of the purpose or the necessary period of collection, storage, use, transfer, and disclose the personal information of children;", "label": ["Edit/Control", "Specific Audiences"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64438, "text": "(4) You withdraw consent;", "label": ["Edit/Control", "Specific Audiences"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64439, "text": "(5) You or your children no longer use our products/services, or you cancel your account;", "label": ["Edit/Control", "Specific Audiences"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64440, "text": "(6) If we no longer provide you with products/services.", "label": ["Edit/Control", "Specific Audiences"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64441, "text": "Remind you to note that if you and/or your child delete or request us to delete specific children's personal information, it may cause the unable to continue to use all or part of the service.", "label": ["Edit/Control", "Specific Audiences", "Important"], "rewrite": "If you and/or your child delete or request us to delete specific children's personal information, it may cause the unable to continue to use all or part of the service."}
{"task": "rw_79.jsonl", "id": 64442, "text": "3. After we delete children's personal information, we will delete the corresponding information from the backup system.", "label": ["Specific Audiences", "Edit/Control", "Important"], "rewrite": "After we delete children's personal information, we will delete the corresponding information from the backup system."}
{"task": "rw_79.jsonl", "id": 64443, "text": "4. If you find that your child's personal information is collected without earning your consent in advance, please contact us in time, and we will try to delete relevant data as soon as possible.", "label": ["Specific Audiences", "First Party Collection Information", "Important"], "rewrite": "If you find that your child's personal information is collected without the consent in advance, please contact us in time, and we will try to delete relevant data as soon as possible."}
{"task": "rw_79.jsonl", "id": 64444, "text": "6. Application and update of this rule", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64445, "text": "1. We may modify the terms of this rule in a timely manner according to the update of our products/services and the relevant requirements of laws and regulations. These modifications constitute a part of the cost of the cost of the cost. We will display the latest modified version on the special page.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64446, "text": "2. For major changes, we will also provide more significant notifications. For details, please refer to the provisions of the \"Class Optimization Master Privacy Policy\".", "label": ["Policy Change", "Important"], "rewrite": "For major changes, we will also provide a more significant notice. For details, please refer to the provisions of the \"Privacy Policy of the Master of Class Optimization\"."}
{"task": "rw_79.jsonl", "id": 64447, "text": "3. If you or your child continues to use our product/service after the renewal is effective, it means that you or your child has fully read, understand and accept the updated rules and is willing to be constrained by the updated rules.", "label": ["Policy Change", "Important"], "rewrite": "If you or your child continues to use our products/services after the renewal of this rule, it means that you or your child has fully read, understand and accept the updated rules and is willing to be constrained by the updated rules."}
{"task": "rw_79.jsonl", "id": 64448, "text": "Seven, contact us", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64449, "text": "1. If you or your children have any questions about this rule, or have any complaints or opinions on the processing of children's personal information, please via customer service hotline: 020-86154555 (office hours: Monday to Friday 9: 00-18: 00, week week, week week, week, week, week6: 00-12: 00) Contact us.", "label": ["Important", "Contact Information"], "rewrite": "Please contact us through customer service hotline: 020-86154555 (office time: Monday to Friday 9: 00-18: 00, Saturday 9:00-12: 00) contact us."}
{"task": "rw_79.jsonl", "id": 64450, "text": "2. We have set up special responsible persons for children's information protection. You can also contact us through the following ways:", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64451, "text": "Office address: No. 192 Science City, Science City, Economic and Technological Development Zone, Guangzhou, Guangdong Province, contact information: shanchang@imshine.com.", "label": ["Important", "Contact Information"], "rewrite": "Office address: No. 192 Science City, Science City, Economic and Technological Development Zone, Guangzhou, Guangdong Province, contact information: shanchang@imshine.com."}
{"task": "rw_79.jsonl", "id": 64452, "text": "3. We will reply to your request within 15 working days after receiving problems, complaints, opinions or suggestions, and verify your identity.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64453, "text": "If you cannot respond to your request, we will send you notifications and explain the reason within the time limit required by the law.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64454, "text": "4. If you are not satisfied with our reply or think that our personal information processing behavior harms your legitimate rights and interests, you can also seek solutions through the following external channels: a lawsuit with the People's Court of Huangpu District, Guangzhou.", "label": [], "rewrite": []}
{"task": "rw_79.jsonl", "id": 64455, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
