{"task": "rw_74.jsonl", "id": 62774, "text": "Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62775, "text": "Updated: 2022.06.02", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62776, "text": "Effective time: 2022.06.02", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62777, "text": "【Precautions】", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62778, "text": "You are welcome to accept and use the competitive world service.", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62779, "text": "Competitive World (Beijing) Network Technology Co., Ltd. and related companies (hereinafter referred to as \"Competitive World\" or \"We\") are an Internet company established in accordance with Chinese law and administrative regulations.Service Center-B1, contact the mailbox: privacy@service.jj.cn.", "label": ["Important", "Contact Information"], "rewrite": "Address: Investment Service Center, Yanqi Economic Development Zone, Huairou District, Beijing, mailbox: privacy@service.jj.cn"}
{"task": "rw_74.jsonl", "id": 62780, "text": "Products and services in the competitive world refer to products and services such as online games, instant messaging, online media, Internet media, Internet media, Internet media, Internet media, interactive entertainment, e -commerce, online malls and advertising.", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62781, "text": "When you use the products or services provided by the competitive world, we may collect and use your relevant information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62782, "text": "We promise to protect the personal information and privacy security of users (hereinafter referred to as \"user\" or \"you\") using the competitive world.", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62783, "text": "We formulate this \"Privacy Policy\" and specifically remind: I hope you read and understand the privacy policy carefully before using the products or services of the competitive world to make appropriate choices.", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62784, "text": "We will follow the requirements of relevant laws and regulations of the People's Republic of China to collect and use your personal information, and will not collect all your personal information in a compulsory binding method just because you agree with your consent of your privacy policy.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62785, "text": "In addition to the information required for the basic functions of the competitive world products or services and the information required by laws and administrative regulations, you can reject us to handle other information, but this may cause us to be unable to provide you with corresponding functions and services.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can refuse us to deal with basic functions and other information other than information required by laws and administrative regulations."}
{"task": "rw_74.jsonl", "id": 62786, "text": "We will explain the relevant situation to you in this article. The important terms of your personal information rights have been prompted in a bold form. Please give special attention.", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62787, "text": "This \"Privacy Policy\" is applicable to the products and services of all the aforementioned competition worlds we provided by us.", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62788, "text": "The implementation function of a single product or single service may be slightly different. When you use any single product or single service, we will prompt you to read this \"Privacy Policy\" and the specific privacy information we have issued in this single product or single service.The protection of the clauses (the following \"specific terms\") is protected so that you can make appropriate choices.", "label": ["Policy Change", "Important"], "rewrite": "When you use a single product or service, you will prompt you to read the protection of the \"Privacy Policy\" and the specific privacy information policy clauses of the single product or service in order to make your choice."}
{"task": "rw_74.jsonl", "id": 62789, "text": "When you choose to accept this specific terms, this specific terms and the terms of this policy will have the effect on you at the same time.", "label": ["Policy Change", "Important"], "rewrite": "When you choose to accept this specific terms, this specific terms and the terms of this policy will have the effect on you at the same time."}
{"task": "rw_74.jsonl", "id": 62790, "text": "For example, if the specific terms and the clauses of this \"Privacy Policy\" have inconsistent stipulated in the same clause, the specific terms shall prevail within the scope of the constraints.", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62791, "text": "If a single product or single service we provides does not apply to this \"Privacy Policy\", the service will explicitly explicitly eliminate the applicable \"Privacy Policy\" in an appropriate manner.", "label": ["Policy Change", "Important"], "rewrite": "If a single product or service is not applicable to the Privacy Policy, it will clearly exclude the applicable \"Privacy Policy\"."}
{"task": "rw_74.jsonl", "id": 62792, "text": "If you refuse to accept the specific terms of this \"Privacy Policy\" and a single service, you will not be able to use the corresponding service. After you refuse, we will not take the initiative to remind you to read the \"Privacy Policy\" and specific terms.Unless you re -enable this service.", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62793, "text": "The following will help you understand how we collect, use, transmit, store, share, transfer and protect personal information;", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62794, "text": "Help you to understand the way to query, access, correct, supplement, delete, and withdraw authorized personal information.", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62795, "text": "Among them, important parts involving your personal information rights and interests have been prompted in bold forms, please pay special attention.", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62796, "text": "Table of contents", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62797, "text": "1. The way we collect and use personal information, scope, and purpose", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62798, "text": "2. We may share, transfer and disclose information", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62799, "text": "3. How do we retain, store and protect information", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62800, "text": "4. Manage your information", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62801, "text": "Five, third -party service", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62802, "text": "6. Notice and revision", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62803, "text": "Seven, how to contact us", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62804, "text": "1. The way we collect and use information", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62805, "text": "(1) We will collect and obtain your information through the following channels:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62806, "text": "1. The information you provide.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62807, "text": "For example:", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62808, "text": "(1) When you register the account number of the competitive world service or use the competitive world service, the information provided to us;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the information you actively provided when you register your account or use the service."}
{"task": "rw_74.jsonl", "id": 62809, "text": "(2) The shared information provided by other parties through the competitive world service, and the information stored when you use the competitive world service.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the shared information provided by other parties through the competitive world service, and the information stored when you use it."}
{"task": "rw_74.jsonl", "id": 62810, "text": "2. Your information shared by other parties.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62811, "text": "That is to say, other parties provide sharing information on your competitive world service.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting other parties to provide shared information on your use of competitive world services."}
{"task": "rw_74.jsonl", "id": 62812, "text": "3. The information we get.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62813, "text": "When you use the competitive world service, we collect, summarize, and record information, such as log information, location information, equipment information, etc.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the competitive world service, we collect, summarize, record log information, location information, and equipment information."}
{"task": "rw_74.jsonl", "id": 62814, "text": "4. Information we get through cookies and Web Beacon.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62815, "text": "We and third -party partners may collect and use your information through cookies and webs, beacon, and store these information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We and third -party partners may collect and use your information through cookies and Web Beacon and store these information."}
{"task": "rw_74.jsonl", "id": 62816, "text": "(2) In order to provide you with a better service experience, we will apply for the corresponding permissions of your device [Link: https: //acts.jj.cn/html/activity_topic/stater/22030166d78a.html]Personal information [Link: https: //acts.jj.cn/html/activity_topic/stative/2203018eb630.html].", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "Application for obtaining your device [Link: https: //acts.jj.cn/html/activity_topic/stative/22030166d78a.html], or collect your personal information [Link: https: //acts.jj.cn/html/Activity_topic/stative/2203018eb630.html]."}
{"task": "rw_74.jsonl", "id": 62817, "text": "Please pay attention:", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62818, "text": "1. If you don't want to accept the personalized recommendation service we provide to you, you can click [My-Settings-Privacy Privacy Management-Personalized Recommendation] to close.", "label": ["Important", "Edit/Control"], "rewrite": "Click [Mine-Settings-Privacy Rights Management-Personalized Recommendation] Close personalized recommendation services."}
{"task": "rw_74.jsonl", "id": 62819, "text": "When you close, we will not process your personal information based on personal recommendations.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62820, "text": "2. You may complete the real -name authentication of the account through the third -party software \"Alipay\". At that time, Alipay will provide us your ID number, name and other information to us after you click to confirm the corresponding prompt pop -up window.", "label": ["Important", "First Party Collection Information"], "rewrite": "Through the real -name authentication of the account number through the third -party software \"Alipay\", Alipay will provide your ID number, name and other information to your ID number, name and other information."}
{"task": "rw_74.jsonl", "id": 62821, "text": "3. We specifically explain to you that in order to optimize product functions, we use open source software or code named \"Facebook\" and \"QT\" in the \"JJ Fighting Landlord\" product.", "label": ["Important", "First Party Collection Information"], "rewrite": "In the product, open source software or code named \"Facebook\" and \"QT\" are used to optimize product functions."}
{"task": "rw_74.jsonl", "id": 62822, "text": "We promise that there is no possibility of leaking any data to third parties or data outbound.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The possibility of leaking the possibility of third parties or data outbound using \"Facebook\" and \"QT\" and other open source software or code."}
{"task": "rw_74.jsonl", "id": 62823, "text": "(3) According to relevant laws and administrative regulations, collecting and using your personal information in the following circumstances does not need to obtain your authorization consent:", "label": ["Important", "First Party Collection Information"], "rewrite": "According to relevant laws and administrative regulations, collecting and using your personal information in the following circumstances does not need to obtain your authorization consent:"}
{"task": "rw_74.jsonl", "id": 62824, "text": "1. Sign a contract or perform the contract according to your requirements.", "label": ["Important", "First Party Collection Information"], "rewrite": "Signing a contract or a collection and use information necessary for the contract according to your requirements, no need to solicit authorization consent."}
{"task": "rw_74.jsonl", "id": 62825, "text": "2. In order to fulfill the statutory responsibility or statutory obligations such as the performance of direct relevant responsibilities or legal obligations such as the performance of directly related responsibilities or legal obligations such as the performance of the national security, national defense security, criminal investigation, prosecution, trial, and judgment implementation.", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to fulfill the statutory duties or the collection and usage information necessary for the statutory volunteer, there is no need to solicit authorization consent."}
{"task": "rw_74.jsonl", "id": 62826, "text": "3. In order to cope with emergencies, or in urgent situations to protect the health and property safety of natural people.", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to cope with emergencies, or in urgent cases to protect the life and health of natural persons and the necessary collection and use information, no need to solicit authorization."}
{"task": "rw_74.jsonl", "id": 62827, "text": "4. For the facts of public interests, news reports and public opinion supervision, etc., deal with your personal information within a reasonable scope.", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to implement news reports and public opinion supervision, deal with personal information within a reasonable scope without soliciting authorization consent."}
{"task": "rw_74.jsonl", "id": 62828, "text": "5. In accordance with the provisions of the Personal Information Protection Law of the People's Republic of China, handle your personal information on your own or other legal personal information within a reasonable range.", "label": ["Important", "First Party Collection Information"], "rewrite": "In accordance with laws and regulations, personal information is processed by individuals or other legal disclosure within a reasonable range, and no authorization consent is required."}
{"task": "rw_74.jsonl", "id": 62829, "text": "6. Other circumstances stipulated in laws and administrative regulations.", "label": ["Important", "First Party Collection Information"], "rewrite": "Other collection and use information stipulated in laws and regulations does not need to solicit authorization."}
{"task": "rw_74.jsonl", "id": 62830, "text": "In particular, please pay attention: According to the law, if the information cannot be alone or combined with other information to identify specific individuals, it is not a personal information in the legal sense;", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62831, "text": "When your information can be identified alone or in combination with other information, or we will not be able to use the data that is connected with any specific personal information with your personal information, this information will be used as your personal information according to this\"Privacy Policy\" is dealt with and protected.", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62832, "text": "(4) Operation and safe operation:", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62833, "text": "When you use our products or services, in order to protect the security and legitimate rights and interests of you or other users or the public, we will collect the following information:", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use our products or services, we will collect the following information:"}
{"task": "rw_74.jsonl", "id": 62834, "text": "1. In order to provide you with automatic security protection services, we will run and collect mobile phone models, installed application lists, and network information in the background.", "label": ["Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "Collect mobile phone models, installed application lists, and network information to provide you with security protection services."}
{"task": "rw_74.jsonl", "id": 62835, "text": "At the same time, when you use the security protection function, you can realize the authority of your phone (device information) and storage space due to the function needs. We will obtain your necessary device information and storage space permissions after obtaining your consentEssence", "label": ["Permission Acquisition", "Important"], "rewrite": "Get your equipment information and storage space permissions to achieve security protection functions."}
{"task": "rw_74.jsonl", "id": 62836, "text": "Application source.", "label": ["Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "Collect application information or process information that is running or running, the overall operation of the application, the use of usage and frequency, the application crash, the overall installation usage, performance data, and the source of application to prevent malicious procedures and ensure the quality of operation."}
{"task": "rw_74.jsonl", "id": 62837, "text": "3. We may use your account information, equipment information, service log information, as well as our related parties and partners to obtain information you authorized or provided to us according to law, to judge account security, transaction security, identity verification, and authentication, and authentication.Identify the laws and regulations, test and prevent safety incidents, and take necessary records, analysis, and disposal measures in accordance with the law.", "label": ["Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "Use your account information, equipment information, service log information, and information authorized to judge account security, identify identity, prevent security incidents, etc."}
{"task": "rw_74.jsonl", "id": 62838, "text": "2. We may share, transfer or disclose information", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62839, "text": "(1) Share", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62840, "text": "1. For your personal information, without your consent, we will not share your personal information with any company, organization and individual. Unless the share of personal information is to identify the information after the processingNatural persons who identify such information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only share personal information after identifying processing, and shared third parties that cannot re -recognize such information."}
{"task": "rw_74.jsonl", "id": 62841, "text": "If the purpose of third parties using information surpasses the scope of the original authorization consent, third parties need to re -obtain your consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If the purpose of third -party information uses information beyond the scope of the original authorization consent, you need to re -obtain your consent."}
{"task": "rw_74.jsonl", "id": 62842, "text": "We promise: When sharing your personal information, it is based on legal and legitimate goals, and the share of personal information is limited to the necessary purpose.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "When sharing your personal information, it is based on legitimate and legitimate goals, and the personal information that is shared is limited to the necessary purpose."}
{"task": "rw_74.jsonl", "id": 62843, "text": "We will also carefully evaluate the purpose of third -party use of shared information, comprehensively evaluate the security and guarantee capabilities of the partner, and ask them to handle personal information processing in accordance with the provisions of laws and administrative regulations and the agreement of cooperation agreements.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will carefully evaluate the purpose of third -party use of shared information, comprehensively evaluate the security and guarantee capabilities of these partners, and ask them to follow the legal agreement of cooperation."}
{"task": "rw_74.jsonl", "id": 62844, "text": "2. Realize the sharing information of functions or services:", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62845, "text": "In order to provide you with more complete and high -quality products and services, we will authorize our partners to provide some services for you.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62846, "text": "In this case, we may share some of your personal information with partners or access third -party SDKs to provide better customer service and user experience.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share some personal information with your partners or access the third -party SDK to provide better customer service and user experience."}
{"task": "rw_74.jsonl", "id": 62847, "text": "We will list the types of our partners, please know and make appropriate choices.", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62848, "text": "Our partners include the following types:", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62849, "text": "(1) Third -party logistics service provider: When you place an order, if the product needs a third -party distribution, in order to accurately and safely complete the delivery and distribution of the goods, the third -party logistics company cannot be within the delivery and delivery sessionAvoid knowing the relevant distribution information you provided to us, such as the consignee's name, contact phone number, and receiving address. The necessary personal sensitive information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "If the goods you place your order require a third -party distribution, you will share the distribution information with a third -party logistics company."}
{"task": "rw_74.jsonl", "id": 62850, "text": "We promise you that we will ensure your personal information security with the greatest efforts. We will strictly require third -party logistics companies to keep your personal information confidential, and only learn and use only with the purpose of distribution.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will ask third -party logistics companies to keep your personal information confidential and only learn and use only for the purpose of distribution."}
{"task": "rw_74.jsonl", "id": 62851, "text": "(2) Real -name authentication audit service provider: When you perform real -name authentication or use the function of retrieved the account, we will share your personal information from a third -party audit service provider, such as real names, citizen identity numbers, phone numbers and other necessary personal sensitivityInformation so that you can recover your account smoothly.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "When you conduct real -name authentication or use the recovery account function, we will share your personal information from a third -party review service provider so that you can find your account."}
{"task": "rw_74.jsonl", "id": 62852, "text": "You can refuse to provide it, but if you refuse to provide it, you will not be able to use your account to find the function;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62853, "text": "(3) Co -organizer of the event: We may need to provide your necessary redemption information to the co -organizers of TV stations and other events, such as the real names such as real names, citizenship numbers, phone numbers, etc.Release prizes.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Provide your necessary redemption information with the co -organizer of the event, so that you can jointly host you to publish prizes."}
{"task": "rw_74.jsonl", "id": 62854, "text": "You can refuse to provide it, but if you refuse to provide it, the co -organizer of the event will not be able to verify your awards, so that you cannot issue prizes to you in time, but it will not affect your records in the event before that;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62855, "text": "(4) Data service providers: Partners including online advertising monitoring.", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62856, "text": "In order to maintain/improve our product/service and provide you with better content, we may share your relevant information with the designated partners who provide the service (including advertising play/display records, equipment identifiers,), but but), but but), but, but,), but, but,), butFor your information security, we currently only cooperate with partners who have signed strict data security confidentiality agreements. Without your consent, we will not share personal information that can identify your identity with it;", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security", "Usage"], "rewrite": "We may share your relevant information with the data service provider, instead of signing a data security confidentiality agreement to protect your information security, and you will not share your personal information without your consent."}
{"task": "rw_74.jsonl", "id": 62857, "text": "(5) Information service provider: Please pay special attention. We may need to provide third -party information service providers with personal information, such as mobile phone numbers, e -mail, etc.SMS, mail, etc. to push you the purpose of our product information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Provide third -party information service providers with personal information containing your personal sensitive information, and entrusts it to push you product information to you in the form of SMS and email."}
{"task": "rw_74.jsonl", "id": 62858, "text": "You understand and accept the aforementioned push behavior that we may take. If you do not want to receive our product push information, you can contact the web customer service or customer service in the client (open the JJ client-me-set-customer service help) to take a culinary book, You can also use the method notified by a third -party information service provider for a copy;", "label": ["Important", "Edit/Control"], "rewrite": "You can contact the web customer service or customer service in the client, or use a third -party information service provider to unsubscribe the product push information."}
{"task": "rw_74.jsonl", "id": 62859, "text": "(6) Cooperative third -party SDK service provider: When the corresponding functions are provided by a third party, we may access the software development package (SDK) provided by a third party to achieve related functions.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When the corresponding functions are provided by a third party, it will access the software development package (SDK) provided by a third party to achieve related functions."}
{"task": "rw_74.jsonl", "id": 62860, "text": "At this time, a third -party SDK service provider may collect your personal information including your personal sensitive information.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Third -party SDK service providers may collect your personal information including your personal sensitive information."}
{"task": "rw_74.jsonl", "id": 62861, "text": "You can refuse to provide it, but if you refuse to provide it, you will not be able to use the relevant functions provided by the third -party SDK service provider, but it will not affect the normal use of other functions and services.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62862, "text": "You can click [https://acts.jj.cn/html/activity_topic/stative/22030185feda.html] Link to view our situation of our third -party SDK;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You can click [https://acts.jj.cn/html/activity_topic/stative/22030185feda.html] Link to view the situation of accessing third -party SDKs."}
{"task": "rw_74.jsonl", "id": 62863, "text": "(7) Identity authentication service provider: When we judge that your account is in an abnormal state (such as the reference, abnormal recharge, etc.), Alipay identity authentication SDK (service provider privacy policy link: https: //www.alipay.com/))Will obtain the facial feature information of the current login user through the camera permissions and then identify the corresponding user identity information (such as name and ID number), and then compare the aforementioned information with your real -name information provided by our Alipay to ensure loginUsers for you.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "When judging that your account is in an abnormal state, Alipay identity authentication SDK will obtain the facial feature information of the current login user through the camera permissions for authentication to ensure that the login user is for you."}
{"task": "rw_74.jsonl", "id": 62864, "text": "We are to avoid incidents such as stealing numbers and minors recharge. We promise: We will never allow Alipay to use your real -name information for other uses, and we will never collect or store any facial feature information on our own.", "label": ["Important", "Data Security"], "rewrite": "Alipay is not allowed to use your real -name information for other purposes, and never collect or store any facial feature information on your own."}
{"task": "rw_74.jsonl", "id": 62865, "text": "Please pay special attention, facial recognition is personal sensitive information, you can refuse to provide.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62866, "text": "If you refuse to provide it, you will not be able to certify your identity, so you cannot log in to the account for the time being;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62867, "text": "(8) Other business partners: If partners who entrust our party to promote and advertise, we will only provide the partner with the user portrait label that cannot recognize your personal identity or the mobile phone that is encrypted and/or confusing.The information after the number/equipment information or the anonymous processing to ensure that the information receiver cannot identify your identity, and require partners to strictly abide by the relevant confidentiality agreement and its own privacy policy.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "We will only provide a user portrait label that cannot recognize personal identity to the commissioned partner or the mobile phone number/equipment information or anonymous processing of the encryption and/or confusing processing of the user identity.Regulations for privacy policies."}
{"task": "rw_74.jsonl", "id": 62868, "text": "We may inform how many people of the commissioner read their promotional information or buy the commodity of the client after seeing the information, or provide them with statistical information that cannot recognize personal identity to help them understand their audience or customers;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share their promotional information with the commissioner or provide statistical information that cannot recognize personal identity."}
{"task": "rw_74.jsonl", "id": 62869, "text": "(9) It is necessary to share with our affiliates: We may share your personal information with our affiliates.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share your personal information with related companies."}
{"task": "rw_74.jsonl", "id": 62870, "text": "We will only share the necessary personal information, and this sharing of the purpose of sharing the purpose of this policy.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only share the necessary personal information and be restricted by the purpose declared by this policy."}
{"task": "rw_74.jsonl", "id": 62871, "text": "If related companies want to change the purpose of personal information and methods, it will obtain your authorization and consent again;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If the related company changes the purpose and method of handling personal information, it will once again obtain your authorization and consent."}
{"task": "rw_74.jsonl", "id": 62872, "text": "(10), you can share your personal information or other information based on the competitive world service with the third party (including unspecified objects), but the information leakage and use of information caused by your shared behavior have nothing to do with the competitive world, The competitive world does not bear legal responsibility because of this;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "You can share your personal information or other information with a third party, but therefore leaked that the competitive world does not assume legal responsibility."}
{"task": "rw_74.jsonl", "id": 62873, "text": "(11) In the scope allowed by law and administrative regulations, in order to abide by the law and maintain the interests of our affiliated parties or partners, your or other competitive world users or other public interests, property or security, it is exempted from damage.We may exchange information with other companies and organizations in other companies and organizations.", "label": ["Important", "Risk"], "rewrite": "In order to abide by the law and safeguard the interests of all parties, we may exchange information with other companies and organizations."}
{"task": "rw_74.jsonl", "id": 62874, "text": "However, this does not include the information that violates the promise made in this \"Privacy Policy\" to sell, rent, shared or disclosed in other ways for profit purposes.", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62875, "text": "(2) Transfer", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62876, "text": "1. With the sustainable development of our business, we may have a merger, acquisition, asset transfer or similar transactions, and your information may be transferred as part of such transactions.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Your information may be transferred as part of the merger, acquisition, asset transfer or similar transactions."}
{"task": "rw_74.jsonl", "id": 62877, "text": "After the previous merger, acquisition, asset transfer, or similar transactions, we will publicize the names and contact information of new companies holding your information within a reasonable period.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After merging, acquisition, asset transfer, or similar transactions, the name, contact information of the company holding your information will be publicized."}
{"task": "rw_74.jsonl", "id": 62878, "text": "We will ask new companies and organizations holding your information to continue to be subject to the \"Privacy Policy\". Otherwise, we will ask the company and the organization to solicit you re -authorization.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "The party will be required to continue to be subject to this policy, otherwise it will request that it will re -solicit authorization consent."}
{"task": "rw_74.jsonl", "id": 62879, "text": "2. After getting your clear consent, we will transfer your information to other parties.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After getting your clear consent, we will transfer your information to other parties."}
{"task": "rw_74.jsonl", "id": 62880, "text": "(3) Disclosure", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62881, "text": "We will disclose your information only on the premise that we will only disclose your information on the premise that the following situations and adopt safety protection measures that meet the industry standards:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will disclose your information only on the premise that we will only disclose your information on the premise that the following situations and adopt safety protection measures that meet the industry standards:"}
{"task": "rw_74.jsonl", "id": 62882, "text": "1. According to your needs, disclose the information you specified under your clear consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "According to your needs, disclose the information you specified under your clear consent."}
{"task": "rw_74.jsonl", "id": 62883, "text": "2. In accordance with the requirements of laws and administrative regulations, mandatory administrative law enforcement or judicial requirements, you may disclose your information based on the type and disclosure method required.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In accordance with the requirements of laws and administrative regulations, mandatory administrative law enforcement or judicial requirements, you may disclose your information according to the type and disclosure method required."}
{"task": "rw_74.jsonl", "id": 62884, "text": "Under the premise of compliance with laws and administrative regulations, when we receive a request for the above disclosure information, we ask the receiver to issue corresponding legal documents such as subpoena or investigation letter.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will ask for the receiver who request disclosure information to issue corresponding legal documents."}
{"task": "rw_74.jsonl", "id": 62885, "text": "We firmly believe that for the information requested by us, it should be as transparent as much as possible within the scope of law.", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62886, "text": "We have carefully reviewed all the requests to ensure that it has a legal basis and is limited to data obtained by law enforcement agencies because of specific investigations and legitimate rights.", "label": ["Important", "Data Security"], "rewrite": "Review the requests of personal information disclosure to ensure that it has a legitimate basis and is limited to data obtained by law enforcement agencies because of specific investigation purposes and legally rights."}
{"task": "rw_74.jsonl", "id": 62887, "text": "3. How do we retain, store and protect information", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62888, "text": "We will take all reasonable and feasible measures to ensure unrelated information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will take measures to ensure unrelated information."}
{"task": "rw_74.jsonl", "id": 62889, "text": "We only retain your information within the time limit of the purpose of the \"Privacy Policy\" and the time limit for the requirements of the law, and the administrative regulations, and actively delete your information after the above period expires, but the preservation period stipulated in laws and administrative regulations has not failed.If you expire or delete personal information from technically difficult to achieve, we will stop processing except storage and taking necessary security measures.", "label": ["Data Retention", "Important"], "rewrite": "Keep your personal information within the time limit required for the service purpose. After exceeding the storage period, your personal information will be deleted or anonymous. If the laws and regulations are difficult to achieve in terms ofSafety protection measures beyond treatment."}
{"task": "rw_74.jsonl", "id": 62890, "text": "The information we collected and generated during the operation of the People's Republic of China is stored in the country.", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in domestic operations will be stored in China."}
{"task": "rw_74.jsonl", "id": 62891, "text": "At present, we will not transmit the above information overseas. If we transmit them overseas, we will follow relevant national laws, administrative regulations or soliciting your consent.", "label": ["Data Retention", "Important"], "rewrite": "If we transmit personal information to overseas, we will follow the relevant national laws, administrative regulations, or ask your consent."}
{"task": "rw_74.jsonl", "id": 62892, "text": "We will take the following means to protect your information:", "label": ["Data Security"], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62893, "text": "(1) Formulate internal management systems and operating procedures:", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62894, "text": "We have established a special security department, security management system, and data security processes to ensure your personal information security.", "label": ["Important", "Data Security"], "rewrite": "Establish a special security department, security management system, and data security process to ensure your personal information security."}
{"task": "rw_74.jsonl", "id": 62895, "text": "We adopt strict data use and access system specifications. Only the competitive world employees and partners who need to know about this information can access your information, and set up strict access to control and monitoring mechanisms for this.", "label": ["Important", "Data Security"], "rewrite": "Take strict data use and access system specifications to strictly manage employees or partners who may contact you."}
{"task": "rw_74.jsonl", "id": 62896, "text": "We use the confidentiality agreement, monitoring and audit mechanism through information contactors to fully control the data, and require all personnel who may contact your information to perform the corresponding confidentiality obligations.", "label": ["Important", "Data Security"], "rewrite": "Through the confidentiality agreement, monitoring and auditing mechanism of information contacts, the data is fully securely controlled, and all personnel who may contact the personal information must fulfill the corresponding confidentiality obligations."}
{"task": "rw_74.jsonl", "id": 62897, "text": "If these obligations fail to fulfill these obligations, they may be held legal or suspended or suspended from the competitive world.", "label": ["Important", "Data Security"], "rewrite": "If the relevant personnel fail to fulfill their obligations, they may be held legal or suspended in cooperative relationships."}
{"task": "rw_74.jsonl", "id": 62898, "text": "We will organize safety and privacy protection training courses to strengthen employees' awareness of protecting the importance of information. At the same time, we will regularly conduct compliant audit on our personal information compliance with laws and administrative regulations.", "label": ["Important", "Data Security"], "rewrite": "Organize safety and privacy protection training courses to strengthen employee understanding."}
{"task": "rw_74.jsonl", "id": 62899, "text": "(2) Classified management of personal information:", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62900, "text": "We manages the storage and use of information by establishing data classification and grading system, data security management specifications, and data security development specifications.", "label": ["Important", "Data Security"], "rewrite": "Establish a data classification hierarchical system, data security management specifications, and data security development specifications to manage the storage and use of information."}
{"task": "rw_74.jsonl", "id": 62901, "text": "(3) Take corresponding safety technical measures such as encryption and de -identification:", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62902, "text": "We will adopt encryption, de -identification technology, anonymous treatment, and related reasonable and feasible methods that are not lower than the industry's usual levels to protect your personal information, and apply security protection technology to prevent your information from being maliciously attacked.", "label": ["Important", "Data Security"], "rewrite": "Take encryption, de -identification technology, anonymous treatment and other means to protect your personal information."}
{"task": "rw_74.jsonl", "id": 62903, "text": "(4) Safety event disposal:", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62904, "text": "In order to cope with the possible risks such as information leakage, damage, and loss, we have formulated a number of systems to clarify the classification and classification standards of security events, the classification standards of security vulnerabilities, and the corresponding processing process.", "label": ["Important", "Data Security"], "rewrite": "Formulate a number of systems to clarify the classification and grading standards of safety events, safety vulnerabilities, and corresponding processing processes."}
{"task": "rw_74.jsonl", "id": 62905, "text": "We have also established a special emergency response team for security incidents. In accordance with the requirements of safety incidents, we initiated the safety plan for different security incidents to conduct stop loss, analysis, positioning, formulation of remedial measures, and combined with relevant departments to trace the source and strike.", "label": ["Important", "Data Security"], "rewrite": "Establish a special emergency response team to start a safety plan for different security events."}
{"task": "rw_74.jsonl", "id": 62906, "text": "After unfortunate information security incidents, we will inform you in a timely manner in accordance with the requirements of laws and administrative regulations: the basic situation and possible impact of the security incident, the disposal measures we have adopted or we will take, you can prevent and reduce the risk of autonomy and reduce risksSuggestions, remedy measures, etc.", "label": ["Important", "Data Security"], "rewrite": "If a personal information security incident occurs, we will inform your basic situation, possible impact, disposal measures, independent prevention suggestions, etc."}
{"task": "rw_74.jsonl", "id": 62907, "text": "At the same time, we will inform you that the incident -related situation is in the form of mail, letter, telephone, push notification, etc. When it is difficult to inform the information subject one by one, we will publish an announcement in a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "The relevant situation of security incidents will be informed by mail, letter, telephone, push notification, etc. When it is difficult to inform one by one, it will issue an announcement."}
{"task": "rw_74.jsonl", "id": 62908, "text": "At the same time, we will also actively report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "The disposal of personal information security incidents will be reported in accordance with the requirements of the regulatory authorities."}
{"task": "rw_74.jsonl", "id": 62909, "text": "(5) Safety reminder:", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62910, "text": "When communicating or purchasing goods and services with third parties through the competitive world service, you inevitably disclose your information from the other party or the potential transaction party, such as the contact method or the receiving address.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When communicating or purchasing goods and services with a third party, you have to disclose your information to the other party or the potential transaction."}
{"task": "rw_74.jsonl", "id": 62911, "text": "Please protect your information properly and provide others with only necessary situations.", "label": ["Important", "Data Security"], "rewrite": "Protecting your personal information properly, it is provided to others only under the necessary situation."}
{"task": "rw_74.jsonl", "id": 62912, "text": "The Internet is not an absolutely secure environment, and the communication method of email, instant messaging, social software or other service software cannot determine whether it is completely encrypted. We strongly recommend that you use complex passwords and regularly modify passwords when using such tools.Do not disclose your account password and related personal information to others.", "label": ["Important", "Data Security"], "rewrite": "Please use complex passwords to regularly modify the password, do not disclose your account password and related personal information to others."}
{"task": "rw_74.jsonl", "id": 62913, "text": "We will try our best to ensure or guarantee the security of any information you send to us.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62914, "text": "If our physics, technology, or management protection facilities are damaged, the information is caused by unauthorized access, public disclosure, tampering, or destruction, leading to damage to your legitimate rights and interests, we will bear the corresponding legal responsibility.", "label": ["Important", "Data Security"], "rewrite": "For example, our physical, technical, or management protection facilities are damaged, resulting in unauthorized access, public disclosure, tampering, or destruction, leading to damage to your legitimate rights and interests, we will bear the corresponding legal responsibility."}
{"task": "rw_74.jsonl", "id": 62915, "text": "At the same time, please know and understand that due to the limitations of technology and the limitations of risk prevention, even if we have tried to strengthen security measures, we cannot always ensure that the information is 100 % security.", "label": ["Important", "Data Security"], "rewrite": "Although there are security measures, it is impossible to fully guarantee that there is no security problem."}
{"task": "rw_74.jsonl", "id": 62916, "text": "If you access the system and communication network for the competitive world service, problems may also occur due to the situation outside of our controlled scope.", "label": ["Important", "Data Security"], "rewrite": "Systems and communication networks may have problems due to unprepared factors."}
{"task": "rw_74.jsonl", "id": 62917, "text": "4. Manage your information", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62918, "text": "We attach great importance to your management of personal information, and do our best to protect your personal information inquiry, access, modification, delete, withdrawn, withdrawing the authorization of authorization, cancellation accounts, and setting privacy functionsPrivacy and information security.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62919, "text": "(1) Access, update and delete", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62920, "text": "We encourage you to update and modify your personal information to make it more accurate and effective.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62921, "text": "You can access your personal information through the competitive world, and do it yourself according to the management method of the corresponding information, or ask us to modify, supplement and delete it.", "label": ["Important", "Edit/Control"], "rewrite": "Access your personal information through the competitive world service, and complete it according to the management method of the corresponding information, or require us to modify, supplement and delete it."}
{"task": "rw_74.jsonl", "id": 62922, "text": "For your requesting us to modify and supplement personal information, we verify the personal information provided by you, and make a modification and supplement in time after confirming it;", "label": ["Important", "Edit/Control"], "rewrite": "We verify the personal information you provide, and make a modification and supplement personal information in time after confirming it."}
{"task": "rw_74.jsonl", "id": 62923, "text": "For personal information you ask us to delete, we will delete it in time in time when the preservation period stipulated in laws and administrative regulations has expired or does not have delete personal information.", "label": ["Important", "Edit/Control"], "rewrite": "We ask us to delete personal information, and we will delete timely, unless laws and regulations are difficult to achieve in terms of regulations or technology."}
{"task": "rw_74.jsonl", "id": 62924, "text": "When visiting, updating, correcting, and deleting the aforementioned information, we may ask you to verify your identity to ensure information security.", "label": ["Edit/Control", "Important"], "rewrite": "When visiting, updating, corrected, and deleting the aforementioned information, you will ask you to verify your identity to ensure information security."}
{"task": "rw_74.jsonl", "id": 62925, "text": "If you want to query, modify, or delete some of your information, log in to the competitive World Account Center (www.jj.cn) or operate according to the specific guidelines of the single service.", "label": ["Important", "Edit/Control"], "rewrite": "Please log in to the Athletic World Account Center (www.jj.cn) or inquire, modify or delete some of your information according to the specific guidance of a single service."}
{"task": "rw_74.jsonl", "id": 62926, "text": "For your information collected through cookies and web, beacon, you can refuse or manage cookies or web, beacon through the browser or user selection mechanism.", "label": ["Important", "Edit/Control"], "rewrite": "You can refuse or manage Cookies or Web Beacon through the browser or user selection mechanism."}
{"task": "rw_74.jsonl", "id": 62927, "text": "(2) Public and sharing", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62928, "text": "Many of our services allow you to share your relevant information publicly with your social network, but also all users who use the service.Or the response issued by the published information, upload or publish your personal information in an open area that is visible to the unspecified user in the sports world service, as well as location data and log information, including this information related to these information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You can share your relevant information with your social network and all users using the service."}
{"task": "rw_74.jsonl", "id": 62929, "text": "As long as you do not delete the information you disclosed or shared, the information may always stay in the public field;", "label": ["Important", "Edit/Control"], "rewrite": "The information you disclosed or shared may always be left in the public field before deleting."}
{"task": "rw_74.jsonl", "id": 62930, "text": "Even if you delete sharing information, the relevant information may still be cached, replicated or stored independently by other users or the third party that is not controlled by us, or is preserved by other users or such third parties in the public.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "After deleting the information you share, it may still be independently preserved by other users or the third parties that are not controlled by us."}
{"task": "rw_74.jsonl", "id": 62931, "text": "If you disclose or share information through the above channels, we will not bear responsibility for your information leakage.", "label": ["Important", "Risk"], "rewrite": "If you open or share information, we will not bear responsibility."}
{"task": "rw_74.jsonl", "id": 62932, "text": "Therefore, we solemnly remind you and please consider whether to disclose or share your information through the above channels.", "label": ["Important"], "rewrite": "Care carefully!Whether to share or even share relevant information."}
{"task": "rw_74.jsonl", "id": 62933, "text": "(3) Logging out", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62934, "text": "You can submit a cancellation application on the mobile client or the PC client (mobile path: I-set (gear icon) -The customer service help-account appeal-account cancellation;", "label": ["Important", "Edit/Control"], "rewrite": "You can submit a cancellation application on the mobile client or PC client (mobile path: I-setting (gear icon)-customer service help-account appeal-account cancellation; PC side path: user avatar-customer service help-account cancellation)."}
{"task": "rw_74.jsonl", "id": 62935, "text": "PC-end path: User avatar-customer service help-account cancellation), after reviewing the publicity process (including but not limited to verifying information to confirm the identity of the user, determine the correspondence between the user and the account, determine whether the user account meets the cancellation conditions, etc.), Cancel the account and delete your personal information.", "label": ["Important", "Edit/Control"], "rewrite": "After approval, we will cancel the account and delete your personal information."}
{"task": "rw_74.jsonl", "id": 62936, "text": "Please be aware that the \"account\" under this agreement is the same account as the \"account\" provided by the competitive world and related companies. You cancel the \"account\" under this agreementIts single product or other services, at the same time, all information, assets, virtual currencies and virtual props in the account will be eliminated and cannot be restored to recover.", "label": ["Important", "Edit/Control"], "rewrite": "In this agreement, the \"account\" is the same account as the \"account\" provided by the competitive world and related companies. Once it is canceled, the virtual rights and interests in the account are eliminated and cannot be restored."}
{"task": "rw_74.jsonl", "id": 62937, "text": "After you actively cancel your account, we will stop providing you with products or services and delete your personal information according to the requirements of applicable laws and administrative regulations.", "label": ["Edit/Control", "Important"], "rewrite": "After you actively cancel your account, you will stop providing you with products or services and delete your personal information."}
{"task": "rw_74.jsonl", "id": 62938, "text": "If the personal information is difficult to achieve technically, we will conduct anonymized treatment of it, or stop the treatment except for storage and adopting necessary security measures, except for other provisions of laws and administrative regulations.", "label": ["Important"], "rewrite": "If the personal information is difficult to achieve technically, it will be anonymous to it, or stop it except storage and take necessary security measures."}
{"task": "rw_74.jsonl", "id": 62939, "text": "(4) Change the scope of your authorization consent", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62940, "text": "You can always choose whether to disclose personal information.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62941, "text": "Some personal information is necessary to use the competitive world service, but the provision of most other information is determined by you.", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62942, "text": "You can change your authorization of the scope of personal information or withdraw your authorization by deleting information and closing the device function.", "label": ["Important", "Edit/Control"], "rewrite": "You can change the scope of authorization or withdraw authorization by deleting information and closing the device function."}
{"task": "rw_74.jsonl", "id": 62943, "text": "When you withdraw authorization, we cannot continue to provide you with the service corresponding to the withdrawal authorization, and we will no longer deal with your corresponding personal information.", "label": ["Important", "Edit/Control"], "rewrite": "When you withdraw authorization, you no longer provide the corresponding service or process your corresponding personal information."}
{"task": "rw_74.jsonl", "id": 62944, "text": "But your decision to withdraw authorization will not affect personal information processing based on your authorization.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Withdrawal authorization will not affect the collection and use of information based on authorization."}
{"task": "rw_74.jsonl", "id": 62945, "text": "(5) Tips on sensitive information", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62946, "text": "Some personal information may be considered a personal sensitive information because of its particularity, including your ID number, personal biometric information, bank account number, communication records and content, property information, credit information, travel information, accommodation information, health, health, health, health, healthPhysiological information, transaction information, etc.", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62947, "text": "Please note that the content and information you provided, uploaded or published in the competitive world service (for example, photos or information about your social activities) may leak your sensitive information.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "The content and information you provided, uploaded or published in the service may leak your sensitive information."}
{"task": "rw_74.jsonl", "id": 62948, "text": "You need to consider carefully whether to use the competitive world service to disclose your sensitive information.", "label": ["Important", "Edit/Control"], "rewrite": "Please consider it carefully to disclose your sensitive information."}
{"task": "rw_74.jsonl", "id": 62949, "text": "If you check this \"Privacy Policy\", it means that you agree that your personal sensitive information is processed according to the purpose and method described in the \"Privacy Policy\".", "label": ["Policy Change", "Important"], "rewrite": "If you check this \"Privacy Policy\", it means that you agree that your personal sensitive information is processed according to the purpose and method described in the \"Privacy Policy\"."}
{"task": "rw_74.jsonl", "id": 62950, "text": "(6) Visiting Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62951, "text": "You can check all the contents of this \"Privacy Policy\" on the JJ client (open the JJ client-me-settings-about the version) on the JJ client (open the JJ client-I-Settings-Settings).", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62952, "text": "Five, third -party service", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62953, "text": "The competitive world service may link to social media or other services provided by third parties (including websites or other services).", "label": ["Important"], "rewrite": "Athletic world services may link to social media or other services provided by third parties."}
{"task": "rw_74.jsonl", "id": 62954, "text": "include:", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62955, "text": "(1) You can use the \"Share\" key to share some content to the competitive world service, or you can use third -party services to log in to the competitive world service.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You can use the \"Share\" key to share some content to the competitive world service, or use third -party services to log in to the competitive world service."}
{"task": "rw_74.jsonl", "id": 62956, "text": "These functions may collect your information (including your log information) and may run the above functions normally at your computer device;", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "These sharing functions may collect your information and may run the above functions normally on your computer device cookies."}
{"task": "rw_74.jsonl", "id": 62957, "text": "(2) We provide you with links to you through advertising or other ways of service, so that you can access third -party services or websites;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Provide you through advertising or other ways to enable you to access third -party services or websites."}
{"task": "rw_74.jsonl", "id": 62958, "text": "and", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62959, "text": "(3) Other conditions to access third -party services.", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62960, "text": "These third -party social media or other services are operated by related third parties.", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62961, "text": "You use these third -party social media services or other services (including any information you provided to these third parties), which must be protected by the third party's own service clauses and personal information (not this \"Privacy Policy\")For constraints, you need to read its clause carefully.", "label": ["Important"], "rewrite": "If you use third -party social media services or other services, you must be restricted by the third -party service terms and personal information protection statements."}
{"task": "rw_74.jsonl", "id": 62962, "text": "This \"Privacy Policy\" is only applicable to the personal information we collected, and it does not apply to the service provided by any third party or the personal information use rules provided by any third party.responsibility.", "label": ["Important"], "rewrite": "We don't have any responsibility for any third party's personal information."}
{"task": "rw_74.jsonl", "id": 62963, "text": "6. Notice and revision", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62964, "text": "We may modify this \"Privacy Policy\" or specific terms in a timely manner. These modifications constitute a part of the \"Privacy Policy\" and have the same effect as this \"Privacy Policy\".", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62965, "text": "For the aforementioned modification, we will promptly prompt you to pay attention to the amendments to this \"Privacy Policy\" or specific clauses in a proper way (such as pop -up window prompts, page prompts, emails, community announcements, SMS notifications, functional updates, etc.).", "label": ["Policy Change", "Important"], "rewrite": "For the modification of privacy policies or specific terms, we will prompt you to pay attention in a timely manner."}
{"task": "rw_74.jsonl", "id": 62966, "text": "If the above modification involves changes in the purpose, method, and scope of our personal information, we will promptly in a prominent way (such as pop -up window prompts, page prompts, email, community announcement, SMS notification, functional update and other methods such as ) Notify you and get your re -authorization.", "label": ["Policy Change", "Important"], "rewrite": "If the modification of privacy policy involves changes in the purpose, method, and scope of personal information, it will notify you in a significant way and get your re -authorization."}
{"task": "rw_74.jsonl", "id": 62967, "text": "In this case, if you continue to use the products or services of the competitive world, it means the restrictions of the \"Privacy Policy\" and specific terms that are agreed to be revised;", "label": ["Policy Change", "Important", "Risk"], "rewrite": "Continue to use services is deemed to agree to accept the content of the privacy policy after the revision."}
{"task": "rw_74.jsonl", "id": 62968, "text": "If you refuse to accept, you will not be able to continue to use and refuse to accept the products or services corresponding to some terms.", "label": ["Policy Change", "Important"], "rewrite": "If you refuse to accept the revised privacy policy or related terms, you will not be able to continue to use and refuse to accept the products or services corresponding to some terms."}
{"task": "rw_74.jsonl", "id": 62969, "text": "We may issue announcements related to products or services when necessary (for example when we suspend a certain service due to system maintenance).", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62970, "text": "You may not be able to cancel these announcements related to products or services and nature.", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62971, "text": "Finally, you must have a confidential obligation to your account and password information.", "label": ["Important", "Data Security"], "rewrite": "You have a confidential obligation to your account and password information."}
{"task": "rw_74.jsonl", "id": 62972, "text": "In any case, please keep it carefully and properly.", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62973, "text": "Seven, how to contact us", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62974, "text": "If you have any issues, opinions or suggestions on this \"Privacy Policy\" and your information related to this \"Privacy Policy\" and your information, and issues of privacy measures about this statement or the competitive world, please use the web customer service through the web customer serviceOr the customer service in the client (open the JJ client-me-setting-customer service help) and the competitive world.", "label": ["Important", "Contact Information"], "rewrite": "You can connect with the competition world through the web customer service or client customer service (open the JJ client-me-setting-customer service help)."}
{"task": "rw_74.jsonl", "id": 62975, "text": "Appendix of Privacy Policy:", "label": [], "rewrite": []}
{"task": "rw_74.jsonl", "id": 62976, "text": "Application right query link:, https: //acts.jj.cn/html/activity_topic/stative/22030166d78a.html", "label": ["Important", "Edit/Control"], "rewrite": "Application right query link: https://acts.jj.cn/html/activity_topic/stative/22030166d78a.html"}
{"task": "rw_74.jsonl", "id": 62977, "text": "Personal information query link:, https://acts.jj.cn/html/activity_topic/stative/2203018eb630.html", "label": ["Important", "Edit/Control"], "rewrite": "Personal information query link: https://acts.jj.cn/html/activity_topic/stative/2203018eb630.html"}
{"task": "rw_74.jsonl", "id": 62978, "text": "Third -party SDK query link:, https://acts.jj.cn/html/activity_topic/stative/22030185feda.html", "label": ["Important", "Edit/Control"], "rewrite": "Third -party SDK query link: https://acts.jj.cn/html/activity_topic/stative/22030185feda.html"}
{"task": "rw_74.jsonl", "id": 62979, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
