{"task": "rw_76.jsonl", "id": 63218, "text": "Update date: 2022-07-28", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63219, "text": "Effective date: 2022-07-28", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63220, "text": "download", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63221, "text": "Privacy Protection Guidelines Update Tips", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63222, "text": "Thank you for using the QQ browser!", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63223, "text": "In order to better protect your rights and interests, we have recently updated the \"Guidelines for Privacy Protection of QQ Browser\".", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63224, "text": "The content of this update is:", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63225, "text": "1. In section 1 \"The Information we collect\", we will introduce our newly added tool equity cards and personal information collection and use in paid services;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63226, "text": "The collection and usage of sensors;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63227, "text": "Log in to QQ Music directly play the collection and use of personal information involved in the music function in the QQ browser search results;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63228, "text": "Personal information collection and use during the trial cloud game.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63229, "text": "2. In the \"Information Security\" section in Section 3, the QQ browser has introduced the evaluation and filing of the national communication network security protection level (level 3).", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63230, "text": "Please read carefully before using/continue to use the QQ browser product and/or service, fully understand the full text, and use/continue to use after agreeing with all the content.", "label": ["Policy Change", "Important"], "rewrite": "Please read carefully before using/continue to use the QQ browser product and/or service, fully understand the full text, and use/continue to use after agreeing with all the content."}
{"task": "rw_76.jsonl", "id": 63231, "text": "preface", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63232, "text": "We know the importance of personal information to you. We will strictly abide by laws and regulations, follow the principles of privacy protection, and provide you with more secure and reliable services.", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63233, "text": "(1) QQ browser is a browser -like product provided by Shenzhen Tencent Computer System Co., Ltd. (hereinafter referred to as \"Us\").The 35th floor of Tencent Building all the way, at the same time, we will also jointly operate with affiliated companies during the product operation process.", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63234, "text": "If you have any questions or concerns about this guideline or related issues, please contact us through the contact information provided by \"Contact Us\" in section 11 of this guideline.", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63235, "text": "(2) This privacy protection guide is suitable for all terminal clients such as the QQ browser PC side, APP (including but not limited to iOS version, Android version), iPad, and applet (hereinafter referred to as \"platform\")Various products and services provided by you.", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63236, "text": "If a client or an application software version has special features or special personal information processing activities, we will explain it.", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63237, "text": "For example, our client, products and/or services have set up a privacy policy/privacy agreement separately, and a separate privacy policy/privacy agreement is preferentially applied to the guidelines for privacy protection;", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63238, "text": "The content of the privacy policy/privacy agreement is not mentioned, and the guidelines for privacy protection are applied.", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63239, "text": "Please note that this privacy protection guide is not suitable for any third -party application or software integrated with our platform, products and/or services, or any other third -party product, service or business (collectively referred to as \"third -party services\").", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63240, "text": "Third -party services are operated by third -party services. If you use third -party services, you should comply with the privacy policy or other personal information processing rules formulated by the third party for this.Check the relevant rules carefully before.", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63241, "text": "(3) In response to the terms involving a significant relationship with you (possibilities) and the processing of sensitive personal information, we will adopt a rough, down line or other reasonable ways in this guideline to remind you to read.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63242, "text": "(4) You agree that this guidelines say that you have understood and agreed that in related scenarios, we will process your relevant personal information in order to achieve functional operation.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63243, "text": "But this does not mean that as long as you start using our products and/or services, we will process all the personal information involved in this guideline.", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63244, "text": "Only when you use specific functions, we will process your relevant personal information in order to achieve the purpose of providing you to you according to the \"minimum necessary\" principle.", "label": ["Important", "Data Security"], "rewrite": "Only when you use specific functions, we will process your relevant personal information in order to achieve the purpose of providing you to you according to the \"minimum necessary\" principle."}
{"task": "rw_76.jsonl", "id": 63245, "text": "(5) In addition to this guideline, in specific scenarios, the way we will notify time (including but not limited to updating the guidelines, re -signing files, page prompts, pop -ups, in -site letters, emails, website announcements or other convenient facilities facilitatedThe way you know) will explain to you in detail the rules, methods, scope and other rules of the corresponding information, and process it after obtaining your authorization consent.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "In specific scenarios, we will explain in detail the methods of the processing purpose, method, scope and other rules of the corresponding information in detail, and process it after obtaining your authorization consent."}
{"task": "rw_76.jsonl", "id": 63246, "text": "This privacy protection guidelines will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63247, "text": "1. The information we collect", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63248, "text": "2. Storage of information", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63249, "text": "3. Information security", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63250, "text": "4. How do we use information", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63251, "text": "5. Provide outside", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63252, "text": "6. Automated decision", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63253, "text": "7. Your rights", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63254, "text": "8. Change", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63255, "text": "9. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63256, "text": "10. Others", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63257, "text": "11. Contact us", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63258, "text": "The information we collect and use", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63259, "text": "1. The information we collect", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63260, "text": "In the process of using this product service, we will collect the information that you actively provide or due to the service when using the service as follows, to provide you with services, optimize our services, and ensure your account securityThe", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63261, "text": "· In order to provide you with information display, search and other services, it is adaptable to your mobile phone display. We need to understand the adaptability of different hardware equipment. At the same time, in order to ensure the safety and stability of the operating environment, the identification account is abnormalWhen you view information, watch videos, read novels, and search services through the QQ browser, we will collect your device logo (such as IMEI, Android ID, IMSI, etc.), device MAC address, device SN (hardware sequence number),, hardware serial number), hardware sequence number), hardware sequence number)Mobile phone models, hardware parameters, system versions, network status and records, IP addresses, system logs, installed application lists and other information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63262, "text": "· This product only supports you to register with WeChat account or QQ number.", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63263, "text": "According to your authorization, we will collect your WeChat account number or QQ number unique identification, avatar, nickname, and at the same time, based on your active filling, collect your gender, birthday, regional and personality signature/personal introduction to preserve your login information, Enable you to synchronize your data when logging in different devices and different versions.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect the unique logo, avatar, and nickname of your WeChat account or QQ number based on your authorization."}
{"task": "rw_76.jsonl", "id": 63264, "text": "· After you agree, we will also collect your mobile phone number for verifying your user information and provide security guarantee for account numbers.", "label": ["Important", "First Party Collection Information"], "rewrite": "After you agree, we will also collect your mobile phone number to verify your user information and provide security guarantee for accounts."}
{"task": "rw_76.jsonl", "id": 63265, "text": "After binding accounts, you can quickly comment or conduct activities related to activities.", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63266, "text": "The collection of mobile phone numbers is to meet the real -name system requirements of relevant laws and regulations.", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63267, "text": "If you refuse to provide a mobile phone number, it will only make you unable to publish information, comment and other contents or participate in specific operational activities, but it does not affect other functions of your use of QQ browser normally.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide a mobile phone number, it will only make you unable to publish information, comment and other contents or participate in specific operational activities, but it does not affect other functions of your use of QQ browser normally."}
{"task": "rw_76.jsonl", "id": 63268, "text": "In addition, we may send service notices, research questionnaires, marketing SMS and other information to your mobile phone number.", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63269, "text": "If you don't want to receive the above information, you can withdraw bips in the SMS or contact us through customer service.", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63270, "text": "· If you participate in welfare activities in the QQ browser and get rewards, when applying for withdrawal cash, you need to provide real names and ID numbers to verify your identity information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When applying for cash, you need to provide real names and ID numbers to verify your identity information."}
{"task": "rw_76.jsonl", "id": 63271, "text": "·, We may collect your information through cookies, identifiers, and related technologies, including your device information, browsing information, click information, and a third -party website login password (when you agree to store the web password on the local area), and this should be the this way), and this should be the case.For information storage as a log information, you provide you with personalized user experience and guarantee service security.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may collect your information through cookies, identifiers, and related technologies, including your device information, browsing information, click information, and a third -party website login password (when you agree to store the web password in the local area)."}
{"task": "rw_76.jsonl", "id": 63272, "text": "You can use the browser to set the use of refusal or managing cookies, identifiers, or related technologies.", "label": ["Important", "Edit/Control"], "rewrite": "You can use the browser to set the use of refusal or managing cookies, identifiers, or related technologies."}
{"task": "rw_76.jsonl", "id": 63273, "text": "At the same time, in order to ensure the stable operation of the QQ browser or implementation of related functions, we may access the software development package (SDK) provided by a third party to achieve the previous purpose.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to ensure the stable operation or implementation of the QQ browser, we may access the previous purpose of the software development package (SDK) provided by a third party."}
{"task": "rw_76.jsonl", "id": 63274, "text": "See this link for third -party SDK access by QQ browser.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "See this link for third -party SDK access by QQ browser."}
{"task": "rw_76.jsonl", "id": 63275, "text": "·, When you use the weather, local information, local channels and other regional services, we will collect your cellid to obtain the geographical information of your equipment after obtaining your consent, and collect your nearby Wi-Fi assistance.Complete positioning to show you the weather services, urban information, providing local channels and regional recommendation services to you.", "label": ["Important", "First Party Collection Information"], "rewrite": "After obtaining your consent, we will collect your Cellid to get the geographical information of your device and complete the positioning of your nearby Wi-Fi assistance."}
{"task": "rw_76.jsonl", "id": 63276, "text": "Accurate geographical location information is sensitive information. Refusing to provide the precise geographical location permissions of the device will only cause you to use the precise geographical location to provide regional services or recommendation services based on the precise geographical location, but it does not affect the others that you use the QQ browser normallyServices (including weather services, information, and regional services provided by the general positions obtained by you obtained by you can actively set urban information).", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "Accurate geographical location information is sensitive information. Refusing to provide the precise geographical location permissions of the device will only cause you to use the precise geographical location to provide regional services or recommendation services based on the precise geographical location, but it does not affect the others that you use the QQ browser normallyServe."}
{"task": "rw_76.jsonl", "id": 63277, "text": "· When you use pictures to browse, save pictures, upload pictures, format conversion tools, etc., we may get your album information after obtaining your consent;", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "When you use pictures to browse, save pictures, picture upload, format conversion tools and other functions, we may get your album information after obtaining your consent."}
{"task": "rw_76.jsonl", "id": 63278, "text": "The album information is a sensitive information. Rejecting to provide this information can only cause you to unable to use the features related to the pictures we provide, but it does not affect other services provided by your QQ browser normally.", "label": ["Important", "First Party Collection Information"], "rewrite": "The album information is a sensitive information. Rejecting to provide this information can only cause you to unable to use the features related to the pictures we provide, but it does not affect other services provided by your QQ browser normally."}
{"task": "rw_76.jsonl", "id": 63279, "text": "·, In order to help you find and manage the picture better, after you have clearly agreed, we rely on AI image technology to intelligently automatically classify the content (things and text and other elements) in your picture, so that you can in the pictureCleaning can be more convenient to clean up according to the type of picture, you can quickly find the picture you need by searching the function;", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "After you clearly agree, we rely on AI image technology to intelligently automatically classify the content (elements such as things and text) in your picture."}
{"task": "rw_76.jsonl", "id": 63280, "text": "You can also try the text information contained in the picture to find the picture you need.", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63281, "text": "The content of your picture information and the pictures recognized by AI always stores in your terminal devices. We will not collect the above information on the server, nor will it use your picture outside of this scene.", "label": ["Data Retention", "Important", "First Party Collection Information"], "rewrite": "The content of your picture information and the pictures recognized by AI always stores in your terminal devices. We will not collect the above information on the server, nor will it use your picture outside of this scene."}
{"task": "rw_76.jsonl", "id": 63282, "text": "If you need to close the intelligent classification function, you can set it in [Settings-Privacy Settings-Smart Classification]. After closing, the relevant functions of intelligent classification and local picture search will be unavailable.", "label": ["Important", "Edit/Control"], "rewrite": "If you need to close the intelligent classification function, you can set it in [Settings-Privacy Settings-Smart Classification]. After closing, the relevant functions of intelligent classification and local picture search will be unavailable."}
{"task": "rw_76.jsonl", "id": 63283, "text": "· When you use the file management function, we will obtain your storage permissions after obtaining your consent.", "label": ["Data Retention", "Permission Acquisition", "Important"], "rewrite": "When you use the file management function, we will obtain your storage permissions after obtaining your consent."}
{"task": "rw_76.jsonl", "id": 63284, "text": "For your more convenient classification, management, and editing local documents, we will traverse files and based on the abstract information to establish indexes locally;", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63285, "text": "We will also update the index on the index based on the results of background scanning, so that you can see the files in the mobile phone in real time;", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63286, "text": "For the files you often visit and edit, we may also display the file in the QQ browser directly to the \"frequent use\" module. If you don't want to display, you can delete \"frequently use\" on the direct page and press the icon.Close personalized recommendations in function or privacy settings;", "label": ["Important", "Edit/Control"], "rewrite": "If you do not want to display, you can close personalized recommendations in the direct press page to delete the \"frequent use\" function or privacy settings."}
{"task": "rw_76.jsonl", "id": 63287, "text": "We also provide you with garbage cleaning function. We need to get the application list of your installation and application to scan these applications cache garbage files and achieve mobile phone acceleration.) And download the multimedia files of your mobile phone in the download management scenario to scan the multimedia files of your mobile phone to facilitate your timely understanding the information of the mobile garbage file occupying the storage space and deciding whether to clean it up.", "label": ["First Party Collection Information", "Permission Acquisition"], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63288, "text": "But the file content is always stored in your terminal device, we will not collect and store the above information on the server.", "label": ["Data Retention", "Important", "First Party Collection Information"], "rewrite": "But the file content is always stored in your terminal device, we will not collect and store the above information on the server."}
{"task": "rw_76.jsonl", "id": 63289, "text": "· When you use your resume tool function, in order to upload your resume photos, we will obtain your camera permissions and storage permissions after obtaining your consent.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use your resume tool function, in order to upload your resume photos, we will obtain your camera permissions and storage permissions after obtaining your consent."}
{"task": "rw_76.jsonl", "id": 63290, "text": "This information is a sensitive information. Rejecting to provide this information can only cause you to be unable to use some functions of your resume tool normally, but it does not affect other services provided by your QQ browser normally.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "This information is a sensitive information. Rejecting to provide this information can only cause you to be unable to use some functions of your resume tool normally, but it does not affect other services provided by your QQ browser normally."}
{"task": "rw_76.jsonl", "id": 63291, "text": "You use your resume tool to make your resume (including the information you fill in in your resume) and store it in our server because storage is necessary to implement this function.", "label": ["Data Retention", "Important"], "rewrite": "You use your resume tool to make your resume (including the information you fill in in your resume) and store it in our server because storage is necessary to implement this function."}
{"task": "rw_76.jsonl", "id": 63292, "text": "We will store it in an encrypted manner, and you can delete this information at any time.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "We will store it in an encrypted manner, and you can delete this information at any time."}
{"task": "rw_76.jsonl", "id": 63293, "text": "Unless you choose or comply with relevant laws and regulations, we will not provide the above information or use it for other purposes other than this function.", "label": ["Important", "Data Security"], "rewrite": "Unless you choose or comply with relevant laws and regulations, we will not provide the above information or use it for other purposes other than this function."}
{"task": "rw_76.jsonl", "id": 63294, "text": "·, When you use the PDF file conversion function and the document translation function, when you upload the document, we need to obtain your storage authority. Out of service, we will get your document and upload it to the cloud to complete the conversion or translation, but you are completing the completionLater, we will delete the original manuscripts you uploaded in time, and will not be stored or used for other purposes.", "label": ["Data Retention", "Permission Acquisition", "Important"], "rewrite": "When you use the PDF file conversion function and document translation function, we need to obtain your storage authority when you upload the document."}
{"task": "rw_76.jsonl", "id": 63295, "text": "· When you use the scanning function, we will obtain your camera permissions and storage permissions after obtaining your consent.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use the scanning function, we will obtain your camera permissions and storage permissions after obtaining your consent."}
{"task": "rw_76.jsonl", "id": 63296, "text": "This information is a sensitive information. Refusing to provide this permissions can only cause you to be unable to use the scanning function normally, but it does not affect other services provided by your QQ browser normally.", "label": ["Permission Acquisition", "Important", "Risk"], "rewrite": "This information is a sensitive information. Refusing to provide this permissions can only cause you to be unable to use the scanning function normally, but it does not affect other services provided by your QQ browser normally."}
{"task": "rw_76.jsonl", "id": 63297, "text": "We will not collect the information you scanned. The files you scan will be saved in the terminal device. You can choose to backup, delete or transfer it in different devices.", "label": ["Data Retention", "Edit/Control", "First Party Collection Information", "Important"], "rewrite": "We will not collect the information you scanned. The files you scan will be saved in the terminal device. You can choose to backup, delete or transfer it in different devices."}
{"task": "rw_76.jsonl", "id": 63298, "text": "· When you use taking a photo search or voice search function, we will obtain your camera permissions, microphone rights, and storage permissions after obtaining your consent.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use a photo search or voice search function, we will obtain your camera permissions, microphones, and storage permissions after obtaining your consent."}
{"task": "rw_76.jsonl", "id": 63299, "text": "This information is a sensitive information. Refusing to provide this permissions will only cause you to search for photos and voice content in real time, but it does not affect the other services you provide normally.", "label": ["Permission Acquisition", "Important"], "rewrite": "This information is a sensitive information. Refusing to provide this permissions will only cause you to search for photos and voice content in real time, but it does not affect the other services you provide normally."}
{"task": "rw_76.jsonl", "id": 63300, "text": "· When you use the function of taking pictures, knowledge, and code scanning, we will obtain your camera permissions and storage permissions after obtaining your consent.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use the function of taking pictures, knowledge, and code scanning, we will obtain your camera permissions and storage permissions after obtaining your consent."}
{"task": "rw_76.jsonl", "id": 63301, "text": "This information is a sensitive information. Rejecting to provide this information can only cause you to use this part of the function normally, but it does not affect other services provided by your QQ browser normally.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "This information is a sensitive information. Rejecting to provide this information can only cause you to use this part of the function normally, but it does not affect other services provided by your QQ browser normally."}
{"task": "rw_76.jsonl", "id": 63302, "text": "In order to provide the above features, we will collect, store your shooting, scanning, and uploading pictures or content.", "label": ["Data Retention", "Important", "First Party Collection Information"], "rewrite": "In order to provide the above features, we will collect, store your shooting, scanning, and uploading pictures or content."}
{"task": "rw_76.jsonl", "id": 63303, "text": "· When you buy our products and/or services, services including opening/renewal tool rights cards, single document format conversion and other services, in order to facilitate the successful completion of transactions, query order information, and provide you with customer service and youTo ensure your transaction security, we need to collect the following or all personal information according to the commodity or service type: transaction product or service information, transaction amount, order time, transaction date, order merchant, order number, order status, payment method, method of payment, methodPayment accounts, payment status, virtual commodity and service consumption records, and the opening time of equity opening.", "label": ["Important", "First Party Collection Information"], "rewrite": "Virtual commodities and service consumption records, time of opening of equity, etc."}
{"task": "rw_76.jsonl", "id": 63304, "text": "· When you use the social interaction function we provide, we will collect the videos, photos, reviews, and like information you uploaded.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the social interaction function we provide, we will collect the videos, photos, reviews, and like information you uploaded."}
{"task": "rw_76.jsonl", "id": 63305, "text": "We will store it in an encrypted manner, and you can delete this information at any time.", "label": ["Data Retention", "Edit/Control", "Data Security", "Important"], "rewrite": "We will store it in an encrypted manner, and you can delete this information at any time."}
{"task": "rw_76.jsonl", "id": 63306, "text": "In addition, if you want to interact with other users, participate in live broadcasts, publish videos and pictures, and publish voice comments in the comments, after you authorize, we will access your microphone and camera permissions to provide you with voice comment., Live interactive functions.", "label": ["Permission Acquisition", "Important"], "rewrite": "After you have authorized consent, we will access your microphone and camera permissions to provide you with functions such as voice reviews, live broadcast interaction."}
{"task": "rw_76.jsonl", "id": 63307, "text": "·, The site information, video content, reading records of your active collection, people and topics that take the initiative to follow, and actively praise and comment, we will be in \"Bookmark Collection\", \"My Follow\", \"My My Following\", \"My FollowerThe praise is displayed and stored the above information in the server so that you can synchronize your data when you log in with different devices and versions.", "label": ["Data Retention", "Important", "First Party Collection Information"], "rewrite": "After collecting, we will display and store the above information in \"Bookmark Collection\", \"My Follow\", and \"My Praise\"."}
{"task": "rw_76.jsonl", "id": 63308, "text": "·, We will collect information (including web pages, information, videos, novels, applets, etc.) when you use this device to use this device, so that you can view, edit or delete in the \"historical record\" at any time,You can also add the aforementioned content to the direct page to facilitate your fast access. If you don't want to be recorded, you can open the traceless mode in my-commonly used features.", "label": ["Important", "First Party Collection Information", "Edit/Control"], "rewrite": "We will collect information (including web pages, information, videos, novels, applets, etc.) when you use this device to browse the site/content, so that you can check, edit or delete in the \"historical record\" at any time."}
{"task": "rw_76.jsonl", "id": 63309, "text": "We will show you the \"frequently used\" web pages, novels, videos, applets and files based on your log information on the device.In the collection and use behavior, we will stop updating the content in \"frequent use\".", "label": ["Important", "Edit/Control"], "rewrite": "We will show you the \"frequently used\" web pages, novels, videos, applets and files based on your log information on the device.In the collection and use behavior, we will stop updating the content in \"frequent use\"."}
{"task": "rw_76.jsonl", "id": 63310, "text": "But you understand and agree that your above -mentioned modification does not affect the site information displayed on the direct page display based on the local saved browsing information. If you do not want to display the relevant information, you can delete the direct page site or the direct page or the direct page.The function of \"frequently use\".", "label": ["Edit/Control", "Important"], "rewrite": "Your above -mentioned modification does not affect the site information displayed on the direct page display based on local browsing information before. If you do not want to display the relevant information, you can delete the direct page or \"frequently use\" function of the \"often use\" function of the icon.Essence"}
{"task": "rw_76.jsonl", "id": 63311, "text": "· When you use the search service, your search record will be saved in the device, which is convenient for you to view search records or search again. You can click on the search box and delete it yourself in the \"search record\" below the Sogou bar;", "label": ["Edit/Control", "Important"], "rewrite": "When you use the search service, your search record will be saved in the device, which is convenient for you to view search records or search again. You can click on the search box in the \"search record\" under the Sogou bar."}
{"task": "rw_76.jsonl", "id": 63312, "text": "When you enter the search word in the search box, the input method we will collect in order to show you more suitable keywords based on the difference between the system input method and other input methods.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you enter the search word in the search box, the input method we will collect in order to show you more suitable keywords based on the difference between the system input method and other input methods."}
{"task": "rw_76.jsonl", "id": 63313, "text": "· When you use the search service to search for music, we access the QQ music player to support you to play the current song directly on the search results page. When using this service, you need to log in to the QQ music account. Each account login is valid for 30 days.Essence", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63314, "text": "In order to ensure the normal provision of QQ music member services on the QQ browser app, each time the player is started, the QQ concert will synchronize your login status and the member status to the QQ browser.Feedback information, but it will not store this information;", "label": ["Data Retention", "Important"], "rewrite": "Each time the player is started, the QQ concert will synchronize the login status and the member status to the QQ browser. The QQ browser will receive the feedback information but will not store it."}
{"task": "rw_76.jsonl", "id": 63315, "text": "At the same time, please pay attention to checking \"QQ Music Open, API, SDK Personal Information Protection Rules\", special description: QQ browser will not call the related interface of QQ music to open the personalized song recommendation function provided by QQ music.", "label": ["Important", "Usage"], "rewrite": "QQ browser does not call the related interface of QQ music to open the personalized song recommendation function provided by QQ music."}
{"task": "rw_76.jsonl", "id": 63316, "text": "· The cloud game of QQ Browser Game Center does not need to be downloaded. After clicking, the user can jump to the game page to try it directly. The game service is provided by Tencent Application Bao and Tencent Pioneer Games. Each game needs you to read separately and agree to the game.Legal documents such as user agreements and privacy policies.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63317, "text": "Some of the trial games are implemented by the cloud game SDK of the integrated application treasure. Please pay attention to checking the \"Personal Information Protection Rules\" of the cloud game SDK.", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63318, "text": "Special description: Personal information during the game trial process is collected and used by the game operator, and the QQ browser does not collect, process and store personal information in your game.", "label": ["Important", "First Party Collection Information"], "rewrite": "The personal information during the game trial is collected and used by the game operator. The QQ browser does not collect, process and store personal information in your game."}
{"task": "rw_76.jsonl", "id": 63319, "text": "· In order to facilitate the time you can receive welfare, we will obtain your calendar permissions after obtaining your consent and send a reminder to you.", "label": ["Permission Acquisition", "Important"], "rewrite": "In order to facilitate you can receive benefits in time, after obtaining your consent, we will obtain your calendar authority and send you a reminder to you."}
{"task": "rw_76.jsonl", "id": 63320, "text": "The above information is a sensitive information. Refusing to provide this permissions can only cause you to be unable to use our functions, but it does not affect other services provided by your QQ browser normally.", "label": ["Permission Acquisition", "Important"], "rewrite": "Refusing to provide this permissions can only cause you to be unable to use our functions, but does not affect other services provided by your normally using QQ browser."}
{"task": "rw_76.jsonl", "id": 63321, "text": "· When you use the collection content encryption and file private space encryption function, you need to set a private space password. We will collect your password to access the identity verification when you access the content of the encrypted content to ensure your private space security.", "label": ["Important", "Data Security"], "rewrite": "When you use the collection content encryption and the private space encryption function of the file, you need to set the private space password. We will collect your password to access the authentication of the encrypted content to ensure your private space security."}
{"task": "rw_76.jsonl", "id": 63322, "text": "· When you use the novel service, we will collect the topic of novels, novel posts, and your paid books, novel equity card transaction records, so that you can view it at any time.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the novel service, we will collect the topic of novels, novel posts, and your paid books, novel rights card transaction records, so that you can check it at any time."}
{"task": "rw_76.jsonl", "id": 63323, "text": "·, When we judge that you may have a copy and paste intention (for example, you in the search box, website bar, articles review and other content input box/editing box scenes, and you will open or switch back to the QQ browser app every time you open or switch back to the QQ browser APP, etc.), We will access your shear board to read whether you need to copy text, pictures, links, etc., so as to complete the copying operation and ensure the implementation of functions such as sharing and quickly opening links.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "We will access your shear plate and read the text, pictures, links and other content you need to copy, so as to complete the copy and paste operation."}
{"task": "rw_76.jsonl", "id": 63324, "text": "When you open the search box/URL input box, we will access your shear board and extract the \"URL link\". If the extraction is successful, you will display your latest copy of the URL under the input box, so that you can click the access directly.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "When you open the search box/URL input box, we will access your shear board and extract the \"URL link\"."}
{"task": "rw_76.jsonl", "id": 63325, "text": "At the same time, in order to meet the needs of users with complex webpage editing, we also provide you with multiple shear plates. When you perform a copy operation in the process of using the QQ browser, we will keep your latest copy contentAt most 9, you can click \"Cut the Plate\" to enter the manual removal). When you paste the input box in the webpage, we will access your shear board and read your latest copy content.Click the \"Cutting Plate\" button in the page to select the 9 contents you recently copied.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "When you paste the input box in the webpage, we will access your shear plate to read your latest copy content."}
{"task": "rw_76.jsonl", "id": 63326, "text": "Please know that all of our access to the content of the shear plates is only processed locally and will not be uploaded to our server.", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63327, "text": "· When you use the browser, if the advertisement needs to open the corresponding application in the phone, or you want to open a specific file/content through other applications, we need to get your installed application list;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63328, "text": "When you set the QQ browser as the default browser, we need to get your installed application list to determine whether the QQ browser is the default browser;", "label": ["Important", "First Party Collection Information"], "rewrite": "When you set the QQ browser to the default browser, we need to get your installed application list to determine whether the QQ browser is the default browser."}
{"task": "rw_76.jsonl", "id": 63329, "text": "When the QQ browser was launched for the first time, in order to adapt to different models to ensure that the browser icon angle label (such as message reminder, update prompts, etc.) displayed normal, you need to get your application list (but only Launcher (desktop startup machine will only be obtained) Related application information will not obtain the entire application list) to complete the creation of desktop icons on some models, setting and eliminating the red dot and numbers of the desktop icon angle.", "label": ["Important", "First Party Collection Information"], "rewrite": "When the QQ browser was launched for the first time, in order to adapt to different models to ensure that the browser icon angle label (such as message reminder, update prompts, etc.) display is normal, you need to get your application list."}
{"task": "rw_76.jsonl", "id": 63330, "text": "· In order to optimize your network access speed when using QQ browser, we will get your connected Wi-Fi and nearby Wi-Fi information, and process it technically. When your Wi-Fi changes, quickly switch toThe server IP that is connected to the nearest access is improved to increase the speed of network access.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will get the Wi-Fi and nearby Wi-Fi information you connect and process it."}
{"task": "rw_76.jsonl", "id": 63331, "text": "·, When you use the QQ browser to cooperate with the operator's free traffic function, in order to accurately identify the identity of the traffic -free user and better record the traffic consumption of the directed application consumption, we need to collect your device information, IP address, SIM card card number number(ICCID), operator information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We need to collect your device information, IP address, SIM card card number (ICCID), operator information."}
{"task": "rw_76.jsonl", "id": 63332, "text": "It should be prompted that when you receive a free traffic phone card or open the traffic -free service, you may need to provide real -name authentication, and you need to provide the name, ID number, contact phone number, receiving address, detailed address (display with the actual operating party page displayAt this time, the QQ browser will not collect your information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you receive a traffic -free telephone card or open a traffic -free service, you may need to provide real -name authentication, and you need to provide name, ID number, contact phone number, receiving address, and detailed address."}
{"task": "rw_76.jsonl", "id": 63333, "text": "It is prompted to carefully identify the provider of actual services and carefully check the relevant privacy policies or personal information processing rules before using any third -party service.", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63334, "text": "· When the browser needs to accelerate the video cache, or if you need to use the screen function, we need to apply for your local network permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "When the browser needs to accelerate the video cache, or if you need to use the screen function, we need to apply for your local network authority."}
{"task": "rw_76.jsonl", "id": 63335, "text": "· When you use innovative advertising interactive functions (such as shaking, twisting, and reversing the device), we will call the device's gyroscope, acceleration, and gravity sensor to identify and judge your device status;", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use innovative advertising interactive functions (such as shaking, twisting, and reversing equipment), we will call the device's gyroscope, acceleration, and gravity sensor to identify and judge your device status."}
{"task": "rw_76.jsonl", "id": 63336, "text": "When you use the device's camera for shooting or scanning, in order to measure the movement of the camera, we will also call the device's gyroscope, acceleration, gravity, and direction sensor to control the camera focus.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use the device's camera for shooting or scanning, in order to measure the movement of the camera, we will also call the device's gyroscope, acceleration, gravity, and direction sensor to control the camera focus."}
{"task": "rw_76.jsonl", "id": 63337, "text": "In order to ensure the light situation, we will call the light sensor so that when the light is darker, reminds you to turn on the camera light.", "label": ["Permission Acquisition", "Important"], "rewrite": "In order to ensure the light situation, we will call the light sensor so that when the light is darker, reminds you to turn on the camera light."}
{"task": "rw_76.jsonl", "id": 63338, "text": "In order to provide an object frame display function, we will also call the linear accelerator of the device;", "label": ["Permission Acquisition", "Important"], "rewrite": "In order to provide an object frame display function, we also call the device's linear accelerator."}
{"task": "rw_76.jsonl", "id": 63339, "text": "When you use the VR function of the webpage, we will also call the device's gyroscope, acceleration, and gravity sensor, in order to enable you to view VR video or web pages by rotating your phone;", "label": ["Permission Acquisition", "Important"], "rewrite": "We also call the device's gyroscope, acceleration, and gravity sensor, in order to enable you to view VR videos or web pages by rotating your phone."}
{"task": "rw_76.jsonl", "id": 63340, "text": "When your positioning service and indoor positioning scenarios in your application and applet, after user authorization, assist in obtaining location information. In the process, we will call your acceleration sensor, magnetic field sensor, direction sensor, pressure sensor, gravity sensor, rotationVector sensor.", "label": ["Permission Acquisition", "Important"], "rewrite": "In the process, we will call your acceleration sensor, magnetic field sensor, direction sensor, pressure sensor, gravity sensor, and rotating vector sensor."}
{"task": "rw_76.jsonl", "id": 63341, "text": "Please understand that separate device sensor data does not involve any personal location information and cannot be combined with other information to identify the identity of a specific natural person.", "label": ["Important", "Data Security"], "rewrite": "The separate device sensor data does not involve any personal location information and cannot be combined with other information to identify the identity of a specific natural person."}
{"task": "rw_76.jsonl", "id": 63342, "text": "· When you contact our customer service, for your account and system security, we will collect your WeChat, QQ number, and account information, and match your previous personal information to verify your user identity.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect your WeChat, QQ number, and account information and match your previous personal information to verify your user identity."}
{"task": "rw_76.jsonl", "id": 63343, "text": "At the same time, in order to investigate the facts and help you solve the problem, we may also need to collect your personal information: contact information (you use or actively provide us with mobile phone numbers, WeChat, QQ numbers or other contact information), you and you and you and youOur communication record.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may also need to collect your following personal information: contact information (you use or take the initiative to actively provide us with mobile phone numbers, WeChat, QQ numbers or other contact information), and your communication records with us."}
{"task": "rw_76.jsonl", "id": 63344, "text": "Visit the page and apply for your storage authority.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect your device information (Guid, MAC address), account information, network conditions, application versions, access page, and apply for your storage permissions."}
{"task": "rw_76.jsonl", "id": 63345, "text": "If you need to upload photos, we need to obtain your camera permissions or album permissions/storage permissions to meet the needs of you to upload or upload pictures through albums.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you need to upload photos, we need to obtain your camera permissions or album permissions/storage permissions."}
{"task": "rw_76.jsonl", "id": 63346, "text": "·, When you conduct infringement complaints on the contents of the client through the QQ browser, you will jump to Tencent Wenwen Rhino and Infringement Complaint Platform (hereinafter referred to as \"Tencent Wen Rhino\") to verify the information and handle the infringement complaints in accordance with the law.You may need to provide relevant certification materials, etc. When uploading the materials, you need to obtain the camera permissions, album permissions/storage permissions of your equipment to meet your needs for uploading or uploading pictures through the album.", "label": ["Permission Acquisition", "Important"], "rewrite": "When uploading the material, you need to obtain the camera permissions, album permissions/storage permissions of your device to meet your needs for taking pictures or uploading pictures through albums."}
{"task": "rw_76.jsonl", "id": 63347, "text": "You need to agree with the personal information protection rules of Tencent Wen Rhino before submitting the infringing complaint materials. Please read these rules carefully. You can click on the \"Guidelines for Privacy Property Protection Plane of Tencent Wen Rhino and Infringement Complaint Platform.\"", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63348, "text": "· When you ask for downloading your personal information, we will collect the email address you filled in to send the corresponding information generated file to your designated mailbox.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you ask for downloading your personal information, we will collect the email address you filled in to send the corresponding information generated file to your designated mailbox."}
{"task": "rw_76.jsonl", "id": 63349, "text": "· When the mini -program service you use involves connecting Bluetooth device, we will collect the Bluetooth address of your phone for device connection.", "label": ["Important", "First Party Collection Information"], "rewrite": "When the mini -program service you use involves connecting Bluetooth device, we will collect the Bluetooth address of your phone for device connection."}
{"task": "rw_76.jsonl", "id": 63350, "text": "· Position permissions, microphone permission, etc. may be used for some third -party applications (including H5 pages, etc.) services, providing geographical location -based services or services that need voice input.When you apply through the QQ browser application, please determine whether to agree with the authority of the third party according to the actual page scene.", "label": ["Permission Acquisition", "Important"], "rewrite": "Apply for position permissions and microphones."}
{"task": "rw_76.jsonl", "id": 63351, "text": "· You can check the access of your personal information through \"I set a privacy settings\" item by item, and you can decide to open or close these permissions (we will guide you to complete the settings in your device system).", "label": ["Important", "Edit/Control"], "rewrite": "You can check the access of your personal information through \"My One Settings and One Privacy Settings\" item, and you can decide to open or close these permissions (we will guide you to complete the settings in your device system)."}
{"task": "rw_76.jsonl", "id": 63352, "text": "Opening these permissions means that you authorize us to collect and use these personal information to achieve the above functions. Closing these permissions means that you have canceled these authorization, then we will no longer continue to collect and use your personal information, and we cannot do it for it.You provide the above functions corresponding to these authorization.", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63353, "text": "The decision to close permissions will not affect the processing of personal information based on your authorization.", "label": ["Permission Acquisition", "Edit/Control", "Risk", "Important"], "rewrite": "The decision to close permissions will not affect the processing of personal information based on your authorization."}
{"task": "rw_76.jsonl", "id": 63354, "text": "In addition, according to relevant laws and regulations and national standards, in the following situations, we may collect or use your relevant personal information without soliciting your authorization consent:", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "In the following situations, we may collect and use your relevant personal information without asking your authorization consent:"}
{"task": "rw_76.jsonl", "id": 63355, "text": "· Directly related to national interests such as national security and national defense security;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting personal information directly related to national interests such as national security and national defense security does not need to solicit consent."}
{"task": "rw_76.jsonl", "id": 63356, "text": "Directly related to the major public interests such as public safety, public health, and public knowledge;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect personal information directly related to public safety, public health, and public interest, without asking for consent."}
{"task": "rw_76.jsonl", "id": 63357, "text": "· Directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect direct personal information related to criminal investigation, prosecution, trial, and execution of judgments without asking for consent."}
{"task": "rw_76.jsonl", "id": 63358, "text": "· Out of maintaining major legitimate rights and interests such as life, property, and reputation of you or other individuals, it is difficult to get my consent;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting and maintaining major legitimate rights and interests but difficult to get personal information that I agree, without asking for consent."}
{"task": "rw_76.jsonl", "id": 63359, "text": "· The personal information you collected is made by your own public;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "The collected personal information is made to the public by itself without asking for consent."}
{"task": "rw_76.jsonl", "id": 63360, "text": "·, Collect personal information from the legal publicly disclosed information, such as legal news reports and government information disclosure;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If you collect personal information from the legal disclosure information, you do not need to ask for consent."}
{"task": "rw_76.jsonl", "id": 63361, "text": "·, Required to sign and perform the contract according to your requirements;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting the personal information necessary for the signing and performing the contract without soliciting consent."}
{"task": "rw_76.jsonl", "id": 63362, "text": "·, The safe and stable operation of the products or services provided by maintenance, such as discovering and disposing of products or services;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting personal information necessary for the safe and stable operation of products or services, there is no need to solicit consent."}
{"task": "rw_76.jsonl", "id": 63363, "text": "· It is necessary to carry out legal news reports;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting the necessary personal information for legal news reports does not need to ask for consent."}
{"task": "rw_76.jsonl", "id": 63364, "text": "· Due to the need to carry out statistics or academic research in public interests, and the results of academic research or descriptions are provided, the personal information contained in the results is identified;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "When it is necessary to carry out statistics or academic research in public interests and the results of academic research or description, it is identified to identify the personal information contained in the results without soliciting consent."}
{"task": "rw_76.jsonl", "id": 63365, "text": "Other circumstances stipulated in laws and regulations.", "label": ["First Party Collection Information", "Risk"], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63366, "text": "Please understand that the functions and services we provide to you are constantly updated and developed. If a function or service is not in the aforementioned and collected your information, we will use page prompts, interactive processes, website announcements, etc.Explain the content, scope and purpose of information collection to you to obtain your consent.", "label": ["Important", "First Party Collection Information"], "rewrite": "If a function or service is not collected in the aforementioned instructions and your information is collected, we will explain the content, scope and purpose of the information collection through page prompts, interaction processes, website announcements, etc. to obtain your consentEssence"}
{"task": "rw_76.jsonl", "id": 63367, "text": "Please note that we will not take the initiative to get your personal information from a third party outside Shenzhen Tencent Computer System Co., Ltd..", "label": ["Important", "First Party Collection Information"], "rewrite": "At present, we will not take the initiative to obtain your personal information from a third party outside Shenzhen Tencent Computer System Co., Ltd.."}
{"task": "rw_76.jsonl", "id": 63368, "text": "If the business development needs to indirectly obtain your personal information from a third party, we will tell you the source, type, and scope of use of personal information before acquisition.The scope of authorization consent when providing personal information, and we will obtain your authorization consent before dealing with such personal information;", "label": ["Important", "First Party Collection Information"], "rewrite": "If the business development needs to indirectly obtain your personal information from a third party, we will tell you the source, type, and scope of use of personal information before acquisition.We will obtain your authorization consent before processing your personal information."}
{"task": "rw_76.jsonl", "id": 63369, "text": "In addition, we will also strictly abide by the provisions of relevant laws and regulations, and require a third party to ensure the legality of the information provided.", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63370, "text": "2. Storage of information", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63371, "text": "2.1 Method and period of information storage", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63372, "text": "· We will store your information in a secure way, including local storage (such as using APP for data cache), database and server logs.", "label": ["Important", "Data Security"], "rewrite": "We will store your information in a safe way, including local storage (such as using APP for data cache), database and server logs."}
{"task": "rw_76.jsonl", "id": 63373, "text": "· Under normal circumstances, we only store your personal information within the time necessary for the service purpose or under the conditions stipulated by laws and regulations.", "label": ["Data Retention", "Important"], "rewrite": "We will only store your personal information within the time necessary for the purpose of service to achieve service purposes or under the conditions of laws and regulations."}
{"task": "rw_76.jsonl", "id": 63374, "text": "· When you use the private message chat function we provide, we will upload your unique logo on the QQ browser to Tencent Cloud to apply for instant messaging IM services for you;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63375, "text": "During the product use process, the chat information you generate is stored in the server provided by Tencent Cloud;", "label": ["Data Retention", "Important"], "rewrite": "During the product use process, the chat information you generate is stored in the server provided by Tencent Cloud."}
{"task": "rw_76.jsonl", "id": 63376, "text": "Without your authorization, any third party will not obtain the above information.", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63377, "text": "When you delete this information in the QQ browser, the type of information stored in Tencent Cloud will be deleted immediately.", "label": ["Data Retention", "Important"], "rewrite": "When you delete this information in the QQ browser, the type of information stored in Tencent Cloud will be deleted immediately."}
{"task": "rw_76.jsonl", "id": 63378, "text": "2.2 The area where information storage", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63379, "text": "· We will store personal information collected in the country in China in accordance with laws and regulations.", "label": ["Data Retention", "Important"], "rewrite": "We will store personal information collected in China in China in accordance with laws and regulations."}
{"task": "rw_76.jsonl", "id": 63380, "text": "· At present, we will not transmit or store your personal information cross -border.", "label": ["Data Retention", "Important"], "rewrite": "At present, we will not transmit or store your personal information cross -border."}
{"task": "rw_76.jsonl", "id": 63381, "text": "If you need to transmit or store cross -border in the future, we will inform you that the purpose of the information outbound, receiving party, security guarantee measures and security risks, and obtain your consent.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "If you need to transmit or store cross -border in the future, we will inform you that the purpose of the information outbound, receiving party, security guarantee measures and security risks, and obtain your consent."}
{"task": "rw_76.jsonl", "id": 63382, "text": "2.3 Notice of the product or service stopping operation", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63383, "text": "· When our products or services stop operation, we will notify you in the form of pushing notifications, announcements, etc., and delete your personal information or processes anonymity within the reasonable period.Essence", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "When our products or services stop operation, we will notify you in the form of push notifications, announcements, etc., and delete your personal information or perform anonymous processing within a reasonable period."}
{"task": "rw_76.jsonl", "id": 63384, "text": "3. Information security", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63385, "text": "3.1 Safety protection measures", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63386, "text": "· We strive to provide guarantees for user information security to prevent information from leakage, loss, improper use, unauthorized access and disclosure.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63387, "text": "We use multi -directional security protection measures to ensure that user personal information protection is at a reasonable level of security, including technological protection methods, management system control, and security system guarantee.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63388, "text": "In addition, we have passed the evaluation and filing of the national communication network security protection level (level 3).", "label": ["Important", "Data Security"], "rewrite": "We have also passed the evaluation and filing of the national communication network security protection level (level three)."}
{"task": "rw_76.jsonl", "id": 63389, "text": "· We adopt the industry's leading technical protection measures.", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63390, "text": "The technical means we use include but not limited to firewalls, encryption (such as SSL), de -identification or anonymous treatment, access control measures, etc.", "label": ["Important", "Data Security"], "rewrite": "The technical means we use include but not limited to firewalls, encryption (such as SSL), de -identification or anonymous treatment, access control measures, etc."}
{"task": "rw_76.jsonl", "id": 63391, "text": "In addition, we will continue to strengthen the security capabilities of software installed on your device.", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63392, "text": "For example, we will complete some information encryption work locally to consolidate security transmission;", "label": ["Important", "Data Security"], "rewrite": "We will complete some information encryption work locally to consolidate security transmission."}
{"task": "rw_76.jsonl", "id": 63393, "text": "We will understand the application information and running process information installed by your device to prevent malicious programs such as viruses and Trojans.", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63394, "text": "· We have established management systems, processes and organizations that ensure personal information security.", "label": ["Important", "Data Security"], "rewrite": "We have established a special management system, process and organization that guarantees personal information security."}
{"task": "rw_76.jsonl", "id": 63395, "text": "For example, we strictly restrict the scope of the personnel of the access information, require them to abide by the confidentiality obligations and audit, and those who violate the obligations will be punished in accordance with regulations.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63396, "text": "We will also review the management system, process and organization to prevent unauthorized personnel from accessing, using or disclosing users' information.", "label": ["Important", "Data Security"], "rewrite": "We will also review the management system, process and organization to prevent unauthorized personnel from accessing, using or disclosing users' information."}
{"task": "rw_76.jsonl", "id": 63397, "text": "· We recommend that you pay full attention to the protection of personal information when using products and services, and we will also provide multiple security functions to help you protect your personal information security.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63398, "text": "3.2 Safety event disposal measures", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63399, "text": "· If personal information leakage, damage, loss and other security incidents occur, we will start emergency plans to prevent the expansion of security events.", "label": ["Important", "Data Security"], "rewrite": "If personal information leakage, damage, loss and other security incidents occur, we will start emergency plans to prevent the expansion of security events."}
{"task": "rw_76.jsonl", "id": 63400, "text": "After the safety event occurs, we will timely inform you the basic situation of the security incident in the form of push notifications and emails, the disposal measures and remedial measures we are about to adopt or we have taken, and our proposal to your response.", "label": ["Important", "Data Security"], "rewrite": "After the safety event occurs, we will timely inform you the basic situation of the security incident in the form of push notifications and emails, the disposal measures and remedial measures we are about to adopt or we have taken, and our proposal to your response."}
{"task": "rw_76.jsonl", "id": 63401, "text": "If it is difficult to achieve one by one, we will issue warnings through announcement and other methods.", "label": ["Important", "Data Security"], "rewrite": "If it is difficult to achieve one by one, we will issue warnings through announcement and other methods."}
{"task": "rw_76.jsonl", "id": 63402, "text": "4. How do we use information", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63403, "text": "We strictly abide by the provisions of laws and regulations and the agreement with users, and in accordance with the information used in accordance with the guidelines of this privacy protection, to provide you with better services.", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63404, "text": "4.1 Information use rules", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63405, "text": "We will use the collected information according to the following rules:", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63406, "text": "· We will provide you with various functions and services based on the information we collect, including but not limited to information browsing services, video playback services, search services, reading services, recommendation browsing functions, welfare sign -in, file finishing functions;", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63407, "text": "·, We will provide you with the characteristics of your browsing preferences, habits, location information, etc., including the indirect crowd portrait based on feature labels and recommend the content and activities you may be interested in, optimize the experience of the service;", "label": ["Important", "Usage"], "rewrite": "We will provide you with the characteristics of your browsing preferences, habits, and location information."}
{"task": "rw_76.jsonl", "id": 63408, "text": "· In order to put on advertising, evaluate, optimize the effect of advertising, we need to share some of your data from third -party partners such as advertisers and agents, and require them to strictly abide by our measures and requirements on data privacy protection.Including but not limited to processing according to data protection agreements, commitment letters and related data processing policies to avoid identifying personal identity and ensuring privacy and security.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We need to share some of your data from advertisers and agents such as third -party partners, asking them to strictly abide by our measures and requirements on data privacy protection."}
{"task": "rw_76.jsonl", "id": 63409, "text": "· We will analyze the operation of our products based on the frequency and situation, fault information, performance information of your QQ browser, to ensure the safety of services, and optimize our products, and improve our service quality.", "label": ["Important", "Usage"], "rewrite": "We will analyze the operation of our products based on the frequency and situation of the QQ browser, fault information, and performance information based on your QQ browser."}
{"task": "rw_76.jsonl", "id": 63410, "text": "We will not combine the information we store in the analysis software with the personal identity information you provide.", "label": ["Important", "Data Security", "Usage"], "rewrite": "We will not combine the information we store in the analysis software with the personal identity information you provide."}
{"task": "rw_76.jsonl", "id": 63411, "text": "4.2 The way to obtain consent after notifying the purpose of the change", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63412, "text": "We will use the collected information in the purpose covered by the guidance of privacy protection.", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63413, "text": "If we use your personal information, which exceeds the purpose and scope of direct or reasonable correlation with the purpose of the time of collection, we will tell you and obtain your explicit consent again before using your personal information.", "label": ["Important", "Usage"], "rewrite": "If we use your personal information, which exceeds the purpose and scope of direct or reasonable correlation with the purpose of the time of collection, we will tell you and obtain your explicit consent again before using your personal information."}
{"task": "rw_76.jsonl", "id": 63414, "text": "5. Provide outside", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63415, "text": "At present, except for the third -party SDK that has been listed and the list of \"Sharing Personal Information List with the Third Party\", we will not actively share or transfer your personal information until the third party.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Except for the third -party SDK that has been listed and the \"Personal Information List with Third Party\", we will not actively share or transfer your personal information to third parties."}
{"task": "rw_76.jsonl", "id": 63416, "text": "We will carefully choose third -party and third -party services, urge relevant third parties to collect and use your personal information in accordance with this guideline or the agreement reached with you, and adopt appropriate security technology and management measures to ensure your personal information security.", "label": ["Third Party Sharing/ Disclosure", "Data Security"], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63417, "text": "If there are other sharing or transfer your personal information or you need us to share or transfer your personal information to a third -party situation, we will directly or confirm that the third party obtains your consent of your above behavior.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If there are other sharing or transfer your personal information or you need us to share or transfer your personal information to a third -party situation, we will directly or confirm that the third party obtains your consent of your above behavior."}
{"task": "rw_76.jsonl", "id": 63418, "text": "We will not share with partners to identify information that can be used to identify your personal identity (such as your name or email address), unless you clearly authorize.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not share with partners to identify information that can be used to identify your personal identity (such as your name or email address), unless you clearly authorize."}
{"task": "rw_76.jsonl", "id": 63419, "text": "We will not publicly disclose the personal information collected to the outside world. If we must disclose it publicly, we will tell you the purpose of the public disclosure, the type of disclosure information, and the possible sensitive information that may be involved, and obtain your explicit consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not publicly disclose the personal information collected to the outside world. If we must disclose it publicly, we will tell you the purpose of the public disclosure, the type of disclosure information, and the possible sensitive information that may be involved, and obtain your explicit consent."}
{"task": "rw_76.jsonl", "id": 63420, "text": "With the sustainable development of our business, we may conduct merging, acquisition, asset transfer and other transactions. We will inform you that the relevant situation will continue to protect or request new control in accordance with laws and regulations and not lower than the standards required by the privacy protection guidelines.Continue to protect your personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may conduct transactions such as mergers, acquisitions, and asset transfer. We will inform you that the relevant situation will continue to protect your personal information in accordance with the laws and regulations and the standards required by the guidelines of privacy protection."}
{"task": "rw_76.jsonl", "id": 63421, "text": "In addition, in accordance with relevant laws and regulations and national standards, in the following situations, we may share, transfer, and openly disclose personal information without obtaining your authorization consent in advance:", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "In the following circumstances, we may share, transfer, and publicly disclose personal information without obtaining your authorization consent in advance:"}
{"task": "rw_76.jsonl", "id": 63422, "text": "· Directly related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Personal information directly related to national security and national defense security does not need to solicit consent."}
{"task": "rw_76.jsonl", "id": 63423, "text": "· Directly related to public safety, public health, and major public interests;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Personal information directly related to public safety, public health, and direct public interests does not need to solicit consent."}
{"task": "rw_76.jsonl", "id": 63424, "text": "· Directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Direct related personal information such as sharing with criminal investigation, prosecution, trial and judgment execution does not need to solicit consent."}
{"task": "rw_76.jsonl", "id": 63425, "text": "· Due to the major legitimate rights and interests of the life and property of the subject of personal information or other individuals, it is difficult to get my consent;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Share major legitimate rights and interests such as life and property, but it is difficult to obtain personal information that I agree, without asking for consent."}
{"task": "rw_76.jsonl", "id": 63426, "text": "·, The subject of personal information disclose personal information to the public by itself;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "The personal information of sharing personal information disclosure to the public has no need to solicit consent."}
{"task": "rw_76.jsonl", "id": 63427, "text": "· Collect personal information from legal public information, such as legal news reports and government information disclosure.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "If you collect personal information from the legal disclosure information, you do not need to ask for consent."}
{"task": "rw_76.jsonl", "id": 63428, "text": "6. Automated decision", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63429, "text": "6.1 Personalized recommendation mechanism", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63430, "text": "Through the guidelines and rules of privacy protection, we notify you to use the user and automated decision -making mechanism collected by personalized recommendations.", "label": ["Usage"], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63431, "text": "Automated decision -making refers to activities that automatically analyze, evaluate personal behavior, hobbies, and make decisions through computer programs.", "label": ["Usage"], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63432, "text": "·, We will collect your clicks, attention, collection, search, search, sharing, comments, likes (likes) release, feedback, etc. in your client, browsing duration, location information, and equipment information to achieve the aboveAnalysis and calculation of personalized recommendation, and according to the results of the calculation results, you can push the content that you may be more interested in or sort the search results.", "label": ["Important", "Usage"], "rewrite": "We will collect your clicks, attention, collection, search, search, browsing, sharing, comments, likes (like) publishing, feedback, etc. in your client's clicks, browsing duration, location information, and equipment information."}
{"task": "rw_76.jsonl", "id": 63433, "text": "We will give real -time feedback on the recommendation model based on the browsing behavior during your product, and constantly adjust the optimization results.", "label": ["Usage"], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63434, "text": "Screen direction, etc.), application and data (such as application package name, operation log, etc.), connected Wi-Fi, general geographical location and other information, providing you with advertisements that you may be interested in, evaluate, improve usThe effects of advertising and other promotions and promotion activities and business analysis.", "label": ["Usage"], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63435, "text": "Please rest assured that personalized advertising recommendation algorithms do not identify your true identity. It is based on speculative characteristics to provide more valuable advertising information for you and save your transaction costs.", "label": ["Important", "Usage"], "rewrite": "Personalized advertising recommendation algorithms do not identify your true identity. It is based on speculative characteristics to provide more valuable advertising information for you and save your transaction costs."}
{"task": "rw_76.jsonl", "id": 63436, "text": "If you don't want to accept personalized advertising services, you can turn off management in this product settings.", "label": ["Important", "Edit/Control"], "rewrite": "If you don't want to accept personalized advertising services, you can turn off management in this product settings."}
{"task": "rw_76.jsonl", "id": 63437, "text": "6.2 Personalized recommendation management", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63438, "text": "· You can choose to close or open the service of whether to close or open the recommendation of personalized content in \"My - Settings -Privacy Settings\".", "label": ["Important", "Edit/Control"], "rewrite": "You can choose to close or turn on whether you are recommended to close or open the recommendation of personalized content in \"My — Settings -Privacy Settings\"."}
{"task": "rw_76.jsonl", "id": 63439, "text": "When you choose to close personalized recommendations, you will not be able to receive personalized information services.", "label": ["Edit/Control", "Important"], "rewrite": "When you choose to close personalized recommendations, you will not be able to receive personalized information services."}
{"task": "rw_76.jsonl", "id": 63440, "text": "Personalized recommendations may cause the content you can see to be homogeneous. You can also accurately shield specific content by deleting browsing history to reduce the correlation of the recommendation content and you, or to accurately shield the specific content through the feedback button in the information.", "label": ["Important", "Edit/Control"], "rewrite": "Personalized recommendations may cause the content you can see to be homogeneous. You can also accurately shield specific content by deleting browsing history to reduce the correlation of the recommendation content and you, or to accurately shield the specific content through the feedback button in the information."}
{"task": "rw_76.jsonl", "id": 63441, "text": "·, You can choose to close or open the service recommended by whether to close or open it in \"My — Settings -Privacy Settings\".", "label": ["Important", "Edit/Control"], "rewrite": "You can choose to close or open the service recommended by whether to close or open the recommendation of personalized novels in \"My — Settings -Privacy Settings\"."}
{"task": "rw_76.jsonl", "id": 63442, "text": "When you turn off the switch, we will not recommend novels you may be interested in according to your personal information (including but not limited to your reading records, etc.).", "label": ["Edit/Control", "Usage", "Important"], "rewrite": "When you turn off the switch, we will not recommend novels you may be interested in according to your personal information (including but not limited to your reading records, etc.)."}
{"task": "rw_76.jsonl", "id": 63443, "text": "· You can choose to close or turn on whether you can close or open the service of personalized search results in \"My — Settings -Privacy Settings\".", "label": ["Edit/Control", "Important"], "rewrite": "You can choose to close or open whether to close or open the service of personalized search results in \"My — Settings -Privacy Settings\"."}
{"task": "rw_76.jsonl", "id": 63444, "text": "When you turn off the switch, we will not carry out personal information (including but not limited to search records, etc.) to carry out personalized search results sorting services.", "label": ["Edit/Control", "Usage", "Important"], "rewrite": "When you turn off the switch, we will not conduct personalized search results for personal information."}
{"task": "rw_76.jsonl", "id": 63445, "text": "· You can choose to close or open the service of whether you are close or open to accept personalized advertising recommendations in \"My — Settings -Privacy Settings\".", "label": ["Edit/Control", "Important"], "rewrite": "You can choose to close or open the service for closing or opening whether to accept personalized advertising recommendations in \"My — Settings -Privacy Settings\"."}
{"task": "rw_76.jsonl", "id": 63446, "text": "When you turn off the switch, you will no longer receive such personalized advertisements, but you will still see the advertisement, the number of advertisements will not change, but the correlation of the advertisement will be reduced.", "label": ["Edit/Control", "Usage", "Important"], "rewrite": "When you turn off the switch, you will no longer receive such personalized advertisements, but you will still see the advertisement, the number of advertisements will not change, but the correlation of the advertisement will be reduced."}
{"task": "rw_76.jsonl", "id": 63447, "text": "7. Your rights", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63448, "text": "During your use of QQ browser service, we may provide you with the corresponding operation settings as the specific situation of the product so that you can inquire, copy, delete, correct or withdraw your relevant personal information.Personal information management, permissions settings, personal information management and other pages in the homepage of the homepage \"and\" My — Settings -Privacy Settings \"are operated.", "label": ["Edit/Control", "Important"], "rewrite": "You can query, copy, delete, delete, delete, change, or withdraw your relevant individuals through \"My-Personal Homepage\", \"My Settings-Privacy Settings\"information."}
{"task": "rw_76.jsonl", "id": 63449, "text": "In particular, for your browsing records, you can view, edit or delete in \"My\"-\"History\";", "label": ["Important", "Edit/Control"], "rewrite": "For your browsing records, you can view, edit or delete in \"My\"-\"History\"."}
{"task": "rw_76.jsonl", "id": 63450, "text": "For search records, you can click on the search box and delete in the \"Search History\" below.", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63451, "text": "We will constantly optimize the channels and experiences of your rights. If you have any questions or needs, you can contact us through the method agreed in this agreement.", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63452, "text": "At present, QQ browser can use related QQ numbers or WeChat accounts as a service account for login.", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63453, "text": "If you need to cancel the QQ browser service account, operate through the path of \"setting -account and security -account\".", "label": ["Important", "Edit/Control"], "rewrite": "If you need to cancel the QQ browser service account, operate through the path of \"setting -account and security -account\"."}
{"task": "rw_76.jsonl", "id": 63454, "text": "Please make sure you use the relevant equity before canceling, including but not limited to the red envelope of the welfare center, and ensure that you fully understand and agree to the cancellation results, including you will no longer use this account, and you will not be able to retrieve the current account number.Any information related to account number.", "label": ["Edit/Control", "Risk"], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63455, "text": "In addition, because the historical records of the QQ browser are stored in your terminal, if you need to clean up, you cannot complete the account number. Please delete it yourself in the application. For the specific pathDelete, click the search box to delete in the \"Search History\" below.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63456, "text": "8. Change", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63457, "text": "We may amend the guidelines for privacy protection in a timely manner.", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63458, "text": "When the terms of the guidelines for privacy protection are changed, we will prompt you the change of privacy protection guidelines to you in an appropriate manner in accordance with the requirements of laws and regulations, and explain the effective date of effect.", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63459, "text": "Please read the content of the privacy protection guidelines carefully, and you continue to use the QQ browser to indicate that you agree to deal with your personal information according to the updated privacy protection guidelines.", "label": ["Policy Change", "Important"], "rewrite": "You continue to use the QQ browser to indicate that we agree to handle your personal information according to the updated privacy protection guidelines."}
{"task": "rw_76.jsonl", "id": 63460, "text": "9. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63461, "text": "We attach great importance to the protection of personal information of minors.", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63462, "text": "According to the relevant laws and regulations, if you are a minor under the age of 18, you should obtain the consent of your parents or legal guardians before using the QQ browser product or service.", "label": ["Specific Audiences", "Important"], "rewrite": "Minors under the age of 18 should obtain the consent of your parents or legal guardians before using QQ browser products or services."}
{"task": "rw_76.jsonl", "id": 63463, "text": "According to the provisions of relevant laws and regulations, if you are a child under the age of 14, you should obtain your parents or legal guardians in advance before using the QQ browser product or service to obtain your parents or the legal guardian in accordance with the registration and use process.The legal guardian helps you complete the product or service registration process so that you can use the products or services we provide.", "label": ["Specific Audiences", "Important"], "rewrite": "Children under 14 years of age should obtain the consent of your parents or legal guardians in advance before using the QQ browser product or service to obtain the product or service registration process in accordance with the registration and use process.Essence"}
{"task": "rw_76.jsonl", "id": 63464, "text": "If you are a child's guardian, when you help children complete the registration and use of products or services, you should carefully read the guidance of this privacy protection and the \"Child Privacy Protection Statement\".\"And help children register and use so that children can use the products or services we provide.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63465, "text": "If you have relevant questions or claims for your personal information protection of your child's personal information, please contact us through the contact information disclosed in part 11 of this privacy protection guideline.", "label": ["Specific Audiences", "Important"], "rewrite": "If you have relevant questions or claims for your personal information protection of your child's personal information, please contact us through the contact information disclosed in part 11 of this privacy protection guideline."}
{"task": "rw_76.jsonl", "id": 63466, "text": "We will deal with and reply to you within a reasonable time.", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63467, "text": "10. Others", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63468, "text": "Tencent's \"Privacy Policy\" is a generally applicable general privacy clause, which specifies the user rights and information security guarantee measures for QQ browser.", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63469, "text": "For example, Tencent's \"Privacy Policy\" is inconsistent or contradictory with the guidance of this privacy protection, please refer to the guidelines of this privacy protection.", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63470, "text": "11. Contact us", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63471, "text": "We have set up a special person in personal information protection team and personal information protection person. If you have any questions or complaints or suggestions on the privacy policy or personal information protection related matters, you can contact us in the following ways:", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63472, "text": "1. You can fill in personal information protection and privacy issues to contact us;", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63473, "text": "2. Send the problem to dataprivacy@tencent.com;", "label": ["Important", "Contact Information"], "rewrite": "Send the problem to dataprivacy@tencent.com."}
{"task": "rw_76.jsonl", "id": 63474, "text": "3., through, https://kf.qq.com/, contact us;", "label": ["Important", "Contact Information"], "rewrite": "Contact us through https://kf.qq.com/."}
{"task": "rw_76.jsonl", "id": 63475, "text": "4. Mail your question to the following address:", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63476, "text": "Tencent Binhai Building, No. 33 Haitian Er Road, Nanshan District, Guangdong Province, China, China, China, China Binhai Building data privacy protection department (closed)", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63477, "text": "Postcode: 518054", "label": ["Important", "Contact Information"], "rewrite": "Postal code: 518054."}
{"task": "rw_76.jsonl", "id": 63478, "text": "We will review the issues involved as soon as possible and give feedback within 15 days or the period stipulated in the laws and regulations.", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63479, "text": "Shenzhen Tencent Computer System Co., Ltd.", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63480, "text": "Appendix: Definition", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63481, "text": "Personal information: Refers to various information related to recognized or recognized natural persons recorded in electronics or other methods, excluding information after anonymous processing (from Article 4 of the Personal Information Protection Law of the People's Republic of China).", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63482, "text": "Sensitive personal information: Once leaked or illegally, it is easy to cause personal information of natural person's personality dignity or harm to the safety of personal and property, including biometrics, religious beliefs, specific identities, medical health, financial accounts, trajectory trajectory and other information.And personal information under the age of 14 (from Article 28 of the Personal Information Protection Law of the People's Republic of China).", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63483, "text": "Anonymous: It refers to the process of processing personal information that cannot be recognized by specific natural persons and cannot be restored (from Article 73 of the Personal Information Protection Law of the People's Republic of China).", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63484, "text": "Decoration: It means that the personal information is processed, so that it cannot recognize the process of specific natural persons without using additional information (from Article 73 of the Personal Information Protection Law of the People's Republic of China).", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63485, "text": "Related company: refers to a company that has a direct or indirect control or significant impact relationship with us.", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63486, "text": "Children: Refers to adults under the age of 14.", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63487, "text": "Processing personal information: Refers to the collection, storage, use, processing, transmission, provision, disclosure, deletion of personal information.", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63488, "text": "Automated decision -making: Refers to automatic analysis through computer programs, evaluating personal behavior habits, hobbies or economic, healthy, credit conditions, etc. (from Article 73 of the Personal Information Protection Law of the People's Republic of China).", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63489, "text": "Cookie: Cookie is a small file containing string. When you log in and use your website or other network content, you send and store in your computer, mobile device or other devices (usually encrypted).", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63490, "text": "Similar cookies are other technologies that can be used in similar uses as Cookie, such as: Web Beacon, Proxy, Embedded Scripts, Pixel Tags, etc.", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63491, "text": "SSL: SSL (Secure Socket Layer), also known as convergence, is a security protocol implemented on the transmission communication protocol (TCP/IP).", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63492, "text": "SSL supports various types of networks, and also provides three basic security services. Both use public key and symmetrical key technology to achieve the effect of information confidentiality.", "label": [], "rewrite": []}
{"task": "rw_76.jsonl", "id": 63493, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
