{"task": "rw_70.jsonl", "id": 61392, "text": "overview", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61393, "text": "Privacy Protection Guideline Version Update Tips:", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61394, "text": "Thank you for using Tencent's meeting.", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61395, "text": "We have updated the \"Guidelines for Privacy Conservation of Tencent Conference\", mainly including the following content:", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61396, "text": "1. According to product function updates, operating activities and advertising related expressions are added. For details, please refer to the second part of \"How do we collect and use your information\".", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61397, "text": "2. According to the latest product of the product, the path of your feedback on your opinion is correct. For details, please refer to the sixth \"your right\".", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61398, "text": "3. In contact, we add the way to contact us by filling in personal information protection and privacy issues to facilitate your feedback.", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61399, "text": "4. Adjust and optimize the personal information collection list. For details, please click the \"Information We Collect the Information\" button to refer to the content of the \"Tencent Conference Personal Information Collection List\".", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61400, "text": "In order to better protect your relevant rights, it is recommended that you carefully read the updated privacy protection guidelines. If you have any questions and suggestions on the content of the privacy protection, you can announce it through the 10th part of the privacy protection guidelines.Contact us for contact, thank you for your support to Tencent Conference.", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61401, "text": "You are welcome to use Tencent Conference!", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61402, "text": "The Tencent Conference is an online conference product provided by Shenzhen Tencent Computer System Co., Ltd. (hereinafter referred to as \"us\"). The company's registered place is the 35th floor of Tencent Building, the Tencent Building on the Malling Community Technology Middle School of Maling Community, Yuehai Street, Nanshan District, Shenzhen.", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61403, "text": "In the process of product operation, we will also jointly operate with affiliated companies, such as channel cooperation and brand linkage.", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61404, "text": "We will help you understand the situation of our collection, use, storage, and sharing of personal information through the \"Guidelines for Privacy Protection of Tencent Conference\" (hereinafter referred to as the \"Privacy Protection Guide\"), as well as the relevant rights you enjoy.", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61405, "text": "· In order to provide you with the Tencent Conference -related services, we need to collect information that you actively provide or due to the service provided by your service, we will explain the type and corresponding use of the above information;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61406, "text": "· You can access, correct, delete your personal information and manage your authorization on related pages;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61407, "text": "· We will use the industry's leading security technology to protect your personal information.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61408, "text": "You can read the full version of the Tencent Conference Privacy Protection Guide to understand more detailed personal information processing rules such as the corresponding relationship between the type and use of personal information, including:", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61409, "text": "1. Related definition", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61410, "text": "2. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61411, "text": "Third, the storage of information", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61412, "text": "Fourth, information security", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61413, "text": "5. The information we share", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61414, "text": "6. Your rights", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61415, "text": "Seven, change", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61416, "text": "8. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61417, "text": "Nine, others", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61418, "text": "10. Contact us", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61419, "text": "If you understand and agree to accept the guidance of this privacy protection, please click \"Agree\" to start receiving our services.", "label": ["Policy Change", "Important"], "rewrite": "If you understand and agree to accept the guidance of this privacy protection, please click \"Agree\" to start receiving our services."}
{"task": "rw_70.jsonl", "id": 61420, "text": "We collect information for third -party information sharing list and SDK directory", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61421, "text": "1. Related definition", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61422, "text": "Related definition:", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61423, "text": "1.1 Personal user: Individual users refer to individuals who use personal mobile phone numbers, WeChat registration, and use Tencent Conference;", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61424, "text": "1.2 Enterprise users: Refers to individuals or organizations who register, log in, use Tencent conference products and services, and obtain management authority, including but not limited to legal persons, government agencies, other organizations, partnerships, or individual industrial and commercial households (hereinafter referred to as \"enterprise users\")Items", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61425, "text": "Enterprise users can invite and authorize individual users to join the enterprise organization as their end users.", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61426, "text": "1.3 End users: End users refer to the Tencent Conference service by enterprise users, or invited by enterprise users to join the enterprise organization, and use the individual or individual users who use Tencent Conference.", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61427, "text": "When a business user invites you as an end user to access the enterprise organization, you will receive an invitation and you can choose whether to join the business user.", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61428, "text": "1.4 Enterprise user administrator: refers to individuals who have the operation authority designated by the company's user management background system;", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61429, "text": "Enterprise user administrators can be one or more.", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61430, "text": "1.5 Data controlled by enterprises: Refers to the information and data submitted or generated during the process of using the company users and the user of the enterprise users, including the information and data submitted or required by the business user, and the information distributed by the enterprise user to the end user.As well as information to complete work needs and meet the daily management needs of enterprises.", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61431, "text": "1.6 Personal information: Refers to various information related to recognized or recognized natural persons recorded in electronics or other ways.", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61432, "text": "1.7 Personal sensitive information: It refers to personal information that once leaked or illegally used to cause personality dignity of natural persons to be infringed or personal and property security. In this privacy protection guidelines, the specific personal sensitive information is significantly identified by the thick body).", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61433, "text": "1.8 Children: Refers to minors under the age of 14.", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61434, "text": "2. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61435, "text": "In the process of using Tencent's conference services, we strictly abide by the provisions of laws, regulations, and the agreement with users. In accordance with the guidelines of this privacy protection, collect it as described below, use the active provided by your service or due to the service provided by the service, or generate the service because of the service service.The information is used to provide you with services, optimization of our services, and ensuring your account security.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61436, "text": "You can click \"We Collection of Information\" to learn more about the specific scenarios, related information types, collection purposes, collection methods, and processing methods of collecting and using your personal information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Click \"We Collection of Information\" to learn more about the specific scenarios of collecting and using personal information, related information types, collection purposes, collection methods, and processing methods."}
{"task": "rw_70.jsonl", "id": 61437, "text": "If we use your personal information, beyond the purpose of the time when we collect and the scope of its direct or reasonable relationship, we will tell you and obtain your explicit consent again before using your personal information.", "label": ["Important", "First Party Collection Information"], "rewrite": "If the use information exceeds the purpose of the collection and the scope of a direct or reasonable relationship with it, it will be told you again and obtain your explicit consent."}
{"task": "rw_70.jsonl", "id": 61438, "text": "2.1, registered personal account: When you register to use Tencent Conference's personal account, we need you to provide some information:", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "You need to provide information so that you can register and use Tencent Conference."}
{"task": "rw_70.jsonl", "id": 61439, "text": "2.1.1, if you choose to establish a new account, you need to enter your mobile phone number and name to establish this service account for you according to your requirements.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If you establish a new account, you need to collect your mobile phone number and name."}
{"task": "rw_70.jsonl", "id": 61440, "text": "2.1.2, if you choose to use WeChat (WeChat, ID), register, you need to provide your WeChat account name, avatar, regional (location), gender, and your mobile phone number, and use it to establish for you according to your requirements.This service account.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If you choose to register with WeChat, you need to collect your WeChat account name, avatar, region, gender, and your mobile phone number."}
{"task": "rw_70.jsonl", "id": 61441, "text": "2.2, registered enterprise user account number: When you need to register as a business user, you need to provide the creator and enterprise related information in order to create a corporate user account for you. If you do not provide such information, you will not be able to register as an enterprise as an enterpriseUsers and use related services.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When registering as a business user, you need to provide the creator and the company's related information."}
{"task": "rw_70.jsonl", "id": 61442, "text": "Before uploading, authorizing, and managing personal information such as the name, avatar, mobile phone number and other personal information of its end users, please make sure that you have obtained the clear consent of the end user in advance.Information, and has fully notified the purpose, scope and use method of the related data collection of the end user.", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "Corporate users need to obtain the user's clear consent before uploading authorization and managing the names, avatars, and mobile phone numbers of its end users, and have fully notified the purpose, scope, and use of data collection."}
{"task": "rw_70.jsonl", "id": 61443, "text": "2.3, end user: When you are an end user of a business user or business, in order to provide Tencent conference services, we will collect the information and data you submit or generated during the use of Tencent's conference (hereinafter referred to as \"data controlled by the enterprise\")The data controlled by the enterprise may include:", "label": ["Important", "First Party Collection Information"], "rewrite": "When you provide services for you (end users), collect information and data you submit or generated during the use of Tencent Conference."}
{"task": "rw_70.jsonl", "id": 61444, "text": "2.3.1, the names, mobile phone numbers, names, avatars such as mobile phone numbers, names, avatars such as the end user of the registered enterprise submit or request the personal information provided by the end user;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When registering an enterprise end user, collect or request the personal information provided by the end user when registering an enterprise, mobile phone number, name, avatar and other companies."}
{"task": "rw_70.jsonl", "id": 61445, "text": "2.3.2 Enterprise, email address, position, position, employment time, Userid and other information related to business users or corporate users assigned to end users;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61446, "text": "Other data submitted by enterprise users, such as organizational structure.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61447, "text": "2.3.3, if your business administrator of your company chooses to use the company's company's WeChat account to open the Tencent conference service, the business administrator will authorize Tencent Conference to use your unique ID, name, and avatar in the company's WeChat.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If the business administrator chooses to use the company's WeChat account to open the Tencent conference service, the Tencent Conference will use your unique ID, name, and avatar in the company's WeChat."}
{"task": "rw_70.jsonl", "id": 61448, "text": "If you do not agree to provide us with the above information, you should inform your business administrator in advance.", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61449, "text": "The business administrator will open the Tencent conference service and provide your unique ID, name and avatar behavior as you agree with the above information.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "The business administrator will open the Tencent conference service and provide your unique ID, name and avatar behavior as you agree with the above information."}
{"task": "rw_70.jsonl", "id": 61450, "text": "2.4, SSO: When you log in to Tencent Conference with the company's SSO, you need to provide avatar, nickname information, and relevant information about the relevant enterprise.Essence", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you log in to the Tencent Conference with the company's SSO, you need to provide avatars, nickname information, and relevant information related information."}
{"task": "rw_70.jsonl", "id": 61451, "text": "If you do not agree to provide us with the above information, you should inform your business administrator in advance.", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61452, "text": "You understand that for the personal information in the data controlled by the enterprise, the controller of the personal information of the enterprise, we only based on the instructions of the enterprise users (including the operations carried out by the business user and the business administrator of the enterprise), and theThe protocol between users is handled accordingly.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "For personal information in the data controlled by enterprises, corporate users are controller of personal information."}
{"task": "rw_70.jsonl", "id": 61453, "text": "If you have any questions or opinions on the purpose, scope, and usage method of the data controlled by the above enterprises, you understand and agree that you should contact your company or business user administrator to handle it.", "label": ["Important", "Edit/Control"], "rewrite": "If you have doubts about the purpose, scope, and usage of data controlled by the enterprise, you understand and agree that you should contact your affiliated enterprise or business user administrator to handle it."}
{"task": "rw_70.jsonl", "id": 61454, "text": "2.5, connection service: When you use Tencent Conference services, we will collect your IP address. We use this data to allow you to connect our server. If you refuse to provide it, we will not be able to use our service.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use Tencent Conference services, collect your IP address so that you can connect our server."}
{"task": "rw_70.jsonl", "id": 61455, "text": "To help you understand and diagnose the connection status of your service with this service, we will collect your wireless network, Internet connection status, and whether you get the authorization of connecting this service and its network.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your wireless network, Internet connection status, and whether you get the authorization of connecting this service and its network."}
{"task": "rw_70.jsonl", "id": 61456, "text": "2.6 Service Optimization and Safety:", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61457, "text": "In order to ensure your normal use of our services and maintain the normal operation of our service, to ensure the safety of our products and improve and optimize your service experience, we will collect your device model, operating system, system version, network type, network type, network type, network type, network type, network type, network type, network type, network type, network type, network type, network type, network type, network type, network type, network type, network type, and network type, IMEI, MAC address, AndroidID, installed application list, APP crash record, traffic statistics, operation logs, audio and video quality data (volume and video audio package rate, audio and video quality data do not involve your call content)), Function records (such as the type and use time of the card coupon exchanged for the benefit center, the authorization time of the third -party application, the order number, product information, amount and service party of the payment function);", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your device model, operating system, system version, network type, IMEI, MAC address, Androidid, installed application list, APP collapse record, traffic statistics, operation logs, audio and video quality data, functional use records to ensure normal service services to normal service services to normal services to normal services to normal services to normal services to normal services to normal services to normal services to normal services to normal services to normal service services to ensure normal services.run."}
{"task": "rw_70.jsonl", "id": 61458, "text": "To help you reduce the steps of admission and improve the efficiency of the meeting, we will identify the conference number or conference link in your shear board.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "To identify the conference number or meeting link in your cut board to help you enter the meeting."}
{"task": "rw_70.jsonl", "id": 61459, "text": "In addition, if you are newly installed users and data with cutting boards, we will read the shear data twice during the meeting to identify the card and create a meeting to display the meeting card for you.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If you are newly installed users and have data with cutting boards, we meet with the card and read the cutting plate data twice during the creation of the meeting."}
{"task": "rw_70.jsonl", "id": 61460, "text": "In addition, we will not collect and process any information in your clipboard.", "label": ["Important", "First Party Collection Information"], "rewrite": "Except for the meeting, we will not collect and process any information in your clipboard."}
{"task": "rw_70.jsonl", "id": 61461, "text": "2.7, recording function: When you use the recording function of the conference at the Tencent Conference, you need to provide related audio and video information for processing.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the recording function, you need to provide related audio and video information for processing."}
{"task": "rw_70.jsonl", "id": 61462, "text": "If you do not provide the above information, you will not be able to use the conference recording function.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you do not provide audio and video information, you will not be able to use the conference recording function."}
{"task": "rw_70.jsonl", "id": 61463, "text": "When you are a recording meeting, you will receive a recording reminder. If you do not agree to record your voice or screen, you can choose to withdraw from the meeting.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you are a recording meeting, you will receive a recording reminder, if you do not agree, you can choose to withdraw from the meeting."}
{"task": "rw_70.jsonl", "id": 61464, "text": "When you use the local recording function, the recording information will be stored in your device.", "label": ["Data Retention", "Important"], "rewrite": "When you use the local recording function, the recording information will be stored in your device."}
{"task": "rw_70.jsonl", "id": 61465, "text": "When you use the cloud recording function, the recording information will be stored in the cloud storage space under the conference creator account, and you can watch the recording content through a cloud recording link.", "label": ["Data Retention", "Important"], "rewrite": "When you use the cloud recording function, the recording information will be stored in cloud storage space."}
{"task": "rw_70.jsonl", "id": 61466, "text": "The storage space of personal accounts is released after the cancellation of the personal account.", "label": ["Data Retention", "Important"], "rewrite": "The storage space of personal accounts is released after the cancellation of the personal account."}
{"task": "rw_70.jsonl", "id": 61467, "text": "After the release, the storage content in the account cloud storage space is permanently deleted and cannot be restored.", "label": ["Data Retention", "Important"], "rewrite": "After the cloud storage space is released, the storage content is permanently deleted and cannot be restored."}
{"task": "rw_70.jsonl", "id": 61468, "text": "2.8 Document Function: You can use the document function to cooperate with other users participating in the same meeting. Document services are provided by Tencent documents. For related data security policies, please refer to the \"Tencent Document Data Security White Paper\" and \"Tencent Document Privacy Insurance Guidelines\".", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61469, "text": "2.9, meeting records: We will collect and record the beginning and end time of the meeting, the theme of the meeting, the meeting of the meeting, and the time of the start time, end time and time of the participants to join the meeting, so that the creatorsRelated Information;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We will collect and record the situation of the meeting, which facilitates the creator of the meeting to check the relevant information of the conference."}
{"task": "rw_70.jsonl", "id": 61470, "text": "If you are the founder of the conference, you can export the above information created by the web version of the Tencent Conference service.", "label": ["Edit/Control", "Important"], "rewrite": "The creator of the meeting can log in to the web version of the Tencent Conference service to export various information of the historical conferences created."}
{"task": "rw_70.jsonl", "id": 61471, "text": "Enterprise administrators can export a list of conferences that are currently being held or ended. The content includes the meeting number, the theme of the meeting, and the start time.", "label": ["Important", "Edit/Control"], "rewrite": "Enterprise administrators can export the current list of companies being held or ended."}
{"task": "rw_70.jsonl", "id": 61472, "text": "2.10, voting function: When you set up non -anonymous voting in the Tencent Conference, we will record the nicknames, avatars and votes of relevant voters, and the host of the meeting can be viewed only.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you set up non -anonymous voting, collect the nicknames, avatars and votes of relevant voters for the host for viewing."}
{"task": "rw_70.jsonl", "id": 61473, "text": "If it is anonymous, the nickname of the voter will be invisible to the host.", "label": ["Important", "First Party Collection Information"], "rewrite": "If it is anonymous, the nickname of the voter will be invisible to the host."}
{"task": "rw_70.jsonl", "id": 61474, "text": "The voting record will be preserved as the information of the meeting, and the creator of the meeting alone can be viewed after the meeting.", "label": ["Edit/Control", "Important"], "rewrite": "The creator of the meeting can check the voting record after the meeting."}
{"task": "rw_70.jsonl", "id": 61475, "text": "2.11, purchase service and red envelopes: When you pay the purchase service and use WeChat red envelope function through WeChat at the Tencent Conference, you need to provide your WeChat account and select the payment function.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you pay for the purchase service and use the WeChat red envelope function through WeChat, you need to provide WeChat accounts and choose the payment function."}
{"task": "rw_70.jsonl", "id": 61476, "text": "The payment service under the Tencent Conference is provided by Tenpay Payment Technology Co., Ltd. The payment service related personal privacy information will be protected by Tenpay Payment Technology Co., Ltd. according to Tenpay Payment Technology Co., Ltd.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Provide payment services by Tenpay Payment Technology Co., Ltd. and protect personal privacy information."}
{"task": "rw_70.jsonl", "id": 61477, "text": "2.12, registration function: When you use the registration function as the organizer of the conference, you need to upload the rich text (picture, text, video) as your activity introduction. At the same time, you can customize related issues according to the actual needs of the meeting.Organizational use, please pay attention to follow relevant laws and regulations, and only the invited party can fill in the necessary information of the meeting.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the registration function, you need to upload rich texts and customize related issues as needed to use it for the use of conference organizations, and only request the invited party to fill in the necessary information of the meeting."}
{"task": "rw_70.jsonl", "id": 61478, "text": "When you are the participants, the Tencent Conference is entrusted by the \"Conference Organizer\" to assist in the organizational direction of the meeting to collect the necessary participation information (the content is customized by the organizer).Contact the organizer.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you are a participant, the Tencent Conference may assist the meeting of the meeting to collect the necessary participation information. If you have any questions, please contact the organizer of the meeting."}
{"task": "rw_70.jsonl", "id": 61479, "text": "2.13, add business card: When you use the functions of adding business cards, you need to log in to Lingying and authorize it to provide us with relevant information, including: name, company, foreign professional title, avatar link, mailbox, telephone, WeChat, for your business card, for your business cardRegistration.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the function of adding a business card, you need to log in to Lingying and authorize it to provide us with relevant information."}
{"task": "rw_70.jsonl", "id": 61480, "text": "2.14, spit out: In the process of using Tencent's conference, if you have any opinions and suggestions, you can submit complaints or suggestions to us through the \"spitting groove\".Provide related questions, text descriptions, conference numbers and corresponding WeChat/mobile phone numbers.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In the process of using Tencent's conference, you can submit complaints or suggestions to us through \"spitting a gossip\". You need to provide relevant questions, text descriptions, conference numbers, and corresponding WeChat/mobile phone numbers."}
{"task": "rw_70.jsonl", "id": 61481, "text": "2.15, calendar schedule synchronization: In the case of obtaining your consent, we will use the conference schedule information in the Tencent calendar, such as the theme of the meeting, the meeting time, the meeting time, the nickname of the conference, the attendees to the Tencent meeting to the Tencent meetingIn China, if you disagree, we will not synchronize your schedule data in the Tencent Calendar to Tencent Conference, but it will not affect your other functions of using Tencent's conference.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We agree to synchronize your schedule information in the Tencent Calendar to Tencent Conference."}
{"task": "rw_70.jsonl", "id": 61482, "text": "2.16, online customer service: When you use online customer service, you can select or enter the question you want to ask at the customer service entrance, the system will automatically recognize and give the question answer.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use online customer service, the system will automatically identify the question you enter and give the answer."}
{"task": "rw_70.jsonl", "id": 61483, "text": "When you want to transfer people, the customer service system will prompt you to log in to the account. You need to enter the mobile phone number and verification code. You can also enter text, photos and documents to feedback your questions, so that the staff can locate your problems.Give you an efficient answer.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you want to transfer artificial customer service, you need to log in, enter your mobile phone number and verification code, or enter text, photos and file feedback issues."}
{"task": "rw_70.jsonl", "id": 61484, "text": "2.17, Bind WeChat/Mailbox: When you actively choose to bind WeChat/mailbox in the settings, we will get your WeChat and mailbox, so that you will receive the Tencent Conference Service Number notice to understand the relevant information of the meeting in time.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you actively choose to bind WeChat/mailbox in the settings, we will get your WeChat and mailbox for notification."}
{"task": "rw_70.jsonl", "id": 61485, "text": "2.18, meeting notes: When you use the note function, you will keep your notes. The content of the notes is stored in the cloud storage space under the conference creator account. You can check all the preserved notes in the historical notes.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the note function, collect your notes and keep the notes in the cloud storage space."}
{"task": "rw_70.jsonl", "id": 61486, "text": "2.19, auxiliary subtitles: When you use the subtitle function, we will automatically recognize the voice content in the meeting to display the text in real time for you. The text is only displayed in real time in your device terminal, and we will not keep it in the server.", "label": ["Data Retention", "Important", "First Party Collection Information", "Usage"], "rewrite": "When you use subtitles, we will automatically identify the voice content in the conference to show you the text in real time, but do not reserve."}
{"task": "rw_70.jsonl", "id": 61487, "text": "2.20, real -time conversion function: When you use the real -time conversion function, we will automatically identify the voice content in the meeting and display the text for you in real time.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the real -time conversion function, we will automatically identify the voice content in the meeting and display the text for you in real time."}
{"task": "rw_70.jsonl", "id": 61488, "text": "When you are a conference participant, you will receive a conversion reminder. If you do not agree to the conversion of your voice content, you can choose to withdraw from the meeting.", "label": ["Important", "First Party Collection Information", "Edit/Control"], "rewrite": "When you are a conference participant, you will receive a reminder of the transliteration. If you do not agree, you can choose to withdraw from the meeting."}
{"task": "rw_70.jsonl", "id": 61489, "text": "The text after real -time conversion will be stored in the cloud storage space under the conference creator account. The creator of the conference can be viewed and exported on the details page after the meeting.", "label": ["Data Retention", "Important", "Edit/Control"], "rewrite": "The real -time transliteration text is stored in the cloud storage space under the conference creator account, which can be viewed and exported at the details page after the meeting."}
{"task": "rw_70.jsonl", "id": 61490, "text": "2.21, sign -in function: When you use the sign -in function, we will collect your sign -in records, including sign -in members, roles, and sign -in time.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the sign -in function, we will collect your sign -in records."}
{"task": "rw_70.jsonl", "id": 61491, "text": "You can view or export the sign -in record.", "label": ["Important", "Edit/Control"], "rewrite": "You can view or export the sign -in record."}
{"task": "rw_70.jsonl", "id": 61492, "text": "In order to provide you with the services you choose, or to ensure the quality and experience of the service, we need to authorize to open the relevant system permissions.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61493, "text": "You can view the state of permissions in your device settings or Tencent Conference mobile client \"My Avatar-Privacy Security-System permissions\", and can determine these permissions at any time to open or close at any time.", "label": ["Important", "Edit/Control"], "rewrite": "You can check the state of permissions in the device settings or Tencent conference mobile client \"My Avatar-Privacy Security-System permissions\" and open or close these permissions."}
{"task": "rw_70.jsonl", "id": 61494, "text": "2.22, audio and video function: When you use the audio and video conference function, you need to turn on the camera authority and microphone right.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "When you use the audio and video conference function, you need to turn on the camera authority and microphone rights."}
{"task": "rw_70.jsonl", "id": 61495, "text": "If you do not turn on the corresponding permissions, you will not be able to use the audio and video conference function.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you do not turn on the camera permissions and microphones, you will not be able to use the audio and video conference function."}
{"task": "rw_70.jsonl", "id": 61496, "text": "When you are in a non -audio or Bluetooth mode at the meeting, we will call the acceleration sensor and distance sensor of the device to determine whether the mobile phone is raised to the human ear.Touch operation.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "When you are in a non -exterior audio or Bluetooth mode at the meeting, we will call the acceleration sensor and distance sensor of the device to determine whether the mobile phone is sticking to the ears to prevent errors."}
{"task": "rw_70.jsonl", "id": 61497, "text": "In addition, if you open the camera at the audio and video conference, we will also get the screen facing the sensor to correct the direction of the video.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "If you turn on the camera at the audio and video conference, get the screen facing the sensor to correct the direction of the video."}
{"task": "rw_70.jsonl", "id": 61498, "text": "2.23, personalized human voice enhancement function: When using Tencent Conference to conduct real -time meetings, you can open the personalized human voice enhancement function. The Tencent meeting enhances the voice of the speaker according to the voice characteristics of the spokesperson in the meeting, suppressing the background of the backgroundDrives people's noise.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "When using the Tencent Conference for real -time meetings, you can enhance the voice of a spokesman through personalized human voice."}
{"task": "rw_70.jsonl", "id": 61499, "text": "In order to achieve the distinction between speakers' voices, the Tencent Conference will classify sound -based characteristics through a orderly way.", "label": ["Important", "Usage"], "rewrite": "The Tencent meeting classified sound -based characteristics through a programmatic method."}
{"task": "rw_70.jsonl", "id": 61500, "text": "For the processing technology of sound pattern in this process, please understand:", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61501, "text": "2.23.1, during the use process, the Tencent Conference complied with the principle of \"minimal enough\". The related sound pattern characteristics are only distinguished in the Tencent conference, and the current range is not recognizable;", "label": ["Important", "Data Security"], "rewrite": "Using pattern feature processing technology, the Tencent meeting abide by the \"minimum enough\" principle."}
{"task": "rw_70.jsonl", "id": 61502, "text": "2.23.2, during the use process, the Tencent Conference abide by the principle of \"the shortest time\", the extraction of related sound characteristics to use the shortest time fragment that meets the technical requirements, and only use the intermediate feature data during the process processing process.Store any original and intermediate feature data;", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "Using pattern feature processing technology, the Tencent meeting abides by the \"shortest time\" principle, and does not store any original and intermediate feature data."}
{"task": "rw_70.jsonl", "id": 61503, "text": "2.23.3, please know, the sound -patterned feature processing technology used in the above process is completely autonomous and controllable for you. If you do not agree with the Tencent meeting to use your sound pattern characteristics, you can and avoid using it and avoid using it.The Tencent Conference's personalized human voice enhancement function, but this does not affect your basic function of using Tencent's conference.", "label": ["Important", "Usage"], "rewrite": "If you don't agree with the Tencent Conference to use your sound characteristics, you should avoid using personalized human sound enhancement functions."}
{"task": "rw_70.jsonl", "id": 61504, "text": "If you want to close this function in the future, go to the \"Settings-Personalized Human Voice Enhancement\" path to close.", "label": ["Important", "Edit/Control"], "rewrite": "You can turn off the personalized human voice enhancement function through the \"setting-personalized human voice enhancement\" path."}
{"task": "rw_70.jsonl", "id": 61505, "text": "2.23.4 In order to ensure that you have a good experience, it is recommended that you turn off this feature when you have a cold and low voice, etc. when you have a cold, low your voice, etc.", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61506, "text": "2.24, code scanning function: When you use the code scanning function, you need to turn on the camera authority. At this time, we will collect your code scanning record to show you the result scanning result.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "When you use the code scanning function, we will get the camera authority and collect your code scan record to show you the results of the code scanning."}
{"task": "rw_70.jsonl", "id": 61507, "text": "If you refuse to open the above permissions or provide the above information, we will not be able to provide you with a code scanning function.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61508, "text": "In addition, in the process of scanning the code, we will call the light sensor of the device to identify the light intensity of the device to determine whether the light needs to be supplemented. If the light is darker, the flashlight button will be displayed for you to supplement the light to complete the code.", "label": ["Important", "Usage"], "rewrite": "During the code scanning process, we will call the light sensor to identify the light intensity of the device to determine whether the light needs to be supplemented."}
{"task": "rw_70.jsonl", "id": 61509, "text": "2.25, chat function: When you use the chat function to communicate with other users who participated in the same meeting, we will encrypt the corresponding chat data and transfer it to your chat object.", "label": ["Important", "Data Security"], "rewrite": "When you use the chat function, we will encrypt the chat data and transfer it to your chat object."}
{"task": "rw_70.jsonl", "id": 61510, "text": "When you choose to send pictures in the local device in the chat, we will ask you to turn on the album permissions. Please know to ensure that you can quickly screen the pictures you need, and we need to refresh the localization.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "When you send pictures in the local device in the chat, we need to obtain the album permissions."}
{"task": "rw_70.jsonl", "id": 61511, "text": "Your chat history at the Tencent Conference will only be stored in your terminal device, and we will not keep it in the server.", "label": ["Data Retention", "Important"], "rewrite": "Your chat history will only be stored in your terminal device without staying in the server."}
{"task": "rw_70.jsonl", "id": 61512, "text": "2.26, joining the meeting schedule: When you choose to synchronize calendar information to Tencent's meeting or join the agenda into your system calendar, we need to obtain your calendar read and write permissions, otherwise we cannot complete the synchronization of the conference schedule.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "When you choose to synchronize the calendar information to Tencent's meeting or join the meeting schedule into your system calendar, we need to obtain the calendar read and write permissions."}
{"task": "rw_70.jsonl", "id": 61513, "text": "2.27, custom virtual background: When you choose to use a custom virtual background function, you need to upload a photo or a video from your device as a personal virtual background. At this time, we will ask you to open the album authority.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "When you choose to use a custom virtual background function, we ask you to open the album authority."}
{"task": "rw_70.jsonl", "id": 61514, "text": "If you do not provide the above information or refuse to open the album authority, you will not be able to use a custom virtual background function.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you refuse to open the album authority, you will not be able to use a custom virtual background function."}
{"task": "rw_70.jsonl", "id": 61515, "text": "When you customize the \"virtual background\", we will call the device's magnetic field sensor, acceleration sensor and gravity sensor to identify the screen direction of the device. You can switch on the screen direction.The pop -up screen locking situation reminds you.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you customize the \"virtual background\", we will call the device's magnetic field sensor, acceleration sensor, and gravity sensor to identify the screen direction of the device."}
{"task": "rw_70.jsonl", "id": 61516, "text": "In addition, if you turn on the camera when you customize the virtual background, we will also get the screen facing the sensor to correct the direction of the video.", "label": ["Important", "Usage"], "rewrite": "If you turn on the camera when you customize the virtual background, we will get the screen facing the sensor to correct the direction of the video."}
{"task": "rw_70.jsonl", "id": 61517, "text": "2.28, beauty: When you use beauty functions, we need to handle some of your facial feature value information to achieve facial beauty effects.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use beauty functions, we will process some of your facial feature value information locally."}
{"task": "rw_70.jsonl", "id": 61518, "text": "You need to authorize us to use the camera authority.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use the beauty function, you need to authorize us to use the camera authority."}
{"task": "rw_70.jsonl", "id": 61519, "text": "We will only process the relevant facial feature value information offline in your local equipment, and we will not upload, background storage or sharing this kind of information with a third party.", "label": ["Data Retention", "Important"], "rewrite": "Processing related facial feature value information only in local devices will not upload, background storage or sharing with third parties."}
{"task": "rw_70.jsonl", "id": 61520, "text": "In addition, you need to turn on the camera when using the beauty function, and we will get the screen facing the sensor to correct the direction of the video.", "label": ["Important", "Usage"], "rewrite": "When you use the beauty function, you need to open the camera. We will get the screen facing the sensor to correct the direction of the video."}
{"task": "rw_70.jsonl", "id": 61521, "text": "2.29, live broadcast: When you use the live broadcast function as a live conference at the Tencent Conference, you need to provide audio and video data, including shared screens and sounds.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the live broadcast function of the meeting at the Tencent Conference, you need to provide audio and video data."}
{"task": "rw_70.jsonl", "id": 61522, "text": "If you do not provide the above information, you will not be able to use the live broadcast function.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you do not provide audio and video data, you will not be able to use the live broadcast function."}
{"task": "rw_70.jsonl", "id": 61523, "text": "In addition, you need to turn on the camera when using the live broadcast function. We will get the screen facing the sensor to correct the direction of the video.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "You need to open the camera when using the live broadcast function, and we will get the screen facing the sensor to correct the direction of the video."}
{"task": "rw_70.jsonl", "id": 61524, "text": "Face authentication of the person who applies as a live broadcast party is provided by Tencent's real -name core technology solution \"Tencent Yunhui Eye\" provides technical support.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Face authentication of the person who applies as a live broadcast party is provided by Tencent's real -name core technology solution \"Tencent Yunhui Eye\" provides technical support."}
{"task": "rw_70.jsonl", "id": 61525, "text": "In the process of receiving face authentication services, you agree and authorize us to obtain your mobile phone camera permissions and collect your name and ID number by identifying your ID picture. We will intercept your face during the live detection processMinistry image and authentication videos to realize your identity verification.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "During the face authentication process, obtain your mobile phone camera right to identify ID pictures to collect your name and ID number, and intercept your face image and authentication video to achieve authentication."}
{"task": "rw_70.jsonl", "id": 61526, "text": "The above information involves personal sensitive information. We only use it to complete your identity verification in accordance with the law and not store.", "label": ["Data Retention", "Important"], "rewrite": "Face certification information and identity information are only used to complete your identity verification in accordance with the law and not stored."}
{"task": "rw_70.jsonl", "id": 61527, "text": "If you refuse to provide the above information, you will not be able to use the live broadcast function for live broadcast, but it does not affect your other functions of using Tencent Conference.", "label": ["Important", "First Party Collection Information"], "rewrite": "Refusing to provide face authentication information and identity information, you will not be able to use the live broadcast function for live broadcast."}
{"task": "rw_70.jsonl", "id": 61528, "text": "2.30, in order to help you optimize your own network, choose the optimal network access meeting. When the user first uses Tencent Conference to enter the meeting, you need to apply for access to the local network permissions.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "When a user enters the meeting for the first time, you need to apply for access to the local network permissions."}
{"task": "rw_70.jsonl", "id": 61529, "text": "2.31 The following scenarios need to use your communication records:", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61530, "text": "2.31.1, when you synchronize the information of the meeting to the local calendar and add \"invited people\" to the local calendar, in order to facilitate formatting your invitation information, you need to apply for a communication recording authority (limited to iOS).", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "When you synchronize the scheduled meeting information to the local calendar and add \"invited people\" to the local calendar, you need to apply for a communication recording authority."}
{"task": "rw_70.jsonl", "id": 61531, "text": "Please know that this permissions application is related to the difference in the configuration of the iOS system, which is triggered by the system by itself.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61532, "text": "2.31.2, when you are a commercial version of the company, when you call the address book user to enter the meeting with a telephone call, you need to apply for a communication recording authority;", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "When you call the address book user to enter the meeting with a telephone call, you need to apply for a communication record authority."}
{"task": "rw_70.jsonl", "id": 61533, "text": "After closing, you will not be invited to participate in the meeting through the above methods.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61534, "text": "。", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61535, "text": "Please note that when you start the right of power, it means that you authorize us to collect and use relevant personal information to provide you with corresponding services. Once you turn off the right of power, it means that you cancel the authorization.And the use of relevant personal information can not provide you with the service corresponding to the permissions.", "label": ["Permission Acquisition", "Important", "Risk"], "rewrite": "The opening of one authority means that the authorization is authorized to collect and use the relevant information to provide corresponding services. Close the authority to cancel the authorization representative, and no longer continue to collect and use relevant information based on the corresponding permissions."}
{"task": "rw_70.jsonl", "id": 61536, "text": "However, your decision to close permissions will not affect the collection and use of information based on your authorization.", "label": ["Permission Acquisition", "Important", "Risk"], "rewrite": "Close authority will not affect the collection and use of information based on authorization."}
{"task": "rw_70.jsonl", "id": 61537, "text": "You can click \"Tencent Conference Application Power Application and Usage Instructions\" to view detailed application permission application and usage description.", "label": ["Permission Acquisition", "Important"], "rewrite": "You can click \"Tencent Conference Application Power Application and Use Instructions\" to view the application permission application and usage description."}
{"task": "rw_70.jsonl", "id": 61538, "text": "Application permission application and usage description", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61539, "text": "2.32, we may use, cookie, and other related technologies collect your information to ensure the security of our service.", "label": ["Important", "First Party Collection Information"], "rewrite": "You may use cookie and other related technologies to collect your information."}
{"task": "rw_70.jsonl", "id": 61540, "text": "The use of the Tencent Conference Cookie is in line with Tencent's cookie policy. If you want to learn more about the security of cookies, please refer to the Cookie Policy Explanation.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61541, "text": "2.33, in order to ensure the stable operation and functional implementation of our mobile client, so that you can enjoy and use more services and functions. Our application will embed third -party software tool development packs (SDK) or other similar applications.We will strictly monitor the SDK and application interface (API) that obtain information from third parties to protect data security. Regarding the relevant information about this kind of third -party SDK, please referAnd SDK, directory \".", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Our applications will embed third -party software tool development packages or other similar applications to think that you provide services and will conduct security detection of third parties to obtain information.For details, please refer to the \"third -party sharing information list and SDK directory\"."}
{"task": "rw_70.jsonl", "id": 61542, "text": "2.34, when you give feedback, you need to provide detailed backgrounds, information and contact information related to feedback related to the feedback from opinion, so that we can verify and handle your opinions as soon as possible.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you give feedback, you need to provide relevant detailed background, information and your contact information."}
{"task": "rw_70.jsonl", "id": 61543, "text": "2.35, according to relevant laws and regulations and national standards, in the following situations, we may collect or use your relevant personal information without soliciting your authorization consent:", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "According to relevant laws and regulations and national standards, in the following circumstances, we may collect and use your relevant personal information without asking your authorization consent:"}
{"task": "rw_70.jsonl", "id": 61544, "text": "1), related to our obligations stipulated in the law and regulations of our law and regulations;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The collection and use information related to the obligations stipulated in our laws and regulations does not need to solicit authorization consent."}
{"task": "rw_70.jsonl", "id": 61545, "text": "2) Directly related to national security and national defense security;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The collection and use information directly related to national security and national defense security does not need to solicit authorization consent."}
{"task": "rw_70.jsonl", "id": 61546, "text": "3) Directly related to public safety, public health, and major public interests;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The collection and use information directly related to public safety, public health, and major public interests does not need to solicit authorization consent."}
{"task": "rw_70.jsonl", "id": 61547, "text": "4) Directly related to criminal investigation, prosecution, trial and judgment execution;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Direct related collection and use information such as criminal investigation, prosecution, trial, and execution of judgments does not need to solicit authorization consent."}
{"task": "rw_70.jsonl", "id": 61548, "text": "5), for maintaining major legitimate rights and interests of your life, property, etc., but it is difficult to obtain the consent of my authorization;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collecting the use information out of major legitimate rights and interests such as maintaining your life and property of your or other individuals, but it is difficult to obtain the consent of my authorization, and no authorization consent is required."}
{"task": "rw_70.jsonl", "id": 61549, "text": "6), the personal information involved is public to the public by itself;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The personal information involved is public to the public by itself, and there is no need to solicit authorization consent."}
{"task": "rw_70.jsonl", "id": 61550, "text": "7), signing and fulfilling the contract according to your requirements;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "According to your request to sign and perform the collection and use information necessary for the contract, no authorization consent is required."}
{"task": "rw_70.jsonl", "id": 61551, "text": "8), collect personal information from the legal public information, such as legal news reports and government information disclosure;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If you collect personal information from the legal disclosure information, you do not need to solicit authorization consent."}
{"task": "rw_70.jsonl", "id": 61552, "text": "9), maintain the safe and stable operation of the products or services provided by the product or service, such as discovering and disposing of products or services;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Maintaining the collection and use information necessary for the safe and stable operation of the product or service, no need to solicit authorization consent."}
{"task": "rw_70.jsonl", "id": 61553, "text": "10), other circumstances stipulated in laws and regulations.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Other collection and use information stipulated in laws and regulations does not need to solicit authorization."}
{"task": "rw_70.jsonl", "id": 61554, "text": "Please understand that the functions and services we provide to you are constantly updated and developed. If a function or service is not in the aforementioned and collected your information, we will use page prompts, interactive processes, website announcements, etc.Explain the content, scope and purpose of information collection to you to obtain your consent.", "label": ["Policy Change", "Important"], "rewrite": "If a function or service exceeds the scope of the instructions, we will explain to you the situation of information collection to obtain your consent."}
{"task": "rw_70.jsonl", "id": 61555, "text": "Please note that we will not take the initiative to obtain your personal information from a third party outside Tencent Computer System Co., Ltd..", "label": ["Important", "First Party Collection Information"], "rewrite": "We will not take the initiative to obtain your personal information from a third party outside Tencent Computer System Co., Ltd.."}
{"task": "rw_70.jsonl", "id": 61556, "text": "In the future, because the product function evolution needs to obtain your personal information from the third party, we will tell you the source, type, and scope of use of personal information before acquisition.The scope of authorization consent when information is required to obtain your authorization consent before handling your personal information;", "label": ["Important", "First Party Collection Information"], "rewrite": "If you need to obtain and process your personal information from a third party, we will inform you in advance to obtain your authorization consent and ask the third party to obtain your consent and ensure the legitimacy of the information."}
{"task": "rw_70.jsonl", "id": 61557, "text": "In addition, we will also strictly abide by the provisions of relevant laws and regulations, and require a third party to ensure the legality of the information provided.", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61558, "text": "2.36, Self -Starting Instructions: Tencent Conference may start by yourself according to your meeting arrangements to send you a meeting notice to you in advance according to your meeting schedule to ensure that you are not missing every important meeting.", "label": ["Important", "Usage"], "rewrite": "The Tencent Tencent Conference may start according to your meeting arrangement and send the meeting notice in advance."}
{"task": "rw_70.jsonl", "id": 61559, "text": "2.37, user experience improvement: In order to help you obtain product information, optimize product and transaction services, Tencent Conference or partner may provide you with product information and service through telephone or SMS and other methods you provide by your contact information (such as mobile phone numbers).Information or other related information or activities in order to facilitate your timely understanding of relevant information and experience related products and services.", "label": ["Important", "Usage"], "rewrite": "The Tencent meeting or partner may provide you with the contact information you provided to provide you with related information or activities or activities notifications."}
{"task": "rw_70.jsonl", "id": 61560, "text": "If you do not authorize us to collect or use the aforementioned information, you may not be able to learn about our relevant information or activities in time, but it will not affect your other functions or services using Tencent Conference.", "label": ["Important", "First Party Collection Information"], "rewrite": "Refusing to collect and use your contact information may cause you to not know about relevant information or activity notifications in time, but it does not affect the normal use of other functions."}
{"task": "rw_70.jsonl", "id": 61561, "text": "If you are unwilling to accept the relevant product information or activities provided by the Tencent Conference, you can give us feedback from your needs and willingness to be released in the tenth \"contact us\" or close the message notification according to the guidance of the Tencent Conference's related operation guidelines.Essence", "label": ["Important", "Edit/Control"], "rewrite": "You can contact us to feedback your needs or willingness to close the message notification according to the guidance of the Tencent Conference."}
{"task": "rw_70.jsonl", "id": 61562, "text": "2.38 Operation Activities: We may organize some public welfare activities from time to time, or have draws, welfare collection, redeem rights or goods, and time -limited experience.", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61563, "text": "You can choose whether to participate. If you choose to participate, according to the needs of the activity, we may collect the nicknames, avatars, equipment information of the account you used in the event, and the behavior data of the Tencent Conference (including the duration of the meeting, the function of functional use, and participate in specific use, participate in specific use, participate in a specificConference records), and use the information collected mentioned above as the basis for determining your qualifications and participation in the event.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If you choose to participate in operating activities, we may collect and use the nickname, avatar, equipment information, and use Tencent Conference's behavior data to use the accounts used by you."}
{"task": "rw_70.jsonl", "id": 61564, "text": "When you participate in the lottery, quiz, answering, submission, questionnaire survey and other activities, you may need to submit relevant information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you participate in operating activities, you may need to submit relevant information."}
{"task": "rw_70.jsonl", "id": 61565, "text": "For example: In order to receive rewards, you need to provide necessary personal information related to receiving prizes (such as: involving equity exchange, you need to provide the corresponding account information;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "To receive rewards, you need to provide necessary personal information related to the award."}
{"task": "rw_70.jsonl", "id": 61566, "text": "If you involve offline delivery, you need to provide information on the consignee;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If you involve offline delivery, the consignee information needs to be provided."}
{"task": "rw_70.jsonl", "id": 61567, "text": "Those who involve real -name authentication need to provide information such as ID cards or qualifications). For details, please refer to the instructions of the activity page or related rules.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Those who involve real -name authentication need to provide information such as ID cards or qualifications."}
{"task": "rw_70.jsonl", "id": 61568, "text": "2.39, Advertising: We may use your device logo (such as IDFA, OAID, etc.), advertising data (such as exposure, click, conversion data, etc.), device information (such as device models, system language, high screen, screen direction, etc.), Application and Data (such as application package names, operation logs, etc.), connected WiFi, rough geographical location information and other information, provide you with advertisements you may be interested in at the Tencent meeting, evaluate and improve our advertising and improve our advertisementsThe effects of other promotions and promotion activities and business analysis.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may use information such as your device logo, advertising data, device information, application and data, connected WiFi, rough geographical location information and other information to provide you with personalized advertisements and improve the advertising effect."}
{"task": "rw_70.jsonl", "id": 61569, "text": "When you use innovative advertising interactive functions (such as shaking, twisting, and reversing equipment), we will call the device's gyroscope, acceleration, and gravity sensor to identify and judge your device status.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use innovative advertising interactive functions, we will call the device's gyroscope, acceleration, and gravity sensor to identify and judge your device status."}
{"task": "rw_70.jsonl", "id": 61570, "text": "Please understand that separate device sensor data does not involve any personal location information and cannot be combined with other information to identify the identity of a specific natural person.", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61571, "text": "When you actively copy the links on the advertising landing page, we will access the device's cutting plate capabilities to facilitate the implementation of functions such as links.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you actively copy the content on the advertising landing page, we will access the content of the device cutting board."}
{"task": "rw_70.jsonl", "id": 61572, "text": "Please rest assured that personalized advertising recommendation algorithms do not identify your true identity. It is based on speculative characteristics to provide more valuable advertising information for you and save your transaction costs.", "label": ["Important", "Usage"], "rewrite": "Personalized advertising recommendation algorithms do not identify your true identity."}
{"task": "rw_70.jsonl", "id": 61573, "text": "If you don't want to accept personalized advertising services, you can turn off management in this product settings.", "label": ["Important", "Edit/Control"], "rewrite": "You can turn off personalized advertising services in this product settings."}
{"task": "rw_70.jsonl", "id": 61574, "text": "You can enter the \"Personal Center\"-click \"Privacy Security\"-click \"Personalized Advertising Management\" to close.", "label": ["Important", "Edit/Control"], "rewrite": "You can click \"Personal Center\"-click \"Privacy Security\"-click \"Personalized Advertising Management\" to close."}
{"task": "rw_70.jsonl", "id": 61575, "text": "If you choose to close, the number of ads you see will not decrease, but you will no longer show you personalized advertisements, and the advertisement you see may be reduced with your preference.", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61576, "text": "Third, the storage of information", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61577, "text": "3.1 Methods, periods, and regions of information storage", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61578, "text": "We will only store your personal information in a safe manner within the time necessary for the service purpose or under the conditions of laws and regulations.", "label": ["Data Retention", "Important"], "rewrite": "Generally, your personal information is stored safely within the time limit for service purposes, unless the law has other requirements."}
{"task": "rw_70.jsonl", "id": 61579, "text": "For example, in accordance with the requirements of the \"Cyber Security Law of the People's Republic of China\", we will retain the relevant network logs related to the Tencent conference application service for not less than six months.", "label": ["Data Retention", "Important"], "rewrite": "In accordance with the requirements of the \"Cyber Security Law of the People's Republic of China\", the use of Tencent's meeting application services to retain related network logs is not less than six months."}
{"task": "rw_70.jsonl", "id": 61580, "text": "After your personal information exceeds the retention period, except for laws and regulations, we will delete or do anonymous processing of your information.", "label": ["Data Retention", "Important"], "rewrite": "After exceeding the storage period, your personal information will be deleted or anonymous, except for other provisions of laws and regulations."}
{"task": "rw_70.jsonl", "id": 61581, "text": "We will store personal information collected in China in China. If we must provide necessary information to the Overseas Edition operating entities of Tencent Conference because of cross -border services, we will take effective measures such as technology and security to ensure your information security.", "label": ["Data Retention", "Important", "Risk"], "rewrite": "The personal information collected and generated in domestic operations will be stored in China. If we need to provide it abroad, we will take measures to ensure your information security."}
{"task": "rw_70.jsonl", "id": 61582, "text": "For data controlled by some enterprises (such as chat records, files, etc.) that can set the retaining period, we will retain relevant information according to the setting of the corporate user;", "label": ["Data Retention", "Important"], "rewrite": "For some enterprise-controlled data that enterprise users can independently set the retention period, it will be retained according to the user's settings."}
{"task": "rw_70.jsonl", "id": 61583, "text": "Without the consent of the right holder, we will not view or use chat records and documents retained by business users.", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61584, "text": "3.2 Notice of the product or service stopping operation", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61585, "text": "When our products or services terminate the operation, we will notify you in the form of push notifications and announcements, and delete your personal information or perform anonymous processing within a reasonable period, except for other provisions of laws and regulations.", "label": ["Important", "Cessation of Operations"], "rewrite": "We will notify you in the form of push notifications and announcements to terminate operations and timely delete or processes your information in a timely manner, except for other provisions of laws and regulations."}
{"task": "rw_70.jsonl", "id": 61586, "text": "Fourth, information security", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61587, "text": "4.1 Safety protection measures", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61588, "text": "We strive to provide protection for users' information security to prevent information leakage, loss, improper use, unauthorized access and disclosure.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61589, "text": "We use multi -directional security protection measures to ensure that user personal information protection is at a reasonable level of security, including technological protection methods, management system control, and security system guarantee.", "label": ["Important", "Data Security"], "rewrite": "Ensure personal information security from many aspects such as technical protection means, management system control, and security system guarantee."}
{"task": "rw_70.jsonl", "id": 61590, "text": "We recommend that enterprise users use export networks that support transmission link encryption to avoid security risks of data theft caused by malicious attacks in intermediate nodes in the network, ensuring that Tencent meetings can effectively guarantee data security for multiple encryption measures including data content and network linksEssence", "label": ["Important", "Data Security"], "rewrite": "It is recommended that enterprise users use export networks that support transmission link encryption."}
{"task": "rw_70.jsonl", "id": 61591, "text": "Index items such as fault recovery capacity, network access performance, service measurement accuracy, user experience performance all meet the requirements of a trustworthy cloud enterprise level, SaaS service special edition requirements.", "label": ["Important", "Data Security"], "rewrite": "The Tencent Conference has obtained a trusted cloud \"Enterprise SaaS Service Certification\"."}
{"task": "rw_70.jsonl", "id": 61592, "text": "The technical protection methods we use include but not limited to firewalls, encryption (such as TLS), de -identification or anonymous treatment, access control measures, etc.", "label": ["Important", "Data Security"], "rewrite": "Use technical protection methods such as firewalls, encryption, de -identification or anonymous treatment, access control measures, and access control measures."}
{"task": "rw_70.jsonl", "id": 61593, "text": "In addition, we will continue to strengthen the security capabilities of software installed on your device.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61594, "text": "For example, we will complete some information encryption work locally to consolidate security transmission.", "label": ["Important", "Data Security"], "rewrite": "Complete some information encryption work locally."}
{"task": "rw_70.jsonl", "id": 61595, "text": "We have established a special management system, process and organization that guarantees personal information security.", "label": ["Important", "Data Security"], "rewrite": "Establish a special management system, processes and organizations that ensure personal information security."}
{"task": "rw_70.jsonl", "id": 61596, "text": "For example, we strictly restrict the scope of personnel access to user information, require them to abide by confidentiality obligations and audit, and punish those who violate obligations in the internal system.", "label": ["Important", "Data Security"], "rewrite": "Strictly restrict the scope of the personnel who access information, and sign a confidentiality agreement with them to punish those who violate the obligations of confidentiality."}
{"task": "rw_70.jsonl", "id": 61597, "text": "We will also review the management system, processes and organizations from time to time to prevent unauthorized personnel from accessing, using or disclosing users' information.", "label": ["Important", "Data Security"], "rewrite": "Try the management system, processes and organizations from time to time to prevent unauthorized access, use or disclose user information."}
{"task": "rw_70.jsonl", "id": 61598, "text": "We recommend that you pay full attention to the protection of personal information when using products and services, and we will also provide as much as possible to provide multiple personal information protection functions to help you protect your personal information.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61599, "text": "4.2 Safety event disposal measures", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61600, "text": "If personal information leakage, damage, loss and other security incidents occur, we will start emergency plans to prevent the expansion of security events.", "label": ["Important", "Data Security"], "rewrite": "We will start emergency plans to deal with information security incidents."}
{"task": "rw_70.jsonl", "id": 61601, "text": "After the security incident occurs, we will inform you the basic situation of the incident in the form of push notifications, emails, telephones, etc. in accordance with the requirements of laws and regulations.", "label": ["Important", "Data Security"], "rewrite": "If a personal information security incident occurs, we will inform your basic situation, possible impact, disposal measures, independent prevention suggestions, etc."}
{"task": "rw_70.jsonl", "id": 61602, "text": "If it is difficult to achieve one by one, we will issue warnings through announcement and other methods.", "label": ["Important", "Data Security"], "rewrite": "If it is difficult to achieve one by one, the warning will be issued through the announcement."}
{"task": "rw_70.jsonl", "id": 61603, "text": "5. The information we share", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61604, "text": "5.1 We follow the provisions of laws and regulations to strictly restrict the sharing of information.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61605, "text": "5.2 In order to enable you to use the Tencent Conference related services conveniently, your information may be shared between the service providers.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61606, "text": "We will use security measures such as encryption, anonymous treatment, and de -identification to ensure your information security.", "label": ["Important", "Data Security"], "rewrite": "Safety protection measures such as encryption, anonymous treatment, and de -identification are used to ensure information security."}
{"task": "rw_70.jsonl", "id": 61607, "text": "Once it involves sharing your sensitive personal information, we will solicit your explicit consent again.", "label": ["Important", "Data Security"], "rewrite": "Once it involves sharing sensitive personal information, we will solicit your explicit consent again."}
{"task": "rw_70.jsonl", "id": 61608, "text": "At present, the Tencent Conference shared your information to a third party for details. For details, please refer to the third -party information sharing list and SDK directory.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For the situation of sharing your information from a third party for details, please refer to the third -party information sharing list and SDK directory."}
{"task": "rw_70.jsonl", "id": 61609, "text": "5.3, with the sustainable development of our business, when transactions such as mergers, acquisitions, and asset transfer cause your personal information to third parties, we will inform you of the relevant situations in the form of push notifications, announcements and other forms, in accordance with laws, regulations and notThe standards required by this privacy protection guideline will continue to protect or require new managers to continue to protect your personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If business mergers, acquisitions, asset transfer and other transactions will be informed of the relevant situation, and it will continue to protect your personal information in accordance with laws and regulations and not lower than the standards required by this guideline."}
{"task": "rw_70.jsonl", "id": 61610, "text": "5.4, we may use the collected information for big data analysis.", "label": ["Important", "Usage"], "rewrite": "Use the collected information for big data analysis."}
{"task": "rw_70.jsonl", "id": 61611, "text": "For example, we may use the collected information to analyze the formation of urban thermal maps or industry insights that do not include any personal information.", "label": ["Important", "Usage"], "rewrite": "The collected information is used to analyze the urban heat map or industry insight report that does not include any personal information."}
{"task": "rw_70.jsonl", "id": 61612, "text": "5.5, in order to put the purpose of advertising, evaluate, optimize the effect of advertising, we need to share some of your data from the advertisers and their agents such as third -party partners, requiring them to strictly abide by our measures and requirements on data privacy protection, includingHowever, it is not limited to processing according to data protection agreements, commitments and related data processing policies to avoid identifying personal identity and ensuring privacy and security.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security", "Usage"], "rewrite": "Share some of your data from third -party partners, asking them to strictly abide by our measures and requirements on data privacy protection."}
{"task": "rw_70.jsonl", "id": 61613, "text": "5.6, we may disclose and share with our partners with information that does not include identity recognition content after statistical processing, to understand how users use our services or let the public understand the overall use trend of our service.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "The information that is disclosed and shared with the partner sharing information that does not include identity recognition is used to understand the usage trend of users' services or let the public understand service."}
{"task": "rw_70.jsonl", "id": 61614, "text": "5.7, we may disclose your personal information based on the following goals:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may disclose your personal information based on the following goals:"}
{"task": "rw_70.jsonl", "id": 61615, "text": "1) Comply with relevant regulations such as applicable laws and regulations, etc.;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Comply with the relevant provisions of applicable laws and regulations to disclose your information."}
{"task": "rw_70.jsonl", "id": 61616, "text": "2) Directly related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Directly related to national security and national defense security, disclose your information."}
{"task": "rw_70.jsonl", "id": 61617, "text": "3) Directly related to public safety and public health;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Discover your information directly related to public safety and public health."}
{"task": "rw_70.jsonl", "id": 61618, "text": "4) Comply with the provisions of criminal investigation, prosecution, court judgment or ruling, and other legal procedures;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Abide by criminal investigation, prosecution, court judgment or ruling, and other legal procedures disclosed your information."}
{"task": "rw_70.jsonl", "id": 61619, "text": "5) Comply with the requirements of relevant government agencies or other legal authorization organizations;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Comply with the requirements of relevant government agencies or other legal authorized organizations to disclose your information."}
{"task": "rw_70.jsonl", "id": 61620, "text": "6) In order to implement the guidance of relevant service agreements or privacy protection, safeguard the public interests of the society, to protect our customers (including you), our or our affiliated companies, other users or employees' personal property safety or other legitimate rights and interests are reasonable and necessarythe use of.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61621, "text": "7) The personal information involved is publicly disclosed to the public by itself;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The information disclosed is made by your own public to the public."}
{"task": "rw_70.jsonl", "id": 61622, "text": "8) Collect personal information from legal public information, such as legal news reports and government information disclosure.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The personal information disclosed is collected from the legal disclosure information."}
{"task": "rw_70.jsonl", "id": 61623, "text": "6. Your rights", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61624, "text": "During your use of Tencent Conference, in order to make you more conveniently inquire about access, delete, and correct your personal information, and at the same time ensure your right to withdraw your personal information and the right to cancel the account, we provide you with corresponding products in the product design.Operation settings, you can refer to the following guidelines for operation.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61625, "text": "In addition, we have set up a channel for feedback, and your opinions will be dealt with in a timely manner.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61626, "text": "6.1 Check and access personal information", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61627, "text": "· Check and access basic information such as WeChat, mobile phone numbers, avatars, names, mailboxes, account equity and other basic information", "label": ["Important", "Edit/Control"], "rewrite": "You have the right to check and access basic information such as WeChat, mobile phone numbers, avatars, names, mailboxes, account equity and other basic information."}
{"task": "rw_70.jsonl", "id": 61628, "text": "1) After entering the Tencent meeting, click on the avatar to enter the \"personal center\";", "label": ["Important", "Edit/Control"], "rewrite": "After entering the Tencent meeting, click the avatar to enter the \"Personal Center\" to conduct information inquiry and access."}
{"task": "rw_70.jsonl", "id": 61629, "text": "2) For information query access.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61630, "text": "· View historical conference", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61631, "text": "1) Enter the Tencent Conference official website https://meeting.tencent.com/, log in with Tencent conference account;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61632, "text": "2) Click \"My Meeting\", select the \"Conference List\" on the left side of the page, and check the historical meeting in the \"Concluding Meeting\".", "label": ["Important", "Edit/Control"], "rewrite": "View historical conference: Use the Tencent meeting account to log in, click \"My Meeting\", select the \"Conference List\" on the left side of the page, and check the historical meeting in the \"Concluding Meeting\"."}
{"task": "rw_70.jsonl", "id": 61633, "text": "· The upcoming meeting list", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61634, "text": "1) Enter the Tencent Conference official website https://meeting.tencent.com/, log in with Tencent conference account;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61635, "text": "2) Click \"My Meeting\", select the \"Meeting List\" on the left side of the page, and check the upcoming meeting in the \"Fitting Meeting\".", "label": ["Important", "Edit/Control"], "rewrite": "View the upcoming meeting: Click \"My Meeting\", select the \"Conference List\" on the left side of the page, and check the upcoming meeting in the \"Fitting Meeting\"."}
{"task": "rw_70.jsonl", "id": 61636, "text": "6.2 Copy, download personal information", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61637, "text": "· Copy, download personal information and equipment information", "label": ["Important", "Edit/Control"], "rewrite": "Copy and download personal information and equipment information: Click the avatar to enter \"Personal Center\", click \"Privacy Security\", click \"Personal Information Download\", fill in the mailbox, and click \"Apply for Personal Information\"."}
{"task": "rw_70.jsonl", "id": 61638, "text": "1) On mobile devices, log in to Tencent Conference and click on the avatar to enter the \"Personal Center\";", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61639, "text": "2) Click \"Privacy Security\";", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61640, "text": "3) Click \"Personal Information Download\";", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61641, "text": "4) After filling in the mailbox, click \"Apply for Send Personal Information\".", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61642, "text": "6.3 Correct personal information", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61643, "text": "· If you are an enterprise end user, you can submit your personal information to your business administrator.", "label": ["Important", "Edit/Control"], "rewrite": "If you are an enterprise ending, you can submit to the business administrator to apply for correction personal information."}
{"task": "rw_70.jsonl", "id": 61644, "text": "If you are a personal user, you can use the following ways to correct personal information.", "label": ["Important", "Edit/Control"], "rewrite": "If you are a personal user, log in to the Tencent Conference on mobile devices and click your avatar to enter the \"Personal Center\"; at the personal center, click the avatar for the avatar and name to change operations; or \"Personal Data\" for related operations."}
{"task": "rw_70.jsonl", "id": 61645, "text": "1) On mobile devices, log in to Tencent Conference and click on the avatar to enter the \"Personal Center\";", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61646, "text": "2) In the personal center, click on the avatar for the avatar and name change operation;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61647, "text": "or", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61648, "text": "Enter the Tencent Conference's official website https://meeting.tencent.com/, and use Tencent Conference account to log in to \"Personal Data\" for related operations.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61649, "text": "6.4 Delete personal information", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61650, "text": "If you think we violate the laws and administrative regulations or deal with your personal information with your agreement, you can contact us through the following ways and ask for deletion of relevant personal information. We will tell you the relevant processing results after verifying the information.Essence", "label": ["Important", "Edit/Control"], "rewrite": "You can contact us in the following ways and ask for deletion of relevant personal information."}
{"task": "rw_70.jsonl", "id": 61651, "text": "1), fill in the personal information protection and privacy issues and contact us;", "label": ["Important", "Edit/Control"], "rewrite": "Fill in personal information protection and privacy issues and contact us."}
{"task": "rw_70.jsonl", "id": 61652, "text": "2), send the demand to dataprivacy@tencent.com;", "label": ["Important", "Contact Information", "Edit/Control"], "rewrite": "Send the demand to the dataprivacy@tencent.com."}
{"task": "rw_70.jsonl", "id": 61653, "text": "3), through, https://kf.qq.com/, contact us;", "label": ["Important", "Contact Information", "Edit/Control"], "rewrite": "Contact us through https://kf.qq.com/."}
{"task": "rw_70.jsonl", "id": 61654, "text": "4), mail to the following address:", "label": ["Important", "Edit/Control"], "rewrite": "Mailing to the following addresses: Data Privacy Protection Department (receiving) of Tencent Binhai Building, No. 33 Haitian Er Road, Nanshan District, Shenzhen, Guangdong Province, Zip Code: 518054."}
{"task": "rw_70.jsonl", "id": 61655, "text": "Tencent Binhai Building, No. 33 Haitian Er Road, Nanshan District, Guangdong Province, China, China, China, China Binhai Building data privacy protection department (closed)", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61656, "text": "Postcode: 518054", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61657, "text": "We will review the issues involved as soon as possible and answer your request within 15 working days or laws and regulations.", "label": ["Important", "Contact Information", "Edit/Control"], "rewrite": "We will review the issues involved as soon as possible and answer within 15 working days or the time limit stipulated by laws and regulations."}
{"task": "rw_70.jsonl", "id": 61658, "text": "If you are an enterprise end user, you can submit your personal information to your business administrator.", "label": ["Important", "Edit/Control"], "rewrite": "If you are an enterprise end user, you can submit your personal information to your business administrator."}
{"task": "rw_70.jsonl", "id": 61659, "text": "6.5 Withdrawal of consent", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61660, "text": "· Withdrawal of authority authorization of iOS/Android system:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61661, "text": "1), iOS system-click Avatar-Privacy Security-Permanent Management-Go to the system settings and close relevant authorization.", "label": ["Important", "Edit/Control"], "rewrite": "Withdrawal of iOS/System permission Agree: iOS system-click Avatar-Privacy Security-Power Management-Go to the system settings and close the relevant authorization; the local network permission authorization status can be set to the system by itself."}
{"task": "rw_70.jsonl", "id": 61662, "text": "Among them, because the iOS system cannot check the local network authority authorization status on the authority management page, you can go to the system to set it yourself.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61663, "text": "2), Android system-click Avatar-Privacy Security-Permanent Management-Go to the System Settings and close relevant authorization.", "label": ["Edit/Control", "Important"], "rewrite": "Withdrawal of the authorized authorization of the Android system: Android system-click Avatar-Privacy Security-Power Management-Go to the system settings and close the relevant authorization."}
{"task": "rw_70.jsonl", "id": 61664, "text": "Please note that when you withdraw consent, we will no longer process the corresponding personal information.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61665, "text": "But your decision to withdraw consent will not affect personal information processing based on your authorization.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Withdrawal authorization will not affect the collection and use of information based on authorization."}
{"task": "rw_70.jsonl", "id": 61666, "text": "6.6 Exit login", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61667, "text": "· Exit Tencent Conference Login", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61668, "text": "1) After entering the Tencent meeting, click on the avatar to enter the \"personal center\";", "label": ["Important", "Edit/Control"], "rewrite": "Visit Tencent Conference Login: After entering the Tencent Conference, click on the avatar to enter the \"Personal Center\" and click \"Exit Login\"."}
{"task": "rw_70.jsonl", "id": 61669, "text": "2) Click \"Exit Login\".", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61670, "text": "6.7 Logging out account", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61671, "text": "· If you are an enterprise end user, you can submit to your business administrator to apply for a cancellation of your corporate account.", "label": ["Important", "Edit/Control"], "rewrite": "If you are an enterprise ending, you can submit to your business administrator to apply for a cancellation of your corporate account."}
{"task": "rw_70.jsonl", "id": 61672, "text": "If you are a personal user, you can use the following ways to cancel the Tencent conference account.", "label": ["Important", "Edit/Control"], "rewrite": "If you are a personal user, you can click on the Tencent Conference on the mobile device, click the avatar to enter the \"personal center\"; click the avatar again, select the \"cancellation account\" on the page, log in to the Tencent meeting account again, click the cancellation account; or click on\"Personal information\", select \"Account Security\", click \"More\"; select \"Logging out\"."}
{"task": "rw_70.jsonl", "id": 61673, "text": "1) On the mobile device, after logging in to the Tencent meeting, click on the avatar to enter the \"personal center\";", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61674, "text": "2) Click on the avatar again, select \"Logging out\" on the page, log in to the Tencent conference account again, click to cancel the account", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61675, "text": "or", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61676, "text": "1) Enter the Tencent Conference official website https://meeting.tencent.com/, log in with Tencent conference account;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61677, "text": "2) Click \"Personal Information\", select \"Account Security\", and click \"More\";", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61678, "text": "3) Select \"Logging out\".", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61679, "text": "After you cancel your account, we will stop providing you with products or services and delete or processes your personal information, except for laws and regulations.", "label": ["Important", "Edit/Control"], "rewrite": "After canceling the account, it will stop providing products or services and delete or processes personal information, except for laws and regulations."}
{"task": "rw_70.jsonl", "id": 61680, "text": "6.8 Feedback of Opinions", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61681, "text": "If you have any questions, opinions, and suggestions on the guidelines of this privacy protection or our service, you can feedback your opinions to us in the following ways:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61682, "text": "1) After entering the Tencent meeting, click on the avatar to enter the \"personal center\";", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61683, "text": "2) Click \"About Us\";", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61684, "text": "3) Click \"Twitter\";", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61685, "text": "4) Click \"I want to speak\";", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61686, "text": "5) Click \"Submit\" to feedback after adding the content.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61687, "text": "Seven, change", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61688, "text": "We may amend the guidelines for privacy protection in a timely manner.", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61689, "text": "When the terms of the guidelines for privacy protection are changed, we will prompt you to the change of privacy protection guidelines in a proper way when the version is updated, and explain the effective date of effectiveness.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61690, "text": "Please carefully read the content of the privacy protection guidelines after the change. You continue to use Tencent Conference to indicate that you agree to handle your personal information according to the updated privacy protection guidelines.", "label": ["Policy Change", "Important", "Risk"], "rewrite": "Continue to use the Tencent meeting to indicate that you agree with the updated privacy protection guidelines."}
{"task": "rw_70.jsonl", "id": 61691, "text": "8. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61692, "text": "Our products, websites, and services are mainly for adults, but we attach great importance to the protection of personal information of minors, and handle personal information of minors strictly in accordance with relevant laws and regulations.", "label": ["Specific Audiences", "Important"], "rewrite": "Our products, websites and services are mainly for adults."}
{"task": "rw_70.jsonl", "id": 61693, "text": "If you are a minor at the age of 14, before using our related services, you should read and agree to the guidance of this privacy protection under the supervision of your guardian (such as your parents).", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a child under the age of 14, please read and agree to the guidance of the privacy protection under the guardian's monitoring and guidance."}
{"task": "rw_70.jsonl", "id": 61694, "text": "In particular, if you are a child under the age of 14, you should provide your personal information after obtaining your guardian's consent and confirming the consent of the privacy protection guidelines and the \"Child Privacy Protection Statement\".", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a child under the age of 14, please provide information after the guardian agrees with the guidance of the privacy protection and the \"Child Privacy Protection Statement\"."}
{"task": "rw_70.jsonl", "id": 61695, "text": "If you are a child's guardian, please pay attention to whether the child you guard with your service uses our service after obtaining your authorization consent.", "label": ["Specific Audiences", "Important"], "rewrite": "The legal guardian is requested to use the service after obtaining your authorization consent."}
{"task": "rw_70.jsonl", "id": 61696, "text": "If you have questions about your personal information of your child, please contact us through contact information in \"contact us\".", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61697, "text": "We only use, provide or need to protect minors, provide or openly disclose the information in the case of laws and regulations, the guardian of minors, or the need to protect minors.", "label": ["Specific Audiences", "Important"], "rewrite": "Only in the case of laws and regulations, the guardian of minors, or the need to protect minors, provide or disclose personal information to the outside world."}
{"task": "rw_70.jsonl", "id": 61698, "text": "If we find that we have collected the personal information of minors in the above range, we will try to delete relevant data as soon as possible.", "label": ["Specific Audiences", "Important"], "rewrite": "If the personal information of minors was collected without the consent of the legal guardian, he would try to delete relevant information as soon as possible."}
{"task": "rw_70.jsonl", "id": 61699, "text": "Nine, others", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61700, "text": "\"Tencent Privacy Policy\" is a general privacy clause for our unified applications of our products and services. Among them, the user rights and information security guarantee measures stipulated in Tencent conferences.", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61701, "text": "When you use the Tencent Conference -related services, such as \"Tencent Privacy Policy\" is inconsistent or contradictory with the guidance of this privacy protection, please refer to the guidance of this privacy protection.", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61702, "text": "\"Child Privacy Protection Statement\" is an information protection rule for children under 14 years of age.", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61703, "text": "Within the scope of the \"Child Privacy Protection Statement\", such as the \"Tencent Privacy Policy\" and the guidance of this privacy protection guidelines, please refer to the \"Child Privacy Protection Statement\".", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61704, "text": "10. Contact us", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61705, "text": "We have set up a special person in personal information protection team and personal information protection person. If you have any questions or complaints on privacy policies or personal information protection related matters (such as correction of personal information, withdrawal consent, etc.), you can pass the followingMethod to contact us:", "label": ["Important", "Contact Information"], "rewrite": "You can contact us in the following way:"}
{"task": "rw_70.jsonl", "id": 61706, "text": "1. You can fill in personal information protection and privacy issues to contact us;", "label": ["Important", "Contact Information"], "rewrite": "You can fill in personal information protection and privacy issues and contact us;"}
{"task": "rw_70.jsonl", "id": 61707, "text": "2. You can send the problem to dataprivacy@tencent.com;", "label": ["Important", "Contact Information"], "rewrite": "You can send the problem to the dataprivacy@tencent.com;"}
{"task": "rw_70.jsonl", "id": 61708, "text": "3. Through, https://kf.qq.com/, contact us;", "label": ["Important", "Contact Information"], "rewrite": "Contact us through https://kf.qq.com/;"}
{"task": "rw_70.jsonl", "id": 61709, "text": "4. Mail your question to the following address:", "label": ["Important", "Contact Information"], "rewrite": "Mail your question to the following address: Data Privacy Protection Department, Tencent Binhai Building, No. 33 Haitian Er Road, Nanshan District, Shenzhen, Guangdong Province, China"}
{"task": "rw_70.jsonl", "id": 61710, "text": "Tencent Binhai Building, No. 33 Haitian Er Road, Nanshan District, Guangdong Province, China, China, China, China Binhai Building data privacy protection department (closed)", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61711, "text": "Postcode: 518054", "label": ["Important", "Contact Information"], "rewrite": "Postcode: 518054"}
{"task": "rw_70.jsonl", "id": 61712, "text": "We will review the issues involved as soon as possible and answer your request within 15 working days or laws and regulations.", "label": ["Important", "Contact Information"], "rewrite": "A reply within 15 working days or laws and regulations."}
{"task": "rw_70.jsonl", "id": 61713, "text": "Shenzhen Tencent Computer System Co., Ltd.", "label": [], "rewrite": []}
{"task": "rw_70.jsonl", "id": 61714, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
