{"task": "rw_78.jsonl", "id": 63722, "text": "download", "label": [], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63723, "text": "https://m.yangshipin.cn/static/protocol_download.html?", "label": [], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63724, "text": "Name =%Brother, a%4%, a%bit of%, a%.%,%,%, 91%,%, p. 90%,%,%, 81%, 4%, in%,%,%,%,%, 4%, 94%, 0%.%A%& Dunllovbeth = Pay%Po -%Avomage.", "label": [], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63725, "text": "Central Video Privacy Protection Policy", "label": [], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63726, "text": "Update date: August 05, 2022", "label": [], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63727, "text": "Effective date: August 05, 2022", "label": [], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63728, "text": "The \"central video\" software (hereinafter referred to as \"this software\") and related services (hereinafter referred to as \"this service\") refersAnd operate and label the client application named \"CCTV\" and the products and services provided by related websites to you.", "label": [], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63729, "text": "We know the importance of personal information to you and do our best to protect your personal information security.", "label": [], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63730, "text": "This privacy protection policy will explain how we will collect and collect information content and how to use your personal information in the process of using this software and related services. Please carefully read and understand before using this software and related servicesThis privacy protection policy.", "label": [], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63731, "text": "The personal information of this privacy policy refers to the various information that can be recorded alone or in combination with other information with electronics or other ways to identify specific natural persons or reflects the activity of specific natural persons, including names, birthdays, identity documents, individuals, individuals, and individualsBiometric information (including fingerprints and facial features), address, communication and communication contact information, account passwords, personal location information, personal common equipment information (including device MAC address, unique device recognition code)List, user nickname, user avatar, etc.", "label": [], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63732, "text": "1. The information we collect", "label": [], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63733, "text": "We will collect the information you actively provide or because of the service when using the service or use the service in the following way, to provide you with services, optimize our services, and ensure your account security:", "label": [], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63734, "text": "1.1, when you register this service, we will collect your device MAC address, unique device recognition code (Device_id, such as: Androidid, device SN (hardware serial number), IMSI, IMEI), to identify you for your service for this service.user.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you register this service, we will collect your device MAC address and unique device recognition code (Device_ID, such as: Androidid, Device SN (hardware serial number), IMSI, IMEI), which is used to identify the users of your service."}
{"task": "rw_78.jsonl", "id": 63735, "text": "If you use QQ, WeChat, Weibo, or mobile phone number to log in to this software, we will collect information such as QQ, WeChat, Weibo, or mobile phone number, avatar, nicknames and other information for preserving your login information to make you allow youYou can synchronize your data when logging in with different devices.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you register this service, we will collect your device MAC address and unique device recognition code (Device_ID, such as: Androidid, Device SN (hardware serial number), IMSI, IMEI), which is used to identify the users of your service."}
{"task": "rw_78.jsonl", "id": 63736, "text": "When you use the function of modifying the avatar, we need to authorize us to access the camera permissions and storage permissions of your device and collect the picture information you uploaded.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "When you use the function of modifying the avatar, we need to authorize us to access the camera permissions and storage permissions of your device and collect the picture information you uploaded."}
{"task": "rw_78.jsonl", "id": 63737, "text": "When you use the central friend circle release function, we need to authorize us to access the camera permissions, album authority, microphone permissions, storage permissions of your device, and collect the pictures or video information you uploaded.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "When you use the central friend circle release function, we need to authorize us to access the camera permissions, album authority, microphone permissions, storage permissions of your device, and collect the pictures or video information you uploaded."}
{"task": "rw_78.jsonl", "id": 63738, "text": "When you use mail -related services, we will collect your address for delivery.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use mail -related services, we will collect your address for delivery."}
{"task": "rw_78.jsonl", "id": 63739, "text": "1.2, when you use this service, we will collect your video playback record so that you can view your viewing history.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use this service, we will collect your video playback record so that you can view your viewing history."}
{"task": "rw_78.jsonl", "id": 63740, "text": "We will also collect the video and channel information you added to the subscription and collection function, so that you can play the video you are interested in more easily and quickly and visit the content you subscribe.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will also collect the video and channel information you added to the subscription and collection function."}
{"task": "rw_78.jsonl", "id": 63741, "text": "Your viewing history, subscription, and collection information will be stored in our server so that you can use the above features when logging in through multiple terminals, you can also delete this information at any client at any time.", "label": ["Data Retention", "Important", "Edit/Control"], "rewrite": "Your viewing history, subscription, and collection information will be stored in our server so that you can use the above features when logging in through multiple terminals, you can also delete this information at any client at any time."}
{"task": "rw_78.jsonl", "id": 63742, "text": "1.3, in order to ensure your normal use of our services and maintain the normal operation of our service (such as push services, content recommendation services, etc.), improve and optimize your service experience and ensure your account security, we will collect your equipment model,The operating system, the unique device recognition code (Device_ID, such as: Androidid, Device SN (hardware serial number), IMSI, IMEI), login IP address, operation log and other information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect information about your device model, operating system, and unique device recognition code (Device_id for example: AndroidID, Device SN (hardware serial number), IMSI, IMEI), login IP address, operation log and other information."}
{"task": "rw_78.jsonl", "id": 63743, "text": "1.4, we or our third -party partners may collect your information through cookies or similar technologies, including your device information, browsing information, click information, and store these information as a log information to provide you with personalized usersExperience and guarantee service security.", "label": ["Data Retention", "Important", "First Party Collection Information"], "rewrite": "We or our third -party partners may collect your information through cookies or similar technologies, including your device information, browsing information, clicking information, and store these information as a log information to provide you with personalized user experience, andSafe service safety."}
{"task": "rw_78.jsonl", "id": 63744, "text": "You can use the use of rejection or management of cookies or similar technologies.", "label": ["Important", "Edit/Control"], "rewrite": "You can use the use of rejection or management of cookies or similar technologies."}
{"task": "rw_78.jsonl", "id": 63745, "text": "At the same time, we may access the software development package (SDK) provided by a third party to ensure the stable operation of central video or realize related functions. For the third -party SDK connected by the central video, see this link for details.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may access the software development package (SDK) provided by a third party to ensure the stable operation of the central video or realize the relevant functions. For the third -party SDK connected by the central video, see this link for details."}
{"task": "rw_78.jsonl", "id": 63746, "text": "1.5, when you use recommendations such as a recommendation browse or personalized recommendation service, we will collect your geographical location information (only iOS client) after obtaining your consent to show you the urban information, information, and the information of the city where the city is located.Provide functions such as local channels and regional recommendation services, showing your geographical location when you publish or dynamic, and obtain comments near your location.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect your geographical location information (only iOS client) after obtaining your consent."}
{"task": "rw_78.jsonl", "id": 63747, "text": "Geographical location information is a sensitive information. Refusing to provide this information will only cause you to be unable to use the regional service or personalized recommendation service you provide, but it does not affect other services provided by your use of this software normally.", "label": ["Important", "First Party Collection Information"], "rewrite": "Geographical location information is a sensitive information. Refusing to provide this information will only cause you to be unable to use the regional service or personalized recommendation service you provide, but it does not affect other services provided by your use of this software normally."}
{"task": "rw_78.jsonl", "id": 63748, "text": "1.6, when you use artificial customer service services, we will collect your nickname, user UID, binding mobile phone number, login method, account registration method, device screen resolution, network environment, network environment, network environment, network environment, network environment after obtaining your consentIdentity with membership and your previous personal information has verified your user identity.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use artificial customer service services, we will collect your nickname, user UID, binding mobile phone number, login method, account registration method, device model, network environment and membership, network environment and membership after obtaining your consentidentity."}
{"task": "rw_78.jsonl", "id": 63749, "text": "At the same time, in order to help you locate and solve the problem, we may also collect your other personal information: contact information (the mobile phone number, mailbox, QQ number you provided with us), and communication records (you and our text or voice records)The channel payment order number (the transaction voucher you provided with us) and the necessary information associated with your needs.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may also collect your other personal information: contact information (your mobile phone number, mailbox, QQ number), communication records (you and our text or voice records), channel payment number (you provide us with us provided us with usTransaction vouchers) and necessary information related to your needs."}
{"task": "rw_78.jsonl", "id": 63750, "text": "1.7 In addition, according to relevant laws and regulations and national standards, in the following situations, we may collect or use your relevant personal information without soliciting your authorization consent:", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "In the following situations, we may collect and use your relevant personal information without asking your authorization consent:"}
{"task": "rw_78.jsonl", "id": 63751, "text": "1) Directly related to national interests such as national security and national defense security;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting personal information directly related to national interests such as national security and national defense security does not need to solicit consent."}
{"task": "rw_78.jsonl", "id": 63752, "text": "Directly related to the major public interests such as public safety, public health, and public knowledge;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect personal information directly related to public safety, public health, and public interest, without asking for consent."}
{"task": "rw_78.jsonl", "id": 63753, "text": "2) Directly related to criminal investigation, prosecution, trial and judgment execution;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect direct personal information related to criminal investigation, prosecution, trial, and execution of judgments without asking for consent."}
{"task": "rw_78.jsonl", "id": 63754, "text": "3) In order to deal with emergencies, or in urgent situations to protect your life, health and property security;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting personal information in response to emergencies, no consent is required."}
{"task": "rw_78.jsonl", "id": 63755, "text": "4) Treatment your own personal information within a reasonable range or other legal disclosure;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Treatment of personal information that has been legally disclosed within a reasonable scope without asking for consent."}
{"task": "rw_78.jsonl", "id": 63756, "text": "5) Signing and fulfilling the contract according to your requirements;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting the personal information necessary for the signing and performing the contract without soliciting consent."}
{"task": "rw_78.jsonl", "id": 63757, "text": "6) The necessary and stable operation of the software or services provided by maintenance, such as discovering and disposing of software or services;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting personal information necessary for the safe and stable operation of maintenance software or services does not need to ask for consent."}
{"task": "rw_78.jsonl", "id": 63758, "text": "7) Implementation news reports and public opinion supervision for public interests use personal information within a reasonable range;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Personal information such as news reports and public opinion supervision is used to implement personal information within a reasonable scope for public interest, and no consent is required."}
{"task": "rw_78.jsonl", "id": 63759, "text": "8) Other circumstances stipulated in laws and regulations.", "label": ["First Party Collection Information", "Risk"], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63760, "text": "Please understand that the functions and services we provide to you are constantly updated and developed. If a function or service is not in the aforementioned and collected your information, we will use page prompts, interactive processes, website announcements, etc.Explain the content, scope and purpose of information collection to you to obtain your consent.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63761, "text": "Please note that when the business development needs to indirectly obtain your personal information from a third party, we will tell you the source, type, and scope of use of personal information before acquisition.The scope of authorization consent when providing personal information to third parties, we will obtain your authorization consent before handling your personal information;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63762, "text": "In addition, we will also strictly abide by the provisions of relevant laws and regulations, and require a third party to ensure the legality of the information provided.", "label": [], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63763, "text": "2. Storage of information", "label": [], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63764, "text": "2.1 Method and period of information storage", "label": [], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63765, "text": "We will store your information in a secure way, including local storage (such as using software for data cache), database and server logs.", "label": ["Data Retention", "Important"], "rewrite": "We will store your information in a secure way, including local storage (such as using software for data cache), database and server logs."}
{"task": "rw_78.jsonl", "id": 63766, "text": "Under normal circumstances, we will only store your personal information within the time necessary for the purpose of service to achieve service purposes or under the conditions of laws and regulations.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "Under normal circumstances, we will only store your personal information within the time necessary for the purpose of service to achieve service purposes or under the conditions of laws and regulations."}
{"task": "rw_78.jsonl", "id": 63767, "text": "You can choose to delete the personal information provided and generated when you use the service when using the service when using this service. If you choose to delete the above information, we will also delete the corresponding personal information accordingly.", "label": ["Important", "Edit/Control"], "rewrite": "You can choose to delete the personal information provided and generated when you use the service when using the service when using this service. If you choose to delete the above information, we will also delete the corresponding personal information accordingly."}
{"task": "rw_78.jsonl", "id": 63768, "text": "After exceeding the necessary storage time, we will delete or processes your personal information.", "label": ["Data Retention", "Important", "Edit/Control"], "rewrite": "After exceeding the necessary storage time, we will delete or processes your personal information."}
{"task": "rw_78.jsonl", "id": 63769, "text": "2.2 The area where information storage", "label": [], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63770, "text": "We will store personal information collected or generated in China in accordance with laws and regulations.", "label": ["Data Retention", "Important"], "rewrite": "We will store personal information collected or generated in China in accordance with laws and regulations."}
{"task": "rw_78.jsonl", "id": 63771, "text": "At present, we will not transmit or store your personal information cross -border.", "label": ["Data Retention", "Important"], "rewrite": "At present, we will not transmit or store your personal information cross -border."}
{"task": "rw_78.jsonl", "id": 63772, "text": "If you need to transmit or store cross -border in the future, we will inform you that the purpose of the information outbound, receiving party, security guarantee measures and security risks, and obtain your consent.", "label": ["Data Retention", "Important"], "rewrite": "If you need to transmit or store cross -border in the future, we will inform you that the purpose of the information outbound, receiving party, security guarantee measures and security risks, and obtain your consent."}
{"task": "rw_78.jsonl", "id": 63773, "text": "2.3 Software or service stops notice when operating", "label": [], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63774, "text": "When our software or services stop operation, we will notify you in the form of pushing notifications and announcements, and delete your personal information or perform anonymous processing within a reasonable period.", "label": ["Important", "Data Security", "Cessation of Operations"], "rewrite": "When our software or services stop operation, we will notify you in the form of pushing notifications and announcements, and delete your personal information or perform anonymous processing within a reasonable period."}
{"task": "rw_78.jsonl", "id": 63775, "text": "3. Information security", "label": [], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63776, "text": "3.1 Safety protection measures", "label": [], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63777, "text": "We strive to provide protection for users' information security to prevent information leakage, loss, improper use, unauthorized access and disclosure.", "label": [], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63778, "text": "We use multi -directional security protection measures to ensure that user personal information protection is at a reasonable level of security, including technological protection methods, management system control, and security system guarantee.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63779, "text": "We use industry -leading technical protection measures.", "label": [], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63780, "text": "The technical means we use include but not limited to firewalls, encryption (such as SSL), de -identification or anonymous treatment, access control measures, etc.", "label": ["Important", "Data Security"], "rewrite": "The technical means we use include but not limited to firewalls, encryption (such as SSL), de -identification or anonymous treatment, access control measures, etc."}
{"task": "rw_78.jsonl", "id": 63781, "text": "In addition, we will continue to strengthen the security capabilities of software installed on your device.", "label": [], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63782, "text": "For example, we will complete some information encryption work locally to consolidate security transmission;", "label": ["Important", "Data Security"], "rewrite": "We will complete some information encryption work locally to consolidate security transmission."}
{"task": "rw_78.jsonl", "id": 63783, "text": "We will understand the application information and running process information installed by your device to prevent malicious programs such as viruses and Trojans.", "label": ["Important", "Data Security"], "rewrite": "We will understand the application information and running process information installed by your device to prevent malicious programs such as viruses and Trojans."}
{"task": "rw_78.jsonl", "id": 63784, "text": "We have established a special management system, process and organization that guarantees personal information security.", "label": ["Important", "Data Security"], "rewrite": "We have established a special management system, process and organization that guarantees personal information security."}
{"task": "rw_78.jsonl", "id": 63785, "text": "For example, we strictly restrict the scope of the personnel of access to information, require them to abide by the obligations of confidentiality, personnel who violate the obligations will impose punishment in accordance with regulations, and regularly conduct security education and training on them.", "label": ["Important", "Data Security"], "rewrite": "We strictly restrict the scope of the personnel who access information, ask them to obey the confidentiality obligations, and personnel who violate the obligations will impose punishment in accordance with regulations, and regularly conduct security education and training on them."}
{"task": "rw_78.jsonl", "id": 63786, "text": "We will also review the management system, process and organization to prevent unauthorized personnel from accessing, using or disclosing users' information.", "label": ["Important", "Data Security"], "rewrite": "We will also review the management system, process and organization to prevent unauthorized personnel from accessing, using or disclosing users' information."}
{"task": "rw_78.jsonl", "id": 63787, "text": "We recommend that you pay full attention to the protection of personal information when using software and services, and we will also provide multiple security functions to help you protect your personal information security.", "label": [], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63788, "text": "3.2 Safety event disposal measures", "label": [], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63789, "text": "If personal information leakage, damage, loss and other security incidents occur, we will start emergency plans to prevent the expansion of security events.", "label": ["Important", "Data Security"], "rewrite": "If personal information leakage, damage, loss and other security incidents occur, we will start emergency plans to prevent the expansion of security events."}
{"task": "rw_78.jsonl", "id": 63790, "text": "After the safety incident, we will timely inform you the basic situation of the security incident in the form of push notifications and issuance announcements, we are about to or we have already taken, and we will deal with your proposals.", "label": ["Important", "Data Security"], "rewrite": "After the safety incident, we will timely inform you the basic situation of the security incident in the form of push notifications and issuance announcements, we are about to or we have already taken, and we will deal with your proposals."}
{"task": "rw_78.jsonl", "id": 63791, "text": "If it is difficult to achieve one by one, we will issue warnings through announcement and other methods.", "label": ["Important", "Data Security"], "rewrite": "If it is difficult to achieve one by one, we will issue warnings through announcement and other methods."}
{"task": "rw_78.jsonl", "id": 63792, "text": "4. How do we use information", "label": [], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63793, "text": "We strictly abide by the provisions of laws and regulations and the agreement with users, and provide you with better services in accordance with the information described in this privacy protection policy.", "label": [], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63794, "text": "For sensitive personal information, including biometrics, specific identities, financial accounts, and whereabouts, etc., And take reasonable protection measures in accordance with the law.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "For the sensitive personal information collected during the service process, we will obtain your separate consent to inform you that the necessity of handling sensitive personal information and the impact on personal rights and interests will be taken in accordance with the law."}
{"task": "rw_78.jsonl", "id": 63795, "text": "4.1 Information use rules", "label": [], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63796, "text": "We will use the collected information according to the following rules:", "label": [], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63797, "text": "1) We will provide you with various functions and services according to the information we collect, including video recommendations, video playback, online TV, online live broadcast, interactive reviews and information release;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63798, "text": "2), we will provide you with personalized services based on your browsing preferences, habits, location information and other characteristics, including indirect portrait portraits based on feature labels and recommend the content and activities you might be interested in, show you moreAdvertising or other promotion content of correlation, optimize the experience of personalized services, and evaluate and improve the effects of advertising and other promotion activities;", "label": ["Important", "Usage"], "rewrite": "We will provide you with personalized services based on your browsing preferences, habits, location information and other characteristics, including indirect crowd portraits based on feature labels and recommend content and activities you may be interested in."}
{"task": "rw_78.jsonl", "id": 63799, "text": "Automated decision -making refers to activities that automatically analyze, evaluate personal behavior, hobbies, and make decisions through computer programs.", "label": ["Important", "Usage"], "rewrite": "Automated decision -making refers to activities that automatically analyze, evaluate personal behavior, hobbies, and make decisions through computer programs."}
{"task": "rw_78.jsonl", "id": 63800, "text": "At the same time, we will provide a convenient operation method for you to choose whether to accept or refuse the above -mentioned personalized services.", "label": ["Edit/Control", "Usage", "Important"], "rewrite": "We will provide a convenient way to operate for you to choose whether to accept or refuse the above -mentioned personalized services."}
{"task": "rw_78.jsonl", "id": 63801, "text": "You can use the path: Mine-Settings-Privacy Permanent Settings-Allow central video personalized recommendation content to find and control whether to open personalized recommendation services.", "label": ["Edit/Control", "Important"], "rewrite": "You can use the path: Mine-Settings-Privacy Permanent Settings-Allow central video personalized recommendation content to find and control whether to open personalized recommendation services."}
{"task": "rw_78.jsonl", "id": 63802, "text": "3) We will analyze the operation of our software based on the frequency and situation of this software, fault information, and performance information based on your software to ensure the security of the service, and optimize our software and improve our service quality.", "label": ["Important", "Data Security"], "rewrite": "We will analyze the operation of our software based on the frequency and situation of this software, fault information, performance information, etc. to ensure the security of the service, optimize our software, and improve our service quality."}
{"task": "rw_78.jsonl", "id": 63803, "text": "We will not combine the information we store in the analysis software with the personal identity information you provide.", "label": ["Important", "Data Security"], "rewrite": "We will not combine the information we store in the analysis software with the personal identity information you provide."}
{"task": "rw_78.jsonl", "id": 63804, "text": "4.2 Rules for directional push activities", "label": [], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63805, "text": "We will push directed in accordance with the following rules and provide you with a corresponding exit mechanism:", "label": [], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63806, "text": "1), we will provide you with personalized promotion content based on the characteristics of your viewing records, browsing preferences, such as recommending videos that meet your preferences.", "label": ["Important", "Usage"], "rewrite": "We will provide you with personalized promotion content based on your viewing records and browsing preferences."}
{"task": "rw_78.jsonl", "id": 63807, "text": "You can reducing the correlation with you by deleting viewing history;", "label": ["Edit/Control", "Usage", "Important"], "rewrite": "You can reducing the correlation with you by deleting viewing history to reduce the recommendation content."}
{"task": "rw_78.jsonl", "id": 63808, "text": "2) We will show you advertisements based on the characteristics of your viewing records and browsing preferences.", "label": ["Important", "Usage"], "rewrite": "We will show you advertisements based on the characteristics of your viewing records and browsing preferences."}
{"task": "rw_78.jsonl", "id": 63809, "text": "4.3 The way to obtain consent after notifying the purpose of the change", "label": [], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63810, "text": "We will use the collected information in the use of privacy protection policies.", "label": [], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63811, "text": "If we use your personal information, which exceeds the purpose and scope of direct or reasonable correlation with the purpose of the time of collection, we will tell you and obtain your explicit consent again before using your personal information.", "label": ["Important", "Usage"], "rewrite": "If we use your personal information, which exceeds the purpose and scope of direct or reasonable correlation with the purpose of the time of collection, we will tell you and obtain your explicit consent again before using your personal information."}
{"task": "rw_78.jsonl", "id": 63812, "text": "4.4 The necessary goodwill use", "label": [], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63813, "text": "You agree to disclose or use your personal information in the following situation:", "label": ["Usage", "Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63814, "text": "1) During your use of this software, we can use these information for non -profit uses when the original data is processed with information;", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "During your use of this software, we can use these information for non -profit uses when information disclosure processing of your original data."}
{"task": "rw_78.jsonl", "id": 63815, "text": "2) When we are forced by the judicial organs or law enforcement agencies, or need to provide your information when the right holder is required for identifying the requirements of suspected infringements, we will disclose your information in good faith;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When we are forced by the judicial organs or law enforcement agencies, or need to provide your information when the right holder is required to identify the requirements of suspected infringements, we will disclose your information in good faith."}
{"task": "rw_78.jsonl", "id": 63816, "text": "3) If we intend to conduct corporate mergers and acquisitions, reorganization, all or some shares and/or assets, we have the right to disclose your information to it with the premise of signing a confidentiality agreement with the relevant parties of the aforementioned transactionTrading, we will inform you the name, purpose, method, type, and period of time of the information sharing of the information sharing in advance and its personal information.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63817, "text": "4) The situation of goodwill stipulated in other laws.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63818, "text": "5. Provide outside", "label": [], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63819, "text": "At present, we will not take the initiative to share or transfer your personal information to a third party other than the central video, such as other sharing or transfer your personal information or you need us to share or transfer your personal information toIn the third party situation, we will directly confirm the authorization consent or confirm your consent of the above behavior.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not take the initiative to share or transfer your personal information to a third party other than the central video, such as other sharing or transfer your personal information or you need us to share or transfer your personal information to a third party outside the central videoIn the case, we will directly confirm the authorization consent or confirm your consent of the above behavior."}
{"task": "rw_78.jsonl", "id": 63820, "text": "You can learn about the situation of our access to third -party SDKs and information sharing by checking the \"Central Video Third -Party SDK Catalog\" and \"List of C every Video Information\".", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You can learn about the situation of our access to third -party SDKs and information sharing by checking the \"Central Video Third -Party SDK Catalog\" and \"List of C every Video Information\"."}
{"task": "rw_78.jsonl", "id": 63821, "text": "We will not publicly disclose the personal information collected to the outside world. If we must disclose it publicly, we will tell you the purpose of the public disclosure, the type of disclosure information, and the possible sensitive information that may be involved, and obtain your explicit consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not publicly disclose the personal information collected to the outside world. If we must disclose it publicly, we will tell you the purpose of the public disclosure, the type of disclosure information, and the possible sensitive information that may be involved, and obtain your explicit consent."}
{"task": "rw_78.jsonl", "id": 63822, "text": "With the sustainable development of our business, we may conduct transactions such as mergers, acquisitions, and asset transfer. We will inform you that the relevant situation will continue to protect or request new control in accordance with the laws and regulations and the standards required by the privacy protection policy.Continue to protect your personal information, and inform you that the name, purpose, method, type, and period of time of processing your personal information and the scene of personal information are notified in advance.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63823, "text": "In addition, in accordance with relevant laws and regulations and national standards, in the following situations, we may share, transfer, and openly disclose personal information without obtaining your authorization consent in advance:", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "In the following circumstances, we may share, transfer, and publicly disclose personal information without obtaining your authorization consent in advance:"}
{"task": "rw_78.jsonl", "id": 63824, "text": "1) Directly related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Personal information directly related to national security and national defense security does not need to solicit consent."}
{"task": "rw_78.jsonl", "id": 63825, "text": "2) Directly related to public safety, public health, and major public interests;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Personal information directly related to public safety, public health, and direct public interests does not need to solicit consent."}
{"task": "rw_78.jsonl", "id": 63826, "text": "3), directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Direct related personal information such as sharing with criminal investigation, prosecution, trial and judgment execution does not need to solicit consent."}
{"task": "rw_78.jsonl", "id": 63827, "text": "4) In order to cope with emergencies, or in urgent situations, it is necessary to protect the health and property security of natural people;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "The personal information necessary for sharing to respond to emergencies does not require consent."}
{"task": "rw_78.jsonl", "id": 63828, "text": "5), implement news reports and public opinion supervision for public interests, and handle personal information within a reasonable range;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "In order to implement news reports and public opinion supervision, deal with personal information within a reasonable scope without soliciting consent."}
{"task": "rw_78.jsonl", "id": 63829, "text": "6) Treatment your own personal information within a reasonable scope in accordance with relevant laws or other legal disclosure;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "In accordance with relevant laws, handle personal information that has been legally disclosed within a reasonable scope without asking for consent."}
{"task": "rw_78.jsonl", "id": 63830, "text": "7) Other circumstances stipulated in laws and regulations;", "label": ["Third Party Sharing/ Disclosure", "Risk"], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63831, "text": "6. Your rights", "label": [], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63832, "text": "During your use of this service, in order to make you more conveniently check, delete, correct/modify, and withdraw authorization of your personal information, we set up feedback channels, and your opinion will be dealt with in time.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63833, "text": "We also set up the function of canceling the account and promise anonymous processing or deletion of your personal information after you cancel your account. For details, please refer to the \"Central Video Account Logging out\" of the \"Central Video\" client application.", "label": ["Edit/Control", "Data Security", "Important"], "rewrite": "We also set up the function of canceling the account and promise anonymous processing or deletion of your personal information after you cancel your account. For details, please refer to the \"Central Video Account Logging out\" of the \"Central Video\" client application."}
{"task": "rw_78.jsonl", "id": 63834, "text": "7. Change", "label": [], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63835, "text": "We may amend the privacy protection policy in a timely manner.", "label": [], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63836, "text": "When the terms of the privacy protection policy are changed, we will prompt you the change of privacy protection policy when the version is updated.", "label": [], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63837, "text": "Please carefully read the content of the privacy protection policy after the change, and confirm whether it is agreed to continue using this service.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63838, "text": "8. Minor protection", "label": [], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63839, "text": "We attach great importance to the protection of personal information of minors.", "label": [], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63840, "text": "If you are a minor under the age of 18, before using our services, you should jointly read this privacy policy under the guardian's guardianship and guidance and use our services under the consent and guidance of the guardian to submit personal information.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63841, "text": "We only use, provide or need to protect minors, provide or openly disclose the information in the case of laws and regulations, the guardian of minors, or the need to protect minors.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Important"], "rewrite": "We only use, provide or need to protect minors, provide or openly disclose the information in the case of laws and regulations, the guardian of minors, or the need to protect minors."}
{"task": "rw_78.jsonl", "id": 63842, "text": "If you are the guardian of the minor, please pay attention to whether the minor you guarded with your authorization consent will use this service.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63843, "text": "If you have doubts about the personal information of the minors you monitor, please contact us through the contact information in Article 10.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63844, "text": "9. Others", "label": [], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63845, "text": "The \"Central Video Privacy Protection Policy\" is a general privacy clause for the unified application of central video. Among them, the user rights and information security guarantee measures specified in are applicable to users of this service.", "label": [], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63846, "text": "10. Contact us", "label": [], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63847, "text": "When you have any questions, suggestions or needs for this privacy policy, you can send your question to service@yangshipin.cn or contact us through the feedback window of this software user. After verifying your identityDo your problem in time.", "label": ["Important", "Contact Information"], "rewrite": "You can send your question to service@yangshipin.cn or contact us through this software user feedback window."}
{"task": "rw_78.jsonl", "id": 63848, "text": "After receiving your question, we will answer you within 15 working days.", "label": [], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63849, "text": "At the same time, you understand and know that when the following situations are involved, we may not be able to respond to your request:", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "In the following situations, we may not be able to respond to your request:"}
{"task": "rw_78.jsonl", "id": 63850, "text": "(1) Related to national security and national defense security;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Requesting the request with national security and national defense security cannot be responded."}
{"task": "rw_78.jsonl", "id": 63851, "text": "(2) Related to public safety, public health, and major public interests;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "If it is related to public safety, public health, and major public interests, the request cannot be responded."}
{"task": "rw_78.jsonl", "id": 63852, "text": "(3) Related to crime investigation, prosecution, trial, and execution judgment;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "It cannot be responded to the request that is related to criminal investigation, prosecution, trial, and execution judgment."}
{"task": "rw_78.jsonl", "id": 63853, "text": "(4) There is sufficient evidence that you have subjective malice or abuse of rights;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "If there is sufficient evidence that you have subjective malicious or abuse of rights, you cannot respond to the request."}
{"task": "rw_78.jsonl", "id": 63854, "text": "(5) Response your request will cause the legitimate rights and interests of you or other individuals and organizations to be seriously damaged;", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "In response to your request, if the legitimate rights and interests of you or other individuals and organizations are seriously damaged, the request cannot be responded."}
{"task": "rw_78.jsonl", "id": 63855, "text": "(6) Involved in business secrets;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Those who involve business secrets cannot respond to requests."}
{"task": "rw_78.jsonl", "id": 63856, "text": "(7) Other circumstances stipulated in laws and regulations.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "In other circumstances stipulated in laws and regulations, the request cannot be responded."}
{"task": "rw_78.jsonl", "id": 63857, "text": "11. Others", "label": [], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63858, "text": "This privacy protection policy is an indiscriminate part of the \"Central Video Platform Creator Platform Service Agreement\" and \"COSACS Software License and User Service Agreement\".", "label": [], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63859, "text": "The legal applications and judicial jurisdictions on privacy protection policies, the relevant agreement of the \"Central Video Platform Service Agreement\" or the relevant agreement of the \"Creator Platform Service Agreement\" of the Creator Platform of the Creative Video Booth Corporation is consistent with the consistency.", "label": [], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63860, "text": "historic version", "label": [], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63861, "text": "CCTV Privacy Protection Policy 2022-04-08", "label": [], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63862, "text": "Check", "label": [], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63863, "text": "CCTV Privacy Protection Policy 2021-08-26", "label": [], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63864, "text": "Check", "label": [], "rewrite": []}
{"task": "rw_78.jsonl", "id": 63865, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
